{
    "selfpaced": true, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    Environmental law may be the one institution standing between us and planetary exhaustion. It is also an institution that needs to be reconciled with human liberty and economic aspirations. This course considers these issues and provides a tour though existing legal regimes governing pollution, water law, endangered species, toxic substances, environmental impact analyses, and environmental risk.\n\n                                            Syllabus\n                        Common-Law Approaches to Environmental ProblemsAs the course does not presume any previous knowledge of the law or legal experience, it begins by teaching students how to “read” cases, to learn from judicial opinions in real-life disputes how judges articulate and apply legal principles. We focus on the law of nuisance, starting with cases involving simple disputes between neighbors, and then move to cases involving air and water pollution and even a very recent case on the introduction of exotic species into a river system! We end the week, as we’ll end every week, with a session spent on legal theory and policy, considering, this week, the relative strengths and weakness of the court system as an institution addressing environmental problems, in comparison to other institutions such as administrative regulators and the free-market system.Property and the EnvironmentIt’s impossible to understand environmental law without also understanding the important role that private property plays in people’s lives and the way in which property law recognizes these values. After using two cases involving property rights to water to introduce ourselves to property law, we’ll use the American constitutional approach to “takings” of property to determine when governments are forced to pay property-holders when environmental requirements infringe too much on private property rights. These cases are at the crux of an evolving philosophical dispute between whether we look at land merely as a personal commodity or as part of larger ecosystems that, often, demand recognition and require changes in personal behavior. In our “theory” session, we’ll introduce ourselves to a very powerful and famous economic model, the tragedy-of-the-commons model, that explains why markets often cannot adequately protect commonly held resources such as the oceans and atmosphere, and how legal regimes may be needed to correct the problem. We also post this week a peer-review essay exercise, which is mandatory for students wishing to obtain a Statement of Accomplishment with Distinction.Two Famous Statutory Programs: Environmental Impact Analysis and Endangered-Species ProtectionThis week we start with perhaps the most influential American environmental statute ever enacted, the National Environmental Policy Act (\"NEPA\"), and its requirement for environmental impact analysis of certain actions that might significantly affect the environment. Over 70 countries have enacted programs similar to this one. Then, we study perhaps the strongest American environmental statute ever enacted, the federal Endangered Species Act (“ESA”) and study cases under the ESA that are, among other things, at the cutting edge in the tension between private property and environmental protection. In our theory session, we begin to discuss issues of politics and political economy, and consider a range of topics in the political economy of environmental law.Risk Analysis and Toxic Substances: Pesticides, Trade Disputes over Synthetic Hormones, and the Cleanup of Contaminated SitesThis week we shift from land-use-related issues to the central role that “risk” plays in the regulation of toxic substances, pollution-control, and environmental law generally. We begin with an analysis of a regulatory decision involving 2,4,5-T, the active ingredient in herbicides (and in the notorious “Agent Orange” herbicide used by the United States in the Vietnam War), and learn how concerns over the “risk” of harm amplify the power of environmental law. We then analyze the role risk played in an ongoing dispute between the United States and Canada (on the one hand) and the European Community (on the other) over synthetic growth hormones given to cattle in North America. We shift to considerations of risk in the clean-up of sites contaminated with hazardous substances under a famous American statute, the so-called “Superfund” statute. in our theory session, we look at two economic dimensions of risk that explain why people rationally concern themselves with worst-case possibilities and also concern themselves with how risk is fairly (or unfairly) distributed.Environmental Justice, Water Pollution, Claims to a Human Right to Drinking Water, Fracking, and Insights from an Economic Model of Regulatory Cost-EffectivenessThis week, we pivot mostly into issues involving fresh water and water pollution, but not before continuing our discussion of risk distribution by exploring further the concept of environmental justice. We start with legal approaches to transboundary shipments of waste, using both the United States and international trade as case histories, using both examples to illustrate the challenge posed to environmental law by claims of environmental racism and injustice. Shifting to drinking water, we introduce ourselves to the American Safe Drinking Water Act and to recent United Nations measures articulating a human right to drinking water, and also consider the worldwide phenomenon of hydraulic fracturing (“fracking”) and its intersection with fresh water resources. We introduce ourselves to the technology-based regulatory design of the American Clean Water Act. In our theory session, we explore the concept of economic cost-effectiveness and its role in pollution-control regimes generally and in the Clean Water Act in particular. We also see how this concept explains some of the interest in the design of “markets” for pollution control. This is also a week in which we post a research exercise, especially relevant for those interested in obtaining a Statement of Accomplishment with Distinction.Pollution, Climate Change and Course ConclusionThis week, we continue discussing aspects of water-quality regulation, including especially elements other than the technology-based systems in the American Clean Water Act. We then shift to air-pollution control, not only introducing the environmental-quality-based philosophy of this landmark statute, but also explaining how it coordinates with common-law approaches to pollution that we studied at the very beginning of the course. We then introduce ourselves to the dawning era of greenhouse-gas regulation under both the Clean Air Act and embryonic international climate-change efforts. In our theory session, we highlight the strengths and weaknesses overall of current systems of environmental law, and underscore the need for more effective, more insightful, and more resilient systems.(Optional) Research ExerciseThis module is optional.\n                                    ", 
    "end_date": "2015-02-23T00:00:00Z", 
    "title": "Introduction to Environmental Law and Policy", 
    "price": 0, 
    "instructors": "Don Hornstein", 
    "institution_name": [
        "The University of North Carolina at Chapel Hill"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/environmental-law", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-01-12T00:00:00Z"
}