{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    Ce cours propose une introduction à la protection internationale des droits de l’homme. Il en présente les sources, les catégories, le contenu et les limites qui leur sont opposables, ainsi que les obligations qu’ils génèrent à la charge des Etats. Il expose aussi les principaux mécanismes de mise en œuvre prévus au niveau universel et régional pour assurer leur respect. \n\nDepuis la fin de la Seconde Guerre mondiale, les droits de l’homme sont un domaine en plein essor. De nombreuses causes sont aujourd’hui défendues et débattues sous la bannière des droits de l’homme : la protection des minorités, la lutte contre la discrimination des femmes, des personnes lesbiennes, gaies, bisexuelles et transgenres (LGBT), la lutte contre la torture et les disparitions forcées, la lutte contre la pauvreté ou encore la protection de l’environnement et la protection des données. Partout dans le monde, ces causes mobilisent tant les acteurs politiques que la société civile et elles sont discutées dans de multiples enceintes, nationales et internationales.\n\nLe présent cours vise à offrir les bases nécessaires pour appréhender et comprendre le domaine vaste et complexe que sont devenus les droits de l’homme. Quelles sont les caractéristiques et les différentes catégorie des droits de l’homme ? Quels sont leurs fondements philosophiques et historiques ? Pourquoi ces droits sont-ils importants ? Quels instruments visent à les protéger ? Comment rendre ces droits opérationnels ? Quels mécanismes existent pour les mettre en œuvre et quels sont leurs avantages et leurs inconvénients ?\n\nEn abordant ces questions, le cours s’adresse tant à des membres de la communauté universitaire qu’à des praticiens (responsables politiques, membres du corps diplomatique, fonctionnaires, journalistes, membres d’ONG, défenseurs des droits de l’homme et spécialistes de la coopération au développement, de l’aide humanitaire et des questions relatives aux réfugiés), ainsi qu’à toutes les personnes qui sont engagées dans la protection des droits de l’homme ou simplement désireuses de mieux comprendre ce phénomène.\n\nLe cours est conçu et dispensé par les Professeurs Maya Hertig Randall et Michel Hottelier, de la Faculté de droit de l’Université de Genève. Durant le cours, des membres d’organes et institutions voués à la protection des droits de l’homme et des spécialistes de la communauté académique seront invités à intervenir.\n\nLe cours est donné en français. Il consiste en une série de 8 sessions, comprenant chacune un certain nombre de brèves présentations vidéo (8 à 15 minutes). Chaque session s'accompagne d'un questionnaire d'évaluation. Des lectures préparatoires sont requises pour chaque session.\n\n                                            Syllabus\n                        Semaine 1La première partie du cours de cette semaine clarifiera la notion et les caractéristiques des droits de l'homme. La deuxième initiera les étudiant(e)s aux fondements philosophiques des droits de l'homme. Une importance particulière sera accordée à la dignité humaine, sa signification, sa concrétisation et son évolution. La troisième partie tracera dans les grandes lignes l'émergence et l'évolution des droits humains au niveau national. Le cours poursuivra cinq objectifs principaux : (1) relever les caractéristiques et spécificités des droits de l'homme, (2) familiariser les étudiant(e)s avec les valeurs fondatrices des droits de l'homme, (3) les initier aux concepts de la dignité humaine, sa concrétisation et son évolution, (4) montrer aux étudiant(e)s la dimension historique des droits de l'homme en leur enseignant les principales étapes ayant conduit à l'émergence des droits de l'homme au niveau national, (5) montrer aux étudiant(e)s l'ancrage des droits de l'homme dans différentes cultures.Semaine 2Le cours présentera dans les grandes lignes l'émergence des droits de l'homme au niveau international. Il familiarisera les étudiant(e)s avec les précurseurs de la protection internationale des droits de l'homme, en donnant un aperçu des principales institutions de droit international qui ont préparé le terrain à la consécration des droits de l'homme par l'ordre juridique international. Deux de ces précurseurs, le droit international humanitaire et le droit pénal international, seront abordés au travers d'entretiens avec des intervenants externes.\n\nLe cours permettra aux étudiant(e)s de :(1) comprendre le défi qu'a représenté l'internationalisation des droits de l'homme compte tenu de la conception dominante du droit international durant la première moitié du 20ème siècle ;(2) avoir une vision plus large des institutions du droit international qui visent à protéger la personne humaine et ont un rôle complémentaire par rapport aux droits de l'homme ;(3) comprendre les différences et les affinités entre les droits de l'homme d'une part, et le droit international humanitaire et le droit pénal international d'autre part, ainsi que les rapports entre ces différents corps de droit ;(4) connaître les principales étapes de l'internationalisation des droits de l'homme. De façon plus générale, le cours donnera aux participant(e)s des éléments nécessaires pour comprendre, et évaluer de façon critique, les acquis et déficiences du système contemporain de protection internationale des droits de l'homme.Semaine 3Le cours de cette semaine exposera les sources des droits de l'homme dans une perspective juridique. Il précisera et approfondira, dans le sillage des cours précédents, le siège normatif des droits de l'homme, l'articulation entre ces derniers et les droits fondamentaux d'origine nationale, ainsi que certains des problèmes que pose la coexistence de ces garanties. Le cours poursuivra trois objectifs :\n(1) familiariser les étudiants avec les sources juridiques des droits de l'homme ;\n(2) identifier et apprendre à résoudre les problèmes générés par la coexistence des droits fondamentaux et des droits de l'homme ;\n(3) exposer, puis souligner l'importance qui revient au contrôle international du respect des droits de l'homme. Semaine 4Le présent cours initiera les étudiant(e)s à la typologie classique des droits de l'homme qui consiste à distinguer trois « générations » de droits. Il sera lui-même divisé en trois parties. La première partie présentera successivement chaque « génération » et donnera un aperçu des droits qui en font partie et des instruments qui les consacrent. La deuxième partie sera consacrée à une critique du classement générationnel des droits de l'homme. Elle mettra en exergue les enjeux idéologiques, juridiques et politiques de la typologie et exposera les tendances contemporaines visant à dépasser une compartimentation jugée excessivement rigide. La troisième partie abordera, à travers les interviews de deux experts académiques, la question de la pertinence contemporaine de la classification ternaire des droits de l'homme. Les objectifs poursuivis par ce cours sont au nombre de quatre :\n(1) offrir aux étudiant(e)s un aperçu des divers droits garantis dans les instruments internationaux voués à la protection des droits de l'homme ;\n(2) familiariser les étudiant(e)s avec la classification classique des droits de l'homme en trois générations ;\n(3) leur permettre de comprendre les enjeux idéologiques, politiques et juridiques de la classification générationnelle qui continuent de marquer les débats contemporains ;\n(4) les introduire à la théorie de l'indivisibilité des droits de l'homme. Semaine 5Cette partie du cours aborde la question des effets juridiques des droits de l'homme. En vertu d'une évolution qui leur est propre, les droits de l'homme, tels qu'ils résultent de la typologie et de l'autonomie qui les caractérisent, déploient de nos jours des effets pluriels. Combinés dans une perspective de complémentarité (et non d'exclusion), ces effets sont porteurs d'un faisceau d'obligations parfois complexes. Celles-ci ne lient plus seulement les autorités et organes étatiques, mais sont parfois susceptibles de gouverner également les rapports des particuliers entre eux. Cette vision évolutive des droits de l'homme permet également d'aborder les perspectives nouvelles relatives à la mise en œuvre de ces droits. Le cours poursuivra trois objectifs :\n(1) exposer les effets des droits de l'homme en droit contemporain ;\n(2) évoquer l'évolution que ces effets ont subie ;\n(3) souligner l'originalité liée à l'autonomie des droits de l'homme, ainsi que les perspectives nouvelles de leur champ d'application.Semaine 6L'exercice des droits de l'homme peut entrer en conflit avec des intérêts de la collectivité ou avec d'autres droits. De ce fait, les droits de l'homme ne sont en règle générale pas des prérogatives absolues et peuvent subir des limitations. Pour éviter que les limites ne vident les droits de l'homme de leur substance, l'ordre juridique prévoit des « limites aux limites », en posant des conditions précises auxquelles ces limitations sont subordonnées pour être admises. Le présent cours familiarisera les étudiant(e)s avec trois différents types de limites et expliquera leur finalité, les conditions de leur application et leur pertinence pratique au travers de trois exemples concrets inspirés de la jurisprudence de la Cour européenne des droits de l'homme. Le présent cours permettra aux étudiant(e)s de :\n(1) connaître les différents types de limites qui permettent de concilier les droits de l'homme avec d'autres droits et intérêts concurrents ;\n(2) acquérir une méthodologie pour déterminer si l'Etat a limité les droits de l'homme de façon justifiée, ou, à l'inverse, s'il les a violés ;\n(3) avoir les outils nécessaires pour analyser de façon critique et avisée la jurisprudence ou, plus largement, les débats, en matière de droits de l'homme, qui portent dans de nombreux cas sur une problématique liée à leur limitation. Semaine 7Ce cours abordera la présentation des divers mécanismes de mise en œuvre des droits de l'homme. La mise en œuvre des droits de l'homme étant un sujet très évolutif, l'exposé comprendra également une partie consacrée aux nouvelles perspectives qui se dessinent en ce domaine. Le cours des semaines 7 et 8 poursuit trois objectifs :\n(1) exposer les mécanismes internationaux de mise en œuvre des droits de l'homme ;\n(2) évoquer leurs rapports, leurs avantages et leurs inconvénients respectifs ;\n(3) tracer quelques perspectives d'évolution. Semaine 8Ce cours abordera la présentation des divers mécanismes de mise en œuvre des droits de l'homme. La mise en œuvre des droits de l'homme étant un sujet très évolutif, l'exposé comprendra également une partie consacrée aux nouvelles perspectives qui se dessinent en ce domaine. Le cours des semaines 7 et 8 poursuit trois objectifs :\n(1) exposer les mécanismes internationaux de mise en œuvre des droits de l'homme ;\n(2) évoquer leurs rapports, leurs avantages et leurs inconvénients respectifs ;\n(3) tracer quelques perspectives d'évolution.\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "Introduction aux droits de l’homme", 
    "price": 0, 
    "instructors": "Maya Hertig Randall and Michel Hottelier", 
    "institution_name": [
        "University of Geneva"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/droits-de-lhomme", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}