{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    The debate over slavery touched not only the lives and fortunes of the millions of African Americans held in bondage, but also those of every American citizen. It was decided only after a catastrophic war in which more than 600,000 Americans died. The effects of the slaveholding era are still being felt today.   Slavery profoundly affected not only American history, but American literature as well. The writings of many of the authors whose work the American literary tradition depends – Thoreau, Douglass, Melville, Stowe, Whitman, Alcott and others – were both informed and haunted by the specter of slavery. In this online course, the worlds of law, literature, and history come together to paint a portrait of an era of conflict and controversy. We will read the judicial opinions that shaped and tried to preserve the institution of slavery, as well as the books of authors who tried to tear it down. We shall travel to the places where history was made, including Concord, Massachusetts; Gettysburg, Pennsylvania; and the home of Frederick Douglass as we look for answers to the following questions:\r\n\r\nWhat were the legal principles behind slavery, and what were the arguments both for and against its legality?\r\nHow did the leading American writers of the time respond to slavery, both in fiction and in nonfiction?\r\nWhat was slavery like from the perspective of the slave, and how did African-American writers take up the war of words on the subject?\r\nHow did the Civil War inspire the authors who lived through it and saw it firsthand?\r\nWhy does the institution of slavery, which was abolished in the United States in the 1860s, still matter to us today?\r\n\n\n                                            Syllabus\n                        Week 1: The Legal and Historical Story Up to 1845\r\nWeek 2: Frederick Douglass\r\nWeek 3: The Fugitive Slave Law and Herman Melville\r\nWeek 4: The Woman \"Who Started This Big War\": Harriet Beecher Stowe\r\nWeek 5: Solomon Northup, Dred Scott and Henry David Thoreau\r\nWeek 6: The Prose of the Civil War: Abraham Lincoln and Louisa May Alcott Week 7: The Poetry of the Civil War: Walt Whitman and Melville Week 8: The Fourteenth Amendment\n                                    ", 
    "end_date": "2014-11-25T00:00:00Z", 
    "title": "Literature & Law of American Slavery", 
    "price": 0, 
    "instructors": "John Matteson", 
    "institution_name": [
        "John Jay College of Criminal Justice"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://johnjayonline.com/slavery", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open Education by Blackboard"
    ], 
    "start_date": "2014-09-30T00:00:00Z"
}