{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    International law can be considered as the law of the international community, the law that governs relations between States. But it also relates to what international organizations do and, increasingly, it concerns individuals, corporations, NGO’s and other non-state actors.\n\nAs the world becomes more interdependent and more complex, and as new institutions are put in place to make international law real and more effective, international law is an exciting expanding field. Never before has it been so much relied upon, used and developed. Despite their differences in size, power, culture, religion and ideologies, states rely on international law to cooperate and to coexist; they speak the language of international law and international law serves them as an important common language.\n\nThe course will extensively rely on judgments and advisory opinions of the International Court of Justice (ICJ), which is the principal judicial organ of the United Nations (UN).\n\nHaving acquired this basic knowledge of international law, you’ll find it easier to study by yourself in books or through other courses or MOOCs some sub-fields of international law, like international humanitarian law, investment law, human rights or refugee law.\n\nSo, if you want to understand what is international law, what role it plays in the world of today, how it can be used or if you want to be able to discern legal arguments within the flow of international news and reports, this course is for you.\n\n                                    ", 
    "end_date": "2017-09-28T00:00:00Z", 
    "title": "Louv5x: International Law", 
    "price": 0, 
    "instructors": "Pierre d’Argent", 
    "institution_name": [], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/international-law-louvainx-louv5x-1", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-09-22T00:00:00Z"
}