{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    \n\t*Note - This is an Archived course*\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course. \nHuman rights develop through the constant dialogue between international human rights bodies and domestic courts, in a search that crosses geographical, cultural and legal boundaries. The result is a unique human rights grammar, which this course shall discuss and question, examining the sources of human rights, the rights of individuals and the duties of States, and the mechanisms of protection. We shall rely extensively on comparative material from different jurisdictions, to study a wide range of topics including, for instance, religious freedom in multicultural societies, human rights in employment relationships, economic and social rights in development, or human rights in the context of the fight against terrorism.\nBefore, during, and after the course, check out the course's official Facebook page for announcements and discussions.\nAt the end of this course, the participant shall:\n\n\t\tProve a solid understanding of the key controversies surrounding the development of international human rights law\n\t\n\t\tBe able to follow the developments of human rights law, thanks to the conceptual tools he/she shall have acquired\n\t\n\t\tBe able to take part in the questions raised by the enforcement of international human rights law\n\n\n                                    ", 
    "end_date": "2014-04-28T00:00:00Z", 
    "title": "Louv2.01x: International Human Rights\n", 
    "price": 0, 
    "instructors": "Olivier De Schutter", 
    "institution_name": [
        "Université catholique de Louvain"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/louvainx/louvainx-louv2-01x-international-human-1205", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-02-17T00:00:00Z"
}