{
    "selfpaced": true, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    Think about the oldest and most familiar principles of American law, property and proportional liability, in a new and surprising way, and learn to apply economic reasoning to an especially important and interesting aspect of life.\n\n                                            Syllabus\n                        PropertyProperty is where law and economics meet, but it's not a simple concept. Property is not an object or a relation between people and objects, but a set of rights, relations among people over who is to control each of the many uses to which objects can be put. Different people may control different uses of an object, that is, have different property rights over its various uses, at the same time, or control the same use of the object at different times. When new uses create disputes, the law must define new property rights and allocate them initially to resolve the dispute – someone must be deemed to have won the dispute and be given initial ownership of the new rights. But once the former disputants are allowed to trade these rights among themselves, surprising results follow. Exchange and EfficiencyVoluntary exchange implies mutual benefit – when people trade property rights, it's because they each believe that what they get from the trade will be more valuable to them than what they have to give up to get it. So if there are no obstacles to voluntary exchange, that is, if transaction costs are low, property rights will end up in the hands of the person who values them the most, a result economists call an efficient allocation of the rights. What happens when there are barriers that impede or prevent property rights from reaching their highest valuing owner through exchange? Can the law assign property rights to achieve efficient allocation in such cases? Should it try, or are there values other than efficient allocation the law might try to advance, along with or instead of efficient allocation, in assigning property rights?ExternalityExchange involves both benefit and cost – traders take rights from others, imposing costs on them but creating benefit for themselves, but they must compensate the others for their costs by paying for the rights they've taken. External costs are imposed when one person takes another's rights without paying for them, which leads to the taker taking more rights than efficient allocation would allow and leaves the victim uncompensated for the costs of losing the rights. The law's response to this inefficiency and injustice is liability, forcing those who take rights without payment to compensate those whose rights they have taken for the costs they have borne. Thinking about how the law determines these liability prices, and how people might respond to them, reveals the underlying economic logic of liability.Crime and PunishmentSome externalities involve only a few uncompensated losers of rights whose costs are easily reckoned in monetary terms, so that forcing the taker to pay exactly these costs to the victims ensures both that victims will be fairly compensated and that takers will take rights only where they value the rights more than the losers do. The law calls these externalities torts, and the same principle of liability pricing extends to crimes, in which, with the same unlawful act, someone simultaneously takes the rights of many people who suffer moral costs that can't be satisfactorily measured by money. As with torts, some crimes may be efficient reallocations of rights, and the logic of liability shows that proportional punishment can, ideally, discover which crimes are or are not efficient and force all takers to compensate their victims in full for what they take.Property, Utility and TechnologyThe concept of property is developed in two new directions. One concerns the problem of eminent domain and evokes the ancient conflict between individual rights and collective needs – in what circumstances, and to what extent, should private property be protected against uncompensated taking by government? How do the different theories of property considered earlier each answer this question? The other asks how voluntary exchange can be organized when technology makes it easy for people to take others' property rights without compensation. If existing rights are insufficient to prevent these takings from occurring on a large enough scale to make voluntary exchange impossible, new kinds of property rights are needed to encourage efficient levels of production and exchange. This is illustrated by the problem of intellectual goods and the new forms of property that have evolved over centuries to make exchange in ideas possible.Criminal ProcedureCriminal liability means that crimes have prices, and how these prices are exacted in practice from people who take rights without compensation is the problem of criminal procedure. How do judges know who is guilty, and what prices guilty people should be made to pay for their crimes? Around the world, two major systems of adjudicating guilt and punishment, the adversarial and the inquisitorial, have evolved over centuries to answer these questions in individual cases, with very different procedures to assess guilt and punishment that express different commitments to truth and fairness. All these procedures are expensive, and governments everywhere must confront the problem of processing large caseloads with limited resources. This has led the inquisitorial systems of Europe and the adversarial systems of England and the United States to new procedures of adjudication that may be reducing the differences between them. \n                                    ", 
    "end_date": "2014-03-17T00:00:00Z", 
    "title": "Property and Liability: An Introduction to Law and Economics", 
    "price": 0, 
    "instructors": "Richard Adelstein", 
    "institution_name": [
        "Wesleyan University"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/property-law-and-economics", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-02-03T00:00:00Z"
}