{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    “For the internet to remain global and open, it is imperative that countries, including those currently lacking capacity to adequately deal with security concerns, to adopt a growth- and freedom-oriented, participative, bottom-up perspective on security that has human rights at its core.” (Joint Governmental Statement at UN Human Rights Council in June 2013)\r\nArguably, the internet poses severe challenges to state sovereignty and governmental legitimacy. Governments around the world find it increasingly difficult to control, regulate or monitor the massive flow of data within the cyber-world and uphold human rights and fundamental freedoms at the same time. Nevertheless, the world wide web is one of the main prerequisites for economic growth and democracy. It enables citizen participation , engagements and inter-action on all levels that can lead to social transformation and political change. Radical groups, democracy movements, development organizations and human rights NGOs all use the internet to further their goals.\r\nSince the former NSA contractor, Edward Snowden, released a variety of confidential documents we all know of PRISM, TEMPORA and other programs and their massive privacy infringements. These programs were primarily designed to collect user data to increase the capability of intelligence services to protect societies from internal and external threats. But are those programs not undermining essential citizen freedoms and fundamental human rights?\r\nThis course systematically examines the compliance between international human rights norms, standards and mechanism within legal and political frameworks and the growing cyber security regime. Debates about the loss of state sovereignty over cyber security, paired with the idea of internet freedom and users’ and citizens’ responsibility lead to the question, whether individual and state responsibility based on reciprocity and human rights compliance are reconcilable.\r\nLearning Outcomes\r\nStudents taking this course will learn:• how human rights are used in the debate about Public Privacy • how individual, societal, political and governmental actors interact in this context• what cyber security in consistency with human rights is about.\r\nUsing this information, students will practice assessing and analyzing cyber security issues based on international human rights norms, standards and regimes.\r\n \n\n                                            Syllabus\n                        The first part of the course will provide an overview of the current state of international and regional human rights regimes and their efforts to protect freedom rights while also ensuring private security. The second part will then go into the evolution of human rights, their violations and protection mechanism in era of the internet.\r\nChapter 1: An Introduction to Public Privacy, Cyber Space and Human Rights\r\nChapter 2: Human Rights - Yours and the Rights of Others\r\nChapter 3: Human Rights Cyber Regime\r\nChapter 4: Governance in Cyber Space\r\nChapter 5: Security &amp; Surveillance in Cyber Space\r\nChapter 6: E-Governance &amp; E-Democracy\r\nChapter 7: State Sovereignty vs. Public Privacy\r\nChapter 8: Cyber Justice through Public Privacy &amp; Wrap Up of the MOOC Course\n                                    ", 
    "end_date": "2014-01-29T00:00:00Z", 
    "title": "Public Privacy: Cyber Security & Human Rights", 
    "price": 0, 
    "instructors": "Anja Mihr", 
    "institution_name": [
        "Humboldt-Viadrina School of Governance"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://iversity.org/courses/public-privacy-cyber-security-and-human-rights", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2013-12-04T00:00:00Z"
}