{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    Our world is full of exciting opportunities delivered to us by the information technologies. We live in a digital age. As an example, our parents in 80s were shocked by live TV broadcasts from one continent to another. Today anybody can do the same (it's called live streaming) using his or her smartphone. It made citizen journalism possible. You can order the book or article in several clicks and it will be instantly delivered to your e-book reader, mobile phone and soon to the cars and refrigerators.\r\nHowever, this digital ocean is full of dangers which most of us are not aware of.  What are the software licenses? What \"works of authorship\" mean and which licenses can be applied to them? What is the proper balance between our security and privacy? Should the understanding of human rights itself change because of the new technologies?\r\nThis course is focused on these questions. It is made with cooperation ofRichard Matthew Stallman who is the founder of Free Software Foundation.He is the most famous expert in the field of digital freedom. Dr. Stallman is not only a theorist but also a practitioner. A living legend that has dedicated his life on liberating source code and making it available for all.\r\nLearning objectives and outcome\r\nThe objective of this course is to help participant understand the threats introduces to the modern society by the informational technologies of the day. It includes but not limited to the threats introduced by malicious and proprietary software, patented software, e-books and cloud computing.\r\nBy the end of the course participant will be aware of these threats and will have understanding on a practical and philosophical levels of the ways to contribute to the free digital society.\r\nCourse requirements\r\nNo recommended background. Everybody is welcome!\r\nAssessment criteria\r\nThe course contains five quizzes (one per week). In order to get the Statement of Accomplishment, the student should get the passing grade 60% or more. In order to get the Certificate with Distinction the student  should get the passing grade 90% or more.\r\n\r\n \n\n                                            Syllabus\n                        \r\nWeek 1. Introduction, Free Software and the Four Freedoms.Introduction to the course. What makes the Software Free?\r\nWeek 2. Threats to the Free Digital Society. Living in the digital society.Should we aim for inclusion or exclusion from it? What is a Free Digital Society?\r\nWeek 3. Copyleft: How to make software free? What is Copyright and Copyleft? How to make software free? Why is it important?\r\nWeek 4. Works of Authorship in the Free Digital Society. How to make Works of Authorship free? Why is it important?\r\nWeek 5. Digital lifestyle to support freedom. How can YOU contribute to the Free Digital Society?\r\n\n                                    ", 
    "end_date": "2015-06-08T00:00:00Z", 
    "title": "Road to the Free Digital Society", 
    "price": 0, 
    "instructors": "Vitaly Repin and Richard  Stallman", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://eliademy.com/catalog/road-to-the-free-digital-society.html", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-05-04T00:00:00Z"
}