{
    "selfpaced": false, 
    "topic_name": [
        "Law"
    ], 
    "description": "\n\n                    \n                    \n                    Whether you’re a junior researcher, producer or archivist, this free online course from BAFTA Research, Film London and UCL will help you get to grips with the fundamentals of UK copyright for film and TV.\n\nOver two weeks, you will hear expert advice from academic specialists along with real life case studies from the wider film industry.\n\nYou’ll learn the underlying principles of copyright in an easy to digest way, supported by practical examples of how these are applied across archives, distribution, production and exhibition. You’ll also hear why getting your rights right could repay your efforts.\n\nEach week, our experts will break down the theory and provide you with real examples and useful samples and case studies.  There will also be space for discussion and exploration of wider concepts and your own projects.\n\nAt the end of the course, you’ll be able to test your knowledge and be directed to further sources of support and information, to unlock the potential of your own work and projects.\n\n1  - What is copyright – principles, context and potential\n2 – Working with copyright – applying from principles from Week 1 and licensing\n\nBAFTA Research has teamed up with Creative Skillset to offer this course as part of the Visible Rights Project funded by Innovate UK.\n\nThe course will give you a practical grounding in UK copyright and the mechanisms that allow work to be seen, to develop and to create value.\n\n\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Unlocking Film Rights: Understanding UK Copyright", 
    "price": 0, 
    "instructors": "Annabel Grundy", 
    "institution_name": [
        "Creative Skillset"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/film-copyright?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}