{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\"><strong style=\"\">If you have been learning English for 3 or more years (including at school) and still are not 100% happy with your level or progress, then this course is for you :)</strong></p><p style=\"\"><strong style=\"\"></strong>This course will show you the reasons why you feel unhappy with your level of English because it focuses on the 6 most common problems almost all students face when learning English which stop them from achieving full happiness with their level.</p><p style=\"\"><strong style=\"\">These problems are...</strong></p><ol style=\"\"><li style=\"\">You Fear What Others Think</li><li style=\"\">You Worry Your English Isn&#039;t Good Enough</li><li style=\"\">You Try To Be Perfect &amp; Not Make Mistakes</li><li style=\"\">You Always Feel You Need More Vocabulary</li><li style=\"\">You Learn 95% And Practice 5%</li><li style=\"\">You Focus On Grammar Rules (too confusing)</li></ol><strong style=\"\">Do you have any of them?</strong><p style=\"\">This course focuses on smashing these problems instantly, so you overcome them and can start speaking English with confidence.</p><p style=\"\"><strong style=\"\">The course includes the following &quot;6 Rules To Pure Confidence&quot;...</strong></p><ol style=\"\"><li style=\"\">Don&#039;t Worry</li><li style=\"\">Your English Is Better Than Their _______</li><li style=\"\">Communication Is Key</li><li style=\"\">Avoiding The Trap</li><li style=\"\">95/5 Rule</li><li style=\"\">Grammar vs Templates</li></ol><p style=\"\"><strong style=\"\">What Does The Course Consist Of?</strong></p><p style=\"\">6 videos (1 for each RULE) so you can get through the course quickly and easily with success. </p><p style=\"\">There are 2 PDF downloads also for you to keep on your computer for your convenience.</p><p style=\"\"><strong style=\"\">Who Is This Course For?</strong></p><p style=\"\">This course is for anyone who has been learning English for at least 3 years (including school).  In other words, for Intermediate or Advanced level students.</p><p style=\"\"><strong style=\"\">How Long Will The Course Take To Complete?</strong></p><p style=\"\">The course is only about 1 hour long in total so anyone should be able to complete the course in 1 day and be able to re-do any lecture they feel they need to &quot;re-enforce&quot; the rules. The course is focused on teaching new approaches to your English and how to overcome the problems that get in the way of your progress.  It&#039;s not filled with vocabulary lists or grammar rules you need to try to learn.  So it is quick and easy to master.</p><p style=\"\"><strong style=\"\">Do I Need To Prepare Anything For The Course?</strong></p><p style=\"\">No, we provide everything you need.  All you need to do is be ready to learn English in a new way and say goodbye to your problems and frustration with English :)</p>", 
    "end_date": null, 
    "title": "6 Rules To Speak English With Pure Confidence", 
    "price": "30.00", 
    "instructors": "Rohan Cox", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486482_93cc_3.jpg", 
    "course_url": "https://www.udemy.com/6-rules-to-speak-english-with-pure-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-26T04:21:14Z"
}