{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">\"Easy, natural way to understand native speakers. I would absolutely recommend it. Before taking this course, I went through many courses, but none of them were as comprehensive as '8 Secrets'. It takes you by the hand and teaches you the real secrets to understanding native speakers. Easy to follow and entertaining. I would absolutely recommend it.\" Salvatore Scaniglia</strong><br><strong class=\"redactor-inline-converted\"><br></strong></p><p><strong class=\"redactor-inline-converted\">\"Exactly what I wanted to learn! I couldn't recognize those sounds before going through these lessons.\" Vadim Dzyuban</strong><br><strong class=\"redactor-inline-converted\"><br></strong></p><p><strong class=\"redactor-inline-converted\">\"This course helps you a lot on your listening, 5-star recommended.\" Sant Cheung</strong></p><p>Strong listening skills are the key to the best English because listening is the heart of any language. Learn to understand native English speakers in this course from an internationally known English expert. This is the same course your teacher, Nina, has taught at companies like Toyota Motor Sales, Sumitomo, Mazda Motors of America, Seiko, Tatung, universities, and that she taught at Harvard University as a teaching fellow. Easy-to-understand English captions in each lesson help you understand every word your teacher says!<br></p>\n\n<p>After this course, you'll be able to understand English spoken at a natural speed much better. When you can understand the real spoken English around you, you can also improve your English conversation, grammar, vocabulary, and even pronunciation. If you can hear it more correctly, you can say it more correctly. <strong class=\"redactor-inline-converted\">Very important -- You'll get important practice exercises with many different native English speakers from the real world in each lesson.</strong> This practice will help you to test and improve your hearing and understanding of real English speakers in real situations.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Nina is the author of a bestselling listening book on real spoken English -- \"Whaddaya Say\" (Pearson Education, 45 printings). She's written many English textbooks for major publishers like Pearson Education, Cengage, McGraw-Hill, etc., and she's done formal research on natural spoken English at the University of California, Los Angeles.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">JOIN OVER 600 ENGLISH STUDENTS WHO HAVE SUCCESSFULLY IMPROVED THEIR LISTENING SKILLS WITH THIS COURSE. </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"8 Secrets to English Success\" is Step 1 of Nina's popular listening-to-real-English program. There are two levels in this listening program -- Step 1 and Step 2 (\"8 MORE Secrets\"). Nina recommends that you start here with \"8 Secrets to English Success\", Step 1.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>BONUS!  You'll also get practice sounding more like a native speaker. Nina will give you a very important secret in the last lesson that will make your English sound more natural immediately.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                              Nina's students consistently get high scores on the listening sections of tests like the TOEFL and the TOEIC. Her students are better listeners.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                              \"8 MORE Secrets to Understanding Native English Speakers\" INTERMEDIATE LEVEL is the next class in Nina's listening program. You can learn directly from your teacher, Nina, just as students at various universities and Toyota Motor Sales do.  Nina is very excited about offering you this course, and personally helping you with your English goals!</p>", 
    "end_date": null, 
    "title": "8 Secrets to English Success ", 
    "price": "20.00", 
    "instructors": "Nina Weinstein", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/116226_a4cb_12.jpg", 
    "course_url": "https://www.udemy.com/8-secrets-to-english-success/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-06T20:52:50Z"
}