{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This is a course teaching beginning English (reading, writing, and spelling) using phonics. This is a comprehensive beginner's course for children who are learning to read or for children who are struggling readers. This course is also ideal for ESL adults, whether you are looking to learn English, improve your reading level or you want to take English classes but lack basic English Skills. </p><p><b>Contents and Overview</b></p><p>This course contains over 7 hours of video lectures. The course is broken down into seven sections with 6 sounds covered in each section. Each section ends with a quiz so you can track your learning! Every lecture has fun activities to make it easier to learn. There is a comprehensive list of materials for you to download that you use throughout the course. A student can go from struggler to achiever in as little as 7 weeks for a beginner and 2 weeks for students just needing a refresher course. The lectures are short so it's easy to stay focused. Spending just 25 to 30 minutes a day should have you on the road to proficiency! </p><p> <b>Attention Teachers </b></p><p>Are you an instructor of Adult beginning English and you are having difficulty finding quality material to teach adults that is not geared towards children? If this is your problem this course is your solution.</p><p><b>At the end of my course, students will...</b></p><ul> <li>know all of the sounds of the English language.</li> <li>begin to read fluently.</li> <li>identify and write the lowercase and uppercase English alphabet.</li> <li>read, spell and write words and simple sentences.</li> <li>read, spell, write and use over 90 high frequency (irregular) words.</li> <li>Improve children's reading several grade levels</li> </ul><p><b>ESL adults will also be…</b></p><ul> <li>ready to take an adult beginning English course</li> </ul><p><b>Who should take this course? </b></p><ul> <li>Adult EFL learners, such as speakers of Chinese, Arabic, or Khmer, who may not be familiar with the Roman alphabet</li> <li>Children who want to learn to read</li> <li>Children who need a reading 'refresher course'</li> <li>Teachers of adult ESL learners struggling to find course materials that are not geared towards children and are for learners completely unfamiliar with the English language,</li> </ul><p><b>Who should not take this course?</b></p><ul> <li>This course is not suitable for small children 4-6 years old, as they may find the material boring</li> <li>Students that already know how to read fluently.</li> </ul><p><b>What will students need to know or do before starting this course?</b></p><ul> <li>A computer or video viewing device</li> <li>Print the materials in section one to use in the course.</li> <li>A positive attitude and willingness to learn</li></ul>", 
    "end_date": null, 
    "title": "Absolute Beginners Reading for Children or ESL Adults", 
    "price": "20.00", 
    "instructors": "NaShannon Jackson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495828_c52a_2.jpg", 
    "course_url": "https://www.udemy.com/absolute-beginners-english-for-children-or-esl-adults/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T10:00:29Z"
}