{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This American Accent course is an overview of some of the most common speech problems people not born in the US face when speaking American English.</p><ul style=\"\"><li>It offers specific examples and a targeted analysis of how English is spoken in the US as compared to how articulation might occur in other languages. </li><li>Students learn to identify their own carry-over patterns from other languages that may impact their ability to be understood the first time when speaking in American English. </li><li>Students also learn how to accelerate change so they can speak more clearly and effectively with less effort.</li><li>Chinese, Indian, and European first language speakers as well Japanese, Korean, and Russian speakers learn what which vowels are most important to focus on.</li><li>The course includes a vowel chart placement and a list of all 23 vowels in American English, with example words for reference, taken from Rebecca&#039;s personalized coaching program.</li><li>Quizzes accompany each lesson to ensure the material is clear.</li><li>Best practices, strategies and techniques to enact and sustain change are explored.</li></ul><div style=\"\">Enjoy this course of insights from an American Accent Coach of hundreds of clients from diverse languages worldwide. She imparts knowledge of what is known to work best, what students may not realize about their own speech, and how to stay motivated and focused throughout the journey!</div>", 
    "end_date": null, 
    "title": "Acquire an American Accent", 
    "price": "20.00", 
    "instructors": "Rebecca Linquist", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478264_e465_4.jpg", 
    "course_url": "https://www.udemy.com/acquire-an-american-accent/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T18:29:47Z"
}