{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t  This is an advanced English course for non-native English speakers. This course will help you go from intermediate to mastering advanced English topics.  By the end of this course you will  develop skills to communicate independently and  become more fluent in English , the course covers real world topics  such as free time, jobs, careers, world news, traveling and entertainment. This Advanced English course is structured into 5 sections in which you will be exposed to:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·<strong style=\"\"><em style=\"\">Advanced English Grammar lessons</em></strong>: You will watch a short 5 to 8 minutes lecture and complete a quiz in order to make sure that you are capturing all the material covered. You&#039;ll receive immediate feedback after the completion of each quiz so that you can work on your areas of opportunities.  \t</p>  \t<p style=\"\">  \t\t  ·<strong style=\"\"><em style=\"\">Listening activities</em></strong> :  You&#039;ll listen to short 2 to 3 minutes listening activities in which you will develop skills in listening for detail, making predictions and decoding words.  \t</p>  \t<p style=\"\">  \t\t  ·<strong style=\"\"><em style=\"\">Reading</em></strong>: You&#039;ll read real world articles such as &quot; The amazing world of apps&quot; e.g. The app store and Google play. The goal is to improve your reading and comprehension skills, you will develop reading strategies and skills such as identifying main ideas and understanding vocabulary in context. After completing the article you will take a short quiz in order to measure your understanding of the article.  \t</p>  \t<p style=\"\">  \t\t  ·<strong style=\"\"><em style=\"\">Vocabulary</em></strong>: Throughout the course you&#039;ll be exposed to complex sentences and new English Language Vocabulary which will improve your fluency.  \t</p>  \t<p style=\"\">  \t\t  ·<strong style=\"\"><em style=\"\">Writing / Group Discussion / Forum:</em></strong> The course has a feature to leave or post messages via a Discussion forum, this tool will be extremely useful for English as  a Second Language Learners as it will also be part of the class, You&#039;ll voice your opinions from the course via this tool, group correction and discussion is also encouraged  \t</p>  \t<p style=\"\">  \t\t  ·<strong style=\"\"><em style=\"\">Course material</em></strong>: You do not need to purchase any textbook for this course. All course materials are online and instructor&#039;s notes are shared lived via Google docs and on Slide Share. You&#039;ll have easy access to all course materials within each lecture via the supplementary material option. You do not need a Google account or Slide Share account to view the files but if you would like to download them and view them offline then you&#039;ll need to create a free Google or Slide Share account.  \t</p>  \t<p style=\"\">  \t\t  ·<strong style=\"\"><em style=\"\">Course length:</em></strong> This course is designed to be completed in a period of 5 to 6 weeks. Assuming that you will finish a section per week and complete all activities such as quizzes and writing assignments.  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Why take this course?</em></strong> Knowing English increases your chances of getting a good job in a multinational company within your home country or abroad. English is the language of business, science, aviation, computers, diplomacy, and tourism. English is also the language of the media industry. If you speak English, you won&#039;t need to rely on translations and subtitles anymore to enjoy your favorite books, songs, films and TV shows. We are living in a Global world, technology has enabled us to be closer to each other via the internet;  This class is a great example of how connected we are; you might be thousands of miles away but we are connected via this amazing platform that allows you to take this course. In this Global environment we must learn very fast or be left behind, join this course and become part of the digital revolution.  </p>", 
    "end_date": null, 
    "title": "Advanced English: Achieve English Fluency", 
    "price": "20.00", 
    "instructors": "Joe Saenz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/128742_eef8_5.jpg", 
    "course_url": "https://www.udemy.com/advanced-english-course/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-03T21:22:39Z"
}