{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">This is an advanced IELTS Writing Course that covers Task 2 of the IELTS Writing exam - the 250 word essay. Many students that may already have fairly good English often struggle to achieve an 8 in this difficult component and this course simplifies how to excel in this part of the exam by illustrating the &#039;Melbourne English Writing Process&#039;.</p><p style=\"\">The instructor leads the students through the 8 Steps by completing 4 perfect 9 band answers to 4 different types of question - The Opinion, The Discussion, The Problem Solution and The Two Part Question.</p><p style=\"\">Part 1 is an overview of the 8 Step &#039;Melbourne English Writing Process&#039; and the IELTS Writing exam, explaining the 4 key areas that IELTS examiners grade and how to maximize your grade in each area.</p><p style=\"\">Part 2 of the course explains the 8 Steps with explanation overview videos followed by practical application and answering an IELTS &#039;Opinion&#039; type question.</p><p style=\"\">Part 3 goes through the 8 Step Process again, this time with a &#039;Discursive&#039; question type. Another 9 band answer is crafted and written for this different topic and question type.</p><p style=\"\">Part 4 deals with the &#039;Problem Solution&#039; type question and the instructor guides the student through the process of dealing with this style of essay.</p><p style=\"\">Part 5 examines the &#039;Two Part Question&#039; typology and another 9 band perfect essay is written by walking through the same 8 Steps of the Process. </p><p style=\"\">This course is aimed at advanced students seeking 8 or 9 in IELTS Writing so it may be difficult for beginner or lower intermediate students to follow. After completing this course students will be able to apply the 8 Techniques of the &#039;Melbourne English Writing Process&#039; to any Task 2 essay question and write an excellent essay in the IELTS exam.</p>", 
    "end_date": null, 
    "title": "Advanced IELTS Writing Process by Melbourne English", 
    "price": "20.00", 
    "instructors": "Simon Melbourne English", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398008_10bc_5.jpg", 
    "course_url": "https://www.udemy.com/the-melbourne-english-advanced-ielts-writing-process/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T13:20:28Z"
}