{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This is an ESL (English as a Second Language Course) with a difference. You'll improve your English while learning about American people, society and culture. This course is very helpful to those planning on studying, traveling, or doing business in the U.S. Here's what you'll get from this course:</p><p>55 lectures, most of which have additional downloadable content that will be accessible now and in the future</p><p>improved conversational skills including greetings, introductions, and invitations; making suggestions, making small talk, and leaving conversations.</p><p>improved listening comprehension and improved pronunciation including understanding contractions, word reductions, word stress in sentences, and pronunciation of minimal pair words</p><p>improved American English grammar and usage including contractions, interrogatives, nouns, verbs (including verbs like “to get\"), phrasal verbs, idioms, adverbs, compound words, prepositions, adjective position and order, gerunds, collocations</p><p>improved use of advanced vocabularies including geography, American people and society, computer and internet terms, environmental terms</p><p>learn about American people, races, ethnicities, generations, love and friendship customs, naming customs, family life customs, music, sports, government, and more</p><p>learn about American holidays: New Year's, Valentine's, Independence Day, Halloween and Day of the Dead, Thanksgiving, Christmas and Hanukkah</p><p>meet some interesting Americans including: musician Wynton Marsalis, Native American surgeon Lori Alvord, US Senator Elizabeth Warren, athlete Apolo Ohno, Google co-founder Larry Page</p><p>enjoy some American folklore and scary ghost stories</p><p>You'll enjoy improving your English in a fun way!</p><p><strong>Feedback from C.J. Shane's former ESL students:</strong></p><p><em>~~~I am happy to be in this class, and I feel lucky to know our teacher. She taught me much knowledge which I didn't know. She is warm-hearted.</em></p><p><em>~~~We have learned a lot about American culture, American geography, and teaching methods. I like this class. It's really interesting.</em></p><p><em>~~~Thank you for giving us so much happiness. I feel so lucky to be one of your students. Thank you again for your vivid lessons.</em></p><p>~~~<em>I feel I am so lucky. I have a lovely and friendly teacher. She taught us many interesting things. She taught us many things American. The most important thing I learned is that my oral English is improving and I can express my opinion freely.</em></p>", 
    "end_date": null, 
    "title": "American English-American Life", 
    "price": "35.00", 
    "instructors": "C.J. Shane", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533176_2607.jpg", 
    "course_url": "https://www.udemy.com/american-english-american-life/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-20T22:43:35Z"
}