{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Have you already learned English grammar in school or university but have little experience putting it into practice? Our lectures are practical and will give you an understanding of the English language in real life situations.<br style=\"\"></p>  <p><strong style=\"\">American Life English gives you Practical Skills! </strong>At the end of this course you will be able to confidently:<br style=\"\"></p>  <ol style=\"\">  \t<li>Make Travel Reservations</li>  \t<li>Refine a Search</li>  \t<li>Contrast and Compare</li>  \t<li>Follow the Rules of the Road</li>  \t<li>Purchase Protection Plans</li>  </ol><p>You will learn vocabulary used in the American cultural context.  You will be able to appropriately communicate with and relate to Americans.</p>  <p style=\"\">  \tWe will teach 5+ hours of video lectures and all the vocabulary you need to independently complete these life skills. Anyone is welcome to join who can speak and understand reasonably well and can use basic tenses but have problems with more complex grammar and vocabulary.  </p>  <p>  \t          You can access the lectures and worksheets when it is convenient for you.  You don&#039;t ever need to worry about missing a class.  You can listen to the lectures as many times as you need until you master each topic.  </p><p><strong style=\"\">Language + Culture = Adventure!</strong></p><p>Are you considering moving to America or soon travelling to America? This course will help you to get ready for your new adventure.</p><p>We want you to be as prepared as you can, taking advantage of every opportunity presented to you through knowing the English language and to succeed in those opportunities.</p>", 
    "end_date": null, 
    "title": "American Life: Practical English Skills", 
    "price": 0, 
    "instructors": "Jim & Melissa McDonald", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427300_ded3_5.jpg", 
    "course_url": "https://www.udemy.com/american-life-practical-english-skills/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T00:05:00Z"
}