{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>What you will learn in your American Accent for IT Professionals course</strong></p><p>The American Accent for IT Professionals course is designed for: </p><ul><li>developers</li><li>programmers</li><li>enterprise architects</li><li>consultants</li></ul><p>who work in North America or with North American companies.</p><p>The course content is geared specifically to the needs of IT professionals who want to communicate clearly, share their ideas and make contributions in the IT industry.</p><p><strong>The lessons feature relevant vocabulary</strong></p><p>In the American Accent for IT Professionals course I've organized the lessons that have worked <strong>most effectively </strong>with the people in my coaching program.</p><ul><li>You'll learn to pronounce 120+ IT vocabulary words clearly &amp; correctly</li><li>You'll learn to pronounce IT industry sentences with a clear &amp; engaging pace</li><li>You'll learn exactly how IT leaders speak with clarity &amp; influence</li><li>You'll learn rules &amp; patterns for speech that's easy for Americans to understand</li></ul><p>You'll have access to the very same lessons for American style communication that I use in my coaching program.<br></p><p>Go to lecture 3 to hear the <strong>full story </strong>on why I developed this course.</p><p><strong>Course materials</strong></p><p>Course materials are currently a mix of video, PDF and audio files. I'm continually making updates to the course. I'll notify you when new lessons are ready for you.</p><p><strong>Video case studies</strong></p><p>The video case studies that you'll use in this course are powerful way for you to learn exactly how IT industry leaders including:</p><ul><li>Steve Jobs</li><li>Vic Gundotra </li><li>Eric Schmidt </li><li>Padmasree Warrior </li></ul> <p>and many other men and women in IT speak with great clarity and influence. </p><p>Video case studies are downloadable lessons. My coaching clients find the video case studies to be a highly effective and inspiring way to practice their speaking.</p><p><strong>Course timeline</strong></p><p>Accent change takes time and repetition. That's why I recommend that you take each lesson at least two times. Three times is even better!</p><p>Since each lesson builds on the previous, you'll notice that there's repetition built in.</p><p>However, you must experience each lesson more than once in order to internalize the rules and patterns for speaking clear that you'll learn.</p><p>Please plan on spending 6-8 weeks working in this course.</p><p><strong>Why, how &amp; practice</strong></p><p>For every rule of spoken American English you learn in this course:</p><ul><li>I'll explain <strong>why</strong> you need to learn it.</li><li>Then I'll show you <strong>how</strong> to apply it.</li><li>Then we'll <strong>practice</strong> each rule &amp; pattern using IT industry phrases &amp; sentences</li></ul><p><strong>Immediate application</strong><br></p><p><strong></strong>Since you'll be learning to say words and sentences that are relevant to the IT industry including:</p><ul><li>developer</li><li>programmer</li><li>enterprise</li><li>database</li><li>algorithm </li></ul><p>you'll be able to use the skills you'll learn in this course right away.<br></p><p><strong>Proven methods</strong></p><p>These are the very same lessons that I use with my private clients, so I know they work.</p><p>If you're an IT professional who's been trying to improve the way you communicate in American English, I know that you'll be really excited by the speaking skills you'll learn  in this course.</p><p>Let's get started!</p>  <p>Susan Ryan</p>", 
    "end_date": null, 
    "title": "American Accent Training for IT Professionals", 
    "price": "50.00", 
    "instructors": "Susan Ryan", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22809_a2a3_5.jpg", 
    "course_url": "https://www.udemy.com/american-accent-training-for-it-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-13T22:25:39Z"
}