{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t     Esse curso de inglês para viagem vai te preparar para viajar para uma país de língua inglesa sem stress ou constrangimentos. Sabe quando você quer fazer um pedido em um restaurante , mas nem entende o cardápio para começar? Ou quando você pede informação sobre como chegar a algum lugar, mas não entende nenhuma palavra das coordenadas? E quando você quer saber como chegar ao portão de embarque do seu voo, mas não encontra ninguém que te entenda? Então, tudo isso e muitas outras situações de viagem são tratadas nesse curso para que você não passe vergonha e não fique estressado nas suas férias, afinal viagem é pra ser desfrutada!  </p>  <p style=\"\">  \t     São 17 vídeos compostos por vocabulário e diálogos baseados em situações de viagem. Tem também atividades para você poder colocar em prática tudo que aprender com os vídeos.  </p>  <p style=\"\">  \t   Todos os vídeos estão em inglês, mas mesmo se você tiver um nível básico de inglês poderá entendê-los. Utilizo muitas imagens para exemplificar e a linguagem usada é simples.  </p>  <p style=\"\">  \t     Seu inglês para viagem não precisa ser dos melhores, mas para evitar situações complicadas é importante que você saiba um pouco de vocabulário e algumas expressões.  </p>  <p style=\"\">  \t  O objetivo desse curso é justamente te ensinar esse vocabulário e essas expressões que vão fazer da sua viagem um momento prazeroso e sem complicações com o idioma.  </p>  <p style=\"\">  \t  Se você tiver dúvidas durante o curso, saiba que não está sozinho!! Você poderá postar as suas perguntas nas discussões ou enviar uma mensagem privada para mim. Eu respondo tudo em até 24 horas. Seus companheiros de curso também poderão te ajudar!  </p>  <p style=\"\">  \t  Pronto para se comunicar nas suas viagens a países de língua inglesa (e até não inglesa, afinal o inglês é um idioma internacional)? Então, se inscreva agora e nos veremos dentro do curso.  </p>  <p style=\"\">P.S: Esse curso foi atualizado em Janeiro de 2015 e eu sempre trabalho para que esteja o mais atualizado possível!</p>  <p style=\"\">  \t  See you soon!!  </p>", 
    "end_date": null, 
    "title": "Aprenda Inglês e Viaje Sem Stress a Países de Língua Inglesa", 
    "price": "20.00", 
    "instructors": "Luisa Costa De Oliveira", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140958_6eac_3.jpg", 
    "course_url": "https://www.udemy.com/english-for-traveling/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-02T17:27:34Z"
}