{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><i><strong>Natürlich sind die zwei wichtigsten Dinge beim Englischsprechen:</strong></i></p><p><i><strong></strong></i><i>1)</i><i>Von der Person, mit der man sich unterhält, verstanden zu werden (Aussprache).</i></p><p><i></i><i>2)</i><i>Die andere Person zu verstehen (Hörverstehen).</i></p> <p><i>Diese beiden Aspekte werden von Englischlehrern jedoch häufig <b>komplett ignoriert</b> und können nur äußerst schwierig allein erlernt werden. <b>Das Ergebnis?</b> Englischlerner sind oftmals vollkommen verloren, wenn sie mit jemandem, der nicht entweder sehr deutlich oder verlangsamt spricht, <b>eine echte Unterhaltung</b> führen. Das bedeutet, dass die Schüler es komplett verpassen, Englisch auf natürliche Art, durch echte Konversation zu erlernen.<b></b></i></p><p><b><i>Warum also Aussprache und Hörverstehen gemeinsam?</i></b></p><p><i>Ich habe jahrelang Schüler aus unterschiedlichen Ländern und von unterschiedlicher Herkunft unterrichtet und bin immer wieder auf dasselbe Problem gestoßen. Selbst wenn sich ein Lerner gut anhört, bemerkt man bei genauerem Hinhören doch, dass sein Englisch gebrochen klingt. Genauer gesagt, scheitern Lerner manchmal an kleineren Wörtern wie ,a' und ,the' sowie Präpositionen, wie ,in', ,at', usw. . Wenn ich sie dann darum bitte, die Worte auszusprechen, präsentieren sie mir die perfekte ,Klassenzimmer'aussprache. Das Problem ist, dass <b>im wahren Leben</b> niemand so spricht. Das ist also der springende Punkt; da sie die authentische Aussprache nicht kennen, hören sie diese in echten Gesprächen auch nicht heraus und weil sie sie nicht hören können, ist es ihnen auch nicht möglich, sich daran zu gewöhnen und sie ganz selbstverständlich zu verwenden. Sobald ich ihnen also die <b>echte Alltagsaussprache</b> beibringe, sind sie dazu in der Lage, die <b>Wörter richtig zu hören</b> und können sie dadurch wiederum auch verwenden. Es ist wie Zauberei, wie schnell sich ihre Aussprache, Hörverstehensleistung und die Verwendung des Englischen verbessern, wenn es ihnen auf diese Art beigebracht wird.</i></p><p><i>Dieser Kurs unterstützt Sie dabei, dieses Problem sowie auch viele andere Schwierigkeiten von Lernern auf mittlerer Niveaustufe zu meistern, wie beispielsweise Intonation sowie auch leicht verwechselbare Wörter. Wir aktualisieren den Kurs ununterbrochen und stehen Ihnen mit Rat und Tat zur Seite, sollten Sie Fragen oder Probleme haben.</i></p><p><i>Vorteile des Kurses:</i></p><p><i></i><i>1. </i><i>Verstehen Sie im Detail, was Menschen sagen und nicht nur den Gesamtzusammenhang.</i></p><p><i></i><i>2. </i><i>Seien Sie dazu in der Lage, sich mit Muttersprachlern/fließenden Sprechern des Englischen zu unterhalten, ohne dass diese Dinge wiederholen oder das Gesagt verlangsamen müssen.</i></p><p><i></i><i>3. </i><i>Fühlen Sie sich während der Unterhaltung mit Freunden und Arbeitskollegen wohl, ohne ununterbrochen auf Missverständnisse zu stoßen.</i></p><p><i></i><i>4. </i><i>Verbessern Sie Ihre Aussprache, damit Andere Sie noch leichter verstehen können. Vermeiden Sie Verwirrung und peinliche Situationen.</i></p><p><i></i><i>5. </i><i>Genießen Sie es, häufiger Englisch zu sprechen. Je besser Sie verstanden werden (Aussprache) und je besser Sie selbst Andere verstehen (Hörverstehen), umso schneller lernen Sie und umso mehr Spaß haben Sie daran, mit anderen Sprechern des Englischen zu interagieren.</i></p><p><i></i><i>6. </i><i>Wenn Sie mit diesem Kurs nicht <b>absolut zufrieden</b> sind, erhalten Sie innerhalb von 30 Tagen nach dem Kauf eine komplette Rückerstattung. Es besteht für Sie also <b>keinerlei Risiko</b>.</i></p><p><b><i></i></b></p><p><i></i><b><i>Was diesen Kurs ausmacht:</i></b><i> Voll von leicht verständlichen Erklärungen (gegebenenfalls mit Anmerkungen auf Deutsch). Handlungsorierntiert; lernen Sie, indem Sie die Dinge ausführen. Jede Unterrichtseinheit besitzt eine Menge Gelegenheiten das Erlernte zu Üben. Entworfen, um Sie vom ,mittleren Schulenglisch' zum Alltagsenglisch zu führen.</i></p><p><b><i>Was diesen Kurs nicht ausmacht:</i></b><i> Wir konzentrieren uns nicht nur darauf, die immer gleichen Laute auszusprechen, die in den Anfängerkursen geübt werden. Wir verwenden auch keinerlei Fachjargon oder sonderbare ,Aussprachesymbole'. Unseren Erklärungen kann also wirklich jeder folgen und auch sofort davon profitieren.</i></p><p><b><i>Bonus!:</i></b><i> Für all unsere zahlenden Kunden: Schicken Sie uns einfach eine kurze Aufnahme, auf der Sie selbst sprechen (mit einem Handy kann man sich ganz einfach selbst aufnehmen) und wir senden Ihnen ein ausführliches Feedback, in dem wir Ihnen erklären, wo Sie Ihre Aussprache noch verbessern müssen.</i></p><p><b><i>Fangen Sie also sofort an.</i></b><i> Der Kurs ist kurz genug, dass Sie <b>sofort echte Fortschritte</b> bemerken, jedoch auch ausreichend detailliert, um immer wieder damit zu arbeiten und sich<b> stetig weiterzuverbessern.</b></i></p>", 
    "end_date": null, 
    "title": "Aussprache und Hörverstehen: Englischsprechen beherrschen ", 
    "price": "30.00", 
    "instructors": "English Fluency Today", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580078_d6db_2.jpg", 
    "course_url": "https://www.udemy.com/aussprache-und-horverstehen-englischsprechen-beherrschen/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T12:27:26Z"
}