{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Students and those people wanting to advance in their present jobs who need to understand basic English grammar focusing on verb tenses should find this course very useful in professional or academic situations.  All twelve English verb tenses are systematically covered along with some troublesome areas  in making verb tense choices. Supplemental material and helpful websites are also included. Quizzes are regularly provided to help check student learning. The thirty lectures, all under ten minutes in length, thoroughly explain and demonstrate verb tenses and allow for interactive practice with the instructor. </p><p> <strong style=\"\">Having Good English Skills Is Now A Mandatory Requirement For International Business And Academic Success!! </strong></p><ul style=\"\"><li>Organize your learning of English on a regular basis </li><li>Review English Parts of Speech</li><li>Understand verb conjugation and how it assists making good         verb choices</li><li>Review all twelve English verb tenses and understand their formation and usage</li><li>Benefit from regular quizzes to evaluate your progress</li></ul><p><strong style=\"\">You will be further along the road to English fluency after taking this course!</strong></p><p>Learning English is not easy. Becoming fluent requires skill, dedication, and practice. That knowledge starts with command of verb tenses: knowing when and where to use particular tenses for accurate communication to a colleague, a client, or a teacher. </p><p>You can avoid confusion and embarrassment with excellent English skills. Be assured that English fluency in international business, science, technology and entertainment is a valuable, rewarding skill and the time you take learning English will open many doors in a variety of occupational fields.<strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Basic English Grammar: Understanding Verbs & Verb Tenses", 
    "price": "30.00", 
    "instructors": "Mark Miller", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444994_9c6d_5.jpg", 
    "course_url": "https://www.udemy.com/making-dollars-and-sense-out-of-learning-english-verbs/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T17:42:57Z"
}