{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>2016 UPDATE: Great news! From now on, upon completion of this course, you will receive a personalized signed certificate from our school!</strong><strong></strong></p><p>Welcome to Early English course! Here we show you how to teach English to 2-3 year olds in a fun way. For English teachers, Early English is a very unique course which covers all the features to teach toddlers. This course helps you in not only <strong>choosing a topic</strong> and <strong>planning a lesson</strong> but making a<strong> list of useful resources and equipment</strong>. This course provides a step-by-step guide that makes classes more enjoyable for teachers as well as kids.<br></p><p>Our course covers following core stages:</p><ul><li>Section 1- Theoretical background to teach toddlers. </li> <li>Section 2- Lesson planning and structure.</li> <li>Section 3- Learning through games and music approach.</li> <li>Section 4- Role of videos in teaching kids.</li> <li>Section 5- Useful resources and tips for teachers.</li></ul><p>By the end of this program you will be perfect in not only teaching kids English but building their interest in learning English.</p><p>Early English offers 32 exciting lectures! That is really useful content and 90% of material is presented through high-quality videos so everyone can enjoy watching them.</p><p>Overall, this is the course for ESL teachers and all the parents who want to teach English to their 2-3 year olds by interesting and fun way. No matter if you are a creative English teacher or a caring mother, if you want to explore your teaching experience and have different eye on toddlers, this is the right course for you! We cannot wait to share our very useful teaching tips with you and if you really want to become a cool teacher, then click <strong>ENROLL to get started!</strong></p>", 
    "end_date": null, 
    "title": "Become a great English teacher for 2-3 year old kids", 
    "price": "20.00", 
    "instructors": "Nadezhda Mertvishcheva, Katherine Sholokhova", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578318_d9a0_4.jpg", 
    "course_url": "https://www.udemy.com/become-a-great-english-teacher-for-2-3-year-old-kids/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T19:48:12Z"
}