{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Choosing a career is one of the most important decisions you will ever make. Many people choose careers for the wrong reasons. Maybe they chose a career they thought would be stable and make them financially secure, but ended up being unhappy and unfulfilled. You can prevent that from happening to you (or change your trajectory) by taking a proactive stance, carefully thinking through each step, and using the tools that are available to help you make wise decisions. I developed this course to be affordable and to help you systematically work through the planning process.<br></p>  <p>  \t                    While the course is designed for upper intermediate to advanced English language learners, development of language skills will be approached implicitly for the most part. The focus is on developing career planning skills, and it is expected that you will advance your language skills autonomously by noting where you are having trouble expressing yourself, jotting down and looking up words with which you are unfamiliar, and seeking guidance when your own research has been unhelpful. Along the way, I will provide prompts or hints for developing learner autonomy.  </p>  <p>  \t                    Finding your path in life can sometimes be a bit intimidating. This course will hopefully help to make it a little more fun and much less stressful. You will spend time exploring who you are, what work-related values you hold, what you already know, what you can do, and what you want to be able to do in the future. The activities in the course will help you begin to make those important decisions regarding your career choice.  </p>  <p>  \t             By the end of the course, you will have a Career Portfolio complete with the following items:  </p>  <p>  \t             1. Lifetime Goals Action Plan  </p>  <p>  \t             2. List of Hobbies and Interests  </p>  <p>  \t             3. Your Interest Code  </p>  <p>  \t             4. Transferable Skills List  </p>  <p>  \t             5. Job-related Values Index  </p>  <p>  \t             6. Personality-type Reflection  </p>  <p>  \t             7. Career Exploration Scavenger Hunt  </p>  <p>  \t             8. Informational Interview  </p>  <p>  \t             9. Career Action Plan  </p>  <p>  \t           Each lecture includes a transcript of the lecture if you would like to read along while listening.  </p>", 
    "end_date": null, 
    "title": "Career Planning for English Language Learners", 
    "price": 0, 
    "instructors": "Lori Michele Kelley", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235650_a483_10.jpg", 
    "course_url": "https://www.udemy.com/career-exploration-for-english-language-learners/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T15:38:31Z"
}