{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Aprenda como desenvolver a mentalidade certa e usar recursos, estratégias, e métodos eficientes para dominar o inglês com confiança absoluta. O nosso curso oferece ferramentas práticas (usadas por poliglotas) para aprender línguas de uma maneira eficiente.</p><p><strong style=\"\">Alunos de inglês: aprenda com confiança e consiga se comunicar mais rapidamente</strong></p><p>Aprenda os princípios de aprendizado de inglês que levam ao sucesso</p><p>Acelere o aprendizado de inglês independente do método que você está usando</p><p>Aprenda técnicas de memorização de vocabulário</p><p>Aprenda como se expressar com confiança e desenvolver a capacidade de fazê-lo mais rapidamente</p><p>Desenvolva boa pronunciação e sotaque em inglês</p><p><strong style=\"\">Use métodos usados por poliglotas para aprender línguas com sucesso</strong></p><p>Se você está aprendendo inglês, eu quero te ajudar à não fazer os &quot;erros&quot; que fiz ao aprender inglês. Quero te ensinar como falar com confiança, e entender bem - algo que para mim não foi fácil.</p>Eu me lembro da dificuldade de entender e também de se expressar. Depois de tanto tempo aprendendo, era irritante ter canadenses e americanos me pedindo para repetir quase todas as frases que eu dizia. Depois de seis anos aprendendo no Brasil, a minha pronúncia ainda era terrível e era dificílimo conseguir me comunicar sem me enrolar todo.<p>Com este método, que desenvolvi durante os últimos nove anos como consultor de ensino no Canadá, você irá conseguir falar inglês com mais confiança mais rapidamente, porque este é o nosso foco. A base do meu método não é ensinar a língua em si - mas ensinar como aprendê-la.</p><p>Eu demorei cerca de OITO anos para finalmente me tornar fluente. </p><p>Depois de seis anos aprendendo, ainda era bem difícil de conversar em inglês. </p><p>Eu comecei a aprender inglês aos 10 anos de idade no Brasil. Eu tive sorte de ir à uma escola boa de inglês por seis anos (esta era a duração do programa) e logo em breve mudei para o Canadá. Quando cheguei aqui, eu já conseguia me expressar (na maioria das situações, com uma certa dificuldade) e entender razoavelmente bem, porém seria um exagero dizer que eu já era &quot;fluente&quot;. Eu só consegui chegar em um nível fluente depois de dois anos morando aqui no Canadá. Olha que eu não era mal aluno, e a escola era boa!</p><p>Mas oito anos? Por causa disso, eu cheguei a simples conclusão que eu era &quot;péssimo de aprender línguas&quot;. Esta idéia justificava o fato da demora em me tornar fluente. Eu simplesmente não tinha o dom para aprender línguas. Só isso.</p><p>Porém, como eu sou teimoso (e de um certo modo também muito curioso), eu decidi tentar superar esta noção que eu era ruim de línguas. Então, comecei à aprender mais línguas - espanhol (mais fácil para nós brasileiros, né?), francês, alemão, e depois que me tornei fluente nestes (e no processo, desenvolvi um método de aprendizado de línguas), comecei a aprender italiano, holandês, russo (nestas três já consigo ter uma conversa legal) e continuei com outras. Aprender línguas se tornou uma paixão, assim como ensinar pessoas como aprendê-las como consultor. </p><p>O curso começa com uma lista de recursos sugeridos e também com a nossa filosofia de aprendizado. Em seguida, continuamos com como focalizar naquilo que queremos aprender e como aprender frases importantes. Também focalizamos em como usar cartões de memorização e métodos de memorização por associação para aprender vocabulário, e também como melhorar pronúncia e gramática sem stress. Um foco que se estende pela maioria do curso é a descrição da mentalidade de sucesso para aprender inglês com eficiência - algo que pode ser útil para alunos de todos os níveis.</p><p>Com estas ferramentas, você estará pronto para ter mais progresso no estudo de inglês. </p>", 
    "end_date": null, 
    "title": "Como Aprender Inglês Com Confiança", 
    "price": "20.00", 
    "instructors": "Gabriel Silva", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564808_f9f2.jpg", 
    "course_url": "https://www.udemy.com/aprenderingles/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T02:17:04Z"
}