{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">Learning how to use Modal Verbs properly is an important skill for the English student. In order to improve accurate communication, students must be able to understand and use Modal Verbs with accuracy and precision. This course is designed for English students who need to master the use of Modal Verbs at work with English clients, customers, and colleagues or for those studying English for academic pursuits.</p><p style=\"\"><strong style=\"\">Understand and Master the Use of Modal Verbs and the Active, Passive, and Subjunctive Modes of English Communication.</strong></p><p style=\"\">-Know when to use could, should, would, can, might, or may</p><p style=\"\">-Understand when to use the active, passive, or subjunctive modes</p><p style=\"\">-Learn which verbs work well with modals or create confusion and difficulty.<span style=\"\"></span></p><p style=\"\">-Master the creation of sentences using modal verbs in the affirmative, negative, interrogative, or negative-interrogative structures.</p><p style=\"\"><strong style=\"\">Knowing about Modes and Modals is a significant and vital skill in mastering the English language. </strong></p><p style=\"\">In this course, the student will first review the Active, Passive, and Subjunctive modes as a foundation for understanding the use of modal verbs. All of the English modal verbs and modal verb phrases will then be introduced and analyzed for their meaning and structure. Diagrams and inter-active exercises will be used to insure learning. Quizzes will be scheduled during the course so that the student can evaluate his/her progress. And finally, internet website references will be given to aid the student in gaining more practice and a greater degree of fluency. </p><p style=\"\">Coulda-Shoulda-Woulda are model verbs that show regret for action not taken. Enroll in this course before you have to use those words.<span style=\"\"></span></p>", 
    "end_date": null, 
    "title": "Coulda-Shoulda-Woulda: Modes and Modals", 
    "price": "20.00", 
    "instructors": "Mark Miller", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512010_c3cd_2.jpg", 
    "course_url": "https://www.udemy.com/coulda-shoulda-woulda-modes-and-modals/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T17:37:13Z"
}