{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>In this Intermediate course you will focus on some complex grammar and English Structures such as Reported Speech, or the Passive Structure. You will also practice vocabulary, listenings, readings, pronunciation, translations, dictations, spellings .You will be asked to complete some Review Tenses to make sure that you understand everything.</p><p>This “Intermediate\" course is equivalent to</p><ul><li>The “<strong>Preliminary English Test (PET)</strong>\" level from the Cambridge University in the UK.</li><li>The <strong>B1</strong> level in the Common European Framework of Reference for Languages (CEFR).</li><li>A <strong>57-86</strong> points at the <strong>TOEFL</strong> exam (Test Of English as a Foreign Language).</li></ul><ul><li>WHAT WILL YOU LEARN: (COURSE CONTENT)</li></ul><p>In this course you will learn the Past Simple, Past Continuous and their differences, the proper way to express habits in the past using Used to &amp; Would, Past Perfect Simple, the differences between Past Simple and Past Perfect, the Future simple, the structure \"to be going to\" and Present Simple for the future and their differences in use. You will also learn the Use of Gerunds and Infinitives. You will also learn the structure and our easy methods to create a sentence in Passive, in Reported Speech, and in First, Second and Zero Conditionals. Another important lesson you will learn will be the order of the adjectives in a sentence.</p><ul><li>WHAT WILLYOU DO:</li></ul><ul><li>Over 28 lectures and over 150 min of video content explaining in detail each grammar topic.</li><li>Downloadable material.</li><li>You will be asked to practice grammar, vocabulary, listenings, readings, pronunciation, translations, dictations, spellings  by doing review tests along the course.</li></ul><ul><li>WHAT WILL YOU GAIN AFTER THE COURSE:</li></ul><p>After finishing this course you will be able to have a deep knowledge of the English grammar, and be capable of reading and writing using advanced English grammar, as well as being able to have a solid grammar base to have a perfect conversation in English.</p><p>In this Advanced course you will focus on the most difficult verb tenses such as the Present Perfect Continuous and the Past Perfect Continuous, and you will also learn some complex structures like the Passive form in all verb tenses.</p><p>Taking this course is the way to perfect your grammar knowledge as you will learn the differences in use between most verb tenses.</p><p>You will be asked to do review tests in order to make sure you gained a solid knowledge of the English grammar taught in this course.</p>", 
    "end_date": null, 
    "title": "Curso de inglés: Intermediate - English for Spanish speakers", 
    "price": "30.00", 
    "instructors": "Kate Ochsner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725492_ec04_2.jpg", 
    "course_url": "https://www.udemy.com/curso-completo-ingles-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T12:27:42Z"
}