{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This “Beginners\" Course is focused on learning Basic English structures, grammar, vocabulary, listenings, readings, pronunciation, translations, dictations, spellings and it is equivalent to</p><ul><li>The “<strong>Starters</strong>\" level from the Cambridge University in the UK.</li><li>The <strong>A1</strong> level in the Common European Framework of Reference for Languages (CEFR).</li><li>A <strong>0-56</strong> points at the <strong>TOEFL</strong> exam (Test Of English as a Foreign Language).</li></ul><ul><li><strong>WHAT WILL YOU LEARN: (COURSE CONTENT)</strong></li></ul><p>In this Beginner course you will learn a lot of basic grammar, like how to identify a subject, the determiners a, an, the or nothing, the demonstrative pronous (this, that, these, those). We will show you how to structure a sentence in the correct way. The possessive \"´s\", the Present Simple, how to create a question using our \"WASV?\" and the Adverbs of Frequency.</p><p>The verbs \"There is\" and \"There are\", how to use the quantitatives \"some\" and \"any\", \"much\", \"many\" and \"a lot of\" and the interrogative pronouns \"How much\" and \"How many\". You will learn some verb tenses for the future like the Present Continuous and the structure \"to be going to\", the differences in use and grammar between the Present Simple and the Present Continuous, the modal verb \"Can\". You will also know how to create the Comparatives and Superlatives adjectives, and what to do when we want to say two verbs together.</p><ul><li><strong>WHAT WILLYOU DO:</strong></li></ul><ul><li>Over 17 lectures and 1 hour of content.</li><li>You will practice everything by doing grammar exercises.</li><li>Downloadable material.</li></ul><ul><li><strong>WHAT WILL YOU GAIN AFTER THE COURSE:</strong></li></ul><p>After finishing this course you will be able to have a basic conversation and understand basic readings. </p>", 
    "end_date": null, 
    "title": "Curso de inglés: Beginners - English for Spanish speakers", 
    "price": "30.00", 
    "instructors": "Kate Ochsner", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708872_3211_2.jpg", 
    "course_url": "https://www.udemy.com/curso-completo-ingles-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T19:31:12Z"
}