{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Curso de Inglês Básico</strong>, o objetivo número um é que você fala inglês bem sucedida. Este curso é simples e direta para economizar seu tempo. Este não é um curso de inglês mágica, mas é baseado em fatos históricos e tecnologia para que sua aprendizagem é tão rápido quanto possível.</p>\n\n<p>Há três pilares deste curso.\n\n  </p>\n\n\n\n\n\n\n\n<p>1)      As 10 palavras mais comuns em inglês, porque elas compõem 25% de qualquer texto em inglês. Pense nisso, um em cada quatro palavras em qualquer texto de inglês é uma das 10 palavras mais comuns. Sem dúvida, elas são as palavras mais importantes na língua inglesa. (25% do primeiro curso + 25% neste curso = 50% do vocabulário de qualquer texto em inglês)\n\n  </p>\n\n\n\n\n\n\n\n<p>2)      Tempos verbais no presente para que você saiba como fazer frases afirmativas, negativas e interrogativas no presente em inglês.\n\n  </p>\n\n\n\n\n\n\n\n<p>3)      Como transformar 5000 palavras de seu vocabulário português ao seu vocabulário inglês lembrando 10 sufixos para que você possa conversar em inglês.\n\n  </p>\n\n\n\n\n\n\n\n<p>Bonus: Criei um grupo fechado no Facebook especialmente para alunos deste curso de inglês básico, para conhecer outros alunos do curso e conversar em inglês em tempo real via Skype quando e onde você quiser. (Há guias para conversar que você pode baixar no grupo.)\n\n  </p>\n\n\n\n\n\n\n\n<p>Reflita. Aprender inglês não é difícil e você não precisa ser um gênio para aprender a falar inglês de forma fluente e eficaz.\n\n  </p>\n\n\n\n\n\n\n\n<p>Tudo o que precisa é um bom professor, que tenha interesse em que você aprenda naturalmente sem enrolação. E foi exatamente assim que planejei esse curso de inglês básico. Exploraremos juntos os mesmos modelos que a Língua Inglesa e a Língua Portuguesa tem em comum.\n\n  </p>\n\n\n\n\n\n\n\n<p>Se você sempre sonhou em falar inglês fluentemente, nesse curso de inglês básico você aprenderá mais vocabulário e num curtíssimo espaço de tempo do que em qualquer outro curso de inglês que já tenha feito.\n\n  </p>\n\n\n\n\n\n\n\n<p>Clique \"fazer este curso\" e começa a falar inglês hoje.\n\n  </p>", 
    "end_date": null, 
    "title": "Curso de Inglês Básico: Entenda 50% de Inglês em 150 Minutos", 
    "price": "30.00", 
    "instructors": "Joshua Smith", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/826050_eff0_4.jpg", 
    "course_url": "https://www.udemy.com/cursodeinglesbasico50/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T12:22:13Z"
}