{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Do you participate in <strong>English-language meetings</strong>?</p><p>Do you need to prepare an <strong>agenda</strong> in English?  Write the <strong>minutes</strong> in English?</p><p>And is <strong>English your second language</strong>?</p><p>This course is specifically for non-native English speakers needing skills in planning and participating in meetings.  So if you work in <strong>administration</strong> or <strong>management</strong>, for a <strong>large company</strong> or <strong>small business</strong>, and if you have <strong>lower-intermediate or intermediate English language skills</strong> then this course is for you!</p><p>I'm a professional, qualified and experienced English trainer with over 9 years' experience teaching business English to companies and individuals.  I base my training on many years' experience working in the public and private sectors in Australia, and believe that learning by doing is the most effective way.</p><p>So in this course you'll <strong>listen</strong>, <strong>watch</strong>, <strong>read</strong>, <strong>write</strong> and <strong>produce</strong> your own <strong>Invitations</strong>, <strong>Agendas</strong>, <strong>Minutes</strong> and more!  You'll have <strong>direct contact with me</strong>, your teacher, and I'll work with you every step of the way.</p><p><strong>By the end of this course you will be a confident and effective communicator in English, and a professional at planning and participating in meetings!</strong></p>", 
    "end_date": null, 
    "title": "Easy Business English for Meetings", 
    "price": "20.00", 
    "instructors": "Jacqueline Seidel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612904_9d96.jpg", 
    "course_url": "https://www.udemy.com/english-for-meetings/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T16:35:47Z"
}