{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This course is for English learners who want a better understanding of English Grammar. Understanding English grammar is key to improving your speaking, writing and test scores. Most students skip over the basics of English grammar and this causes many problems later in their learning. Think about it. If an athlete were to skip the basics of their sport, would they be able to master it? The answer is no and its the same for language. Building a solid foundation is just as important as learning the higher level 'fancy' grammar. And the truth is, if you spend a little extra time learning this now, you will save yourself a whole lot of time down the road.</p><p>Build a strong English grammar foundation and the rest will be easy. In this course you learn:</p><ol><li>The parts of an English sentence<span></span></li><li>Nouns</li><li>Verbs</li><li>The Other Words - adjectives, adverbs and more</li><li>prepositions</li><li>Parallel structure </li></ol><p>Each lesson provides an explanation followed by examples and practice questions.</p><p>In only a few days you will build a complete understanding of common English sentences and improve the structure of your own. You will easily be able to build upon your English grammar and master advance concepts thanks to a strong grammar foundation. Make life easier and take this course now!</p>", 
    "end_date": null, 
    "title": "Easy English Grammar - Improve your English in 6 Easy Steps", 
    "price": 0, 
    "instructors": "Scott Mendoza", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656678_318e_2.jpg", 
    "course_url": "https://www.udemy.com/easy-english-grammar-improve-your-english-in-one-day/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T01:23:46Z"
}