{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Do you organise in <strong>English-language meetings</strong>?  Take <strong>phone calls</strong> from English-speaking clients?  Need to <strong>send English emails</strong>?  <strong>Attend trade fairs</strong> where English is spoken?</p><p><span></span>And is <strong>English your second language</strong>?</p><p>This course is for non-native English speakers needing frontline skills in:</p><ul><li>planning meetings</li><li>preparing meeting agendas and writing the minutes</li><li>taking phone calls and messages</li><li>greeting visitors to the company</li><li>sending English emails about your company, products or services</li><li>talking to clients or potential customers</li></ul> <p>So if you work in administration or sales, and if you have lower-intermediate or intermediate English language skills then this course is for you!<br></p><p>I'm a <strong>professional, qualified and experienced English trainer</strong> with over 9 years' experience teaching business English to companies and individuals here in Germany. I base my training on many years' experience working in the public and private sectors in Australia, and believe that learning by doing is the most effective way. </p><p>In this course you'll listen, watch, read, write and produce your own meeting Invitations, Agendas, Minutes and more! You'll hear phone calls, take messages, write about your products and services.  </p><p>And - you'll have direct contact with me, your teacher, and I'll work with you every step of the way.</p><p>By the end of this course you will be a confident and effective communicator in Business English!</p>", 
    "end_date": null, 
    "title": "Effective Business English for Service Staff", 
    "price": "30.00", 
    "instructors": "Jacqueline Seidel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612914_dd87_2.jpg", 
    "course_url": "https://www.udemy.com/business-english101/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T16:41:46Z"
}