{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong></strong>An ideal <strong>starter course</strong> if you have an <strong>elementary level</strong> of English and would like to learn English online to help your career!</p><p>In this course, you will learn how to: </p><ul><li><strong>Greet</strong> new business partners</li><li><strong>Introduce yourself </strong><span></span>and your colleagues confidently</li><li>Use and conjugate the verb<strong> \"to be\" </strong>correctly</li><li>Dictate <strong>email contact information</strong> effectively</li></ul><p>You will also get chance to develop your <strong>job titles </strong>vocabulary.</p><p>You will then learn how to:</p><ul><li>Talk about your work routine using the most basic English tense: the present simple</li><li>Ask questions about other people's routines</li><li>Understand texts connected with people's working lives</li></ul><p>You will also get chance to develop vocabulary connected to <strong>work and leisure</strong> activities.</p><p>All <strong>5* English</strong> online classes aim to give relevant, modern English for business.  You can enjoy learning English for your career (or leisure!) with courses that integrate focus on <strong>grammar</strong>, <strong>vocabulary </strong>and <strong>pronunciation</strong> with <strong>real-life situations</strong>.  Modules are presented using a <strong>variety of formats</strong> to help you learn effectively.</p><p><br></p><p>Этот курс идеален для Вас, если Вы недавно закончили курс нулевого уровня (beginners) и хотите укрепить Ваши навыки для использования английского на работе!</p><p>После этого курса Вы сможете:</p><ul><li>Приветствовать Ваших коллег и сотрудников на работе</li><li>Уверено и профессионально представить себя и своих коллег</li><li>Правильно и четко диктовать электронные контактные данные</li></ul><p>Вам так же удасться развить Ваш словарный запас по теме: <strong>должности на работе</strong>.</p><p>За тем Вы изучите, как:</p><ul><li>Рассказать о Вашем рабочем графике, используя основное английское время “<strong>present</strong><strong> </strong><strong>simple</strong>”</li><li>Задавать вопросы о рабочих графиках других</li><li>Разбираться в описании работы других людей</li></ul><p>Вам так же удастся развить Ваш словарный запас по теме деятельности <strong>на работе и в свободное время</strong>.</p><p>Все курсы <strong>5* </strong><strong>English</strong> предлагают актуальный, современный английский язык для бизнеса. Вы можете участвовать в программе, которая связывает английский язык с необходимыми: <strong>грамматикой</strong>, <strong>словарным запасом</strong> и <strong>произношением</strong> для <strong>реальных ситуаций</strong> на работе. Лекции представлены в <strong>различных форматах</strong> для их эффективного изучения.</p>", 
    "end_date": null, 
    "title": "English Basics: Start Using English At Work Today!  ", 
    "price": "20.00", 
    "instructors": "Rebecca Matveyeva", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585404_7f75_2.jpg", 
    "course_url": "https://www.udemy.com/english-basics-start-using-english-at-work-today/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T13:40:46Z"
}