{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>The apostrophe is something you need to get right, every time. A single misplaced apostrophe in that CV or that manuscript you've sweated over for years? It could undo all your hard work in a single moment. Because if there's one thing employers, editors and educated readers <em>will</em> judge you on, it's how you use the apostrophe. </p><p>But the apostrophe needn't be difficult - it just takes a little bit of thought and a teacher who knows how to make the rules clear, easy to remember and even fun! That's where<em> English Grammar: Apostrophe Beginner to Apostrophe Expert</em> comes in.</p><p>In <em><em></em><em>English Grammar: Apostrophe Beginner to Apostrophe Expert</em><em></em></em>, Cambridge writing tutor Dr Clare Lynch guides you from the basics to professional mastery, step by step.</p><p>You'll start by mastering the two main uses of this tricky little punctuation mark – and build up your knowledge from there.</p><p>By the end of this course, you'll not only be using the apostrophe with ease and confidence. You'll also have a more in-depth knowledge than the vast majority of professional writers, editors and proofreaders. </p><p>This comprehensive course gives you:</p><ul><li>Clear explanations and illustrations of the most important uses of the apostrophe</li><li>Loads of quizzes and exercises throughout the course, to help you cement your knowledge</li><li>Step-by-step guidance on avoiding the most embarrassing apostrophe blunders</li><li>Simple ways to avoid common confusions – like the difference between \"its\" and \"it's\", \"who's\" and \"whose\" </li><li>Advice on how to prevent that rogue, credibility-zapping apostrophe from slipping through the net</li><li>Answers to advanced questions, like<em> 100's or 100s</em>?<em> CVs or CV's</em>?</li><li>A downloadable \"cheat sheet\" you can refer to again and again</li></ul>", 
    "end_date": null, 
    "title": "English Grammar: Apostrophe Beginner to Apostrophe Expert", 
    "price": "20.00", 
    "instructors": "Dr Clare Lynch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662038_a939_2.jpg", 
    "course_url": "https://www.udemy.com/apostrophe/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T13:28:39Z"
}