{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Welcome to <strong>English 20/20</strong>! </p><p><em>The guide to master grammar in 20 days @20 minutes/day! </em></p><p>This course is designed to help students <strong>master English grammar - Fast</strong>! </p><p><strong><u>Contents</u> </strong>- The course includes <strong>~4.5 hours of video instructions </strong>spread across more than 35<strong> lectures </strong>and more than <strong>20 quizzes</strong>. </p><p>The course explains concepts in a <strong>step by step process, </strong>uses many <strong>examples </strong>to explain the concepts and <strong>colorful animation </strong>to walk through the process one step at a time for maximum retention. </p><p>The course starts with <strong>introduction</strong>, explains the  unique <strong>methodology</strong>, plans out the entire <strong>roadmap </strong>from beginning to the end of course. It also has a <strong>stage gate review </strong>at the end of each lecture to ensure the students are able to validate their knowledge and know exactly <strong>where they stand </strong>in the journey to master English grammar at any point during the course! </p><p><strong><u>Audience</u> </strong>- The course is specifically optimized and tailored for students who are learning <strong>English as a second or third (or even fourth!) language.</strong> However, others may find it beneficial as well to revise their knowledge. </p><p>There is an initial assessment test which will help the students decide if this course will benefit them and if it is right for them before they sign up for the course.</p><p>If you are unsure about correct use of grammar (tenses, helping verbs, form of verbs etc.) and would like to learn these concepts in a <strong>simple step by step process quickly</strong> then you may consider this course. </p><p>Wishing you the best in language skills!</p>", 
    "end_date": null, 
    "title": "English Grammar 20/20 ", 
    "price": "20.00", 
    "instructors": "Sushil Banubakode", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/768072_7918_13.jpg", 
    "course_url": "https://www.udemy.com/english2020/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-19T21:07:18Z"
}