{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><em>Kishorvivian says:</em></p><p><em>Brilliant study, straight approach and simple teaching. No fuss. No waste of time. The course is very useful. </em></p><p>  \t<em>Ariful says:</em>  </p>  <p>  \t<em>Wow...it is very helpfully for me thanks!</em>  </p>  <hr>  <p>  \t          Tired of Americans telling you that they didn't understand you, or asking you to speak slower?  </p>  <p>  \t        Confused by English words or phrases you've never heard before?  </p>  <p>  \t      Want to get better with U.S. grammar to sound more like an American?  </p>  <p>  \t      This course is perfect for anyone from South Asia who wishes to refine their English and improve their speaking, listening, reading and writing.  </p>  <p>  \t      You'll learn the biggest problem most South Asians have with pronunciation and how to fix it ... one simple technique you can use right now to dramatically improve Americans' ability to understand you ... and find out which popular 'Hinglish' words don't make any sense to Americans!  </p>  <p>  \t      Perhaps most importantly, it covers words you may be using which are actually quite offensive to people in America!  </p>  <p>  \t      Whether you live in the U.S., work for an American company, or interact with Americans in your personal life, this course can massively increase your confidence in communication.  </p>", 
    "end_date": null, 
    "title": "English Upgrade for Indians and South Asians", 
    "price": "20.00", 
    "instructors": "Noah Detweiler", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/379552_8edf_23.jpg", 
    "course_url": "https://www.udemy.com/english-for-indians/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T01:06:20Z"
}