{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>‘English Small Talk’ is an e-learning course created specifically for improving communication skills.</p><p>The course provides best tips and vocabulary for having small talk. \nOur tips can be used if you would like to speak with new people. These \nbest practices are usable in any situation e.g. work, conference, \nholiday, meeting, etc.</p><p><strong>The course will help you to</strong>:</p><ul><li>significantly i<strong>mprove your communication and networking skills</strong>,</li><li>have a better contextual awareness, <strong>using the right words and expressions</strong>,</li><li><strong>start conversations with new people </strong>when you most need it<strong>.</strong></li></ul><p>By learning with us you will be <strong>more confident in establishing new connections</strong>.</p><p><strong>What are the requirements?</strong></p><ul><li>Students will need to have a minimum pre-intermediate level of English.</li><li>Motivation to further improve speaking skills.</li></ul><p><strong>What am I going to get from this course?</strong></p><ul><li>Ideas and vocabulary how to start a great networking conversation.</li><li>Use real-life expressions like the native speakers, and increase your credibility.</li></ul><p><strong>What is the target audience?</strong></p><ul><li>Do take this course if you intend to speak more confidently when meeting new people.</li><li>The course is ideal if you are using English in a professional or private environment.</li><li>Students should be at a pre-intermediate level.</li><li>Do not take this course if your level is beginner (A1) because the course uses more advanced vocabulary.</li><li>This is a course for ESL (English as a Second Language) speakers with minimum pre-intermediate proficiency level English (B1 to C2).</li></ul><p><strong>Enroll today</strong> and take the very next step towards excellent small talk skills, and successful networking.</p>", 
    "end_date": null, 
    "title": "English Small Talk", 
    "price": "35.00", 
    "instructors": "The Business English Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725900_6fbc_2.jpg", 
    "course_url": "https://www.udemy.com/small-talk-basics/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T18:10:20Z"
}