{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Do you have difficulty in memorising the new words?</p>  <p>You cannot make sure how you can pronounce English words correclty? Which English articles you want to read likewise Chineese when you start to read ? You have grammer knowledge but which words you didn’t know makes harder to understand that you read.</p>    <p><strong>You want to pass Toefl exam with high score. And you afraid how will you pass?</strong></p>    <p><em>Well, you’re in right place? You are not alone. </em></p><ul><li>In the beginning every task looks hard and sometimes be impossible but there is one thing you should learn about learning. You can learn everything! If you work hard day by day. Any exam can not stand out in front of you!!</li><li><span></span>I can teach you  hard english words with comic frames. For better study life and better working life</li><li><span></span>I chose to teach English, an easy and fun way.</li></ul>  <p>In this course;</p><ul><li>I prepared 20 HD videos and 20 Quizes thats include 200 Toefl words.</li><li><span></span>This course for which people want to improve english skills with out no stress.</li><li>For 200 memorable words with comic frames.</li></ul>  <p><br></p><p>Take this class and unlock to English knowledge!<br></p><p>Best English vocabulary gives you access all English article. %90 of Internet contents include English language! Do you imagine in how much informations you will reach with better english vocabulary?<span></span></p>  <p><strong>Click the button to enroll in this course now! Improve your English and improve your life!</strong></p>", 
    "end_date": null, 
    "title": "English Vocabulary. Learn 200 Toefl Words", 
    "price": "30.00", 
    "instructors": "Sermin İletir", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700856_1248_2.jpg", 
    "course_url": "https://www.udemy.com/english-vocabulary-learn-200-toefl-words/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-18T16:28:11Z"
}