{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>Course Description</strong><br></p>\n\n<p>\n\n\n\n\n\nLearning English takes time and mastering Business English takes even longer. Not having the English language skills to communicate clearly in your professional life can have a big impact on your career. I designed this course for professionals learning English who need English language skills to build credibility and relationships with colleagues.   </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course you will:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Increase your confidence when learning and speaking English</li><li>Review English language phrases that help you sound more professional and credible  in English</li><li>Learn English prepositions of position and location</li><li>Understand the difference between a formal and casual  English presentation</li><li>Use tone to change the meaning of an English sentence</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This English course will take you approximately one hour to complete. It is designed to give you specific and targeted language to help you prepare for a presentation in English.    <br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Contents and Overview</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong>This course is organized into three parts. The first part looks at building English skills to help you prepare for your presentation. The next part reviews English key phrases so that you can maintain the attention of your audience and be sure they understand your message. Finally we look at using specific English  phrasing to help you when you get nervous and are unable to manage questions or comments from your English speaking audience. </p>\n\n\n\n\n\n\n\n\n\n<p>At the end of this course you be able to stand calmly  in front of a group of people and speak English! You will have the English language skills to interact with your audience and you will know how to avoid difficult situations. <br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why is this course unique?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>This course is unique because it is focused on English skills and key phrases rather than grammar. Although there is an ESL grammar component to help you review some of the basics. </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "English  -  Learn English for business", 
    "price": "20.00", 
    "instructors": "Cecilia Bax", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670610_f42b_2.jpg", 
    "course_url": "https://www.udemy.com/english-presentation-skills-for-non-native-speakers/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T20:46:21Z"
}