{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Gracias a uno de nuestros sponsors, este curso ahora es impartido gratuitamente</strong><br></p><p><em class=\"redactor-inline-converted\">Un review de un alumno (5 estrellas):<br></em><strong class=\"redactor-inline-converted\">\"</strong><strong class=\"redactor-inline-converted\">Excellent Course for Developing a Native Sounding Accent</strong></p>\n\n<p>This course offers a fun learning experience! Sebastian has a contagious enthusiasm and energy. He creates an environment that eliminates the stress that often accompanies language learning. His teaching style is also well paced, which makes responding to the practice exercises easy and confidence building. <strong class=\"redactor-inline-converted\">The one thing that sets this course apart from many others is Sebastian's excellent English accent. His pronunciations are amazingly accurate</strong>. For those language learners who are trying to sound like a native English speaker, I highly recommend this course.\"</p>\n\n<p><em class=\"redactor-inline-converted\">Autumn. (Teacher and ESL tutor, native English speaker)</em></p>\n\n<p><em class=\"redactor-inline-converted\">Queridos Amigos:</em></p>\n\n<p>¿Por qué aprender inglés? El inglés es indispensable. Se habla en oficialmente en 53 países, alrededor de 400 millones de personas alrededor del mundo hablan este idioma.</p>\n\n<p>Una de las razones más importantes para aprender inglés, es que este lenguaje es dominante en cuanto a los medios de comunicación. Si quieres leer los últimos libros sin esperar por traducciones, ver los estrenos de películas sin esperar por subtítulos, o si quieres escuchar música sin tener que buscar las letras de las canciones, debes entender inglés.</p>\n\n<p>Aprender un idioma extranjero puede parecer una tarea muy grande y difícil de alcanzar. Sin embargo, al esforzarte por aprender vas a descubrir un mundo de posibilidades, podrás valorar diferentes culturas y formas de vida, y especialmente tendrás la oportunidad de hacer nuevos amigos en otras partes del mundo.</p>\n\n<p>Espero que al aprender Inglés se te abran muchas puertas, ya sea de estudio o trabajo. Sinceramente anhelo que tu calidad de vida mejore y que puedas alcanzar tus sueños.</p>\n\n<p>En este curso encontrarás lo siguiente:</p>\n\n<ul><li>Aprende de “experiencias reales del día a día\" </li><li>(He vivido 7 años en Nueva Zelanda realizando diferentes empleos)</li><li>Aprende practicando (prácticas incluidas en los videos)</li><li>Gratis, un libro en formato electrónico de frases</li><li>Acceso a un grupo de conversación de Google Hangouts</li><li>Actualizaciones constantes</li></ul>\n\n<p>Estas son las reglas:</p>\n\n<ul><li>Subiré videos todas las semanas (max 400 lectures)</li><li>Responderé en menos de 24 hrs</li><li>Tu debes hacer preguntas</li><li>Tu practicaras (donde sea, con quien sea, grupo Google Hangouts)</li></ul>\n\n<p>Muchas Gracias,<br></p><p>Sebastian C.</p>", 
    "end_date": null, 
    "title": "English at work: Inglés en el trabajo", 
    "price": 0, 
    "instructors": "Sebastian Cortes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513292_f528_2.jpg", 
    "course_url": "https://www.udemy.com/mejorfuturo/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T02:06:19Z"
}