{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">Learning a language is not easy and requires much effort.  But we can&#039;t imagine our life without English. If we don&#039;t know English we&#039;ll not be able to step with the highly civilized world. This is a course to help you learn the use of English tenses and their formation, as well. </p><p style=\"\">Learn English Quickly Using the Structural Approach Method</p><p style=\"\">•\tThe Auxiliary Verbs as the Principal Components of Tenses</p><p style=\"\">•\tThe Verb “to be&quot;</p><p style=\"\">•\tThe Verb “to do&quot;</p><p style=\"\">•\tThe Verb “to have&quot;</p><p style=\"\">•\tThe Modal Verbs</p><p style=\"\">Everything is Introduced Quite Simple and Comprehensible.</p><p style=\"\">The method of course teaching is based on the structural approach of language teaching. This is a special method which is effective and in a rather short period of time the result is obvious. In order to better understand the essence of this method, imagine that you build a house. Each brick is of special significance. You start from the very ground up. If you learn a language in this way, you&#039;ll be able to easily master multiple languages.</p><p style=\"\">Overview</p><p style=\"\">This short course contains 27 lectures and 32 minutes of content. Here you can quickly master the most important keys to English learning.</p><p style=\"\">The auxiliary verbs to be, to do and to have are of special relevance which is obvious in the first lecture. If you master the use of these verbs you can see that there&#039;s no difficulty in language learning process.  Learn these verbs as words which bear a meaning of action and their features in grammar and then you can easily master the tenses which are formed with them. </p><p style=\"\">A language is well learned logically. When you know that the past form of the verb to be is was/were, you&#039;ll easily master the past continuous tense. This is the essence of the structural approach of language learning/teaching. </p><p style=\"\">After the course you will be able to use the principal tenses and modal verbs in English. It will help you to avoid several common mistakes referring the English grammar. Build the core and then try to expand  your knowledge tower!</p>", 
    "end_date": null, 
    "title": "English Grammar for Beginners: The Verb", 
    "price": "20.00", 
    "instructors": "Ruzan Mkhitaryan", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372670_05f8_2.jpg", 
    "course_url": "https://www.udemy.com/english-grammar-for-beginners-the-verb/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T19:58:16Z"
}