{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This course was specially designed to help <strong>English learners</strong> overcome one the most important parts of speaking a new language, their <strong>pronunciation </strong>or <strong>accent</strong>.</p><p> <strong>How often do people ask you to repeat something because they cannot understand your English? </strong></p><p><strong>How many times do you not speak English confidently in because you are unsure if you will be understood?</strong></p><p><strong>Do you need to give a presentation or interview in English?</strong></p><p>Now you do not have to worry. This course will give you <strong>everything </strong>you need to <strong>speak English clearly and fluently</strong>. We cover all the sounds of the English language and teach you how to sound like a native speaker. Every lesson is in video format so you are able to watch and copy the native speaker produce the sound and words.</p><p>Other courses just give you a few examples and expect that to help you change your accent. We know that won't help, so we have provided you with a wide variety of practice and methods. The course has worked for 1000's of students. Its time for you to try.</p><p><strong>Stop wasting time and money on private English tutors or expensive classes! Now all you need is five minutes a day!</strong></p><p><strong>We include a FREE English assessment with every purchase!</strong></p><p><strong>Sign up NOW and change your future! Speak better English.</strong></p>", 
    "end_date": null, 
    "title": "English Pronunciation - Learn to Speak Like a Native Speaker", 
    "price": "20.00", 
    "instructors": "Scott Mendoza", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508000_e382_4.jpg", 
    "course_url": "https://www.udemy.com/goodbye-accent-english-accent-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T10:54:45Z"
}