{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\"> From completing this course you will have better knowledge of the English Language, particularly reading, writing, speaking and listening. Importantly, on completion of this course you have good idea of the language structures in the English Language, for example, informal and formal language. More importantly you will gain a good understanding of the English grammar, such as past, present and future grammar. Additionally, you will understand how to compare things, places or people using comparatives and superlatives and being able to show differences between them using contrast words. You will learn how to express your opinions, likes and dislikes, using appropriate words learned. You would learn appropriate words used in informal and formal language, as well as appropriate words used in different forms of grammar. In this course worksheets and power points are included. You will have the opportunity to work through the power points with the worksheet provided. The course will take approximately four to six weeks to complete, depending on how often you can commit to your lessons and completing the worksheets. The course is structured by working through a power point provided with a worksheet. Taking this course will be very useful for anyone who wants to gain better employment opportunities or gain access to higher education. This is because the English Language is the most spoken language in the world, therefore to do this course will enable you to gain better opportunities in society. In particular, doing this course will help to improve writing sentences, paragraphs and letters. Importantly you will also be given speaking activities, therefore the time to practice to improve your speaking skills. You will learn how to express your opinions using the correct English terminology. Overall this course will be good for you to do, if you require or want to learn English more in depth. This course should be taken by people who have some knowledge of the English Language. <br style=\"\"></p>", 
    "end_date": null, 
    "title": "English language course at entry three and level one", 
    "price": "20.00", 
    "instructors": "Lila Rozario", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368560_0f6e_6.jpg", 
    "course_url": "https://www.udemy.com/english-language-course-at-entry-three-and-level-one/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T03:23:27Z"
}