{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">Understanding English Parts of Speech is basic to understanding English grammar and becoming fluent either orally or in written form. Often confusion arises when using a pronoun incorrectly, or not knowing the difference between an adjective and adverb.</p><p style=\"\"> After taking this course, you will be able to identify all eight English Parts of Speech, understand the difference between them, and use them appropriately. </p><p style=\"\">Upon completion of this course, you will be able to:</p><p style=\"\">-recognize the eight English Parts of Speech</p><p style=\"\">-understand the difference between them and use them properly</p><p style=\"\">-participate in conversations or write letters without Parts of Speech errors</p><p style=\"\"><strong style=\"\">Learning English Parts of Speech is a fundamental skill in learning, understanding, and using English grammar correctly!!</strong></p><p style=\"\"><strong style=\"\"><span style=\"\"></span></strong>Do you know when to use a subjective or objective pronoun? Do you understand that when you answer, &quot;Good,&quot; when asked, &quot;How are you?&quot; it is incorrect. (You should answer, &quot;Well,&quot; or &quot;Fine.&quot;) Do you know when to capitalize a noun? This course will help you to understand the answers to these questions. Just make sure you not only listen to the lectures, but also do the additional work available to you with the internet references attached to each lecture. This course will also offer quizzes regularly so that you can monitor your own progress and focus on areas that need some further work.</p><p style=\"\">The lectures in this course are also included in the course, &quot;Making Dollars and Sense Out of English Verbs,&quot; so you may want to consider taking that longer, more complete course.</p><p style=\"\"><strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "English Parts of Speech: A Survey", 
    "price": "20.00", 
    "instructors": "Mark Miller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501930_85e4_2.jpg", 
    "course_url": "https://www.udemy.com/english-parts-of-speech-a-survey/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T13:36:01Z"
}