{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Congratulations! If you are reading this you are probably in your secondary school years.</p><p><br></p><p>Essay Writing is slightly different now.  Instead of writing stories, you are now required to write personal recounts of your own experiences.  </p><p><br></p><p>However, many students do not do well because they fail in one important aspect: Reflection.  They will place little emphasis on this aspect of personal recount essay writing.</p><p><br></p><p>In this course, you will learn:</p><p><br></p><p>- The objective of a personal recount essay</p><p>- How to plan an essay outline</p><p>- How to get inspiration for your plot or content</p><p>- How to write an attention-grabbing introduction</p><p>- How to write the narrative for the body paragraphs</p><p>- How to describe and build-up to the climax</p><p>- How to transition smoothly to the Reflection paragraphs</p><p>- How to reflect and uncover a deeper meaning behind your experience</p><p>- How to write the reflection for the body paragraphs</p><p>- How to conclude and end strongly.</p><p>I will personally REVIEW your essay and give you my comments.  I will teach you how to improve and write better in your weaker areas.<br></p><p><br></p><p>I will be using a real-life experience of mine as an example to show you how to write the story.  Hopefully, other than just learning how to write an exceptional essay, you will uncover a more profound meaning behind my story and learn from it as well!</p>", 
    "end_date": null, 
    "title": "Essay Writing: Personal Recount / Reflective", 
    "price": "50.00", 
    "instructors": "Mr Jerry Lee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648622_32e3_3.jpg", 
    "course_url": "https://www.udemy.com/essay-writing-personal-recount-reflective/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T07:11:05Z"
}