{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t  Words from your tutor: Ms. Susan Jones: &quot;Welcome!  </p>  <p style=\"\">  \t                                 The IELTS exam has become one of the most popular public examinations worldwide for   students wishing to gain entrance to an English-language academic   institution. Rather than getting a pass or fail the candidates receive a   score from one to nine with most UK universities typically requiring a   score of 6 or 6.5.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">At IDEA almost 99 percent of recent students have achieved the score they needed.</strong><br style=\"\">  \t<br style=\"\">  \t                                  You need to take the <strong style=\"\">IELTS test</strong>   if you are applying for a job or to study in a college or university  in  an English-speaking country or if you are migrating to those  countries,  we hope you will enjoy your time with us.  Good luck!&quot;  </p>  <p style=\"\">  \t                                 In this course you will learn 4 components of IELTS test:  </p>  <p style=\"\">  \t<strong style=\"\">LISTENING</strong>  </p>  <p style=\"\">  \t                                 In the IELTS test, time is your enemy. Candidates who have taken the   test and did not perform as well as they had hoped often complain that   they were unable to give all the answers in the Listening Test because   the tape was too fast. However, with our course this problem will be  solved by constant listening to your English tutor - Ms. Susan Jones.  You will soon get used to our British accent.  </p>  <p style=\"\">  \t<strong style=\"\">READING</strong>  </p>  <p style=\"\">  \t                                 The faster and more accurately you read, the more questions you will be   able to answer. In all the tests, the instructions, the example, and  the  questions themselves need to be read quickly, and must be well   understood in order for you to have more time to find the answers.  </p>  <p style=\"\">  \t<strong style=\"\">WRITING</strong>  </p>  <p style=\"\">  \t                                 Write short academic-style essays, including describing data or  processes and presenting arguments coherently and cohesively.  Interpret  and describe graphical information or write a letter responding to a  given situation.  In this course you will find yourself in many such  situations in order to practice your writing skills.  </p>  <p style=\"\">  \t<strong style=\"\">SPEAKING</strong>  </p>  <p style=\"\">  \t                                 Make contributions to discussions on a variety of concrete and more  abstract topics. Fluency, accuracy, range and relevance are practised.  Review and practise all aspects of speaking during the course.  </p>  <p style=\"\">  \t<strong style=\"\">GRAMMAR</strong>  </p>  <p style=\"\">  \t                                 While it is true that not all words and phrases given as answers to   questions in the Listening and Reading Tests need to be grammatically   correct, it is often possible to work out the correct answer by using   your knowledge of grammar. We will focus on grammar in detail during the  course.  </p>", 
    "end_date": null, 
    "title": "Express IELTS Preparation Course", 
    "price": "50.00", 
    "instructors": "IDEA Consultancy, Examizy", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/141860_c96b_5.jpg", 
    "course_url": "https://www.udemy.com/express-ielts-preparation-course/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-04T12:57:37Z"
}