{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Stop writing bad business emails today! Learn how to organize them, what language to use, and avoid those shameful mistakes that even native speakers make.</p><p><strong>Master Formal Emails Quickly With This Comprehensive Course</strong></p><li>Become proficient in email etiquette</li><li>Compose properly structured emails</li><li>Learn most commonly used correspondence phrases</li><li>Master the necessary formal tone grammar</li><li>Become competent in essential punctuation rules</li><li>Avoid embarrassing mistakes that can cost you<br><strong><br>Learn what makes an email formal and informal</strong></li><p><br>Writing badly written emails can keep you from getting a promotion, a raise, or a better paying job. Using casual language instead of formal can be very embarrassing and make you look uneducated. And when you leave a bad first impression, it is almost impossible to correct.</p><p>Once you've learned what's in this course, you will be an articulate, well-mannered, knowledgeable, and educated email communicator. Whether you're emailing your bosses, prospective clients, or your friends, you will know exactly how to write it, what to avoid, and what to make sure you do correctly. This will make you stand out from other people sending emails because you will know what most of them do not.</p><p><strong>Contents and Overview</strong></p><p>You will start the course by learning the essential <em>Email Etiquette</em>. Most of these lessons are about issues that are often ignored at the risk of being impolite or annoying to your recipients. The second course section is <em>Email Structure</em> where we will break down the email into its parts and cover everything you need to know about each of those components.</p><p>The following three sections are language related: <em>Vocabulary</em>, <em>Grammar</em>, and <em>Punctuation</em>. These are often those big boring language learning topics. But here, you will learn only those points that are essential when writing good formal as well as informal emails.</p><p>Each section wraps up with a carefully created downloadable cheat sheet and quiz to test your knowledge. I do want you to learn this, and to make sure that you remember what you've learned.</p><p>And once you've completed this course, you will have a new assortment of language tools to give you the advantage at whatever you're setting out to do in your life and business. This will help you build a good reputation, communicate better, and create new opportunities for your career.<br><br><em>For the price of just a few private lessons you get a comprehensive course that would cost much more in the real world. You get hours of training, quizzes, and downloadable materials. And you get support if you have any further questions. On top of that, you have Udemy's money back guarantee. So you really can't go wrong here. <strong>Get started right now!</strong></em><br></p>", 
    "end_date": null, 
    "title": "Formal Email Writing - Business English", 
    "price": "25.00", 
    "instructors": "Logan Susnick", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620526_a52b.jpg", 
    "course_url": "https://www.udemy.com/business-english-formal-email-writing/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T17:43:36Z"
}