{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>Modern ve gerçek konuşmalardan edinilen ses ve metinler aracılığıyla İngilizce öğrenin! </strong></p><p>Gerçek konuşmalara odaklanarak, öğrenci gerçek bir konuşma gerçekleştirdiği zamanlar ve dinlediklerini kavrama üzerinde özgüven kazanır. Hızlı kursumuz öğrencilerin kavrama kabiliyetini geliştiren ve gerçek sosyal durumlarda kullanabileceği önemli ifadeleri öğrenmesini sağlayan materyalleri sunmaktadır.</p>\n\n<p>İngilizce dili öğrencileri: konuşmalar aracılığıyla öğrenin ve kendinizi İngilizcede daha iyi ifade edin!</p>\n\n<p>Gerçek konuşma gerçekleştirerek kendinize olan güveninizi arttırın !</p>\n\n<p>Dinleme algınızı geliştirin!</p>\n\n<p>Aksansız bir İngilizce ile hazırlanmış içeriği dinleyerek telaffuz ve aksanınızı iyileştirin !</p>\n\n<p>Kuzey Amerika’da hâlihazırda sık olarak kullanılan ifadeleri öğrenin !</p>\n\n<p>Konuşma aracılığıyla öğrenmek başarının temelini oluşturur.</p>\n\n<p><strong class=\"redactor-inline-converted\">Bu kursta yer alan içerik gerçek konuşmalardan esinlenmiştir. Bu içerik sayesinde, öğrenciler İngilizce dilinde gerçek diyaloglar kurmaya hazır hale gelir.</strong></p>\n\n<p>Bu kurs birçok konuşma içermektedir ve her bir konuşmanın iki versiyonu vardır : versiyonlardan biri oldukça yavaştır (her bir kelimeyi tekrarlayarak telaffuz üzerine odaklanabilirsiniz) ve diğer versiyon normal konuşma hızında gerçekleştirilmiştir (böylece anlama üzerine odaklanabilirsiniz). Eğer konuşmalar üzerinden öğrenmeye odaklanırsanız, sadece günlük hayatta kullanılan ifadeleri öğrenmekle kalmazsınız, aynı zamanda konuşmaya başladığınızda özgüven kazanmış olursunuz ve anadili İngilizce olan kişilerle konuştuğunuzda onları çok daha iyi anlamaya başlarsınız.</p><p>Kurs içeriği moderndir ve konuşmalar gerçek sosyal durumlardan edinilmiştir. Bu içerik sayesinde, önemli ifadeleri öğrenebilir, telaffuzunuzu iyileştirebilir, dinleme algınızı geliştirebilir ve kendinizi ifade ederken özgüven kazanabilirsiniz.</p><p><br></p>", 
    "end_date": null, 
    "title": "Gerçek Sohbetler ile İngilizce öğrenin", 
    "price": 0, 
    "instructors": "Gabriel Silva", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/800584_192d_2.jpg", 
    "course_url": "https://www.udemy.com/englishturkish/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T04:49:21Z"
}