{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">This courses teaches how to identify and correct the most common errors of grammar, punctuation, and style. </p><p style=\"\">The rules of grammar, punctuation, and style are often the things by which readers will judge your work. You may have original and insightful things to say, but your meaning will be lost if your sentences are riddled with errors, awkward phrasing, misplaced punctuation, and incorrectly used words. Employers routinely identify strong written communication skills as one of the most important attributes of a potential hire. </p><p style=\"\"><strong style=\"\">What You Get in This Course</strong></p><ul style=\"\"><li style=\"\">19 video lectures that include on-screen examples and explanations. </li><li style=\"\">The complete workbook in PDF, &quot;Just the Basics of English Grammar.&quot; (A value of $13.95!)</li><li style=\"\">Practice worksheets with exercises and answers to check your own work. </li></ul><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Why This Course? </strong></p><p style=\"\">You do not need to know every single grammar rule and every possible exception to those rules. You do not need to know how to diagram sentences. Based on nearly 15 years experience in teaching writing at both the high school and college level, I have designed this course to cover the &quot;must know&quot; elements of grammar and punctuation. </p><p style=\"\">This course will help you improve your writing <em style=\"\">today</em>. Unlike many grammar classes and texts, this course will not bog you down with unnecessary information and technical terms. Having taught students at all levels, I understand the pitfalls and points of confusion that give students trouble. The examples and explanations in this course have proven the most effective in helping students understand the material and master the necessary skills.  </p>", 
    "end_date": null, 
    "title": "Grammar Boot Camp", 
    "price": "20.00", 
    "instructors": "S.J. Lawrence, PhD", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340158_1827_9.jpg", 
    "course_url": "https://www.udemy.com/grammar-boot-camp/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T23:15:58Z"
}