{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>The course will provide excellent knowledge of the grammatical terms in particular Lexis, Nouns and Verbs in order to become better in the language. It will take you little more than one hour to complete.</p><p><b>Manage grammar terminology fully and become more proficient in English </b></p> <ul><li>Learn what lexis is</li><li>Understand the terminology to describe lexis categories (e.g. collocations)</li><li>Learn the categories within nouns and verbs (e.g. collective nouns, stative verbs)</li><li>Practise the new concepts with clear exercises</li><li>Become more prepared for your teaching</li></ul> <p><b>An invaluable tool to know about the language</b></p><p>Learning grammar terminology will give you invaluable help to improve your knowledge of the language. It is a unique course which provides complete explanations and practice to fully acquire the new concepts</p><p><b>Content and Overview</b></p><p>It is designed both for teachers and intermediate students. You will learn the categories in which LEXIS, NOUNS and VERBS can be divided, such as denotations, idioms, compound words, collocations and so on. </p><p>It is an interactive course which provides short explanatory videos (about 30 minutes in all), with accompanying presentation material and engaging self-correction quizzes, to make sure that the learning process is enjoyable and effective. You will need another 30 minutes to revise the presentation material you can download and to do the practice in the course.</p><p>By the end of this course, you will have certainly improved your knowledge of Grammar terminology. As a teacher, a deep knowledge about the language is especially helpful as it will give you specific tools that you can apply in your own classroom and improve, in this way, your students' knowledge. As a student, this course will take you to a different level as you will know new essential concepts which are the basis of the language, and therefore, you will become more aware of the terms used to describe language.</p>", 
    "end_date": null, 
    "title": "Grammar terminology: Lexis, Nouns & Verbs", 
    "price": "20.00", 
    "instructors": "GI Online Language Studies", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485580_63be.jpg", 
    "course_url": "https://www.udemy.com/grammar-terminology-lexis-nouns-verbs/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T20:41:15Z"
}