{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Do you want to improve your understanding of English? Do you want to do better in school? Do you want to get ahead on your job? Then this course will help you. This courses teaches students how to understand the basic elements of English sentence structure in a very easy and effective way. Students will be able to apply their knowledge of sentence structure to improving their English reading comprehension and writing skills. This is part one of the entire course. This course is for anyone desiring to learn the basic structures of the English Language so that they can improve their reading comprehension and writing. It is also for anyone who teaches others and wants the easiest, most effective way to communicate sentence structure and comprehension to them. It is NOT for students with an already advanced knowledge of English sentence structure.</p><p>But how can a knowledge of sentence structure help to improve your reading comprehension?</p><p>The link between Reading comprehension and sentence analysis is clear:</p>\n\n<p>Every word or group of words-- every part of the sentence-- is telling you something. The question is: What is that word, or group of words, or sentence part saying? What is it telling you that you need to know?</p>\n\n<p>The answer to that is found by going to the verb and main nouns, or by going to the verbs and nouns, and asking them questions. The verbs and nouns will give us information about what every other part of the sentence is saying or doing. When we ask questions, when we ask the verb and the noun questions, when we interview verbs and nouns, they tell us what each part of the sentence is doing. They  tell us what every other part is doing, or they tell us what part each word or group of words is playing in the sentence. </p>\n\n<p>Each word or group of words plays a key role in giving us information. In order to find out what information each part or group of words is giving to us we need to ask the verbs and nouns questions. Answers to those questions will allow us to see what each word or group of words is saying, or helping the sentence to say, or rather how each word or group of words is helping the writer to communicate her meaning to us. So in order to improve both your reading comprehension and writing, you must first master your sentence comprehension skills. And this is exactly what this course will do for you.</p><p><br></p>", 
    "end_date": null, 
    "title": "How to understand every English sentence you read", 
    "price": "20.00", 
    "instructors": "Brian Vieira", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/853298_2325_2.jpg", 
    "course_url": "https://www.udemy.com/english-grammar-made-easy-for-reading-and-writing/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-18T18:32:17Z"
}