{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": " <ul style=\"\"><li style=\"\"><em style=\"\">This course is <strong style=\"\">written and presented by an award-winning graduate school professor with 7 years&#039; experience</strong> in writing improvement, editing, and teaching.</em></li></ul><p style=\"\"><em style=\"\"></em></p><ul style=\"\"><li style=\"\"><em style=\"\">It has been <strong style=\"\">recorded</strong> and <strong style=\"\">produced</strong> on a studio quality level.</em></li></ul><p style=\"\"><em style=\"\"></em></p><ul style=\"\"> <li style=\"\"><em style=\"\">By enrolling in this course, you will get <strong style=\"\">lifetime access </strong>to current content, as well as the ability to interact with me online via the teaching platform.</em></li></ul><p style=\"\"><em style=\"\"></em></p><ul style=\"\"> <li style=\"\"><em style=\"\">Watch our <strong style=\"\">PREVIEW VIDEO</strong> to get a sense of what improvements you&#039;ll be making to your writing, and the way you communicate every day.</em></li></ul> <p style=\"\">You read and write every day, but how often do you think about getting better at these two crucial skills? This course will provide you with the tips and lessons to improve your communication skills and succeed in school, business, and life.</p><p style=\"\">This course is for everyone. Beginning with the building blocks of written communication, this course provides students and writers of all levels and experience with the tools to enhance the delivery and precision of their message, whatever that message may be. At the end of this course, you&#039;ll be better at writing EVERYTHING. From text messages to business e-mails, college essays to facebook posts, everyone will understand you better, and thank you for it.</p>", 
    "end_date": null, 
    "title": "How To Write Better: The Clear, Concise, Effective You", 
    "price": "20.00", 
    "instructors": "Shaun Leonard", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573010_d4c6_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-better-clear-concise-effective/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T01:32:37Z"
}