{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>Learners recognise that learning vocabulary is essential.</strong><br><br>Here you can find information, articles, and lessons and ideas to support your language learning.<br><br><strong>Course summary:</strong><br><br>Learn what’s involved in speaking fluently in English and discover new techniques.<br>Discover new ways to practise and assess vocabulary and pronunciation to help you use language communicatively.<br><br><strong>Suitable for:</strong><br>This course is ideal if<br>You are a non-native English speaker and you want to use English more accurately and effectively.<br>You are a native English speaker and you want to adjust the language you use to be more useful.<br><br>You are finding pronunciation difficult.<br>You want to increase your vocabulary.<br>You find idioms challenging or confusing.<br>You want to make IELTS more enjoyable to learn.<br>This course is about IELTS.<br><br><strong>You should already have</strong><br>B2 level English or higher.<br>This course is appropriate for any level of experience.<br><br><strong>Awards:</strong><br>Certificate of Completion<br>Your certificate is awarded at the end of the course.<br><br><strong>Aims:</strong><br>Words really are the driving force of language. They're the most important building blocks in how we express what we want to say. Pronunciation is how we say it, and this is important too: This course will help you understand IELTS, and equip you with the key terms, techniques and methods for you to use idioms effectively in speech.<br><br>When asked what they want to improve, many learners say they want to speak English better, or speak more fluently.. This course explores how we can help them do this and includes a range of activities that focus on speech and fluency specifically.<br><br>You need to use English appropriately and confidently. This includes both having a strong grasp of the way the language works, and also using the right language at the right time. This course explains the kinds of language you should use.<br><br>Together this ensures you use English in the best way.<br>Finally you’ll learn how to apply this knowledge.<br>Most of all, you’ll see how IELTS lessons can be fun and motivating as well as useful.<br>The course first explores what it means to be good at these skills.<br><br>By taking this course, you’ll learn<br><br>How to learn vocabulary skills more confidently.<br>The best ways to use English.<br><br><strong>Methods:</strong><br>Online Self-Study<br><br>Read and complete exercises, from anywhere with an Internet connection.<br>Video, text and interactive activities to reinforce understanding.<br>Discussion forums on the course.<br>End-of-course quiz provides feedback and suggests areas for revision.<br><br><strong>Course duration:</strong><br>1 - 2 hours of study<br>This is an estimate. How long the course takes will depend on the amount of time you spend on the course activities, posting to the forums, etc.<br><br>Lifetime access<br>This is how long you’ll have access to the course once you enrol.<br><br><strong>Units:</strong><br>IELTS – [Speaking] Assessment Past Paper (1-9)<br><br><strong>£30.00 Price</strong></p>", 
    "end_date": null, 
    "title": "IELTS – [Speaking] Assessment Past Paper", 
    "price": "25.00", 
    "instructors": "Gary Richards", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695954_75c3.jpg", 
    "course_url": "https://www.udemy.com/ielts-speaking-assessment-past-paper/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T22:17:19Z"
}