{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Let’s go back to our childhood and think about primary school for a moment.</p><p>I am talking about the time when we were six or seven years old.</p><p>The question here is,</p><p>What was the first thing they taught us at primary school? First thing they taught us was Writing and Reading, right?</p><p>Why it wasn’t Listening and Speaking? Of course, listening and speaking were the core abilities that we were accepted to a primary school.</p><p>And we all know that none of us teach our children how to pronounce vowels, consonants and words like the lessons we get in a language learning school?</p><p>But how did we learn to speak and to understand what we hear when we were a child?</p><p>In my opinion, one of the reason is that we hear words many times. </p><p>When we hear the sound of a word many times, we will have enough sound information in our memory and then our brain will send the right command to our speaking organs how to produce that sound. Make sense?</p><p>Did you think about this, sometimes we pronounce a word wrong and somebody else tells us the correct spelling, maybe we can’t pronounce that word correctly after hearing it once, but in most cases we will be able to pronounce that word correctly after 3-5 times we hear that word, and we are doing this just by hearing.</p><p>Sometimes we feel the need of a little bit of time, just after the full pronunciation of a word, to clearly identify that word. Why this happens is that, our brain trying to match the sound we heard with an existing sound information in our memory. But we did not put that sound information in our memory. In most cases we will be expecting the pronunciation of a word, just like we saw that word on a paper.</p><p>In this course we are going to use some digital tools to improve our listening experience and as a result of listening we are also going to improve our speaking skills. </p><p>We are going to use movies. If you feel that listening a movie is an advanced stuff for you, you can use video files or audio files at your level.</p>", 
    "end_date": null, 
    "title": "Improve English by Movies", 
    "price": "20.00", 
    "instructors": "Yusuf Katı", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702338_4e2b_2.jpg", 
    "course_url": "https://www.udemy.com/improve-english-by-movies/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T20:02:08Z"
}