{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong><em>We're already helping over 2700 people around the world to improve their English spelling, punctuation and grammar! Why not join them today?</em></strong><br></p>\n\n<p><strong>Let's face it - English is one of the most difficult languages to master on Earth! I've used it all of my life and I still find out new things all of the time!</strong></p>\n\n<p>If you have had better things to do since leaving school than remembering what a semi-colon is, then you're in good company. This course takes a fresh look at punctuation, grammar, sentence structure and even a little bit of spelling. It's a great reminder of the things that you probably knew once but have long since forgotten about.</p>\n\n<p>The course is broken down into a series of bite-sized videos that you can refer back to time and time again. So if you want to brush up on your written English and remember what a pronoun is once and for all, then this course is for you! If you want to confidently help your kids with their homework, then this course is for you!</p>\n\n<p>English is the second most widely used language on the planet. This means that English skills are incredibly important to employers - in fact, the English skills of the workforce can have a direct impact on the growth of that business. <strong>Employers can see your English skills from the moment you create your resume or fill out an application form - so the better your skills, the more employable you are making yourself.</strong></p>\n\n<p><strong>If you think that this is important, then this course is for you! </strong></p>\n\n<p><strong>Buy now and start improving your English spelling, punctuation and grammar today. And with the Udemy 30-day money back guarantee so you have nothing to lose!</strong></p>\n\n<p>The course covers the following:</p>\n\n<ul><li><strong>Punctuation</strong><ul><li>Commas;</li><li>Colons;</li><li>Semi-colons;</li><li>Apostrophes; and</li><li>Other punctuation marks.</li></ul></li><li><strong>Grammar</strong><ul><li>Nouns;</li><li>Adjectives;</li><li>Pronouns;</li><li>Verbs;</li><li>Adverbs; </li><li>Tense; and</li><li>The 'To Be' Verb.</li></ul></li><li><strong>Spelling</strong><ul><li>Plurals; and</li><li>There, They're and Their.</li></ul></li><li><strong>Sentences and Paragraphs</strong><ul><li>Capital Letters;</li><li>Paragraphs; and</li><li>Sentence Structure.</li></ul></li><li><strong>Writing</strong></li><ul><li>How to write a blog; and</li><li>Different Types of Text</li></ul><li><strong>And more!</strong></li></ul>\n\n<p>Please note - I'm based in the UK which is in the GMT time zone. This means that I will answer questions as soon as I can and there may be a short delay before I am able to get back to you. </p>", 
    "end_date": null, 
    "title": "Improve Your English Spelling, Punctuation and Grammar", 
    "price": "25.00", 
    "instructors": "Mark Glanville, Eric Gresswell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431168_fef0_5.jpg", 
    "course_url": "https://www.udemy.com/improve-your-spag/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T17:14:40Z"
}