{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Uma das grandes dificuldades para alunos dos cursos da Saúde, assim como para profissionais formados, consiste na incapacidade de entender a língua inglesa, presente em cerca de 80% da produção científica mundial. Tal fato tem como consequência uma limitação da pesquisa na literatura, seja em artigos ou em livros ainda não traduzidos, implicando na redução da qualidade dos trabalhos, principalmente nos trabalhos de conclusão de curso, dissertações de mestrado e teses de doutorado. Além disso, para aqueles que pretendem seguir a carreira científica (pós-graduação <em>stricto-sensu</em>), é imprescindível o conhecimento do inglês. </p>\n\n<p>O curso visa dar noções básicas do inglês científico, e principalmente, mostrar ao aluno que diversos termos anatômicos em inglês se assemelham muito com os termos em português. Após uma introdução ao tema, serão apresentados termos em inglês de partes do corpo humano, termos de localização em anatomia, principais ossos e seus acidentes, principais músculos, e finalmente principais órgãos dos sistemas.</p>\n\n\n\n<p>O curso será ministrado em quatro aulas de 15 minutos, aproximadamente. O público-alvo são estudantes de cursos da área da Saúde, desde o primeiro período (Medicina, Fisioterapia, Enfermagem, Educação Física, Psicologia) ou profissionais e pesquisadores. Não é necessário conhecimento prévio do idioma inglês.</p>\n\n<p><strong>Prof. Christiano B. Machado</strong><br></p>\n\n<p>Possui graduação em Fisioterapia pela Universidade Estácio de Sá (2002) e doutorado em Engenharia Biomédica pela COPPE - UFRJ e em Física Acústica pela Université Pierre et Marie Curie - Paris VI, França - com Mention Très Honorable (2011). Durante o ano de 2009, realizou seus estudos no Laboratoire d'Imagerie Biomédicale, Universidade Paris-Sorbonne VI. Sua área de pesquisa principal é a caracterização biomecânica do tecido ósseo e por ultrassom quantitativo, mais especificamente na fratura óssea e no osso trabecular. Realiza estudos na área de ultrassom biomédico (com colaborações nacionais e internacionais), termografia em saúde, saúde do trabalhador e ergonomia. Revisor de periódicos como IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control, Ultrasonics, Revista Brasileira de Engenharia Biomédica, Biomedical Signal Processing and Control e Medical &amp; Biological Engineering and Computing. Professor em tempo integral da Universidade Estácio de Sá, com experiência docente nas disciplinas Bioquímica, Biologia Celular, Anatomia, Fisiologia, Biofísica e orientação ao trabalho de conclusão de curso. Também é pesquisador, assessor de cooperação internacional e membro do Comitê de Ética em Pesquisa da UNESA. Possui experiência com educação à distância (EAD) como tutor, conteudista de disciplinas e aulas teletransmitidas. Autor do livro Ultrasound in Bone Fractures: from Assessment to Therapy (2013). Membro do Conselho Municipal de Ciência e Tecnologia de Niterói-RJ. Diretor cultural e científico da Associação dos Fisioterapeutas do Estado do Rio de Janeiro (AFERJ).</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Inglês Científico para Anatomia", 
    "price": "20.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693232_5441_3.jpg", 
    "course_url": "https://www.udemy.com/estacio-ingles-cientifico-para-anatomia/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T17:38:52Z"
}