{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>¿Quieres empezar a entender y hablar inglés ya? </p><p>El inglés es más importante que nunca. Y en muchos casos el sistema educativo no te prepara para hablarlo bien. Pero lo que no te han dicho es que el inglés puede ser sencillo--la gramática, de hecho, es bastante más fácil del español.</p>\n\n<p><strong>Aprende lo esencial del inglés con mi método claro y sencillo.</strong></p>\n\n<p>Este curso explica lo esencial de la gramática y el vocabulario--y además, la pronunciación.</p>\n\n<ul><li>Cómo formar frases en varias situaciones con el presente simple, el pasado simple, y el presente continuo</li><li>Los verbos más comunes en inglés (tanto regulares como irregulares) y cómo conjugarlos.</li><li>Vocabulario: adjetivos, expresiones del tiempo, </li><li>La pronunciación de todo lo que ves por escrito. Un buen tratamiento de la pronunciación es algo que es imposible conseguir en un libro, así que este curso es el medio perfecto para enseñarlo.</li><li>¡Y mucho más!</li></ul>\n\n<p>Si quieres aprender inglés con un método sencillo y comprensible, estás en el sitio correcto--he desarrollado este método a lo largo de mis 10 años de experiencia en el aula, y ha funcionado con gente de todo tipo--de altos ejecutivos a estudiantes universitarios.</p>\n\n<p><strong>El curso incluye:</strong></p>\n\n<ul><li>Más de 5 horas de video con explicaciones de todo lo esencial.</li><li>Listas del vocabulario más importante para imprimir.</li><li>Una copia del libro \"Inglés Básico\"--un auténtico top ventas--que contiene ejercicios para practicar lo que has aprendido, además de textos para practicar la lectura.</li><li>Dos ebooks más gratis: \"El Pequeño Libro de los Verb Patterns\" y \"Vocabulario y Expresiones Esenciales\" para que sigas adelante con el aprendizaje.</li></ul>\n\n<p>Al final del curso, sabrás manejarte con lo más esencial del inglés, y sabrás los pasos que tomar para seguir aprendiendo más. Además, tendrás algo que la mayoría de las personas no tienen--una buena idea de la auténtica pronunciación americana.</p>", 
    "end_date": null, 
    "title": "Inglés Básico -- Todo lo esencial para hispanohablantes", 
    "price": "40.00", 
    "instructors": "Daniel Welsch", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444494_3f37_2.jpg", 
    "course_url": "https://www.udemy.com/inglesbasico/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T06:21:00Z"
}