{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>In the Intermediate section you will focus on some complex grammar and English Structures such as Reported Speech, or the Passive Structure. You will be asked to complete some Review Tenses to make sure that you understand everything.</p><p>The “Intermediate\" section is equivalent to  </p> <ul> <li>The “<strong>Preliminary English Test (PET)</strong>\" level from the Cambridge University in the UK.</li><li>The <strong>B1</strong> level in the Common European Framework of Reference for Languages (CEFR).</li><li>A <strong>57-86</strong> points at the <strong>TOEFL</strong> exam (Test Of English as a Foreign Language).</li> </ul>  <ul> <li>WHAT WILL YOU LEARN: (COURSE CONTENT)</li></ul> <p> In this course you will learn the Past Simple, Past Continuous and their differences, the proper way to express habits in the past using Used to &amp; Would, Past Perfect Simple, the differences between Past Simple and Past Perfect, the Future simple, the structure \"to be going to\" and Present Simple for the future and their differences in use. You will also learn the Use of Gerunds and Infinitives. You will also learn the structure and our easy methods to create a sentence in Passive, in Reported Speech, and in First, Second and Zero Conditionals. Another important lesson you will learn will be the order of the adjectives in a sentence.</p><ul><li>WHAT WILLYOU  DO: </li></ul><ul><li>Over 28 lectures and over 150 min of video content explaining in detail each grammar topic.</li><li>Downloadable material.</li><li>You will be asked to practice all these grammar by doing review tests along the course.</li></ul> <ul> <li>WHAT WILL YOU GAIN AFTER THE COURSE: </li></ul><p>After finishing this course you will be able to have a deep knowledge of the English grammar, and be capable of  reading and writing using advanced English grammar, as well as being able to have a solid grammar base to have a perfect conversation in English. </p><p>In this Advanced course you will focus on the most difficult verb tenses such as the Present Perfect Continuous and the Past Perfect Continuous, and you will also learn some complex structures like the Passive form in all verb tenses.</p><p>Taking this course is the way to perfect your grammar knowledge as you will learn the differences in use between most verb tenses.</p><p>You will be asked to do review tests in order to make sure you gained a solid knowledge of the English grammar taught in this course.</p><p>This “Advanced\" Course is equivalent to:</p><ul><li>The “First Certificate Exam (FCE)\" level from the Cambridge University in the UK.</li><li>The B2 level in the Common European Framework of Reference for Languages (CEFR).</li><li>A 87-109 points at the TOEFL exam (Test Of English as a Foreign Language).</li></ul><ul><li>WHAT YOU WILL LEARN: (COURSE CONTENT)</li></ul><p>In this course you will gain an extensive grammar knowledge needed for the official exams. </p><p>You will learn the how to create and the differences in use between most verb tenses such as Present Perfect Simple or Present Perfect Continuous, between Past Perfect Simple and Past Perfect Continuous, or between all the different verb tenses we can use for the future, like Future Simple, Be going to, Present Continuous, Present Simple,Future Continuous, Future Perfect or to be about to.</p><p>You will know the differences and when to use an adjective ending in +ed or +ing, as well as how to create a Passive form in any verb tense, the Passive with Reporting verbs, or the Passive with two objects.</p><p>You will also find videos explaining how to create a modal verb structure for the past, and the Third Conditional structure.</p><p>In the last section you will learn one of the most difficult grammar lessons, that is when we can ommit a Relative clause or when we can´t, and the differences between a Defining and a Non-defining Relative Clause and their implications.</p><ul><li>WHAT YOU WILL DO:</li></ul><p>You have over 2 hours of video content as well as a Review Test at the end of each lesson where you will be asked to test your knowledge in order to make sure you got everything correclty.</p><p>Downloadable material.</p><ul><li>WHAT YOU WILL GAIN AFTER THE COURSE:</li></ul><p>After finishing this four courses you will be able to have a proficient level in English, being capable of understanding advanced readings, and watching English TV perfeclty as well as having an advanced conversation in English.</p>", 
    "end_date": null, 
    "title": "Intermediate & Advanced English grammar", 
    "price": "20.00", 
    "instructors": "Kate Ochsner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471808_9140_4.jpg", 
    "course_url": "https://www.udemy.com/intermediate-english-grammar/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T12:01:09Z"
}