{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">Do you have a dream to be a pilot or air traffic control officer? Do you need to upgrade your English skills?  If so, this is the course for you!<br style=\"\"></p><p style=\"\">According to CNN at least half a million pilots or more are needed worldwide  over the next 20 years as airlines add to their fleets. You can be one of them!  Aviation English isn&#039;t all radiotelephony or standard phraseology, English proficiency is important and this course can help you improve your English skills.<br style=\"\"></p><p style=\"\">This is an introductory course to Aviation English for  those who are aspiring pilots and ATCO&#039;s.   Pilots and Air Traffic Control Officers need to demonstrate the use of English in the critical skills of operational language as described in the 5 Holistic Descriptors at the minimum level of proficiency described in Level 4 of the Rating Scale as produced by ICAO. </p><p style=\"\">We will look at some grammar, listening skills, some terminology, jet lag, weather conditions, comprehension, expressing concern, Crew Resource Management, giving instructions and stress.  All of these are important in Aviation English.  The course is not intended to teach you how to be a pilot, it is intended to help you improve your English skills and gives you a taste of what Aviation English is like. <br style=\"\"></p><p style=\"\">There are 10 lectures covering different aspects of  Aviation English.  The course has about one  and a half hour of videos covering the topics above with handouts and can be taken at your own pace.  All handouts come with answers after the quiz has been taken.</p><p style=\"\">If you want to be part of the exciting world of aviation as a pilot or air traffic control officer, then you should take this course!</p><p style=\"\">Don&#039;t forget to follow us on Facebook: Wise Choice Education also follow us on Twitter: @wisechoiceedu</p>", 
    "end_date": null, 
    "title": "Introduction to Aviation English", 
    "price": "20.00", 
    "instructors": "Aileen Valentine", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442570_548a.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-aviation-english/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-09T09:12:37Z"
}