{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<strong>Pourquoi ce cours pour débutant et faux débutant en anglais?</strong>  </p>  <p>  \t    L’Alphabet et les Chiffres de 0 à 9: ces compétences de base souvent oubliées dès les premières leçons d’anglais passées sont en fait utilisées tous les jours que ce soit au niveau professionnel (donner une référence produit ou mentionner une facture, laisser un message) ou tout simplement à un niveau personnel pour épeler son nom, son numéro de téléphone, une réservation pour partir en vacances, épeler le nom d’une rue….ce cours se veut résolument pratique et utile!  </p>  <p>  \t<strong>Les outils que nous vous proposons pour garantir votre progression:</strong>  </p>  <ul>  \t<p>  \t\t    oTravailler à l’aide de 2 voix; une féminine et masculine  \t</p>  \t<p>  \t\t    oPrésentations vidéo, audio et diapositives powerpoint pour des explications claires  \t</p>  \t<p>  \t\t    oDes commentaires en français pour éviter toute ambiguïté  \t</p>  \t<p>  \t\t    oDes exercices ludiques différenciés qui partent du plus simple au plus compliqué  \t</p>  \t<p>  \t\t    oLe recyclage des notions abordées sous différents angles et dans différentes situations de la vie courante  \t</p>  \t<p>  \t\t    oUne feuille de travail ou vous pourrez mesurer votre progression  \t</p>  \t<p>  \t\t    oDes exercices supplémentaires si vous désirez vous perfectionner  \t</p>  \t<p>  \t\t    oUne progression qui part de la théorie à l’utilisation de la langue en situation réelle lors d’un échange  \t</p>  </ul>  <p>  \t<strong>Le but est enfin et surtout l’occasion de participer à un dialogue comme si vous y étiez!</strong>  </p>  <p>  \t    Ces 45 mn de cours vous donneront l’assurance de pouvoir effectuer une prise de contact avec des Anglophones; elles sont également essentielles pour envisager de postuler à un poste où l’anglais est un critère indispensable.  </p>  <p>  \t    N’hésitez pas à suivre ce cours gratuit dès aujourd’hui!  </p>  <p>  \t<strong>Vous avez tout à gagner!</strong>  </p>  <p>  \t<strong><em>Would you know someone who would like to start a bit of useful English?</em></strong>  </p>  <p>  \t    This course offers a basic skill often overlooked, that anyone from a beginners level onwards can benefit from.  We use a native speaker, male and female voices, giving explanations in French, engaging exercises, and fun role plays along with an accompanying work sheet.  The thrust is to provide a very practical approach to the use of English that can be learned regardless of the student’s level using a system designed by a qualified teacher of English as a foreign language.  </p>", 
    "end_date": null, 
    "title": "L'alphabet et les chiffres à l'anglaise", 
    "price": 0, 
    "instructors": "Béatrice Carter", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299620_b97b_7.jpg", 
    "course_url": "https://www.udemy.com/lalphabet-et-les-chiffres-a-langlaise/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T13:42:15Z"
}