{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">Welcome to Point of View English. This is the only Virtual Reality English course. You get to see what I see, and hear what I hear. You will be able to listen to real life conversations and interactions that I have throughout the day. This is an excellent course to improve your listening, and speaking skills. </p><p style=\"\"><strong style=\"\">What is this course about?</strong></p><p style=\"\">In this course you will spend the day with me and my friend shopping, eating dinner, and having fun conversations. You will see the world from my eyes and perspective. </p><p style=\"\"><strong style=\"\">How is this course different than other English courses? </strong></p><p style=\"\">This course is completely different than any other English course you will ever take. This is the only course that has been filmed through the teachers eyes. You will hear what I hear, and see what I see. The lessons in the course are fun and exciting. You will be returning items at a store, having dinner with a friend, and go shopping at the dollar store. There will be many surprises and fun times within the lessons that will make you laugh and smile.</p><p style=\"\"><strong style=\"\">Will I become fluent in English by the end of this course?</strong></p><p style=\"\">Of course not! lol You will not become fluent by the end of this course, but you will gain a stronger more natural vocabulary. You will experience greater confidence in your English speaking and comprehension. This course will greatly improve your English but it will not make you fluent. </p><p style=\"\"><strong style=\"\">What is the best way to learn from the lessons? </strong></p><p style=\"\">We recommend that you do one lesson each day. After each lesson there is a quiz . Make sure you complete the quiz. You can repeat any lesson as many times as you want till you feel comfortable with the information.</p>", 
    "end_date": null, 
    "title": "Learn POV English", 
    "price": "20.00", 
    "instructors": "Ronen Geisler", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551178_3573_2.jpg", 
    "course_url": "https://www.udemy.com/learn-pov-english/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T17:21:46Z"
}