{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>Gracias a uno de nuestros sponsors, este curso es impartido gratuitamente.</strong></p><p>Este curso está diseñado para aprender ingles conversacional básico, con mucho énfasis en pronunciación.<br></p>  <p>  \t  Toma este curso si quieres mejorar tu ingles, especialmente tu pronunciación.  </p>  <p>  \t  Sebastián, quien impartirá este curso, ha vivido más de 6 años en el exterior. Es muy apasionado en cuanto al idioma ingles, le gusta aprender, leer y hablar. Se ha dado cuenta que hay muchos latinos y extranjeros tratando de aprender ingles, sin embargo no han sido muy exitosos. Sebastián en este curso te indicara cuales son los típicos errores de quienes tratan de aprender, especialmente se dedicara a ayudarte con tu pronunciación y al final cada video encontraras una práctica para aplicar inmediatamente lo que has aprendido.  </p>  <p>  \t  Este curso está basado en Ingles de Nueva Zelanda, que es muy similar a ingles británico, sin embargo, el acento usado para enseñar es neutro, por lo que podrás usarlo en cualquier país que hablen ingles.  </p>  <p>  \t  Una de las ventajas de Sebastián, es que ha vivido mucho tiempo en el exterior. Muchos otros profesores y maestros de ingles viven en un país de habla española, por lo que para ellos es muy difícil tener un real acento ingles. Sebastián te ayudara a conseguir un acento muy creíble y real.  </p>  <p>  \t  Sebastián es muy apasionado por la educación, por lo que tratara con mucho ánimo de ayudarte a hablar ingles de la manera más fácil.  </p>  <p>  \t  En este curso de ingles gratis encontraras:  </p>  <ul>  \t<li>Cada lección no dura más de 3 o 4 minutos</li>  \t<li>Usaremos frases simples que son muy comunes</li>  \t<li>Una fácil practica incluida al final del video</li>  \t<li>Conexión a Youtube, Facebook, Twitter, Google+, etc. por ayuda</li>  \t<li>Hace sugerencias y Sebastián te responderá en los próximos videos</li>  \t<li>Hace preguntas, te responderemos a través de Social Media.</li>  \t<li>Entre muchas otras cosas...</li>  </ul>  <p>  \t  Sebastián sube videos casi todos los días, por que al estar estudiando a través de Udemy y CrowdLearn, recibirás muchísimos videos, con contenido prácticamente ilimitado.  </p>  <p>  \t  Gracias por tomar nuestro curso, te aseguramos que aprenderás a hablar ingles, con un excelente acento.  </p>  <p>  \t  Gracias!  </p>", 
    "end_date": null, 
    "title": "Learn basic English phrases: Aprende frases básicas Ingles", 
    "price": 0, 
    "instructors": "Sebastian Cortes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314688_a14f_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-ingles-con-crowdlearn/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T23:55:32Z"
}