{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \tTu says:  </p>  <p>  \t<em>Wow! What a fun and helpful course! The course is really straight-forward, fun and easy to understand... so interesting! <strong>Thank you again for such a helpful course</strong>!</em>  </p>  <p>  \tGulnora says:  </p>  <p><em>It's really very easy to understand and go into the subject in a simple and fun way. <strong>Highly recommended</strong> for those who want to improve their language skills.</em></p><p>Cici says:</p><p><em>I've been looking for this for a long time. The instructor is absolutely great. <strong>This course exceeded my expectation on every level</strong>. Please do more!<br></em></p>  <hr>  <p>  \t                    Confused by English words and phrases you read or hear that you don’t understand?  </p>  <p>  \t                                                  Are you frustrated by slang terms that you don’t know?  </p>  <p>  \t                                                  Do idioms have you freaking out?  </p>  <p>  \t                                                  Want to better comprehend American movies, TV shows, and Netflix?  </p>  <p>  \t                                                  Communicate more clearly and confidently on the job - or to get the job?  </p>  <p>  \t                                                  Connect better with friends and be better understood in social situations?  </p>  <p>  \t                                                  Speak informally and comfortably rather than formally and textbook-y?  </p>  <p>  \t                LEARN SLANG AND SPEAK ENGLISH LIKE AN AMERICAN covers conversational and informal expressions used frequently in the U.S. so that you can speak and write more effectively, and better comprehend Americans who you interact with every day. It’s a sampling of the many ways Americans communicate with each other in daily life, and how you can fit in, be understood and participate fully in business and social life.  </p>  <p>  \t                                                  This comprehensive course covers many of the most popular informal words and phrases used in the U.S. in person and on the Internet. The lectures are standalone and may be watched in any order. You’ll see your instructor as well as each word on screen at all times, allowing you to master the spelling and pronunciation of every item. Phrases are repeated and examples given for each, so you’re sure to grasp the concepts. It’s like having a personal tutor right there with you!  </p>  <p>  \t                                                  In addition to the video lectures, you’ll have access to a complete reference list of all vocabulary covered in the course along with synonyms, antonyms when applicable, and examples.  </p>  <p>  \t                                                  This course is perfect for anyone who lives, works or plans to travel in the U.S., or for English students in need of conversational, slang and informal English practice. The class covers a broad range of content applicable to dating, job interviews and networking. No prior training in slang is required.  </p>  <p>  \t                              This wildly popular course is unconditionally guaranteed for 30 days because it's truly the best thing you can do to improve your English communication ability right now. Start immediately achieving greater success by enrolling today!  </p>", 
    "end_date": null, 
    "title": "Learn Slang And Speak English Like An American", 
    "price": "20.00", 
    "instructors": "Noah Detweiler", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368685_8906_21.jpg", 
    "course_url": "https://www.udemy.com/speak-english-like-an-american/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T07:55:36Z"
}