{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  My English teacher used to say, \"Pronunciation is your business card. You hand it over to your potential customers and employers. Before they have the time to figure out how complex is your Grammar or Vocabulary, they will <em>hear </em>the way you sound, and in many cases <em>that first impression of \"looking at your business card\" </em>will determine your future success.\"  </p>\n\n<p>  \tI've thoroughly enjoyed learning and perfecting my own pronunciation over the years. I then spent years sharing this passion with my students, but grew continuously disappointed that <strong>even though they knew how to pronounce sounds, this knowledge had no connection to real life. They still couldn't understand native speakers, and their own fluency was very limited.</strong>  </p>\n\n<p>  \t<strong></strong>It took me some time to discover that pronunciation is not about drilling a student to pronounce isolated sounds and words, <strong>it's about developing the ability to understand and produce a fluent English speech.</strong> This led me to creating this course. If I only had 1 week to teach the most important, practical principles of English pronunciation, I would share these <strong>5 basic principles</strong> that you will learn as soon as you enroll:  </p>\n\n<ol>  \t<li>English words <strong>always connect to each other. </strong>There are no \"white spaces\" or breaks in oral English!</li>  \t<li>Some sounds are omitted (lost) from the flow of the English language.</li>  \t<li>Some sounds <em>are added </em>to the flow of the English language.</li>  \t<li>Some sounds <em>are completely transformed. </em></li>  \t<li>Conversational English never uses the standard \"full Grammatical forms.\"</li>  </ol>\n\n<p>  \t  Join this course to learn more about these 5 magic principles that will help you gain more confidence and freedom while speaking English. I will explain each principle in a video and then give you a chance to practice using real-life phrases and text excerpts. After the course <strong>you will hear and speak English much differently </strong>than now. Join today!  </p>", 
    "end_date": null, 
    "title": "LinkedEnglish: Native-Like Accent in 5 Steps", 
    "price": "20.00", 
    "instructors": "Elena Mutonono", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340770_1546_5.jpg", 
    "course_url": "https://www.udemy.com/linkedenglish-a-compact-practical-pronunciation-course/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T19:01:28Z"
}