{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t            ¡Domina los Phrasal Verbs más importantes!  </p>  <p>  \t            Los phrasal verbs son tan sencillos que incluso los niños pequeños los usan y entienden, antes de aprender un vocabulario más amplio. A un angloparlante un phrasal verb le parece incluso más sencillo que una palabra más larga. En una conversación entre americanos o británicos, se usan los phrasal verbs en todo momento, y nadie piensa en ello como algo difícil. Es simplemente como hablamos.  </p>  <p>  \t            Y son algo que todo el mundo sabe que debe aprender. Pero cuando estoy en clase y digo “hoy vamos a hablar de los phrasal verbs” sale un suspiro de angustia profunda del grupo–incluso personas con muy buen nivel, que llevan años estudiando el inglés, tienen miedo a los phrasal verbs.  </p>  <p>  \t            ¿Eres uno de aquellas personas?  </p>  <p>  \t            Puede que sí. La verdad es que en español pasa todo lo contrario. Los hispanohablantes usan palabras más largas y así les parece más complicado acordarse de un phrasal verb, aunque sólo sea la combinación de dos palabras ya conocidas.  </p>  <p>  \t            Pero realmente, el miedo que la gente tiene de los phrasal verbs carece de fundamento. La expresión en inglés “get up” sigue siendo más corto que su equivalente en español, “levantarse”. Un angloparlante en sus primeros años de estudiar el español diría: “¿Levantarse? ¿No hay algo más corto? ¡Es que son cuatro sílabas!” Y además tiene un montón de conjugaciones.  </p>  <p>  \t            Entonces, ¿por qué es que mis estudiantes tienen tanto miedo a los phrasal verbs? Supongo que porque sus profesores no los han sabido explicar de forma clara y comprensible. Es difícil encontrar un buen método, a veces, y los libros de texto normales no son de gran ayuda. Créeme, que los he tenido que utilizar en mis clases aquí en Madrid.  </p>  <p>  \t            Los métodos normales son tan malos que con el tiempo he desarrollado uno nuevo, para enseñar bien (¡por fin!) este tema tan importante de la gramática y el vocabulario.  </p>  <p>  \t            La verdad es que los phrasal verbs no son tan complicados–cuando se enseñan bien. Cada partícula tiene unos significados propios, que se pueden usar en muchos casos para adivinar el significado del verbo. Las partículas–up, down, in, out, on, off, away, back, around y los demás–nos ayudan con una dirección o con un significado propio que tienen.  </p>  <p>  \t            Aprenderlos bien es sólo cuestión de saberse unas docenas de los phrasal verbs más usados, y practicarlos un poco.  </p>  <p>  \t  ¡Disfruta del curso!</p>", 
    "end_date": null, 
    "title": "Los Phrasal Verbs para Hispanohablantes: Aprende más inglés", 
    "price": "20.00", 
    "instructors": "Daniel Welsch", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288156_6adb_3.jpg", 
    "course_url": "https://www.udemy.com/los-phrasal-verbs-para-hispanohablantes-aprende-mas-ingles/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T13:09:55Z"
}