{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Course Description</strong></p>\n\n<p>There are literally hundreds of thousands of words in English. But you only need to learn a fraction of them! This course will guide you to the words you need to focus on and how to learn them. In less than an hour. I will show you how to use the latest free vocabulary software as well as give you flash cards to send you on your way to mastering over 600 of the most important words for academic English. Mastering these words  and the right affixes will add over 3000 new words to your vocabulary!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Master English Vocabulary for Academic Purposes</strong></p>\n\n\n\n\n\n<ul><li>Understanding the use of prefixes, root words and suffixes to create new words</li><li>Focus on the Academic Word List, the most frquently used words in Academic English</li><li>Learning best practices for studying vocabulary</li><li>Add 3000 new words by learning the right 600</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"> Understanding the power of affixes and the efficency of the most frequently used words</strong></p>\n\n\n\n\n\n<p>Vocabulary is the key to success no matter what subject you study. You can cut down the time you need to study vocabulary by learning the right words in the right way. Once mastered, the techniques I share in this class can be applied to any subject you want to learn.</p>\n\n\n\n\n\n<p>Most students understand that one of their biggest challenges to academic success is having a vocabulary large enough for their course work. While there are literally hundreds of thousands of English words, the wise student focuses on the ones they really need: the most frequently used words. These words are known as the Academic Word Lİst. By combining this list with the compounding power of affixes, a committed students can add over 3000 words to their vocabulary in a fraction of the time used for traditional methods. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Contents and Overview</strong></p>\n\n\n\n\n\n<p>The course contains over a dozen lessons that will only require an hour or so of your time to start with. It is designed for the English language learner who wants to prepare themselves for successful study of English at a college or university or anyone who simply wants a better vocabulary to enjoy English.</p>\n\n\n\n\n\n<p>İn this course, you will learn about affixes, why they matter and how learning them will expand your vocabulary. You will learn which affixes to start learning first.</p>\n\n\n\n\n\n<p>You'll then learn about the Academic Word Lİst, a list of the most frequently used words English for Academic Purposes.</p>\n\n\n\n\n\n<p>Following this, students will be introduced to ANKİ, a free flash card software for learning the vocabulary in this course. You will be given two free flash cards sets that you can use and modify for personal use.</p>\n\n\n\n<p>Finally, you will learn how to document new words for study and to include in your flashcard software.</p>\n\n<p>As a bonus, you will learn of the numerous resources available online to expand your word knowledge.</p>\n\n\n\n<p>By the end of this course, you will know precisely which words to learn, how to study them efficiently with software and how to continually expand your vocabulary for any subject.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What are the requirements?</strong></p>\n\n\n\n<ul><li>A willingness to study 15 minutes a day.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What am I going to get from this course?</strong></p>\n\n\n\n<ul><li>Over a dozen lessons in less than an hour</li><li>Free software for vocabulary study</li><li>Free flash cards sets for study</li><li>A plan for learning new words</li><li>Numerous technigues and suggestions for further word study</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>What is the target audience?</strong></p>\n\n\n\n<ul><li>Language learners</li><li>People interested in expanding their vocabulary</li></ul>", 
    "end_date": null, 
    "title": "Mastering  English Vocabulary for Academic Purposes", 
    "price": "20.00", 
    "instructors": "Tony Sturtevant", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/800684_032c_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-english-vocabulary-for-academic-purposes/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T07:51:01Z"
}