{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Do you use English at work to communicate with colleagues and clients?</p>\n\n<p>Are you comfortable reading work-related documents and writing short e-mails?</p>\n\n\n\n\n\n\n\n\n\n<p>But ..  Do you find listening and speaking, particularly with native speakers, a bit of a challenge?</p>\n\n\n\n\n\n\n\n\n\n<p>Do you get nervous at meetings and on the telephone? \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Then join me on this course to <strong>improve your comprehension and active usage of 320 common business phrases, and become more fluent and confident in business contexts.</strong></p><p>Speaking naturally and confidently in business situations can sometimes be challenging. Nerves may take over and you may block, forgetting even familiar words and expressions, making both listening and speaking difficult.  The aim of this course is to help you to <strong class=\"redactor-inline-converted\">review and fully assimilate 320 common business phrases to become more relaxed, confident and fluent in your daily communications with colleagues and clients, particularly when they are native speakers.</strong><br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><u>COURSE STRUCTURE  </u></strong>\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>The course is divided into 8 sections, with a total of 8 video lessons, 8 sound files and 16 gap-filling quizzes.</strong></p>\n\n\n\n<p> Each section includes:\n\n  </p>\n\n\n\n\n\n\n\n<p>-  a video lesson presenting 40 phrases to first listen to and write down (listening exercise), and then listen to and repeat (speaking exercise)\n\n  </p>\n\n\n\n\n\n\n\n<p>- an Audio recording of a dialogue or a presentation using some of the expressions you have learned and some additional business expressions</p>\n\n\n\n\n\n\n\n<p>- a gap-filling quiz while listening to the audio recording to test your listening comprehension\n\n  </p>\n\n\n\n\n\n\n\n<p>- a gap-filling quiz from memory to test your assimilation\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n", 
    "end_date": null, 
    "title": "Master 320 Common Business English Phrases", 
    "price": "25.00", 
    "instructors": "Minoo Short", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842944_87dd_2.jpg", 
    "course_url": "https://www.udemy.com/business-english-phrases/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-08T18:45:31Z"
}