{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t      Are you frustrated with your efforts to learn and use phrasal verbs? <br style=\"\">  \t                  Are you finding that memorizing lists with translations is ineffective?<br style=\"\">  \t      Are you looking for an effective method of learning vocabulary and improving your listening and speaking skills?  </p>  <p style=\"\">  \t<strong style=\"\">  Then, join me on this course to learn how to use 120 common phrasal verbs in your daily conversations, and improve your listening comprehension and your fluency at the same time.</strong>  </p>  <p style=\"\">  \t                          The course consists of <strong style=\"\">over 2 hours of video and audio content </strong>to enable you to practise and fully assimilate about 120 common phrasal verbs used in daily conversations.  </p>  <p style=\"\">  \t                          Each video lesson consists of one or two <strong style=\"\">dialogues containing several phrasal verbs.</strong> The dialogues also include many <strong style=\"\">intermediate and advanced structures </strong>(tenses, conditionals, modals, gerunds etc.), so you can also review the usage of important structures at the same time as you learn these verbs.  </p>  <p style=\"\">  \t                          Each video lesson ends with <strong style=\"\">gap-filling exercises,</strong> so you can review the same verbs in a new context.  </p>  <p style=\"\">  \t                          Then, the phrasal verbs are reviewed again in the <strong style=\"\">120 follow-up audio exercises.  </strong>  </p>  <p style=\"\">  \t                  The package also includes a <strong style=\"\">handbook </strong>containing:  </p>  <p style=\"\">  \t                   - A step-by-step <strong style=\"\">study guide</strong> and a 2-week <strong style=\"\">study programme</strong><br style=\"\">  \t                   - Answers to <strong style=\"\">frequently asked questions </strong>about phrasal verbs<br style=\"\">  \t                   - <strong style=\"\">List of the phrasal verbs </strong>in the course with their definitions <br style=\"\">  \t                   -  pdf <strong style=\"\">transcripts </strong>of all dialogues, exercises and answer keys<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Master 120 common phrasal verbs", 
    "price": "25.00", 
    "instructors": "Minoo Short", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/283842_b616_3.jpg", 
    "course_url": "https://www.udemy.com/master-phrasal-verbs/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-19T16:59:30Z"
}