{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  Si has probado ya el curso <a href=\"https://www.udemy.com/ingles-para-familias-en-9-meses/#/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Inglés en 9 Meses</a> (mes de prueba), o conoces mi <a href=\"http://cincodeditos.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">blog</a>, ya sabrás de qué va este curso.  </p>  <p>  \t  Se trata del tercer mes del curso, Inglés en 9 Meses para Bebés y la Familia.  </p>  <p>  \t  En este curso pretendo enseñarte a usar el inglés que usaría cualquier padre o madre de habla inglesa con sus hijos. Y lo aprenderás con sólo 5 minutos al día y en 9 Meses. <br style=\"\">  \t<br style=\"\">  \t  ¿Porqué?  </p>  <ul style=\"\">  \t<li>Pues, porque se trata de vocabulario y frases que no se enseñan en los libros ni en las academias de inglés.</li>  \t<li>Porque como padres a todos nos preocupa que nuestros hijos puedan hablar inglés de mayores, y resulta que si les exponemos al idioma desde pequeñitos tendrán más posibilidades de ser bilingües.</li>  \t<li>Porque el cerebro de los niños está especialmente adaptado a la adquisición de idiomas, y esta capacidad merma considerablemente a partir de los 6 años.</li>  \t<li>Porque los niños aprenden los idiomas estando expuestos a él y necesitamos crear un entorno donde el inglés sea habitual y constante; y eso sólo lo podemos conseguir los padres en casa.</li>  \t<li>Porque los padres pueden aprovechar la motivación de enseñar a sus hijos para mejorar su propio nivel o empezar a aprender inglés.</li>  </ul>  <p>  \t  Cómo funciona el curso  </p>  <ul style=\"\">  \t<li>Cada sección trae un vídeo de pronunciación y un pdf. </li>  \t<li>El vídeo de pronunciación está dividido en 5 secciones, para que estudies una sección al día. </li>  \t<li>Escucha y repite lo que escuchas. Trata de no leer ya que ahí empiezan los problemas de pronunciación. Imita el sonido.</li>  \t<li>Memoriza las frases de la lección diaria y busca situaciones para practicarlas.</li>  \t<li>Si tienes un smartphone o tablet, descarga la app de Udemy.</li>  </ul>  <p>  \t  Es tentador abrir todas las lecciones una tras otra. Pero si sigues el método que te propongo de una lección diaria te garantizo mayor éxito. Simplemente porque estarás creando un hábito de usar el inglés a diario, porque no te abrumarás con tanto nuevo que aprender, y te dará tiempo a memorizar las frases nuevas antes de pasar a las siguientes.  </p>  <p>  \t  Si sigues mi método de una lección diaria este curso tiene una duración de 1 mes (4 semanas).  </p>  <p>  \t  El curso incluye un PDF resumen de cada capítulo, que podrás descargarte. El pdf incluye las frases en inglés y su traducción al castellano para ayudarte a recordar el significado de las frases. Pero lo ideal es que memorices las frases y no necesites de la traducción. Esta es la forma de cambiar el chip del idioma.  </p>  <p>  \t  Este mes verás los siguientes capítulos  </p>  <ol style=\"\">  \t<li>A vestirse, frases para la rutina de vestirse todos los días.</li>  \t<li>Hora de comer, frases para la rutina de las comidas. </li>  \t<li>Seguridad y Accidentes, frases para evitar accidentes y para consolar si suceden. </li>  \t<li>Jugando en casa, frases para los típicos juegos que hacemos en casa con nuestros peques. </li>  </ol>", 
    "end_date": null, 
    "title": "Mes 3 - Inglés en 9 Meses, para Bebés y la Familia. ", 
    "price": "35.00", 
    "instructors": "Claudia Carter", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204570_e25f_6.jpg", 
    "course_url": "https://www.udemy.com/mes-2-ingles-en-9-meses-para-bebes-y-la-familia/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-24T15:12:12Z"
}