{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t  Si has probado ya el curso <a href=\"https://www.udemy.com/ingles-para-familias-en-9-meses/#/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Inglés en 9 Meses</a> (curso de prueba), o conoces mi <a href=\"http://cincodeditos.com/news/reto-aprende-hablar-ingl%C3%A9s-con-tu-hijo-en-9-meses\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">blog</a>, ya sabrás de qué va este curso.  </p>  <p style=\"\">  \t  Es el segundo mes del curso, <strong style=\"\">Inglés en 9 Meses para Bebés y la Familia</strong>.  </p>  <p style=\"\">  \t  En este curso pretendo enseñarte a usar el inglés que usaría cualquier padre o madre de habla inglesa con sus hijos. Y lo aprenderás con sólo 5 minutos al día y en 9 Meses. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">¿Porqué?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Pues, porque se trata de vocabulario y frases que no se enseñan en los libros ni en las academias de inglés. </li>  \t<li style=\"\">Porque como padres a todos nos preocupa que nuestros hijos puedan hablar inglés de mayores, y resulta que si les exponemos al idioma desde pequeñitos tendrán más posibilidades de ser bilingües. </li>  \t<li style=\"\">Porque el cerebro de los niños está especialmente adaptado a la adquisición de idiomas, y esta capacidad merma considerablemente a partir de los 6 años. </li>  \t<li style=\"\">Porque los niños aprenden los idiomas estando expuestos a él y necesitamos crear un entorno donde el inglés sea habitual y constante; y eso sólo lo podemos conseguir los padres en casa. </li>  \t<li style=\"\">Porque los padres pueden aprovechar la motivación de enseñar a sus hijos para mejorar su propio nivel o empezar a aprender inglés. </li>  </ul>  <p style=\"\">  \t<strong style=\"\">Cómo funciona el curso</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Abre una lección por día.</li>  \t<li style=\"\">Escucha y repite lo que escuchas. Trata de no leer ya que ahí empiezan los problemas de pronunciación. Imita el sonido.</li>  \t<li style=\"\">Memoriza las frases de la lección diaria y busca situaciones para practicarlas.</li>  \t<li style=\"\">Si tienes un smartphone o tablet, descarga la app de Udemy.</li>  </ul>  <p style=\"\">  \t  Es tentador abrir todas las lecciones una tras otra. Pero si sigues el método que te propongo de una lección diaria te garantizo mayor éxito. Simplemente porque estarás creando un hábito de usar el inglés a diario, porque no te abrumarás con tanto nuevo que aprender, y te dará tiempo a memorizar las frases nuevas antes de pasar a las siguientes.  </p>  <p style=\"\">  \t  Si sigues mi método de una lección diaria este curso tiene una duración de 1 mes.  </p>  <p style=\"\">  \t  El curso incluye un PDF resumen que podrás descargarte de cada capítulo.  </p>  <p style=\"\">  \t  Además incluye sugerencias a otros recursos en línea.  </p>  <p style=\"\">  \t  Al final de cada capítulo hay un pequeño quiz-test interactivo para consolidar lo aprendido.  </p>  <p style=\"\">  \t<strong style=\"\">Qué capítulos incluye el curso</strong>  </p>  <ol style=\"\">  \t<li style=\"\">Expresando afecto a nuestros hijos. </li>  \t<li style=\"\">Todo lo relacionado con el entorno de los bebés de 0 a 1.</li>  \t<li style=\"\">El mundo de los bebés continuado.</li>  \t<li style=\"\">El saludo después de unas horas separados, cómo estás y despedidas. </li>  </ol>", 
    "end_date": null, 
    "title": "Mes 2 - Inglés en 9 Meses, para Bebés y la Familia", 
    "price": "35.00", 
    "instructors": "Claudia Carter", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/173964_aa0f_4.jpg", 
    "course_url": "https://www.udemy.com/ingles-en-9-meses-para-bebes-y-la-familia-mes-1/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-27T17:17:52Z"
}