{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t      Si conoces mi web Cincodeditos no hará falta que te repita lo que ya hemos comentado en el blog tantas veces. Para aquellos que son nuevos a mi planteamiento explico a continuación las bases de mi método.  </p>  <p>  \t<strong style=\"\">Los niños aprenden los idiomas con suma facilidad</strong>  </p>  <p>  \t            Ya es de sobra conocido que los niños son esponjas y que investigaciones recientes han determinado que el cerebro de los bebés está especialmente preparado para la adquisición de varios idiomas. Esta capacidad además, empieza a desaparecer a partir de los 6 años, por lo que es vital aprovechar este periodo de tiempo para exponer a nuestros hijos a un segundo idioma.  </p>  <p>  \t<strong style=\"\">El aprendizaje del idioma debería ser natural e imitar el proceso de la adquisición del idioma materno</strong>  </p>  <p>  \t            La exposición debería ser lo más natural posible. Así como uno aprende su lengua materna también puede aprender un segundo idioma. El idioma materno se adquiere escuchando y repitiendo lo que escuchamos. Para aprender un segundo idioma, necesitamos repetir el proceso de escuchar para poder repetir lo que oímos.  </p>  <p>  \t            La escucha o lo que yo llamo la exposición a los impactos auditivos del idioma (Teoría de los Impactos) debe ser lo más intensiva posible y en el caso de un bebé esto sólo se puede conseguir si creamos un entorno bilingüe en el hogar.  </p>  <p>  \t            Para crear un entorno bilingüe o aumentar las horas de exposición al segundo idioma hay varias cosas que pueden hacer los padres:  </p>  <ul style=\"\">  \t<li>Poner la tele en inglés.</li>  \t<li>Comprar juguetes que hablan en inglés.</li>  \t<li>Comprar cuentos con CD&#039;s de audio en inglés.</li>  \t<li>Asistir a actividades lúdicas que se desarrollen en inglés.</li>  \t<li>Ir al teatro en inglés.</li>  \t<li>Viajar a un país de habla inglesa.</li>  \t<li>Tener una aupair inglesa en casa.</li>  \t<li>Asistir a una guardería inglesa.</li>  \t<li>...</li>  </ul>  <p>  \t            Pero sin duda lo más importante y l<strong style=\"\">o más valioso es si los padres también hablan en inglés a lo largo del día.</strong> Una persona que domina el inglés lo tendrá más o menos fácil pero también es posible para una persona cuyo nivel de inglés es básico.  </p>  <p>  \t            Poco a poco, se pueden ir aprendiendo frases usuales que se utilizan a lo largo del día en las rutinas que compartimos con nuestros bebés. Por ejemplo, en las comidas, en la hora de acostarse, el baño, etc.  </p>  <p>  \t            El curso Inglés en 9 Meses ofrece precisamente esto, frases y vocabulario que los papás podrán usar con sus bebés/hijos todos los días.  </p>  <p>  \t            De esta manera, no sólo se apoya el desarrollo de un futuro bilingüismo si no que el padre o madre en cuestión mejora su propio nivel de inglés.  </p>  <p>  \t<strong style=\"\">Cómo funciona</strong>  </p>  <ul style=\"\">  \t<li>Cada día abrirás una mini-lección de 5 minutos. </li>  \t<li>Escucha y repite lo que escuchas. Trata de no leer ya que ahí empiezan los problemas de pronunciación. Imita el sonido.</li>  \t<li>Memoriza las frases de la lección diaria y busca situaciones para practicarlas de inmeadiato. </li>  \t<li>Repite la operación al día siguiente, añadiendo nuevas frases a tu memoria y usándolas de inmediato. </li>  \t<li>Si tienes un smartphone o tablet, descarga la app de Udemy. </li>  </ul>  <p>  \t        Si sigues el método indicado, cada sección te llevará una semana. Son 5 días aprendiendo frases, 1 día haciendo el quiz y el séptimo día repasando. Por lo que tardarás 4 semanas en terminar con este primer mes.  </p>  <p>  \t      Tras el cual podrás continuar con los 8 meses restantes.  </p>  <p>  \t      Hay 3 meses que tienen 5 capítulos en vez de 4. Al finalizar el curso tendrás en tu haber más de 1200 frases para las siguientes situaciones cotidianas.  </p>  <p>  \t      1. Diminutivos objetos  </p>  <p>  \t       2. Diminutivos animales.  </p>  <p>  \t                 3. Diminutivos personas.<br style=\"\">  \t                 4. Términos afectuosos para niños.<br style=\"\">  \t                 5. Bebés.<br style=\"\">  \t                 6. Saludos.<br style=\"\">  \t                 7. Despertarse por la mañana.<br style=\"\">  \t                 8. Ropa y vestirse.<br style=\"\">  \t                 9. La cocina.<br style=\"\">  \t                 10. Seguridad y accidentes.<br style=\"\">  \t                 11. Jugando dentro de casa.<br style=\"\">  \t                 12. Jugando aprendiendo.<br style=\"\">  \t                 13. Jugando fuera de casa.<br style=\"\">  \t                 14. Jugando con otros niños.<br style=\"\">  \t                 15. Lo que dicen los niños.<br style=\"\">  \t                 16. La escuela infantil o la baby-sitter.<br style=\"\">  \t                 17. Ayudando en casa.<br style=\"\">  \t                 18. En el baño.<br style=\"\">  \t                 19. Hora de bañarse.<br style=\"\">  \t                 20. Hora de acostarse.<br style=\"\">  \t                 21. Palabras de ánimo, alabanzas, felicitaciones.<br style=\"\">  \t                 22. Averiguando qué pasa y dando consuelo.<br style=\"\">  \t                 23. Modales.<br style=\"\">  \t                 24. Disciplina.<br style=\"\">  \t                 25. En la calle.<br style=\"\">  \t                 26. Enfermedad y doctores y hospìtales.<br style=\"\">  \t                 27. De compras y en restaurantes.<br style=\"\">  \t                 28. Especial fiestas.<br style=\"\">  \t                 29. El mundo adulto desde los ojos de un niño.<br style=\"\">  \t                 30. Palabrotas.<br style=\"\">  \t                 31. En verano.<br style=\"\">  \t                 32. Aprendiendo a caminar.<br style=\"\">  \t                 33. En familia.<br style=\"\">  \t                 34. Me hago mayor.<br style=\"\">  \t                 35. De picnic.<br style=\"\">  \t                 36. Veo Veo.<br style=\"\">  \t                 37. Está nevando.<br style=\"\">  \t                 38. En el zoo.  </p>", 
    "end_date": null, 
    "title": "Mes 1 - Inglés en 9 Meses, para Bebés y la Familia. ", 
    "price": "20.00", 
    "instructors": "Claudia Carter", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147706_d67a_5.jpg", 
    "course_url": "https://www.udemy.com/ingles-para-familias-en-9-meses/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-16T09:18:51Z"
}