{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t Es el séptimo mes del curso, Inglés en 9 Meses para Bebés y la Familia.  </p>  <p style=\"\">  \t Te recomiendo que empieces por el primer mes. Puedes encontrarlo <a href=\"https://www.udemy.com/ingles-en-9-meses-para-bebes-y-la-familia-mes-1/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">aquí</a>. Y vayas progresando mes a mes, pues al principio se enseñan cosas que luego se dan por sentadas.  </p>  <p style=\"\">  \t Este mes veremos frases para las siguientes situaciones cotidianas:  </p>  <ol style=\"\">  \t<li style=\"\">Poniendo límites en casa. Por ejemplo, no saltes en la cama, no grites, no trates así a tu hermano, no juegues dentro de casa con la pelota...</li>  \t<li style=\"\">En el coche, de paseo y en el bus. Por ejemplo, abróchate el cinturón, menudo atasco, te estás mareando, dame la mano para cruzar, apreta el botón para bajar del bus...</li>  \t<li style=\"\">Enfermito y visita al médico. Por ejemplo, estás caliente, hay que ir al médico, te va a dar un pinchacito, te duele la barriga, no tienes buen aspecto, tienes muchos mocos...</li>  \t<li style=\"\">De tiendas y en el restaurante. Por ejemplo, siéntate bien, no juegues con el cuchillo, ayúdame con la lista de la compra, no voy a comprarte un juguete, no grites, fue un accidente..</li>  \t<li style=\"\">BONUS, Fiestas y celebraciones. Por ejemplo, frases para la celebración del cumpleaños, de la Navidad y del Año Nuevo. </li>  </ol>", 
    "end_date": null, 
    "title": "Mes 7 - Inglés en 9 Meses para Bebés, Mamás y la Familia.", 
    "price": "35.00", 
    "instructors": "Claudia Carter", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222864_0c19_2.jpg", 
    "course_url": "https://www.udemy.com/mes-7-ingles-en-9-meses-para-bebes-mamas-y-la-familia/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-19T14:02:27Z"
}