{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<ul><li><strong>Course was updated on March 28th:</strong></li></ul>\n\n<p>This course is from a <strong>result oriented person </strong>who is offering you a chance here to build a new <em>simple understanding of English Grammar</em>. I've created this \"map\" after teaching English for business, TOEFL preparation, IELTS preparation and after watching <u>more than 400 movies </u>which helped me to see <strong>application of the rules </strong>I'm explaining here.<br></p>\n\n<p><u>The aim of this course is</u> <strong>to help every English user to use it correctly to avoid any misunderstandings that may occur because of grammatical mistakes and errors </strong>like the one I'm explaining in the promo.</p>\n\n\n\n<p><em>After this course you will have a good understanding and usage of </em>the following tenses and you will be able to use them in sentences and questions. The tenses I'm explaining are: <u>simple present, simple past, present continuous, past continuous and basics of present perfect.</u></p>\n\n\n\n<p>This detailed course takes you smoothly in a virtual class which will enable you to understand those tenses and <strong>apply them on your daily life.</strong> Multiple <u>quizzes </u>are included as downloadable files. You will also find a lot of <u>examples </u>in the course, as downloadable files, to show you how to answer these quizzes and have the most benefit. This course also has <strong>English SUBTITLES, </strong>so make sure you use them.</p>\n\n\n\n<p>Finally, note that this course will be <strong><u><em>updated </em></u></strong>according to your needs and to my \"map's\" enhancements, so be sure to stay active in the course.</p><p>Enroll now and don't let English grammar stop you from achieving more in your career and your life.</p>\n\n\n\n<p><strong>There's nothing to lose here. You got 30 days of full refunding if you weren't satisfied.</strong></p>", 
    "end_date": null, 
    "title": "Nail English Grammar: Communicate Perfectly and Easily", 
    "price": "20.00", 
    "instructors": "Amgad El-Sakka", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766514_1b42_4.jpg", 
    "course_url": "https://www.udemy.com/english-grammar1/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T13:16:34Z"
}