{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Naučite engleski jezik pomoću pisanih i zvučnih zapisa razgovora koji su stvarni i suvremeni! Kada učenik uči na temelju stvarnih razgovora, stječe samopouzdanje da razumije ono što čuje, ali i da vodi pravi razgovor. Naš ubrzani tečaj nudi materijale pomoću kojih učenik razvija svoje razumijevanje i uči važne izraze za stvarne društvene situacije.</p><p><strong>Učenici engleskog jezika: učite uz razgovore i izražavajte se bolje na engleskom!</strong></p><p>Steknite samopouzdanje za vođenje pravih razgovora</p><p>Poboljšajte svoj izgovor i naglasak slušanjem sadržaja s neutralnim engleskim izgovorom</p><p>Učenje uz razgovore je ključno<br></p><p><strong>Naučite izraze koji se danas redovito koriste u Sjevernoj Americi</strong></p><p>Sadržaj ovog tečaja nadahnut je stvarnim razgovorima. Proučavanjem ovog sadržaja učenik se priprema za vođenje pravih razgovora na engleskom jeziku.</p><p>Osim toga, sadržaj je popraćen savjetima poliglota o tome kako poboljšati svoje iskustvo učenja (i povećati svoj vokabular) te usvojiti ono što ste naučili svaki put kada vodite stvarne razgovore – i tako primjenjivati ono što ste naučili.</p><p>Prvi razgovori u ovom tečaju su osnovni, ali oni već uvode sadržaj koji je složeniji od većine osnovnih tečajeva. Oni učeniku nude sadržaj koji se može koristiti u gotovo svakom razgovoru u bilo kojem društvenom okruženju. Sljedeći razgovori iz našeg tečaja temelje se na društvenim situacijama koje se javljaju u svakodnevnom životu u Sjevernoj Americi. Posljednji (bonus) razgovor nudi mali izazov učenicima na osnovnoj razini, uz kratki intervju za posao u formalnijem tonu.</p><p>Pomoću ovog sadržaja učenik stječe više samopouzdanja u svoj govor. Također razvija osnovne vještine učenja iz pisanih i zvučnih materijala na vrlo učinkovit način.</p><p><strong>Opis tečaja</strong><br></p><p>Ovaj ubrzani tečaj nudi nekoliko razgovora, a svaki razgovor ima dvije verzije: jedna verzija je vrlo spora (kako biste se mogli usredotočiti na izgovor ponavljanjem svake riječi), a druga verzija sadrži govor koji se odvija uobičajenom brzinom (kako biste se mogli usredotočiti na razumijevanje).</p><p>Ako učite pomoću razgovora, osim što učite izraze koji se koriste u svakodnevnom životu, također stječete veliko samopouzdanje jer počinjete govoriti jezik i shvaćati izvorne engleske govornike mnogo bolje dok pričate s njima.</p><p>Sadržaj tečaja je suvremen, a razgovori se temelje na stvarnim društvenim situacijama. Sadržaj nije dosadan kao u starim udžbenicima koji vas podučavaju „razgovoru u zračnoj luci“ ili „razgovoru u hotelu“. Sadržaj nudi izraze koji se mogu koristiti u svakoj društvenoj situaciji.</p><p>Uz ovaj sadržaj možete naučiti važne izraze, poboljšati izgovor, poboljšati slušno razumijevanje i razviti samopouzdanje u vlastito izražavanje.</p><p>Naravno, ovaj ubrzani tečaj predstavlja samo malu osnovu za učenike engleskog jezika, ali može vam poslužiti i kao dobar uvod kako biste govorili jezik s većim samopouzdanjem.</p>", 
    "end_date": null, 
    "title": "Naučite engleski jezik!", 
    "price": "20.00", 
    "instructors": "Gabriel Silva", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668422_44d9.jpg", 
    "course_url": "https://www.udemy.com/naucite-engleski/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T02:59:07Z"
}