{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>Easy to understand English captions in each lesson!</strong></p><p>What's the most important skill in English?  If you said, \"listening\", you're right.  Why?  If we hear, \"Book is on table\", we'll never say, \"THE book is on THE table\".  If we don't hear \"the\", we won't think it's there, and we won't say it. That means our listening ability affects our conversational ability. The best English listeners are also potentially the best English conversationalists.</p><p>This is the same English listening course for international learners that Nina produced for major international corporations such as Toyota Motor Sales. There are easy-to-follow captions, and many listening exercises to practice in each lesson. The goal is to begin to prepare you to hear almost every word. <br></p>  <p>  \t                                                There are two steps in Nina's English listening program. Step 1 is \"8 Secretos Para el Exito en Ingles\". You should take that course first. This is the Step 2 listening level.  </p>  <p>There are two very different kinds of English -- written and spoken. Speed of speech changes the pronunciation of spoken English.  Basically, the faster native speakers talk, the harder it is to understand them, unless you learn and practice these spoken English pronunciation rules.  Step 1, \"8 Secretos Para el Exito en Ingles\", introduced learners to the most important pronunciation rules of native English speakers (reduced forms). It introduced learners to the rhythm or \"music\" of English sentences, and many important spoken English pronunciations by real native English speakers.  </p>  <p>  \t                                In this course, \"8 MORE Secrets to Understanding Native English Speakers\", Intermediate --  </p>  <ol>  \t<li>Nina will teach you the next group of important pronunciation changes in natural spoken English. After you practice hearing and understanding English as it's really spoken, you'll be able to understand native English speakers much better.</li>  \t<li>In the practice exercises, Nina will teach you to begin to hear almost every word.  Why is this important?  We're all connected in the world now. We can study together. Many of us want to work internationally. If you can hear almost every word of English, you can correct your own grammar because you can hear the correct grammar more clearly. You can learn new vocabulary because you can hear the words. Your conversation will be better because at least half of conversation is listening.</li>  \t<li>You'll get special secrets to quickly sound more like a native English speaker. Finally, you'll take a listening test at the end of the course to show you what your next steps should be.</li>  </ol>  <p>  \t                                                Nina isn't just teaching you a class. She's staying with you until you learn a skill. When your listening improves, your other English skills can also improve.  </p>", 
    "end_date": null, 
    "title": "New! 8 MORE Secrets to Understanding Native English Speakers", 
    "price": "20.00", 
    "instructors": "Nina Weinstein", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319112_8b56.jpg", 
    "course_url": "https://www.udemy.com/8-more-secrets-to-understanding-native-english-speakers/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T21:05:54Z"
}