{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>¿Qué tal tu inglés?</p><p>Y más importante… ¿Estás haciendo progreso?</p><p>Muchas personas se sienten estancados en un nivel básico o intermedio. Y no saben cómo mejorar. Quizá tienen miedo al hablar, quizá no saben pronunciar las cosas bien.</p><p><strong>¿Tu nivel será mejor dentro de 6 meses?</strong></p><p>Aprender un idioma no es lo más fácil del mundo. Si lo fuera, todo el mundo podría hablar 3, 4, 5 idiomas—o más.</p><p>En realidad, muchas personas luchan para dominar un segundo idioma—a pesar de poder hablar “perfectamente\" su lengua materna. Y una gran parte del problema es la educación que reciben…</p><p>Una educación que a veces da más miedo que confianza, y que enseña todo al revés. Que enseña gramática durante años pero no te da las habilidades que necesitas para conversar.</p><p>O (lo que es peor) te dice que no tienes “talento\" para los idiomas.</p><p>¿Realmente existe un talento innato para los idiomas?</p><p><strong>Mis 10 años de experiencia en el aula me dicen que no.</strong></p><p>He ayudado a miles de personas a mejorar su ingles. Y lo que he descubierto es que…</p><p>Hay gente que sabe qué hacer para mejorar. Que tiene los hábitos adecuados, las actitudes correctas, y las unas buenas estrategias. Gente motivada, con ganas.</p><p>Y luego hay gente que cree que no puede, y así no da lo mejor de sí para conseguir sus objetivos.</p><p>Sí tienes dificultades con el inglés, este curso es para ti. </p><p><strong>¡Pero atención! No es como otros cursos.</strong></p><p>No es otro curso de gramática (de hecho, no enseña nada de gramática…)</p><p>¿Por qué?</p><p>Porque quería que te enfocaras a algo más importante que la gramática crónica: las actitudes, hábitos y habilidades que diferencian los mejores estudiantes del inglés de los que no progresan.</p><p>No enseña gramática, pero sí enseña:</p><ul><li>Cómo motivarte para seguir estudiando hasta conseguir tus objetivos.</li><li>Los hábitos necesarios para llegar a tus propósitos con el idioma.</li><li>Las 12 claves de la pronunciación que no te enseñaron en la escuela—porque pronunciar bien es la diferencia entre entenderte con los demás y no.</li><li>Las respuestas a algunas de las preguntas más frecuentes sobre el aprendizaje.</li><li>Los mejores recursos en internet para hacer listening.</li><li>Recomendaciones de qué leer para mejorar tu nivel a diario.</li><li>Una explicación completa de como formar y conseguir tus objetivos con el inglés—o cualquier otra cosa que te plantees.</li><li>11 cosas que puedes hacer para superar el miedo al hablar—las estrategias que utilizan los mejores estudiantes para conseguir la fluidez.</li><li>Lo que tus profesores nunca te enseñaron sobre el aprendizaje del inglés (no saberlo puede ser un obstáculo, incluso años después).</li><li>Consejos para superar las dificultades más grandes para mejorar tu fluidez.</li><li>Cómo organizar tu tiempo para sacar más provecho a tu día y tus estudios.</li><li>Dónde encontrar a alguien con quien practicar tu inglés (en la vida real o en internet)</li><li>Recursos recomendados para aprender gramática y vocabulario que necesitas</li></ul><p>Consiste en más de 7 horas de video, para enseñar bien la pronunciación (y porque mucha gente aprende mejor escuchando que leyendo.</p><p>Con todo, el curso <em>Objetivo Inglés </em>te puede ahorrar mucho dinero a lo largo—y años de frustración que pueden resultar de no tener claro lo que tienes que hacer para mejorar tu nivel.</p><p>Por cierto, en el curso va incluido el libro <em>6 Claves para Aprender Inglés</em> (en formato PDF), que ha revolucionado la forma de pensar de miles de personas en todo el mundo.</p><p>(De hecho, creo que soy el único profesor de inglés que también es autor-top ventas—el libro ha sido el #1 en Amazon Kindle tanto en España como en México.)</p><p>Y el curso es la continuación lógica del contenido del libro, con todo lo nuevo que he aprendido desde que se publicó, y un énfasis en la pronunciación–cosa que no se puede hacer en un libro, pero en video, sí.</p><p><strong>Escucha lo que dicen otros estudiantes</strong></p><p>Aquí tienes lo que están diciendo algunos estudiantes sobre mis cursos.</p><p>Sobre el curso de Inglés Básico:</p><p>“Recomiendo este curso al 100% … Además, Daniel es un profesor estupendo y te contesta rápidamente a todas las dudas que te surgen. Si crees que aprender ingles es aburrido y costoso haz este curso y cambiaras de opinión.\" —Irantzu, Pamplona, España</p><p>Sobre el curso de los Phrasal Verbs:</p><p>\"Si el inglés es tu asignatura pendiente, sin duda, este es tu curso. Personalmente el método de Daniel Welsch me parece muy adecuado para aprender los phrasal verbs más importantes. He complementado este curso con otros libros que tiene el autor como base teórica de mi aprendizaje del inglés.\" — Pere, Barcelona, España</p><p>“Excelente curso, muy completo y práctico, me gusta la forma tan simple como Daniel explica los Phrasal Verbs, y que los repite en diferentes lecciones, también que explique la forma mas común de decirlos, o como se dicen en ingles americano y en ingles británico. De verdad lo recomiendo! Se merece 10 puntos!!\" — Kyana, Caracas, Venezuela.</p><p>El curso <em>Objetivo Inglés </em>es nuevo y estoy seguro que tendrá el mismo éxito—o más—que los otros.</p><p>Y por supuesto, tiene la garantía de Udemy de 30 días—si el curso no es para ti, devuélvelo. No quiero que te apuntes para algo que no te guste.</p><p>Si tienes cualquier pregunta sobre el curso, contáctame aquí. Estoy encantado de ayudarte.</p><p>Buen aprendizaje,</p><p>Daniel.</p><p>P.D. He pasado todo el verano trabajando para hacer el mejor curso posible—y como siempre mis amigos blogueros creen que soy loco por venderlo a este precio. Así que aprovecha antes de que me convenzan de subirlo :-)</p>", 
    "end_date": null, 
    "title": "Objetivo Inglés: lo que no te enseñaron en la escuela", 
    "price": "40.00", 
    "instructors": "Daniel Welsch", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560146_c9ae_2.jpg", 
    "course_url": "https://www.udemy.com/objetivo-ingles/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T07:49:35Z"
}