{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>LATEST: Course Last Updated 10th June 2016<br></p><p>************************************************</p>\n\n<p><strong>Be able to start and hold a conversation in 7 Short Days</strong></p>\n\n<p>+++++++++++++++++++++++<br></p>\n\n<p>About this course:</p>\n\n<ul><li><em>2000+ students in the first 2 days!</em></li><li><em>No workbooks, CD's or anything else is required</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul>\n\n<p>+++++++++++++++++++++++</p>\n\n<p>With the knowledge that you will get from this course, you will be able to start and hold a conversation in English in 7 short days. The course covers the following topics:</p>\n\n<ul><li><strong>Speaking</strong></li><li><strong>Listening</strong></li><li><strong>Reading</strong></li><li><strong>Writing</strong></li><li><strong>Word Classes</strong></li><li><strong>Grammar</strong></li></ul>\n\n<p>There is a video after each section that gives you a <strong>task </strong>that you should follow in order to <strong>maximize your knowledge</strong> of the section. The task is given in a step by step format so that you can <strong>easily follow </strong>it and more importantly, <strong>complete it.</strong></p>\n\n<p>There is also a <strong>bonus section </strong>which is includes a PDF file that shows the most <strong>commonly used 50 words</strong> in English. These are 50 words that you must surely know if you are to<strong> communicate successfully</strong> in English.</p>\n\n<p>The course is presented in <strong>easy to understand terminology</strong> and allows students to take their <strong>knowledge of English</strong> to a <strong>higher</strong> degree of <strong>fluency </strong>and <strong>accuracy</strong>.</p>\n\n<p>The course is given in a<strong> number of videos </strong> to cover each of the sections mentioned above. To watch the course videos, you will need roughly around an<strong> hour and a half</strong>. However, students are encouraged to take an <strong>active role</strong> throughout the course, by <strong>taking down notes</strong> and participating in the <strong>tasks given</strong> amongst other activities.</p>\n\n<p>If you believe that you are ready to take your <strong>English speaking fluency to the next level</strong>, then this is the course for you. The content covered in this course will ensure that you are able to <strong>communicate better</strong>, <strong>more fluently</strong> and with a <strong>higher degree of success</strong> with others in your daily life.</p>", 
    "end_date": null, 
    "title": "One Week To Become A Great English Native Speaker", 
    "price": "20.00", 
    "instructors": "Kevin Farrugia", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436046_f27e_2.jpg", 
    "course_url": "https://www.udemy.com/english-speaking-english-fluently-in-a-week/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T00:44:39Z"
}