{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Démarrer votre progression aujourd&#039;hui, en seulement quelques heures</strong><strong style=\"\">! Kickstart your progress today, in just a couple hours!</strong>  </p>  <p style=\"\">  \t                L&#039;accent francais est charmant!  Mais vous voulez etre mieux compris quand vous parlez anglais, n&#039;est-ce pas?  Voila un cours fait specifiquement pour vous.  </p>  <p style=\"\">  \t     Les lectures sont en anglais mais il ya des références vers le français pour assurer votre compréhension.  </p>  <p style=\"\">  \t<strong style=\"\">              Inclus dans ce cours:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Présentations vidéo, audio et power point pour tous les styles d&#039;apprentissage</li>  \t<li style=\"\">Semblable à avoir une leçon privée avec un professeur</li>  \t<li style=\"\">Exercices pour pratiquer votre prononciation dans des situations de conversation</li>  \t<li style=\"\">Des fichiers audio pour pratiquer les phrases que vous trouvez personnellement les plus difficiles</li>  </ul>  <p style=\"\">  \t<strong style=\"\">     Commencez aujourd&#039;hui à reduire votre accent avec de cours Niveau 1.</strong> Ce cours offre un moyen rapide et facile de corriger votre anglais car il est adapté pour votre langue maternelle.  </p>  <p style=\"\">  \t<strong style=\"\">      Avis des etudiants: *****5 étoiles! &quot;Merci Jenne, tes cours sont très clairs&quot; - Basma</strong>  </p>  <p style=\"\">  \t          ----------------------------------------  </p>  <p style=\"\">  \t<strong style=\"\">         The French accent is charming!  But you want to be better understood in English right?</strong>  Here is a course made specifically for you.  The lessons are in English but certain explanations are in French to help understand how errors occur when you speak English.  </p>  <p style=\"\">  \t<strong style=\"\">         Included in this course:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Video, audio and power point presentations for all learning styles</li>  \t<li style=\"\">Video lectures with teacher video and power point presentation combined</li>  \t<li style=\"\">Similar to having a private lesson with a teacher</li>  \t<li style=\"\">Exercises to practice your pronunciation in conversational situations</li>  \t<li style=\"\">Audio files to practice the phrases that you personally find most difficult</li>  </ul>  <p style=\"\">  \t<strong style=\"\">     Get started on reducing your accent with this Level 1 course.</strong>  This course provides a fast, easy way to correct your English because it&#039;s tailored for your native language.  </p>  <p style=\"\">  \t<strong style=\"\">      What students are saying: *****5 stars! &quot;Excellent teacher, great course, I enjoyed it so much. Thank you!&quot; - Yasmin</strong>  </p>", 
    "end_date": null, 
    "title": "Perdre son accent et ameliorer sa prononciation en anglais", 
    "price": 0, 
    "instructors": "Jennifer Glover", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/181470_3838_7.jpg", 
    "course_url": "https://www.udemy.com/perdre-son-accent-en-anglais/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-13T07:46:54Z"
}