{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Welcome to the Perfect English Pronunciation Practice Course. In this course, you will learn how to clearly pronounce 12 of the trickiest consonant sounds in English. Understanding and practicing these sounds will help you improve your English pronunciation and make yourself better understood.</p>    <p>Make Your English Pronunciation Sound More Clear and Natural. </p>    <ul><li>Learn how to shape your mouth to pronounce these English sounds.</li><li>Recognize the difference between tricky sounds like L &amp; R, Th &amp; S, or F &amp; P.</li><li>Get structured practice speaking these sounds. </li><li>Make yourself understood in English conversations</li><li>Gain confidence in your English pronunciation.</li></ul>            <p><strong>Improve Your English Pronunciation.</strong></p>    <p>The consonant sounds in English are quite different from the consonant sounds in other languages. Perhaps your native language doesn’t have the Ch sound as in “chicken,” or the Th sound as in “thanks.” Maybe you’ve wondered how native English speakers move their mouth, lips, and tongue to make the sound of English. Well, you will learn all about how to correctly move your mouth to pronounce English which will result in reducing your non-English accent.</p>    <p>For each of the consonant sounds, you will first learn how to shape your mouth. You’ll see a short video clip during the lecture that demonstrates how to make the sound. Then, you’ll practice the basic sound itself, then words using the sound in various positions, and finally sentences that have words using those consonant sounds. Then there exercises contrasting two of the sounds, like B &amp; V or S and Sh.</p>    <p>In addition, in each section of the course, there are some practice exercises which are stories that have lots of the target words in them. Finally, to help you check your understanding and progress, each section has a listening quiz which is based on the consonants you studied.</p>", 
    "end_date": null, 
    "title": "Perfect English Pronunciation Practice", 
    "price": "20.00", 
    "instructors": "Michael DiGiacomo, MBA", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616038_9aa2_4.jpg", 
    "course_url": "https://www.udemy.com/perfect-english-pronunciation-practice/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T18:38:53Z"
}