{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>In this Lower-Intermediate course you will focus mainly on grammar.</p><p>This “Lower Intermediate&quot; Course is equivalent to<br style=\"\"></p> <ul style=\"\"> <li>The “<strong style=\"\">Flyers</strong>&quot; level from the Cambridge University in the UK.</li><li>The <strong style=\"\">A2</strong> level in the Common European Framework of Reference for Languages (CEFR).</li><li>A <strong style=\"\">0-56</strong> points at the <strong style=\"\">TOEFL</strong> exam (Test Of English as a Foreign Language).</li> </ul> <p><br style=\"\"> </p> <ul style=\"\"> <li><strong style=\"\">WHAT WILL YOU LEARN: (COURSE CONTENT)</strong></li></ul><p style=\"\">In this second course you will learn a lot of grammar, such as the Relative Clauses (who, that, which, when, where), how to create an Imperative, the use of the Infinitive of Purpose. How to create a sentence in Past Simple, the verb There was or There were and when to use them. You will also learn the Past Continuous, the Future Simple, the Present Perfect Simple and the 3 English verb tenses structures that create all the verb tenses in English. We will show you the structure to create a Tag question and a Short answer.</p><ul style=\"\"><li><strong style=\"\">WHAT WILL YOU DO:</strong></li></ul><ul style=\"\"><li>Over 11 lectures and 40 min of video content explaining in detail each grammar topic.</li><li>Downloadable material.</li><li>You will practice everything doing grammar exercises required to finish the course.<ul style=\"\"></ul></li></ul><ul style=\"\"><li><strong style=\"\">WHAT WILL YOU GAIN AFTER THE COURSE:</strong></li></ul><p style=\"\">After finishing this course you will be able to have a good conversation in English, understand intermediate readings, be able to start following English TV series.<br style=\"\"></p> <p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Pre-Intermediate English Grammar", 
    "price": "20.00", 
    "instructors": "Kate Ochsner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/454074_e6be_3.jpg", 
    "course_url": "https://www.udemy.com/english-grammar-lower-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T19:13:41Z"
}