{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Our mother tongue has a huge impact on how quickly and effectively we learn a new language. Think about it, we have years of practice with pronunciation in our native languages, learning mouth positions, understanding tongue and lip placement, and perfecting the sounds that occur throughout our differing dialects. So, <em style=\"\">is it easy to throw all that aside when we learn a different language? Of course not</em>. New languages require using muscles in our faces we&#039;ve never used, understanding concepts we&#039;ve never seen, and re-thinking words we thought we knew. <strong style=\"\">This course helps you (Portuguese speakers) to improve your pronunciation, and speaking skills.</strong> It helps you to not only see and understand common mistakes, but stop making them so you can perfect your English fluency.<br style=\"\"></p><p>In a classroom, you are lumped in with every other learner, who as individuals, have a variety of obstacles to overcome that may or may not relate to your own challenges. It is impossible for a teacher, or a textbook for that matter, to give you the<strong style=\"\"> individualized attention you deserve</strong> in a setting of multiple students. Sometimes a teacher won&#039;t be familiar with the common mistakes, so won&#039;t be able or properly prepared to help you fix them. <em style=\"\">That&#039;s where I come in</em>. I&#039;ve been teaching English for over 7 years, and specifically, have been working with Portuguese speakers for about 5 in personal tutoring and academic settings. Don&#039;t believe in me yet? I have lived in Brazil, taught in Brazil, and even married a Brazilian, <em style=\"\">so I&#039;ve seen countess mistakes made over and over with hundreds of non-English speakers and feel it&#039;s time to take action and help.</em></p><p>In this course you&#039;ll get the personalized attention to your problem areas, perhaps before you even knew they existed! <strong style=\"\">This course can be used as a guide for beginners to start learning, intermediate students to break old, bad habits, or for advanced speakers to hone in on their skills and ensure their English is as close to perfect as it can be.</strong></p><p>Through course lectures, audio and video files, quizzes, infographics, and other supplemental material, you&#039;ll get much more out of this course than the ___minutes here. Join today!</p>", 
    "end_date": null, 
    "title": "Pronúncia de inglês para nativos de língua portuguesa", 
    "price": "50.00", 
    "instructors": "Jennifer Nascimento", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470030_ec53_4.jpg", 
    "course_url": "https://www.udemy.com/english-pronunciation-for-portuguese-speakers/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T17:23:50Z"
}