{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Dear Parents,</p><p><br></p><p>Throughout my years tutoring batch after batch of PSLE English students, I have noticed the same old grammar questions popping out again and again.</p><p><br></p><p>This is a short crash course that aims to prepare your child for PSLE English grammar.  Yes, English will be much simpler for your child if he can REMEMBER the grammar rules.  </p><p><br></p><p>In this course, I will explain some confusing grammar rules to your child and teach him how to apply the rules correctly.  I will show examples and point out what are the common mistakes that most students make.  (Yes, I have seen countless of this mistakes made by students and I do not want you to be like them!)</p><p><br></p><p>There will be plenty of quizzes in this course, so not only does your child learn from my lectures, he will be applying the lessons taught by attempting the quizzes as well.  This also helps them to learn actively.</p><p><br></p><p>After doing all my quizzes, your child would have a better understanding of English grammar.  </p><p><br></p><p>He should be scoring full marks for his English grammar sections and he should be able to watch out for any careless mistakes made while writing.</p><p><br></p><p>Hope you sign them up for this course and let them learn in a fun and interactive way!</p><p><br></p><p>\" I hear and I forget.  I see and I remember.  I do and I understand.\" - Confucius.</p>", 
    "end_date": null, 
    "title": "PSLE English Grammar Crash Course", 
    "price": "50.00", 
    "instructors": "Mr Jerry Lee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651034_fac1_3.jpg", 
    "course_url": "https://www.udemy.com/psle-english-grammar-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T08:11:56Z"
}