{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<h5>*Última actualización: 28 Enero 2014</h5>  <h4><strong style=\"\">¿Quieres aprender inglés pero te topas con los siguientes obstáculos?</strong><span style=\"\"></span></h4>  <ul style=\"\">  \t<li style=\"\">Quiero aprender inglés pero no tengo tiempo.</li>  \t<li style=\"\">No me basta con lo que aprendo solo en unas cuantas clases.</li>  \t<li style=\"\">Aprendo muy poco en clases tradicionales de inglés.</li>  \t<li style=\"\">Aprendo muy lento en general.</li>  \t<li style=\"\">Ese libro/Curso que le eché un ojo y suena interesante pero está en inglés.</li>  \t<li style=\"\">Para que aprender inglés si no obtengo nada de ello</li>  \t<li style=\"\">Aprendo muy poco en clases tradicionales de inglés.</li>  </ul>  <p>  \t<strong style=\"\"> </strong>  </p>  <h5>Si has respondido sí a más de una de estas afirmaciones, este curso es para ti.</h5>  <p>  \t                                             Aprender algo nuevo puede ser una aventura emocionante pero a su vez puede ser atemorizante y causar ansiedad y frustración. Es como aventurarte a un bosque desconocido que sabes que puedes dominar pero requieres de tiempo para explorarlo, conocerlo y básicamente vivir dentro de él. Te das cuenta que para conquistar el bosque desconocido es necesario dominar <strong style=\"\">4 pilares</strong> que son fundamentales: <strong style=\"\">pronunciación básica, gramática básica, conversaciones simples, y prácticas en tu propio tiempo.</strong>  </p>  <p>  \t                                             Con esta sencilla guía de <strong style=\"\">4 horas</strong>, allanarás el terreno para permitirte ahorrar tiempo y esfuerzo en donde recibirás las herramientas necesarias para dominar el bosque y sentar unas bases firmes para que seas capaz de tomar cursos de inglés cada vez más avanzados.  </p>  <p>  \t                                             Al finalizar este curso, <strong style=\"\">serás capaz de comenzar conversaciones simples pronunciando de manera correcta. </strong>  </p>  <p>  \t                                             No solo aprenderás a dominar el bosque durante las lecciones, si no que te daré unas simples técnicas y métodos con los cuales <strong style=\"\">aprenderás en tu propio tiempo, en tu día a día</strong>.  </p>  <p style=\"\">  \t        Aprenderás ciertas frases aunque tengas un nivel nulo o mínimo del inglés las puedas utilizar en tu vida diaria y se vuelvan rutina y aceleres tu aprendizaje en tu propio tiempo a tu propio ritmo.  </p>", 
    "end_date": null, 
    "title": "Saca tu INGLÉS en sólo 4 horas y en 4 sencillas lecciones", 
    "price": "20.00", 
    "instructors": "Juan Pablo Machuca", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134656_f0c0_7.jpg", 
    "course_url": "https://www.udemy.com/saca-tu-english-en-solo-4-horas/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-17T02:02:00Z"
}