{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t      This is a course that will introduce you to beginning through advanced concepts of sentence diagramming.  There are 13 individual lessons and downloadable exercises for you to try. Each video lesson is between five and sixteen minutes long, and you have all the time you need to complete the exercises, either by pausing the video or by downloading the exercises and answers as a PDF.  Each lesson leads to the next, and you will be guided through the course in a step-by-step process that will take you through beginning concepts of grammar and diagramming through more advanced concepts of grammar and diagramming. For those who are more comfortable with written materials, a textbook is available on Amazon. However, the textbook is certainly not required.  Each lesson will prepare you for the next by asking you to think critically and analytically about your interpretation of sentences before diagramming.  </p>  <p style=\"\">  \t    Diagramming sentences is a playful, fun way to analyze everyday language!  It&#039;s for all ages, from students just learning English as a second language, to students studying Language Arts, to students prepping for the SAT, ACT, or even a GRE.  This course helps students learn to identify the parts of speech, locate those parts in well-constructed sentences, and see the patterns inherent in Standard English.  In other words, diagramming sentences helps students become better readers, writers, and critical thinkers!  </p>", 
    "end_date": null, 
    "title": "Sentence Diagramming - From Beginner to Expert in 12 Lessons", 
    "price": "30.00", 
    "instructors": "Amy Lynn Hess", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33369_4c12_11.jpg", 
    "course_url": "https://www.udemy.com/sentence-diagramming-from-beginner-to-expert-in-12-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-22T15:54:06Z"
}