{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><p>This  is an introduction to troubleshooting ESL skills: Basic English Language Course.&nbsp; Its purpose is to fill in gaps in  communication and give you knowledge of important topics like American culture  and social skills, as well as trouble spots that are often skipped over in the  English language classroom. It is a highly unique and extremely helpful  smattering of solutions - but is not intended as a complete ESL course, nor is  it for complete beginners.</p>    <p>Over the past 10 years of teaching adults and college  students English as a Second Language, from my classes for beginners to  intermediate and advanced students, I have made a note of common challenges.  This collection of 60 of the best video lesson responses to these challenges  are now organized in sequence with supporting materials and quizzes to help  you, the learner, follow along and see your progress. </p>    <p><ul style=\"\"><li><span>Includes a sampling of troubleshooting solutions across  several&nbsp; topics</span><br style=\"\"></li><li><span>This  basic English language course includes 60 video lectures from 1 to 7 minutes  long each, supplementary text materials (explanations to review and worksheets  for practice), and quizzes</span><br style=\"\"></li><li><span>You  can complete this basic English language course at your own pace. If you  watch one video per weekday, you complete the course in 3 months. If you study  intensely for 3-4 hours each day, you can complete the course in two days.</span><br style=\"\"></li></ul></p>            <p>You  will benefit from this Basic English Language Course if you are:</p>    <p><ul style=\"\"><li><span>A high-beginner, intermediate or advanced English learner</span><br style=\"\"></li><li><span>Looking for a unique, engaging and easy to follow course</span><br style=\"\"></li><li><span>Looking for a springboard to accelerate your English skills  for social, professional or personal reasons</span><br style=\"\"></li><li><span>Interested in American English culture, idioms and  pronunciation</span><br style=\"\"></li></ul></p>                <p>This course is not recommended for:</p>    <p><ul style=\"\"><li><span>Very low level beginners in English</span><br style=\"\"></li><li><span>Students looking for a traditional, textbook-based, complete  A-Z English course</span><br style=\"\"></li><li><span>Students under 13 years old</span><br style=\"\"></li><li><span>Students not interested in social situations, professional  English use, or American English</span><br style=\"\"></li></ul></p>                <p>Take  this Basic English Language Course right now and improve your English skill.&nbsp;</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Speak English Like a Native: Troubleshooting Course for ESL", 
    "price": 0, 
    "instructors": "Gabby Wallace", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/11418_727f_7.jpg", 
    "course_url": "https://www.udemy.com/listening-skills-for-esl/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-11-25T23:00:32Z"
}