{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  Learning to speak English or any language used to be hard work, with hard study, trying to remember so many new words and how to say them, a long period of time taking so many really boring lessons, taking a long time to learn very little. That has all changed with iMagicEnglish. This new method is easy and funny, and you will speak and understand English very quickly without any hard study, memorizing or translating! Difficult to believe, but TRUE!  </p>  <p>  \t  Do you really want to take a long, boring course with dull lessons that do not inspire your brain to greatness? Or do you want to use a new method that will get you speaking and understanding English with ease and speed? You choose….  </p>  <p>  \t  This course is a series of short video lectures that are designed to excite your brain, and will engage your brain to work at a higher level! You already know it’s estimated that most people only use 6% of their brain power? That’s often because the teaching methods used in most subjects, especially languages, hasn’t changed in a thousand years! Just information that you have to somehow remember and keep in your head, so that when you leave the classroom, that information goes with you, and is stored in your brain, in a way that is easily accessible. Makes sense, but doesn’t work? Right! Usually, most of the information that you are ‘taught’ is left behind in the classroom when you leave.  </p>  <p>  \t  Learning to speak and understand English using the iMagicEnglish method will excite the neurons in your brain, so that all the data that you use is stored PERMANENTLY inside your brain, and is ACCESSIBLE, AUTOMATICALLY and INSTANTLY whenever you need to use it. And you don’t even have to study hard or try to remember anything. Incredible, isn’t it? Well, I WILL PROVE IT TO YOU!  </p>  <p>  \t  You may know that when you start to try to learn something new, neurons in your brain start to grow, to reach out and make connections with other neurons. Well to do this successfully, they need to be EXCITED! But because most learning methods are so incredibly BORING, your neurons are NOTexcited very much, and although they TRY to grow, and make connections, they usually don’t make any connections….they just wither and die. THIS CAN ALL CHANGE NOW!  </p>", 
    "end_date": null, 
    "title": "Speak English Fast & Easily - With iMagicEnglish!", 
    "price": "20.00", 
    "instructors": "Richard Marly", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/202344_88a9_9.jpg", 
    "course_url": "https://www.udemy.com/speak-english-easily/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-21T02:44:11Z"
}