{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>As a business professional, student or traveller, you need to communicate in English with confidence. This intensive English Fluency course will catapult your skills in record time.</p><p><strong>Master English Quickly using the English Laboratory Method</strong></p><ul><li>amass vocabulary</li><li>discover the multiple meanings behind the top 1000 words</li><li>pronounce any word correctly</li><li>learn how to speak in collocations</li><li>build confidence</li><li>reach fluency</li><li>network</li><li>track your progress</li></ul><p><strong>6 months of real time conversations included!</strong></p><p>This course contains over 45 lectures, 50 quizzes and periodic progress assessments to keep you on track. But that's just the tip of the iceberg! Included in the course's ridiculously low price is the YadaYada six-month package. This package, normally priced at 234€, gives you access to 6 months of real conversation. That's right! I will meet with you and a small group every week through video conference. YadaYada is a unique community forum where English Laboratory users have the opportunity to network and socialize. Put your skills to the test in real conversation with other learners. What other English course gives you the tools you need <em>and</em> the space to experiment with them!?!</p><p>Time is the new money. And what this course will save you is <em>time</em>! Time studying grammar rules, time memorizing ... time better spent <em>conversing</em> in English, not studying it. In six months or less you will be engaging in conversations, debates and negotiations with confidence.</p><p>And this course is structured to take as long as you need. If you already have a good or excellent level, you will progress more quickly through the process than a newbie.<br></p><p>The structure of the course is based on scaffolding. In other words, you will build upon information you already have about English. We will start with the foundation, the sounds, and eventually move on to common expressions, otherwise known as collocations.</p><p>We will learn about how English speakers communicate with each other face to face and you will discover the short cuts to get to that level. Complete with hacks and resources, by the end of this course you will be able to speak English spontaneously and naturally.</p><p><strong>Requirements</strong></p><ul><li>notebook and pencil or folders set up on your device</li><li>registration for YadaYada (link available inside)</li><li>webcam (optional) and microphone</li><li>no specific software needed</li><li>open-minded and ready to learn attitude</li><li>a willingness to experiment</li></ul><p><span></span></p>", 
    "end_date": null, 
    "title": "Speak English Once And For All", 
    "price": "50.00", 
    "instructors": "Jennifer England", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625662_a8d0_2.jpg", 
    "course_url": "https://www.udemy.com/speak-english-once-and-for-all/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T09:05:28Z"
}