{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>Why Technical English?</strong></p><p>More and more businesses are globalised and this is also true of industrial companies in the engineering sector. This globalisation demands that people on different continents are able to work together, this means that besides your technical skills it is also important to understand and be understood in, what is for most companies the lingua franca, English.</p><p>Whether you work for a Japanese company co-operating with companies in the USA or a European company with subsidiaries in Asia, many of the well-paid and secure jobs require English at a higher level than school English.</p><p><strong>Who is this course for?</strong></p><p>The course is to help you improve and expand your English knowledge for work in the Technical, Engineering, Manufacturing industry. It is for anyone thinking of a career in this field or anyone already working in the sector but feels the need to increase their English language.</p><p><strong>How is the course organised?</strong></p><p>Technical English (micrometres) explains in both written and spoken form how to use one of the most important tools in Engineering. It is structured to introduce words in context, which is proven as the best way to learn new vocabulary. From the text certain words are highlighted, these become the focus words and form the core of the learning. In addition there is unlimited learning time with the use of word games, flashcards, spelling and listening exercises.</p><p><strong>Tips</strong></p><p>Do the word games at least one time each day. You can do the word games before the lectures or after, it can be good for you to look through the vocabulary set before looking at the lecture, after the lecture you should try to understand and learn all the words for that lecture.</p><p>Keep repeating the learning games, it is important to move newly learnt vocabulary into your long-term memory, this is best done through repetition, try to beat your best scores.</p><p>If you need to speak the words, record yourself on your smart phone speaking the words, better still record yourself speaking the text of the lectures.</p><p>Give yourself time, this is vital. Give yourself time to understand, repeat things until they are clear in your head. You can always use the discussion section if you need any specific help or tips.</p><p>I look forward to helping you on your technical English journey.</p>", 
    "end_date": null, 
    "title": "Technical English-micrometres for Engineering", 
    "price": "40.00", 
    "instructors": "Derek Reddy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573210_a443_3.jpg", 
    "course_url": "https://www.udemy.com/technical-english-micrometres-for-engineering/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T06:59:21Z"
}