{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  In this course you will practice listening, speaking, reading, and writing skills in English with a strong focus on speaking. We will review how to use five main tenses in English:  </p>  <ol style=\"\">  \t<li><strong style=\"\">Past tense<br style=\"\">  \t</strong></li>  \t<li><strong style=\"\">Present tense</strong></li>  \t<li><strong style=\"\">Present Continuous tense</strong></li>  \t<li><strong style=\"\">Future tense</strong></li>  \t<li><strong style=\"\">Present Perfect tense</strong></li>  </ol>  <p>  \t  Perfecting the basics is much more important than knowing advanced English grammar. If you can perfect these five basic tenses in English, you will be able to speak and practice English in everyday life!  </p>  <p>  \t<strong style=\"\">Speaking &amp; Listening</strong>  </p>  <p>  \t<strong style=\"\"></strong>Each section contains an explanation of how to make and use each tense. These explanations are meant to be a review of the tense before the main practice. <strong style=\"\">You should already have a basic understanding of each of these tenses. </strong>  </p>  <p>  \t  Following the explanation are videos with example questions, sentences, and conversations. Use these videos as listening and speaking practice. Repeat after me in the questions and sentences videos. Speak out loud! This is very important. <strong style=\"\">Active learning is much more effective than passive learning.</strong> Actively practice speaking your English.  </p>  <p>  \t<strong style=\"\">Reading &amp; Writing</strong>  </p>  <p>  \t  Each section also contains a handout that you can download and print for your own use. Practice your reading for each tense. Also, use these handouts to help you make your own sentences and questions in English. <strong style=\"\">You should write down your OWN questions and sentences to practice using each tense.</strong> Don&#039;t simply copy the examples. Try different verbs, different nouns, and different time phrases. The examples are designed to help you understand and make a variety of different questions and sentences in English. Use the handouts to help you!  </p>  <p>  \t<strong style=\"\">Review</strong>  </p>  <p>  \t  Watch the videos as many times as you would like. Go back and practice speaking after me to help your pronunciation. Actively learning is the best way!  </p>  <p>  \t  Have fun practicing the Top 5 Most Useful English Tenses for second language learners!  </p>", 
    "end_date": null, 
    "title": "Top 5 Most Useful English Tenses", 
    "price": "40.00", 
    "instructors": "Shawn Roe", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71022_8855_7.jpg", 
    "course_url": "https://www.udemy.com/useful-english/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-29T08:47:48Z"
}