{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Aprenda inglês com texto e áudio de conversas reais e modernas! Ao se focalizar em conversas, o aluno ganha confiança na compreensão auditiva e também na hora de falar inglês! O nosso rápido curso oferece material para o aluno desenvolver compreensão e aprender frases importantes para situações sociais verdadeiras.</p><p><strong>Alunos de inglês: aprenda com conversas e consiga se comunicar mais rapidamente</strong></p><p>Ganhe confiança na hora da conversa<br></p><p>Melhore sua compreensão auditiva</p><p>Melhore o seu sotaque ao escutar conteúdo com pronúncia neutra</p><p>Aprenda frases utilisadas com frequência na América do Norte</p><p><strong>Aprender com conversas é fundamental para o aluno que quer ir além do inglês acadêmico e que também quer se comunicar com confiança o mais rápido possível.</strong></p><p>Muitos alunos têm a sensação de não se comunicarem bem mesmo depois de anos de cursos de inglês. Isso acontece pela falta de foco direto em conversas com conteúdo genuíno e moderno na língua inglesa.</p><p>O conteúdo deste pequeno curso foi inspirado em conversas genuínas. Ao ter exposição a este conteúdo, o aluno se prepara para conversas reais em inglês.</p><p>Além disso, o conteúdo é conplementado com dicas de um poliglota para como maximizar o aprendizado e incorporar o que foi aprendido em conversas genuínas.</p><p>Eu me lembro da dificuldade de entender e também de se expressar. Depois de tanto tempo aprendendo, era irritante ter canadenses e americanos me pedindo para repetir quase todas as frases que eu dizia. Depois de seis anos aprendendo no Brasil, a minha pronúncia ainda era terrível e era dificílimo conseguir me comunicar sem me enrolar todo.</p><p>Eu comecei a aprender inglês aos 10 anos de idade no Brasil. Eu tive sorte de ir à uma escola boa de inglês por seis anos (esta era a duração do programa) e logo em breve mudei para o Canadá. Quando cheguei aqui, eu já conseguia me expressar (na maioria das situações, com uma certa dificuldade) e entender razoavelmente bem, porém seria um exagero dizer que eu já era \"fluente\". Eu só consegui chegar em um nível fluente depois de dois anos morando aqui no Canadá. Olha que eu não era mal aluno, e a escola era boa!</p><p>Mas oito anos? Por causa disso, eu cheguei a simples conclusão que eu era \"péssimo de aprender línguas\". Esta idéia justificava o fato da demora em me tornar fluente. Eu simplesmente não tinha o dom para aprender línguas. Só isso.</p><p>Porém, como eu sou teimoso (e de um certo modo também muito curioso), eu decidi tentar superar esta noção que eu era ruim de línguas. Então, comecei à aprender mais línguas - espanhol (mais fácil para nós brasileiros, né?), francês, alemão, e depois que me tornei fluente nestes (e no processo, desenvolvi um método de aprendizado de línguas), comecei a aprender italiano, holandês, russo (nestas três já consigo ter uma conversa legal) e continuei com outras. Aprender línguas se tornou uma paixão, assim como ensinar pessoas como aprendê-las como consultor.</p><p>As primeiras conversas deste curso são básicas, porém já introduzem idéias mais complexas que a maioria dos cursos básicos, oferecendo ao aluno conteúdo que pode ser utilizado em praticamente qualquer conversa. Em seguida, outras conversas focalizam em situações sociais que ocorrem no dia a dia na América do Norte. A última conversa (bônus) oferece um pequeno desafio aos alunos de um nível básico com uma pequena entrevista de emprego (com um tom mais formal).<br></p><p>Com este conteúdo, o aluno pode desenvolver mais confiança na conversa e desenvolver a capacidade necessária para aprender com áudio e texto de uma maneira altamente eficaz.</p>", 
    "end_date": null, 
    "title": "Turbine O Seu Inglês: Foco Em Conversação ", 
    "price": "20.00", 
    "instructors": "Gabriel Silva", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/637042_7459_2.jpg", 
    "course_url": "https://www.udemy.com/inglescomconversas/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-11T01:13:18Z"
}