{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This course is from the educational program of El Salvador for Eleventh grade of high school, it has seven contents and we have chosen five contents that we considered relevants to this Unit. In this course students will learn about famous people and grammar contents, because is funfamental to improve the grammar part to communcate in an understand way to others. Especially this unit will help  in the communicate part, explaining in a clear way how to talk in present perfect, simple past and past progressive using time clauses and used to and the uses of would</p>\n\n<p>The reason why we create this course is to help students in the learning of a second language, especially using the technology to improve the methodologies and in that way the students will be more active in the learning process.\n\n  </p>\n\n<p>We present in the section meeting famous people some biographies of famous people as part of the content, because is something that program requires and it helps to students to have listening comprehension.\n\n  </p>\n\n<p>In section 2 we present the uses of “used to”  in simple past and past progressive, at the same time we shared some links where the students can practice and also study to have a better understanding\n\n  </p>\n\n<p>In section 3 we talked about present perfect, explaining some importance uses for this tense emphasying in the uses of never, yet, already, for, since and always.\n\n  </p>\n\n<p>In setcion 4 we present the uses of time clauses for simple past and past progressive, we also shares some online exercises to practice more and more information about it.\n\n  </p>\n\n<p>In section 5 we present the uses of would also sharing more information about it.\n\n  </p>\n\n<p>In some sections we add some games to practice the grammar parte, in that way students will have more fun and will learn at the same time.</p>", 
    "end_date": null, 
    "title": "Unit 1: Meeting Famous People Around the World,11th G. ES", 
    "price": 0, 
    "instructors": "Gilma Elizabeth Vigil Campos, Harold Ruby Orellana Rivera, Leydi Maricela Coca Martinez, Yessica Maria Bonilla Vanegas, Jeany Argueta", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/819120_6fe6_3.jpg", 
    "course_url": "https://www.udemy.com/unit-1-meeting-famous-people-around-the-world11th-g-es/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T20:55:12Z"
}