{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<strong style=\"\">This is NOT the same canned, useless business jargon you&#039;ve heard before.</strong>  </p>  <p>  \t                    Learn <strong style=\"\">real, tested body language</strong>; tap into human psychology for <strong style=\"\">the MOST effective persuasion skills</strong>; sharpen your communication with <strong style=\"\">professional editing tips</strong>. Stop treading water in your career and dive into the real-life, immediate changes that will propel you and your career.  </p>  <p>  \t<br style=\"\">  </p>  <p>  \t<strong style=\"\">This comprehensive course is built for people of all career types and language abilities.</strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">With over 3 Hours of content</strong></em>, and for a Launch Special price of only <strong style=\"\">$39</strong>, this course is packed with information you can apply NOW. Peel back the curtain of what makes successful, confident businessmen so magnetic and <strong style=\"\">learn to do it yourself</strong>, from the inside out!  </p>  <p>  \t<br style=\"\">  </p>  <p>  \t<strong style=\"\">  HOWEVER</strong>, if you&#039;re looking for ways to trick or manipulate others so you seem persuasive, this course is not for you. The goal of this course is to change your life from the inside out.  </p>  <p>  \t                    Being persuasive isn&#039;t something you&#039;re born with. It&#039;s a skill that can be learned and mastered like any other!  </p>  <p>  \t<strong style=\"\">  In this course</strong>, we&#039;ll go through specific lessons and tactics, changing the way you approach social situations and making big changes in your life to bring out the most persuasive you!  </p>  <p>  \t<strong style=\"\">       After this course</strong>, you will know the secrets of what makes powerful communicators persuasive and be able to use them in your own life.  </p>  <p>  \t                        Never miss another opportunity to make a great impression with your speaking and writing. Whether English is your first (or third) language, learn to make powerful, lasting impressions and sell yourself, your product, or your business in thirty seconds.  </p>  <p>  \t<em style=\"\">    The simple, value-based concepts</em> in this course are explained and illustrated in great detail. The goal of this course is to not only help you succeed in social situations, but to help you understand why and how certain tactics and certain people are successful. Take the value-based journey towards more success in your business and social life!  </p>  <p>  \t                                                    By the end of this course, <em style=\"\">you will be more confident</em> and capable in your communication, be it business-oriented or otherwise. Efficiently and effectively write and speak with clear, persuasive purpose.  </p>  <p>  \t                            Prepare yourself for success, learn to present yourself like a boss, and become the person you know you can be.  </p>  <p>  \t<strong style=\"\">                                    This course covers:  </strong>  </p>  <p>  \t<strong style=\"\">      Persuasion</strong>: What it is and HOW to do it.  </p>  <p>  \t<strong style=\"\">      Graphical Communication</strong>: Tips and guidelines for crisp, effective graphics and presentations.  </p>  <p>  \t<strong style=\"\">      Body Language</strong>: Building your confidence and staying relaxed. Making great impressions. Showing power.  </p>  <p>  \t<strong style=\"\">      Powerful Lifestyle Changes</strong>: The psychology of why and how positive emotions are so persuasive. Making you more persuasive from the inside out.  </p>  <p>  \t<strong style=\"\">      Sharpening Your English</strong>: Active and Passive Voice, Commonly-Used Idioms and Expressions, etc.  </p>  <p>  \t<strong style=\"\">      Social Empathy</strong>: How it works and how to use it.  </p>  <p>  \t<strong style=\"\">      The Elevator Speech</strong>: Every aspect is covered in detail in this course, from planning, to conception, to polish, to presentation.  </p>", 
    "end_date": null, 
    "title": "Unleash Your Persuasive Self: Build Confidence THIS Weekend", 
    "price": "20.00", 
    "instructors": "Ashton Burchfield", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370378_2461_4.jpg", 
    "course_url": "https://www.udemy.com/unleash-your-persuasive-self/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T01:05:08Z"
}