{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "LATEST: Course Last Updated 26th February 2016<p>  \t    ************************************************  </p>  <p>  \t    Learn how to use technology in the English ESL classroom. Using technology, you can ensure that your students are more engaged and learn more, give you the ability to be less stressed and more focused on your job - all whilst having to spend less time to prepare before and during the lesson.  </p>  <p>  \t<br>  </p>  <p>  \t    +++++++++++++++++++++++  </p>  <p>  \t    About this course:  </p>  <ul>  \t<li><em>No workbooks, CD's or anything else is required</em></li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li>  \t<li><em>300+ students in the first 2 days!</em></li>  </ul>  <p>  \t    +++++++++++++++++++++++  </p>  <p>  \t    This course teaches you different ways how technology can be used in the ESL classroom from the point of view of both the teacher and the student. It covers several topics, such as:  </p>  <ul>  \t<li>Grabbing and Holding Students' Interest</li>  \t<li>10 Types of Technology Every Teacher Should Know How To Use</li>  \t<li>5 Must Have Technological Tools To Increase Productivity</li>  \t<li>The Tricked Out Classroom - 10 Things Every ESL Teacher Wants</li>  \t<li>Managing Your Classroom With The Swipe Of A Finger</li>  \t<li>The 9 Best Mobile Apps For Your Students</li>  \t<li>8 Activities For Putting Phones To Positive Use In The Classroom</li>  \t<li>What You Can Do With A Cellphone: 7 Great ESL Activities</li>  \t<li>How To Use Social Networks Productively In The Classroom</li>  \t<li>Creating A Class Website - How and Why</li>  \t<li>9 Best Tips to Give ESL Students for Professional Business Email</li>  \t<li>How To Teach The Millennial Generation and Get Them Off Facebook</li>  \t<li>What You Can Do With The Internet</li>  \t<li>Top 10 Teacher Software Programs You Should Be Using Daily</li>  \t<li>How To Use Movies and TV For Listening Exercises</li>  \t<li>7 Keys to Effective Listening Lessons With Videos</li>  </ul>  <p>  \t    The course is presented in easy to understand terminology and allows ESL teachers worldwide, no matter what their technological expertise is, to make use of technology to take their ESL teaching to new heights.  </p>  <p>  \t    To watch the course videos, you will need roughly around two hours. However, students are encouraged to take an active role throughout the course, by taking down notes and implementing the information that they learn in their own teaching.  </p>  <p>  \t    If you believe that you are ready to take your English teaching to the next level, then this is the course for you. The information covered in this course will ensure that you are able to give better lessons using technology and have the confidence to face any challenges that might come up as you are learning how to use the technology in your teaching.  </p>", 
    "end_date": null, 
    "title": "Using Technology To Teach English ESL Successfully", 
    "price": "20.00", 
    "instructors": "Kevin Farrugia", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333276_851f_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-technology-like-a-pro-in-esl-english-classrooms/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-01T10:08:02Z"
}