{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t                      Forget the boring memorization of vocabulary! Memorizing lists and definitions of words will not really help you. <span>To </span><em style=\"\">really</em><span> learn new words and use them, it takes getting new vocabulary words into your brain&#039;s internal word bank.  </span><span>By using an intuitive methodology, this special course can help you improve the way you speak, read and write English. You will learn how to internalize new words. </span>  </p>  <p>  \t<span><br style=\"\">  \t</span>  </p>  <p>  \t<span>Better vocabulary is essential for students wishing to improve their SAT exam scores, professionals that need to communicate, and anyone that would like a better command of the English language.  Not only will this premium course teach you 100 new words (and more!) that every English speaker needs know, it will help you to train your brain to continue to learn new words.</span>  </p>  <p>  \t          This course will:  </p>  <ul style=\"\">  \t<li>   Guide you to understand why good usage of vocabulary is important</li>  \t<li>Improve your vocabulary-based exam scores</li>  \t<li>Help you learn quick and easy ways to learn and remember words</li>  \t<li>Teach you 100 important words in 10 exercises</li>  \t<li>Teach you how to learn more new words</li>  \t<li>Expand your practical word usage </li>  \t<li>Test and asses your word knowledge with interactive quizzes</li>  </ul>  <p>  \t             Knowledge is power, so learn how improving your vocabulary can make a difference in the way speak, read and write.  </p>", 
    "end_date": null, 
    "title": "Vocabulary  Power 100", 
    "price": "20.00", 
    "instructors": "Aaron Hutchinson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303188_859b_13.jpg", 
    "course_url": "https://www.udemy.com/word-knowledge-100/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-19T10:29:20Z"
}