{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>JOIN OVER 10,000 STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE AND LEARN THE WRITING PROCESS IN 5 EASY STEPS!</strong></p><p>If you're an English language learner and your answer is 'yes' to any of these questions:</p> <ul><li>Have you ever gotten stuck when trying to write something?</li> <li>Have you ever run out of ideas or struggled to decide what to write next?</li> <li>Have you ever had trouble organizing your ideas clearly in your writing?</li> <li>Does writing even simple things like emails take you a long time?</li> <li>Do you wish to be able to write anything easily and quickly?</li> <li>Do you wish to save time and effort while writing?</li> <li>Do you want writing to be an enjoyable activity?</li></ul> <p><strong>… then this course is for YOU!</strong></p><p>In this course, you will learn</p> <ul><li><strong>The 5-step writing process used by the most effective writers</strong></li> <li><strong>The #1 mistake that people make when writing which leaves them frustrated and unable to write</strong></li> <li><strong>How to do the crucial prewriting stages effectively before writing</strong></li> <li><strong>How to prepare a full, structured outline that you can use to begin writing effortlessly</strong></li> <li><strong>How to write clear, focused paragraphs that will smoothly guide your readers through your text</strong></li> <li><strong>How to evaluate the four crucial elements of your content</strong></li> <li><strong>How to apply the writing process to any type of writing</strong></li></ul>", 
    "end_date": null, 
    "title": "Writing Basics - Learn the Writing Process in 5 Easy Steps", 
    "price": 0, 
    "instructors": "Ganesh Kumar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525876_e3ca_2.jpg", 
    "course_url": "https://www.udemy.com/power-writing/", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T10:50:02Z"
}