{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>New course in\nmy </strong><em><strong>Writing and Grammar Series!</strong></em></p><p>A paragraph is a group of sentences about a topic, while a composition is a group of paragraphs about a topic. When you write at length, it is very important that you organize your material in a logical and coherent fashion so that those reading your writing can easily follow your thoughts and ideas. This would require a good knowledge of how to write effective paragraphs and compositions, which is precisely what this course provides.<br></p>  <p>Learning how to write strong paragraphs and compositions enables you to create high-quality essays, papers, short stories, reports, and any other types of written pieces. It gives you the skills you need to confidently express your thoughts and ideas on paper. If you are a student, this will allow you to receive superior grades for writing assignments. If you are an employee or entrepreneur, your enhanced writing skills will allow you to more effectively and competently complete writing tasks in the performance of your work. </p>  <p>Upon successful completion of this course, you will be able to:</p>  <p>• Demonstrate a knowledge of what defines a paragraph.</p>  <p>• Write effective topic sentences that give readers a clear idea of what the topic/main idea of your paragraph will be.</p>  <p>• Maintain the unity of a paragraph by developing one topic and one topic only.</p>  <p>• Effectively develop the topic of a paragraph by providing sufficient, relevant details that support the topic.</p>  <p>• Arrange the material in a paragraph in a logical and coherent fashion.</p>  <p>• Keep the thought of a paragraph flowing smoothly from sentence to sentence by using transitional words and expressions.</p>  <p>• Effectively write each of the four types of paragraphs—narrative, descriptive, expository and persuasive.</p>  <p>• Demonstrate an understanding of the structure of a composition—introduction, body and conclusion.</p>  <p>• Effectively plan a composition.</p>  <p>• Effectively write a composition.</p>  <p>• Effectively revise and proofread a composition.</p>  <p>This course begins with the very basics so that you are given a strong foundation in the subject area, and then builds to the level that you need to reach in order to write effective paragraphs and compositions. Every effort is made to keep the material simple and easy to follow. And it is never assumed that you know anything; everything is explained thoroughly.</p>  <p>Detailed notes are provided in the resource section of each lecture for the purpose of review and reinforcement. These notes make it easier to locate specific content that you'd like to review. You don't have to watch an entire lecture in order to review a specific point—you can simply refer to your notes instead.</p>  <p>If you want to learn how to construct high-quality written pieces that effectively and convincingly communicate your thoughts, information, and ideas, enroll in “Writing Perfect Paragraphs and Compositions” today.</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Writing Perfect Paragraphs and Compositions", 
    "price": "25.00", 
    "instructors": "Simone Jones", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503958_89fb_17.jpg", 
    "course_url": "https://www.udemy.com/writing-perfect-paragraphs-and-compositions/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-16T18:42:45Z"
}