{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Sentences are the basic building blocks of writing. It is impossible for you to construct well-written pieces without first mastering the sentence unit. Too often, bad writing is the result of poorly written sentences that do not follow the rules of sentence construction. Such sentences leave readers baffled and confused, wondering what the writer is trying to say. It is important, therefore, that you be able to write sentences that effectively communicate your thoughts and ideas. This course will teach you how to write great sentences that are complete, concise, smooth, and coherent. If you are a student, you will receive higher grades for writing assignments as well as English/Language Arts assessment tests. If you are an employee or entrepreneur, your enhanced written communication skills will portray you as a capable, intelligent individual.<br></p><p>What Udemy Students are saying about this course (see reviews):</p><p><em>\"This is the most innovative course I have used about sentence composition and how to make my writing more appealing. I would recommend this course to anyone.</em><em>\"</em><br></p><p><em>\"Instructor Simone Jones is by far the greatest writing expert I've encountered.\"</em></p><p><em>\"Her explanation was very clear and straight to the point. Learned a lot of new things that I had never known before. Bravo!<span>\"<br></span></em></p><p><em><span>\"Thank you so much for this great course. The course enhanced my writing skills, and pushed me forward to understand writing\"<br></span></em></p><p>Upon successful completion of this course, you will be able to:<br></p>  <ul><li>Write complete sentences that can stand on their own and make sense.</li><li>Avoid sentence fragments and run-on sentences.</li><li>Identify and use the various parts of speech that make up sentences.</li><li>Write coherent sentences that allow your readers to easily follow your thoughts and ideas.</li><li>Construct sentences that are free of syntax errors.</li><li>Avoid short, choppy, disjointed sentences.</li><li>Effectively combine closely related sentences using various methods.</li><li>Vary your sentence structure and length so that your sentences are not boring and monotonous.</li><li>Avoid repetition and eliminate wordiness.</li><li>Identify and correct errors in sentence structure.</li><li>Revise and edit weak sentences.</li><li>Use the appropriate punctuation marks to punctuate your sentences.</li></ul><p><br></p><p>This course will start with the very basics of sentence construction to ensure that you are given a strong foundation in the subject area. Every effort will be made to keep the course material simple, interesting, and easy to follow. And it will never be assumed that you know anything; everything will be explained thoroughly and completely.</p>  <p>Each lecture will be followed by a quiz to test your understanding of the topic so that you can effectively gauge your progress. At the end of the course, you will also be given a comprehensive assessment test to determine your knowledge in the area of sentence construction.</p>  <p>Detailed notes are provided in the resource section of each lecture for the purpose of review and reinforcement. These notes make it easier to locate specific content that you'd like to review. You don't have to watch an entire lecture in order to review a particular point—you can simply refer to your notes instead.</p>  <p>If you are a student, employee, or entrepreneur who wants to learn how to write beautifully constructed sentences and significantly improve your writing skills, enroll in “Writing Perfect Sentences” today!</p>", 
    "end_date": null, 
    "title": "Writing Perfect Sentences", 
    "price": "25.00", 
    "instructors": "Simone Jones", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289130_0652_2.jpg", 
    "course_url": "https://www.udemy.com/writing-perfect-sentences/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-27T19:36:38Z"
}