{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>このコースは、<strong>TOEIC 650~800点を目指されている方</strong>を対象にしております。会社から昇格のために650~800点が必要だといわれている方・大学入学条件に650~800点が必要な方・また初めて受けるTOEICに備えたい方々・・・大歓迎です。</p>  <p>このコースの大きな特徴は、仕事に終われ英語に時間をとることができない方、TOEICの学校に行く時間のない方が、毎日15分集中して学習すれば、短期間でスコアアップを可能にするプログラム構成になっているということです。</p>  <p>さてこのコースの指導講師、私、西浦美枝子の自己紹介をさせてください。カナダバンクーバーのTOEIC専門校Able English Studiesを2006年に立ちあげこの10年間に約3000人の生徒さんの指導にあたってまいりました。1ヶ月で平均150点のスコアアップという実績をだしています。(生徒さんの中には1ヶ月で400点UPという方も！)</p>  <p>このコースは、そのAble English Studiesでのノウハウを生かしたプログラムになっておりますので、このコースで学習してくださる皆様も1ヶ月で数百点アップも夢ではありません。</p>  <p><strong>650~800点をめざすには、まずはパート５を攻略することです。</strong>パート５で、かなりな点を稼ぐことはそんなに難しいことではありません。パート５は、中学程度の文法力とビジネスに関する語彙が問われます。私は、文法は「決して覚えるものではなく」、「理論」を学び、ひとつ理論がわかれば次々つながる教え方をモットーにしています。私の学校の頭の柔軟な大学生達でさえも記憶に頼った学習はすぐ忘れると言います。覚えることはやめて、「文法理論」をパズルを解くように楽しんで学んでいます。いったん理論がわかると英語が自分のものになるので、仕事で英語を使う際にもとても役にたっていると卒業生からも常にうれしい感想をいただいております。</p>  <p><strong>650~800点</strong><strong>のスコア獲得のもうひとつのキーが語彙、すなわち単語です</strong>。初めて目にするような単語も多く、ビジネスに関するものばかりなので最初は抵抗があるかもしれません。しかし、頻出の単語は、このコースの問題の中で何度も使っているので自然に覚えられるようになっております。また、実際の仕事のシチュエーションで使われる例文もたくさん入れているので、英語のメールを読んだり、書いたりにも役立ちます。650点をとるには、難しい語彙は必要ないので「捨ててください」というような巷の話も聞いたことがありますが、「絶対にそんなことはしないでください」と声を大にして言いたいです。</p><p><strong>最後にカリキュラムの特徴ついて</strong>。前述したパート5を完全攻略するため、関係代名詞や動名詞など各テーマごとに例文を用いた解説レクチャーを受講頂きます。その後、実際理解出来たかを確認するオリジナルの問題を5問ご用意しています。そして全てを受講頂いた最後に全てのテーマを網羅したオリジナル問題が100問ついています。お時間の許す限りいつでもどこででも挑戦してみてください。これで受講者の皆さんのスコアも上がり、ボーナスも上がることを願っています★</p>  <p>さあ、それでは私とLet's Get started!</p>", 
    "end_date": null, 
    "title": "【1日15分でTOEIC150点UP】カナダ留学TOEIC専門学校レッスン", 
    "price": "40.00", 
    "instructors": "Nishiura Mieko", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667608_1300.jpg", 
    "course_url": "https://www.udemy.com/toeic-able/", 
    "currency": "USD", 
    "subject_name": [
        "English"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T07:12:59Z"
}