{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Introductory Price! Get this course today for only $79, $118 savings!</strong></p><p>Creating beautiful Black and White images requires more than just clicking the Black and White button. Let's Ditch Auto and get out of the one button solution mindset when creating black and white photos.</p><p>Lightroom is a powerful editing tool, and it has a lot to offer us when it comes to creating black and white images. Besides performing the actual black and white conversions, I go into detail on why I decided to convert an image to black and white.</p><p>This course is for the photographer who has played around with black and white conversions but does not fully understand how to get a dynamic conversion from one of their color photos.</p><p>This course is great for the beginner who is new to Lightroom or the seasoned Lightroom user who just wants to find new ways of converting images to black and white.</p><p>The course is structured in the same way I process images during my post production process. I always take a moment to think about the photo before I do anything drastic. Not all photos will make a good black and white image. </p><p>In this course, I talk about the image and why I think it would be a better photo in black and white. I learn by example and that is exactly the way I teach. I walk you through my thought process down to each slider adjustment.</p><p>If you are interested in learning more about black and white conversion, you will love this course.</p>", 
    "end_date": null, 
    "title": "Creating Black & White Photos in Lightroom", 
    "price": "20.00", 
    "instructors": "Jerad Hill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753966_262d_2.jpg", 
    "course_url": "https://www.udemy.com/creating-black-white-photos-in-lightroom/", 
    "currency": "USD", 
    "subject_name": [
        "Black & White"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T00:46:58Z"
}