{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t    Colorizing--that is, adding color to photos that were originally black &amp; white--can add a whole new dimension to photos, whether they are famous, historical wet plate photos, or old family treasures.  Details that are lost in grayscale suddenly come to life in color.  While one might think that colorizing is a very complicated, difficult thing to do, with the right software, practice, and patience, most anyone can become proficient.  </p>  <p>  \t    From this course, you will be able to do the following:  </p>  <ul style=\"\">  \t<li>Clean up an original black &amp; white photo with Photoshop (or other software)</li>  \t<li>Choose correct colors when going from grayscale to color</li>  \t<li>Know how to correct common mistakes in colorizing with Coloriage</li>  \t<li>Produce good-quality color photos from grayscale</li>  </ul>  <p>  \t    In this course, I will take you step-by-step through the process, from a digitized old, time-damaged wet plate photo, to a restored, colorized version.  Together, we will fix the marks that time has left, choose our colors, and fill in the lines.  With a couple hours&#039; practice, you can be on your way to becoming a photographic colorizing artist!  </p>  <p>  \t    I am living proof that most anyone can do it.  Although I had a father and grandfather who were very talented artists (and I also have a son who still is!), the talent skipped my generation.  However, I have a lot of patience, and an eye for historical detail, so with the right software (in this case, Coloriage by Akvis) and lots of practice, I get rave reviews by many on my colorizations.  My early ones were terrible!  I keep them to remind myself how far I have come because now many of my works are truly art (my late father and grandfather would be proud!).  You can do it, too!  </p>", 
    "end_date": null, 
    "title": "Learn Photograph Colorizing Using Coloriage", 
    "price": "50.00", 
    "instructors": "Thomas Duvernay, PhD", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/345008_50b4.jpg", 
    "course_url": "https://www.udemy.com/learn-colorizing-using-coloriage/", 
    "currency": "USD", 
    "subject_name": [
        "Black & White"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-15T07:29:09Z"
}