{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \tMany of the most powerful, memorable and effective photographs are black and white images. With digital photography though you can no longer take a great black and white photograph... but you can create one using the black and white photography techniques taught in this course. So if you&#039;re confused about which black and white conversion techniques to use, unsure about how to adjust the tonal range and balance of your black and white photos using curves and masks want to make more of your black and white portraits and you want to learn how to tone your black and white images this course is for you. What black and white photography techniques are you going to learn:<br style=\"\">  \t* You&#039;re going to learn how to use a range of powerful flexible and non-destructive black and white conversion techniques. You&#039;re will learn which are the most useful and powerful e.g. the Channel Mixer and Black and White tool when to use one technique rather than another and which techniques to avoid (and why).<br style=\"\">  \t<br style=\"\">  \t* You will learn how to evaluate the tonal range and tonal balance of an image and then how to make global and selective changes using adjustment layers selections masks and the Curves tool: four of the most powerful tools and techniques within Photoshop.<br style=\"\">  \t<br style=\"\">  \t* You&#039;ll then learn how to use these tools and techniques to overcome some of the unique problems you&#039;ll face when converting your portraits to black and white including how to delineate your subject from the background how to work with skin tones to maximise detail or smooth your subject&#039;s skin and how to enhance your subject&#039;s eyes.<br style=\"\">  \t<br style=\"\">  \t* You&#039;ll learn how to add unique and complex tones that will really bring your black and white images to life.<br style=\"\">  \t<br style=\"\">  \t* You&#039;re going to learn how to embed all of these tools and techniques into a flexible powerful and repeatable<br style=\"\">  \tworkflow.<br style=\"\">  \t<br style=\"\">  \t* But this isn&#039;t just a course about post-production and Photoshop: each video will also enable you to develop the skills and give you black and white photography tips you need to create not only technically optimal black and white photographs but ones that are aesthetically striking too.<br style=\"\">  \t<br style=\"\">  \t* When you create a black and white image pressing the shutter is just the start. Sign up for The Art of Black and White Photography and take the next step now. Downloads are ENABLED for this course!</p>", 
    "end_date": null, 
    "title": "The Art of Black and White Photography", 
    "price": "35.00", 
    "instructors": "David J. Nightingale", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21460_e3d3_6.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-black-and-white-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Black & White"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-19T15:38:18Z"
}