{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t         I struggled for years to figure out how to make money with my passion for travel and making videos. After many travel videos on Youtube that earned me very little, a stock footage agency in Singapore contacted me to organize my video collection and sell it over the Internet. I organized my collection and figured out how to get my collection on-line making money for me. Finally I figured it out. Nothing more exciting than seeing sales on the video clips.  </p>  <p style=\"\">  \t  If you have a passion for Travel, video, or even photography I want to share how you can make money with your passions and save you the struggle. This is a practical hands-on course that will teach you everything to need to start creating travel videos and making money with them on stock footage agencies.  </p>  <ol style=\"\">  \t<li style=\"\">An Introduction to stock footage</li>  \t<li style=\"\">Getting started - First I provide insight into what videos will sell. We cover camera gear, lenses, and accessories you will need.</li>  \t<li style=\"\">Filming video - We do a live video shoot and teach you how to film video. We take it a step further and cover special techniques like time-lapse photography, action camera's, dolly shots, and aerial video.</li>  \t<li style=\"\">Manage media - We teach you how to manage your footage and even some video editing in Final Cut Pro X to produce your stock footage clips.</li>  \t<li style=\"\">Uploading Media - We provide a complete walk-thru uploading your videos onto the 2 main stock agencies. We take it a step further by showing you how to create CSV files for large uploads.</li>  \t<li style=\"\">Getting paid - We give you an overview of the payment process</li>  </ol>", 
    "end_date": null, 
    "title": "Create Travel Videos With Stock Footage Agencies", 
    "price": "20.00", 
    "instructors": "Greg Hung", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278528_bc43_8.jpg", 
    "course_url": "https://www.udemy.com/create-stock-footage-videos-while-traveling/", 
    "currency": "USD", 
    "subject_name": [
        "Travel Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-11T06:08:57Z"
}