{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Join award winning photographer Wilko van de Kamp on this online journey to discover the secret tips &amp; techniques on how to be a professional photographer, start producing high quality pictures and skyrocket your photography skills today!</p><p>You’re about to discover the powerful methods to start taking sharp, clear and high quality pictures like a professional photographer. </p><p>This course is created with years of experience in digital photography and it will share the secret techniques to help you getting started on your photography journey, in a way that actually works!</p><p>You can quickly put the lessons into use and, if you want, even start your own digital photography business for profits. Before you realize what is happening, you’ll find yourself in the “inner circle” of photography knowledge containing the secrets and hidden tricks that allow experts to charge CRAZY fees – for nothing more than implementing proven principles!</p><p>This course covers everything there is to know about Digital Photography. It’s like having your very own digital photography professional that you can refer and ask questions anytime that you need to!</p><p>You’ll also be able to uncover a wide array of tips including interesting facts, insight tips, secret techniques and tactics that made them what they are today!</p><p>You’re going to discover so many things on how to use simple, brief and precise guidelines that will help you step-by-step to get started on taking great pictures and be like the pro at any time you wish! Not only will you learn all the benefits and advantages of learning to all the techniques and principles on digital photography, but you’ll also learn extra bonus tips to actually teach other people.</p><p><strong>Become successful in taking pictures, get more clarity and be the professional in your career you want to be! Digital Photography Mastery is a step-by-step, paint-by-the-numbers guide showing you how to use the right lenses, equipment and how to get the perfect pictures at any time you want. In a seven week program, we’ll take you through the entire course with helpful, fun exercises to apply what you’ve learned.</strong></p><p>In a matter of weeks you could be joining a photography contest to show your talents in photography. Best of all, you could do all of this without the gimmicks and hype that is fed to you by most other photography manuals and courses.</p><p>When you join “Digital Photography Mastery”, you will be taking the first step on a path that will have you shooting a much better picture with every step.<br></p><p>Go over the fantastic topics of “Digital Photography Mastery” yourself, and get a clearer picture of just how much it has to offer you.</p>", 
    "end_date": null, 
    "title": "Digital Photography Mastery", 
    "price": "40.00", 
    "instructors": "Wilko Van De Kamp", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/637540_3272_2.jpg", 
    "course_url": "https://www.udemy.com/digital-photography-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Travel Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-11T19:44:34Z"
}