{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t<em>How many times have you flipped through a travel magazine and been inspired by an exotic photo of some far off destination? Ever wondered what it takes to capture amazing photos like that?</em> This course is for you: for you the wanderer, the explorer, the vacationer, the mom, the dad, the loved one. This course is for anyone looking to take better photographs while traveling. I truly believe anyone can take amazing photos. With the skills and techniques learned in this course, you'll be taking travel magazine worthy photos in no time!  </p>  <p>  \t<em>We'll cover the basics of what it means to be a photographer. In this first section we'll be covering:</em>  </p>  <ul>  \t<li>Best camera options</li>  \t<li>Complete equipment check</li>  \t<li>Prepping for your trip</li>  \t<li>Travel safety basics</li>  \t<li>Travel types, and so much more</li>  </ul>  <p>  \t<em>We'll cover the basics of professional photography, which apply to travel photographers such as:</em>  </p>  <ul>  \t<li>Exposure</li>  \t<li>ISO, Shutter Speed, Aperture,</li>  \t<li>Depth of Field</li>  \t<li>Composition</li>  \t<li>White Balance</li>  \t<li>Lighting</li>  \t<li>Thinking outside the box</li>  \t<li>And more!</li>  </ul>  <p>  \t  I'll show you some of my award winning, and gallery shown photographs. I'll discuss in detail how the photograph came to be, the difficulties taking it. For each photograph we'll cover lighting, composition, and why I took the photograph.  </p>  <p>  \t  A complete section on shooting portraits will enhance your portrait skills. We'll talk about how to improve your flash photography. You'll be taking great group shots in no time!  </p>  <p>  \t  A complete section on photo editing covers the basics of editing your photographs to make them pop! We'll be using Adobe Lightroom, a program that you can download a free trial (I'll show you how). What will we be covering in this section?  </p>  <ul>  \t<li>Correcting Exposure</li>  \t<li>Color Correction and White Balance</li>  \t<li>Playing with Saturation and Vibrance</li>  \t<li>Tone Curves</li>  \t<li>Adding Grain</li>  \t<li>Sharpening Images</li>  \t<li>Selective Color Editing</li>  \t<li>Adding Vignettes</li>  \t<li>Cropping</li>  \t<li>Creating a Panorama in Photoshop</li>  \t<li>and so much more!</li>  </ul>  <p>  \t  For all of these lessons, you will follow along as I edit my own travel photos from places like the Philippines, France, Italy, India, Mexico, across the United States, Chile, and more top destinations.  </p>  <p>  \t  I am confident that you will be a much better photographer after taking these lessons. After your next trip, you'll have artwork worthy of your walls.  </p>  <p>  \t  Thank you for your time!</p>", 
    "end_date": null, 
    "title": "Travel Photography: Take Beautiful Photos on Your Adventures", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/69520_2f6d_6.jpg", 
    "course_url": "https://www.udemy.com/photography/", 
    "currency": "USD", 
    "subject_name": [
        "Travel Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-25T06:10:30Z"
}