{"selfpaced": false, "topic_name": ["Nutrition & Wellness"], "description": "\n\n                    \n                    \n                    Eating well in a round the world regatta is no easy task. On one hand, the nutritional requirements are incredibly high, and on the other the foodstuffs taken on board must weigh as little as possible, withstand a moist environment with huge variations in temperature and be storable in a safe and organised manner.\r\nNutritional content needs to be high and to respond to the requirements of incredible physical and mental strain, often in extreme climate conditions.\r\nIn this course you will learn about the types of food taken on board for a Barcelona World race, how menus are designed, and incorporating freeze-dried foods, which continue to maintain their organoleptic qualities despite undergoing manipulation to ensure they weigh as little as possible and are long-lasting and stable.\r\nIn this course we will also look at calculating nutritional requirements and how to plan a diet to guarantee maximum performance in the training, sailing and round the world racing periods.\r\nProjects associated with the Barcelona World Race 2014/15:\r\nThe development of foodstuffs with a very high nutritional and organoleptic value with the Torribera UB Food Campus, the El Celler de Can Roca restaurant, the Les Cols restaurant and the companies Sosa Ingredients and Telstar.\r\nDuring this research project, six dishes have been formulated: Hummus, Salmorejo and Rice Pudding by Celler de Can Roca, and Potatoes in their juices, Cream of Buckwheat and Rice with tinned squid.\r\n \n\n                                            Syllabus\n                        Module 1 - Introduction Module 2 - Food and sporting performance in a round the world regattaModule 3 - An analysis of the energy requirements of ocean sailing Module 4 - Nutritional strategies \n                                    ", "end_date": "2015-06-01T00:00:00Z", "title": "Chefs and nutritionists. A high-performance diet for a round the world regatta", "price": 0, "instructors": "Pere Castells Esqué and Vicky Pons", "institution_name": ["University of Barcelona"], "commitment": "", "subject_name": ["Health & Medicine"], "course_url": "https://www.canvas.net/browse/barcelona/courses/en-nutrition", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Canvas.net"], "start_date": "2015-04-20T00:00:00Z"}