{"selfpaced": true, "topic_name": ["Nutrition & Wellness"], "description": "\n\n                    \n                    \n                    Food plays a central role in our society but few people actually understand what it does to our bodies. Learn more about nutrition and how our diet profoundly impacts our current and future health.This introductory nutrition course addresses the relationship between nutrition and human health with a focus on health problems related to overnutrition.\n\nIn this course, Professor Sander Kersten from Wageningen University will introduce you to the chemistry of the three macronutrients fat, carbohydrate and protein. You will learn how macronutrients are absorbed, stored, and metabolized for energy, and you will gain a contemporary view of how different types of fats, carbohydrates and proteins affect human health. Moreover, NUTR101x will cover energy homeostasis and the regulation of bodyweight, and provides ample coverage of the topic of obesity. Finally, the course will make you familiar with nutritional research and research methodologies.\n\nNo previous knowledge needed. By completing this course, you will have the necessary tools to better weigh and interpret the information overload about nutrition and health.\n\nNUTR101x is part of the Nutrition - Food for Health XSeries of Wageningen University. To continue learning, check out Nutrition and Health Part 2, which focuses on malnutrition. \n\n                                    ", "end_date": "2017-05-08T00:00:00Z", "title": "NUTR101x: Nutrition and Health Part 1: Macronutrients and Overnutrition", "price": 0, "instructors": "Sander Kersten", "institution_name": ["Wageningen University"], "commitment": "6-8 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.edx.org/course/nutrition-health-part-1-macronutrients-wageningenx-nutr101x-0", "duration": "53 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-05-02T00:00:00Z"}