{"selfpaced": false, "topic_name": ["Algebra & Geometry"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Mathematics\n                                                                                                    &gt; Algebra &amp; Geometry\n                                                            \n                            \n                                                \n                    \n                    \n                    Foundations to Frontiers (LAFF) is packed full of challenging, rewarding material that is essential for mathematicians, engineers, scientists, and anyone working with large datasets. Students appreciate our unique approach to teaching linear algebra because:\n\nIt’s visual.\n\tIt connects hand calculations, mathematical abstractions, and computer programming.\n\tIt illustrates the development of mathematical theory.\n\tIt’s applicable.\nIn this course, you will learn all the standard topics that are taught in typical undergraduate linear algebra courses all over the world, but using our unique method, you'll also get more! LAFF was developed following the syllabus of an introductory linear algebra course at The University of Texas at Austin taught by Professor Robert van de Geijn, an expert on high performance linear algebra libraries. Through short videos, exercises, visualizations, and programming assignments, you will study Vector and Matrix Operations, Linear Transformations, Solving Systems of Equations, Vector Spaces, Linear Least-Squares, and Eigenvalues and Eigenvectors. In addition, you will get a glimpse of cutting edge research on the development of linear algebra libraries, which are used throughout computational science.\n\nMATLAB licenses will be made available to the participants free of charge for the duration of the course.\n\nThis summer version of the course will be released at an accelerated pace. Each of the three releases will consist of four ”Weeks” plus an exam . There will be suggested due dates, but only the end of the course is a true deadline.\n\nWe invite you to LAFF with us!\n\n \n\nFAQs\n\nWhat is the estimated effort for the course? \n\nAbout 8 hrs/week.\n\nHow much does it cost to take the course?\n\nYou can choose! Auditing the course is free.  If you want to challenge yourself by earning a Verified Certificate of Achievement, the contributions start at $50.\n\nWill the text for the videos be available?\n\nYes. All of our videos will have transcripts synced to the videos.\n\nAre notes available for download?\n\nPDF versions of our notes will be available for free download from the edX platform during the course.  Compiled notes are currently available at www.ulaff.net.\n\nDo I need to watch the videos live?\n\nNo. You watch the videos at your leisure.\n\nCan I contact the Instructor or Teaching Assistants?\n\nYes, but not directly. The discussion forums are the appropriate venue for questions about the course. The instructors will monitor the discussion forums and try to respond to the most important questions; in many cases response from other students and peers will be adequate and faster.\n\nIs this course related to a campus course of The University of Texas at Austin?\n\nYes. This course corresponds to the Division of Statistics and Scientific Computing titled “SDS329C: Practical Linear Algebra”, one option for satisfying the linear algebra requirement for the undergraduate degree in computer science.\n\nIs there a certificate available for completion of this course?\n\nOnline learners who successfully complete LAFF can obtain an edX certificate. This certificate indicates that you have successfully completed the course, but does not include a grade.\n\nMust I work every problem correctly to receive the certificate?\n\nNo, you are neither required nor expected to complete every problem.\n\nWhat textbook do I need for the course?\n\nThere is no textbook. PDF versions of our notes will be available for free download from the edX platform during the course. Compiled notes are currently available at www.ulaff.net.\n\nWhat are the principles by which assignment due dates are established?\n\nThere is a window of 19 days between the material release and the due date for the homework of that week. While we encourage you to complete a week’s work before the launch of the next week, we realize that life sometimes gets in the way so we have established a flexible cushion. Please don’t procrastinate. The course closes 25 May 2015. This is to give you nineteen days from the release of the final to complete the course.\n\nAre there any special system requirements?\n\nYou may need at least 768MB of RAM memory and 2-4GB of free hard drive space. You should be able to successfully access the course using Chrome and Firefox.\n\n \n\n \n\n                                    ", "end_date": "2015-09-16T00:00:00Z", "title": "UT.5.03x: Linear Algebra - Foundations to Frontiers (LAFF)", "price": 0, "instructors": "Robert van de Geijn and Maggie Myers", "institution_name": ["The University of Texas at Austin"], "commitment": "", "subject_name": ["Mathematics"], "course_url": "https://www.edx.org/course/linear-algebra-foundations-frontiers-utaustinx-ut-5-03x", "duration": "15 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-06-03T00:00:00Z"}