{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>New Tool using the latest tool available online - updated at 2016</strong></p><p>Why it is important to stay annoymous online even if you think you do nothing illegal or wrong. Event such as just surfing ebay or amazon for some online shopping. Or even </p><p>just simple having a casual chit chat with your friend in another part of the way. Facebook messenger such as how are you. While I can say it is not illegal but is it </p><p>important? Well it may seem unimportant... but think again if you know that whatever you are surfing, somebody is tapping on it, whatever you are chatting, somebody is looking </p><p>at it, would you still do it? Your email can be a simple hello but somebody is watching it, would you still be comfortable to use the service? Apart from blackberry, most </p><p>email send is not encrypted. </p><p>Is there way to protect yourself? Now staying annoymous is getting popular. Most company want to encrypt their information and have spend hundred of thousand dollar just to </p><p>secure their system. You and me can do it with all the free service. And I am here to teach you about annoymous. At the end of the day you can decide if you want to implement </p><p>any of it. It may be a little inconvience but for the peace of mind most will want to implement it.</p><p>You will get the basic idea about the internet privacy and the importance about why to be anonymous online, and also how to use proxy server services to bypass restriction or </p><p>surf anonymously to protect your privacy</p><p>I will cover the basics about VPN and how you configure and use VPN services using PPTP (Point-To-Point Tunneling Protocol) and Open VPN with free VPN service providers to </p><p>access internet anonymously and protect privacy, Also cover where you will get the list of Virtual Private Network </p><p>I will describe how you can use Tor browser for bypass firewall restricted access to browse website or download content and basic about the onion route. Access the web </p><p>anonymously with censorship and privacy free access.</p><p>You will learn how to be anonymous on mobile device and protect your privacy, how we can configure PPTP L2PT VPN, OpenVPN, Proxy Tool and Tor network in our mobile device.</p><p>Email - the privacy and email protection part is cover which explain how identity theft is manage to send emails using your personal email address (spoof email) and how Junk </p><p>email and spam email services feed your inbox and how you can protect your mails from spam services using Temporary disposable emails services.</p><p>You will know how Free email providers or spy agency dig into your email, and how you can protect your mails using Encryption also demonstrate how you can use PGP in Browser </p><p><strong>Join me now and stay anonymous</strong></p>", 
    "end_date": null, 
    "title": "2016 - How to Stay Anonymous Online - VPN TOR Mobile Email", 
    "price": "20.00", 
    "instructors": "Mandal Anish", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587056_5ecb.jpg", 
    "course_url": "https://www.udemy.com/2015-how-to-stay-anonymous-online-vpn-tor-mobile-email/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T05:41:33Z"
}