{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Thor Alexander: 5 x Webanalyse per Google - kostenlose Webstatistiken</strong></p><p>Kompakter Leitfaden über Webstatistik und Webanalyse sowie darüber, was Ihre potentiellen Kunden machen und nicht machen<br></p><p><strong>+++ Letzte Aktualisierung am 06.02.2016, neue Lektion über Unterdrückung von Datensendungen an Google +++</strong></p><p><strong>Webanalyse, Webstatistik, Besucheranalyse, Besucherstatistik</strong><strong>, Besucherauswertung</strong><br></p><p>Wenn Sie erfahren möchten, was Besucher Ihrer Webseiten tun und wenn Sie wissen möchten, wie Besucher im Internet suchen, dann sind Sie hier genau richtig. </p><p>Die Besucherauswertung bzw. Webanalyse ist auch unter anderen Begriffen wie Webstatistik, Besucheranalyse, Besucherstatistik bekannt.</p><p><strong>+++ Vorstellung von 5 kostenlosen Googlediensten zur Webanalyse +++</strong></p><p>Dieser Webanalyse-Kurs beschreibt die kostenlosen Möglichkeiten, die Google bietet, um Ihnen zu helfen, mehr Besucher auf Ihre Webseiten zu locken. Dieses Wissen ist Grundvoraussetzung für eine spätere Suchmaschinenoptimierung. Denn wie wollen Sie etwas optimieren, wenn Sie nicht wissen, was Besucher von Ihnen erwarten, wie Besucher agieren oder welche Begriffe potentielle Interessenten zum Suchen verwenden.</p><p><strong>Für wen ist Webstatistik interessant?</strong></p><p>Dieser Webanalyse-Kurs wendet sich an alle Webseitenbetreiber und interessierte Webanalysten, die nicht unbedingt eigene Webseiten betreiben müssen.</p><p>Im Kurs erfahren Sie an praktischen Beispielen, ob und wie Sie GoogleRelated, GoogleSuggest, GoogleTrends, GoogleKeywordPlaner, GoogleWebmasterTools und GoogleAnalytics nutzen können.</p><p>Wenn Sie <strong>mehr Besucher und mehr Umsatz </strong>mit Ihren Webseiten erzielen möchten, dann zeigt Ihnen dieser Webanalyse-Kurs einige Möglichkeiten, Ihre (potentiellen) Besucher besser zu verstehen.</p><p><strong>Als Ergänzung zum Webanalyse-Kurs empfehle ich folgende Online-Kurse:</strong></p><ul><li>Suchmaschinenoptimierung kompakt - kostenloses SEO</li><li>Rechtskonformes Impressum selbst erstellen</li><li>Vom perfekten Domännamen zur erfolgreichen Domänstrategie</li></ul><p><strong>Besuchen Sie jetzt meinen Online-Kurs: </strong></p><p><strong> 5 x Webanalyse per Google - kostenlose Webstatistiken</strong><strong>!</strong></p>", 
    "end_date": null, 
    "title": "5 x Webanalyse per Google - kostenlose Webstatistiken", 
    "price": "30.00", 
    "instructors": "Dipl.-Ing. Thor Alexander", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665578_7c5b_5.jpg", 
    "course_url": "https://www.udemy.com/google-webanalyse/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-10T06:34:03Z"
}