{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Create and configure your own virtual private server (VPS) from scratch and step-by-step.</strong></p>\n\n<p>During this course, learn to create from scratch your own VPS server, configure it properly, with security measures best suited and most appropriate mechanisms of operation.</p>\n\n\n\n<p>Deploy your services and sites on a fast server like Nginx, with PHP or whatever you require, just perform and learn all that you can do with a VPS.</p>\n\n\n\n<p>Displays all your projects with your own domain, with endless possibilities, because it is your VPS and your rules. Keep your own space in the cloud for all your work, projects and ideas; all in the same VPS.</p>\n\n\n\n<p>Create your own VPS with <strong>DigitalOcean</strong>, installs and deploys a complete system with Linux / Ubuntu, PHP <strong>Nginx </strong>and MySQL besides obtaining TLS certificates completely free and automated through <strong>Letsencrypt</strong>.</p>\n\n\n\n<p>With your VPS, you can install al what you need and you require, just learn how to do that and deploy all the projects that you want.</p>\n\n\n\n<p><strong>Why choose this course?</strong></p>\n\n\n\n<p>After completing this course, you will be able to deploy your own VPS server very quickly and easily, using very powerful tools, innovative and safe (Nginx, letsencrypt, PHP, MySQL, etc). You will have your personal and professional projects online without additional costs, because no matter how many domains, subdomains, or projects put on your VPS, the cost will remain the same because you can do all that you need in a single VPS.</p>\n\n\n\n<p>Upon completion of all classes, have all your projects under a VPS server, completely safe with <strong>HTTPS / TLS </strong>connections, completely free through <strong>Letsencrypt</strong>.</p>\n\n\n\n<p>Do you want more details? Here is everything that you can get from this course:</p>\n\n\n\n<ul><li>Create your own VPS server with DigitalOcean or the service that you prefer.</li><li>Have a safe and friendly fast system with Linux / Ubuntu on your VPS</li><li>Deploy a Nginx server in minutes on your VPS</li><li>Hardening your Nginx installation</li><li>Install a MySQL server quickly</li><li>Configure and easily use Git to deploy projects on your VPS</li><li>Get external packages and install them globally (composer and Letsencrypt as examples)</li><li>Create and set up your own domain and unlimited subdomains in a single VPS</li><li>Point your domain to your VPS server, configuring DNS entries</li><li>Connect to your VPS remotely, easily and safely</li><li>Learn to use basic commands (cd, service, cp, sudo, mv, rm, mkdir, reboot, etc.) directly on the VPS.</li><li>Learn to easily manage your packages with apt-get, keep updated your VPS</li><li>Assign permissions for folders in the right way</li><li>Keep easily updated your VPS system (retained packages and grub)</li><li>Managing user accounts for the VPS</li><li>Manage and assign administrative permissions (sudo / su) for users</li><li>Connect with third-party service from your VPS, through SSH keys</li><li>Easily set up a firewall and dramatically increases the security of your VPS</li><li>Set up your services to make them safer</li><li>Set headers expiration for your projects</li><li>Enables system Gzip on your server</li><li>Set up your services to reduce possible attacks DoS and DDoS</li><li>Avoid CSS / XSS</li><li>Install security certificates. HTTPS / TLS connections for your projects in your VPS</li><li>Use Letsencrypt and get easily free security certificates</li><li>Create domains and subdomains easily in your VPS</li><li>How easily deploy any project in your VPS</li><li>How to deploy complex projects in the VPS (Laravel as use case)</li></ul>\n\n\n\n<p><strong>It does not end here! </strong>You are going to have <em>lifetime access</em> to all the current and <em>new classes </em>that are going to be added to the course, keep updated your VPS with the latest packages, versions, and systems.</p>\n\n\n\n<p>Finally, but not less important, you can contact me at any moment; I will always be pleased to help with any problem or project.\n</p>\n\n\n\n<p>Do not wait to be an expert and keep your own services and projects in the cloud with a VPS.</p>\n\n\n\n<p><strong>Join to the course now and see you in class!</strong></p>", 
    "end_date": null, 
    "title": "A Secure VPS with DigitalOcean, Nginx, LetsEncrypt. Your VPS", 
    "price": "30.00", 
    "instructors": "JuanD MeGon", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749690_97fd_7.jpg", 
    "course_url": "https://www.udemy.com/a-secure-vps-with-digitalocean-nginx-and-letsencrypt/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T04:19:38Z"
}