{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome and start the year 2016 anonymous with this brand new course!</p><p><br></p><p>In this course you will learn how to surf the web anonymously and leaving as little information as possible to prevent identifying you.</p><p>Easy step by step guide even for the not so IT affine people.</p><p>I show you the easiest and fastest way setting up a system where you do not have to puzzle one's head over!</p><p>It's meant to be timesaving and efficient.</p><p>I explain everything you should need to know and how to handle the steering wheel in a save way. <br></p><p>Using a USB flash drive to take your anonymous identity with you wherever you go with encryption to protect YOU and YOUR data (if you are operating an anonymous blog that could be dangerous or unpleasent for you if someone would know your identity, for journalists working on sensitive documents, the average citizen who is concerned about online privacy, whistleblower, human rights activists, abuse victims, and so forth).</p><p>We are going to use a different operating system to ensure there are no unnecessary programs/operating systems that could leak or spy any information.</p><p>Tips how to manage your intentions/purposes and well-conceived steps not to get busted.</p><p>Of course everything we do is legal it's up to you what you will be doing with this knowledge so I am not going to be responsible for your actions.</p><p><br></p><p>BONUS: I show you how to visit sites on the dark/deepweb.<br></p>", 
    "end_date": null, 
    "title": "Anonymous surfing for EVERYONE + dipping into dark/deep web", 
    "price": "20.00", 
    "instructors": "Gai Jin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726592_0ced.jpg", 
    "course_url": "https://www.udemy.com/anonymous-surfing-for-everyone-dipping-into-dark-deep-web/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T08:44:41Z"
}