{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Every day, advertising companies track our every move and bombard us with \"relevant\" advertisements at the expense of our privacy, ISPs and government entities in some countries stop us from visiting social networking sites and other harmless sites that don't conform to their ideology by censoring online content and hackers try to steal our data and hack our accounts for their own gain or just for the lulz.<br></p><p>Packed with step-by-step tutorials, screencasts and presentations, this course will teach how to stay anonymous online, how to deter private and public entities from gathering data on you and how to safeguard your online privacy against hackers; without learning to code or acquiring a computer science degree in the process! </p><p>This course will empower you and make you feel safer online.</p><p>In this course, you will learn:</p><ul><li>How private and public entities identify you online and how they store data on you to create a usage profile.</li><li>How your computer and web browser is leaking tons of personal information about you and what you can do to stop that</li><li>What proxy service and virtual private networks (VPNs) are and how to use them</li><li>How to install and use anonymising software and services to safeguard your online identity</li><li>How to view website that have been censored by your ISP or government</li><li>What is virtual machine and how you can use it to deal with suspicious file that could cause harm to your computer</li><li>How to send anonymous emails and more importantly not let companies use your email IDs to create your profile or sell your address to spammers</li><li>How to encrypt your online chats so no eavesdropper can read it</li><li>What services allow you to encrypt your phone calls and text messages and ensure the safety of the one device you cannot live without: your smartphone.</li><li>Bonus Content: Overview of an entire Operating System built around anonymity and online security.  </li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Anonymous Online: The Ultimate Guide to Online Privacy", 
    "price": "20.00", 
    "instructors": "Shashank Sharma", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662142_0dfb_2.jpg", 
    "course_url": "https://www.udemy.com/anonymous-online/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T16:14:05Z"
}