{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p>This Apple OS X Lion Server training course will teach you how to install, configure and monitor OS X Lion Server. Whether you are setting it up for a school, home network or business, you will learn the ins and outs of using Lion Server to its fullest capabilities.</p>  <p>The video tutorial starts with the installation basic and advanced setup of your server. You will learn how to setup and configure a DNS server and DHCP service. You will learn about managing users and groups, using Profile Manager, client preferences, and configuring services. Chris also shows you how to manage your server using Server App throughout. As you dig deeper into Lion Server, you will learn how to configure a Time Machine service, setup file sharing using AFP, SMB, FTP and more. You will setup a Mail server, web hosting, Wiki server, Addressbook server, iCal server, iChat server and more!</p>  <p>By the conclusion of this computer based training tutorial for Apple OSX Lion Server, you will have learned everything you need to know to setup and manage an OSX Lion Server of your own! Working files are included with this training video course.</p>  <p><strong style=\"\">What You Will Learn</strong>&nbsp;</p>  <p>- How to install and administer OS X Lion Server in a commercial environment.</p>  <p>- How to set up services and securely manage Mac services and users.</p>  <p>- How to set up Web Hosting, Wiki Server, iCal Server, File Sharing and a whole host of other important aspects of Mac Server .&nbsp;</p>  <p><strong style=\"\">Who Should Take This Course</strong></p>  <p>- Anyone who needs to share Mac services on a network of any size.</p>  <p>- Anyone who needs an understanding of using Mac Server in a commercial environment.</p>  <p>- Anyone who needs to share files and services Mac to Mac or Mac to PC .</p>  <p><strong style=\"\">What People Are Saying</strong></p>  <p>&quot;I was running into problem after problem installing Mac Server, 20 minutes after watching the installation videos I had completed the task. Well worth the money&quot;</p>  <p>-David Allen</p>  <p>&quot;Easy to follow, explains everything in great detail. I&#039;ve learned so much&quot;</p>  <p>-Frank Hatch</p>  <p></p>", 
    "end_date": null, 
    "title": "Apple Mac OS X Lion Server Tutorial - A Definitive Guide", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17745_2a7b_7.jpg", 
    "course_url": "https://www.udemy.com/learning-os-x-lion-server/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-14T23:04:59Z"
}