{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Mobile Application market is growing like anything and so is the Mobile Security industry. With lots of frequent application releases and updates happening, conducting the complete security analysis of mobile applications becomes time consuming and cumbersome mainly because of the overheads in setting up and maintaining a mobile application testing environment. This course will introduce an extendable, and scalable web framework called <strong>Mobile Security Framework (MobSF)</strong> for Automated Security analysis of Mobile Applications. Mobile Security Framework is an intelligent and automated open source mobile application (Android/iOS) pentesting and binary/code analysis framework capable of performing static and dynamic analysis. It supports Android and iOS binaries as well as zipped source code. This course will teach the attendee on how to configure and run MobSF. In addition to that, the instructor will discuss various real world use cases with MobSF like Android Malware analysis and uncovering vulnerabilities in few Android applications that are present in Google playstore.</p><p><strong>Features of this course</strong></p><ul><li>Getting Familiar with an Open Source framework for Automated Mobile Security Assessment.</li><li>Learn about One Click Report Generation and Security Assessment.</li><li>Learn how to deploy MobSF at your own environment so that you have complete control of the data. The data/report stays within the organisation and nothing is stored in the cloud.</li><li>Perform Automated Security Assessment for both Android and iOS Applications.</li><li>Learn about the semi Automatic Dynamic Analyzer for intelligent application logic based (whitebox) security assessments.</li></ul>", 
    "end_date": null, 
    "title": "Automated Mobile Application Security Assessment with MobSF", 
    "price": "40.00", 
    "instructors": "Ajin Abraham", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633622_7128_3.jpg", 
    "course_url": "https://www.udemy.com/automated-mobile-application-security-assessment-with-mobsf/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T14:56:44Z"
}