{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t      Become a white hat hacker and learn all the practical techniques for penetration testing with this amazing course which will provide conceptual framework to your security training. The course not only covers theoretical concepts  but cover the practical demonstrations of various tools like Metaspoilt, Scapy and WireShark.  </p>  <p>  \t      The course is divided into the following main sections:  </p>  <p>  \t<strong>  Ethical Hacking Concepts  </strong>  </p>  <p>  \t    -What is Ethical Hacking? Know about different types of hackers. Get to know about hacktivism and practical pen testing techniques  </p>  <p>  \t<strong>  Real World Information Gathering  </strong>  </p>  <p>  \t    -Learn about foot printing and reconnaissance, Email harvesting, Learn and master SSL scan, Maltego, Whatweb, HttpRecon. Work on techniques like IP address geolocation, DNS and Mail Server Enumeration  </p>  <p>  \t<strong>  Scanning and Vulnerability Gathering  </strong>  </p>  <p>  \t    -Learn to use scapy for packet crafting and port scanning, Learn to use network scanning techniques and work on vulnerability identification  </p>  <p>  \t<strong>  Network Attacking Techniques  </strong>  </p>  <p>  \t      Master techniques for password cracking, MITM, Sniffing SSL and RDP attacks  </p>  <p>  \t<strong>Web Exploitation Techniques</strong>  </p>  <p>  \t    Learn about password attacks, SQL Injections, RCE and DOS attacks  </p>  <p>  \t<strong>Wireless Network Security</strong>  </p>  <p>  \t    Standards in Wireless security, WEP encryption, Wireless sniffing, Protecting Wireless networks  </p>  <p>  \t<strong>Metaspoilt</strong>  </p>  <p>  \t    Learn to use the metaspoilt tool for your projects  </p>  <p>  \t<strong>Detection Evasion</strong>  </p>  <p>  \t    Learn about the detection evasion techniques  </p>  <p>  \t    This exhaustive course covers everything you need to know about white hat hacking. Get the Knowledge, Get the Expertise.  </p>", 
    "end_date": null, 
    "title": "Be A White Hat Hacker and Pen Tester", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356894_aaa0_2.jpg", 
    "course_url": "https://www.udemy.com/be-a-certified-ethical-hacker-and-pen-tester/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T10:40:07Z"
}