{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course covers the very basics of cabling, racks, networking tools, and how to troubleshoot. During the course, you are immersed with lectures using PowerPoint slides and talking head videos. After each lecture, there is a demo video, and a quiz to help you cement the lessons.<br></p>\n\n<p>Finishing this course, you will have a firm understanding of:</p>\n\n\n\n\n\n\n\n\n\n<ul><li>Types of cabling</li><li>Cabling standards</li><li>Racks</li><li>Tools for cabling</li><li>How to troubleshoot common cabling issues.</li></ul>\n\n\n\n\n\n\n\n\n\n<p>This course <strong class=\"redactor-inline-converted\"><u>DOES NOT</u></strong> deal with Hubs, Bridges, Switches, Routers or configuration of this type of equipment. </p>\n\n\n\n\n\n\n\n\n\n<p>YOU BENEFIT from learning from an  I.T. Professional, with over 11 years of experience. I am an I.T. Manager, and this course is modeled around an exercise I conduct with all of my new hires. You get me, on video, going over in more depth, than what I do, in the office with my directs! You also get to watch and re-watch, where they better have taken great notes, since I don't repeat myself!</p>\n\n\n\n\n\n<p>Troubleshooting cabling issues is a very basic requirement for an I.T. Professional. Learning this skill will put you ahead of others starting in the field. Knowing what a tool is, what it looks like, and how to use it properly is critical when systems are not functioning, or down because of some wiring issue. We cover all the standard tools, including; wire strippers, punch down tool, wire crimper, tone generator and probe, as well as a cable tester.  You LEARN how to strip cable, punch cable down, terminate ends with a crimper, tone out cables, and test cables.</p>\n\n\n\n\n\n<p><strong>Content and Overview</strong></p>\n\n\n\n\n\n<p>Remember, this course is based on an exercise I do with all my new direct reports. I take them through this exercise so that I can trust them to be able to handle basic cabling issues. You will learn from an I.T. Manager with over 11 years experience. During the hour course, you will go through 7 high-level lectures, and experience 19 demos. You will take 5 quizzes that range from 4-10 questions each to help cement your understanding of the materials. I am never far away, if you have a question, you can post in the Q&amp;A section, and I will get back to you! The best part is, you get to return to any video in the course, whenever you want! There is an exercise, that has you identifying what tools you have in your office, you can find those, and then re-watch that tools video, so you can see work with the tool while watching.</p>", 
    "end_date": null, 
    "title": "Becoming An IT Pro: Network Basics Course", 
    "price": "25.00", 
    "instructors": "frank ward", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833028_157d_3.jpg", 
    "course_url": "https://www.udemy.com/becominganitpro-networkbasics/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T01:28:11Z"
}