{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Do you want to earn $100k per year or more in IT?</strong> </p>\n\n<p>Do you want  job security? </p>\n\n\n\n<p>Do you want to known as an expert in your field? </p>\n\n\n\n<p>If so, <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">keep reading. </em></strong></p>\n\n\n\n<p>SIP has become the <em class=\"redactor-inline-converted\">standard</em> in Voice Over IP communications.  Large telecom carriers are switching away from their legacy platforms into highly scalable next generation SIP networks. Even cellular phones are migrating to Voice Over LTE, which also relies on the SIP protocol.</p>\n\n\n\n<p>By taking this course you will learn the fundamentals of the SIP protocol. This knowledge has enabled me to land high paying positions at multiple telecom carriers: </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In this course you will learn: </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>What is SIP and the RFCs that it is defined in. </li><li>The different types of SIP clients and servers</li><li>The structure of SIP messages</li><li>Overview of SIP response codes</li><li>The structure of the SIP URI</li><li>Overview of SIP headers and their purpose</li><li>How the Session Description Protocol (SDP) works</li><li>How SIP allows mobility through call forking, REFER requests and Diversions</li><li>The details of SIP transactions and Dialogs</li><li>How SIP proxies route requests (We discuss stateful and sateless proxies)</li><li>The SIP Trapezoid model</li><li>How SIP Registration works. </li><li>How SIP Authentication works. We dive into how the MD5 hash is created. </li><li>What challenges SIP faces with NAT and how to overcome them.</li><li>An overview of the Real Time Protocol - AKA RTP</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course is created for: </strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>IT Generalists wanting to learn a specialized skill.</li><li>Technical support staff working for a VOIP provider</li><li>Service Delivery staff that works on VOIP networks. </li><li>Voice Engineers that want to increase their knowledge on SIP.</li><li>Central Office Engineers that need to learn SIP while they transition away from circuit switched networks. </li><li>Sales Engineers that want to close more deals.</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">About the Instructor :  </strong><br></p>\n\n\n\n<p>Keith Croxford has been involved in VOIP and networking technologies for over 14 years. He has received accolades from VOIP industry experts. Here are a few examples : </p>\n\n\n\n<p>\"<em>Keith is one of those rare engineering breeds that is exceptional in knowledge and communicating that knowledge. It is a great team player and has assisted in resolving hard issues that no one else can fix. Keith is intelligent, detailed, self disciplined, works well with others, and great at documentation. When it comes to voice engineering, there has never been a better one.</em>\" - CTO</p>\n\n\n\n<p>\"<em class=\"redactor-inline-converted\">Keith is the Swiss Army of knife of VOIP and Data networking technologies with a healthy dose of great Programming skills and Customer Experience management. It is very tough to find a Jack of All Trades and a Master of a Few and Keith is one of them. I've interacted with him in deeply technical and business related circumstances and he hits the ball out of the park in both. His work ethic is second to none. He also demonstrates a very high entrepreneur mindset.</em>\" - Director of Service Delivery </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Start Learning Now!</strong></p>\n\n<p>This same material is presented in live conferences that cost $<strong>400 per seat</strong> to attend. Through Udemy you are able to receive this course for 10% of the normal value. </p><p>Click on \"Take this course\" and start learning now. </p>", 
    "end_date": null, 
    "title": "Become a SIP expert", 
    "price": "40.00", 
    "instructors": "Keith Croxford", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/853690_3197_2.jpg", 
    "course_url": "https://www.udemy.com/learn-sip/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-19T05:09:45Z"
}