{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>UPDATE 3/17/16: </strong>My course went live on November 18, 2015. I already have <strong>164 students!</strong></p><p>I recently added Section #8: The Power of Pfsense<br></p><p>----<br>Hi I’m Brian,</p><p>I have personally configured and installed over 100 routers and firewalls, ranging in price from $50 to over $100,000 (Yes, over $100k!).<br></p><p>In my years of experience, I've always been on the look-out for 'next great thing'.<br>When it comes to firewalls, I think I have found it!</p><p>Enroll in my course and I'll show you how I take an ordinary PC and transform it into a corporate grade firewall...<strong>using FREE Software!</strong></p><p>I avoid the tech talk and explain each step in a very down to earth, easy to understand fashion.  I would dare say you might even find firewalls <em>delightful</em> after taking this course! </p><p>I show you step by step how I install and configure the PfSense firewall software on an ordinary computer, one that was headed for recycling.</p><p>Every day, our client's networks are protected by PfSense firewall software.  You can learn how too!</p><p>This course is designed for beginners.<br>I've avoided all the fluff and only focus on what's needed to get your PfSense firewall up and running in the shortest amount of time.</p><p>I'll be adding additional lectures on a regular basis - intermediate and advanced topics.</p><p><strong>I step you through:</strong><br>- PC Preparation<br>- Software Downloading<br>- PfSense CD Creation<br>- Installation<br>- Configuration</p><p>What my Course <strong>IS NOT:</strong></p>  <p>This is not boring, copy and paste theory from the web.  This is step-by-step, look over my shoulder, setup, installation, and configuration of powerful corporate grade firewall software.</p>  <p>This is not regurgitated generic tech info.  I install firewalls for a living for real clients.  I know what I am talking about!</p><p>If you install firewalls or are just a firewall hobbyist, this course is for you.</p><p>As always - <strong>30 day money back guarantee! <br></strong></p><p><strong>So </strong><strong>Don’t Delay, Enroll Today!</strong></p>", 
    "end_date": null, 
    "title": "Beginners Are Building Their Own Fortune500 Grade Firewalls!", 
    "price": "25.00", 
    "instructors": "Brian Franklin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646370_50ea_6.jpg", 
    "course_url": "https://www.udemy.com/pfsense-turn-ordinary-pc-into-enterprise-firewall-for-free/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T01:59:56Z"
}