{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>If you want to <strong>learn to code at an advanced level in C++</strong> or <strong>build your own fully functional advanced keylogger</strong> from scratch for learning <strong>ethical hacking</strong>, I think you might love this course!  In this\ncourse you will see exactly how to create an advanced keylogger starting from nothing by literally following the steps I take as I make it!</p><p><strong>This\nkeylogger is capable of recording all the keyboard and\nmouse input!</strong> It can even record independent of the language settings because it logs the\nphysical keys on the keyboard first. Next, by using an arbitrary\nkeymap with human friendly names, it translates the machine keys to\nsomething that we can understand. It also possesses mail sending\ncapabilities so you can just schedule the logfile to be sent via\nmail, lets say every 12 hours. In addition to this, it will also keep\nthe logfile encrypted. Therefore, we will create another program\nwhich will be able to decrypt the logfile on your end.</p><p>For learning C++, this is an ideal course because it is completely hands on learning that provides a functional end product!  Some future features that will be added to the keylogger course as I develop them will include but are not limited to taking screenshots, capturing clipboard content (copy-paste), recording website URLs, and so on!  <strong>Take this course now</strong> to get <strong>immediate access</strong> to the videos and to get <strong>answers to every single question you ask</strong> in the course!</p><p>As an information technology professional myself, I realize what the final product of this course is capable of. <strong>I trust in creating this that you will use it for good and for learning</strong>.  If you choose to use this keylogger for any illegal or immoral\npurposes, you risk losing a lot.  This is only for educational\npurposes. The keylogger that you are going to see will be able to\ncause some serious damage, so please use it in a legal and\nresponsible way. </p><p><strong>Thank you very much for reading this</strong> and I hope to see you in the course soon!  If\nyou have any suggestions in regard to the functionalities of the\nkeylogger, feel free to send me a message or post your requests here.\n</p>", 
    "end_date": null, 
    "title": "Build an Advanced Keylogger using C++ for Ethical Hacking!", 
    "price": "50.00", 
    "instructors": "Ermin Kreponic", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/760210_7215_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-advanced-keylogger-from-scratch-for-windows/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T23:53:32Z"
}