{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>This Course, will cover topics in the Cisco CCNA Security Certification from the 640-554, and the upcoming 210-260 Certification.</strong></p><p>Anyone who is interested in pursuing the CCNA-Security Certification, and who is self-teaching; would gain a great deal of knowledge from this course. This course is meant as a \"Helping Hand\", to help the student understand, and comprehend certain concepts better.</p><p>After completing this course, you should have a solid understanding of all the topics that are covered in each video. You should also be able to configure a router for CCP, and also be able to configure an ASA, to be able to access the ASDM GUI.</p><p>You should also be able to configure a switch for security, according to the CCNA-Secuirty Standards. As well as being able to understand the concept of both the RSA process, and Firewalls.</p><p>Along with your course studies, and this  \"Helping Hand\" course, you should be able to prepare yourself for the CCNA-Security Certification in no time.</p><p>This Course would best be used along side the Cisco CCNA-Security Guide Book.</p><p>This Course material will also be revenant with the new Cisco CCNA-Secuirty 210-260. All updated lectures will be focused on the new material Cisco added to the CCNA-Security Certification.</p><p>This course is being introduced with 26 lectures, all within 15 minutes in length. Close to 4 hrs. of video teaching. The videos are recorded in 720 HD, and offer both audio and video presentations. All Power Point presentations used in the videos will be available to download as well, and each section has a multiple-question test, to help you solidify your understanding.</p><p>If you are seeking the CCNA-Security certification, or you are just wanting to learn more about CCNA-Security, this course will surely be a great wealth of knowledge for you.</p>", 
    "end_date": null, 
    "title": "CCNA-Security Training Course", 
    "price": "20.00", 
    "instructors": "Howard Frisbee", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670718_8f3d_2.jpg", 
    "course_url": "https://www.udemy.com/ccna-security-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T23:48:24Z"
}