{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t      This training focuses on providing the best knowledge to  students about various issues related to Cyber Security and Information Security by giving them live demonstrations of various forms of Cyber Attacks. You will learn Ethical Hacking(Penetration testing, White Hat Hacking, Web Portal hacking.  </p>  <p style=\"\">  \t  White Hat Hacking has several names like web hacking, ethical hacking, penetration testing, web/network auditing. This is a introduction course, we have total 3 level of white hat hacking course.  </p>  <p style=\"\">  \t  Ethical Hacking/Pentesting is a demand of present era where most of our important tasks include cyber world. Everyone should learn ethical hacking. It is a process in which you learn to find and fix loop holes in an application, software, network, webportal, mobile apps. Company can take steps to secure their product or Network.  </p>  <p style=\"\">  \t<em style=\"\">What will you get after completing the course?</em>  </p>  <ul style=\"\">  \t<li style=\"\">Knowledge on Ethical Hacking, Webportal testing, network testing.</li>  \t<li style=\"\">Huge Job opportunities with second highest pay in industry</li>  \t<li style=\"\">Full practical Videos</li>  \t<li style=\"\">You will get support from us on Udemy and on our facebook.</li>  </ul>", 
    "end_date": null, 
    "title": "Certified WhiteHat Hacker Level 1 ( CWHH Level 1)", 
    "price": 0, 
    "instructors": "Cyber Security & Privacy Foundation Pte Ltd", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246446_e9f8_4.jpg", 
    "course_url": "https://www.udemy.com/certified-whitehat-hacker-level-1/", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-19T10:46:50Z"
}