{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<ul><li>In this course we will learn to enter the world of professional hacking.</li><li>This Certified Ethical Hacking course will ensure that you are well versed with the skills needed and tools used to compromise the security of enterprise networks and information systems..</li><li>We will ensure that you learn the security of critical information assets, it is essential to become familiar with the strategies.</li></ul>\n\n<p>Ethical hacking is somewhat a complicated term to understand. Breaching network for the purpose of keeping them safe and finding Zero-day-vulnerabilities are the prime concerns of and Ethical Hacker. Anti-Hacking is more important that just attacking. This course will take you through the basics of computer networking and Linux along with the expertise in it. This course is not recommended for extreme beginners. People having basics in programming like C or Python will find it easier to understand.</p>\n\n<p>Most of the parts in the tutorials will be covered under either Linux or Debian. You won’t need a multiple computers as a victim and a target. The required basics and software requirements are stated in the tutorials which will help you create your own home lab for penetration testing. The chapters in the tutorials are somewhat related to the official CEH course from EC-Council, but here, you get absolute practical knowledge. Unlike the official CEH course, this course is intended to give you as much practical testing as possible.</p>\n\n<p>Most of the softwares used are totally open source and free. This provides an upper-hand in repository management for Linux distributions. The course will start with the basics of windows hacking and will end up with the extremes in networking vulnerabilities and linux programming. All the tutorials are for educational purpose only.</p>", 
    "end_date": null, 
    "title": "Certified Ethical Hacking with Android Hacking 2016", 
    "price": "20.00", 
    "instructors": "Naps Tecnologia Academy Inc", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830702_4454.jpg", 
    "course_url": "https://www.udemy.com/certified-ethical-hacking-with-android-hacking-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T16:30:55Z"
}