{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Last updated, June 11th, 2016</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Do you want to earn TOP $ in the networking field? </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">If yes, then stay ahead of the others. Master HOT skills early, and embrace the change in the network field influenced by Cloud and Software Defined Networks (SDN). </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ACI is Cisco's Data Center SDN solution, and the foreseeable future's replacement of nearly 50-60% of the current Data Center Infrastructure install base worldwide.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br><strong class=\"redactor-inline-converted\"></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">more than 1000 new students enrolled in less than a month</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">A reach to 104 countries, more than half the globe, and increasing by the day, </strong></p>\n\n\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Thank YOU! I truly appreciate everyone's keen interest, feedback, and support!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br><strong class=\"redactor-inline-converted\"></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course is your first step to master Cisco's SDN solution, and will enable you become among the elite crowd of network experts in this new and niche IT trend.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Keep up the good work, keep your sleeves rolled up for the next courses to complete the ACI mastery journey!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>ACT NOW! Enroll to the course and dive into the content. </strong></p>\n\n\n\n\n\n\n\n<p><strong>Start your own journey..</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Description </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Current IT trends such as big data and cloud are challenging the transport network infrastructure, and posing a big pressure on its ability to cope with the increasing traffic and automation demands. Current Data Center network infrastructures must cope with the required elasticity to scale up or down on-demand. Customers must be able to easily add/remove services or workloads in their data center infrastructure without having to go through extended lead times of design, deploy, test and commission phases of every single change to be made, this is not working anymore. The answer to these challenges is the introduction of Software Defined Networks (SDN), of which Application Centric Infrastructure (ACI) is the Cisco version. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Turning the blind eye to these changes as a network professional and how they could impact will not work, network professionals need to adapt and learn these skills asap or stay behind of the game. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Cloud and similar new trends are here to stay, forecasts of tens of billions dollars for cloud business over the next 3-5 years. It is becoming imperative to start mastering these skills. Cisco being the largest market share holder in LANs and DC network infrastructure, Cisco’s SDN solution, ACI, becomes a priority to learn. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This will not only take your skill level to the next step, but will also make you amongst the very limited and scarce pool of network professionals who master these solutions. This mastery would potentially result in job moves with much higher pay levels. Join this course now, and stay at the top with the networking professionals who are on very high demand, Act Now! \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn and Master the Most common and talked about SDN solution in the industry today!</strong> \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course will teach you:</strong> \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Application Centric Infrastructure (ACI) \n\n</li><li>ACI policy model \n\n</li><li>ACI logical constructs and building blocks \n\n</li><li>ACI networking (Layer 2, Layer 3) \n\n</li><li>ACI integration with virtual environments \n\n</li><li>Migration to ACI \n\n</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Mastering ACI starts with this course </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Overview </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Broken down, this course constitutes a comprehensive high-level technical introduction to Cisco ACI. Today, the Data Center (DC) network infrastructures are not coping with the demands of hot IT trends such as Cloud, Big Data where the network is required to be flexible and responds to required changes dynamically, with the least required manual intervention possible.  Software Defined Networks (SDNs), is the answer and solution to these challenges, and Application Centric Infrastructure (ACI) is Cisco’s SDN solution for the DC network challenges faced today. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Contents</strong> \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It starts with where we stand today, classical Data Center (DC) network infrastructures, and how things are being done today, where manual intervention required in almost every single task we do to change/enhance/upgrade networks. This course then explains Software Defined Networks (SDN), at a high level, as an answer to classical DC network infrastructure problems. Then ACI, which is Cisco’s SDN solution, is explained starting from the theoretical (policy) model, through how ACI fabric is built, its components, and then gets into the explanation of how logically the ACI fabric functions, how it is controlled by Application Policy Infrastructure Controller (APIC) , the function of each, and how they communicate to instantiate the intended state. ACI can’t function without connecting to the surrounding/existing network (LAN, WAN), hence, this course also explains the available connectivity options from ACI to existing networks, this will cover Layer 2 and Layer 3 connectivity options, and then once this is understood the course talks about adding other components/services to the Data Center, it explains how NG Firewalls, Load Balancer, SSL off-load functions are added to the ACI fabric to give it the required services common in data centers. Nexus 9000 Hardware is then explained briefly to give you an understanding of what hardware can be used for ACI solutions. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>One step further, the course introduces, at a high level, how to migrate the existing physical and virtual workloads from the existing DC network to ACI based DC network. Last but not least, the course gets into application health, and how ACI monitors that closely with a very deep visibility into application flows, delay, latency, security, QoS and other application related statistics in real time. Covering all this in an introduction course basically, gives you the ability to skim through ACI’s different aspects and understand carefully the benefits and simplification ACI provides and how it constitutes an answer to SDN requirements. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course then concludes by providing a road map of next learning steps for those who want to dig deeper into ACI solution, by understanding more of its functionality, exploring more features and migration details, and learn how to configure ACI from the GUI interface. This should make it easier for you to decide on your next learning steps to reach full mastery of ACI skills. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is perfect for any Data Center network focused IT professional who needs to explore new, SDN based, solutions to enhance or refresh existing classical DC networks. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"> </strong> \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What am I going to get from this course? </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Upon completion, you would have completed your first and most important step in your journey to ACI mastery. You will be able to engage in technical discussions comfortably, you will be able to articulate ACI benefits both from a business and technical perspectives, you would have gained a high level comprehensive understanding of ACI and will be able to present at a solution level how ACI fits and solves the challenging requirements of Big Data and Cloud infrastructures. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You will be part of a small group of professionals that acted and did not turn the blind eye to the major shift that is affecting networking profession today, SDN and automation. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What are the requirements? </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Fair understanding of DC network infrastructures \n\n</li><li>Fair understanding of switching and routing protocols      and technologies \n\n</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is the target audience? </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Network professionals who want to Master Cisco ACI. \n\n</li><li>IT and network managers who want to understand ACI      to  make  informed upgrade and refresh decisions to their      DC  network infrastructures as well as be able to articulate these      decisions to the CxO level management. \n\n</li><li>System engineers and Network architects who want to add      Cisco ACI solution understanding to the skills they have under their belt.      \n\n</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p> \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Guarantee</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course has a 30-day Money-back guarantee, but I am confident that you won't need to even consider it because of the tremendous value it offers and the right time to learn about SDN and ACI in particular. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Take Action!</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Being continuously among the small group that takes action and adopt the new skills is always a great and essential ingredient to career and hence financial success. Cloud, Big Data, SDN and the like are IT Trends that are here to stay at least for the next 3-5 years per analysts. Do not stay behind or turn the blind eye and be Just another network professional, Joint the elite group in networking!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If this resonates with what you are aspiring, financial and career success, then <strong class=\"redactor-inline-converted\">take this course now</strong> and join me in the ACI Mastery Journey!</p>", 
    "end_date": null, 
    "title": "Cisco Application Centric Infrastructure (ACI) introduction", 
    "price": 0, 
    "instructors": "Eissa A Sharif", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850098_66df.jpg", 
    "course_url": "https://www.udemy.com/cisco-aci-application-centric-infrastructure-mastery-series-step-1/", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-15T22:07:10Z"
}