{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>A Cloud Computing pode transformar uma empresa. Ela fornece mais eficiência, além de várias opções para aprimorar os processos, aplicativos e serviços da empresa com pouco gerenciamento. E tudo isso só é possível dentro de estruturas devidamente construídas e preparadas para prover este tipo de serviço.</p>\n\n<p>Alinhadas as evoluções do mercado, as certificações Cisco sempre foram, e continuam sendo, algumas das credenciais mais reconhecidas e respeitadas na indústria de tecnologia, dentre elas as tecnologias que suportas os ambientes de Data Center e Cloud Computing.<br></p>\n\n<p>Voltada para arquitetos de tecnologia, bem como para os engenheiros de design e implementação, além de especialistas em soluções integradas, o  <strong>CCNA Data Center</strong> é um curso que desenvolve nos alunos capacidades de implementar  ambientes de Data Center utilizando diversas das mais modernas tecnologias Cisco, como por exemplo: UCS (Unified Computing System) blade servers e servidores de rack, além de instalar, configurar e gerenciar switches Nexus e demais tecnologias de Data Center.<br></p>\n\n<p>O curso cobre todos os itens das provas </p>\n\n\n\n<ul><li><strong>640-911</strong> <em>Introducing Cisco Data Center Networking (DCICN)</em><em> </em></li><li><strong>640-916</strong> <em>Introducing Cisco Data Center Technologies (DCICT)</em><em></em></li></ul>\n\n\n\n<p>necessários para a obtenção do título <strong>CCNA Data Center</strong>.</p>", 
    "end_date": null, 
    "title": "Cisco CCNA Data Center Completo (DCICN + DCICT)", 
    "price": "30.00", 
    "instructors": "Prof. Breno Andrade", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/767614_3a3c_8.jpg", 
    "course_url": "https://www.udemy.com/cisco-ccna-data-center-completo-dcicn-dcict/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-19T12:57:37Z"
}