{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Are you curious about how the most successful sales people generate <strong class=\"redactor-inline-converted\">Cloud Computing Sales</strong>? The course is designed for people who want to transform their lives by effectively selling high-value Cloud Computing solutions to enterprise clients. You will learn detailed ways to generate leads, qualify clients, and prepare proposals, while also better understanding the technologies. <br><br><strong class=\"redactor-inline-converted\">Generate More Transactions by Solving Business Problems</strong><br>• You will be able to have intelligent and informed conversations with engineers and executives as you solve their business problems with cloud-based technology solutions<br>• There are 15 quizzes, one after each lecture to remind you of the most important takeaways<br>• The average lecture is 10 minutes and the course takes 2.5 hours</p>\n\n<p><strong class=\"redactor-inline-converted\">Cloud Computing is a Fast-growing Market<br></strong>• Market is projected to more than quadruple in the next decade<br>• There is a increasing need for sales people, marketers, solutions architects, business analysts, and engineers who can use the right terminology<br>• You will learn about Application Programming Interfaces (APIs), Microservice Architecture (MSA), Information Governance, Big Data analytics and much more.  </p>\n\n<p><strong>Course Structure Makes It Easier to Apply What You Learn</strong> <br>There are nearly 200 companies discussed along with real-world case studies. Diagrams are presented in several steps, explained in language anyone can understand. Budgets, CIO technology roadmaps, and implementation processes are described to help you sell profitable solutions. At the end of the course, you will be able to generate case studies that show the value you and your team were able to generate.</p><p>If you want to generate transactions by solving business problems with cloud technology solutions, this course will provide unique insights on how to do that. You don't need a computer science degree to take the course, but you have to be driven to sell.</p>", 
    "end_date": null, 
    "title": "Cloud Computing Sales", 
    "price": "50.00", 
    "instructors": "Stephen Turner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/775472_6a79_6.jpg", 
    "course_url": "https://www.udemy.com/cloud-computing-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-26T20:41:14Z"
}