{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<ul style=\"\">  </ul>  <p>  \t  If your computer isn&#039;t running very well and you can&#039;t afford to get it repaired, this is definitely the computer repair course for you. I have worked in computer repair for 15+ years and this course is a small portion of the many techniques I can show you.  </p>  <p>  \t  Let&#039;s face it, your computer is going to fail, it&#039;s just a matter of time. Wouldn&#039;t you like that time to be as long as possible? Take care of your computer and it will take care of you.  </p>  <ul style=\"\">  \t<li>Learn to back up your entire computer very easily. (You will thank me for this when your  computer fails someday)</li>  \t<li>Learn why anti-virus software is so important and which one I recommend.</li>  \t<li>Figure out how to upgrade your computer, <strong style=\"\"><em style=\"\">without paying someone to tell you.</em></strong></li>  \t<li>Follow along, step-by-step, as I explain and show you how to Speed Up Your Computer. <strong style=\"\"><em style=\"\">It&#039;s easier than you think.</em></strong></li>  \t<li>Let me show you how to prevent problems from happening, so you can enjoy your computer.</li>  \t<li>Receive a verifiable certificate of completion to present to employers after completion of this course.</li>  \t<li>Fix your computer BEFORE anything goes wrong, you won&#039;t regret it. </li>  </ul>  <p>  \t  Don&#039;t waste your money having the Geek Squad or someone else do what you can do yourself. Believe me, it really is easier than you think. Just read the reviews and you will see what people are saying about this course.  </p>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "Computer Repair - A Guide For Beginners", 
    "price": "20.00", 
    "instructors": "Justin Gilson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32332_d5ef_13.jpg", 
    "course_url": "https://www.udemy.com/speed-up-your-computer/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-11T19:15:22Z"
}