{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This is a complete course for you to take at your own pace, which starts at the <strong>very beginning of computer science</strong> and takes you <strong>all the way to algorithms and data structures</strong>, two pillars of computer science and programming.</p><p>Many online courses teach <strong>solely</strong> by programming and building apps. This is a great way to get some quick experience, but it doesn't teach you the very <strong>fundamentals of computer science</strong>, which you need to <strong>get yourself to the next level</strong> and which <strong>internet companies worldwide are desperate for you to understand</strong>.</p><p>Today I will start the journey of taking you from <strong>no programming experience</strong> to become someone who <strong>truly understands the field and the more complex aspects of it</strong>.</p><p>In this course not only do we learn by building <strong>6 Java applications</strong>, we learn how to build these by using these more advanced and vital concepts:</p><ul><li>Collections (Arrays and ArrayLists)</li><li>Linked Lists</li><li>Queues</li><li>Stacks</li><li>Sets</li><li>Recursion</li><li>Binary Trees</li></ul><p>This course is great if you are 100% new to computer science, but also if you already have some experience and would like to learn these concepts.</p><p>We will start with things like what programming is, how computers work, and what binary numbers are, and then we will move onto programming in Java, covering data types, if-statements, and loops. After that, we will learn more advanced Java concepts, like boolean comparisons, file I/O, algorithms, and data structures.</p>  <p>  \t                   If you complete over 80% of the course material, <strong>you will get a certificate of completion</strong> that will tell potential employers that have completed this course, and thus helping even further!  </p>  <p>  \t                       However, if you ever feel that the course just isn't for you, or maybe you expected some completely different, I offer you a <strong>30-day money-back guarantee</strong>, regardless of the reason why you might choose to take it.  </p>  <p>  \t<strong>Look at what some people are saying!</strong>  </p>  <blockquote>  \t                 He is very down to earth, concise, and knowledgeable on the lectures he presents. I am looking forward to more advance courses from Jose -- keep up the wonderful work! - \"Jay-Ar Jamon\"  </blockquote>  <blockquote>  \t                 Was nice and easy to follow for a beginner like me. I'll definitely be revisiting the course again to refresh my memory since it covered so many topics... - \"Clara Chen\"  </blockquote>  <p>  \t                       Join me in a journey of learning. Lets enjoy the course!  </p>", 
    "end_date": null, 
    "title": "Computer Science for Beginners learn by building 6 Java apps", 
    "price": "25.00", 
    "instructors": "Jose Salvatierra", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53611_f1b7_11.jpg", 
    "course_url": "https://www.udemy.com/computer-science-for-everyone/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-12T19:19:14Z"
}