{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t       Do you want to learn real-world hacking techniques but don’t know where to start? This is your chance. This course covers security loopholes and techniques to broaden your knowledge of security systems. Anyone who’s interested in hacking or security systems can benefit from this welcoming hacking community and in-depth course.  </p>  <p>  \t<strong style=\"\"> Learn To Implement Security Hacking Techniques from The Pros </strong>  </p>  <ul style=\"\">  \t<li>Intercept Information in a Network with SSL Encryption</li>  \t<li>Find the Vulnerable Spots of a Website or an Application</li>  \t<li>Secure Your Passwords </li>  \t<li>Recognize a Remote Operating System Using Fingerprinting Methods</li>  </ul>  <p>  \t<strong style=\"\"> IT Security Experts Teach You How to be an Ethical Hacker </strong><br style=\"\">  \t       Certified hackers are given free reign when it comes to identifying and getting rid of security threats. They are encouraged by clients to use all known malicious hacking techniques, so that the computer or computer network in question can be best protected against criminal hacking attempts.  </p>  <p>  \t<strong style=\"\"> Content and Overview </strong><br style=\"\">  \t<br style=\"\">  \t       In 11 hours of content, this course will cover the ins-and-outs of hacking. To get the most out of this course, you should be familiar with programming and scripting language.  </p>  <p>  \t       Most videos are accompanied by documents, so you’ll walk away with a hacking textbook to accompany your studies. You’ll learn how to protect your network and system against major hacker threats:  </p>  <ul style=\"\">  \t<li>Recover lost passwords and intercept information.</li>  \t<li>Obstruct encrypted data and attack SSL sessions as well as how to hide files using kernel modules. </li>  \t<li>How to handle overflow attacks and recognize remote attacks.</li>  \t<li>Identify application attacks, like string attacks and overwriting.</li>  \t<li>Build network security and exploiting the ICMP protocol. </li>  \t<li>Identify the operating system, netfilter and security systems.</li>  \t<li>Secure your own system with scanners, detection and patches. </li>  \t<li>Prepare for attacks on operating systems: Entering via back door stealth attacks, kernel-level errors, and shellcodes.</li>  </ul>  <p>  \t       After taking this course, you will have the required information, training materials and professional practice environment to implement proven hacking techniques. You’ll possess the tools necessary to test the security and vulnerability of your own computer or computer system, and you will have the required information, training materials, community, and professional practice environment to implement proven hacking techniques.  </p>  <p>  \t           If you are a beginner, don&#039;t worry. You will understand all the techniques during your training.  </p>  <p>  \t           Ready to join us?  </p>  <p>  \t           We heartily invite you to join our community. You are welcome here. We will teach you the proven hacking techniques and we will provide you with all the required information, training materials and professional practice environment.  </p>  <p>  \t           We guarantee your 100% satisfaction or you will get your money back. You have 30 days to decide if the Hacking School training is for you. You will get access to the whole system. If for any reason you&#039;re not satisfied with your training, we will give you full refund. No questions asked. Does it seem fair to you?  </p>  <p>  \t           We wish you the best,<br style=\"\">  \t<em style=\"\">The Hacking School Team</em>  </p>", 
    "end_date": null, 
    "title": "Computer and Network Hacking Mastery: Practical Techniques", 
    "price": "20.00", 
    "instructors": "Hacking School, IT Security Academy", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20570_4c92_5.jpg", 
    "course_url": "https://www.udemy.com/hacking-school-training-learn-hacking/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-03T11:18:08Z"
}