{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Just launched! 10 Euro Promo Price!</strong><br></p><p>Today we live in a world where network and cyber security are two of the most important subjects. Everyone is talking about them, about how to protect the network and how to protect end-users against malicious attackers.</p>\n\n<p>Network security is one of the big trends with unparalleled growth, because the number and severity of attacks in increasing everyday. Businesses all around the globe are finding out the hard way that if you are not paying attention to how you secure your IT infrastructure, you stand to lose not only huge amounts of money, but also you can lose your reputation.<br></p>\n\n<p>This course covers one of the best tools you can deploy in your fight against IT threats, namely the Fortigate UTM and how you can use this tool to take control of your network while assuring that you are protected.</p>\n\n<p>You will learn how the Fortigate UTM works, how to configure it and adapt it to your business, how to protect your users with it along with your network and how to prevent incidents from the inside of your network. You also have powerful reporting available within the device.</p>\n\n<p> By the end of this course you will be able to transform your network security with a very powerful device and have the solid skills that you can use in the future to expand your knowledge.</p>", 
    "end_date": null, 
    "title": "Configuring Fortigate Unified Threat Management Appliances", 
    "price": "20.00", 
    "instructors": "Mr. Daniel Botescu", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402230_9fa0_2.jpg", 
    "course_url": "https://www.udemy.com/configuring-fortigate-unified-threat-management-appliances/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T15:03:37Z"
}