{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Updated for October 2015.</strong></p><p>Please read the ONE STAR review below - it is 100% valid. This course does not teach specific tools or hack techniques. As you will see in the <strong>MANY FIVE STAR </strong>reviews we teach critical concepts, frameworks, models, and actionable items that will empower you to weave cyber security into the daily practices of a dynamic, lean fast growing business.</p><p><strong>The course is a high impact video series that will empower you to get started immediately</strong>. </p><p>Every teaching and every recommendation in the cyber security framework that is taught leverages a few core principles:</p><ul><li>Business First</li><li>90/10 Output (90% Results with 10% Effort)</li><li>Resilience over Security</li><li>Protection - Detection - Response Triad</li><li>Work Hard Once (Ensuring no wasted Effort)</li></ul><div><span style=\"\"><br></span></div>You will learn how to:<ul><li><strong>Create meaningful security metrics</strong> for multiple audiences</li><li><span></span><strong>Increase leadership engagement </strong>in cyber security by using the right language and frameworks</li><li><span></span><strong>Discover your Resilience Score</strong> for every business process</li><li><span></span><strong>Understand what your intellectual property is</strong> and where it is</li><li><span></span>Understand and <strong>manage who has access to your intellectual property</strong></li><li><span></span>How to leverage <strong>metrics for transparency and security engagement</strong></li><li><span></span><strong>How to move cyber security conversation</strong> from the data center, to the boardroom and the water cooler</li></ul>The concepts are crisp and the supplemental handouts ensure you will have tangible, actionable that you can immediately leverage.", 
    "end_date": null, 
    "title": "Cyber Security: Build a Secure, Resilient Company", 
    "price": "20.00", 
    "instructors": "Conor Sherman, Antony Sherman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566670_cff1_5.jpg", 
    "course_url": "https://www.udemy.com/confidentdefensefoundation/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T00:37:58Z"
}