{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>\n\tDoes it seem like your computer is constantly getting bombarded with ads, popups, or scammy emails?\n</p>\n\n<p>\n\tMaybe you suddenly can't use your PC because of some random screen that\n claims you have a bad infection and just pay them some money and they \ncan have it removed.\n</p>\n\n<p>\n\tEven worse, you start noticing odd charges on your credit card bill \nthat you know wasn't made by you (unless you did actually buy that 25th \nanniversary edition pet rock - no judgement).\n</p>\n\n<p>\n\t<strong>It doesn't have to be this way!</strong>\n</p>\n\n<p>\n\tMost times, many of the bad things mentioned above happen to you \nbecause of actions you take on accident. You think that by clicking on a\n button that tells you to \"Click here to scan your PC\" or receiving a \nphone call from Microsoft warning you that you have a virus, that you \nare doing the right thing.\n</p>\n\n<p>\n\tBut, it's these exact things that are opening up your systems to the bad guys!\n</p>\n\n<p>\n\t<strong>Cyber Security: Beginner's Training Guide to Online Safety</strong> is a course that comes from over \n23 years of working with computers and seeing how making some simple \nchanges can protect you and your PC from potential threats. Whether a \nsingle user, family,  or business with hundreds of employees, these \nlectures and videos will walk you through step-by-step what to do and \nnot to do.\n</p>\n\n<p>\n\tLet's \n\t<strong>build a community</strong> of users that can learn from each other!\n</p>\n\n<p>Cyber Security: Beginner's Training Guide to Online Safety will be updated over time with advice and examples\n from you, our users, so that we can all benefit from shared experiences\n and grow in the process. Remember, there's no shame or judgement if you\n accidentally ran across something that tricked you into getting \ninfected or worse. Share your story and we can all benefit from your \nknowledge.\n</p>\n\n<p>\n\tCompuTerrors wants your \n\t<strong>feedback!</strong>\n</p>\n\n<p>\tPlease tell us how we're doing and what you want to see in each training. We greatly value you as our students and believe in continually improving our courses.</p>", 
    "end_date": null, 
    "title": "Cyber Security: Beginner's Training Guide to Online Safety!", 
    "price": "25.00", 
    "instructors": "Jeff Przybylski", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649780_7dfd_2.jpg", 
    "course_url": "https://www.udemy.com/cyber-security-and-internet-safety/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T18:23:14Z"
}