{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">    Todos los días leemos en las noticias sobre un nuevo ataque informático</strong> en contra de instituciones, compañías y usuarios. Miles de millones de dólares son robados usando técnicas de hacking sencillas, explotando la falta de conocimientos de la persona común y corriente.  </p>  <p style=\"\">  \t      Según el reporte de seguridad para el 2014 de la reconocida empresa Symantec hubo un aumento del 91% en ataques coordinados, 552 Millones de identidades fueron expuestas, 38% de los usuarios de celulares han sido hackeados y uno de cada 392 correos es un intento de hackeo tipo “phishing”.  </p>  <p style=\"\">  \t<strong style=\"\">    Lo más importante para protegerse contra estos ataques cibernéticos no es a través de software o pagando servicios costosos -- es a través del conocimiento.  </strong>  </p>  <p style=\"\">  \t      Este curso te introduce, desde el nivel más básico y a través del poder del video, los conocimientos y las herramientas necesarias para que tu y tu familia puedan usar el internet sin tener que preocuparse sobre la pérdida de datos, robo de identidad ú otras operaciones que pueden poner en riesgo tus finanzas y tu bienestar social.  </p>  <p style=\"\">  \t      El instructor, Jorge Escobar, es un arquitecto de plataformas web con más de 15 años de experiencia liderando equipos de desarrollo. Uno de los proyectos que lo especializó en el tema de seguridad cibérnetica fue la implementación de la conformidad con regulación PCI (Payment Card Industry) de una aplicación de pagos recurrentes que requería de procesamiento y almacenamiento de cientos de miles de registros de clientes con información completa de tarjeta de crédito, dirección y datos personales.  </p>  <p style=\"\">  \t<strong style=\"\">    Si buscas en internet, puedes encontrar cientos de cursos, videos y otros recursos, pero es un trabajo increíblemente tedioso y deja más dudas que respuestas.</strong> En este curso podrás aprender, de manera sencilla y sin necesidad de tener conocimientos técnicos avanzados, las técnicas de seguridad cibernética, desde lo más básico hasta lo más avanzado junto con una comunidad de personas que están aprendiendo el mismo concepto. Adicionalmente los instructores responden las preguntas que tengas en cada lección si tienes preguntas adicionales o necesitas expandir en un tema específico.  </p>  <p style=\"\">  \t      El curso está dividido en 6 secciones:  </p>  <ul style=\"\">  \t<li style=\"\">Introducción</li>  \t<li style=\"\">Cómo funciona el internet</li>  \t<li style=\"\">Métodos de los hackers</li>  \t<li style=\"\">Las 6 reglas para mantenerse seguro</li>  \t<li style=\"\">Seguridad familiar</li>  \t<li style=\"\">Herramientas</li>  \t<li style=\"\">Recursos</li>  </ul>  <p style=\"\">  \t      El curso cuenta con más de una hora de video y material de soporte en casi todas las lecciones. También hay ejercicios y exámenes que complementan tu conocimiento de los temas aprendidos.  </p>  <p style=\"\">  \t      Puede completarse en un día, pero es más óptimo tomar cada lección y luego practicar los conocimientos, así que una semana es el tiempo óptimo para completarlo (una sección por día). Sin embargo el material es tan completo, que estamos seguros que volverás una y otra vez a revisar los temas fundamentales.  </p>  <p style=\"\">  \t      Adicionalmente, estamos actualizando el curso constantemente, añadiendo lecciones gracias al feedback de nuestros estudiantes.  </p>  <p style=\"\">  \t      También tendremos Google Hangouts donde podrás preguntar al instructor cualquier pregunta que tengas sobre el curso o sobre temas de protección de internet en general.  </p>", 
    "end_date": null, 
    "title": "Cómo estar seguro en Internet - Sin ser un tecnólogo", 
    "price": "20.00", 
    "instructors": "Jorge Escobar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348436_a602_2.jpg", 
    "course_url": "https://www.udemy.com/como-estar-seguro-en-internet/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T21:17:31Z"
}