{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><span>The </span><strong style=\"\">Digital Security Awareness&nbsp;</strong><span>course is designed to go beyond compliance and address the most common risks and&nbsp;security&nbsp;threats in order&nbsp;to protect sensitive information. Learn the knowledge and tools needed to maintain your network and prevent security breaches. This training can be applied not only to work, but your home computer network as well.&nbsp;</span><br style=\"\">  </p>    <p><strong style=\"\">Total Video Time: 6h 16m</strong></p>    <p><strong style=\"\">Review Quizzes included for each Section, test your knowledge!</strong></p>    <p><strong style=\"\">Workbooks included for each Section, print out the course slides and take notes as you go!&nbsp;</strong></p>    <p>Some Topics Include:&nbsp;</p>    <p>Deciphering Security Threats</p>    <p>Social Engineering - Who is watching you?</p>    <p>Identity Theft Protection</p>    <p>Classifying Your Data</p>    <p>Protecting Your Digital Information</p>    <p>Malware - Malicious Software Attackers Use and How to Protect Against It!</p>    <p>Security from All Angles</p>    <p>What is Online Piracy?</p>    <p>Policies Needed to Protect Yourself and Others</p>    <p><strong style=\"\">Instructor: Ken Mayer</strong></p>    <p>Ken has spent the last 30 years in the world of IT, with a major focus over the last 15 years with security related topics.&nbsp; He does both training and consulting for many of the world’s largest Telecoms, Fortune 500 companies, as well as smaller enterprises around the world.&nbsp; He’s certified by Cisco, Juniper, Palo Alto, Microsoft, Ethical Hacking, VMTraining (focused on security), and many other organizations.&nbsp; He has trained and consulted in the security field for each of these vendors, in their security design, security products (such as Firewalls, Intrusion Prevention, Next-Generation Firewalls and secure designs.&nbsp; Security has become a relevant and important topic over the last decade, and he’s stayed on the forefront of security related products, auditing, and design.&nbsp; Ken’s range of topics also goes out to the design of scalable routing and switching infrastructures from the small company to some of the world’s largest Service Providers.&nbsp;<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Digital Security Awareness", 
    "price": "50.00", 
    "instructors": "Career Academy", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/66594_8253_6.jpg", 
    "course_url": "https://www.udemy.com/digital-security-awareness/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-18T18:09:44Z"
}