{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t        Even with a membership script, your downloadable files are most likely not secured. In the specific video series, I&#039;m going to show you step-by-step, as you watch over my shoulder, how you can secure your digital downloads!  </p>  <p>  \t        According to the Huffington Post, &#039;A Study Found That Hackers Cost U.S. Economy Up To 500,000 Jobs Each Year.&#039; According to Fox Business, &#039;Report shows Cyber Crime Costs Global Economy Up to $500B a Year.&#039; It&#039;s a fact that many online businesses are hosting their digital goods in an unsecured members’ area.  </p>  <p>  \t        That means even the downloadable links within your secured members’ area could be currently shared with hundreds, or even thousands, of people each and every month.  </p>  <p>  \t        And as this is going on, you are paying for the extra bandwidth for each and every one of those pirated downloads. So, you could be losing money rapidly, depending on where you host your files.  </p>  <p>  \t        So, the question remains is how do you monitor or know if people are pirating your digital goods? Because the fact of the matter is, most people are not aware of what is happening out on the Internet.  </p>  <p>  \t        Then of course, the next step is how do you secure your hard work and digital goods from prying eyes - so that this does not happen to you?  </p>  <p>  \tAt the end of the course you be able to: <br>  \t<br>  \t- Understand how the piracy happens<br>  \t- How can use the best pratices to protect your Videos and Files;<br>  \t- How to protect your Wordpress website;<br>  </p>", 
    "end_date": null, 
    "title": "Digital Downloads Lockdown ", 
    "price": "20.00", 
    "instructors": "Marcos Ferreira", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/347778_8920_2.jpg", 
    "course_url": "https://www.udemy.com/digital-downloads-lockdown/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T17:01:27Z"
}