{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Why Wireshark?</strong></p><p>Wireshark is the world's foremost network protocol analyzer. It lets you see what's happening on your network at a microscopic level. It is the de facto (and often de jure) standard across many industries and educational institutions.<br></p><p><strong class=\"redactor-inline-converted\">Perform analysis more efficient</strong><br></p>\n\n<p>Wireshark has many features that simplify your analysis. Do you know what you can achieve by using different profiles in Wireshark? You will be able to adjust the tool for different situations.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Discover hidden features in Wireshark</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>Many valuable features are quite hidden. You will see how you add comments for documentation purposes or how you limit the file size of your trace without loosing relevant data.</p>\n\n\n\n\n\n\n\n\n\n<p>The course will not cover installation and first steps with Wireshark and it also does not contain details about protocol analysis. It is suited for anybody with basic knowledge of Wireshark and even experts may discover a few tricks.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Wireshark is the most important tool and the part of the weapon list of every infosec professional. Wireshark plays an important role during the penetration testing process and even hackers use it to sniff the confidential data. But, <strong class=\"redactor-inline-converted\">have you ever tried using the advance features of Wireshark?</strong> Do you really know what Wireshark is able to do? <strong class=\"redactor-inline-converted\">Or do you know what you can achieve using Wireshark?</strong> And, how you can effectively use Wireshark to achieve your pentesting objectives?<br><strong class=\"redactor-inline-converted\">Don’t you know the answers?</strong> Well, this is why we have launched this course, it unearths the advanced features of Wireshark, it is a short crash course that focuses on how you can get the maximum value of using Wireshark during the penetration testing. This course does not teaches the installation process, but it teaches the features that are important and that you should consider.</p>\n\n\n\n\n\n\n\n<p>This course also helps to achieve the Wireshark certifications, for example,<strong class=\"redactor-inline-converted\"> WCNA (Wireshark certified Network Analyst). </strong><br></p>", 
    "end_date": null, 
    "title": "Discover the the \"hidden\" features in Wireshark", 
    "price": "20.00", 
    "instructors": "Regula Gönner", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/817036_7eb2_9.jpg", 
    "course_url": "https://www.udemy.com/wireshark-the-hidden-features/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-09T07:57:42Z"
}