{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Course last updated <strong>2016-0</strong><strong>3-15</strong>, see update log below!<br></p>\n\n<p><strong>Now more than 1100 enrolled users and average rating of 4.7 (out of 5)! </strong><br></p>\n\n<p>In this course You will learn anything about DNS - Domain Name System. Topic include:</p>\n\n<ul><li>The different components of DNS and how they cooperate.</li><li>How the domain hierarchy is structured in different levels.</li><li>What different types of information is stored in DNS.</li><li>How a DNS query and response works.</li><li>How the information is stored in zone files.</li><li>Recursive queries, the role of a local resolver.</li><li>How to use the tool dig for testing and troubleshooting DNS in various ways..</li><li>We will start with the basics and build ourself up to advanced sections. Starting with the domain hierarchy, how the protocol works and continue into dig, zone transfers and best practices for DNS setup with bind.</li></ul>\n\n<p><br></p>\n\n<p>Remember! 30 days <strong>money-back guarantee</strong> with no questions asked. I want you to be satisfied with my course. No Happy - No Pay!</p>\n\n<p><br>Also, please take advantage of the <strong>free previews</strong> to see way you will get.</p>\n\n<p><br></p>\n\n<p>After finishing this course you will feel confident and have full knowledge of all aspects of DNS! You will feel confident in how to setup, manage and troubleshoot DNS.</p>\n\n<p><br></p>\n\n<p>Updates: </p>\n\n<ul><li>2016-01-19 Added text lecture about DNSSec and IPv6</li><li>2016-01-19 Added a lecture that shows a bind installation in action</li><li>2016-01-24 Added lecture about zone delegations in bind</li><li>2016-02-01 Added lecture about DNS spoofing</li><li>2016-02-03 Added bonus lecture at the end of the course.</li><li>2016-03-15 Added text lecture about top level domains.</li></ul>", 
    "end_date": null, 
    "title": "DNS basics - Understand, setup and manage your own domains.", 
    "price": "25.00", 
    "instructors": "Jimmy Larsson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/714454_6500_7.jpg", 
    "course_url": "https://www.udemy.com/learn-dns/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-03T15:06:02Z"
}