{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Last updated on 27-02-2016</p><p><strong>\"<em>Course is great, in the guessing section, you almost knew my password, immediately changed it to 23 letters, I am very careful now with it, thanks!</em>\"</strong> <em>- Ziad Ahmed Amer</em></p><p><em><strong>\"I have taken this course twice because there is so much valuable information. I was not aware that hacking software is available by Googling it. I found this to be very disturbing, however, I am grateful that this course is available to educate us on the software that is available to anyone. My gratefulness is extended due to the counter measures that are provided. Numerous scams are exposed for unsuspecting victims of phishing and hacking. Take advantage of this course so that you can be better prepared and secure. The content is informative, and the quality of the production met my expectations.\"</strong></em><em> - Matt Hayes</em><br></p><p><em><strong>\"This course is packed with great information. Very clear and easy to understand, and all directly to the point, no filler or fluff! Job well Done!\"</strong></em><em> - Don Nir </em><br></p><p>Ethical Password hacking and protecting is an video tutorial which helps you to learn different password hacks and protecting methods. Videos in this course demonstrate hacking and protecting WiFi and many other password protected accounts using keylogger, guessing, brute force, phishing, social engineering methods and counter measure for each of them.</p><p>It's a beneficial course to learn different password hacking methods and to protect your password protected accounts from hackers. All methods are pretty well explained and demonstrated step by step in all videos. It's crash course in ethical hacking. It's a very delightful course to hacking enthusiast's.</p><p>How to use:</p><p>Watch all videos in full screen and land slide view. Internet connection more than 30kbps is necessary to stream all videos properly. If any technical difficulty appears report to instructor through message option. Any doubts, clarification or suggestion on improvement of course message instructor or post in discussion before giving any bad review.</p><p>Disclaimer :</p><p>This course is meant for education purpose only, we aren't responsible of implementation of any hack learnt in it, this course is made with vision to create awareness on hacks. As most of the people are suffering from lack of awareness.</p>", 
    "end_date": null, 
    "title": "Ethical password hacking and protecting", 
    "price": "20.00", 
    "instructors": "Amit Huddar", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/621516_1307_3.jpg", 
    "course_url": "https://www.udemy.com/password-hacking/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T17:28:24Z"
}