{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">This course gives network professionals a functional understanding of BIG-IP Local Traffic Manager (LTM) v11, introducing students to both commonly used and advanced LTM features. Incorporating lecture and hands-on labs. This course helps students build the well-rounded skill set needed to manage BIG-IP LTM systems as part of a flexible and high performance application delivery network.</p><p style=\"\">What am I going to get from this course?</p><p style=\"\">This course consist of 16 information packed lectures, 14 Labs and over 4 hours of content! You will have the option to download a custom built server and XP client VMware image, so that you can follow along in the labs. The server contains several pre-configured apache servers designed to re-enfored the f5 LTM concepts.</p><p style=\"\">Topics covered in this course include:</p><p style=\"\">-Set up the BIG-IP LTM System</p><p style=\"\">-Load Balancing, including priority group activation and connection limits</p><p style=\"\">-Persistence concepts, including universal persistence and match across services</p><p style=\"\">-Monitors, including scripted monitors and managing multiple monitors</p><p style=\"\">-Profiles, including compression, caching, and F5 acceleration technologies</p><p style=\"\">-Implementing SNATs</p><p style=\"\">-Highly Availability, including Sync-Failover and Sync-Only device groups, traffic groups, and N+1 concepts</p><p style=\"\">-Configuring iRules</p><p style=\"\">-Deploying iApps</p>", 
    "end_date": null, 
    "title": "F5 Configuring an LTM", 
    "price": "50.00", 
    "instructors": "Jason Jenkins", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462436_9e8f_4.jpg", 
    "course_url": "https://www.udemy.com/f5-configuring-an-ltm/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T22:10:05Z"
}