{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Bienvenido a <strong></strong><strong>Fundamentos de IT Networking: CompTIA Network+2015 (ES) </strong>de LearnSmart.</p>La Certificación de Network+ por CompTIA es una certificación internacional y neutral con respecto a los contratistas que fue avalada y reconocida por fabricantes y organizaciones de la industria informática. Los cursos siguientes proporcionan conocimientos básicos de los principios, técnicas y herramientas necesarias para preparar con éxito para el examen N10-006. También califican como<em> Unidades de Educación Continua (CEU)</em>. Si usted está renovando su certificación, esta serie y los cursos adicionales le van a permitir lograr sus CEU. Con este curso usted será capaz de reclamar 24,5 CEU. Le recomendamos que vea el resumen completo de esos cursos en Opciones de Educación Continua de CompTIA Network+.Los temas que se tratarán son:  TCP/IP, Network de infraestructura, la solución de problemas Networks, LAN Infraestructuras, Conceptos avanzados de redes y mucho más. Estos cursos se combinan con una gran variedad de demostraciones y pruebas que dan un mundo real vistazo a algunos de los conceptos que serán discutidos.<p>Las secciones que figuran a continuación se pueden tomar en cualquier orden, como una revisión de un concepto o un examen de dominio particular. Sin embargo, si usted está convirtiendo en familiarizados con los sistemas operativos de PC y redes de base, se recomienda que vea los cursos secuencialmente</p><p><strong>Resumen del curso</strong>:</p>Network+ Certificado CompTIA + técnico que necesita para estar al tanto de los diversos tipos de cables y conectores, sus características, capacidades y limitaciones. Usted también necesita entender varios conectores que están involucrados. Este curso está diseñado para preparar al estudiante para la Certificación Network+ . Los estudiantes tomarán un vistazo a las normas de la red y las organizaciones que los crean, así como la importancia de la normalización. Hemos emparejado este curso con demostraciones que ayudará a dar un ejemplo visual de los conceptos que se hablaban.<p></p>", 
    "end_date": null, 
    "title": "Fundamentos de IT Networking: CompTIA Network+2015 (ES) ", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567342_2581.jpg", 
    "course_url": "https://www.udemy.com/fundamentos-de-it-networking-comptia-network2015-es/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T14:13:40Z"
}