{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<h4>The Official GNS3 Fundamentals Course: Created with the GNS3 Developers!</h4>\n\n<p>If you have not used GNS3 before, then this course is for you! Learn how to download, install and configure GNS3 on a Windows PC. This course is a dynamic course and will be constantly update with new features and information.</p>\n\n\n\n<p>Expect <u>monthly content updates</u> with each release of the software to make sure you have the latest and greatest information including comprehensive labs and training materials. David worked directly with the GNS3 development team to make sure that this course captured all the ins-and-outs of the software. We have worked hard to jam pack as much information in the course including the NEW GNS3 VM for VirtualBox, VMware Workstation and ESXi. Best of all you can download the video and labs in the course and take them on the road when you are studying for that next network certification of spinning up a POC with GNS3.</p>\n\n\n\n<p>Learn the basics (and some advanced topics) of GNS3 including:\n</p>\n\n\n\n<p>&gt; Understand why you would use GNS3 and the differences between emulating and simulating network devices\n</p>\n\n\n\n<p>&gt; Getting started with the software from soup to nuts including: IOS selection, hardware requirement, switching support, install of the new GNS3 VM with VMware &amp; ESXi, getting familiar with the GUI and icons and more!</p>\n\n\n\n<p>&gt; Get Access to some amazing FREE tools that complement and work well with GNS3 including Solarwinds Response Time Viewer which helps to quickly analyze Wireshark packet capture files to troubleshoot performance issues.</p>\n\n\n\n<p>&gt; Interactive LABS that we will be updating each month to make sure you have hands-on practical applications to test and build on including the new CumulusVX (Linux Networking Operating System)</p>", 
    "end_date": null, 
    "title": "GNS3 Fundamentals (Official Course) Part 1", 
    "price": "30.00", 
    "instructors": "David Bombal", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/826750_853d_3.jpg", 
    "course_url": "https://www.udemy.com/gns3-fundamentals-official-course-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-20T03:09:55Z"
}