{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>The Course has been updated on January 2016</strong></p><p>with technology advancement today. Are you staying on anonymous? Whether you have a secret or does not, I am sure you wouldn't want your movement or action to be known to some outsider</p><p>Staying anonymous is a art, if you know how the ISP trace and gather information on you, you can use that knowledge to better protect yourself, a few tools will be needed. </p><p><strong>Another big Security issue</strong></p><span></span><p>If your PC or Smartphone get stolen, what does it cost you? Sure a iphone cost you $1000 behind but what about the data inside, well you have backup that is great, but are you concern on your secret that the person that take hold of your iphone. if they just do a reset and sold it off for a profit, you are consider lucky </p><p><strong>But if it fall into a hacker hand, he decided to do a forensic before selling off, all your sensitive information has no protection</strong></p><p>Learn how to stay anonymous, learn how the digital forensic work, learn how to encrypt your data. Sure it might have a addition step when you use a device, but for a piece of mind, it might be worth many times if you just lost your device or your house get broken into with all the harddisk unencrypted, this is the worse. A forensic is not even needed if you have a unencrypted harddisk. And the windows logon is not a security at all, if you think that is, you better start thinking again.</p><p><strong>Think again and Enroll in this course to protect your activities and stay Annoymous</strong></p>", 
    "end_date": null, 
    "title": "Hacking & Digital Forensics & Autopsy - Stay Anonymous", 
    "price": "20.00", 
    "instructors": "Jon Webby", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508633_7f99.jpg", 
    "course_url": "https://www.udemy.com/hacking-digital-forensics-autopsy-stay-annoymous/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-22T03:13:20Z"
}