{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong>Hacking School – Der unzensierte Hacking Kurs</strong>  </p>  <p>  \t                    Wir freuen uns, dass wir Ihnen das von uns erarbeitete und in seiner Art einmalige Hacking School Handbuch vorstellen können. Es vermittelt die Grundkenntnisse im Bereich System- und Netzwerksicherheit.  </p>  <p>  \t<br>  \t            Mit Hilfe des Handbuches gehen Sie Schritt für Schritt den  interaktiven Kurs durch und erlernen sowohl einfache als  auch fortgeschrittene Techniken, die täglich von Hackern  genutzt werden um in fremde Netze einzudringen. Wenn  Ihnen diese Techniken geläufig sind, werde Sie auch in  der Lage sein, ihr eigenes Netz zu schützen.  </p>  <p>  \t<br>  \t<strong>Prüfen Sie, wie sicher Ihr Netzwerk und Ihr Computer sind.</strong> Wenn Sie über einen eigenen Server oder eine Internetseite verfügen, oder wenn Sie ein Diskussionsforum leiten, wissen Sie bestimmt, was für ein großer Schaden von Eindringlingen eingerichtet werden kann. Schlagen Sie Internetverbrecher mit ihren eigenen Waffen.  </p>  <p>  \t<br>  \t<strong>    Sie wollen wissen wie?  </strong>  </p>  <ul>  \t<li>Sie erfahren, wie sicher Ihre Kennwörter sind - die beste Art es zu erfahren ist, sie zu knacken.</li>  \t<li>Führen Sie eine Attacke gegen eine eigene Web-Seite durch und stellen Sie ihre Schwachstellen fest. Sie später zu korrigieren fällt Ihnen dann wesentlich leichter.</li>  \t<li>Sie werden erfahren, wie (erschreckend) einfach jede im LAN versendete Nachricht abgefangen werden kann – Mails, über Messenger geführte Gespräche oder der Inhalt betrachteter Webseiten. Wir zeigen Ihnen, wie Sie das unterbinden können und dadurch Ihre Privatsphäre schützen können.</li>  </ul>  <p>  \t                    Das ist nur ein kleiner Teil der Techniken, die wir Ihnen vermitteln wollen. Haben wir Ihr Interesse geweckt? Dann lesen Sie weiter...  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>    Expertenmeinungen  </strong>  </p>  <p>  \t                    Unser Training wurde von einer Reihe von Branchendiensten durchgetestet. Wir möchten Sie anregen, sich mit der Meinung unabhängiger Experten von solchen Webdiensten wie Hakin9 Magazine oder All About PC Vortal vertraut zu machen. Es folgen Links zu bisher erschienenen Veröffentlichungen.  </p>  <ul>   </ul>  <p>  \t<br>  \t<strong>    Wie erweitern Sie ihr Wissen auf dem Fachgebiet des Hackings?  </strong>  </p>  <p>  \t                    Speziell für Sie haben wir ein komplexes, interaktives Trainingsset entwickelt, dessen einzelne Elemente im Folgenden besprochen werden.  </p>  <p>  \t<u><strong>Das Hacking School Handbuch</strong> </u>- Das Buch führt Sie Schritt für Schritt sowohl in die grundlegenden als auch in die fortgeschrittenen Geheimnisse des Hackings ein. 420 Seiten an Beispielen und Fällen sowie an Informationen darüber, wie Hacker arbeiten, aber auch Übungen, mit deren Hilfe Sie praktische Fähigkeiten erlernen, unterstützen Sie dabei. Jedes Kapitel stellt einen abgeschlossen Abschnitt dar und behandelt ein ausgewähltes Thema. Sie selbst entscheiden sowohl über Ihr eigenes Lerntempo als auch über das Thema, das gerade für Sie von Interesse ist.  </p>  <p>  \t<u><strong>System mit 19 Trainingsfilmen</strong></u> - fast 4 Stunden Audio- und Videomaterial. Jedes Thema aus dem Handbuch wird detailliert vorgestellt und ist mit gesprochenen Kommentaren versehen. Jeder Film wurde in einer realen Umgebung erstellt und stellt ein wirkliches Szenario dar, das von einem potentiellen Hacker durchgeführt werden könnte. Die Filme zeigen Ihnen alle notwendigen Schritte - wichtig, wenn Sie unterwegs \"hängen bleiben\".  </p>  <p>  \t<strong><u>          Trainingsbetriebssystem</u></strong> (ISO-Abbild) - Um die Umsetzung des Trainingsmaterials auch Anfängern zu ermöglichen, wurde dem Set ein speziell vorbereitetes Trainingsbetriebssystem beigelegt, das direkt von der CD - also ohne Installation – gestartet werden kann. Zwei Minuten nach dem Start ist Ihre Testumgebung einsatzbereit und Sie können loslegen!  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>Konfuzius, einer der größten chinesischen Philosophen hat einst gesagt: <em>\"Ich höre und vergesse. Ich sehe und erinnere mich. Ich mache und verstehe.\"</em>. Dieses alte chinesische Sprichwort hat uns während der ganzen Entstehungszeit des Hacking School Sets begleitet.</strong>  </p>  <p>  \t                    Im Verlauf von vierzehn Monaten harter Arbeit ist es uns gelungen, für Sie ein außergewöhnliches und bisher nie da gewesenes Training zu erstellen. Es war nicht einfach, aber Dank der Ausdauer und des Engagements aller acht Teammitglieder, haben wir es geschafft. Es ist uns gelungen, die Information in Buchform mit dem Multimediamaterial und der Trainingsumgebung auf dem höchsten Niveau miteinander zu verbinden. Das alles, damit das Endprodukt sogar den anspruchsvollsten, zukünftigen Adepten der Hackerkunst zufrieden stellt.  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>    Eine Art der Wissensvermittlung, die funktioniert.  </strong>  </p>  <p>  \t                    Das Set beinhaltet nicht umsonst das Wort „Handbuch\" in seinem Titel. Wie Sie sich gleich überzeugen können, handelt es sich hierbei nicht um eine weitere technische Abhandlung zum Thema Systemsicherheit. Bei dem, was wir vorbereitet haben, handelt es sich um ein interaktives Trainingsset, dass Sie Schritt für Schritt in die Welt der ausgefallensten Hacker-Methoden einführt. Dank der dem Handbuch beigefügten Multimediadisks fühlen Sie sich wie ein Teilnehmer an einem echten Vortrag!  </p>  <p>  \t                    Stellen Sie sich vor, dass Sie die Möglichkeit haben, bisher unzugängliche Problemkomplexe kennen zu lernen. Geheimnisse, die nur auf ihre Entdeckung warten. Sie schlagen einfach das Handbuch bei der Sie interessierenden Lektion auf und lernen ihren Inhalt kennen. Einmal durchlesen, durchdenken und verstehen...  </p>  <p>  \t                    Sie können in nur 2 Minuten auf Ihren Computer eine einsatzfähige Testumgebung aufbauen und alles durchtesten, was Sie bisher gelernt haben – dies alles mit dem unabhängigen, sich von der Disk startenden Trainingsbetriebssystem.  </p>  <p>  \t                    Sie können die Lehrfilme sehen und Sie lernen das interaktive Videomaterial kennen, das Ihnen Schritt für Schritt, Handlung für Handlung alles das zeigt, was Sie gerade eben erst gelesen haben.  </p>  <p>  \t                    Es ist vollkommen unwichtig, ob Sie ein Anfänger im Umgang mit dem Computer, oder auch ein Computer-Guru sind, der schon mir allen Wassern gewaschen ist. Sie entdecken im Trainigsset immer wieder Neues.  </p>  <p>  \t                    Die Art und Weise, wie dieses Wissen vermittelt wird, ist zweifelsohne ein Meilenstein.  </p>  <p>  \t                    In 20 hervorragend ausgearbeiteten Multimedialektionen werden solche Problemstellungen behandelt wie:  </p>  <ul>  \t<li>Knacken von Kennwörtern gesicherter Dateien.</li>  \t<li>Abfangen von unverschlüsseltem Text oder von mit fortgeschrittenen Verschlüsselungsmethoden verschlüsseltem Text.</li>  \t<li>Angriffe auf Anwendungen und Datenübertragungsprotokolle.</li>  \t<li>Erstellung von eigenen Exploits und Shellcodes.</li>  \t<li>Nutzung von Netzwerkscannern.</li>  \t<li>Einbrucherkennungssysteme.</li>  \t<li>... und viele, viele weitere interessante Themen.</li>  </ul>  <p>  \t                    Eine der in der Hacking School beschriebenen Problemstellungen ist das Abhören des Internets. In der Zeit immer weitläufigerer Heim-, Siedlungs- oder Universitätsnetzwerke, können Sie unbewusst zu einem Opfer eines bösartigen Eindringlings werden. Wir zeigen Ihnen ohne Umschweife, wie das Abfangen von Informationen im Intranet möglich ist. Sie haben die Möglichkeit, die gesamte Prozedur vom Standpunkt eines potentiellen Einbrechers aus Schritt für Schritt zu verfolgen. Sie werden sehen, dass es (erschreckend) einfach ist, Opfer solcher Attacken zu werden. Lernen Sie diese Techniken kennen und schützen Sie Ihre Privatsphäre!  </p>  <p>  \t                  Dank der im Set enthaltenen Informationen werden Sie die im Netzwerk herrschenden Funktionsmechanismen verstehen lernen. Wir hegen die Hoffnung, dass dieser Teil des Handbuchs Sie zum Nachdenken anregt und dazu beiträgt, das Sicherheitsniveau Ihres lokalen Netzwerks erneut zu überdenken und verbessern.  </p>  <p>  \t<strong>Wir zeigen Ihnen die Funktionsweise verschiedenartiger Backdoors und Rootkits. Wir beschreiben genau, wie die Dateien, Verzeichnisse, Module und Programme verborgen werden können.</strong>  </p>  <p>  \t                    Das alles können Sie in zwei Kapiteln des Hacking School Handbuchs nachlesen und mit Hilfe des hervorragend vorbereiteten Multimediamaterials nachspielen.  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>    Es gibt viele Möglichkeiten in Computer einzubrechen...  </strong>  </p>  <p>  \t                    \"Hacking\" Anfänger beginnen für gewöhnlich ihr Abenteuer mit verschiedenartigen Trojanern oder fertigen Skripten. Allerdings überlegen sich die wenigsten von ihnen, wie diese eigentlich funktionieren. Mit jedem Tag werden diese Methoden immer wirkungsloser.  </p>  <p>  \t                    Programmierer hinterlassen oftmals unbeabsichtigt im Code kleine Fehler, die bei entsprechender Ausnutzung einen Einbruch ermöglichen. Mit Hilfe der Hacking School lernen sie sowohl die grundlegenden als auch die fortgeschrittenen Techniken hierzu kennen.  </p>  <p>  \t<u>Sie erfahren, wie: </u>  </p>  <ul>  \t<li>Der Programmcode analysiert wird,</li>  \t<li>Man zur Fehlerquelle vordringt,</li>  \t<li>ein bestimmter Fehler wirkungsvoll durch den Hacker ausgenutzt werden kann.</li>  </ul>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>Wenn Sie ein Anfänger sind</strong> und erst damit beginnen, die Geheimnisse der Computerwelt zu erforschen, trägt das Hacking School Handbuch gewiss zu der Erweiterung ihres Horizonts bei!  </p>  <p>  \t                    Warum? Wir zeigen Ihnen in dem Handbuch u. a. Programmiergrundlagen einiger populärer Programmiersprachen wie C und Python. Diese Kenntnisse sind für das Verständnis von manchen Problemen und deren Lösung von essentieller Bedeutung.  </p>  <p>  \t<strong><u><br>  \t</u></strong>  </p>  <p>  \t<strong><u>                  Zusammenfassung:  </u></strong>  </p>  <ul>  \t<li>Jede der 21 Lektionen im Handbuch ist in Unterkapitel aufgeteilt.</li>  \t<li>19 der 21 Lektionen werden durch interaktives Lehrmaterial ergänz.</li>  \t<li>Auf den 420 Seiten des Handbuchs und in dem 4-stündigen Lehrfilme sind die verschiedensten mit der Ausnutzung der Schwächen von Computersystemen und Netzwerken in Verbindung stehenden Problemstellungen enthalten.</li>  \t<li>Sämtliche Werkzeuganwendungen sowie der Quellcode der im Handbuch beschriebenen Skripte und Programme erhalten Sie auf der beigefügten Zip-Archiv. Alles ist nach Kapiteln unterteilt.</li>  \t<li>Dank des speziell entwickelten Schulungsbetriebssystems verfügen Sie über die Möglichkeit, jede der Lektionen durchzugehen ohne die Software auf dem Computer installieren zu müssen. Der Start des Systems von der CD (oder ISO-Abbild) dauert etwa zwei Minuten.</li>  </ul>", 
    "end_date": null, 
    "title": "Hacking School - DEUTSCHE EDITION", 
    "price": "50.00", 
    "instructors": "Hacking School, IT Security Academy", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307868_685c.jpg", 
    "course_url": "https://www.udemy.com/hacking-school-deutsche-edition/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-25T19:37:59Z"
}