{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t        Welcome to Hacking School!  </p>  <p style=\"\">  \t<strong style=\"\"> Ethical Wireless Network Hacking Course:<br style=\"\">  \t<u style=\"\">Hacking Wireless Networks. Theory and practice.</u></strong>  </p>  <p style=\"\">  \t<br style=\"\">  \t        Before we begin: the practical use of the course you are going to see has been proven by thousands of people all over the world – beginners and computer geeks as well. People who make their first steps in computer / network security and professionals: network administrators, programmers, pentesters, black- and white hat hackers. Please, read carefully what we&#039;d like to share with you.  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\">This course covers all the important techniques related with WIRELESS NETWORK (or WiFi) HACKING used by hackers, system administrators and pentesters.</strong>  </p>  <p style=\"\">  \t<br style=\"\">  \t        Wireless networks are all around us. You want it or not, you ARE part of this system. As new wireless encryption-standards are being developed, new attack techniques are being discovered and presented at the same time. It’s a real arms race.  </p>  <p style=\"\">  \t<br style=\"\">  \t        Either you want to make your home WiFi network more secure, you want to recover a forgotten password, or you want to break into your wireless network to prove it is secure - regardless of the WiFi encryption-type used (WEP, WPA, WPA2), you will find the answer in this course.  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\">What you can expect from this course:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">You will get access to over 60 interesting lectures on Wireless Network Hacking</li>  \t<li style=\"\">You can download the course Handbook in PDF (over 180 pages)</li>  \t<li style=\"\">You can download the Training Operating System v2.0 CE (CUDA Extension) which is equipped with all the tools described in this course</li>  \t<li style=\"\">It is a step by step training on WiFi ethical hacking</li>  \t<li style=\"\">It covers over 25 different Wireless Network Hacking techniques and experiments</li>  \t<li style=\"\">This course can be treated as a valuable source of knowledge by white- and blackhat hackers, pentesters and network analysts</li>  \t<li style=\"\">You can get access to all the source codes and tools described in the course – it’s already prepared for you in the Training Operating System environment</li>  \t<li style=\"\">You can boot the Training Operating System from CD/DVD or start it inside a virtual machine (using VirtualBox on Windows and VMware Fusion on MAC OSX)</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\">What you need to know before you begin:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">This ethical hacking course is intended to help you regardless of your current knowledge and skills. All you need is a basic computer knowledge and our Training Operating System v2.0 (you will also get access to it!).</li>  \t<li style=\"\">We will show you how to prepare your training environment. In this environment you can experiment freely, without doing harm to anybody.</li>  \t<li style=\"\">You will find all the source codes and examples inside your Training OS to avoid unnecessary code retyping.</li>  \t<li style=\"\">Most of the modules (lessons) contain the attack related part, as well as a guidance to protect your own wireless network.</li>  \t<li style=\"\">What you will find inside can also be used by beginners - thanks to live Video Training attached to the course.</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\">The complete list of all the video training sessions included in this course:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">The configuration of wireless network card modes</li>  \t<li style=\"\">Changing the MAC address of the wireless network card</li>  \t<li style=\"\">Finding a hidden access point with disabled ESSID broadcast</li>  \t<li style=\"\">The use of deauthentication attack for jamming network traffic</li>  \t<li style=\"\">The overview and demonstration of the chop-chop attack</li>  \t<li style=\"\">Generating packets without knowing the network key</li>  \t<li style=\"\">Interactive packet replay and ARP request replay</li>  \t<li style=\"\">The demonstration of the PTW and KoreK attacks</li>  \t<li style=\"\">Creating a fake access point – the Caffe Latte attack</li>  \t<li style=\"\">The dictionary attack on WPA/WPA2</li>  \t<li style=\"\">The dictionary attack on WPA/WPA2 – using hash tables</li>  \t<li style=\"\">CUDA – the initial preparation of the environment</li>  \t<li style=\"\">The installation of CUDA-SDK and CUDA-Toolkit</li>  \t<li style=\"\">The compilation and installation of the tools with CUDA support</li>  \t<li style=\"\">The optimization of the parameters of an nVidia video card</li>  \t<li style=\"\">CUDA – preparation for the attack</li>  \t<li style=\"\">CUDA – the attack on WPA/WPA2</li>  \t<li style=\"\">Generating your own dictionary</li>  \t<li style=\"\">Applications for cracking MD4 and MD5 hashes with the use of CUDA technology</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t        Please be advised that all the techniques presented in this course can only be used ethically and in your own testing / researching environment. Note that you will get all the required tools and information to prepare your own training system. Please see the Legal information in the 1st section for further legal reference.  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\">We guarantee your 100% satisfaction or you will get your money back. You have 30 days to decide if the Wireless Network Hacking Course is for you. You will get access to the whole system. If for any reason you&#039;re not satisfied with your training, you will get a full refund. No questions asked.</strong>  </p>  <p style=\"\">  \t<br style=\"\">  \t        Good luck and see you on the other side,<br style=\"\">  \t<em style=\"\">Andrew Harper</em> || Hacking School Team  </p>", 
    "end_date": null, 
    "title": "Hacking Wireless Networks. Theory and practice.", 
    "price": "20.00", 
    "instructors": "Hacking School, IT Security Academy", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/245084_d211_2.jpg", 
    "course_url": "https://www.udemy.com/hacking-wireless-networks/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-17T15:57:14Z"
}