{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Learn the basic concepts and tools that you will need to build simple, but fully functional Linux based two-node high availability cluster.<br></p><p><strong>Build practical skills in creating a high availability cluster with this tutorial for beginners.</strong></p><p>In this course you will learn:</p><ul><li>How to set up a Digital Ocean account, create VPSs and configure the Floating IP</li><li>How to set up the Heartbeat service</li><li>How to configure the IP address reassignment service</li></ul><p><strong>Powerful Tools at Your Fingertips</strong></p><p>Learning high availability cluster setup essentials puts a very powerful and useful tools at your disposal. After finishing this course you will be able to create a fail-proof web servers cluster within the Digital Ocean infrastructure.</p><p><strong>Content and Overview</strong></p><p>This course is suitable for beginning web server administrators. Through this course, you'll learn the fundamentals of high availability web server cluster. Each chapter is packed with step-by-step guides which will put your new learned skills into practical use immediately.</p><p>You will start with creating a new Digital Ocean account and setting up two virtual servers. Then you will configure the Personal Access Token for your Digital Ocean account. After that, you will configure the Floating IP, set up and configure the Heartbeat, and finally you will set up the IP reassignment service.</p><p>Students completing the course will have the knowledge and skills to set up and administrate their own fail-proof web server cluster.</p><p>Working through all the lections and command-line commands, you'll be able to instantly put the knowledge into practice, and will receive <strong>a verifiable certificate of completion </strong>upon finishing the course.</p><p><strong>100% Satisfaction Guarantee. No Questions Asked!</strong></p><p>I hope you will be absolutely satisfied once you got through my course. I do my best to make sure this course meets your need and expectations. But if you're not satisfied with this course for ANY valid reason, contact me within 30 days from your purchase and I will refund in full. No questions asked. You have absolutely nothing to lose.</p>", 
    "end_date": null, 
    "title": "High Availability Setup with Heartbeat and Floating IP", 
    "price": "20.00", 
    "instructors": "Aleksey Grebeshkov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/770500_0281_2.jpg", 
    "course_url": "https://www.udemy.com/high-availability-setup-with-heartbeat-and-floating-ip/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-22T12:30:48Z"
}