{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course introduces the student to some best practices for installing and securing Oracle WebLogic in production environments. There are many differences between Development and Production environments which this course will highlight. </p><p>This course is targeted at IT professionals, systems administrators, DevOps engineers, and architects who need to understand and deal with network, information, and application security. The course assumes a beginner to intermediate knowledge of Oracle WebLogic. Prior experience with installation and administration, either hands-on or conceptually is highly recommended. </p><p>The course is organized into a series of video lectures followed by a hands-on tutorial. This course comes with a detailed Lab Guide that you can use at home or work. </p><p>As an Architect during the day, I am responsible for ensuring that any solutions or services that are deployed to production are architected and deployed in a secure manner. Security is of the utmost importance and it should be yours too. </p><p>If you have enterprise deployments of WebLogic in production and you are responsible for how these systems are deployed and secured, then this course will help you understand where to start with securing WebLogic. </p><p>Security is a broad and deep topic. This course does not attempt to cover every possible security topic related to WebLogic, however. This course does attempt though to cover what I feel are some of the most important aspects of securing a deployment. </p><p><br></p>", 
    "end_date": null, 
    "title": "How to Secure Oracle WebLogic 12c", 
    "price": "20.00", 
    "instructors": "Chris Parent", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788480_874a_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-secure-oracle-weblogic-12c/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T14:06:27Z"
}