{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong><em>[Course is up-to-date with January, 2016 information!]</em></strong><br></p><p><em>\"I wouldn't have thought there is so much information people can find about me online! I liked this course because it gave me actionable tips that I can start applying right away. I loved the \"How to track down all the websites you signed up for\" lecture, amazing tips here! I started applying what I have learned and I can already see the benefits. Big thanks!</em><em>\"</em></p><p>Learn the concepts, principles and proven strategies that allow you to build and maintain a <strong>healthier online life</strong>. </p><p>This course is a step-by-step guide that walks you through some of the most common <strong>online privacy and security threats and teaches you how to prevent them</strong>. <br></p><p>Students get access to 24 lectures and 2 hours worth of content!</p><p>Throughout this course you will learn step by step:</p><ul><li>How to <strong>prevent hacking attempts to you PC</strong></li><li>How to <strong>set ultra secure passwords</strong> for your various accounts online</li><li>How to <strong>recognize and avoid fraud online</strong></li><li>How to protect your information in case you <strong>lose your smartphone</strong> or it is stolen</li><li>Key steps you need to implement to take your <strong>Facebook privacy</strong> to the next level</li><li>How to check and manage what information third party applications <strong>share on your         Facebook timeline on your behalf</strong></li><li>How to <strong>be in control of </strong><strong>your Linkedin privacy</strong></li><li>How to <strong>become unsearchable on Google</strong> and other search engines.     </li><li>How to <strong>stop receiving junk email </strong></li></ul>", 
    "end_date": null, 
    "title": "I Know What You Did Last Time You Were Online ( ͡° ͜ʖ ͡°)", 
    "price": "30.00", 
    "instructors": "Brian Fitzgerald", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461206_43dd_2.jpg", 
    "course_url": "https://www.udemy.com/online-privacy-and-security/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T06:03:23Z"
}