{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Today most of us begin and end our day in the complex cyber world, which is why it has become more of a necessity than extravaganza to ensure the protection of information and its related assets. As much as for us it is equally important or may be more for an organization on its information assets security assurance−and so is the increasing necessity of information security leaders. This is where the importance of CISSP appears.  A CISSP has the breadth and depth of the necessary expertise to establish holistic security programs that declare the protection of organizations’ information assets.</p>  <p>A one of its kind certification is the idyllic record for those with proven deep technical and managerial capability, skills, knowledge, and standing to design, engineer, implement, and manage their overall information security program to protect organizations from growing sophisticated attacks. <br> <br> Backed by (ISC)², the CISSP was the first permit in the field of information security to meet the tough requirements of ISO/IEC Standard 17024Apart from being an objective measure of excellence, CISSP is also  a globally recognized standard of achievement.</p>  <p>CISSP will help any professional to:</p>    <ul>  <li>Authenticate their proven ability gained through years      of experience in information security.</li>  <li>Show your technical knowledge, skills, and abilities to      effectively develop a complete security program set against globally established      principles.</li>  <li>Distinguish yourself from your peers for desirable job      openings in the fast-growing information security market</li>  <li>Assert your commitment to the field and ongoing      relevancy through continuing professional education and understanding of      the most current best practices</li> </ul>  <p>Employers are also at the receiver’s end of its benefits with the help of CISSP as it helps:</p>  <ul>  <li>Care for against threats </li>  <li>Make certain professionals stay up to date on emerging      threats, technologies, regulations, standards, and practices through the      continuing professional education requirements</li> </ul>", 
    "end_date": null, 
    "title": "Information Systems Security for Professionals: CISSP", 
    "price": "20.00", 
    "instructors": "Compaq learning", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497492_c669.jpg", 
    "course_url": "https://www.udemy.com/cissp-certified-information-systems-security-professional-h/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T10:47:58Z"
}