{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Have you ever wondered whether your home WiFi network is secure?<br>Do you worry about getting malware and computer viruses?<br>Have you ever received an email from your bank and you haven't been sure whether it was genuine?<br>Worrying isn’t it?</p>\n\n<p>You probably connect to the Internet almost every day but you may have not thought much about Internet safety? This course will help you to answer some of these difficult question and help you to be safe online.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The course consists of video lectures with practical demonstrations on some of the key topics. There are also exercises for you to complete which hopefully will get you thinking about IT security in and out of the home. What sorts of things do we cover in the course?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Having a secure network at home is an essential foundation and in the section \"<em>Keeping your network secure</em>\" we look at topics such as securing your home Wi-Fi network and being secure when you are on the move.</li><li>We all have some many devices now that connect to the Internet. In the section \"Securing computers, tablets and phones\" we will look at how to secure all the different device types from Windows PCs to Smartphones.</li><li>You are probably the weakest link in staying safe online. In the section \"<em>People Security - Why you are the weakest link</em>\" we look at social engineering, email scams and privacy.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So why don’t you do something amazing, and sign up for this course. Surely your safety online is worth a couple of hours of your time?<br></p>", 
    "end_date": null, 
    "title": "Internet Safety - How to stay safe online", 
    "price": "20.00", 
    "instructors": "Dr Phil Walters", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542954_f943_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-stay-safe-online/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T09:36:21Z"
}