{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>More and more of our services are being moved online. There's no denying it, the digital age is upon us!</p><p>With so much of our information being stored online, the potential for identity theft has never been higher.</p><p><strong>What are you doing about it?</strong></p><p>Many people out there who have not kept up with the times. Meanwhile, online thieves have gotten craftier and more daring.</p><p>This course will teach you numerous ways of protecting yourself online. You won't just learn about how to install antivirus and antispyware software either, this course isn't that simple.</p><p>You're going to learn tips and tricks that will change the way you use your computer, email, social media and other connected devices.</p><p>The course throws you straight into the thick of things by working on your most important defensive measure: your password. Learn to create strong, memorable and secure passwords that you won't have to worry about again.</p><p>Then progress onto antivirus, antimalware and a growing list of tips and tricks.</p><p>Most importantly, as the world of Internet Security ever changes, so too will this course. New tips, tricks, contents and guides will be added over time, some even removed as the content becomes obsolete.</p><p>It doesn't matter whether you're a novice or a pro, if you're serious (<strong>and you damn well should be!</strong>) about your online security, this course is for you. It could very well be the thing that prevents your identity, money or accounts being stolen!</p><p><br></p>", 
    "end_date": null, 
    "title": "Internet and Computer Security: Protect Yourself Online!", 
    "price": "20.00", 
    "instructors": "Julian Sequeira", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588348_6c21_3.jpg", 
    "course_url": "https://www.udemy.com/internet-and-computer-security-protect-yourself-online/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T12:06:39Z"
}