{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<h5 style=\"\"><strong style=\"\">Do You StruggleTo Keep Your Computer Running Smoothly?</strong></h5>  <h5 style=\"\"><strong style=\"\"></strong><span style=\" color:inherit;\">Discover The Most Effective Ways To Sort Out Your Own Computer, Smartphone and Tablet Problems In Just A Couple Of Hours</span></h5>  <h5 style=\"\"><span style=\" color:inherit;\"></span><span style=\"\">This will also help you check and protect against the <strong style=\"\">Cryptolocker Ransomware </strong>and <strong style=\"\">ZeuS</strong> Threat levels that have been raised again.</span></h5>  <h5 style=\"\"><span style=\" color:inherit;\"></span>This course is so simple that literally anyone - <strong style=\"\"><em style=\"\">even you</em></strong> - could use it to sort your own computer problems out.</h5>  <ul style=\"\">  \t<li style=\"\">It doesn’t matter if you&#039;ve always had a hard time trying to keep your devices running smoothly.</li>  \t<li style=\"\">You don’t need any special knowledge - or need to buy any extra software</li>  \t<li style=\"\">You could easily sort your own devices within a couple of hours and you’ll start to see benefits immediately</li>  \t<li style=\"\">Wouldn’t that be great?</li>  </ul>  <h5 style=\"\"><strong style=\"\">Does This Sound Familiar?</strong></h5>  <ul style=\"\">  \t<li style=\"\">You don&#039;t know anything about how computers, smartphones or laptops work</li>  \t<li style=\"\">Trying to keep your computers etc running smoothly never seems to work for you</li>  \t<li style=\"\">So called &#039;expert friends&#039; have tried to fix your devices - but they only seem to work properly for a short time</li>  \t<li style=\"\">You can’t afford to buy expensive software it seems you might need</li>  \t<li style=\"\">You&#039;re tired of hearing repair experts tell you &#039;it&#039;s probably going to cost a lot to fix this&#039;</li>  </ul>  <p style=\"\">  \t       You also know - if you don’t get these issues handled and start to keep your computer running smoothly yourself - it will only contimue to get worse!  </p>  <h5 style=\"\"><strong style=\"\">Fortunately There Is A Simple Solution!</strong></h5>  <p style=\"\">  \t       Most people go through a common sequence of trial, error, trial, error…  </p>  <p style=\"\">  \t       However...  </p>  <ul style=\"\">  \t<li style=\"\">They don&#039;t know what to look for</li>  \t<li style=\"\">They don&#039;t know what the best solutions are</li>  </ul>  <p style=\"\">  \t       This course could be a game changer for you and you’ll be able to prevent issues arising again in the future.  </p>  <h5 style=\"\"><strong style=\"\">Don’t Just Take My Word For It!</strong></h5>  <p style=\"\">  \t &#039;I downloaded this course after experiencing recurring problems with spyware. Having got to the point where I was at my wits end I stumbled across an ad for this course. I was a bit dubious at first but It proved to be very easy to follow and gave me the know how to rid my laptop of the said bugs enabling me to surf with confidence once again. Because it was on promotion at the time I got this course for free (I do love a bargain) but believe me, had I known how good it is I would not have hesitated to pay full price.&#039; ~<strong style=\"\"><em style=\"\">Samantha J Wright</em></strong>  </p>  <p style=\"\">  \t       &#039;Working with Jim was one of the best business decisions I made. His knowledge and expertise online was exactly what I needed. He stays current with the evolving technology, and educates me on how to stay at the forefront of it all. I will continue to use his services and recommend others to do so as well.&#039; ~ <strong style=\"\"><em style=\"\">Dr. Jimi Roberson</em></strong>  </p>  <p style=\"\">  \t       &#039;One of Jim’s greatest qualities is he is very knowledgeable in his field&#039; ~ <strong style=\"\"><em style=\"\">Dr Rozana Huq</em></strong>  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\"><br style=\"\">  \t </em></strong>  </p>  <h5 style=\"\"><strong style=\"\">Introducing - Internet Security - Protecting Laptops, Smartphones Tablets</strong></h5>  <p style=\"\">  \t       Here’s how you’re going to quickly and easily keep your computer running smoothly:  </p>  <ul style=\"\">  \t<li style=\"\">Discover the tell tale signs you need to look for so that you can take action</li>  \t<li style=\"\">Easy to follow videos that you can watch as often as you need to – on any device</li>  \t<li style=\"\">When you know how to fix the problems yourself, you can stop asking others for help... in fact you may well help them in future!</li>  \t<li style=\"\">Uncover powerful free software sources so you can save money on expensive antivirus / firewall / spybot solutions</li>  </ul>  <p style=\"\">  \t       You can do this. You don’t need anything other than yourself, your computer and your internet connection. it’s so easy to do that you can succeed whatever your previous experience.  </p>  <h5 style=\"\"><strong style=\"\"><em style=\"\">You&#039;ll never again need to struggle to keep your own computer, smartphone or tablet device running smoothly</em></strong>.</h5>  <p style=\"\">  \t       To secure your access at the RISK FREE price of $29.00, just click the <strong style=\"\">Take This Course</strong> button...  </p>  <p style=\"\">  \t       You&#039;ll on your way to sorting your own computer problems out in as little is a couple of hours...  </p>", 
    "end_date": null, 
    "title": "Internet Security - Protecting Laptops, Smartphones Tablets", 
    "price": "30.00", 
    "instructors": "Jim Montgomery", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/218272_bf1f_8.jpg", 
    "course_url": "https://www.udemy.com/internet-security-protecting-laptops-smartphones-tablets/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-14T10:57:11Z"
}