{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Have you ever wondered what your children get up to when they are online?</p>\n\n<p>Do you worry about them accessing inappropriate material such as pornography?</p>\n\n\n\n\n\n<p>What about grooming, are you sure that they are only talking to people they already know?</p>\n\n\n\n<p>Are they sexting, sending inappropriate pictures to their friends using social media apps such as Snapchat?</p>\n\n<p>Are they suffering from cyberbullying, if so, what are the tell tale signs?</p>\n\n\n\n\n\n<p>Worrying isn’t it?</p>\n\n\n\n\n\n<p>As parents we like to hope that our children will do the right things, but how will they know if we don’t tell them? This course will help you to answer some of these difficult questions.</p>\n\n\n\n\n\n<p>The course consists of video lectures with practical demonstrations on some of the key topics. There are also exercises for you to complete which hopefully will get you thinking and talking with your children.</p>\n\n\n\n\n\n<p>What sorts of things do we cover in the course?</p>\n\n\n\n\n\n<ul><li>Having a secure network at home is an essential foundation to your children's online safety. In the section \"<em>Building a secure IT environment at home</em>\" we look at some the fundamental building blocks of Internet safety.</li><li>There are five main steps to Internet safety for your kids and we will look at these in detail in the section \"<em>Step by step to safety online</em>\".</li><li>What happens when things go wrong? In the section \"<em>Dealing with difficult issues</em>\" we will look at the six most common issues that you face as parents with an emphasis on practical steps that you can take if they happen.</li></ul>\n\n\n\n\n\n<p>So why don’t you do something amazing, and sign up for this course. Surely your child’s Internet safety is worth a few hours of your time? </p>", 
    "end_date": null, 
    "title": "Internet Safety - How to keep your children safe online", 
    "price": "20.00", 
    "instructors": "Dr Phil Walters", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688944_4a95_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-keep-your-children-safe-online/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T15:49:53Z"
}