{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  Dieser Kurs zeigt <strong style=\"\">Softwareentwicklern </strong>und <strong style=\"\">Administratoren </strong>die grundlegenden und wichtigen Funktionen der <em style=\"\">Internet Information Services</em> (IIS) - des Webservers der Microsoft Windows Plattform. Entwickler, die Webanwendungen in ASP.NET schreiben und auf einem Webserver veröffentlichen profitieren vom Verständnis für die IIS durch schnellere, bessere und stabilere Applikationen. Administratoren, die gelegentlich ASP.NET-Anwendungen für Entwickler betreuen, erfahren alles über die Bausteine der IIS und deren Konfiguration.  Der Kurs ist auch interessant, wenn Anwendungen auf Microsoft Azure gehostet werden sollen oder die Entwicklung von Diensten auf Basis von WCF (Windows Communication Foundation) erfolgt.  Die meisten Installation sind im Intranet zu finden. Wenn Sie ein Intranet mit Windows Servern betreuen oder dafür entwickeln und dabei Webanwendungen eine Rolle spielen, ist dieser Kurs besonders wichtig.  </p>  <p>  \t  Zum Kurs gehören eine Reihe von <strong style=\"\">kompakten Videos</strong> mit<strong style=\"\"> aktiven Präsentationen</strong> und <strong style=\"\">Demos </strong>der Werkzeuge. Einige Punkte sind eher informativ und werden als <strong style=\"\">eBook </strong>geliefert.  </p>  <p>  \t  Der Kurs hat <strong style=\"\">sechs Abschnitte</strong>, die in <strong style=\"\">26 Lektionen</strong> geteilt sind. Für jede Lektion sollten Sie sich 30 Minuten Zeit nehmen. Der komplette Kurs kann innerhalb von zwei Tagen durchgearbeitet werden. Die Einleitung mit etwas Theorie kann auch übersprungen werden.  </p>", 
    "end_date": null, 
    "title": "Internet Information Services für Webentwickler", 
    "price": "50.00", 
    "instructors": "Joerg Krause", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386858_18fe_2.jpg", 
    "course_url": "https://www.udemy.com/iis-dev-de/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T17:44:23Z"
}