{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t     For years there has been a need for that faster internet connection. People rely on the internet for almost everything, information/research, streaming movies from popular services like netflix or hulu, online gaming, even with mobile phones there is a need for that faster connection. Fiber Optics is the answer! Our old copper based cabling simply wont support the speeds and data capacity needed this day in age. Big companies such as AT&amp;T/Verizon &amp; even the U.S. Government have invested in updating our old copper cabling to Fiber Optic Cabling. So why is it not everywhere? After investing billions in upgrading our old copper cabling to fiber cabling the communications industry realized the man power simply isn&#039;t there to install it fast enough. What does this mean? It means there are a lot of jobs out there in this field, the need for fiber optic professionals is high. I am here to teach you the basics of fiber optics. A lot of this course is based off of the curriculum I teach at the University of Riverside that gives students a CFOT(Certified Fiber Optic Technician) Certificate from the FOA(Fiber Optics Association).  </p>  <p style=\"\">  \t <strong style=\"\">This course is intended for anyone who wants to learn the basics of fiber optics, maybe you are curious about the buzz around fiber optics, or maybe you are a systems administrator and IT manager that wants to gain knowledge of fiber optics. Whatever the case, this course is for you!</strong>  </p>", 
    "end_date": null, 
    "title": "Introduction To Fiber Optic Cabling ", 
    "price": "25.00", 
    "instructors": "Sebastian Flores", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22591_b568_6.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-fiber-optic-cabling/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-10T05:30:51Z"
}