{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t      Many people interpret and decide on what cyber security is, some see cyber security as a continuation of evolved version of it-security, others view it as a completely new branch of security and still others see it as mixture of the two. This course will give you the basics based on actual literature reviews, academic research and personal experience in global projects and work in cyber security, focusing on cyber warfare, espionage, crime and defenses as well as attacks used.  </p>  <p>  \t<strong style=\"\">Areas covered in this course include:</strong>  </p>  <ol style=\"\">  \t<li>Introduction into &quot;Cyber&quot;</li>  \t<li>Explanation of Cyber Areas such as what cyber is, what are the definitions of cyber war, espionage, crime, etc.</li>  \t<li>Basic components of Cyber Security such as OSINT, Hacking and Criminal Hackers, Hacker Profiles and Forensics, and much more.</li>  \t<li>Details into Cyber Warfare, Espionage and Crime</li>  </ol>  <p>  \t<strong style=\"\">It is a comprehensive introduction into cyber security and the cyber areas that will help you understand more detailed aspects of the weaknesses, attacks and defenses used to attack or protect critical infrastructure.</strong>  </p>  <p>  \t  If you need more comprehensive &quot;practical&quot; knowledge, we provide courses up to the Mil/DoD spec on these topics.  </p>", 
    "end_date": null, 
    "title": "Introduction to Cyber Security ", 
    "price": "50.00", 
    "instructors": "Michael Goedeker", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384788_5bbf_4.jpg", 
    "course_url": "https://www.udemy.com/intro2cybersec/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T11:02:06Z"
}