{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong>This is NOT the course for you if you want to read articles on Wikipedia and think you know how to use Wireshark. This course will explain theory and show you in detailed practical lessons how to use Wireshark.</strong></p><p><strong>Here's a 5 Star Review from C R Stewart:</strong></p><p><strong>\"SIMPLE ENOUGH FOR A KID TO UNDERSTAND</strong></p><p><strong>I like the way the instructor took the time to explain \nand reference each segment.  I now have a clearer understanding of how \nto analyze a protocol packet file capture.  Great beginner course!\" </strong></p><p>This is the essential guide to learn Wireshark. Take this course and learn everything you need to start using Wireshark to analyze network packets. I have worked in the computer security and hacking industry for a number of years starting in 1995. I have worked with major software companies, banks, transport industries, airlines, retail giants. We used software tools to analyze network data and even showed businesses how we were able to bypass physical security and gain access to their facilities and premises. </p><p>This course will share some of my security insights and, more importantly, you will learn how to start using Wireshark properly.</p><p>Wireshark is a free, open-source network packet analyzer. It is used for network troubleshooting, analysis, software and communications protocol development, and education.</p><p>Once you understand Wireshark, you will be able to apply for network administrator type roles or even assist the company you are working with currently to get a better understanding of problems on their network. </p><p>Understand this - Wireshark is extremely important in the marketplace currently and given our continuous increase in demand for internet and wifi services, there are lots of businesses who are very weak in their network security practices. This opens up a goldmine of opportunities for you once you learn Wireshark.</p><p>You will get an understanding of basic network concepts and the OSI model. You will get an overview of Wireshark, learn how to install Wireshark, and learn how to analyze packets on the network. Even more, you will learn how hackers can use Wireshark to steal information. </p><p>Further, we will cover filtering so you get a better understanding how to apply filters and learn how to apply filters to specific IP addresses.</p><p>There is a tremendous opportunity right now to make a career in network administration and network security. Learn how to help your existing company or even gain a higher paying network administrator role. You could even get a number of freelance opportunities that pay extremely well.</p><p>Take this course today and improve your packet analyzing skills with Wireshark.</p>", 
    "end_date": null, 
    "title": "Introduction To Wireshark - The Essential Beginners Guide", 
    "price": "35.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596444_0da3_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-wireshark/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T02:37:22Z"
}