{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>OVER 3,200 STUDENTS HAPPILY ENROLLED...SEE WHAT THEY ARE SAYING:</strong></p>\n\n<p><em class=\"redactor-inline-converted\">\"After starting a number of other courses about networking it was clear that I had a few holes in my knowledge about some of the basics that I needed to get up to speed on before moving on. This course managed to fill in those gaps in a way where I wasn't left scratching my head and off reading / watching other resources to understand what was being explained. The course is pitched perfectly for anyone looking to get into networking, covering all the basics in a logical, step by step manner. Also the length/delivery of each video I found pefect - I was able to do this entire course in just 4 days, making detailed notes as I went along.\"</em> - Jay<br></p>\n\n<p><em class=\"redactor-inline-converted\">\"This is one of the best courses I ever had - well-structured, excellently thought-through and very logically built. The instructor provides clear instructions, the course is so interesting I just wanted to go on and on. I am very happy about taking this course and would like to take more courses from the same instructor.\"</em> - Jolanta<br></p>\n\n<p><em class=\"redactor-inline-converted\">\"I don't have a tech-bone in my body so this was a great and easy course to follow. All the info I was looking for was found here plus some extra nuggets. Great course!\" - </em>Eliot</p>\n\n\n\n<p><strong>COMPUTER NETWORKING DEMYSTIFIED FOR NON-TECHIES </strong></p>\n\n\n\n<p>Are you a non-techie interested in learning about computer networks? Are you a business or aspiring IT professional that needs to better understand how networks work? Then you have come to the right place!<br></p>\n\n\n\n<p>This course will teach you the fundamentals of computer networking and how computer networks work, designed for Non-Techies!</p>\n\n\n\n<p><strong><strong>WHAT YOU'LL LEARN IN THIS COURSE:</strong></strong></p>\n\n\n\n<ul><li>The Benefits of Computer Networks</li><li>How Computer Networks Work</li><li>Network Topologies</li><li>Networking Devices &amp; Cabling</li><li>The OSI &amp; TCP/IP Models</li><li>IP Addressing &amp; Subnetting</li><li>Network Planning &amp; Designing Process</li><li>And Much More...</li></ul>\n\n\n\n<p>Once you complete this course, you'll understand how computer networks work and how to plan and design a computer network!</p>\n\n\n\n<p><strong>SO WHAT ARE YOU WAITING FOR? </strong><strong>ENROLL TODAY, YOUR 100% RISK-FREE ENROLLMENT IS BACKED BY UDEMY'S 30-DAY, NO QUESTIONS ASKED, MONEY BACK GUARANTEE!</strong></p>\n\n\n\n<p><strong>PREVIEW OVER 1 HOUR OF THIS COURSE THROUGH MY 20 FREE LECTURES, JUST SCROLL DOWN BELOW AND CLICK THE BLUE PREVIEW BUTTONS.</strong></p>", 
    "end_date": null, 
    "title": "Introduction to Computer Networks for Non-Techies", 
    "price": "20.00", 
    "instructors": "Alton Hardin", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580876_a07a_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-computer-networks/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T05:45:12Z"
}