{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to <strong>IT Networking for Cisco: (CCNA 200-120, 640-554, 640-721) </strong>from LearnSmart.</p><p>Looking to become a Cisco Certified Network Associate and CCNA Certified in Routing &amp; Switching, Security, Wireless?</p><p>This is the full Cisco training package that will prepare you to take the following exams: <em><strong>Cisco Exam 200-120</strong>?<strong> <em>Cisco Exam 640-554? </em></strong><strong><em>Cisco Exam 640-721? </em></strong></em></p><p>By the end of the course you'll demonstrate your proficiency in the principles, techniques, and tools involved in install, configure, operate, and troubleshoot networks.  Ultimately this training will establish your understanding of all the fundamental concepts within CCNA routing and switching, security, and wireless.</p><p><strong>Course Overview:</strong></p><p>These sections can be taken in any order, as a review of a particular concept or exam domain. However, if you are just becoming familiar with networking, security, and wireless, it is recommended that you view the courses sequentially.</p><p>In this course become familiar with the fundamental topics and skills required to install, operate, and troubleshoot a small to medium size enterprise branch network</p><p><strong>Course Breakdown:</strong></p><p><strong>CCNA Routing &amp; Switching</strong><strong> </strong><em>(</em><em>Section 1-10</em><em>)<br></em>**<strong>Section 25</strong>: CCNA Routing and Switching: Test Me-Cisco 200-120 CCNA</p><p><strong>Section 1</strong>: In the pre-assessment quiz you'll face questions from all sections of this training. Test your current knowledge and know your strengths and weaknesses.<br></p><p><strong>Section 2</strong>: Understand the fundamentals of a network and  learn about the operation of IP data networks, which will help administrators configure and troubleshoot issues moving forward.</p><p><strong>Section 3</strong>: Review the topics of LAN switching, WAN technologies by taking a closer look at the particular variables of Ethernet, switching, broadcast and collision domains, and basic switching concepts.</p><p><strong>Section 4</strong>: Take a look at both IPv4 and IPv6, and the role of IP addresses in network routing.  Understand what subnetting and Variable Length Subnet Masks are.</p><p><strong>Section 5</strong>: Study about system and network management, and discuss the fundamentals of how the router boot process works.</p><p><strong>Section 6:</strong> Deepen your understanding of IP routing technologies and the fundamentals of how routing decisions are made within devices. Also  focus on these particular routing protocols, EIGRP and OSPF, their fundamentals, and how to successfully configure each one.</p><p><strong>Section 7</strong>: Concentrate on some IP services, and router and switch security. Learn about DHCP and how to configure it on a router. </p><p><strong>Section 8</strong>: You will learn the skills to troubleshoot any router or switch issue. Walk through troubleshooting procedures and methodology. Explore how to troubleshoot IP addressing and switching problems, routing problems, as well as how to troubleshoot access control lists, WANs, and layer interface issues to enable efficient and secure network connectivity.<br></p><p><strong>CCNA Security (640-554 IINS)  </strong><em>(Section 9 - 10</em><em>)</em><br><em>**</em><strong>Section 26</strong>:\n   CCNA Security: Test Me-Cisco Exam CCNA Security 640-554 IINS</p><p><strong>Section 9</strong>: In the pre-assessment quiz you'll face questions from all sections of this training. Test your current knowledge and know your strengths and weaknesses.</p><p><strong>Section 10</strong>: Understand common security threats within a network and take a look at network and information security basics by learning some of the fundamental security principles. Learn how to secure the control, data and management planes on Cisco devices, including implementing security on Cisco routers.</p><p><strong>Section 11</strong>: Take a look at the differences between TACACS and RADIUS by understanding what they offer as an authentication type, and how to configure each one. Review the examples of ways in which you can configure AAA, via the Command Line Interface and Cisco Configuration Professional, along with some verification commands.</p><p><strong>Section 12</strong>: Access Control Lists (ACLs) help to mitigate threats against a network in a variety of ways. ACLs should be tested in a test environment prior to actually applying them and look at exactly what they are, what they do, and discuss the different types of ACLs and the role they play in security.</p><p><strong>Section 13</strong>: Focus on securing the network management plane. Be able to define the management plane, and learn some best practices that can be used to make it more secure, such as strong passwords, AAA, Role Based Access Control, Syslog, and NTP. Then, you will learn to identify and study demonstrations of the different configurations that can be implemented on the management plane.</p><p><strong>Section 14</strong>: Gain an in-depth understanding of these topics to determine how to best respond to layer 2 attacks.</p><p><strong>Section 15</strong>: Cisco Firewall Technologies explains the different firewall technologies and the strengths and weaknesses that surround them.</p><p><strong>Section 16</strong>: Cisco IPS discusses the differences between a Cisco IPS and Cisco IDS device, and some options that you have when deploying them in your network.</p><p><strong>Section 17</strong>: Learn the basics of VPN technologies, and how IPSec works in a VPN tunnel setup. You will also look at the basics of cryptography in order to gain a better understanding of exactly what goes on behind the scenes of a VPN tunnel establishment. Finally, you will walk through different ways of implementing a site-to-site VPN and configured SSL VPN using the graphical device manager from an ASA.</p><p><strong>CCNA Wireless (640-722 IUWNE</strong><strong>)<br></strong><em><em>(Section 18-24)</em><br></em>**<strong>Section 27</strong>:\n   CCNA Wireless: Test Me-Cisco Exam CCNA Wireless 640-722 IUWNE</p><p><span></span></p><p><strong>Section 18</strong>: In the pre-assessment quiz you'll face questions from all sections and topics of this training. Test your current knowledge and know your strengths and weaknesses.</p><p><strong>Section 19</strong>:<em> </em>It's imperative for any network engineer to be familiar with the fundamental topics of a wireless network, including basic spread spectrum technology, the wireless regulatory bodies, and the impact of different wireless technologies.</p><p><strong>Section 20</strong>: Installation of a Basic Cisco Wireless LAN discusses various best practices for Cisco Unified Wireless Network Architectures and provides demonstrations of installing and configuring autonomous access points, which operate on their own.</p><p><strong>Section 21</strong>: Installation of Wireless Clients demonstrates the practical and theoretical basis from which you can effectively administer a wireless network.</p><p><strong>Section 22</strong>: Basic WLAN Security provides a close up look at the implementation of security on the wireless network and some of the different aspects of wireless security.</p><p><strong>Section 23</strong>: Basic WCS Operation demonstrates the configuration of access points and controllers in a WCS environment, how to audit them, and how to properly use heat maps for an environment in a wireless environment.</p><p><strong>Section 24</strong>: Basic WLAN maintenance through the WCS and the WLC interface is critical knowledge that all network engineers must have.</p><p>*The content in this course aligns with from <em>Cisco</em>.<br></p><p><strong>Recommendations:</strong></p><p>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li><em>Great intro to CCNA - while this material can be pretty dry the instructor does a pretty good job of keeping the course interesting and informative. There is a lot of really good and easy to follow information. -- Sam Davidson</em></li><li><em>This CCNA course does an in depth coverage of the topics that you will need to know to pass the CCNA certification tests -- I highly recommend that anyone who wants to learn the material to take and pass the CCNA Exam, take this course. Those who master this course, will pass the exam on their first attempt. -- Bob Ziolkowski<span></span></em></li></ul>", 
    "end_date": null, 
    "title": "IT Networking for Cisco: (CCNA 200-120, 640-554, 640-721)", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438736_7d2b_4.jpg", 
    "course_url": "https://www.udemy.com/cisco-ccna-networking-core-concepts/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T17:09:36Z"
}