{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to  <strong>IT Networking Fundamentals: CompTIA Network+ 2015</strong> from LearnSmart.</p><p>The Network+ Certification by CompTIA is an international and vendor-neutral certification that has been endorsed and recognized by industry computing manufacturers and organizations. This course provides foundational knowledge of the principles, techniques, and tools needed to successfully prepare for the N10-006 exam.</p><p>This also qualifies as <em>Continuing Education Units (CEUs)</em>. If you're up for renewal, you can earn CEUs through this series and additional courses. Please see the CompTIA Network+ Continuing Education Options for a complete rundown of those courses. With this course you will be able to claim 24.5 CEUs.</p><p>In this course, you will learn the network infrastructure services for the CompTIA Network Plus certification exam. The topics that will be covered include: TCP/IP, Network Infrastructure Services, Troubleshooting Networks, LAN Infrastructures, Advanced Networking Concepts and much more. These courses are paired with a variety of demos and quizzes giving a real world look at some of the concepts that will be discussed. </p><p>The sections listed below are can be taken in any order, as a review of a particular concept or exam domain. However, if you are just becoming familiar with PC operating systems and basic networking, it is recommended that you view the courses sequentially.</p><p><strong>Course Overview:</strong></p><p>As a CompTIA certified Network+ technician you need to be aware of various cable types &amp; connectors, their characteristics, capabilities, and limitations. You'll also need to understand various connectors that are involved. This course is designed to prepare the student for the Network+ certification. Students will take a look at network standards and the organizations that create them, as well as the importance of standardization. We have paired this course with demos that will help give a visual example of the concepts that will be talked about. </p><p><strong>Course Breakdown:</strong></p><p><strong>Section 1</strong>: In the pre-assessment quiz you'll face questions from all sections of this Network+ Certification training. Test your current knowledge and know your strengths and weaknesses.</p><p><strong>Sections 2</strong>: Understand how transmission Control Protocol/Internet Protocol is a nonproprietary industry-standard protocol suite that provides communications on networks that support various operating systems and hardware types. Delve into the definition of \"suite\" to discover that there are multiple protocols, as well as tools, that make up TCP/IP. As a network technician, you will need to be familiar with all of these.</p><p><strong>Section 3</strong>: Focus Network Infrastructure Services by looking into DHCP and how it handles the automatic assignment of IP addresses and DNS provides name resolution. </p><p><strong>Section 4</strong>: Review the different layer (1-3) network devices and understand how they are devices that allow interconnectivity between network nodes. In this section learn topics on the importance of the OSI reference model, and device layer classifications. View demos that give a real world look at several of the concepts that will be discussed.</p><p><strong>Section 5</strong>: Take a closer look at network standards and the organizations that create them, as well as the importance of standardization and be aware of these various cable types,  their characteristics, capabilities, limitations, and connector types.</p><p><strong>Section 6</strong>: A wide area network (WAN) is a network that spans larger geographical distances and connects multiple local area networks (LANs) together using high-speed communication lines. Watch a variety of demos giving real world examples of the topics that will be discussed.</p><p><strong>Section 7</strong>: Ongoing monitoring of the network is crucial in order to ensure the continued efficiency of operations. This section is meant to help you answer the following questions: What are some of the things that we should know? Why should we monitor? What should we be looking for? And, what tools are at our disposal in this area?</p><p><strong>Section 8</strong>: Network security is important regardless of the size of the organization or the type of business. Part of information technology is information security; it is the duty of IT personnel to ensure that corporate assets such as company data, systems, and services are secure. Learn how to identify threats and vulnerabilities, protection techniques and how to implement them, and handling security incidents.</p><p><strong>Section 9</strong>: Take an in-depth look at topics that include network terminology, different type of network styles, network models, and topology. This section will conclude by covering the various processes and documentation that is used to ensure an organization continues to function in an orderly fashion, and will cover the various security practices that will help you when dealing with network devices and technology.</p><p><strong>Sections 10</strong>: Troubleshooting is an integral part of the network technician's daily tasks. Examine the various methods and tools that you will use when you encounter network related issues and learn about the different methods that are used when identifying and resolving issues, as well as the various tools that you will have at your disposal to counter the different types of issues that arise in today's environments.</p><p><strong>Sections 11</strong>: Look at what it takes to build a local area network when it comes to all the physical connections that are required. Know the basics of physically installing a local area network, connecting the LAN to the wide area network and discuss responsibilities in that area, and the best practices to follow if you find yourself building LANs from scratch.</p><p><strong>Sections 12</strong>: Today's networks are different than the networks of the past and include technologies that were not present as little as ten years ago. As the industry changes, network technicians must adapt and this and expand your knowledge to include new technologies.</p><p>The content in this course comes from <strong>CompTIA Network+ (N10-006) exam</strong> certification topics.</p><p><strong>Recommendations:</strong></p><p>Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul><li><em>Great Material - This course is a great reference and way to refresh your skills for the new Net+ exam! I needed a good refresh before taking the exam and this course is clearly laid out and copiously covers the material for the exam. Great course, well worth the money! -- M.B.</em></li><li><em>Perfect Course - Not only do you get great lectures that are pretty much PowerPoints with an instructor teaching you the concepts, there are also Demo lectures that show you how each of the concepts works in real life. This is such valuable information to have when taking the test. I feel very confident that this course is the best Network+ course on Udemy. -- D.R. Jr.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul><ul><li><em></em></li></ul>", 
    "end_date": null, 
    "title": "IT Networking Fundamentals: CompTIA Network+ 2015", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523610_e7c4.jpg", 
    "course_url": "https://www.udemy.com/it-networking-comptia-network-n10-006/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T20:33:38Z"
}