{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to <strong>Cisco CCNA Security</strong> from LearnSmart.</p><p>Looking to become Cisco CCNA Security Certified? Preparing to take the <em>Cisco Exam CCNA Security 640-554 IINS?</em></p><p>By the end of the course you'll demonstrate your proficiency in the principles, techniques, and tools involved in working with routers, networks, and switches. Be ready to prove to yourself, and others, that you are ready for Prove to yourself, and others, that you are ready for the <strong>Cisco Certified Network Associate in Security (640-554) certification exam</strong>.</p><p>If you're interested in becoming an accomplished Network Associate professional, this training will establish your understanding of all the fundamental concepts within CCNA routers, networks, and switches.</p><p><strong>Course Overview:</strong></p><p>These sections can be taken in any order, as a review of a particular concept or exam domain. However, if you are just becoming familiar with networking, it is recommended that you view the courses sequentially.</p><p>In this course become familiar with the fundamental topics and skills required to install, operate, and develop a small to medium size enterprise branch network in its security infrastructure.</p><p><strong>Course Breakdown:</strong></p><p><strong>Section 1</strong>: In the pre-assessment quiz you'll face questions from all sections of this training. Test your current knowledge and know your strengths and weaknesses.</p><p><strong>Section 2</strong>: Understand common security threats within a network and take a look at network and information security basics by learning some of the fundamental security principles. Learn how to secure the control, data and management planes on Cisco devices, including implementing security on Cisco routers.</p><p><strong>Section 3</strong>: Take a look at the differences between TACACS and RADIUS by understanding what they offer as an authentication type, and how to configure each one. Review the examples of ways in which you can configure AAA, via the Command Line Interface and Cisco Configuration Professional, along with some verification commands.</p><p><strong>Section 4</strong>: Access Control Lists (ACLs) help to mitigate threats against a network in a variety of ways. ACLs should be tested in a test environment prior to actually applying them and look at exactly what they are, what they do, and discuss the different types of ACLs and the role they play in security.</p><p><strong>Section 5</strong>: Focus on securing the network management plane. Be able to define the management plane, and learn some best practices that can be used to make it more secure, such as strong passwords, AAA, Role Based Access Control, Syslog, and NTP. Then, you will learn to identify and study demonstrations of the different configurations that can be implemented on the management plane. </p><p><strong>Section 6</strong>:  Gain an in-depth understanding of these topics to determine how to best respond to layer 2 attacks. </p><p><strong>Section 7</strong>: Cisco Firewall Technologies explains the different firewall technologies and the strengths and weaknesses that surround them.</p><p><strong>Section 8</strong>: Cisco IPS discusses the differences between a Cisco IPS and Cisco IDS device, and some options that you have when deploying them in your network. </p><p><strong>Section 9</strong>: Learn the basics of VPN technologies, and how IPSec works in a VPN tunnel setup. You will also look at the basics of cryptography in order to gain a better understanding of exactly what goes on behind the scenes of a VPN tunnel establishment. Finally, you will walk through different ways of implementing a site-to-site VPN and configured SSL VPN using the graphical device manager from an ASA.</p><p><strong>Section 10</strong>: Demonstrate and prove to yourself, and others, that you are ready for Cisco's Implementing Cisco IOS Network Security certification exam. You'll demonstrate your proficiency in the principles, techniques, and tools involved in working with routers, networks, and switches.</p><p>*The content in this course aligns with from <em>Cisco</em>.</p><p><strong>Recommendations</strong>:</p><p>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- I.A.</em></li><li><em>Great intro to CCNA Security -- while this material can be pretty dry the instructor does a pretty good job of keeping the course interesting and informative. There is a lot of really good and easy to follow information. -- S.D</em></li><li><em>This course does an in depth coverage of the topics that you will need to know to pass the CCNA certification test -- I highly recommend that anyone who wants to learn the material to take and pass the exam, take this course. Those who master this course, will pass the exam on their first attempt. -- B.Z.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul>", 
    "end_date": null, 
    "title": "IT Security for Cisco CCNA: 640-554 IINS", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438968_39e6_4.jpg", 
    "course_url": "https://www.udemy.com/cisco-ccna-security/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T21:46:05Z"
}