{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to Hacking School!  </p><p><u><strong>IT Surveillance and Computer Forensics from Scratch Course</strong></u></p><p><br></p><p>  \t            Before we begin: the practical use of the course you are going to see has been proven by thousands of people all over the world – beginners and computer geeks as well. People who make their first steps in computer / network security and professionals: network administrators, programmers, pentesters, black- and white hat hackers. Please, read carefully what we'd like to share with you. </p><p><strong><u><br></u></strong></p><p><strong><u>What you can expect from this course and what you will learn:</u></strong>  </p><ul><li><u><strong></strong></u>You will get over 30 lectures and 7+ hours of content!</li><li>You will get free source code package to download</li><li><strong>You will learn: </strong>Transmitting volatile evidence from an evaluated system </li><li>Disk backup over the network </li><li>Searching data based on last access or modification timestamps </li><li>Analyzing the data sent by a web browser </li><li>Analyzing the data revealed in e-mail headers</li><li>Remote capturing the data about user and hardware <br> </li><li>Harvesting user's IP address on message board<br> </li><li>Methods of creating a partition image <br> </li><li>Hiding data inside NTFS alternate data streams <br> </li><li>Steganography techniques <br> </li><li>Using tunneling to access firewall-protected services <br> </li><li>File encryption methods and vulnerabilities <br> </li><li>Recovering MS Windows user passwords <br> </li><li>Analyzing run applications based on Prefetch folder <br> </li><li>Acquiring data from pagefile, thumbnails and raw disk fragments <br> </li><li>Acquiring data from binary files and process memory dump <br> </li><li>Acquiring data from e-mail files <br> </li><li>Acquiring user's browsing history <br> </li><li>Discovering web search queries <br> </li><li>Examining remote host's availability over LAN <br> </li><li>Checking e-mail's deliverability and analyzing recipient's data <br> </li><li>Creating and installing a keylogger <br> </li><li>Building custom tools to analyze system security <br> </li><li>Taking over a remote computer <br> </li><li>Restricting access to chosen websites and computers <br> </li><li>Using WMI console for acquiring and analyzing evidence <br> </li><li>Using DNS cache for gathering information on visited websites <br> </li><li>Using Sleuth Kit for acquiring data from a disk image <br> </li><li>Recovering passwords to FTP, e-mail accounts and websites<br> </li><li>Analyzing a corporate data leak scenario</li></ul><p><br></p><p><strong>We guarantee your 100% satisfaction or you will get your money back. You have 30 days to decide if the Wireless Network Hacking Course is for you. You will get access to the whole system. If for any reason you're not satisfied with your training, you will get a full refund. No questions asked.  </strong>  </p><p><br>  \t              Good luck and see you on the other side,<br><em>Andrew Harper</em> || Hacking School Team</p>", 
    "end_date": null, 
    "title": "IT Surveillance and Computer Forensics from Scratch", 
    "price": "20.00", 
    "instructors": "Hacking School, IT Security Academy, Educativo Trainings", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702242_4b7e.jpg", 
    "course_url": "https://www.udemy.com/it-surveillance/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T16:55:59Z"
}