{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t    IT Security Beginner: Certified Hacking Training.  </p>  <p>  \t    BONUS:  </p>  <p>  \t    Finishing this course you will get free voucher for IT Security Academy Online Examination Center where you can archive IT Security Beginner Certificate.  </p>  <p>  \t    ——  </p>  <p>  \t    This course is ideal for everyone, regardless of their skills and expertise. The arrangement and presentation of learning resources will let both novices and more advanced students broaden their knowledge of IT security.  </p>  <p>  \t    Training is starting with IT Security current threat and trends. Afterwards we are discussing popular security myths. Great part of the training relates to Network security.  </p>  <p>  \t    We will start with local networks, talk about protocols and theirs vulnerabilities. You will learn how to design secure computer networks and subnets. You will become real network administrator.  </p>  <p>  \t    Next you will discover why wireless networks could be so dangerous. You will learn standards, protocols and security solutions. Wi-Fi networks are an integral part of our lives, but not everyone realizes that if it is inadequately protected, your enterprise or home network can disclose your confidential passwords and give attackers easy access to the machines you’re administrating.  </p>  <p>  \t    Topics covered include core issues related to effectively securing the most popular Microsoft OS: identity theft, authentication, authorization, encryption. We identify typical mistakes and guide you towards achieving good OS protection.  </p>", 
    "end_date": null, 
    "title": "IT Security: Hacking  Techniques for IT Professionals 2.0", 
    "price": "20.00", 
    "instructors": "IT Security Academy, Hacking School", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/114952_2cc1_3.jpg", 
    "course_url": "https://www.udemy.com/it-security-professional-certified-hacking-training/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-04T10:05:11Z"
}