{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Im Kurs erfahren Sie die Grundlagen zum Thema IT Sicherheit. </p><p>Im ersten Abschnitt werden Bedrohungen der IT Sicherheit erläutert. </p><ul><li>Warum kann ein Angriff überhaupt erfolgreich sein? </li><li>Wo können Bedrohungen auftreten? </li><li>Wie können Sie sich davor schützen?</li></ul><p>Im zweiten Abschnitt geht es ganz konkret um ausgewählte technische Beispiele zur IT Sicherheit. </p><ul><li>Sie sehen, wie einfach ein Passwort gehackt werden kann</li><li>Wie können Ihre Daten bei der Übertragung ausgelesen werden?</li><li>Wie entdecken Sie Schwachstellen auf Ihrem Rechner?</li></ul><p>Dieser Abschnitt gibt Einblicke in die Möglichkeiten des Angriffs, zeigt Ihnen aber auch Verbesserungsmöglichkeiten, die Sie umsetzen können, um einen bestmöglichen Schutz zu erhalten. In diesen Lektionen sehen Sie in Ansätzen Möglichkeiten von Angriffen. Der Kurs dient aber nicht als \"Hacking-Kurs\", sondern um Sie zu sensibilisieren und Ihr Bewusstsein diesbezüglich zu schärfen.<br></p><p>Im letzten Abschnitt zeige ich Ihnen ganz konkret, wie Sie strukturiert vorgehen können, um Ihre eigene IT Sicherheit zu erhöhen. Sie erhalten dazu Vorlagen, anhand derer Sie, die im Kurs vorgestellte Methode für sich selber anwenden können.</p><p>Natürlich enthält der Kurs auch Übungen und zusätzliche Materialien. </p><p>Zielgruppe sind alle, die sich mit dem Thema IT Sicherheit beschäftigen und beschäftigen wollen. Wenn Sie bisher noch keinen Einstieg oder Zugang zu diesem Thema gefunden haben, weil es Ihnen zu komplex erscheint, ist der Kurs genau richtig für Sie. Egal ob Sie den Kurs privat für Ihre Heim-IT oder beruflich als Selbständiger oder Freiberufler machen, Sie werden in jedem Fall etwas für sich mitnehmen.<br></p><p>Sind Sie allerdings schon sehr vertraut mit diesem Thema, wird der Kurs Sie weniger ansprechen, da es hauptsächlich um die Basics geht. </p>", 
    "end_date": null, 
    "title": "IT-Security Basics - Theorie & Praxis", 
    "price": "35.00", 
    "instructors": "Regina Stoiber", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/843808_2f38_3.jpg", 
    "course_url": "https://www.udemy.com/it-security-basics-theorie-praxis/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-09T13:57:29Z"
}