{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Juniper is Awesome! This is what you will think once you understand what Junos Operating system has to offer.</p><p>The\n Entire Course is Split into several parts and this is part-1b of the \ncourse where we take a Deep Dive into Load-Balancing / Filter-Based-Forwarding </p><p>I love teaching and I have a Passion towards \nit. I Have made it as hands on as possible instead of Slide shows \nshowing outputs and then dealing everything about it. </p><p>Goal of \nthis course is to make engineer as practical as possible and ease \nhis/her way to implement/troubleshoot thing thinking at fundamental \nlevel.</p><p>This is the Part-1b of the Course. Course Covers the \nofficial Curriculum / Blue Print from Juniper Networks Certification \nPortal. </p><p>Identify the concepts, operation and functionality of various protocol-independent routing components<br></p><p>Audience </p><p>Network Engineers who has knowledge on Basic TCP/IP </p><p>Engineers who would like to see additional concepts and knobs at a specialist level certification of JNCIS-SP/ENT </p><p>Part-1a of Jncis-SP PIr is recommended but not Mandatory<br></p><p>Materials : </p><p>Workbook and 3 Hour Lab Access included with this. <br></p><p>All the Demonstrations are covered over a virtual platform </p><p>This\n is done to demonstrate the power of Junos now at a virtual level , \nthanks to VMX / VSRX and also give a push to someone who wants to learn \nJunos and still think that he needs hardware for the same </p><p>How Long would it take to complete this Course ?</p><p>This course should take no greater than 3 Hours to complete.</p><p>This includes in-depth analysis of all the concepts and different knobs that Junos has to offer.</p><p>Why Take this Course  ? </p><p>- To get help in certification track of Famous Jncis-SP/ENT tracks<br></p><p>- To understand more about Juniper Networks </p><p>- To advance your configurational and troubleshooting expertise </p><p>Course Structure </p><p>-&gt; Firewall Filters </p><p>-&gt; Rib-Groups</p><p>-&gt; Filter Based Forwarding</p><p>-&gt; Load Balancing <br></p><br><p>Equipment and Lab Demonstrations </p><p>-&gt; All the Labs are Build on VMware workstation12 using VSRX/CISCO IOL / VMX </p><p>-&gt; Initial setups were build on VSRX and then the later labs were executed on VMX setup using Logical systems <br></p><p>This\n is purely done keeping one thing in mind as i have re-iterated earlier,\n the goal of this course is to make it as practical as possible along \nwith exploring the user-friendly options where students who enrol for \nthis course can take a better advantage by setting up their own systems \nwithout worrying about hardware. I have also made sure that this entire \ncourse can run on a single VMX Instance of Junos which consume a 2GB ram and 2vcpu </p><p>I hope you enjoy this course as much as I did developing it.</p>Cheers", 
    "end_date": null, 
    "title": "Juniper JNCIS-SP Part-1b - Filter Based Fowarding / LB", 
    "price": "20.00", 
    "instructors": "Rakesh Madupu", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776652_dbd3_2.jpg", 
    "course_url": "https://www.udemy.com/juniper-jncis-sp-part-1b-filter-based-fowarding-lb/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-28T06:44:43Z"
}