{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Kali is a penetration testing Linux distribution created by the Offensive Security. It holds a repository of multiple tools for security related engineers including hacking wireless networks, web applications, databases, Reverse engineering, password crackers, and much more! So as you can see, Kali is a versatile and powerful tool for anyone looking to do any cyber security related work.</p>  <p>As indicated by the ‘101’ in the course title, this course is a beginner’s guide to getting started in Kali…to get your feet wet. The course is broken down into 3 sections; Getting started, Basic Configuration, and Tools overview. We first give you an overview of Kali and its use cases then offer a step-by-step walkthrough of installing Kali using VMware. Next we teach you some important configuration setting in the distribution including configuring your network and managing services in Kali. Knowing these procedures will help you setup the proper environments when using Kali and its tools. Finally we go over the top available in Kali and describe their top features and best use cases.</p>  <p>By the end of this course you will be able to have a fully functioning distribution Kali running on your machine. You will also have an understanding of the Linux environment and how to manage network and system services. Lastly you will have a basic overview of the top tools available in Kali.</p>", 
    "end_date": null, 
    "title": "Kali Linux 101", 
    "price": 0, 
    "instructors": "Cyber Security Think Tank", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692312_8629_3.jpg", 
    "course_url": "https://www.udemy.com/kali-linux-101/", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T20:32:53Z"
}