{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Updated on 29 May 2016( Added lectures on RPVST+ ) - FOURTH UPDATE</strong></p>\n\n<p><strong>Cisco Nexus- The most popular, Demanding and Critical Hardware being used in Worldwide Datacenters.</strong></p>\n\n\n\n\n\n<p>When I launched my earlier courses- I was asked by students to prepare course on Cisco Nexus as this was not available in market. After spending over a month on Real Cisco Nexus 7000 and 5000 devices- This course is Ready for all of you and Note one thing- You will keep on getting new and updated lectures in this course- ONLY when you are subscribed to it.</p>\n\n\n\n\n\n\n\n<p>All of my Labs have been implemented and Configured on Real Cisco Nexus 7010 and 5K Devices.</p>\n\n\n\n\n\n\n\n<p>I would say it is just the <strong>beginning of my courses</strong> in this most robust Cisco Nexus Devices.</p>\n\n\n\n\n\n\n\n<p>I am pretty certain  that you will NOT get this kind of advanced course anywhere - that too at this <strong>unbelievable price ( Never Before !</strong> )<br></p>\n\n\n\n\n\n\n\n<p>Most of you must be working on DC environments where you will probably have Nexus Devices- But problem that we get is no experience on these critical devices. Now, you will get all commands , features and detailed explanation which will make you a <strong>Nexus Professional Engineer</strong>.</p>", 
    "end_date": null, 
    "title": "Learn Cisco Nexus Configuration and Implementation", 
    "price": "30.00", 
    "instructors": "Ashish Rana", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779842_763a_13.jpg", 
    "course_url": "https://www.udemy.com/cisco-nexus-configuration-implementation/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T09:11:26Z"
}