{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">An Essential Course For All System &amp; Network Administrators</strong>  </p>  <p style=\"\">  \t    This Network Technology and Security Fundamentals training course from Infinite Skills teaches you how to secure and protect information as it flows across an enterprise network. This course is designed for users that are working in or looking to move up in the field of Information Technology.  </p>  <p style=\"\">  \t<br style=\"\">  \t    You will start by reviewing the Open Systems Interconnect (OSI) model, then jump into learning the TCP/IP suite of protocols. The course will then cover transmission media and technologies. This video tutorial will also look at the devices that make up the network infrastructure, including firewalls, routers, Virtual Private Networks (VPNs), client systems, and virtual machines. Next, you will learn about wireless networks, devices, and security. Finally, the course will cover the various types of attacks on networks, including browsing attacks, information theft, and attacks on cell phones. <br style=\"\">  \t<br style=\"\">  \t    Once you have completed this computer based training course, you will be fully capable of securing and protecting an enterprise network. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Learning Network Technology and Security ", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307048_8c00_6.jpg", 
    "course_url": "https://www.udemy.com/network-security/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T18:26:56Z"
}