{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to my comprehensive course on Ethical Hacking! In this course, you will start as a <strong>beginner</strong> with no previous knowledge about penetration testing or hacking. The first thing you will learn is some <strong>basic information</strong> about ethical hacking and the different fields in penetration testing.<br></p>\n\n\n\n<p>This course is focused on the <strong>practical side of penetration</strong> testing without neglecting the theory behind each attack. Before jumping into penetration testing, you will first learn how to <strong>set up a lab and install needed software</strong> to practice penetration testing on your own machine. All the attacks explained in this course are launched against real devices in my lab.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>The course is structured in a way that will take you through the basics of linux, computer systems, networks and how devices communicate with each other. We will start by talking about how we can exploit these systems to carry out a number of powerful attacks. This course will take you <strong>from a beginner to a more advanced level -- </strong>by the time you finish, you will have knowledge about most penetration testing fields.</p>\n\n\n\n\n\n\n\n\n\n<p>The course is divided into four main sections:\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">1. Network Penetration Testing - </em>This section will teach you how to test the security of networks, both wired and wireless. First, you will learn how networks work, basic network terminology and how devices communicate with each other. Then it will branch into three sub sections:\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>·       <em class=\"redactor-inline-converted\">Pre-connection</em><strong>:</strong><em class=\"redactor-inline-converted\"> </em>in this section, we still don't know much about penetration testing -- all we have is a computer with a wireless card. You will learn how <strong>gather information</strong> about the networks and computers around you and launch a number of attacks without a password, such as controlling the connections around you (ie: <strong>deny/allow any device from connecting to any network</strong>). You will also learn how to <strong>create a fake access</strong> <strong>point,</strong> attract users to connect to it and capture any important information they enter.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>·       <em class=\"redactor-inline-converted\">Gaining Access</em>: Now that you have gathered information about the networks around you and found your target, you will learn how to crack the key and gain access to your target network. In this section you will learn a <strong>number of methods to crack WEP/WPA/WPA2 </strong>encryption.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>·       <em class=\"redactor-inline-converted\">Post Connection</em>: Now you have the key to your target network and you can connect to it. In this section you will learn a number of<strong> powerful attacks</strong> that can be launched against the network and connected clients. These attacks will allow you to gain <strong>access to any account accessed by any device</strong> connected to your network and <strong>read all the traffic used by these devices</strong> (images, videos, audio, passwords ...etc).\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">2. Gaining Access - </em>In this section you will learn two main approaches to <strong>gain full control over any computer system</strong>:\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>·       <em class=\"redactor-inline-converted\">Server Side Attacks:  </em>In this approach you will learn how to <strong>gain full access</strong> to computer systems <strong>without the need for user interaction</strong>. You will learn how to gather information about a target computer system such as its operating system, open ports, installed services and <strong>discover weaknesses and vulnerabilities</strong>. You will also learn how to <strong>exploit</strong> these weaknesses to gain full control over the target. Finally you will learn how to generate different types of <strong>reports</strong> for your discoveries.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>·       <em class=\"redactor-inline-converted\">Client Side Attacks - </em>If the target system does not contain any weaknesses then the only way to gain access to it is by interacting with the user. In this approach you will learn how to launch a number of powerful attacks to fool the target user and get them to install a backdoor on their device. This is done by <strong>creating fake updates</strong> and serving them to the user or by <strong>backdoornig downloaded</strong> <strong>files</strong> on the fly. You will also learn how to <strong>gather information about the target person</strong> and use <strong>social engineering</strong> to deliver a <strong>backdoor to them as an image or any other file type.</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">3. Post Exploitation - </em>In this section you will learn how to interact with the systems you compromised so far. You’ll learn <strong>how to access the file system (read/write/upload/execute)</strong>, <strong>maintain your access</strong>, spy on the target and even <strong>use the target computer as a pivot to hack other computer systems.</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">4. Web Application Penetration Testing - </em>In this section you will learn <strong>how websites work</strong>. Then you will learn how to <strong>gather information</strong> about your target website, such as website owner, server location, used technologies and much more. You will also learn how to <strong>discover and exploit a number of dangerous vulnerabilities such as SQL injections, XSS vulnerabilities</strong>, <strong>etc.</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>At the end of each section you will learn how to <strong>detect, prevent and secure your system and yourself from these attacks</strong>.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>All the attacks in this course are <strong>practical attacks</strong> that <strong>work against any computer device</strong>, ie: it does not matter if the device is a phone, tablet, laptop, etc. Each attack is explained in a simple way -- first you will <strong>learn the theory behind each attack and then you will learn how to carry out the attack using Kali Linux</strong>.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><strong>NOTE: This course is created for educational purposes only and all the attacks are launched in my own lab or against devices that I have permission to test.</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><strong>NOTE: This course is totally a product of Zaid Sabih and no other organization is associated with it or a certification exam. Although, you will receive a Course Completion Certification from Udemy, apart from that NO OTHER ORGANIZATION IS INVOLVED.</strong></p>", 
    "end_date": null, 
    "title": "Learn Ethical Hacking From Scratch", 
    "price": "40.00", 
    "instructors": "Zaid Sabih", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857010_8239_2.jpg", 
    "course_url": "https://www.udemy.com/learn-ethical-hacking-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T01:15:34Z"
}