{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong><em>LATEST:</em> Course Updated For July 2015</strong></p><p><strong>Facebook</strong> is, undoubtedly, the most popular social networking website with more than 500 million active users. Due to its popularity, many hackers (or should I say crackers?) are actively involved in hacking Facebook accounts of unsuspecting users.</p><p>This course is created based on a research to create an awareness about the vulnerabilities of Facebook accounts and other social media platforms to prevent yourself &amp; to be secure. Facebook is constantly improving its security systems based on several test conducted by Blue hat hackers and penetration testers. But there are some methods which Facebook it self can't able to help their users from being hacked.</p><p>We share our lives on Facebook. We share our birthdays and our anniversaries. We share our vacation plans and locations. We share the births of our sons and the deaths of our fathers. We divulge every aspect of our lives.</p><p><strong>But we sometimes forget who's watching!</strong></p><p>We use Facebook as a tool to connect, but there are those people who use that connectivity for malicious purposes. We reveal what others can use against us. They know when we're not home and for how long we're gone. They know the answers to our security questions. People can practically steal our identities—and that's just with the visible information we purposely give away through our public Facebook profile.</p><p>The scariest part is that as we get more comfortable with advances in technology, we actually become more susceptible to hacking. As if we haven't already done enough to aid hackers in their quest for our data by sharing publicly, those in the know can get into our emails and Facebook accounts to steal every other part of our lives that we intended to keep away from prying eyes.</p><p>In fact, you don't even have to be a <strong>professional hacker</strong> to get into someone's Facebook account. In fact, Facebook actually allows people to get into someone else's Facebook account without knowing their password. All you have to do is choose three friends to send a code to. You type in the three codes, and voilà—you're into the account. It's as easy as that.</p><p>In this course we are going to learn those security weaknesses.</p><p><strong>How to use this Course:</strong></p><p><em>This is based on a security research so we recommend you not to misuse the methods which is explained in the Courseware. <strong>The course contents are Provided only for Educational Purpose. </strong><b></b></em></p><p><em><strong></strong></em></p><p><em><strong></strong></em></p><p><strong>So...welcome to the adventure of hacking!</strong></p><p><strong>About this course:</strong></p><ul><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Constant support</em></li><li><em>Also you will get free, full access to our future courses</em></li></ul>", 
    "end_date": null, 
    "title": "Learn the Methods of Facebook hacking in Ethical Way", 
    "price": "20.00", 
    "instructors": "Inspirac technologies", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562264_f001_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-ethical-hacking-and-online-social-network-security/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T03:53:03Z"
}