{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>In this training course, certified Apple trainer and expert author Chris Tarnowieckyi teaches you how to set up, manage, and monitor the latest server software from Apple, OS X Mountain Lion. Chris breaks down complex topics into straightforward lessons that anyone can understand. This tutorial is designed specifically for those who have never previously configured or managed an OS X server. Working files are included, allowing you to follow along with the author throughout the lessons.<br style=\"\"><br style=\"\">You will begin by with installing the Server software on a computer. As you continue the course, Chris introduces you to the Server App and explains how to configure and use it to maintain your server. Later, you will master topics such as network services and directory services. You will also learn how to manage workgroups and client preferences, enrol and configure mobile devices, deploy Apps to mobile devices, and even set up Time Machine. Chris provides in-depth instruction on managing the mail, web, wiki, calendar, contact and message services. Finally, you will learn how to configure and deploy the NetInstall service.<br style=\"\"><br style=\"\">By the time you have completed this computer based training course on OS X Mountain Lion Server, you will be comfortable with the process of installing and managing a server and services for networks ranging from small home configurations to large corporate networks with hundreds of computers.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Mac OS X Mountain Lion Server Training Video", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33103_1cb1_11.jpg", 
    "course_url": "https://www.udemy.com/learning-mac-os-x-mountain-lion-server/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-19T13:33:59Z"
}