{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course has been intended to introduce you with basics of Boto3 and how you can take advantage of Boto3 in order to manage AWS Services.</p><p><strong class=\"redactor-inline-converted\">Boto3 is the latest AWS SDK for Python, which is \"not\" a replacement of old Boto SDK. </strong>There are some new features like <em class=\"redactor-inline-converted\">Clients, Resources, and Waiters,</em> which make it a must have tool to develop or administer AWS services.</p><p>This particular course covers basics of Python, Boto3 and AWS Core Services, which include configuration of Virtual servers, Object Storage, Block Storage, Load Balancer, Database and DNS management.</p><p><strong class=\"redactor-inline-converted\">The approach followed in this course is very practical and industry oriented. All the video lectures have an agenda at the beginning, followed by hands-on explanation of the concept and ended with a Quiz. </strong></p><p>All the quizzes are also well designed according to the material covered in each lecture</p><p>After taking this course, you'll find yourself more confidant in Boto3 and start working with Boto3 in less than 2 hours.</p><p>The biggest advantage of taking this course is the exposure to Boto3 functions. <strong>Unfortunately, there is no well defined online documentation available for Boto3 and you'll find no example in the official documentation itself. </strong><em>I have made an attempt to put all the elements together so that you don't need to look anywhere else when it comes to learning of Boto3.</em></p>", 
    "end_date": null, 
    "title": "Manage AWS Using Python: Core Services", 
    "price": "20.00", 
    "instructors": "Karan Brar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/845946_caae_2.jpg", 
    "course_url": "https://www.udemy.com/manage-aws-core-services-using-python-and-boto3/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-11T10:53:02Z"
}