{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t <strong><em>This course is for the benefit of everyone. If financial constraints prevent you from enrolling, simply send me a message explaining your situation and I will give you access to all of my courses for free.</em></strong>  </p>  <p>  \t   You are about to <strong>embark on an exciting journey</strong> learning about the information revolution and the incredible world of computers.  </p>  <p>  \t      This course is very practical and applicable. It focuses on teaching you <strong>skills you can use.</strong> These skills include not only specific hands-on skills, like &quot;right-clicking&quot; and taking &quot;screenshots,&quot; but also skills such as keeping yourself safe online, not texting while you&#039;re driving, and what to look for when buying computers (just to mention a very small fraction of the skills this course will teach you).  </p>  <p>  \t      This is a <strong>university level course</strong> designed to introduce individuals to the world of computers, so it is rich in its depth and breadth of content. I have taught this course for over a decade and have refined it to be incredibly amazing and awesome. You are going to love this course and it<strong> will forever change your life.</strong> You will gain skills in this course which you will use for the rest of your life and which will make your life easier. Knowing how to use computers is essential in our day-and-age. This course will give you the skills you need to use computers well.  </p>  <p>  \t      Presented with <strong>high-quality video lectures,</strong> this course will visually show you how to easily do everything with computers. This is just some of what you will learn in this course:  </p>  <ul>  \t<li>Learn the basic principles of hardware including circuits, coding schemes, binary, the five generations of computers, <strong>Moore&#039;s Law,</strong> IPOS, registers, cache, <strong>RAM</strong>, magnetic storage, optical storage, solid-state storage, ROM, BIOS, the motherboard, buses, and the CPU. </li>  \t<li>Learn how to operate a computer including a vast array of<strong> hands-on skills</strong> – just to mention a few for example: managing files, backing –up files, right clicking, taking screenshots, determining your computer’s properties, upgrading your computer, changing settings on your computer. </li>  \t<li>Learn how to use <strong>word processing</strong> software including the creation of a title page, document sections, headers and footers, styles, an automatically generated table of contents, the insertion of images, references, and the insertion of an automatically generated citation of works referenced. </li>  \t<li>Learn how to use <strong>spreadsheet software</strong> including formulas, functions, relative references, absolute references, mixed references, and the creation of a graph or chart. </li>  \t<li>Learn how to use <strong>video editing</strong> software including adding credits and transitions then publishing that video to a video hosting website such as YouTube. </li>  \t<li>Learn how to use <strong>databases</strong> including table creation, the setting of a primary key, the establishment of table relationships, the setting of referential integrity, and the creation and execution of a query. </li>  \t<li>Learn how to use presentation software to more <strong>effectively give presentations</strong>.</li>  \t<li>Learn to do some simple <strong>programing</strong> including designing, coding, testing, debugging, and running a program. </li>  \t<li>Learn about the world wide web including sending email, conducting searches , having familiarity with <strong>online educational resources</strong> such as Khan Academy, and having an awareness of online &quot;cloud computing&quot; tools such as Google Word Processing, Google Spreadsheets, and the many other online <strong>tools offered by Google.</strong></li>  \t<li>Learn about application software and system software including <strong>operating systems,</strong> utilities, and drivers. </li>  \t<li>Learn about <strong>networks</strong> including architecture, topology, firewalls, security, wireless networks, and securing wireless networks. </li>  \t<li>Learn about <strong>the Internet,</strong> the World Wide Web, censorship, the digital divide, net neutrality, differing legal jurisdictions, <strong>website creation,</strong> multimedia, social media, and eCommerce. </li>  \t<li>Learn about <strong>information systems,</strong> systems development, and the systems development life cycle. </li>  \t<li>Learn about <strong>program development,</strong> programming languages, and the program development life cycle. </li>  \t<li>Learn about databases including table creation, primary keys, relationships, referential integrity, queries, and structured query language. </li>  \t<li>Learn about <strong>privacy and security</strong> issues related to computers. </li>  \t<li>Learn about robots and artificial intelligence including the Turing test. </li>  \t<li>Learn about <strong>intellectual property</strong> including patents, trademarks, copyrights, and the creative commons. </li>  \t<li>Learn about <strong>ethics</strong> and ethical issues relating to the use of technology. </li>  \t<li>Learn about health ramifications of using computers including repetitive stress injury, carpal tunnel syndrome, and <strong>ergonomics</strong>. </li>  \t<li>Learn about <strong>e-Waste</strong> and other environmental concerns related to technology. </li>  </ul>  <p>  \t <strong>Lifetime access to this course</strong> allows you to easily review material and continue learning new material.  </p>  <p>  \t      After taking this course, <strong>you will have a thorough understanding of how to use computers well.</strong>  </p>  <p>  \t      From beginners, to advanced users, this course is perfect for all ability levels. This course will add value to everyone&#039;s skillset.  </p>  <p>  \t      This course is for the benefit of everyone. <strong>If financial constraints prevent you from enrolling, </strong>simply send me a message explaining your situation and I will give you access to <strong>all of my courses for free.</strong>  </p>", 
    "end_date": null, 
    "title": "Master Computers - From Beginner to Expert in One Week", 
    "price": "20.00", 
    "instructors": "Todd McLeod", 
    "commitment": "39.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/76838_e5b4_6.jpg", 
    "course_url": "https://www.udemy.com/computers/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-10T21:29:01Z"
}