{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tYou always wondered how MPLS works? How it is configured? This crash course answers all those questions in less than 140 minutes and after finishing that you will be able to configure your own network!  </p>  <p>  \t  Here is the main topics for this crash course:  </p>  <ul style=\"\">  \t<li><span><strong style=\"\">A brief overview of MPLS:</strong> MPLS is not a fancy technology! It is a must and you need to know the basics to be able to run it. </span></li>  \t<li><span><strong style=\"\">Creating a topology on GNS3:</strong> God bless you GNS3 developers! We have a nice tool for free and we can emulate routers and change the topology much faster than real gear. And of course we can have it on our laptop and (much to peoples surprise) practice in our commuting time to work and home! </span></li>  \t<li><span><strong style=\"\">Configuring MPLS:</strong> Actually you need to configure LDP and interfaces which you assign for label switching before anything. And it is so easy! Only one command and you put that both in global configuration and interface configuration. What about LDP itself? Mostly the defaults would be quite OK but I prefer to have control on router-id and some other attributes. </span></li>  \t<li><span><strong style=\"\">MPLS Forwarding Table: </strong>This is a very important table and we use it to check different LSPs and see what labels are assigned for what prefixes and routes. </span></li>  \t<li><span><strong style=\"\">VRFs: </strong>These are what we use to virtualize our routers. Each VRF is assigned to a customer and a route distinguisher is used in control plane to keep customer&#039;s routes separate from each other. We have route targets and they do not need to be the same as route distinguishers. They are used to determine which destination VRFs we want to export and from which VRF we want to import routes. So we can let different customers to talk to each other (e.g. in merge or acquisitions). </span></li>  \t<li><span><strong style=\"\">Configuring PE-CE connection: </strong>This is a very important section in that we configure a pre-determined protocol and adjacency to receive customer routes, redistribute it in their respective VRF table and send it to the other customer branches so that they can have reachability over our network. In this section I examine BGP, RIP, EIGRP and OSPF for this connection and discuss the differences.</span></li>  \t<li><span><strong style=\"\">VRF Lite:</strong> VRF without MPLS is called VRF Lite and it can be configured on one or more routers (although it is not wise to configure it on more than one router). I give you a very practical example here. </span></li>  \t<li><span><strong style=\"\">Troubleshooting MPLS:</strong> In this section I follow a frame from source to destination and examine labels and paths.</span></li>  </ul>", 
    "end_date": null, 
    "title": "MPLS, Your One Big Score!", 
    "price": "20.00", 
    "instructors": "Mohammad Imani", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353196_7e75_3.jpg", 
    "course_url": "https://www.udemy.com/mpls-your-one-big-shot/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T19:39:50Z"
}