{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Whether you are a certified Engineer, a working professional or an aspiring student who just wants to learn and implement networking scenarios, then this course is the place for you.</p><p><strong>This course will augment your understanding and concepts related to networking technologies to help you become a better Network Engineer.\n</strong></p><p>Learn about IOU (IOS on Unix)<br></p><p>Advance Routing topics</p><p>Practical Scenarios</p><p>Proof of concepts</p><p>CISCO is the leading Networking\nequipment provider with a large product portfolio ranging from small\nEnterprises to large Data Centers. Once you get the foundations right through CCNA which I strongly recommend, you need to advance your knowledge to design, implement and troubleshoot real life networks. This course has been designed just for that purpose. No lengthy theories, just straight to work<strong>.</strong><strong> </strong></p><p>This course has been <strong>designed for\nbeginner / intermediate level Networking Engineers</strong>. It will take you through the some of the available options that you can use to <strong>build your own large scale networks on your PC or laptop</strong> and practice with the commands to manage and troubleshoot them.This course will also help you in your journey towards <strong>multi-vendor environment implementations</strong> and their correlation so that no matter what equipment is presented, you feel just like home. Let's become better.</p>", 
    "end_date": null, 
    "title": "Networking Scenarios with CISCO and GNS3", 
    "price": "20.00", 
    "instructors": "Ahmad Nadeem, Mehreen Kamran", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/771432_d563.jpg", 
    "course_url": "https://www.udemy.com/networking-scenarios-with-cisco-and-gns3/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-23T08:16:54Z"
}