{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Hi and welcome to our Network hacking and security course.</p><p>In this course, we will teach you how wired and wireless network attacks are performed in a simulated/test environment in an ethical way. This course helps the network security professional to mitigate these attack using the recommended solution at the end of each module.</p><p>You will be encouraged to practice what you have learned in a simulated environment via our practice \"Audio Visual Exercise\" session.<br></p><p>We have designed this course to enable those aspiring to enter the information security field to learn core concepts on network hacking in order to safeguard a network infrastructure. By the end of this course you will be familiar with how various types of wired and wireless network hacks are performed and you will be fully equipped to test and safegaurd a network infrastructure against various real time attack vectors.<br></p><p>This course has been specifically designed by a team of information security researchers who are acknowledged experts in their field.<br></p><p>This course has been designed to accelerate your learning process through the use of creative animations and easy to understand voice over narratives. Complex hacking concepts have been broken down into easy to understand modules.<br></p><p>Together, our team will walk you through the entire learning process step by step.<br></p><p>This course is perfect for existing network architects, network administrators, network security professionals as well as anybody who is passionate about developing their skills in the field of internet security. No prior training is required to take this course as we will start with the basics. We welcome anyone with a thirst for learning. <br></p><p>We look forward to having you join us. In the meantime, please feel free to take a look at our demo tutorial and exercise before you purchase the full course.</p>", 
    "end_date": null, 
    "title": "Network Hacking and Security", 
    "price": "50.00", 
    "instructors": "infySEC UK", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694874_ed30_2.jpg", 
    "course_url": "https://www.udemy.com/network-hacking/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-11T15:42:25Z"
}