{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Updated on 13 Jan 16- Added more EIGRP Labs and it's for YOU only</strong></p><p>This course is going to tell you the ways you can improve your skills while working or operating Cisco Routers and Switches. It lists most of the Human errors or mistakes that people have made in their careers.<br></p><p>Students will become more aware about very small mistakes which can cause outages in network environment.</p><p>I have included <strong>GNS3 Real time sessions</strong> in all chapters so to make things very much clear.</p><p>This course has been divided in to <strong>9 lectures + 10 Bonus lectures</strong>- Students who have basic understanding will be able to learn a lot from this course.</p><p>In case you want to enhance your career and improve your troubleshooting skills then this is definitely for you.</p><p>This course will help you reduce outages or loss of connectivity while you work on devices. </p><p>Here is some of the <strong>feedback</strong> my previous courses received</p><p><strong>Jason Martinez -Troubleshooting Internet Connection Problems</strong></p><p>Ashish gives a good outline of how to troubleshoot common\n problems users experience. A good intro of problem types and error \ndescriptions --provides a logical steps of how to detect the issue and \nhow to resolve them. Highly recommend anyone who uses the net to take \nthis course and get a basic troubleshooting guide to solve simple \nissues. Why pay a PC Technician when you can resolve the issue \nyourself?!  Double thumbs up!\n\nThanks Ashish!</p><p><strong>Ernst Chan</strong> - Great Course! Solid Troubleshooting Skills for Home &amp; SOHO Networks.</p><p><strong>Petru Lucian Giurca</strong><strong></strong>  -It was interesting and educated especially if you are a beginner with the internet. Thank you Sir!<br></p><p><em><strong>Cesar  De Haro-</strong></em><strong>This is a great course</strong></p><p>Currently I am studying for the CCNA and this is a very useful course for it, the instructor is an expert. He is providing very clear explications about the covered topics.</p><p><strong>Thomas Meugniot</strong> - <strong>Great</strong> -This was very helpful in understanding RCA in IT infrastructure.</p><p><br></p>", 
    "end_date": null, 
    "title": "Never-To-Do mistakes in Networks for CCNA CCNP students", 
    "price": "20.00", 
    "instructors": "Ashish Rana", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677814_3d00_2.jpg", 
    "course_url": "https://www.udemy.com/never-to-do-mistakes-in-networks-for-ccna-ccnp-students/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T05:02:26Z"
}