{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Learn to install, configure and tweak Nginx to create secure, high performance web servers from scratch.</p><p><strong>Build a strong foundation in Nginx with this practical course suited to both beginners and the more experienced.</strong></p><ul><li>Learn to customise the Nginx installation</li><li><span></span>Configure Nginx as a web server</li><li><span></span>Install &amp; configure a server-side programming language as an Nginx backend</li><li><span></span>Learn to tweak Nginx for optimal performance</li><li><span></span>Secure Nginx with some security best practises</li></ul><p><strong><br></strong></p><p><strong>An invaluable skill for any techie or developer in the web industry</strong><br></p><p>Nginx is the fastest growing and most popular web server for a reason, so understanding it will be an invaluable skill to anyone working in the web industry, specially network admins &amp; web developers.</p><p>This course will provide a very practical and concise approach to learning Nginx and will give you a solid base to immediately start creating secure, high performance web servers.</p><p><strong>Content and Overview</strong></p><p>With 24 concise and practical lectures, this course aims to teach a solid foundational understanding of Nginx and is suitable for anyone with a basic understanding of networking and the linux command line interface.</p><p>The course starts by looking at the differences between Nginx and Apache for those with Apache experience and then explains the different ways of installing Nginx, customsing your install, and configuring Nginx as a service.</p><p>The installation section also covers updating Nginx without downtime and adding/removing modules.</p><p>The bulk of the course is then focussed on configuring Nginx as a web server, including connecting it to a PHP backend and configuring some of Nginx's best features, such as Gzipping and GeoIP.</p><p>The final section will go over securing the server and the user via SSL and other security best practices.</p><p>Upon completion of this course you will have the practical skills to immediately start building secure, high performance web servers or improve and better understand existing hosting solutions you might work with.</p><p>This course is to the point and everything is demonstrated in the most simple, yet practical ways.</p><p>We do not focus on the theory, but get straight to installing, configuring and learning!</p>", 
    "end_date": null, 
    "title": "Nginx Fundamentals: High Performance Servers from Scratch", 
    "price": "35.00", 
    "instructors": "Stack Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619222_0b73_5.jpg", 
    "course_url": "https://www.udemy.com/nginx-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T13:28:02Z"
}