{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>What is this course about?</strong><br></p><p>Nmap: Network Scanning Basics to Advanced Techniques covers how to use one of the most powerful and flexible network scanners available.  It is the scanner that other scanners are measured against.  This course will start off with the basics of network scanning with Nmap and move into how you can use it safely and effectively in your network.  We will use practical examples and demonstrations to show how you can use Nmap right now!</p><p><strong>Some of the topics include:</strong></p><ul><li>Getting and installing Nmap</li><li>Port scanning basics with Nmap</li><li>Reading, analyzing and saving scan output</li><li>Types of Nmap port scans and when to use them</li><li>Under the hood of Nmap and how it works</li><li>Host discovery scanning</li><li>Operating system discovery</li><li>Service detection scans</li><li>Safe scanning techniques</li><li>Performance and tuning considerations</li><li>Nmap Scripting Engine</li></ul><p>When you complete this course, you will have gone from the basics of Nmap to how to customize your scans to solve some of the different problems you may be facing with your network.</p><p><strong>Why should you take the course?</strong><br></p><p>This course is based on real experiences using Nmap in security tests on a huge variety of networks.  I've been using Nmap for years as a systems administrator and now as penetration tester.  I am constantly assessing networks and trying to find the hosts and systems that in networks that I've never seen before.  I may have a week to go through a network with the possibility of tens of thousands of hosts and no documentation available to me.  Because of this, I've had to learn how to get the most out of Nmap and do so in a way that does not disrupt my clients' networks.  This is the experience that I am sharing with you in this course!</p>", 
    "end_date": null, 
    "title": "Nmap: Network Scanning Basics to Advanced Techniques", 
    "price": "25.00", 
    "instructors": "Jason Wood", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/723508_8fcc_5.jpg", 
    "course_url": "https://www.udemy.com/nmap-scan/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T04:49:16Z"
}