{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t   This course is several hours long and will cover OSPF at great lengths. I will explain the inner workings of this highly scalable and complexed protocol.</p><p><strong>DISCLAIMER:   </strong><strong>Please note that the simulators/emulators used in this course are not part of the course. It is the students responsibility to have these to practice with. The Cisco Packet Tracer and/or VIRAL (Virtual Internet Routing Lab) are Cisco proprietary software and can only be obtained through Cisco. It is up to each student to obtain the simulator/emulator of their choice to study along with this course.</strong><br></p>\n\n<p>  \t   Students will get a thorough understanding of OSPF and how we would implement it in a real world environment.  </p>\n\n<p>  \t   We will discuss the following concepts OSPF terminology; process ID’s, LSA, DBD, LDB’s and much more. We will be configuring OSPF in a point-to-point and broadcast type of network and understand the differences between them. Analyze the election process of DR and BDR using loopback addresses, priority numbers or putting in the router id manually.  </p>\n\n<p>  \t   Once you get an understanding of how OSPF works and it’s configurations we will then go into explaining and creating multiple area OSPF and OSPFV3 and analyze them as well.  </p>\n\n<p>  \t   This is a lecture based course using the Touch-IT Technology Smart board, which will make learning very interactive and engaging. Hands on labs will be used to drill down the concepts learned in each lecture using Cisco’s Packet Tracer.  </p>\n\n<p>  \t   My method will make you feel like you are sitting in a classroom environment and give the most needed hands on experience!  </p>\n\n<p>  \t   Handouts will be available to facilitate learning and practice.  </p>\n\n<p>  \t   This course will help the student become familiar with OSPF routing using various methods and how to implement them in your environment…but it will also help in preparing for any networking certification or Computer Science Degree; not to mention the fact that for those already in the field, it will further improve routing decisions in their particular networks.  </p>", 
    "end_date": null, 
    "title": "OSPF Breakdown!", 
    "price": "25.00", 
    "instructors": "Lazaro Diaz", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236710_6866_10.jpg", 
    "course_url": "https://www.udemy.com/ospf-breakdown/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-03T21:43:19Z"
}