{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Don't leave your training to chance.  Learn from a trained University instructor and Industry professional.  This course introduces <strong class=\"redactor-inline-converted\">Python fundamentals </strong>as needed to control networks presented in layman's terms at an introductory level.   After the fundamentals work through <strong class=\"redactor-inline-converted\">3 Exciting and Challenging Python </strong> projects with me, this will cement all the basic programming concepts and skills needed to do basic network programming in Python<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">***Please be aware although challenging, this course is for <em class=\"redactor-inline-converted\">beginning programmers</em> and although not absolutely required it assumes that you have some networking knowledge.***</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">After this course the: </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Non Network Engineer</em></strong>- will learn basic Python Programming and how to read write and do basic configurations to Networking equipment such as Routers and Switches. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Network Engineer</em></strong>- Will  learn how to read write and configure Routers and Switches using Python, your New Python programming skills coupled with your networking skills as found in CCNA will allow you to extend the read write and configure concepts and skills learned in this course to automate networking tasks and troubleshooting with Python.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Get the edge, with this<strong class=\"redactor-inline-converted\"> hands on </strong>course!  3 major programming projects and more for you to follow along! With <strong class=\"redactor-inline-converted\">Python Programming for Network Engineers</strong>. Want to harness the power of <strong class=\"redactor-inline-converted\">Python, to configure multiple Routers automatically? </strong>This will put you on top. I show you here, nothing is better than this anywhere period! I have 20 years engineering experience, I teach network engineering and programming at University level now for a living, I can teach you to be a star.  Start learning only the Python fundamentals that you need for networks.  Don't waste your time with some computer software guru babbling about weird stuff. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p> I know how to focus Python for Network Engineers and I know how to teach it, follow me and I will take you to the top!  Because this keeps Python simple anyone can learn introduction to Python with this course.  Because networks are so important in our modern world non network engineers will  benefit from the understanding they gain in this course by working through the projects.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This is a new course, at a low introductory cost, I believe No value like this is available anywhere in the world!  However I am aware the course is new, so I will be constantly working out issues over the next few weeks.   I am adding and changing the material as needed.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>All software is free nothing else is needed follow me here to become a star!  I show you <strong class=\"redactor-inline-converted\">Python fundamentals</strong> only as related to Network Engineers, Don't waste your time with nonsense.  I keep it simple, on windows, learn the fundamentals on windows, then download GNS3, free and control routers like a God with Python!!!!  I show you in the most simple possible way to establish connection to GNS3 with the host computer, don't like simple? Wanna reach for the stars I added an extra section and give you super power. I explain virtual networks like nobody every wanted to know.  Come with me, folllow this course from start to finish and you will control routers with Python like a star!</p>\n\n\n\n\n\n\n\n\n\n<p> Here in Seattle the University students that I train routinely land IT positions at Cisco, Microsoft, Costco, and College IT departments. <br></p>", 
    "end_date": null, 
    "title": "Python Programming For Network Engineers ", 
    "price": "20.00", 
    "instructors": "Andrew Schlegel", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688598_559b_2.jpg", 
    "course_url": "https://www.udemy.com/python-programming-for-network-engineers/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T03:29:49Z"
}