{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Bem-vindo a Redes de <strong>TI Fundamentos: CompTIA Network + 2015</strong> de LearnSmart.</p><p>A Rede + certificação pela CompTIA é uma certificação internacional e independente de fornecedor que tenha sido aprovada e reconhecida pelos fabricantes da indústria de computação e organizações. Este curso fornece conhecimento fundamental dos princípios, técnicas e ferramentas necessárias para preparar com êxito para o exame N10-006.</p><p>Isso também se qualifica como unidades de educação continuada (CEUs). Se você estiver a fim de renovação, você pode ganhar CEUs através desta série e cursos adicionais. Por favor, veja as opções de rede + Continuing Education CompTIA para uma listagem completa dos cursos. Com este curso você será capaz de reivindicar 24,5 CEUs.</p><p>Neste curso, você vai aprender os serviços de infra-estrutura de rede para o exame de certificação CompTIA Network Plus. Os temas que serão abordados incluem: TCP / IP, Serviços de Infraestrutura de Rede, de solução de problemas Networks, LAN Infra-estruturas, conceitos avançados de rede e muito mais. Estes cursos são combinados com uma variedade de demos e questionários que dão um mundo real olhar para alguns dos conceitos que serão discutidos.</p><p>As seções abaixo indicados estão podem ser feitos em qualquer ordem, como uma revisão de um determinado conceito ou exame de domínio. No entanto, se você está apenas se familiarizar com sistemas operacionais de PC e rede básica, é recomendável que você exibir os cursos sequencialmente.</p><p><strong>Visão geral do curso:</strong></p><p>Como um Certified Network + CompTIA técnico de que você precisa estar ciente de vários tipos de cabos e conectores, suas características, capacidades e limitações. Você também precisa entender vários conectores que estão envolvidos. Este curso visa preparar o aluno para a certificação Network +. Os alunos irão dar uma olhada em padrões de rede e as organizações que os criam, bem como a importância da normalização. Nós emparelhado com este curso demos que vai ajudar a dar um exemplo visual dos conceitos que vai ser falado.</p><p><strong>Composição do curso:</strong></p><p>Seção 1: No questionário de pré-avaliação você vai enfrentar perguntas de todas as seções deste Network + Certificação de treinamento. Teste o seu conhecimento atual e conhecer seus pontos fortes e fracos.</p><p><strong>Seções 2</strong>: Entenda como Transmission Control Protocol / Internet Protocol é um conjunto de protocolos padrão da indústria nonproprietary que fornece comunicações em redes que suportam vários sistemas operacionais e tipos de hardware. Aprofunde-se a definição de \"suite\" de descobrir que existem vários protocolos, bem como ferramentas, que compõem TCP / IP. Como um técnico de rede, você precisa estar familiarizado com todos estes.</p><p><strong>Seção 3</strong>: Serviços de Infraestrutura de Rede Foco, olhando para DHCP e como ele lida com a atribuição automática de endereços IP e DNS fornece resolução de nomes.</p><p><strong>Secção 4</strong>: Reveja a camada diferente (1-3) dispositivos de rede e entender como eles são dispositivos que permitem a interligação entre os nós da rede. Nesta seção aprender temas sobre a importância do modelo de referência OSI e classificações camada do dispositivo. Veja as demos que dão um mundo real olhar para vários dos conceitos que serão discutidos.</p><p><strong>Seção 5</strong>: Dê uma olhada mais de perto os padrões de rede e as organizações que os criam, bem como a importância da normalização e estar ciente destas várias tipos de cabos, suas características, capacidades, tipos de limitações, e conectores.</p><p><strong>Secção 6</strong>: Uma rede de área ampla (WAN) é uma rede que se estende por distâncias geográficas maiores e conecta várias redes locais (LANs) em conjunto, utilizando linhas de comunicação de alta velocidade. Assistir a uma variedade de demos que dão exemplos do mundo real dos tópicos que serão discutidos.</p><p><strong>Secção 7</strong>: O monitoramento contínuo da rede é crucial para assegurar a contínua eficácia das operações. Esta seção destina-se a ajudá-lo a responder as seguintes perguntas: Quais são algumas das coisas que devemos saber? Por que devemos monitorar? O que deveríamos estar procurando? E, quais ferramentas estão à nossa disposição nesta área?</p><p><strong>Secção 8</strong>: Segurança de rede é importante, independentemente do tamanho da organização ou do tipo de negócio. Parte da tecnologia da informação é segurança da informação; é dever do pessoal de TI para garantir que os ativos corporativos, como os dados da empresa, sistemas e serviços são seguros. Aprenda a identificar ameaças e vulnerabilidades, técnicas de proteção e como implementá-las, e incidentes de segurança manipulação.</p><p><strong>Seção 9</strong>: Dê uma olhada em profundidade no tópicos que incluem a terminologia de rede, vários tipos de estilos de rede, modelos de rede e topologia. Esta secção vai concluir, cobrindo os vários processos e documentação que é usada para garantir uma organização continua a funcionar de forma ordenada, e irá abranger as diversas práticas de segurança que irão ajudá-lo quando se trata de dispositivos de rede e tecnologia.</p><p><strong>Seções 10</strong>: Resolução de problemas é uma parte integrante das tarefas diárias do técnico rede. Examine os vários métodos e ferramentas que você vai usar quando você encontrar problemas relacionados à rede e aprender sobre os diferentes métodos que são usados na identificação e resolução de problemas, bem como as várias ferramentas que você terá à sua disposição para combater os diferentes tipos de questões que surgem em ambientes de hoje.</p><p><strong>Seções 11</strong>: Olhe para o que é preciso para construir uma rede de área local quando se trata de todas as conexões físicas que são necessárias. Conhecer os princípios básicos de instalação física de uma rede local, a conexão da LAN para a rede de área ampla e discutir responsabilidades nessa área, e as melhores práticas a seguir, se você encontrar-se a construção de redes locais a partir do zero.</p><p><strong>Secções 12</strong>: As redes de hoje são diferentes do que as redes do passado e incluem tecnologias que não estavam presentes tão pouco quanto há dez anos. Como as mudanças da indústria, técnicos de rede tem de se adaptar e isso e expandir o seu conhecimento para incluir novas tecnologias.</p><p>O conteúdo deste curso vem de <strong>CompTIA Network + (N10-006) temas de certificação </strong>exame.</p>", 
    "end_date": null, 
    "title": "Redes de TI básico: CompTIA Network + 2015 (BP)", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/591372_ad18.jpg", 
    "course_url": "https://www.udemy.com/redes-de-ti-basico-comptia-network-2015-bp/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-23T23:57:43Z"
}