{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Hey SAP Security wannabes,</strong></p>\n\n<p>Stop spending your time on old-school “SAP Security” trainings! Of course, </p>\n\n\n\n<p>segregation of duties and access control are important but we are in 2016 </p>\n\n\n\n<p>now! All the top consulting companies now offer <strong>SAP Cyber Security</strong> services </p>\n\n\n\n<p>and CISOs from Fortune 2000 companies want to know more about REAL </p>\n\n\n\n<p>SAP Security, how hackers can compromise their systems and how to secure </p>\n\n\n\n<p>them.</p>\n\n\n\n<p>Cyber-Security market is estimated 70 billion dollars and expected to grow 170 </p>\n\n\n\n<p>billion dollars by 2020. Taking into account that SAP is one of the most important </p>\n\n\n\n<p>systems, the SAP Cyber-security will be a big part of this pie. </p>\n\n\n\n<p>Before this course, this information was only available for a few companies. Now </p>\n\n\n\n<p>you can learn it from one of the world-known experts in this area and extend your </p>\n\n\n\n<p>knowledge in IT or SAP and be a much more competitive employee in the market.</p>\n\n\n\n<p><strong>For IT Security guys:</strong></p>\n\n\n\n<p>If you have no idea what SAP is but want to know why it's an important topic, this </p>\n\n\n\n<p>course is for you! Here are some noteworthy things:</p>\n\n\n\n<p>Interest in SAP security is growing exponentially and the numerous </p>\n\n\n\n<p>attacks play a significant role in driving this interest. Take, for example, </p>\n\n\n\n<p>the recent breaches revealed in SAP system of a government contractor </p>\n\n\n\n<p>USIS. SAP systems and business-critical applications store the most critical </p>\n\n\n\n<p>corporate data that can at some point be used for espionage, sabotage or </p>\n\n\n\n<p>fraudulent purposes.</p>\n\n\n\n<p>Analysts from different firms such as Gartner, IDC, 451Research, KuppingerCole and </p>\n\n\n\n<p>Qoucirca agreed on the significant importance of ERP security tests and </p>\n\n\n\n<p>lack of this functionality in traditional tools. </p>\n\n\n\n<p>Top consulting companies have already included ERP security services in </p>\n\n\n\n<p>their portfolio. </p>\n\n\n\n<p>But are you prepared for changes and do you have qualified expertise to </p>\n\n\n\n<p>address growing ERP Security market?</p>\n\n<p><br></p>\n\n\n\n<p><strong>Agenda</strong></p>\n\n\n\n<p>I will start with the history of SAP Cyber Security and why and how SAP Cyber </p>\n\n\n\n<p>security differs from IT Security. Then I will show the most critical risks for </p>\n\n\n\n<p>organizations. After that we will be able to understand details of all the SAP </p>\n\n\n\n<p>Systems such as ABAP or HANA and their vulnerabilities. To prove the importance, </p>\n\n\n\n<p>I will also show examples of the real attacks on SAP Systems. Finally, we will </p>\n\n\n\n<p>spend the rest of the time on learning how to secure SAP Systems from different </p>\n\n\n\n<p>angles from secure coding and SoD to vulnerability management and threat </p>\n\n\n\n<p>detection.</p>", 
    "end_date": null, 
    "title": "SAP Cyber Security", 
    "price": "30.00", 
    "instructors": "Alexander Polyakov", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/762560_eab7_5.jpg", 
    "course_url": "https://www.udemy.com/sap-cyber-security-training/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-14T21:05:45Z"
}