{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Are you an information security professional who frequently needs to get approval from business executives for new security measures? This 1-hour “Short and Sweet\" course takes away the guesswork and gives you tools you can start using today.</p><p><strong>Learn to speak business executives' language and get easier approval for your security investments.</strong></p><p>Pitching a security investment can seem difficult because it's not always a clear-cut process, but learning to sell to business executives <em>in their own language</em> is a key to reframing security as <strong><em>a long-term positive investment opportunity</em></strong>. </p><p><em>In less than 2 hours, this Short and Sweet course will give you solid practice and help you achieve steady improvement in your pitches, without a lot of filler. </em>We'll discuss the potential for finding common ground, why sales skills are so important, and how to transform your security investment proposals from risk-focused to business-focused with a few simple tweaks. We'll also talk about preparing for an in-person pitch, and about selling to the business line - selling to users - after your pitch gets approved.</p><p>At the end of the course, you'll be better equipped to have effective discussions with business leaders about potential security investments you need and want to make inside your company.</p><p>That's a great trade for 2 hours of your time!</p><p><strong>Please note: </strong><em>This course is designed to get you productive FAST. This course assumes you already are familiar with information security basics and, ideally, are in an information security or IT role at your company. </em><strong><em>If you aren't familiar with information security basics, please seek out another course </em></strong><em>to learn those skills. </em></p><p>But if you're already familiar with information security and want tools to understand business language and use it i<em>n the context of security</em>, <strong><em>this course IS for you and I hope you'll enroll.</em></strong></p><p><span style=\"\">My goal is to make this course the easiest path to more effective information security investment</span><span style=\"\"> </span><span style=\"\">pitches. </span><span style=\"\">Please let me know if anything in the course could be clearer, and I'll be happy to help you. It also will help me improve the course.</span><br></p><p>If you're ready to learn more and sign up for the course, <strong><em>go ahead and hit that Enroll button - Udemy offers a 30-day refund guarantee, so there's no risk to you!</em></strong></p>", 
    "end_date": null, 
    "title": "Short and Sweet: Selling for Security Professionals", 
    "price": 0, 
    "instructors": "Stephanie Losi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595620_8b85_2.jpg", 
    "course_url": "https://www.udemy.com/short-and-sweet-selling-for-security-professionals/", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T04:16:59Z"
}