{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Course last updated 2016-04-01</p>\n\n<p>Now more than 1000 students!<br><br>No Powerpoints, no animations. With just a pen I will teach You how IP subnetting works. From binary math to subnet sizes and exam-like questions to verify Your achieved knowledge!<br><br>Remember! 30 days <strong>money-back guarantee</strong> with no questions asked. I want you to be satisfied with my course. No Happy - No Pay!</p>\n\n\n\n\n\n<p><br>Also, please take advantage of the <strong>free previews</strong> to see way you will get.<br><br>After taking this course, which takes less than one hour, you will never again need a subnet calculator. Subnetting can be done without any online subnetting calculator, all you need is a pen and paper and you will be able to create your own cheat sheet. What is my subnet mask? How many usable addresses in my network? What is the broadcast address? All of these questions will be easy to answer after enrolling this course!<br></p>\n\n\n\n\n\n<p>After each lesson there is a quiz that verifies the knowledge you just achieved!</p>\n\n\n\n\n\n<p><br>This course is good for anyone that needs to fully understand subnetting, including CCNA students!<br><br><strong>Updates: </strong><br>2016-01-03 Re-recorded lecture about 24 bits example. Free preview!</p>\n\n\n\n<p>2016-04-01 New promo-video<br></p>", 
    "end_date": null, 
    "title": "SUBNETTING for CCNA students", 
    "price": "20.00", 
    "instructors": "Jimmy Larsson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668888_9262_10.jpg", 
    "course_url": "https://www.udemy.com/subnetting-in-less-than-one-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T16:31:05Z"
}