{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Are you looking for a course to teach you the fundamentals of subnetting? Have you tried to learn subnetting but just ended up confused? \n\n  Do you know how to subnet but find it painful to do? Are you preparing for the CCNA? If so, this course is for you!<br></p>\n\n<p><strong class=\"redactor-inline-converted\">Learn to Subnet Easily in Half an Hour</strong><br></p>\n\n<p>Subnetting is an important topic for the CCNA and knowing how to do it quickly is essential. This course teaches both the traditional way of subnetting as well as a quick and easy approach that you can do in your head in seconds. The whole course, including doing the examples, takes less than an hour to complete.</p>\n\n<p><strong class=\"redactor-inline-converted\">Learn by Doing</strong><br></p>\n\n\n\n\n\n<p>This subnetting course is packed with concise illustrations to help you learn how to subnet properly. Throughout the course, an included \"<strong>Subnetting Concepts\"</strong> spreadsheet is used to illustrate foundational concepts liked numbering systems, converting between binary and decimal, CIDR notation, and how to subnet properly. <strong>The included spreadsheet can be used to create unlimited practice problems and also illustrates each step of the subnetting process so that you can verify each step of the process.</strong></p>\n\n<p>Additionally, several videos of handwritten examples are included.</p>\n\n<p>Throughout the course we will cover the following topics:</p>\n\n<ul><li>Numbering systems</li><li>Converting Binary to Decimal</li><li>Converting Decimal to Binary</li><li>Format of IP Addresses</li><li>Subnet Masks</li><li>CIDR Notation</li><li>Traditional approach to subnetting</li><li>A quick and easy way to subnet</li></ul>\n\n<p><br></p>\n\n<p>I'm a <strong class=\"redactor-inline-converted\">professional instructor</strong> who has helped hundreds of students learn to subnet quickly and effectively. Come and enjoy the class as you learn how easy it is to subnet.<br></p>", 
    "end_date": null, 
    "title": "Subnetting Made Easy", 
    "price": "20.00", 
    "instructors": "Tom Meservy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854784_08cb.jpg", 
    "course_url": "https://www.udemy.com/subnetting-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T07:35:04Z"
}