{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tWelcome to the Surviving Digital Forensics series. This series is focused on helping you become a better computer forensic examiner by teaching core computer forensic skills - all in about one hour. In this class examine how to use Windows Shellbag records to help prove file use and knowledge.  Shellbag records are created by certain user activity and can be used to show where a user has navigated to on a computer system and when they did so.  Very powerful evidence!  </p>  <p>  \tAs with previous SDF classes you will learn by doing. The class begins with a brief overview of the issue at hand. Then we set up our forensic systems and off we go. Learning is hands on and we will use low cost and no cost computer forensic tools to do so.  </p>  <p>  \tExpert and novice computer forensic examiners alike will gain from this class. Since we are doing it the SDF way we are going to teach you real computer forensic skills that you can apply using our method or customize to meet your needs. You will learn how you can use freely available forensic tools, all GUI based, to extract and analyze Windows Shellbag evidence.  </p>  <p>  \tClass Outline  </p>  <p>  \t1. Introduction and Welcome to the SDF series  </p>  <p>  \t2. Getting the most out of the class  </p>  <p>  \t3. Windows Shellbags - an overview  </p>  <p>  \t5. Shellbag Deep Dive  </p>  <p>  \t6. Setting up your forensic system  </p>  <p>  \t7. Validation practical 01 - local system activity  </p>  <p>  \t8. Validation practical 02 - attached USBs  </p>  <p>  \t9. Validation practical 03 - networked drives  </p>  <p>  \t10. Student Practical  </p>  <p>  \t11. Student Quiz  </p>  <p>  \t12. Reporting options  </p>  <p>  \t13. Review  </p>  <p>  \t14. Conclusion &amp; thank you  </p>  <p>  \tA PC running Win7 or Win8 is required for this course. You need admin rights to the system.  The system itself should be a test system containing no critical data.  The forensic tools we use are all freely available, so beyond your operating system all you need is the desire to become a better computer forensic examiner.  </p>", 
    "end_date": null, 
    "title": "Surviving Digital Forensics: Windows Shellbags", 
    "price": "50.00", 
    "instructors": "Michael Leclair", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417430_dfd4_2.jpg", 
    "course_url": "https://www.udemy.com/surviving-digital-forensics-windows-shellbags/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T16:48:11Z"
}