{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This Wordpress course is designed to offer you a simple, easy to understand and straightforward approach when it comes to learning how to secure your site or blog. </p>\n\n<p>It will teach you how to prevent hackers from accessing your data. It doesn't require any specific technical background or knowledge in order to participate.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Who is This Security Wordpress Course for?</strong><br>Have you ever wanted to secure your site site or blog without needing to read rocket science but felt overwhelmed by all the options available out there?</p>\n\n\n\n\n\n\n\n\n\n<p>This course is jam packed with material that will help you turn your site into a fort in 24 hours or less by adapting the information given in practice.<br></p>\n\n\n\n\n\n\n\n\n\n<p>You don’t need to pose any specific technical abilities or knowledge as the course assumes that you are a complete beginner just starting out!</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Few of the modules we are going to cover in this Wordpress course</strong>:</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Why you are the biggest risk when it comes to the security</li><li>Why you should avoid free themes &amp; their pitfalls</li><li>How to carefully choose your plugins and stay safe</li><li>How to securely install Wordpress in few minutes</li><li>How to enable the two-factor authentication with ease</li><li>Why you need to remove the default database table prefix</li><li>How to ban IP addresses from accessing your site</li><li>Why you need to disable bowling in your Wordpress directories</li><li>How to use .htaccess file &amp; turn your Wordpress site into a fort</li><li>How to easily backup your site without any manual work</li></ul>\n\n\n\n\n\n\n\n\n\n<p><em><strong><br></strong></em></p>\n\n<p><em><strong>After you complete this course you will be able to easily transform your Wordpress site or blog into a well-guarded fort in less than 24 hours!</strong></em><br></p>", 
    "end_date": null, 
    "title": "Teach Yourself Wordpress Security in 24 Hours or Less", 
    "price": "20.00", 
    "instructors": "Mr Mirsad Hasic", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/732498_5c62_4.jpg", 
    "course_url": "https://www.udemy.com/teach-yourself-wordpress-security-with-ease/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T10:05:11Z"
}