{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Course Updated 22 March 2016<br></strong></p><p><strong></strong></p><p><strong>Why are 39,210 students wanting me to mentor them in 38 Udemy courses? 39,210 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong>Added:</strong></p><p><strong>Nessus Port Scanner and Vulnerability Scanner</strong></p><p><strong>Footprinting and Enumeration module</strong></p><p><strong>24,958 students enrolled and full of 5 Star Reviews!</strong> </p><p><strong>Here are a few 5 star reviews:</strong></p><p>\"<strong>Finally a clear course on Kali!</strong></p><p>OMG thank you so much, I finally have a working kali linux installation on my computer!</p><p>This course is simply amazingly clear! I`ve never used any other os apart from Windows and Kali always was a mistery to me let alone installing it on my virtual machine. BUT this course solved it, I just followed the instructions and less than 10 minutes later kali is installed and working! The whole course is presented super clear, great video quality and no steps missed!</p><p>Cannot recommend it enough!\" - <em>TWO 2</em></p><p><strong>\"Great Course</strong></p><p>firstly i want to thank the lecturer for the great course. and i want to say that the course definitely worth the time.\" - Berzan Hasan</p><p><strong>\"Very Informative</strong></p><p>Fantastic course, lots of content and covers almost everything i need to know as a beginner .Thanks #Nikhil Parekh.\" - <em>Dr Raihan Kabir</em></p><p>Also, here's a 1 star review:</p><p>\"<strong>Waste of my money</strong><br></p><p>Did not learn anything usefull\"</p><p>and a 2 star review by William C. Husk Jr who has failed to leave any actual review for me to look at so that I can improve this course. </p><p>When you take this course, you are covered by a 30 day full money back guarantee. So there is no waste of money ever if you ask for a refund if this product is not suitable to you. Please look at the <strong>number of 5 star review</strong><strong>s</strong> before you make a decision on taking my course. </p><p>You are about to be introduced to one of the most powerful penetration testing platforms in the world. Kali Linux</p><p>Kali Linux is one of the most versatile penetration testing platforms favored by ethical hackers.</p><p>This course will introduce you to Kali Linux and explain step by step how to install Kali Linux in a virtual environment on a Windows 10 machine.</p><p>You will learn how to install Kali Linux, set up the root username and password, install VirtualBox guest additions, Linux kernels and much more!</p><p>All videos are recorded in HD quality and you will be able to follow along as the lessons are spoken in clear English.</p><p>You will also be introduced to NMAP and how to use it for security scanning, port scanning and network exploration.</p><p>The videos will also guide you on how to install a wireless card within the virtual environment so you can scan wireless networks and devices and take advantage of many of the wireless security tools available in the Kali Linux environment.</p><p>Take this course today and start your Kali Linux journey now!</p>", 
    "end_date": null, 
    "title": "The Definitive Ethical Hacking Course - Learn From Scratch", 
    "price": "35.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687824_e98d_5.jpg", 
    "course_url": "https://www.udemy.com/kali-linux/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T09:31:04Z"
}