{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong style=\"\">Completely up to date and relevant virus removal and prevention!</strong></p><p><strong style=\"\">Easiest to follow virus removal course on Udemy!</strong></p><p><strong style=\"\">Have you ever wondered how the pros and “geeks&quot; remove malware a computer?</strong> Have you ever hoped you could do it yourself and avoid paying hundreds to a computer tech? Well look no further!<br style=\"\"></p><p><strong style=\"\">Easy to Follow Process:</strong><br style=\"\"></p><p>This course will teach beginners and techies alike how to remove viruses like the pros do. This course requires only basic computer knowledge and operations, such and point and click.<br style=\"\"></p><p><strong style=\"\">Great for Any Skill Level:</strong></p><p>Not only is this course great for the everyday home PC user, but IT professionals can use this course as a supplementary program to the systems they currently use, and get some external insight on all kinds of malware removal.</p><p><strong style=\"\">What You&#039;ll Learn:</strong></p>  <p>  \tThis course will teach you how to remove all kinds of malware from a Windows system, including adware, spyware, viruses and more. This course applies to all modern versions of Windows, including Windows XP, Windows Vista, Windows 7, and Windows 8/8.1. The course is taught mostly through screen-recordings and real-time demonstrations with very little time-lapse. Supporting documents are included that go into special detail on certain subjects. All the software necessary for this course are included (at no additional charge) in the download section, including malware removal software and a rescue disc for emergency recoveries.  </p><p><strong style=\"\">How Long to Clean My PC?</strong></p>  <p>  \tThe course will take 1-2 hours to complete, and some additional time to implement in a real-world application. You should take this course if you&#039;ve ever been interested in servicing your own PC and learning more about IT. You should take this course if you prefer not to pay someone else to fix your PC for you.  </p>", 
    "end_date": null, 
    "title": "Virus Removal: Easy for Any Skill Level", 
    "price": "20.00", 
    "instructors": "Gavin Johnsen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413424_1f76_3.jpg", 
    "course_url": "https://www.udemy.com/professional-virus-removal/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T18:54:18Z"
}