{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong style=\"\">Você receberá um certificado de conclusão e poderá instalar seu próprio ambiente online!</strong></p><p></p><p>Com a crescente demanda por experientes profissionais  em Cloud Computing crescendo em todo o mundo, nós temos como missão, mantê-lo  atualizado com a mais recente tecnologia.</p>  <p>A VMware possui a plataforma número um em  tecnologia de virtualização. Nós projetamos o curso VMware vSphere 5.1 em um  formato online para lhe proporcionar a melhor formação técnica que irá transformar  a perspectiva do Mercado em relação à você.</p>  <p><strong style=\"\">O que  oferecemos?</strong></p>  <p>1.&nbsp; <strong style=\"\">Você  terá somente o melhor treinamento:</strong> O curso é ministrado por Cleriston Cardoso, que possui mais  de 15 anos de experiência na indústria de TI com foco intenso em virtualização  de servidores e desktops</p>    <p>2.&nbsp;  <strong style=\"\">Curso 100% certificado:</strong> Não basta ser treinado.  obtenha a certificação</p>    <p>3.&nbsp;  <strong style=\"\">Obtenha a prática:</strong> Você começa a aprender tudo,  desde a teoria básica da computação em nuvem até a parte prática de como fazer </p>    <p>4.&nbsp;  <strong style=\"\">Aprenda confortavelmente:</strong> O curso é oferecido on-line  no conforto da sua própria casa</p>    <p>5.&nbsp;  <strong style=\"\">Pague uma pechincha:</strong> O curso está sendo oferecido  por uma fração do preço original obtenha agora a melhor formação, sem que seja  um fardo para seu bolso.</p>    <p>6.&nbsp; <strong style=\"\">Português:</strong>  O curso é oferecido 100% em português.</p><p>Leia mais sobre a importância deste curso...</p><p></p><p>A Virtualização de Servidores e Desktop é uma crescente na nova era Cloud Computing, segundo pesquisas da Glassdoor, JobVolume e tanta outras, um especialista nesta tecnologia poderá ter seu salário na casa dos 136 mil dólare anuais, que tal este número em sua carteira heim?&nbsp;</p><p>Neste curso você aprenderá na prática todos os passos necessários para instalar, configurar e Gerenciar o VMware vSphere 5.1 incluindo o ESXi 5.1 Update 1 (o mais recente do mercado), vCenter, Single Sign on, desde os recursos mais simples como o download dos instaladores, como obter a licença gratuita do VMware ESXi e instalação até mesmo às configurações mais avançadas como configurar toda a parte de Storage, Networking, vSwitch, Cluster, Data Center, High Availability (HA), DRS Distributed Resource Scheduler, &nbsp;Fault Tolerance, vMotion, Storage vMotion, Virtual Storage Appliance, Data Protection (VDP), etc...</p><p>Não se preocupe com todos estes nomes e siglas, ao fazer este curso você aprenderá tanto a parte conceitual da arquitetura como principalmente a parte prática de como fazer. Você poderá contar também com um laboratório virtual e online no período desejado para colocar &quot;A mão na massa&quot; e subir seu próprio ambiente de virtualização*</p><p>...e então, está esperando o que, Vamos iniciar a virtualização?</p><p>Este curso é organizado em sessões que estão definidas em um formato cronológico, cada qual contendo lições e estudo de caso, além disso você terá a oportunidade de praticar seu conhecimento com exercícios dinâmicos e para todos os assuntos abordados eu farei uma demonstração prática de como fazer em um ambiente &quot;mundo real&quot;.</p><p>Você não precisa gastar uma fortuna para aprender a Instalar, Configurar e Gerenciar o VMware vSphere. Inscreva-se neste curso e aproveite todo o conhecimento que você terá sobre o tema, você também poderá entrar em contato comigo através de e-mails e redes sociais. Nos vemos na próxima lição!!!!</p>  ", 
    "end_date": null, 
    "title": "VMware virtualization from Scratch", 
    "price": "50.00", 
    "instructors": "Cleriston Cardoso Cabral", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51510_9c63_4.jpg", 
    "course_url": "https://www.udemy.com/vmware-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-27T13:15:17Z"
}