{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong>Ethical Hacking Course: Website Hacking in Practice Training course </strong>  </p>\n\n<p>  \t<strong> - finally published!</strong>  </p>\n\n\n\n\n\n<p>  \t<strong>Welcome to Hacking School: Website Hacking in Practice course! </strong>  </p>\n\n\n\n\n\n<p>  \t         Before we begin – the practical use of the training you are going to see has been proven by vast group of people – beginners and computer geeks as well. People who make their first steps in computer / network security and professionals: network administrators, programmers, black- and white hat hackers. Please, read carefully what we'd like to share with you.  </p>\n\n\n\n\n\n<p>  \t                The course covers all important hacking techniques used by hackers and system administrators. <strong>About the Ethical Hacking Training course (what you can expect):</strong>  </p>\n\n\n\n\n\n<ul>  \t<li>It is a step by step training on Website and Web-application ethical hacking and security.</li>  \t<li>It covers almost all of the Top 10 Most Critical Web Application Attacks presented yearly by OWASP organization (Open Web Application Security Project) + 10 common techniques / vulnerabilities more.</li>  \t<li>It can be treated as a valuable source of knowledge for any white hat hacker, web developer, system administrator or IT security consultant.</li>  \t<li><strong>You will learn how to hack using 21 interesting techniques</strong> and see how each of them can be used in a practical real-life example.</li>  \t<li>You will get access to all the lectures in <strong>PDF </strong>format and live <strong>Ethical Hacking </strong><strong>Video Training</strong> sessions you can watch on-line.</li>  \t<li>Every lecture also contains a video session transcript with screen shots - you can print it and use it during your training.</li>  \t<li>Finally you will be provided with all the source codes and examples shown in the course. You can simply download the zip package from our server.</li></ul>\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n<p>  \t<strong>WHAT YOU WILL LEARN in this Ethical Hacking Training:</strong>  </p>\n\n\n\n\n\n<ul>  \t<li><strong>Module 01.</strong> Introduction and environment configuration - you will learn how to configure and prepare your system for the further training. All you need is a Windows system.</li>  \t<li><strong>Module 02.</strong> Deep data hiding.</li>  \t<li><strong>Module 03.</strong> Brute-force and dictionary attacks - you will get to know how an attacker could perform a brute-force or a dictionar attack on your website or web application containing a password protected data. </li>  \t<li><strong>Module 04.</strong> Account lockout attack.</li>  \t<li><strong>Module 05.</strong> Web parameter tampering - you will learn how to tamper hidden data used by websites. You will use the presented technique in a real-life example. Very important lesson.</li>  \t<li><strong>Module 06.</strong> Path and information disclosure.</li>  \t<li><strong>Module 07.</strong> Forced browsing - you will see how an attacker could \"sniff\" a sensitive data from a website using a forced browsing.</li>  \t<li><strong>Module 08.</strong> Path traversal - you will learn a path traversal method and use it in practice in your training environment.</li>  \t<li><strong>Module 09.</strong> Unicode encoding - encoding related vulnerabilities.</li>  \t<li><strong>Module 10.</strong> Parameter delimiter - you will learn how to take advantage of input filtering bugs. After this lesson you will be able to create an admin account - of course without having the administrator privileges.</li>  \t<li><strong>Module 11.</strong> PHP injection - you will be demonstrated a PHP code injection practical attack. Very important lesson. You will see how a malicious data can be injected into a website, e.g. using a crafted image or text string.</li>  \t<li><strong>Module 12.</strong> Direct static code injection - you will learn what a ststic code injection is and how it could be used by an attacker.</li>  \t<li><strong>Module 13.</strong> SQL injection - one of the TOP3 techniques used by attackers nowadays. Step by step practical demonstration. You can hack the training website yourself (without harming anybody).</li>  \t<li><strong>Module 14.</strong> XSS - Cross Site Scripting attack - you will see for yourself why XSS is considered the most popular hackers' target. By the end on this lesson you will intercept a user session.</li>  \t<li><strong>Module 14B.</strong> XST - Cross Site Tracing attack.</li>  \t<li><strong>Module 15.</strong> XSRF - Cross Site Request Forgery attack - you will learn how an attacker can force an unaware user to reset a password.</li>  \t<li><strong>Module 16.</strong> Spying on data with a browser - no additional comment needed.</li>  \t<li><strong>Module 17.</strong> Session hijacking - lesson on session hijacking and consequences.</li>  \t<li><strong>Module 18.</strong> Session fixation.</li>  \t<li><strong>Module 19.</strong> Phishing - one of the most popular attacks. You will learn some tips to protect against it.</li>  \t<li><strong>Module 20.</strong> Automated security testing - you will be taught using automated security testing tools and learn what white, black and grey box testing is. Useful knowledge for web developers and IT security consultants.</li>  </ul>\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n<p>  \t<strong>IN EACH MODULE YOU WILL ALSO SEE HOW YOU CAN PROTECT YOUR WEBSITE OR WEB APPLICATION AGAINST EVERY VULNERABILITY DESCRIBED IN THE COURSE. MODULES ARE DIVIDED INTO: 1) THEORETICAL INTRODUCTION, 2) PRACTICAL ATTACK EXAMPLE, 3) SECURITY GUIDANCE.</strong>  </p>\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n<p>  \t<strong>WHAT YOU NEED TO KNOW BEFORE YOU BEGIN:</strong>  </p>\n\n\n\n\n\n<ul>  \t<li>This ethical hacking course is intended to help you regardless of your current knowledge and skills. All you need is a basic computer knowledge and a Windows system.</li>  \t<li>We will show you how to prepare your training environment. In this environment you can experiment freely, without doing harm to anybody.</li>  \t<li>All the modules were recorded in Windows 7 (from the attacker / victim point of view) but it doesn't mean that the presented techniques apply only to Windows. Most of them are OS independent.</li>  \t<li>You will download the ZIP package with all the source codes and examples from our server before you begin to avoid unnecessary code retyping.</li>  \t<li>Every module (lesson) contains the attack related part, as well as a guidance to protect your own website, web application or web server.</li>  </ul>\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n<p>  \t<strong>What you will find inside can also be used by beginners</strong> - thanks to live Video Training attached to the course. Almost every module covered inside has been presented by a professional web developer.  </p>\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n<p>  \t<strong>Please be advised that all the techniques presented in \"Website Hacking in Practice\" course can only be used ethically and in your own testing / researching environment.</strong> Note that you will get all the required tools and information to prepare your own training system. Please see the Legal information in the 1st section for further legal reference.  </p>\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n<p>  \t<strong>We guarantee your 100% satisfaction or you will get your money back.</strong> You have 30 days to decide if the \"Website Hacking in Practice\" training is for you. You will get access to the whole system. If for any reason you're not satisfied with your training, we will give you full refund. No questions asked.  </p>\n\n\n\n\n\n<p>  \t                We wish you the best,<br>  \t<em>The Hacking School Team</em>  </p>", 
    "end_date": null, 
    "title": "Website Hacking in Practice", 
    "price": "20.00", 
    "instructors": "Hacking School, IT Security Academy", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33123_dcf4_9.jpg", 
    "course_url": "https://www.udemy.com/website-hacking-in-practice/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-19T17:32:06Z"
}