{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>For my long life in IT it became clear that this is very difficult to find out a comprehensive WiFi training for people who needs to clearly understand big, completed picture, but without digging into technical details. And most of all it relies to Sales, Business development, IT and Project Managers who sells WiFi or manages WiFi projects. There are great technical deep dive classes for engineers from top WiFi vendors as well as cool generic marketing presentations or probably some good stuff on purpose. But what about sales or project people with WiFi specialization? Actually, what about completed intermediate layer? If you met the same issue – Congratulations! - the course was specifically designed to fill in such gap. </p><p>The course includes 18 lectures with about 3.5 hours of video content. It covers WiFi history, trends, impacting factors, standardization, regulation, high level radio fundamentals, architectures, services, solutions, requirements. Actual structure is presented at the course's curriculum. All main ideas, recommendations and tips are duplicated with text notes and pictures over the video lectures.</p><p>At the end of the course you'll definitely extend your horizon and will know a lot of practical tips how to manage your WiFi networking projects with a lot more confidence and make reasonable decisions. I believe it will help to boost your carrier and reach out more success. See you on the course!</p>", 
    "end_date": null, 
    "title": "WiFi for Sales & Business development professionals in IT", 
    "price": "40.00", 
    "instructors": "Alexey Zaytsev", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579284_d5b2_2.jpg", 
    "course_url": "https://www.udemy.com/wifi-for-sales-business-development-professionals-in-it/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T18:24:09Z"
}