{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Wireshark is the most powerful network analysis tool every coder should know. After you learn it it&#039;ll become one of the most important application in your toolbox.</strong>  </p>  <p>  \t         If you are ...  </p>  <ul style=\"\">  \t<li>experienced coder / programmer</li>  \t<li>... or just learning programming</li>  \t<li>network administrator</li>  \t<li>linux enthusiast</li>  \t<li>interested in security and hacking</li>  </ul>  <p style=\"\">  \t         ... this is the course for you!  </p>  <p style=\"\">  \t         I have more than 15 years of experience in programming and reverse engineering and <strong style=\"\">I know how much harder my life would be without tool like Wireshark</strong>. That&#039;s why I&#039;ve made this course. If I had such edu resources available when I was learning I could leapfrog to the next level and save a lot of time spent on trial and error.  </p>  <p style=\"\">  \t<strong style=\"\">The course is 19 lectures, 60 min of video content </strong>in total. It&#039;s pure knowledge, straight to the point, stripped of all unimportant crap.  </p>  <p style=\"\">  \t<strong style=\"\">Students so far rate it at 5 out of 5</strong><strong style=\"\"> stars</strong>. I&#039;m confident you will not regret the one hour time investment in this course.  </p>  <p style=\"\">  \t         Here&#039;s what other students said about this course so far:  </p>  <ul style=\"\">  \t<li><em style=\"\"><strong style=\"\">Elena Seranova </strong>★★★★★: Impressed! This course def. helped me learn a lot about Wireshark!<br style=\"\">  \t<br style=\"\">  \t</em></li>  \t<li><em style=\"\"><strong style=\"\">Manuel Kraus </strong>★★★★★: Wireshark is a great tool to analyze and manage your network and this course offers a solid, well-delivered introduction.<br style=\"\">  \t<br style=\"\">  \t</em></li>  \t<li><em style=\"\"><strong style=\"\">Yin Yin </strong>★★★★★: Great intro to Wireshark! Good reference for Wireshark and great for new comers. A must have for anyone who really wants to get the most from Wireshark.<br style=\"\">  \t<br style=\"\">  \t</em></li>  \t<li><em style=\"\"><strong style=\"\">Mitch Stevens </strong>★★★★★: Very too the point and helpful. The instructor has great knowledge of the course material and does a great job conveying that to the students.<br style=\"\">  \t<br style=\"\">  \t</em></li>  \t<li><em style=\"\"><strong style=\"\">Silviu Marisca </strong>★★★★★: This course is brilliant and I truly recommend it<br style=\"\">  \t<br style=\"\">  \t</em></li>  </ul>  <p>  \t       You can read more excellent reviews like that on the bottom of this page.  </p>  <p>  \t           During this tutorial you&#039;ll learn how to use Wireshark sniffer to capture network traffic and then analyse it.  </p>  <p>  \t           This is beginners course so I&#039;ll cover network related terms like TCP and network infrastructure basics.  </p>  <p>  \t           You will learn how to install and run Wireshark on Windows, Mac OSX and Linux - console only systems.  </p>  <p>  \t           I&#039;ll teach you how to capture network traffic, use capture filters and what is the promiscuous mode. I will also show you how to capture network traffic on remote unix system using command line tool: tshark.  </p>  <p>  \t           Then, you&#039;ll learn captured packets analysis. I will teach you how to use and customize the main Wireshark window, what are dissectors and how are they related to display filters.  </p>  <p>  \t           You will learn some advanced techniques like extracting files from captured network streams and separating one specific connection from the pcap file.  </p>  <p>  \t           During the course I will provide you with a lot of external resources where you can learn more about Wireshark and network security in general.  </p>  <p>  \t           At the very end, as a bonus session, I will show you practical example of capturing a password sent over HTTP connection.  </p>", 
    "end_date": null, 
    "title": "Wireshark in 60 minutes - video course", 
    "price": "20.00", 
    "instructors": "Grzegorz Aksamit", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333648_ec58_3.jpg", 
    "course_url": "https://www.udemy.com/wireshark-tutorial-guide-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-01T21:26:02Z"
}