{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<hr style=\"\">  <strong style=\"\">*** A Recent Customer Said...</strong> <em style=\"\"><br style=\"\">  <br style=\"\">  </em><em style=\"\"><strong style=\"\">Very comprehensive course<br style=\"\">  </strong></em>  <p style=\"\">  \t<em style=\"\">Chris O&#039;Connor does a fantastic job clearly explaining how to secure your Wordpress site: from installs and plug-ins, from back-ups to clean-ups, and even best practices for purchasing themes and plug-ins. This course is worth every cent.</em>  </p>  <hr style=\"\">  <h4 style=\"\"> <strong style=\"\"><br style=\"\">    30,000 Web Sites Are Hacked EVERY Day...</strong> </h4>  <h4 style=\"\"> <strong style=\"\"><em style=\"\">...and most website owners don&#039;t even know their site is one of them</em></strong> </h4>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>There is a common misconception that viruses and malware are distributed by porn sites, gambling sites, or other sites of a dubious nature. But nothing could be further from the truth. It&#039;s small businesses, the personal blogger, the hobbyist. Basically, the sites you least expect to be spreading malware, and they are also the sites that least expect to get hacked - and usually the ones that are the least prepared for it when it actually happens.<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">It&#039;s a Numbers Game</strong>  </p>  <p style=\"\">  \t                                   WordPress is a great platform on which to build a web site, and it&#039;s estimated that it now powers around 25% of all web sites - and that makes it a target for hackers.  </p>  <p style=\"\">  \t                                   With a standard platform for the hackers to target they can try and infect tens of thousands of sites, and there is an excellent chance they will break into a significant percentage of them. For them it&#039;s just a numbers game. It&#039;s nothing personal against you.  </p>  <p style=\"\">  \t<strong style=\"\">You Probably Don&#039;t Even Know That Your Site Is ALREADY Infected!</strong>  </p>  <p style=\"\">  \t                                   Most of us have seen websites that have been defaced. The reality is that these are NOT the norm, because most people putting malware on your site DON&#039;T want you to know it is there. Unlike the script kiddies who deface your site to show off to their friends, the REAL bad guys want to get as much use out of your site as they can, and are hoping to stay on it for as long as possible.  </p>  <p style=\"\">  \t                                   Chances are, completely unknown to you, your website could be being used for...  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Phishing exploits, stealing sensitive information from unsuspecting members of the public</strong></li>  \t<li style=\"\">Pharma hacks, advertising viagra, and who knows what else!</li>  \t<li style=\"\"><strong style=\"\">Hosting child porn, or just about anything else</strong></li>  \t<li style=\"\">Spreading more malware or viruses to other sites</li>  \t<li style=\"\"><strong style=\"\">Stealing personal credit card details or other information from your customers - <em style=\"\">the very people who have put their trust in you</em></strong></li>  </ul>  <p style=\"\">  \t                                   Before you know it your site is blacklisted by Google, and they are warning people not to visit your site because &#039;<em style=\"\">This site may harm your computer</em>&#039;. People stop visiting your site, customers find other (safer) places to meet their needs, and your business nosedives. Everything you worked so hard to build up could be lost virtually overnight and your reputation left in tatters.  </p>  <p style=\"\">  \t                                   Opening up your website and realising that someone else has broken in and used you, and your site, for their own ends leaves a sickening feeling in your stomach. It&#039;s a feeling of fear, dread, panic, and of being violated...  </p>  <p style=\"\">  \t<strong style=\"\">But It DOESN&#039;T have To Be This Way! There Is A Solution...</strong>  </p>  <p style=\"\">  \t                                   ...and the steps you need to take to avoid all of this DON&#039;T require you to be a computer expert or a WordPress security guru. If you were able to get your WordPress site off the ground then you almost certainly have all the skills necessary to put in place everything recommended in this course, and if you are in any doubt then I make it really easy for you, taking you step by step through exactly what you need to do to make YOUR site as hackerproof as possible.  </p>  <p style=\"\">  \t<strong style=\"\">Just implement what you are shown in this course and you can sleep easy at night knowing that you have done everything possible to protect yourself, your customers, and your business.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">My Guarantee To You</strong></em>  </p>  <p style=\"\">  \t                      I&#039;m 100% confident that <strong style=\"\">this is the best WordPress security course</strong> available anywhere, at any price. So here&#039;s my guarantee to you -- <strong style=\"\">take this course now</strong>, check it out, and if at any point in the next 30 days you disagree with me, then you simply ask for a refund. You&#039;ll get every penny of your money back - no questions asked. That&#039;s how confident I am that <strong style=\"\">you will find this course perfect for your needs</strong>. So go ahead, take this course now. Just click on the blue button that says &#039;Take this course&#039;, and remember, <strong style=\"\">it&#039;s entirely risk free!</strong>  </p>", 
    "end_date": null, 
    "title": "WordPress Security : Comprehensive, but Easy", 
    "price": "25.00", 
    "instructors": "Chris O'Connor", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273542_8b7f_7.jpg", 
    "course_url": "https://www.udemy.com/wordpress-security-training/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-02T17:44:07Z"
}