{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>WordPress has become a major player in developing websites. Be proud of a professional-looking site and be the envy of your competitors. Most sites created in WordPress don&#039;t have a professional look and are all very similar.I know many tips and tricks to create a powerful WordPress website. I am a teacher with many many years experience and so I will now teach you what you can achieve.</p><p>I will initially run you through a simple technique to add external files to your WordPress site. What this can do is allow you to update files without going through WordPress.</p><p>Next, I will show you the <strong style=\"\">WordPress basics</strong>. These will cover layout, posts,categories,tags and more. On top of these are the visual elements, the themes and widgets. These help portray your message much more.</p><p>Safety is important when using the computer and so is taking <strong style=\"\">backups</strong>. I will show you how to export your information.</p><p><strong style=\"\">Plugins</strong> are powerful tools to improve a basic site into something with much more power. I will show you the best plugins for improving your experience. These cover major improvements and add some powerful features. <strong style=\"\">Enhancing</strong> your site is easy and I shall show you: <strong style=\"\"></strong></p><ul style=\"\"><li><strong style=\"\">contact form</strong></li><li><strong style=\"\">social sharing</strong></li><li><strong style=\"\">custom thumbnails</strong></li><li><strong style=\"\">custom sitemaps</strong></li></ul><p></p><p><strong style=\"\">Security</strong> is paramount when having anything public. There are some bad people out there, even on the Internet. I will show you how to protect your site and especially the login. Imagine the<strong style=\"\"> login page</strong> as your front door, well your door is not that strong. Spam is a problem with automatically generated form filling bots. You can simply stop all that instantly. <strong style=\"\">Updates</strong> are another area to help with improving your site. If you don&#039;t update then you might be missing out on important updates from the developers.</p><p>The last section to teach you is to <strong style=\"\">optimize</strong> your site. Its not enough to be secure and have cool widgets, if it&#039;s not quick enough then people will close your page. You need to <strong style=\"\">SEO</strong> your site and keep it <strong style=\"\">clean</strong>. Your database can get bloated.</p><p>I hope what I&#039;ve shown you can help you. Why not enroll and let&#039;s get started!Thanks, Nigel.</p>", 
    "end_date": null, 
    "title": "Wordpress Advanced - Complete Security and Plugin Mastery", 
    "price": "20.00", 
    "instructors": "Nigel Openshaw", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/197434_f527_6.jpg", 
    "course_url": "https://www.udemy.com/wordpress-advanced-security-and-plugin-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-11T12:48:52Z"
}