{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><em><strong>Last Updated:  13 March 2016</strong></em></p><p><strong>Course Description</strong></p>  <p><em><strong>Are you or your clients WordPress site is going to get hacked?</strong></em></p>  <p><em> </em></p>  <p><em><strong>Are you confused on what security plugin, setting or even what should you do to make sure you are not one of the unlucky ones getting hacked today.</strong></em></p>  <p><em> </em></p>  <p>Learn from my <strong>15 years of experience in government and corporate Cybersecurity </strong>to help protect your WordPress site from hackers!</p>    <p><em><strong>Come with me to fast track the security on your site as quickly as possible!</strong></em></p>  <p><em> </em></p>  <p>This course will walk you through step by step on how you can enact some quick changes <em>(30 minutes or less)</em> that will substantially reduce the risk of being hacked.</p>    <p><strong>Not worried about hackers?</strong></p>    <p>You should be!  Forbes reported in 2013 that over <strong>30,000 WordPress sites were being hacked <em><u>each day</u></em>!  </strong>So do you feel lucky?</p>    <p>Today WordPress accounts for over 25% of all websites, so with a number like that you can only expect that you will be the target…..maybe not now, but eventually.</p>    <p><strong>In this course you will see what plugins and configuration changes you can make immediately in a step by step format.</strong></p>    <p>Do you have the same password for WordPress site as you do for your banking website?Ever thought about what if they get my WordPress site password, what else could they get?It happens all the time!</p>    <p><strong>This video will walk you through how you can quickly secure and make those passwords unique to you.This alone is worth the cost of the course.</strong></p>    <p>Do you hear that you should have a<strong> <em>backup strategy</em> </strong>around your WordPress site, but not sure how to set it up and what does it all mean?This course will walk you through step-by-step on how you should backup your site quickly and efficiently.</p>      <p>This is a down and dirty course on protecting your site….and as I produce more content on how to secure you WordPress site quickly it will added to the course- at no extra cost to you!This is a course that will continue to grow and expand.</p>    <p>As well as the Udemy 30 day guarantee, you have my personal promise that you will be delighted by what you'll learn in the next 3 to 4 hours.</p>        <p><em><strong>What this course is not:</strong></em> </p>  <p><em>I do not cover in-depth coding practices to make changes to your WordPress site.This course is designed for beginners who are not well versed in changes to code.Many code changes can be accomplished via plugins and thus an experienced coder may see some of this course as basic and rudimentary.However, ignoring the basics is what will get you hacked….<strong>PERIOD!</strong></em></p>  <p><em> </em></p>  <p><em>I will not “look at your site” and “tell you what’s wrong”.  Future courses will provide you an instruction on how you can DIY the security for your WordPress website.If you desire a service to provide security for your site, I can offer up recommendations (to include myself).</em></p>  <p><em> </em></p>  <p><em>I will not teach you anything that breaks Udemy’s terms, rules, conditions, etc, whether they are written or implied.</em></p>  <p><em> </em></p>  <p><em>This course is not backed or produced by Udemy - it's all my own work ... but the excellent Udemy staff are there to help you, too, of course! </em></p>    <p>But, if you want my personal “insider” information from being part of an elite group of hackers, protecting small and large enterprise websites, and just keeping you and your family protected – you need to get this course now….<strong>right this minute.</strong></p>    <p><strong>Every minute you delay, you are increasing the chances that your site will fall victim to a hacker somewhere</strong>......out there on the internet.<strong></strong></p>    <p><strong>Enroll now!</strong></p>    <p><em><strong>DISCLAIMER:</strong></em><em>This DIY online video training course is for informational purposes.  Every effort has been made to make the information accurate and easy to understand.  However, in the scope and scale of this online video training course, we are unable to extend or provide warranty or direct support to each individual WordPress blog, owned or operated by our students. Lastly, <u>any</u> site can get hacked given enough time and this course makes no promises or assumptions that it can keep your site 100% safe.  However, if you do the things in this video you will dramatically <strong>reduce your risk </strong>and hopefully the bad guys will move onto someone else!</em><em></em></p>    <p><strong>What are the requirements?</strong></p>  <p>The Internet, a computer, access to your administration section on your WordPress website and at least 30 minutes of time to spend on securing your site</p>    <p><strong>What am I going to get from this course?</strong></p>    <ul><li><strong><em>Over 24 lectures and 3 hours of content</em></strong></li><li>Substantially increase your knowledge around securing your WordPress website</li><li>Understand how the basics around security can dramatically impact your WordPress website</li><li>Learn what is an incredibly strong password and why should you use it</li><li>Learn to utilize a password manager to protect your greatest WordPress asset….your passwords</li><li>Learn the quickest techniques limit the avenues an attacker can break into your site</li><li>Learn the quick start guide to the best security plugins for your site</li><li>Learn what a security scan is and why you should do them</li><li>Learn the best backup strategy and what you should do to make sure you don’t loose all the work you have created</li></ul>                    <p><strong>What is the target audience?</strong></p>  <p>This course has awesome content for any level of WordPress owner/user, but it is primarily geared toward the beginner of a WordPress Content Management System (CMS)<strong></strong></p>", 
    "end_date": null, 
    "title": "Worried about hackers - Take this course to secure WordPress", 
    "price": "25.00", 
    "instructors": "Shon Gerber", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754692_5d77_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-security-securing-your-site-quickly-and-easily/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T22:01:14Z"
}