{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>القرصنة الاخلاقية والحماية هي فيديوات تعليمية تساعد على تعلم اختراق كلمات المرور وأساليب الحماية. الفيديوات في هذه الدورة تشرح قرصنة وحماية  العديد من كلمات المرور باستخدام التخمين , الـ كي لوغرز , هجمات الـ بروت فورس, الـ فيشنج , طرق الـ سوشيال انجنيرنج  وطرق الحماية لكل منها </p>  <p>هذه الدورة مفيدة بالتأكيد لتعلم مختلف طرق القرصنة وحماية كلمات مرورك من القراصنة . جميع الطرق تم شرحها بشكل بسيط وسهل خطوة بخطوة , موجهة لطبقة المبتدئين والهواة ولمن له توجهات مستقبلية لتعلم القرصنة باحتراف .</p>        <p>كيف تستعمل:</p>    <p>مشاهدة جميع مقاطع الفيديو في وضع ملء الشاشة وعرض الشرائح . سرعة الاتصال بالإنترنت أكثر من 30 كيلوبايت ضرورية لعرض جميع مقاطع الفيديو بشكل صحيح. في حالة ظهور أي صعوبة فنية أرسل تقرير إلى المبرمج من خلال خيار الرسالئل. أي شكوك، توضيح أو اقتراح بشأن التحسين نرجو ارسال رسالة الى المبرمج قبل إعطاء ردود سلبية .</p>      <p>إخلاء المسؤولية :</p>    <p>تهدف هذه الدورة لغرض التعليم فقط، ونحن لسنا مسؤولين عن تنفيذ أي اختراق تم تعلمه ، ترصد هذه الدورة بناء حاجز للحماية من القرصنة , بسبب نقص الوعي بين الناس حول القرصنة وطرق تجنبها .</p><p><br></p><p>الدورة هذه دورة مترجمة من اللغة الانجليزية بواسطة مترجم بعد أن تم الاتفاق بين المهندس عبدالرحمن قتيبه وصاحب الدروة على ذلك , اهداف هذه الدورة ليست ربحية حيث تم اقناع صاحب الدورة الاجنبي بجعلها رخيصة جدا بسبب احتوائها على الاساسيات وتوجيهها نحو فئة المبتدئين , مع ذلك فقد تحمل المهندس نفقات نشرها لتكون في متناول العالم العربي ويستفيد منها الجميع , يوجد كوبون تخفيض لسعر الدورة بقيمة 10$ يمكن الحصول عليه بمراسلة المهندس عبدالرحمن على الفيسبوك او التويتر ولن يرفض المهندس أي طلب من أي شخص , هدفنا أن نكون الأفضل في جميع مجالات التقنية , نتمنى أن يستفيد الجميع من هذه الدورة وان يستخدمها في الجوانب الجيدة و المفيدة , ونعتذر عن تقصرينا تجاه العالم العربي ,...<br></p>", 
    "end_date": null, 
    "title": "دورة التهكير المبسطة والمعربة للمبتدئين", 
    "price": "20.00", 
    "instructors": "Amit Huddar, Abdulrhman Qutaiba", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636744_ce3d_2.jpg", 
    "course_url": "https://www.udemy.com/arabic-password-hacking/", 
    "currency": "USD", 
    "subject_name": [
        "Network & Security"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-10T16:08:25Z"
}