{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Learn how to grow the 5 best garden crops to add them to  your food storage.</strong>  </p><p>In this course you will learn the 5 crops every gardener should be growing to build your own food storage.  Your pantry will soon be bursting with your own home grown veggies.  </p><p>Join me for this quick 45 minute mini course that will get you started growing food for your pantry.  <strong class=\"redactor-inline-converted\">We will cover the following topics:</strong></p><ol><li>What are the 5 best garden crops to be growing in your backyard to add to your food storage.</li><li>Why did each of these 5 crops make it to the top spots</li><li>Growing tips to get your best harvest ever of each of these favorite garden goodies!</li><li>The best methods for preserving or storing these backyard veggies.</li></ol><p><br></p><p><strong>With today's growing economic and political uncertainty learning how to provide some (or all) of your own food is become more and more important.</strong>  Join expert gardener Rick Stone as he talks about these 5 important garden crops that every backyard gardener should know how to grow and preserve.  This primer course is designed to get you started on your journey towards self sufficiency.</p><p>Rick will take you though each of these 5 important crops and give you tips for growing them and then methods for preserving them.  With more that 20 years of gardening experience Rick is becoming one of the \"go to\" guys for online gardening advice.  Rick's laid back personal approach to teaching online will have you coming back for more!!</p><p>Like all Udemy courses, this one comes with a 30 day money back guarantee.  If for any reason you are not happy with the course, simply return it for a full refund.  BUT we are sure you are going to LOVE this course!  </p><p>Happy Gardening!!</p>", 
    "end_date": null, 
    "title": "5 garden crops for food storage", 
    "price": "20.00", 
    "instructors": "Rick Stone", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/863902_54c8.jpg", 
    "course_url": "https://www.udemy.com/5-garden-crops-for-food-storage/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-30T18:01:40Z"
}