{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong><em>Join One of Udemy's Leading Entrepreneurship Communities!</em></strong></p><p><strong><em>Course v2.0 Released December 2015</em></strong></p><p><strong>You can free yourself to pursue your dreams</strong>, travel more, and put yourself on a path to financial independence by being a <em><strong>smart</strong></em><strong> Airbnb host</strong>. We welcome you into our house to share what we've learned while using Airbnb to successfully quit our day jobs and build a thriving business.</p><p><strong>Launch Your Own Airbnb Operation and Create Personal Freedom</strong></p><ul> <li>Build Your Hosting Strategy</li> <li>Avoid the Mistakes We Made!</li> <li>Set Yourself Up for Success</li> <li>Attract the Best Airbnb Guests</li> <li>Learn Our Communication Hacks (they're Critical!)</li> </ul><p><strong>Save Time, Make More Money, and Get Great Reviews</strong></p><p>Brian and Joe, the founders of Airbnb, had a dream and couldn't pay their rent. So they created a site where they could rent spots on three air mattresses in their small apartment to guests. Ultimately, they were able to use this money to launch a business that's now worth $20 billion and is <strong>helping people like you get the money they need to create the lives they want</strong>. For some people, Airbnb is hobby and for others, it's a <em>path to freedom</em>. </p><p>While Airbnb is an amazing opportunity for entrepreneurs, freelancers, and hosts everywhere, <strong>there are some big lessons that we've learned becoming some of the platform's most engaged hosts</strong>. You'll learn how to intelligently set up your space, create a profile that guests trust, a listing that they find attractive, and field inquires from guests all over the world. Most importantly, you'll learn how to successfully work with people in your space.</p><p>  Come on into our house and get started!</p><ul><li><em></em></li></ul>", 
    "end_date": null, 
    "title": "Airbnb: Our Insider Tips and Tricks for Successful Hosting", 
    "price": "20.00", 
    "instructors": "Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525242_27d7.jpg", 
    "course_url": "https://www.udemy.com/airbnb-class-for-entrepreneurs-and-freelancers/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T17:11:57Z"
}