{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Welcome to Aquaponic  Gardening and the fascinating marriage of hydroponics (growing plants without  soil) and aquaculture (growing fish in captivity). &nbsp;This course is based  on my book, &quot;<a href=\"http://www.theaquaponicstore.com/Aquaponic-Gardening-A-Step-by-Step-Guide-p/evaas002.htm\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Aquaponic Gardening: A Step by Step Guide to Growing  Fish and Vegetables Together</a>&nbsp;&quot; and is designed to be easy to follow, comprehensive, and fun. &nbsp;</p><p style=\"\">Most of the lectures in  this Aquaponic Tutotial are what is called a Video / Presentation Mashup at Udemy.  &nbsp;What that means is that you will see a video of myself or Alan (my  husband and partner) talking and demonstrating on the left, and PowerPoint  slides on the right with details to keep the concepts straight. But you don&#039;t  need to do anything - the slides will just appear at the correct time!&nbsp;</p><p style=\"\">At the end of this aquaponic gardening course there is a  series of articles and blog posts that I&#039;ve written that I think are  particularly relevant to new aquaponic gardeners who are smitten with this  growing technique (and I hope that is you!) and want to dive deeper. &nbsp;The  first article is called the &quot;Aquaponic Gardening Rules of Thumb&quot; and  it is a summary list of many of the concepts, principles and ratios that are  elaborated on in the course.</p><p style=\"\">The lectures end with  some handy tracking sheets and a list of links to many of the products that are  shown in the course. &nbsp;Some other links that will prove useful as you  embark on your aquaponic journey are...</p><p style=\"\">·&nbsp;  <a href=\"http://theaquaponicsource.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">The  Aquaponic Source&nbsp;</a>- our company site</p><p style=\"\">·&nbsp;  <a href=\"http://www.theaquaponicstore.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">The  Aquaponic Store&nbsp;</a>- the shopping site for all your  aquaponic gardening needs</p><p style=\"\">·&nbsp;  <a href=\"http://community.theaquaponicsource.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">The Aquaponic  Gardening Community&nbsp;</a>- a thriving online community of  gardeners just like you who help each other learn and grow</p><p style=\"\">·&nbsp;  <a href=\"http://aquaponicgardening.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Aquaponic  Gardening</a>&nbsp;- the site for the  Aquaponic Gardening book</p><p style=\"\">·&nbsp;  <a href=\"http://aquaponicsassociation.org/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Aquaponics  Association</a>&nbsp;- a wonderful resource  for promoting aquaponics. &nbsp;They also put on the annual Aquaponics Association Conference.</p><p style=\"\">Please feel free to  comment and ask questions as you take each lesson. &nbsp;I will try to answer  all questions within 48 hours. &nbsp;Also I will be scheduling live chats the  second and fourth Thursday of every month so please mark your calender!</p><p style=\"\">And if you like this  course please be sure and review it here and tell your friends!</p><p style=\"\">Let&#039;s get growing!</p><p style=\"\">                                                </p><p style=\"\">Sylvia</p>  ", 
    "end_date": null, 
    "title": "Aquaponic Gardening: Growing Fish and Vegetables Together", 
    "price": "25.00", 
    "instructors": "Sylvia Bernstein", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15267_73df_8.jpg", 
    "course_url": "https://www.udemy.com/aquaponic-gardening/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-17T21:35:41Z"
}