{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t                      Since I was a kid I always dreamed of having my own home theater.<br>  \t                      There is something magical about watching your favourite movies on a big screen, right?<br>  \t                      But even more magical is the concept of bringing that same feeling into your own home.  </p>  <p>  \t                      The problem is that recreating that experience at home was simply too costly. Let alone I always thought you had to own a big home to have the luxury of a dedicated room for big screen movie watching.  </p>  <p>  \t                      Things have changed! Advanced projection technology has become much more affordable these days.  </p>  <p>  \t          So after some research a figured out how I could turn the living room inside my small 700 s/f apartment into the home theatre I always dreamed of.  </p>  <p>  \t          In this course I&#039;ll teach you exactly how I did it so you can too enjoy movies, docs, sports, and games like never before on a huge screen without breaking the bank.  </p>  <p>  \t                      You will learn:  </p>  <ul>  \t<li>How to design your own home theatre projection setup</li>  \t<li>How to choose the right projector</li>  \t<li>How to choose the right projection screen</li>  \t<li>How to install and adjust your screen</li>  \t<li>How to install and adjust your brand new projector</li>  \t<li>Affordable options for your sound system</li>  \t<li>Even how to cook the perfect popcorn for maximum film ecstasy!</li>  </ul>  <p>  \t                      The best part is that once you have all the parts and tools you&#039;ll be able to install everything in less than a day. Start Saturday morning and watch your first movie in the evening!  </p>  <p>  \t                      I&#039;ve taken the time to include a complete list of exactly all the parts and tools you will need to replicate my projection system.  </p>  <p>  \t          Don&#039;t worry if you never grabbed a hammer before. I made this tutorial so easy to follow even a baby poodle could finish this project with flying colors.  </p>  <p>  \t          Ready? It&#039;s time to give your living room the Hollywood touch! oh yeah!  </p>", 
    "end_date": null, 
    "title": "Build an amazing home theater system the easy way", 
    "price": "20.00", 
    "instructors": "Miguel Hernandez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364846_4443_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-home-theatre-projection-system/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T21:37:41Z"
}