{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t   This is a comprehensive course that is designed to help you to understand the essentials of the most misunderstood ancient Chinese art, the Classical Feng Shui.  </p>  <p style=\"\">  \t   In this course, concepts are kept simple and no complicated formula are used.  </p>  <p style=\"\">  \t This course is structured into six sections.  </p>  <p style=\"\">  \t In the first section, the main focus will be on the origin of Feng Shui and its various schools of thoughts. Here you will be exposed to what the Feng Shui analysis is based on. You will be able to distinguish what classical Feng Shui really is. Other than that, the Qi, which is the essence of Feng Shui is also introduced in this section.  </p>  <p style=\"\">  \t In the second section, the exterior factors are discussed. You will be able to distinguish what is important in the external landform evaluation.  </p>  <p style=\"\">  \t The common negative forms in Feng Shui evaluation are introduced here in Section 3. Here you will also be exposed to the conditions to qualify the manifested negative forms or commonly known as the <em style=\"\">Sha Qi</em>.  </p>  <p style=\"\">  \t In the fourth section, you will get a chance to know the surrounding or the neighborhood better. You will know what is good and what to avoid having within the neighborhood.  </p>  <p style=\"\">  \t After the thorough discussions on the exterior and the intermediate surrounding, the interior Feng Shui will be the main focus of Section 5. In this section, priority will be on the main door, the bedroom and the kitchen.  </p>  <p style=\"\">  \t Finally, Section 6 will be on the Feng Shui evaluation.  </p>  <p style=\"\">  \t  At the end of the course, you will be able to do your own Feng Shui evaluation based on the 10-step DIY evaluation system. By knowing the essentials of Feng Shui evaluation, you may be able to save cost and time in selecting your house of your choice. Other than that, if you are already living within the house, you will able to determine which sectors of the house are favorable and unfavorable.  </p>  <p style=\"\">  \t By having a good understanding in Feng Shui, you will be able to improve the Feng Shui of your own house and eventually improves your life.  </p>", 
    "end_date": null, 
    "title": "Classical Feng Shui for Beginners", 
    "price": "30.00", 
    "instructors": "Geof Wise", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/201986_087a_4.jpg", 
    "course_url": "https://www.udemy.com/classical-feng-shui-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-20T05:13:52Z"
}