{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>En este curso de carpintería y ebanistería vas a aprender   las bases del oficio,  porque quieres saber más sobre la madera, porque te interesa todo lo relacionado con este bonito oficio, porque has empezado una vez solo a trabajar en tu taller y no sabes cómo seguir pero tienes ganas de saber más o bien porque quieres ser un futuro profesional.</p>\n\n<p> Mi objetivo es claro, enseñarte los pasos a seguir para desarrollar tu proyecto y que vayas asimilando la teoría y la práctica del oficio.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Vas a ver  cuales son las herramientas básicas y cómo comprarlas,  verás cómo empezar a trabajar la madera con ellas, como afilarlas, su uso y manejo. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>También te ayudaré a montar de manera profesional tu taller si tal es tu deseo.</p>\n\n<p> Te adjunto en pdf, una lista con las herramientas básicas para empezar a trabajar y una segunda lista muy completa por si quieres montar tu taller como profesional.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Luego estudiaremos las máquinas que existen en el mercado por si luego te decides montar  mejor tu taller.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p> También veremos las maderas que debes comprar.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Te voy a dar  ya 3 ejercicios fundamentales del carpintero-ebanista.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p> - Cómo afilar las distintas herramientas como pueden ser los formones, las gubias del tallista, el cepillo del carpintero, la cuchilla del ebanista. El afilado manual y el afilado mecánico.</p>\n\n\n\n\n\n\n\n\n\n<p>- los cepillos del carpintero- ebanista: hay muchas clases de cepillos pero uno te puede valer para casi todo. verás el uso y manejo  y como conseguir escuadrar la madera con el.</p>\n\n\n\n\n\n\n\n\n\n<p>- Un ejercicio básico para aprender a trazar  con el gramil y trabajar con serruchos, formones y lijado final. Así  veras todos los pasos a seguir cuando se realiza un trabajo en madera.  Te añado un dibujo técnico en pdf del ejercicio así aprenderás a leer un plano de carpintero- ebanista.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p> Te añado también  una bibliografía sobre algunos libros que puedes comprar o consultar en bibliotecas o por internet y que son interesantes sobre el oficio, así podrás  acompañar las clases y entender mejor el oficio.<br></p>\n\n\n\n\n\n\n\n<p> Te aconsejo dedicar unas 3 horas semanales como mínimo para aprender poco a poco cómo se trabaja con las distintas herramientas y empezar a disfrutar de ellas y de la madera.Es un oficio muy placentero pero requiere dedicación.</p>\n\n\n\n\n\n\n\n<p> Aquí te presento este primer curso  para que vayas  conociendo los primeros pasos a seguir. Por supuesto que hay materia para años si quieres, depende mucho del tiempo que puedas dedicar a ello. Por eso, iré presentando varios trabajos diferentes y en distintos cursos así podrás ir aprendiendo a tu ritmo  lo que más te guste.  por ejemplo: como fabricar una caja con colas de milano, como realizar un marco con ensambles en horquilla, como fabricar tu banco de carpintero o bien como realizar una  marquetería. Distintos cursos que iré ofreciéndote en adelante. </p>\n\n\n\n\n\n<p> Espero que disfrutes de la madera como yo  lo sigo haciendo desde mas de 35 años. </p>\n\n\n\n\n\n<p>Un saludo. Jean Baptiste Van den Heede, ebanista.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Curso de carpintería y ebanistería paso a paso", 
    "price": 0, 
    "instructors": "Ebanista, tallista y marquetero jeanbaptiste Van den Heede", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729072_88c0_3.jpg", 
    "course_url": "https://www.udemy.com/cursodecarpinteriayebanisteria/", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T13:54:06Z"
}