{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Whether you already use the annual Flying Stars to organize your home or office, or you have tried a little Feng Shui and are ready for more, this course is perfect for you.  If you are ready to get bigger and better results from using this ancient system with today's modern objects; this quick 30 minute course with many of the author's original images and explanations makes it super simple for you to follow and use Advanced Feng Shui in your space today!</p><p>At the beginning of each year, there is a Chinese solar New Year when Feng Shui enthusiasts get their spaces reorganized and redecorated with clean, fresh energy, before the Chinese Lunar New Year, a few days later, brings in the new locations of the nine energy patterns, called the Flying Stars.</p><p>The instructor takes a fun visual approach to teaching this decorating system by creating unique and descriptive images for each of the nine Flying Stars that give them a unique and colorful personality making it easy for you to remember them and what they need to be  enhanced or weakened in your home or business.</p><p>Use the information in this course to improve the atmosphere in your living and working environment, give yourself an edge over your competition, add a new stress relief tool, as well as more peace in your daily life, and greater success with your personal goals. Simply click the \"Take This Course\" button on your screen, and in 30 minutes you'll be making changes for the better.<br></p>", 
    "end_date": null, 
    "title": "Decoding the Flying Stars in Feng Shui-Go Behind the Scenes", 
    "price": "20.00", 
    "instructors": "Eva Bogard", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463378_0ce4_3.jpg", 
    "course_url": "https://www.udemy.com/decoding-the-flying-stars-in-traditional-feng-shui/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T21:02:58Z"
}