{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>&gt;&gt; Special Price ONLY - Increasing to $67 Soon &lt;&lt;</strong></p><p><strong>&gt;&gt; Updated For October 2015 With New Material! &lt;&lt;</strong></p><p>This course is designed for people who are looking to start growing fresh flowers and produce in small space and small places. Taught by Meg Smolinski, a Master Gardener who volunteers at the National Gallery of Art and Smithsonian Gardens in Washington, D.C., this course will give you the knowledge you need to start your own container garden.<br></p><p><strong>Guarantee:</strong> By the end of this course you will learn how to grow beautiful flowers, fragrant herbs, and delicious vegetables in containers, plain and simple!</p><p><strong>Why take this course?</strong><span><strong></strong><br></span></p><p style=\"\"><span>This was a great, well-prepared lecture for folks brand new to container gardening. I liked the engaging lecture style and the resources offered at the end. <span>-- <em>Kelsey Low</em><span></span><br></span></span></p><p><span><span><span>Join over <em>1,500 students</em> who have learned how to grow beautiful container gardens from my course!<span><br></span></span></span></span></p>  <p>  \t<strong>In this course you'll learn:</strong>  </p>  <ul>  \t<li>How to correctly choose containers to use for your garden</li>  \t<li>Tips on placement of the containers and container preparation for optimal plant growth</li>  \t<li>Overview of what plants to choose for container gardens</li>  \t<li>Maintenance of your container garden including appropriate fertilization, watering, pruning, replanting, and harvesting</li>  \t<li>Tips from my \"lessons learned\"--learn from the mistakes I've made with my own container gardens!</li>  \t<li>Helpful resources for further information and education</li>  </ul><p><br></p><p style=\"\">One super-satisfied student (that will be me)...Check! If lack of gardening space is stopping you from pursuing your gardening interest this course will do you wonders. </p><p style=\"\">-- <em>Michael Choke</em></p><p><strong>The Better Than Money Back Guarantee</strong></p><p>As always there is a 30 day money back guarantee. But I believe that this guarantee is too weak so I propose this for you. If you do not get the results that you are looking for in this course then I will personally give you double your money back out of my own pocket. I am committed to only deliver the very best in my teaching and content and I am confident that your life will never again be the same once you discover your passion.</p>  <p>  \t<strong>Anyone--<em>including you!</em>--can start a container garden to provide fresh vegetables, fruits, and beautiful flowers. Get started on the right foot with your container garden by using my course!</strong>  </p>", 
    "end_date": null, 
    "title": "Easily Grow Flowers, Herbs, & More With Container Gardening", 
    "price": "20.00", 
    "instructors": "Meg Smolinski", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309136_1aeb.jpg", 
    "course_url": "https://www.udemy.com/container-gardening/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-27T19:20:23Z"
}