{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t     In this 75-minute interview-style course with Feng Shui experts Nicolette Vajtay and Ann Bingley Gallops, you will learn how to create an environment that supports your life and business, thus creating the abundant success you so desire.  <br style=\"\"></p><p>Learn how to connect with the creative energies of the heavens, how to attract the right people to you, and how to ask for support from important connections around you.  </p>  <p>  \t  Business owners will learn specific Feng Shui adjustments/cures to create more attention on your business, attract more clients, attract the right team to help get your vision out into the world.  </p>  <p>  \t  If you&#039;re not a business owner but a creative artist or raising a child in the home, you will learn ways to enhance your creativity, how to receive the best support for your children and how to create a space where you may thrive in your gratitude for all you have.  </p>  <p>  \t           For best results, each student is invited to work with a floor plan of the main level of your home.   This floor plan is a map that will guide you to the area of the home that we will be discussing.  We invite you to sit in this area of your home during our class so you may make notes of how you might want to adjust the space right away with the Feng Shui cures you will learn.  If you do not have a floor plan, draw one on a full piece of paper.  It does not have to be to scale but should be relatively proportionate.  </p>  <p>  \t          With an accurate understanding of the Feng Shui Bagua, and specific information about this area in your home and office, you may bring in more business, create a better team, move into a better job, find loyal supporters for your art, find that agent who will publish your book, create support for moms in the home and so much more.  </p>  <p>  \t           You may compare <strong style=\"\"><em style=\"\">Feng Shui</em></strong> for your environment, to acupuncture for your body.  When life energy is  blocked in the body, it may cause illness. When that energy is released  and blood once again flows freely, there is health and vitality.  </p>  <p>  \t          When there is blocked energy in your environment, you may feel stuck  in your career, depleted in your health, or angry about your life  circumstance.   When the &quot;chi&quot; in your home and office is open and  flowing, you create a space where you may gracefully share your purpose with the world, from a state of health and vitality.  </p>  <p>  \tWhile you have access to this class forever, we highly encourage note  taking and invite you to start a discussion and/or ask us questions; we  are both available to answer emails and contribute more information.  </p>", 
    "end_date": null, 
    "title": "Feng Shui Tips To Attract Success", 
    "price": "35.00", 
    "instructors": "Nicolette Vajtay, Ann Bingley Gallops", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/183224_542b_6.jpg", 
    "course_url": "https://www.udemy.com/receive-support-in-business-life-with-feng-shui/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-15T22:47:10Z"
}