{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Hello everyone! Thanks so much for taking a look at my course. I am delighted to have you here.</p><p>We all want to save money, or spend our money wisely. But there are some necessities that are overly expensive, and we are stuck paying for them. </p><p>That's why I created <strong>Fire your phone company</strong>, an online course to walk you through the simple steps I took to replace my plain old telephone with a full featured internet phone.</p><p>Forget the traditional costs of a standard land line With the large monthly fees, the two year contracts, the taxes and more taxes, the fees for directory information, and the expensive per minute charges for the actual calls. And dealing with the phone company is so complicated. Good luck understanding all your options.</p><p>The phone company has modernized and uses internet telephony technologies to deliver your service, and you can too. But the charges have barely dropped, when they should have. They use tricks like contracts and bundles to keep you stuck.</p><p>This course is the solution for anyone with high speed internet. That's most of us.</p><p>In a few easy steps we can replace our land line with an internet phone that has no monthly fees. There are some limitations to this option, but I want to deliver on my promise of a free phone service early in the course.</p><p>We will have a phone with a regular phone number, unlimited incoming minutes, free voice mail, free caller-id, free call-waiting, free directory assistance, and cheap 2 cents per minute outgoing calls to anywhere in the US and Canada. International calls are inexpensive too.</p><p>911 service is not free, but for $1.50 a month I recommend you sign up.</p><p>We then discuss the cheap options we can add that makes it better than the phone service you have.</p><p>Fire your phone company has practical examples of the benefits of providing your own internet phone.</p><p>You can get a phone number local to your family in Europe or one of 50 countries world wide, You can add as many physical phones as you want each with their own numbers and with minimal up front cost.</p><p>This course is a step by step guide that will take even a beginner to the goal.</p><p>You will need home internet service of sufficient speed. This means you need either DSL, cable internet, fiber Internet, or FIOS.</p><p>Also you will need the specific Internet phone hardware. But don't worry, this course will tell you what to buy for under $40 at Amazon.<br></p><p>Once you buy this course, it is yours forever. And if this course turns out to not be what you are looking for, there is a 30 day money back guarantee.</p><p>I hope you will join me and <strong>Fire your phone company</strong>. Click Take this Course now, and I will see you in the course.<br></p>", 
    "end_date": null, 
    "title": "Fire Your Phone Company: Get a Free Landline", 
    "price": "20.00", 
    "instructors": "Peter Baumbach", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654210_7171_6.jpg", 
    "course_url": "https://www.udemy.com/fire-your-phone-company-life-hacks-1-get-a-free-landline/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T06:11:00Z"
}