{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t <strong style=\"\">You can build a permaculture food forest at your home, for a neighborhood, or as part of a city!</strong>  </p>  <p>  \t               Food forests, or edible forest gardens, are life-filled places that provide  </p>  <ul style=\"\">  \t<li><strong style=\"\">food for people</strong></li>  \t<strong style=\"\"> </strong>  \t<li><strong style=\"\">habitat for wildlife</strong></li>  \t<strong style=\"\"> </strong>  \t<li><strong style=\"\">carbon  sequestering</strong></li>  \t<strong style=\"\"> </strong>  \t<li><strong style=\"\">biodiversity</strong></li>  \t<strong style=\"\"> </strong>  \t<li><strong style=\"\">natural soil building</strong></li>  \t<strong style=\"\"> </strong>  \t<li><strong style=\"\">beauty and  tranquility</strong></li>  \t<strong style=\"\"> </strong>  \t<li><strong style=\"\">host of other benefits</strong></li>  </ul>  <p>  \t           This workshop covers the  basics of designing, planting, and maintaining a many-layered woodland  forest garden full of fruit and nut trees, perennial and annual vegetables, and  flowers.  </p>  <p>  \t <strong style=\"\">In this class <a href=\"http://organiclifeguru.com/course/food-forest-design-care-for-cites-and-suburbs/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Toby Hemenway</a> gives you both the theory behind food  forests and a wealth of practical information, including which plants to  use, where to start, and what to expect as your food forest grows and evolves.</strong>  </p>  <p>  \t               Toby Hemenway comes to permaculture with a strong science background. He is  skilled at delivering complicated scientific topics to people who may  not have a science background. In this course he explains the ecology  behind a healthy, productive food forest or edible garden.  </p>  <p>  \t               As a pattern  specialist, Toby explores a variety of design strategies and techniques  for you to use as you design your food forest. As he explores  permaculture with you Toby explains the importance, application, and  usefulness of the 14 Permaculture Principles. He also demystifies the  sometimes confusing topic of guilds. He helps you understand what guilds  are and shows you three ways you can design by guild as you create your own food forest.  </p>  <p>  \t               Permaculture may be one of the most misunderstood terms out there.  From this class you will gain a thorough understanding of what  permaculture is, how it came to be, what it does, and most importantly  what you can do with permaculture. Toby Hemenway clearly explains how you can  apply permaculture to all aspects of your life as you strive to create  regenerative systems. He will both inform and inspire! <strong style=\"\">Upon completion  you will hold the knowledge you need to create a food forest garden that will  yield the results you want</strong>.  </p>  <p>  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p>  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">About Toby Hemenway</strong>  </p>  <p>  \t<strong style=\"\">Toby Hemenway is the author of <a href=\"http://www.patternliteracy.com/books/gaias-garden\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Gaia&rsquo;s Garden: A Guide to Home-Scale Permaculture</a>, which was awarded the Nautilus Gold Medal in 2011, was  named by the Washington Post as one of the ten best gardening books of  2010, and for the last eight years has been the best-selling  permaculture book in the world.</strong> Toby has been an adjunct professor at  Portland State University, Scholar-in-Residence at Pacific University,  and has taught over sixty 72-hour permaculture design courses. He has  presented lectures and workshops at major sustainability conferences  such as Bioneers, SolFest, and EcoFarm, and at Duke University, Tufts  University, University of Minnesota, University of Delaware and many  other educational venues. His writing has appeared in magazines such as  Natural Home, Whole Earth Review, and American Gardener. He has  contributed book chapters for WorldWatch Institute and to several  publications on ecological design. Visit Toby&rsquo;s website &ndash; <a href=\"http://www.patternliteracy.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">The Center for Pattern Literacy</a>.  </p>  <p>  \t              After obtaining a degree in biology from Tufts University, Toby  worked for many years as a researcher in genetics and immunology, first  in academic laboratories including Harvard and the University of  Washington in Seattle, and then at Immunex, a major medical biotech  company. At about the time he was growing dissatisfied with the  direction biotechnology was taking, he discovered permaculture, a design  approach based on ecological principles that creates sustainable  landscapes, homes, and workplaces. A career change followed, and Toby  and his wife, Kiel, spent ten years creating a rural permaculture site  in southern Oregon. He was the editor of Permaculture Activist, a  journal of ecological design and sustainable culture, from 1999 to 2004.  He moved to Portland, Oregon in 2004, and spent six years developing  urban sustainability resources there. Toby and his wife now live in  Sebastopol, California.  </p>", 
    "end_date": null, 
    "title": "Food Forest Design & Care for Cities and Suburbs", 
    "price": "50.00", 
    "instructors": "Toby Hemenway", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134128_8094_6.jpg", 
    "course_url": "https://www.udemy.com/food-forest-design-care-for-cities-and-suburbs/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-16T01:29:34Z"
}