{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Want to attract more birds and butterflies to your yard?</strong><br></p>\n\n<p>In this course, you'll learn the secrets to creating a garden, patio, balcony, or backyard that welcomes birds, butterflies, and other beneficial insects.  And the best part?  These secrets involve small, practical changes that you can make even if you're really busy or on a budget, or never gardened before in your life! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">And, by making small changes, you'll not only do something nice for the environment, you might also:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>*Increase vegetable and fruit yields in your garden<br>*Notice fewer pests attacking your plants<br>*Save money by eliminating or reducing pesticide use<br>*Reduce the number of mosquitoes who call your yard their home</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Best of all, you'll play an active part in helping struggling pollinator and songbird populations. And, not only will you help animals that share your backyard, you'll also help them worldwide. Way to go you!</p><p>That's because <strong class=\"redactor-inline-converted\">a portion of every purchase is donated to the Xerces Society</strong> (xerces.org), a non-profit organization that protects invertebrates, including butterflies, bees, and many other beneficial insects.  </p><p><strong class=\"redactor-inline-converted\">But be aware, this is a course where you not only learn. . .you act! Assignments, worksheets, and websites will all help you garden in a way that achieves results.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Here's what students are saying:<br></p>\n\n\n\n\n\n\n\n\n\n<p>\"Linda has done a great job of explaining in simple steps how to bring more beneficial insects, birds and butterflies etc into your garden making it a wonderful place to be. <strong class=\"redactor-inline-converted\">Her easy action steps will change the landscape of your garden quickly but with improvements you will benefit from for years to come</strong>.\" -Jackie Marie Beyer from <em>The Organic Gardener Podcast<br></em><br>\"Easy to listen to, good visuals, and great intro to the ideas of making Earth Friendly spaces in your backyard. <strong class=\"redactor-inline-converted\">I'm starting from zero knowledge in this area and she's bringing me up to speed quickly which is nice.</strong> Excited to get some bees and butterflies coming to my yard!\" -La Stengele</p>", 
    "end_date": null, 
    "title": "Gardening to Attract Birds and Butterflies", 
    "price": "25.00", 
    "instructors": "Linda Kelso", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717504_16ef_4.jpg", 
    "course_url": "https://www.udemy.com/the-secret-to-a-bird-and-butterfly-filled-backyard/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T19:58:22Z"
}