{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">There is nothing better than home grown, garden fresh tomatoes!!</strong> Close your eyes and picture the taste of the best tomato you have ever eaten.  The fresh warm juice dripping off your chin!!  Best of all you grew it yourself in your own backyard!!</p><p>Growing a great corp of tomatoes in your garden is easier than you think.  <strong class=\"redactor-inline-converted\">This course is designed to give you the skills you need to be successful your first time or your 50th time planting tomatoes in your garden!  </strong>Both the beginner and the expert will benefit from this in-depth look at tomato gardening!</p><p>This 90 minute course is a comprehensive look at how to grow your best crop of tomatoes ever.  Expert gardener Rick Stone takes you step by step through the basics of tomato gardening.  Starting out with a great tomato start, planting it just right, giving it the support and care it needs through the growing season will lead you to a tasty tomato heaven!</p><p>Weather you are growing many plants in a large garden for canning and preserving or just a few plants in containers on your balcony, Rick Stone will give you the practical knowledge you need.  Bushels of tasty garden goodness wait you at the end of this easy to follow course!</p><p><strong>Topics covered:</strong><br></p><ul><li>Heirloom vs Hybrid Tomatoes</li><li>How to choose the best tomato starts to plant</li><li>When and how to plant your tomatoes</li><li>A great little garden hack that will get you planting 6 weeks early</li><li>Simple tricks to extent your harvest in the fall</li><li>Watering, fertilizing and caring for your growing plants</li><li>Using stakes or cages to support your plants</li><li>When to harvest for the best taste</li><li>Ideas for preserving your harvest</li></ul><p><br></p><p>Like all Udemy courses, this one comes with a 30 day money back guarantee.  If for any reason you are not happy with the course, simply return it for a full refund.  BUT we are sure you are going to LOVE this course!  </p><p>Welcome to Tomato Heaven!!</p><p><br></p>", 
    "end_date": null, 
    "title": "Growing Tomato Heaven: Garden grown tomatoes made easy!", 
    "price": "20.00", 
    "instructors": "Rick Stone", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794970_cfd0.jpg", 
    "course_url": "https://www.udemy.com/growing-tomatoes/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T18:27:02Z"
}