{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong></strong>Every year homeowner's decide it is more cost-effective to update or add-on to their current home rather than move. They are ready to make their space \"fabulous\" again. They admit they are not a DIY person and would prefer to hire someone but are not sure how to protect themselves.“I am nervous about hiring a Contractor to do work on my home.\" Does this sound familiar? You are not alone.  </p>\n\n<p>Here is what students are saying about this course:</p>\n\n\n\n<p>\"I am starting a major home rehab project with a 203k loan, with no previous experience of working with a general contractor. This course was really helpful to me!\" <em><strong>Theresa L. </strong></em></p>\n\n\n\n<p>\"This course takes me through the whole process-start to finish of home improvement issues--as well as the stress one goes through.\"- <em><strong>Gary W. </strong></em></p>\n\n\n\n<p>--------------------------------------------------------------------------</p>\n\n\n\n<p>Welcome to: Hire a Home Improvement Contractor with Confidence</p>\n\n\n\n<p>  \t              Instructor E.B. Joseph is going to show you step by step how hire a Contractor and<strong> avoid getting ripped off. </strong>She completed a 450sqft Home Addition Project. She covers interview questions, decision making matrix, golden rules, hidden cost and much more. She demonstrates how to utilize the forms provided to stay on track and organize from start to finish.  She will even share how she survived a totally unexpected Mold Remediation Project. Her focus is on helping you gain confidence in an unfamiliar situation. She speaks from the homeowner's perspective. <strong>This is a major decision with major cost involved</strong>. Gain clarity and organziation with this class. </p>\n\n\n\n<p><strong>Enroll Today! Prepare now for a successful Spring and Summer project</strong>. </p>\n\n\n\n<p>Course updated on: May 2016</p>", 
    "end_date": null, 
    "title": "Hire a Home Improvement Contractor with Confidence", 
    "price": "20.00", 
    "instructors": "Ericka Bellamy Joseph", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28113_b6b1_19.jpg", 
    "course_url": "https://www.udemy.com/plan2win_house/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-29T18:04:21Z"
}