{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>What if you could use smart home products to improve your family’s security, safety &amp; enjoyment levels?</p>  <p><strong>Here are a four key everyday examples of how smart home automation could work in your life:</strong></p>  <ol>  <li>Use a mobile app      to remotely view your home via an IP camera, arm your alarm, and adjust      your lights and thermostats while away from home?</li>  <li>Be re-assured that      your home and family are safe and protected — whether you’re there or not?</li>  <li>Receive text and      email alerts on your Smartphone once an intruder enters your home or smoke      is detected?</li>  <li>Save up to 10% on      your energy bills!</li> </ol>  <p>Smart Homes can deliver all of the above benefits; <strong>BUT you could be forgiven if you find the notion of connecting your home a bewildering, confusing and expensive process.</strong> </p>  <p>People generally buy different types of smart home devices from different manufacturers ending up with various smart home devices that cannot communicate with each other.</p>  <p>To avoid these pitfalls international smart home automation expert, Gerard O’Driscoll offers this course to show you everything from A-to-Z on how to create your <strong>Home Automation</strong> system, which will reduce energy consumption, create a comfortable family environment &amp; protect your home against Intruders. </p>  <p>As someone who has already spent over $5,000 over the last year buying a variety of connected products that range from smart bulbs and thermostats to cameras and smart smoke detectors, <strong>I’m going to save you hours of frustration that I went through; and fast track building of your own smart home.</strong> </p>  <p>I take the guesswork out of creating your very own smart home. </p>  <p>Don’t want to spend money on a smart home system that does not work? Then <strong>Enroll Today</strong> in the most comprehensive course in the world covering the topic of IoT and smart home automation.</p><p><br></p>", 
    "end_date": null, 
    "title": "Home Automation For Beginners: Create Your Own Smart Home ", 
    "price": "50.00", 
    "instructors": "Gerard ODriscoll", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647034_6051_2.jpg", 
    "course_url": "https://www.udemy.com/build-your-smart-home-in-1-week-home-automation-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T17:45:58Z"
}