{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong><em>Join more than 400 smart students who are on their path to buying a house, Don't get left behind. </em></strong></p><p><strong><em>&gt;&gt;&gt;  Click “Take This Course\" button to join us today ! &lt;&lt;&lt;</em></strong></p><ul><li>Are you a first time home buyer under a time crunch ?</li><li>Do you feel completely lost and confused about the home buying process?</li><li>Do you constantly consult random website that leaves you even more confused ?</li><li>Are you unsure about the options available to finance your house ?</li><li>Do you wish if there is a course that can walk you through the full steps in detail?</li></ul><p><strong><em>Fret not! we have created a video course to help you get familiar with the complete process of buying a home Home buying shouldn't be that difficult . Read more..</em></strong></p>  <p>~*~*~*~*~*~*~*~*~*~*~*~*~ <strong>How to Buy a House - Step by Step  </strong>~*~*~*~*~*~*~*~*~*~*~*~*~*~*</p>  <p><strong>In partnership with: Kashif Iqbal &amp; Don Tepper </strong><strong>Realtor (lic. in Virginia) </strong>- Bio attached at the end of the course</p><p><strong>&gt;&gt; Course Vision </strong></p>  <p>  \tThrough this course, it is my VISION &amp; DREAM to help the anxious student in cutting through the chase of the seemingly complicated process of home-buying and to make the realization of their dream homes easier and faster because we feel your frustration &amp; confusion in finding a good and trustworthy resource to learn <strong>how to buy a house</strong></p>  <p>  \t          <strong>&gt;&gt; it's time to buy your first house</strong></p>  <p>  \t          Buying a home is a <strong>Major investment</strong>. For the majority, it will be the investment of a lifetime. During the process, you may be afraid that going through with it is a mistake. What if you end up having to pay off almost a million for something you never truly wanted? That's understandable. Regardless of the worries inside your head, however, remember that home-buying is usually a <strong>decision you'll be proud of making, </strong>come months or even a decade later. Just because you're uncertain at this point doesn't mean you don't deserve to own a house of your own, ever. Granted you do your end of the deal, you are likely going to be fine.</p>  \t<strong>&gt;&gt; You may be clouded with thoughts like:</strong><ul><li> I don't think I'm ready to make such a big investment. Buying a home seems best when you're already established. Maybe I should find a better-paying job first.</li><li>I don't want to entertain the possibility of getting buried with debts. I also don't want to end up losing my home to foreclosure.</li><li>I may be too old to buy a home. I wouldn't want to spend the rest of my life paying off the mortgage.</li><li>Even if I go through with the decision to purchase a home, I don't know the first thing about home maintenance.</li></ul><p><strong>&gt;&gt; 6 Perks of taking this course:</strong></p><p>  \t<strong> 1.</strong> It contains <strong>Action Steps</strong> with worksheets and forms. You can be provided assistance along the way.  </p>  <p>  \t<strong>2.</strong> It contains <strong>external resources</strong>. You can avail of advice from trusted sources such as Realtor sites and government agencies.  </p>  <p>  \t<strong>3.</strong> It <strong>follows up on your progress</strong>. You can <strong>take quizzes</strong> at the end of every section to evaluate how much you understand each step.  </p>  <p>  \t          <strong>4.</strong> It is detailed. You can learn of <strong>all the steps (from A to Z)</strong> required when buying a house and Does a good job explaining everything without leaving you completely confused  </p>  <p>  \t<strong>5</strong>. It is <strong>self-paced</strong>. You can take breaks in between and watch relevant videos  </p>  <p>  \t<strong>6.</strong> You will get a <strong>lifetime access </strong>with periodically updated material + I will make sure to get any <strong>q</strong><strong>uestions you have answered by a professional real estate agent</strong></p><p>&gt;&gt;<strong> </strong><strong>The Ideal student for this course is:</strong></p><ul><li>First time home buyers</li><li>Renters who want to become home owners</li><li>Newly married couple</li><li>College graduate</li><li>Realtors Looking To Help Clients</li><li>Families with children</li><li>Singles</li><li>military, or anyone who wants to own their home.</li><li>Real estate agents, especially those new in the business.</li><li>People who want to retire financially free</li><li>Real Estate Investors</li></ul><p>** if you are an existing home owner then this course might not be the right course for you, since you are already familiar with home buying process</p><p><strong>&gt;&gt; At the end of this course you should learn how to buy a house through the steps below. I will walk you through the entire process, Step by Step !!</strong></p><p>  \t<strong>Step 1 – The First Steps of buying a house for first time home buyer.</strong></p>  <ul>  \t<li>The right time to buy a house</li>  \t<li>What is due diligence?</li>  \t<li>The difference between renting and buying</li>  \t<li>Requirements to purchase a home</li>  \t<li>Building up your team</li>  \t<li>Keeping yourself protected</li>  </ul>  <p>  \t<strong>Step 2 – Finding the Right Agent &amp; Lender</strong></p>  <ul>  \t<li>The importance of hiring a real estate agent</li>  \t<li>The fundamentals of negotiating</li>  \t<li>Finding the best real estate agents</li>  \t<li>Selecting the best lenders</li>  </ul>  <p>  \t<strong>Step 3 – Getting a Pre-Approval</strong></p>  <ul>  \t<li>An introduction to the different types of home loans</li>  \t<li>The difference between fixed and adjustable rates</li>  \t<li>The difference between 15-year loans and 30-year loans</li>  \t<li>The importance of the pre-approval process</li>  \t<li>What does a good faith estimate mean?</li>  \t<li>Availability of programs for first time home-buyers</li>  \t<li>Availability of grants for first time home-buyers</li>  \t<li>Availability of loans for first time home-buyers</li>  </ul>  <p>  \t<strong>Step 4 – Looking at Homes</strong></p>  <ul>  \t<li>Tips on narrowing your search for the ideal home</li>  \t<li>What is a fixer-upper?</li>  \t<li>The difference between foreclosure and short sales</li>  \t<li>What are probate properties?</li>  \t<li>Why do you have to preview homes that are for sale?</li>  </ul>  <p>  \t<strong>Step 5 – How Do I Choose the Ideal House?</strong></p>  <ul>  \t<li>What are the different types of properties?</li>  \t<li>The advantages of owning a particular property type</li>  \t<li>What are housing cooperatives?</li>  \t<li>The top 5 mistakes home-buyers need to avoid</li>  </ul>  <p>  \t<strong>Step 6 – How to Get the Funds</strong></p>  <ul>  \t<li>Submission of loan application</li>  \t<li>The fundamentals of loan processing</li>  \t<li>What is loan underwriting?</li>  </ul>  <p>  \t<strong>Step 7 – Making the Offer</strong></p>  <ul>  \t<li>Factors to consider when making an offer for a home</li>  \t<li>The mortgages you qualify for</li>  \t<li>Long-term goals</li>  \t<li>Cash at hand</li>  \t<li>Real estate agents' advice</li>  \t<li>The importance of your opinion</li>  \t<li>What are contingencies?</li>  \t<li>The strategy on how to make a counteroffer</li>  \t<li>Signing contracts</li>  \t<li>The pre-inspection agreement</li>  \t<li>Making a money deposit</li>  \t<li>The title company and the title policy</li>  \t<li>Surveying the properties dimensions</li>  \t<li>The importance of getting home warranty</li>  </ul>  <p>  \t<strong>Step 8 – Getting Insurance</strong>  </p>  <ul><li>The importance of having insurance</li>  \t<li>How far can insurance cover for exterior and interior damages?</li>  \t<li>How far can insurance cover for damage and loss of personal belongings?</li>  \t<li>How far can insurance cover for damages caused by you and other family members?</li>  \t<li>How far can insurance cover while your home is being rebuilt?</li>  \t<li>What are Premiums?</li>  </ul>  <p>  \t<strong>Step 9 – The Closing Process</strong></p>  <ul>  \t<li>The fundamentals of the home-inspection process</li>  \t<li>Different issues that can be encountered during inspection</li>  \t<li>How do you re-negotiate?</li>  </ul>  <p>  \t<strong>Step 10 – Finally Settling Into Your New Home!</strong></p>  <ul>  \t<li>Getting keys to your new home</li>  \t<li>Moving in</li>  \t<li>Regular maintenance checklist</li>  \t<li>Discussion on mortgage payment</li>  \t<li>What is the difference between bi-weekly payments and monthly payments?</li>  </ul>  <p>_____________________________________________________</p><p>  \t          Are YOU ready to buy your first house?  </p>  <p>  \t          If YES, then take this course to learn<strong> how to buy a house</strong></p><p><strong>I Look Forward to Seeing you Inside </strong></p>", 
    "end_date": null, 
    "title": "How to Buy a House Step by Step for First Time Home Buyer", 
    "price": "25.00", 
    "instructors": "Larry Chakir", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436250_907c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-buy-a-house-step-by-step-for-first-time-home-buyer/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T05:53:10Z"
}