{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t My French Shabby Chic Furniture course covers all aspects from searching for the piece of furniture you want to refurbish, right through to presenting the item for sale &amp; marketing it, followed by a detailed description including videos, links, documents, images &amp; ongoing support, on how to build up a successful recurring client base French Shabby Chic Furniture business.  </p>  <p style=\"\">  \t The materials included are videos, images &amp; lessons, on every detail needed from start to finish.  You will know all you need to know once you have finished the course to successfully start your own hobby or business.  </p>  <p style=\"\">  \t It is entirely up to you how long it takes to complete this course - it could be tried &amp; finished in a matter of a week or you may want to take longer; once again this is a personal choice.  </p>  <p style=\"\">  \t The Layout of this course is extensively detailed, equipped with video tutorials, images &amp; written information, including links to sites of &#039;descriptive know how&#039;, with everything you will need to successfully start producing refurbished French Shabby Chic Furniture for a Living.  </p>  <p style=\"\">  \t This course is fun, full of detail, easy to understand &amp; follow, &amp; full of important knowledge, that you may not otherwise personally be aware of, to successfully produce refurbished French Shabby Chic Furniture.  </p>", 
    "end_date": null, 
    "title": "How to French Shabby Chic Furniture for a Living", 
    "price": "40.00", 
    "instructors": "Jenny Regeling", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50948_39af_10.jpg", 
    "course_url": "https://www.udemy.com/how-to-french-shabby-chic-furniture-for-a-living/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-23T07:36:43Z"
}