{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Updated May, 2016</strong>\n\n  </p>\n\n<p><strong>In May of 2008 I bought my house. Within one month, the housing market crashed and the cost of fuel, food, and utilities skyrocketed. Think it won’t happen again?</strong>\n\n  </p>\n\n<p>Would an extra $50, $100, even $200 or more every month come in handy? These kinds of savings are possible in as little time as it takes to get your next utility bill. I was able to bring my utility costs down from over $500 a month to $75. <strong>Money back in my pocket.</strong> Think of the savings that can add up to over the course of one year. \n\n  </p>\n\n<p>Written for the home owner who is tired of paying many hundreds of dollars a month in gas, electric, and water usage costs. <strong>This course is about how you can easily and simply build solar panels dirt cheap, doing simple weekend jobs that will add up to saving big dollars.</strong> If you can use simple hand tools, you'll be able to start saving money immediately. \n\n  </p>\n\n<p><strong>This course includes 19 videos, 18 downloadable audio podcasts, and a couple dozen .pdf handouts covering every aspect of building your own solar panels.</strong> It goes from explaining the fundamentals how the solar industry is tricking you into paying 1000’s of dollars more than necessary, to mounting the finished solar panels on your roof.\n\n  </p>\n\n<p> You'll learn... \n\n  </p>\n\n<ul><li>Why build your own solar panels? (Not for the reasons      you think!)\n\n</li><li>How to Get the Government to      Pay For Your Energy System.\n\n</li><li>How much manufactured solar panels should cost and what      you should pay for them.\n\n</li><li>How solar systems work, and how to decide if solar is      right for you.\n\n</li><li>The tools and materials needed,      where to buy them, and a handy shopping list.\n\n</li><li>Building a frame that will last for years.\n\n</li><li>Assembling and wiring your solar cells correctly the      first time.\n\n</li><li>Installing the finished cells      in the frame.\n\n</li><li>Wiring it all together, easily and completely.\n\n</li><li>Mounting the Plexiglas to the      frame.\n\n</li><li>Installing the junction box.\n\n</li><li>Mounting your completed solar      panel on your roof.\n\n</li></ul>\n\n<p><strong>Did I mention the FREE bonuses?</strong>\n\n  </p>\n\n<ul><li> How to get all the FREE glass needed for any solar project\n\n  </li><li>\n\n How to get FREE deep cycle batteries.\n\n  </li></ul><ul><li>\n\nHow to get FREE solar panels.</li><li>If you’re considering buying solar panels, what to ask, who to look for, and how to know if you’re being ripped off.\n\n  </li></ul>\n\nI have written my instructions in <strong>very simple English so that anybody can do this.</strong> \n\n  \n\n<p><br></p><p>Every single technique which I reveal in this course is tested, proven, and can be done easily in a weekend with basic tools<strong>. </strong>I am going to give you full step-by-step instructions and very clear diagrams and photos for you to follow. </p><p>There are even .pdf downloads you can take into the shop with you, <strong>so that you can start building your own solar panels in just a few hours</strong></p><p><strong>Best of all, depending on your “recycling” abilities you could pay $100 or less per panel.</strong>\n\n  </p>\n\n<p><strong>Every minute you delay is actually COSTING you money.... </strong>\n\n  </p>\n\n<p><strong>Get started now, for less than the cost of take-out pizza, and start saving money </strong>immediately. \n\n  </p>\n\n<p><strong>What are the requirements?</strong> \n\n  </p>\n\n<ul><li>Know how to use basic hand tools safely\n\n</li><li>No prior carpentry experience is necessary\n\n</li></ul>\n\n<p><strong>What am I going to get from this course?</strong> \n\n  </p>\n\n<ul><li>Over 20 lectures and 3 hours of content!\n\n</li><li>Reduce your home energy utility bills by 50% to 75%\n\n</li><li>Add to the resale value of your home\n\n</li><li>Make your home more energy efficient\n\n</li><li>How to get the US government and utility companies to      pay for energy improvements\n\n</li><li>Make your home more comfortable\n\n</li><li>Create a plan for simple weekend projects that will      drastically reduce your home utility costs.\n\n</li></ul>\n\n<p><strong>What is the target audience?</strong> \n\n  </p>\n\n<ul><li>Any home owners who wants to save money on utilities\n\n</li><li>People concerned about rising home energy costs and are      looking at ways to reduce them.\n\n</li><li>People who are concerned about global warming and want      to do their part to reduce their carbon footprint.\n\n</li><li>People who want to know quickest and easiest methods of      saving energy dollars without expensive upgrades.\n\n</li></ul>", 
    "end_date": null, 
    "title": "How To Build Solar Panels", 
    "price": "20.00", 
    "instructors": "David  Sieg", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426164_7f6a_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-solar-panels/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T18:45:03Z"
}