{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Thank you so much for taking a look at my course. I am delighted to have you here.<em><br><br></em><strong>Learn from an expert<br></strong>With handy hints, and tricks of the trade this is a must do course for anyone who wants to produce top quality cushions. 10 easy to follow videos will guide you through the entire process. The step-by-step approach means that by the end of this course you will be confident you can select and prepare fabrics, prepare piping and stitch everything together to produce a top quality cushion at a fraction of the retail price.</p><p><strong>Earn while you learn<br></strong>If you've ever bought cushions then you'll know how expensive they can be - even for a relatively small one. If you're looking to save money, or even make money, by making you're own top quality cushions, then this course will show you how.</p><p>10 clear instructional videos will guide you through each step of the process in detail, explaining the tools and component parts required for each step. You will learn how to measure and cut fabric and piping and how to join them together. You will learn how to insert the zip and join everything together the professional way to make a beautiful cushion.  Go from enthusiastic amateur to professional cushion maker. This course will teach you everything you need to know.</p>", 
    "end_date": null, 
    "title": "Learn How to Create Cushions & Grow a Sewing Business", 
    "price": "30.00", 
    "instructors": "Linda Turner", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685266_268f.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-make-cushions-from-sewing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T19:19:48Z"
}