{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Patching drywall and masking walls lays the essential groundwork for any good interior paint job, and doing this work yourself is an excellent way to save money. Veteran home improvement instructor Steve Maxwell shows you how to make success easy. </p><p>Patching and wall prep skills aren&#039;t just for people who do their own painting. Are you planning to hire a professional painter? Prepping walls properly beforehand is still worthwhile because it saves the painter time and hassle, and this means you save money. </p><p>Wall prep is one of those things that&#039;s frustrating if you don&#039;t know the tricks, but easy when you understand the basics. That&#039;s where this course comes in. Steve shows you exactly how to achieve professional-grade wall prep and masking results, even if you&#039;ve never done it before. </p><p><strong style=\"\">After taking Steve&#039;s course you&#039;ll know how to:</strong></p><ul style=\"\"><li style=\"\">Choose essential tools and supplies for assembling your own wall patching kit</li><li style=\"\">Patch  pesky and annoying nail and screw holes in three quick steps</li><li style=\"\">Fix drywall screw pops at least as well as any professional drywaller</li><li style=\"\">Understand drywall compound, wall spackle and setting-type wall compounds</li><li style=\"\">Patch holes using two hand tools, compound, spackle and a sanding sponge</li><li style=\"\">Repair damaged areas larger than a walnut using strips of wood as backing supports.</li><li style=\"\">Apply critical fine-tuning steps to patched areas before repainting</li><li style=\"\">Choose proper masking tape for different applications</li><li style=\"\">Apply painter&#039;s tapes so you get super-crisp painted results just like a pro</li><li style=\"\">Use painter&#039;s tape to create neat caulking around bathtubs, windows – anywhere</li></ul>", 
    "end_date": null, 
    "title": "Patching Walls Like a Pro", 
    "price": "20.00", 
    "instructors": "Steve Maxwell", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451452_f6ab.jpg", 
    "course_url": "https://www.udemy.com/patching-walls-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T18:06:37Z"
}