{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Note: Now fully closed captioned.</strong></em></p>\n\n<p><strong class=\"redactor-inline-converted\">Are you ready for chickens?</strong>  How do you know if you even want chickens?  What do you need to know, and what questions do you ask?  How do you make the decision?</p>\n\n<p>How do you get set up for chickens?  How quickly do they grow up?  When will they lay eggs?  How do you take care of them?  How messy will they be?</p>\n\n\n\n<p><strong>In many parts of the world, people wouldn't <em class=\"redactor-inline-converted\">think</em> of <em>not</em> having chickens!</strong>  They've been our companion animals for thousands of years, and no longer resemble their wild cousins.  But as we moved into cities, we lost our way and forgot to bring our fowl friends with us.  Factory farms produce our eggs, ship them in bulk into stores where we buy dozens of sterilized uniform sized and colored eggs completely disconnected from the miraculous and amazing animals that created them.</p>\n\n<p>Now many of us have moved back out of the cities and we're starting to pick up our ancestors wisdom and bring chickens back. Raising chickens is easy, and it makes sense for some families.  I raise chickens for their eggs, and some backyard farmers are even raising their own chickens for meat.  As the world goes through a variety of changes, knowing our food suppliers has become an issue.  We can practice some small farming techniques by raising our own small flock of chickens.</p>\n\n\n\n<p>Each hen provides <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">12 to 20 DOZEN</strong></em> eggs a year, for at least 3 years, depending on breed.    </p>\n\n\n\n<p>In this course, I take you on a behind-the-scenes look at real chickens and having a real life with chickens. I've decided to narrate while you watch my flock through most of the course, and I'm going to air all their dirty laundry.</p>\n\n\n\n<p>What are some of the benefits of raising chickens?</p>\n\n\n\n<ul><li>They turn bugs (ticks, cutworms, mosquitoes) &amp; weeds (grass, poison ivy, dandelion flowers) into eggs</li><li>Overnight composting machines -- their diet is very close to a human diet, they eat my un-popped popcorn kernels, leftovers that are a little too old, toaster crumbs, etc.</li><li>You get an Easter egg hunt every day!  My 13 hens are routinely giving me 7-9 eggs every day in the spring.</li><li>Plenty of opportunities for good exercise: walking around, lifting 50# bags of chicken feed and 40# bags of scratch feeds</li><li>You can save on TV: Watching chickens is much more fun that watching the news</li><li>And they help with relaxation - watching animals, especially baby animals, raises your endorphins &amp; oxytocin levels.  They're also a good focus for mindfulness meditations.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Come join the party!</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">About me &amp; my chickens: I free-range my 17 chickens on the outskirts of an upstate NY city on a 1.3 acre rented home plot. I'm a single mom, with 2 college-age kids living at home, and I handle the vast majority of the chicken duties by myself.</em></p>\n\n\n\n<p>Note: This course includes a small number of DIY (Do-It-Yourself) projects, which are entirely optional and only comprise a small portion of the course materials.  They are rough guidelines and ideas for things you can do with upcycled or inexpensive materials that will save you money, time, or enhance your chicken experience.  The projects may require tools, supplies, and some experience in handling them, or a friend or neighbor who is willing to help you out. But they are all entirely optional, and you are responsible for your own safety.</p>", 
    "end_date": null, 
    "title": "Raising Chickens in your Backyard: a sustainable food source", 
    "price": "25.00", 
    "instructors": "Criss Ittermann", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533496_c78e.jpg", 
    "course_url": "https://www.udemy.com/raising-chickens-breeds-bantams-coop-keeping-hens-eggs-chicks-tractor/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-21T14:22:53Z"
}