{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong><em></em></strong>Thank you so much for taking a look at my course. I am delighted to have you here.<em><br><br></em><strong>Learn from an expert<br></strong>With handy hints, and tricks of the trade this is a must do course for anyone who wants to produce top quality Roman blinds. Over 20 easy to follow videos will guide you through the entire process of making a Roman Blind. The step-by-step approach means that by the end of this course you will be confident you can measure a window accurately, select and prepare fabrics, and stitch everything together to produce a top quality Roman blind at a fraction of the retail price. </p><p><strong>Earn while you learn<br></strong>If you've ever bought a top quality Roman blind then you'll know how expensive they are - even for a relatively small one.  If you're looking to save money, or even make money, by making you're own top quality Roman blinds, then this course will show you how.</p><p>Over 20 clear instructional videos, accompanied by downloadable guides and checklists, will guide you through each step of the process in detail, explaining the tools and component parts required for each step. You will learn how to measure and cut the lining and face fabric and how to join them all together to make a beautiful Roman blind. You will understand how to work out the different flap sizes and finally how to finish off your blind ready for installation. This course will teach you how everything is prepared and assembled to meet current child safety legislation and the different options available. Go from enthusiastic amateur to professional Roman Blind maker. This course will teach you everything you need to know.</p><p><br></p>", 
    "end_date": null, 
    "title": "Roman Blind Making Sewing The Professional Way", 
    "price": "30.00", 
    "instructors": "Linda Turner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615768_681f_7.jpg", 
    "course_url": "https://www.udemy.com/roman-blind-making/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T12:49:22Z"
}