{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  Join our brand new gardening course!  This course just went live on February 4, 2015 and we already have 600 + students.  Please come join us!  </p>  <p>  \t<strong style=\"\">Everyone wants a beautiful yard and a productive vegetable garden.  </strong> Full of fun and exotic flowers and veggies.  By learning to grow your own seedlings indoors, you expand your gardens variety and fill it with plants most of the people at the local garden center have never even heard of.  And all for a fraction of the cost!  </p>  <p>  \t<strong style=\"\">Today you will learn everything you need to know about starting seedlings indoors in your basement, garage or even your living room!  </strong>  </p>  <p>  \t                This course is designed to teach <strong style=\"\">YOU</strong> the basics of seed starting.  You will learn what you need to be successful the very first time you grow your own seedlings.  In just two hours you will be ready to buy a few supplies and grow the most beautiful, productive garden in town!  </p>  <p>  \t<strong style=\"\">Simple Steps for Growing Your Own Seedlings Indoors</strong>  </p>  <ul style=\"\">  \t<li>Materials &amp; Equipment</li>  \t<li>Soil</li>  \t<li>Care</li>  \t<li>Timing</li>  \t<li>Seeds</li>  </ul>  <p style=\"\">  \t        Whether you are starting your first garden or you have a thumb as green as an emerald you need this course to get you the information you need to grow all your own seedlings.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t            What do you need to get growing?  Really all it takes is a container, some soil and a light!  But there is so much more out there that makes the job of starting seeds much easier.  Soon you will know everything you should buy and which products not to bother with.  </p>  <p style=\"\">  \t            Seeds need something to grow in.  Will you use a seedling mix, a potting soil or a soil less mix?  Or maybe you will make your own!!  </p>  <p style=\"\">  \t            How much water do your seedlings need?  How long should the lights be on?  What about fertilizer and what the heck is Dampening Off?  When we are finished you will know exactly how to pamper those new seedlings.  </p>  <p style=\"\">  \t            So when should I be planting my seeds anyway?  Should I keep them indoors for 3 weeks?  4, 6, 8??  Planting your seeds at the right time so that they are ready just in time to go out in the garden is a skill you will have after only 120 minutes of seed starting instruction!  </p>  <p style=\"\">  \t          Lots of plants do just fine when planted directly in the garden.  So which plants should I start indoors and which would be better off starting their lives out in the garden.  You will know this and how to take care of you new seed supply when your are finished taking Seed Starting Simplified!  </p>  <p style=\"\">  \t<strong style=\"\">Of course you have the Udemy 30 day money back guarantee!</strong> I&#039;m sure in just a few short weeks your yard and garden is going to be packed with new flowers and veggies.  But if for any reason you are not satisfied with the course please return it within 30 days for a full refund!  </p>", 
    "end_date": null, 
    "title": "Seed Starting Simplified: Grow your own garden seedlings ", 
    "price": "30.00", 
    "instructors": "Rick Stone", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394070_834d_2.jpg", 
    "course_url": "https://www.udemy.com/indoor-seed-starting-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T16:42:30Z"
}