{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong><strong><em><strong><strong><em>THIS IS the first course of a two-course series. <br>The Essential BioDynamics</em> must be taken BEFORE the <em>Bio-Organic Farming &amp; Gardening </em>course.</strong></strong></em></strong><br></strong></p>\n\n<p>At any time, if something does not make sense to you, or you have a particular case to ask about- USE this course as an info-forum! ASK ANY and EVERY QUESTION in course discussions, and this shall add to everyone's benefit, in addition to your own.</p><strong>ALLOW THE UNIVERSE TO IMPROVE YOUR LIFE.</strong><br>\n\n\n<p>WANT your own Command, and a better flow in your daily life? How about the most vital &amp; alive produce from your farm or garden? </p>\n\n<p>Perhaps, as most do, \nyou believe the Cosmos is just a nice nighttime light show with no  \npractical use........?\n\t<strong></strong><strong></strong>\n</p>\n\n<p><strong>The\n Cosmos, or physical universe, is in fact the majority mechanical and \nenergetic driver for ALL events which occur on Planet Earth. Physics sets Guidelines, Dynamics maintains Life Conditions, <strong>Entanglement connects All. </strong></strong></p>\n\n\n\n<p>Paying attention to Cosmic rythmns which are already present is to arrive in sync with the Universe, to <em>finally </em><strong>benefit from</strong> the bountiful Cosmic dance.\n</p>\n\n<p>BioDynamically-managed gardens &amp; farms are among the most robust &amp; high-yielding on the planet- and the same simpl easy-to-learn approach  applies directly to all living systems- <br>such as humans, You and I.</p>\n\n<p>In this course, you will learn HOW:<br>\n</p>\n\n<p>-\n To interpret a BD calendar, quickly see which events &amp; energies are\n prevalent on any given day, and the actions best to take.\n\t<br>\n</p>\n\n<p>- The \nMoon, Sun, Earth, planets &amp; stars actually move- or dance- together \nto create \n\t<em>real </em>&amp; on-going, physical &amp; energetic changes\n upon the Earth.\n\t<br>\n</p>\n\n<p>- YOU can apply daily Cosmic changes to optimize your farming or gardening efforts, and the \nevents in your everyday life.\n\t\n</p>\n\n<p>- The four basic elements each affect our behaviours &amp; our farming efforts.\n\t\n</p>\n\n<p>- In 1924, the poor chemical state of German farming brought about the <em>science</em> of BD: the roles of Rudolph Steiner &amp; his Agricultural Course, Maria Thun and Peter Proctor.\n\t\n</p>\n\n<p>- Big Agro business interests benefit from monopolizing  worldwide food production, and discouraging nature-based farming.<br>\n</p>\n\n<p>- BD, despite the proven benefits, is not embraced socially worldwide.\n\t\n</p>\n\n<p>In actual fact, the relatively new \nscience or body of understood, observed phenomena that we now know as \nBioDynamics, is based in the most ancient of our sciences. Our first \ncosmic diviners became scientists by routinely observing the night sky \nand were the humans who first noticed how certain cosmic movements and \nevents brought changes onto the Earth- with her soil, growing plants, \nand \n\t<em>with humans themselves</em>.\n\t\n</p>\n\n<p>This course comes to you from <br>1. the SimPLife natural living school in the ancient Himalayan kingdom of Ladakh, also from <br>2. our current winter home of South Korea, as well as from <br>3. Macau, China- <br>so this is something of a World Travel doc as well. </p>\n\n<p><strong>Not for info-tourists</strong>,\n you will be fairly tested for knowing the basic effects of Cosmos upon \nliving beings...Energy practitioners, career farmers, backyard hobbyists, community leaders, urban or rural- or just folks wanting a bit of simpl sensibility- will find this informative, creatively useful \n&amp; essential!\n\t\n</p>", 
    "end_date": null, 
    "title": "The Essential BioDynamics: Self-Reliance-By-Cosmos", 
    "price": "40.00", 
    "instructors": "im Simpl", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656904_c2ab_2.jpg", 
    "course_url": "https://www.udemy.com/biodynamics/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T11:35:40Z"
}