{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong style=\"\">Plant and grow a year-round garden</strong>.  Learn everything you need to know to extend your growing season to 365 days a year no matter where you live.  Not only will you learn how to have peas in June and tomatoes in August, but you will also learn how to grow tasty veggies in your garden all year long.  Including the dead of winter!  All using simple, inexpensive structures like mini hoop houses and cold frames.</p><p>This is a very thorough look at everything you need to know about year round gardening.  With over 3 1/2 hours of content broken into very manageable pieces.  Learn what crops to grow, when to plant them and what you need to do to protect your crops so that you can have something to harvest EVERY day of the year.   </p><p><strong style=\"\">Winter Gardening</strong> - Plant the right kinds of plants at the right time of year and you can have fresh picked veggies even in the coldest months of the winter.  Carrots, lettuce, mache, spinach, Swiss Chard, kale and more can be ready for you to pick from your hoop houses and cold frames all winter long.</p><p><strong style=\"\">Spring Gardening </strong>- Use your cold frame or hoop house to provide a nice warm environment to get your seeds and seedlings started earlier in the spring than you ever thought possible.</p><p><strong style=\"\">Fall Gardening</strong> - Fabric row covers and hoop houses will help you extend your growing season well into the late fall.  Adding 90 days or more harvest time to your favorite cool season veggies and even helping to add ripening time for your late summer tomatoes!</p><p><strong style=\"\">Course Outline</strong></p><ol style=\"\"><li>Introduction</li><li>Garden Bed Preparation</li><li>Winter Crop Selection</li><li>Planting Times</li><li>Protecting your Crops from the cold</li><li>Harvesting</li><li>Spring Gardening</li><li>Fall Gardening</li></ol><div style=\"\">Please join me to learn everything needed to add this  new skill to your gardening tool box.  </div>", 
    "end_date": null, 
    "title": "Year Round Gardening", 
    "price": "40.00", 
    "instructors": "Rick Stone", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340940_9381_2.jpg", 
    "course_url": "https://www.udemy.com/year-round-gardening/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T22:29:30Z"
}