{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>(This course is not: which websites, galleries, or art fairs to buy from; how much to spend; what to buy... or anything that resembles holding your hand or making important and personal decisions for you!)</p>\n\n<p>This course is the <strong>beginners essentials guide</strong> to take the overwhelm out of art collecting, and when you sign up the training material is yours for life! </p>\n\n<p>You'll learn valuable skills for any time you go to an <em>Art Basel</em>, or an <em>Affordable Art Fair</em>, down to a gallery district, or when you are trying to buy art online.</p>\n\n<p>Art collecting <em>seems</em> difficult because some sellers deliberately make it confusing and elite, and because there is so much to choose from when we actually want to buy art.<br></p>\n\n\n\n<p>I have been to all fours corners of the art world as an Art Advisor and Curator and discovered there is NO REASON everyone and anyone at every budget level can't learn to collect and buy art. I decided to create a course containing the same strategies I teach to my clients when I train new collectors, so ANYONE could study how to buy art online from the comfort of their home. Helping as many people as possible to understand, collect and buy art they love - levelling the art world playing field - is a huge passion of mine.</p>\n\n\n\n<p>Ask me anything! I also wanted to be accessible to my students, so that they could reach me for answers or advice, and talk to each other, and this course on Udemy offers that.</p>\n\n\n\n<p>The course is different, tell everyone, help lead the way! Confusion and difficulty in enjoying art should be a thing of the past. <em></em></p>\n\n\n\n<p>It's really exciting to be offering my passion to the world. So many of us have an inner art collector just waiting to be unleashed. Sign up, and I'll see you on the other side where we'll begin your training..</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "You Can Buy Art - collecting  made clear", 
    "price": 0, 
    "instructors": "Suraya Warden", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515380_d035_2.jpg", 
    "course_url": "https://www.udemy.com/art-collecting-made-clear/", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T11:24:34Z"
}