{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>「カーテン買うのは初めてでよくわからない」「カーテンの事を詳しく調べている時間がない」「カーテン購入で失敗したらどうしよう？」</strong></p><p>そんな「初心者」の方でも短時間で効率よくカーテン選びができる、ベテラン購入者が実践している５つのステップを学ぶ講座です。</p><p>カーテンは失敗したからと、何度も買い換えできるものではありません。家族が健康で幸せに暮らせるカーテン選びを、業界最高レベルのカウンセラー「<strong>カーテンマン</strong>」がレクチャーします！</p><p><strong>【カリキュラム】</strong></p><p><strong>（１）Step-1 機能性</strong></p><p>窓から入ってくる周辺環境の影響を考え、カーテンで解決できる機能性について検討します。カーテン購入経験が初めての方ほど、最初にやるべき課題を知らずに購入してしまい、暮らし始めてからその不便さに気付き失敗したと後悔します。カーテンにはどのような機能があり、それがどのような生活シーンで役立つのかを学びます。</p><p><strong>（２）Step-2 柄と色</strong></p><p>インテリアテイストから始める、カーテンコーディネートを進めていきます。無計画にカーテンを衝動買いしてしまうと、実際に使ってみると部屋の雰囲気と合わず嫌になってしまうことがあります。リビング・寝室・子供部屋、各部屋に適したカーテンデザインの種類と選び方を学びます。</p><p><strong>（３）Step-3 スタイル</strong></p><p>「カーテンは２枚に分けて左右に開くもの」と言う考え方は、もう昔のもの。多種多様な窓形状が増えた現代では、ライフスタイルにあわせてカーテンスタイルも変えていく必要があります。ご家族の生活パターンを考えて使い勝手の良い、カーテンスタイルの決め方を学びます。</p><p><strong>（４）Step-4　サイズの計測</strong></p><p>素人が測ると失敗する、それはルールを知らなかっただけの話です。このセクションでは、プロが使うカーテン計測のルールを学びます。初めての方でも間違えることなく、カーテンサイズを正確に計測することができます。</p><p><strong>（５）Step-5　予算の確認</strong></p><p>このセクションでは最終的な予算の組み立て方、予算調整の仕方を学びます。あなたのライフステージに相応しいカーテンは何か？カーテンの価値がわかれば必要な予算にも理解が深まり、カーテンを購入した後もずっと満足感が得られます。</p><p><strong>【この講座の特徴】</strong></p><p>どこから始めてよいかわからないカーテン選びの手順を、５つのステップに簡潔にまとめました。</p><p>本講座は引越やリフォームを機にカーテン購入を検討されている方向けに、短期間に効率よくしかも失敗しないための行動手順を解説した教材です。</p><p>カーテン選びはまず基本的な情報を学ぶことが重要で、それ以上の知識や経験から得られるノウハウはプロから引き出して問題解決できます。あなたがこの講座でカーテンの基本を学ぶことで、プロの提案が本当に我が家に相応しいものかどうか正しく判断できるようになります。</p><p>あなたも経験あるはず､初めてのカーテン購入体験。ぐずる子供を無理矢理連れ出し週末ショールームや専門店を駆け巡った時のこと。カーテンのこと何も知らないから、とにかく情報収集に一生懸命でした。</p><p>最終的には家族も疲れ果ててしまって、もうこれイイんじゃない？と適当に決めてしまった方も多いはず。でも実際に部屋で暮らし始めると、いろんな不満が出てきます。ネットで調べてみれば悩みをズバリ解決してくれる、夢のような商品があるではありませんか！最初からわかっていれば、こっちを選んでいたのに！</p><p>昔は自分の足で稼がなければ情報は手に入りませんでしたが、今ではネット検索で思うように情報が手に入る時代になりました。便利な時代になりましたが、情報がありすぎてどれが本物か見極めがつきません。</p><p>２０年間私のカーテン通販を振り返ってみると、ずっとお客様の相談を受けて悩みを解決してきた人生でした。それも同じような悩みを持つ方に、同じ内容の解決方法を繰り返し繰り返しお伝えしてきたのです。</p><p>「もっと早く、カーテンマンに出会いたかった･･･。」これは昨日お電話でカーテン購入のご相談をいただいた、女性の言葉です。</p><p>新居購入時は何も「考え」ず、業者の言われるままカーテンを購入されました。実際に住んでみると、窓辺には様々な問題があることに気がつかれたのです。当時私に出会っていれば、正しいカーテンの選択ができたのに！と悔やまれていました。</p><p>私の店には全国から、このような相談が毎日のように届きます。生活に密着した必需品であるカーテンなのに、カーテンの正しい選び方や購入の仕方を学ぶ場所はどこにもありません。</p><p>カーテン選びはプロの力を借りても、すべて任せてしまうと失敗します。各お部屋の環境を調査したうえで、どのようなカーテンを選べばその部屋で快適に過ごすことができるのか、ご自身で最終判断する必要があります。</p><p>そこであなたのために、正しいカーテンの選び方講座を作りました。これまでに多くの方が壁に当たり、失敗してきた問題点は、２０年間全国３万人の悩み相談を解決してきた私には手に取るようにわかります。</p><p>カーテンのプロはもちろん知識も経験も豊富ですが、あなたにカーテンの知識がないと適切な情報を引き出すことができません。これはネットで情報検索するときと同じで、あなたが求めない限り良い商品提案は出てこないのです。</p><p>本講座を学ぶことで、カーテン選びに費やす時間を短縮することができます。仕事や家事・育児で忙しいあなたでも大丈夫！時間があるときや通勤時間などスキマ時間を使って少しづつ、失敗しないカーテン選びの手順をポイントだけおさえて理解できるよう作成しました。</p><p>カーテンのことでご夫婦の意見が分かれることがありますが、お二人が一緒に講座の情報を共有することで我が家の快適な住環境を共同作業で作り上げることができます。</p><p>事前にカーテン計画を練ることで、無駄なお店巡り何度もする必要がなくなります。購入したいカーテンは決めてありますので、お店に出かけても買い物は短時間で済ますことができます。</p><p>自分たちで考えこだわり抜いたカーテンは、愛着がわいて友達に自慢したくなります。そして家族との会話が弾み絆が生まれ、明るい家庭を築くことができます。</p><p>また２０年間のカーテンカウンセリングで培ったノウハウを盛り込んだ内容は、インテリアコーディネーター・リフォーム業・設計士・カーテン専門店新人育成など、カーテン教育コンテンツとしても役立てていただける内容です。</p><p><strong>【カリキュラムの詳細一覧】</strong></p><p>【Step1-1】機能性－窓から入ってくる周辺環境の影響を考える</p><p>【Step1-2】花粉症の方は室内の空気清浄が大切です</p><p>【Step1-3】朝日や西日の太陽熱で熱中症の危険性</p><p>【Step1-4】周りが明るくて夜眠れない、睡眠不足の方</p><p>【Step1-5】隣人が部屋を覗いているんです！</p><p>【Step1-6】暖房しても部屋が寒いのは窓の熱流出が原因</p><p>【Step1-7】車や電車の走行音が激しくノイローゼになりそう</p><p>【Step1-8】部屋の中でも日焼けしたくない敏感肌</p><p>【Step2-1】柄と色－インテリアテイストから始めるコーディネート</p><p>【Step2-2】無地－シンプルなインテリアに上質な空間を求める</p><p>【Step2-3】カジュアル－赤ちゃんから中高生の子供部屋に定番</p><p>【Step2-4】ナチュラル－自然志向のおおらかなデザインと素朴な風合い</p><p>【Step2-5】チェック＆ストライプ－高校生・大学生の青春をサポート</p><p>【Step2-6】モダン－新社会人から若いご夫婦に人気のトレンドスタイル</p><p>【Step2-7】クラシック－違いがわかる大人の至極の空間演出に</p><p>【Step2-8】エレガント－上質で上品なデザインが品格を表します</p><p>【Step2-9】和風－純日本建築の広縁や和室に馴染む定番デザイン</p><p>【Step2-10】花柄－華やかな彩りは女性らしさを表現し部屋を明るくします</p><p>【Step2-11】レース－目隠し機能からデコレーションまで多彩な役割</p><p>【Step3-1】スタイル－窓の形状や活用方法で選択肢が変わるスタイルのメリット・デメリット</p><p>【Step3-2】カーテン２倍ヒダ－オーダーカーテンの定番仕様</p><p>【Step3-3】カーテン１．５倍ヒダ－既製品の定番ながら大柄デザインにも最適</p><p>【Step3-4】フラットカーテン１．３倍－楽しいデザインを平面でめいっぱい楽しむ</p><p>【Step3-5】プレーンシェード－上下昇降タイプのたたみあげカーテン</p><p>【Step3-6】シャープシェード－直線的なたたみがモダンな印象を醸し出すモダンシェード</p><p>【Step3-7】バルーンシェード－レースの裾が半円のバルーンを作り上下に昇降</p><p>【Step3-8】ダブルシェード－一台二役でコンパクトに窓辺を選出</p><p>【Step3-9】センタークロス－窓辺を上品に演出するデコレーションタイプのレース</p><p>【Step3-10】スカラップレース－出窓や腰高窓をおしゃれに演出するデザインレース</p><p>【Step4-1】サイズの計測－素人でも失敗しないプロが使うカーテン計測のツボ</p><p>【Step4-2】窓タイプの確認－カーテンの丈をどこまで作るか判定に必要なポイント</p><p>【Step4-3】幅サイズの計測－既製品とオーダーでは考え方が違うので要注意</p><p>【Step4-4】高さサイズ計測－窓に適した仕上がり丈を計測するコツとは？</p><p>【Step4-5】開きのタイプ－窓の使い勝手で考えるとと自ずと見えてくる</p><p>【Step4-6】フックのタイプ－カーテンレールのタイプと取付位置の見極めが肝心</p><p>【Step5-1】予算の確認－ライフステージでカーテンの価値を知る</p><p>【Step5-2】単身期－大学生・新社会人・単身赴任</p><p>【Step5-3】新婚期ー新婚カップル</p><p>【Step5-4】子育て期ー赤ちゃんとの生活</p><p>【Step5-5】教育期－中学受験・高校受験・大学受験</p><p>【Step5-6】子供独立期－夫婦二人だけの新生活</p><p>【Step5-7】老夫婦期ー体力の衰えによる健康維持を考える</p><p>【Step5-8】予算調整テクニック</p><p>【Step5-9】信頼できるカーテン専門店</p>", 
    "end_date": null, 
    "title": "プロ直伝！引越カーテン選び方完全ガイド５５｜１０年先でも後悔しない最短５ステップ", 
    "price": "20.00", 
    "instructors": "カーテンマン (Koji Shinoda)", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684678_1be2.jpg", 
    "course_url": "https://www.udemy.com/curtain5step/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T07:24:03Z"
}