{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>「洋服は縫えるけれど、カーテンは縫ったことがない」「きれいに仕上がるのかとても心配」「生地をどれぐらい用意したらいいのかわからない」「どんな手順で縫えばよいのかわからない」</p><p>そんな「カーテン手作り初心者」のあなたでも、たった半日でプロが使っているテクニック満載の縫製手順をマスターすることができます。</p><p>カーテン縫製実務１０年、カーテン通販実務２０年のベテラン講師「カーテンマン」が、優しくレクチャーします！</p><p>【カリキュラム】</p><p>（1）準備編</p><p>カーテンの制作作業を始める前に、準備しておくべき情報と道具があることを学びます。</p><p>（2）縫製作業編</p><p>美しくカーテンを仕上げるための作業工程を、１３のレクチャーにて学びます。</p><p>【この講座の特徴】</p><p>カーテンの作り方手順の情報は他所でも簡単に手に入りますが、カーテン縫製の現役プロが自ら出演して、生地の裁断からフックの差し込み完了まで、テクニックを惜しげも無く披露したものは、この講座でしか手に入りません。</p><p>美しく仕上げることができるか不安で、カーテンの手作りに不安を抱えておられたら、ぜひこの講座でカーテン縫製をマスターして下さい。</p><p>「カーテンの作り方」をネットで検索すると沢山情報は入手できますが、その内容をよく見ますとどれもほとんど同じで、単純に作り方の手順を教えているだけのモノが多いように思います。</p><p>実際に紹介されている手順どおりにカーテンの手作りを進めてみますと、「この場合どこをどうやって縫えばいいの？」と何度も壁にぶち当たることでしょう。</p><p>カーテンを作る順番がわかっても、実際に作業をするときの細かな手順とかコツといったモノが、大幅に省略された情報だからです。そうしたテクニックという情報は、実際に作業する本人しかわからない経験上のモノですので、なかなか公の場に出てこない情報なのです。</p><p>あこはんずで生地や縫製資材を購入されたお客様から、手作りを始めたところよくわからないとご相談が入り、個別に電話やメールなどでサポートさせていただくことが多々ありました。</p><p>しかしそれでも言葉や文字でお伝えできる情報には限界がありますので、いつもサポートした後でうまく伝わったかなぁと心配でヤキモキしていました。</p><p>ならば実際に私たちが手作りしている様子を撮影して、初めての方でも美しく仕上がる、プロのテクニックを随所に盛り込んだ、動画つきのカーテン縫製手順講座を作ろう！と決意して公開させていただくことになりました。</p><p>皆さんはプロになるわけではありませんから、オーダーカーテン縫製のプロテクニックを学ぶ必要はありません。学ぶ必要があるのは、カーテンを美しく仕上げるためのちょっとしたコツなのです。このコツを知っているのと知らないのでは、窓に掛けたときの仕上がりがずいぶん違ってきますので、初めての方はもちろん手作り経験のある方にもお勧めの内容になっています。</p><p>過去にカーテンを手作りされた経験のある方でも、今ひとつ仕上がりに不満をお持ちであれば、ぜひおさらいの意味でプロの縫製手順を学んでみてはいかがでしょうか。</p><p>【カリキュラムの詳細一覧】</p><p>【1-1】カーテン縫製の作業に入る前に準備しておくもの</p><p>【2-1】自宅でカーテンを裁断する場所の選び方と、実際に裁断する方法を学びます。</p><p>【2-2】２枚のカーテン生地をはぎ合わせる時、柄合わせが重要なポイントになります。</p><p>【2-3】２枚の生地をはぎ合わせる時のコツを学びます。</p><p>【2-4】カーテンを美しく仕上げるためには、上部の水平カットが重要なポイントになります。</p><p>【2-5】カーテンのヒダを取る部分に、芯地を縫いつける手順を学びます。</p><p>【2-6】芯地を縫い付けた後、上部を仕上げます。</p><p>【2-7】カーテンの両端は、生地を三つ巻して仕上げます。</p><p>【2-8】窓にピッタリのサイズに仕上がるよう、丈サイズの決め方を学びます。</p><p>【2-9】下部の生地を折り返して、裾の仕上げを行います。</p><p>【2-10】ヒダを取る位置の計算方法を学びます。</p><p>【2-11】ヒダの取り方を学びます。</p><p>【2-12】ヒダにフックを差し込めば完成です！</p><p>【2-13】カーテンを束ねるタッセルの簡単な作り方を学びます。</p><p>【よくある質問】</p><p>Ｑ．ミシンはまだ初心者ですが、それでも作れますか？</p><p>Ａ．ミシンの扱いにはもちろん習熟が必要ですが、カーテンは洋服と違って直線縫いがメインになりますので、操作に慣れていただければ問題ないかと思います。初めての方でも美しく仕上げるコツも、随所に盛り込んでいます。</p>", 
    "end_date": null, 
    "title": "現役プロから学ぶ！美しいカーテンの作り方講座", 
    "price": "20.00", 
    "instructors": "カーテンマン (Koji Shinoda)", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789430_6482.jpg", 
    "course_url": "https://www.udemy.com/sewing-curtains/", 
    "currency": "USD", 
    "subject_name": [
        "Home Improvement"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T09:15:50Z"
}