{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                    \n                    Mapping techniques have evolved in a revolutionary way in recent years. In our daily life we ​​use browsers to calculate optimal routes, locate restaurants, geolocalizamos our photos, our location or share with friends.\r\nVirtually everything that happens in the world has a geographic component.\r\nThis is the basis of geographical information systems, and in this course will learn to go a little further than Google Maps.\r\nIncreasingly administrations and scientific organizations release their s geographic data and there is growing open source software such as that we will use in the course and free ware that allow us to incorporate, create and manage these data and free universal access.\r\nThus the public has for the first time ever access to huge amounts of data extremely high value and GIS softwares do not own that allow them to visualize, process, analyze and create professional maps, in turn generating more and better knowledge of high value added and returning to society.\r\nFrom this course, proposed by Open Online Academy (OOAc) in New York and University Netowrk for Architectural and Urban Sustainability (UNAUS) in Barcelona, ​​we understand that one of the main concerns at the global level are natural disasters, increased greatly by climate change, so the practical part of the course Introduction to GIS will focus on the analysis of the effects of climate change in different regions of the world, both for its technological interest, as a scientist and human.\r\nThe program used is that open source software (open source) or QGis Quantum Gis, and several of visalización geoportals and querying of spatial data that will work throughout the course.\r\nSKILLS ACQUIRED\r\nGIS software to manage basic user level (QGis)\r\nKnow the main sources of geographic data and resources on natural disasters and how to incorporate them into your project GIS\r\nUnderstand the different formats of map files and how to use them\r\nAnalyze the data and perform geoprocesado\r\nKnowing the architecture of a GIS project\r\nGenerate your own maps professionals\n\n                                            Syllabus\n                        \r\nThe digital map revolution\r\nGeoprocesos vector analysis\r\nMDT and raster analysis\r\nGIS Project\r\n\n                                    ", "end_date": "2014-12-08T00:00:00Z", "title": "Arch301: Iniciación a los SIG y su Aplicación a la Gestión de Desastres Naturales", "price": 0, "instructors": "Rocío López Dopico and Maria Ramos Sanz", "institution_name": ["Open Online Academy, New York", "UNAUS (University Network for Architectural and Urban Sustainability). Barcelona"], "commitment": "", "subject_name": ["Engineering"], "course_url": "https://www.ooed.org/learn/introduction-to-gis-and-mapping-fall-2014", "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["EdCast"], "start_date": "2014-10-20T00:00:00Z"}