{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                    \n                    The actions of ordinary people are often absent in studies of urban renewal and urban ecology. Around the world, people who are fed up with environmental degradation and the breakdown of their communities come together to transform blighted vacant lots, trashed-out stream corridors, polluted estuaries, and other “broken places.” Civic ecology practices—such as community gardening, wetlands restoration, river cleanups, and tree planting—are a means for people to express resilience and rebuild communities marked by disaster and disinvestment.\n\nCivic ecology draws on psychology, sociology, political science, education, ecology, and social-ecological systems resilience to understand how and why people care for nature and their communities.\n\nThroughout this course, you will:\n\nExplore the people, places, and practices that restore nature and revitalize neighborhoods, making a difference in ways big and small.\n\tDiscuss and evaluate contemporary thinking in resilience, social-ecological systems, and the relationship between nature and human/community wellbeing.\n\tGrasp an understanding of how civic ecology enables those with limited resources to defy and cope with daily struggles, including after disaster and war.\n\tAcquire the knowledge and skill set to enact change in your own community.\n\tParticipate in a civic ecology service learning project to turn classroom learning into real-life application.\nThis course is ideal for a learner who is intrigued by both social and environmental concerns, or simply has a desire to dive into an emerging 21st century, cross-disciplinary subject area. You will complete this course with a keener awareness of social-ecological issues and concerns, as well as a greater knowledge of the practical steps required to rebuild and maintain community and nature in a world marked by inequality, conflict, and climate change.\n\n                                    ", "end_date": "2016-10-11T00:00:00Z", "title": "ENVSCI1500x: Reclaiming Broken Places: Introduction to Civic Ecology", "price": 0, "instructors": "Marianne E. Krasny", "institution_name": ["Cornell University"], "commitment": "4 hours", "subject_name": ["Engineering"], "course_url": "https://www.edx.org/course/reclaiming-broken-places-introduction-cornellx-envsci1500x-0", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-09-06T00:00:00Z"}