{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                    \n                    Comment définir et comprendre la notion d’espace? Comment l’urbanisation, la mobilité, Internet et la mondialisation ont-ils influencé notre perception du temps et de l’espace? Ce cours a pour objectif de définir la notion d’espace en apportant des clés de lecture pour comprendre les sociétés qui nous entourent.\n\nÀ la fois théorique et pratique, ce cours privilégie les compétences sur les « contenus » factuels et valorise une approche par l’intelligence collective. Ce cours propose de saisir la notion d’espace à partir de vos expériences quotidiennes, de vos perceptions et de vos pratiques.\n\nDans EspaceX, nous explorons ensemble la ville, l’urbanisation, l’urbanité, et l’urbanisme, l’acteur individuel au sein d’un Monde mondialisé, les spatialités numériques, le couple espace-temps et la relation complexe entre les sociétés et les mondes bio-physiques. Une large part sera accordée à la cartographie. À l’issue de ce cours, vous serez capable non seulement de lire, mais aussi de dessiner vos propres cartes. Enfin, les problématiques de l’agir spatial et de la justice spatiale seront abordées. Un(e) specialiste reconnu(e) interviendra à chacune des 9 séances sous la forme d’un entretien filmé mettant en lumière la relation de ce chercheur à l’espace.\n\n                                    ", "end_date": "2016-11-07T00:00:00Z", "title": "EspaceX: Explorer l’espace des humains: une introduction à la géographicité", "price": 0, "instructors": "Jacques Lévy, Dr. Boris Beaude, Hélène Noizet and Dr. Patrick Poncet", "institution_name": ["École Polytechnique Fédérale de Lausanne"], "commitment": "5 hours", "subject_name": ["Engineering"], "course_url": "https://www.edx.org/course/explorer-lespace-des-humains-une-epflx-espacex", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edX"], "start_date": "2016-09-26T00:00:00Z"}