{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                    \n                    Ce MOOC va tenter de vous donner une vision, la plus large possible, de la vulnérabilité des sociétés littorales face aux risques côtiers.\r\nCe cours s'appuie sur les méthodes et résultats scientifiques développés dans le cadre d'un programme de recherche interdisciplinaire associant géologues, géographes, ethnologues, juristes, économistes et psychologues de l'environnement. Intitulé « COCORISCO (COnnaissance, COmpréhension et gestion des RISques COtiers) », l'objectif de ce projet scientifique était, d'une part, de comprendre la vulnérabilité des côtes face aux risques d'érosion et de submersion et, d'autre part, de progresser vers des stratégies de prévention et de gestion.\r\nCe MOOC va tenter de vous donner une vision, la plus large possible, de la vulnérabilité des sociétés littorales face aux risques côtiers en abordant à la fois l'étude des aléas (érosion et submersion marine), des enjeux, des stratégies de gestion du risque, ainsi que l'analyse des perceptions et représentations, des outils réglementaires pour prévenir les catastrophes. Ce cours fera la part belle aux échanges, à la collaboration entre participants et à la co-production de nouvelles connaissances.\r\n \n\n                                            Syllabus\n                        Semaine 0 - Semaine de bienvenueLors de cette semaine vous pourrez vous familiariser avec les outils afin d'être plus à l'aise pour commencer le cours.\r\nSemaine 1 - IntroductionAperçu historique des recherches sur les risques côtiers. Il sera aussi rappelé les notions de base de la dynamique côtière.\r\nSemaine 2 - Les aléas d'érosion et de submersion marineDétermination et cartographie des aléas lors de ce chapitre.\r\nSemaine 3 - Les enjeuxEtude des enjeux pour mieux comprendre la vulnérabilité.\r\nSemaine 4 - Les politiques et stratégies de gestion des risques côtiersComment un territoire littoral gère les risques côtiers : cas concret.\r\nSemaine 5 - Perceptions et représentations des risques côtiersIl est important d’analyser les représentations et perceptions que se font les acteurs du risque côtier.\r\nSemaine 6 - Prévenir et faire face aux situations de crisesOutils règlementaires et opérationnels afin de mieux appréhender une catastrophe.\r\n \n                                    ", "end_date": "2015-06-08T00:00:00Z", "title": "FlotRisCo : les sociétés littorales face aux risques côtiers", "price": 0, "instructors": "Catherine Meur-Ferec", "institution_name": ["Université de Bretagne Occidentale"], "commitment": "2-3 hours", "subject_name": ["Engineering"], "course_url": "https://www.france-universite-numerique-mooc.fr/courses/UBO/63001/session01/about", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["France Université Numerique"], "start_date": "2015-04-27T00:00:00Z"}