{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/geoint\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/geoint-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    geoint-001\n                                                                    geoint-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Join\nus for the exciting journey to learn about GEOINT’s application in business,\nlaw enforcement, and defense. Advances in satellites, GPS, unmanned aerial\nsystems, wireless communications, handheld computing, and the ability to automate\nlaborious map analysis processes has transformed what used to be called\ngeographic intelligence, or GEOINT, and the nature of the insights provided to\nmanagers and leaders. GEOINT is more than just analysts working with GIS in a secure intelligence facility. We have gone from mountains of hardcopy maps to amazing\nautomated systems that provide previously unavailable understanding. GEOINT\nhelps us daily with real-time apps to guide decision making. GEOINT combines geographic information\nscience and technologies with an analytic tradecraft. In this course you will experience the\nvalue of GEOINT. You will learn how to design and execute a geospatial analysis project using GEOINT\ntools and tradecraft. The course is designed for the individual who wants to learn the basics of GEOINT and it is not designed for the geospatial intelligence professional. We're eager to welcome you to the Revolution.\n\n                                            Syllabus\n                        Week One: What is GEOINT? Learn what GEOINT is and how it provides a powerful way of thinking about and finding solutions to complex humanitarian, military, economic, and cultural problems. We'll discuss the role of secrecy and its challenges. \nWeek Two:  GEOINT Data. Examine the types and nature of data used to create GEOINT, including textual information, imagery, and geospatial data. Discuss how location-based data is changing conceptions of privacy.\nWeek Three: GEOINT Data Sources. Understand how GEOINT data is collected by a variety of methods including satellites, drones, crowdsourcing, and through social media.\nWeek Four: The GEOINT Tradecraft. Apply the art and science of extracting meaning from GEOINT data to uncover and investigate relationships and patterns.\nWeek Five: Applying GEOINT Principles. Use GEOINT principles to evaluate and transform raw data into descriptions, explanations, or judgments about a place.\n                                    ", "end_date": "2016-03-09T00:00:00Z", "title": "Geospatial Intelligence & the Geospatial Revolution", "price": 0, "instructors": "Todd Bacastow and ", "institution_name": ["Pennsylvania State University"], "commitment": "6-9 hours", "subject_name": ["Engineering"], "course_url": "https://www.coursera.org/course/geoint", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-02-03T00:00:00Z"}