{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Engineering\n                                                                                                    &gt; Civil &amp; Environmental Engineering\n                                                            \n                            \n                                                \n                    \n                    \n                    This course will provide an overview of the different phases involved in the mining process. From exploration, impact assessment, production and processing of ore, up to mine closure. Environmental and economic aspects will also be considered because they constitute important parts of the process as a whole. Emphasis will be placed on the key concerns of the mining engineer, the science behind rock behaviour as well as surface and underground mining operations. By the conclusion of this course, you will have a general understanding of the overall mining process.\r\nWhat will I learn?\r\n\r\nThe steps in the mining process from mineral exploration to closure\r\nFundamentals of Rock Mechanics. That is, stress-strain, rock strength, effect of discontinuities, rock testing, stress in the ground and instabilities\r\nFundamentals of surface and underground mining including terminology, types of operations, economics and safety\r\n\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nCivil Engineer\r\nMining Engineer\r\n\r\n \n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: THE MINING PROCESS\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: MINING GEOMECHANICS\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: SURFACE MINING\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: UNDERGROUND MINING\r\n\r\n\r\n\r\n\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Mining Engineering", "price": 0, "instructors": "Dr. Olivier Buzzi, Dr. Stephen Fityus and Dr. Anna Giacomini", "institution_name": [], "commitment": "", "subject_name": ["Engineering"], "course_url": "https://www.open2study.com//node/1795", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Open2Study"], "start_date": "2016-01-11T00:00:00Z"}