{
    "selfpaced": false, 
    "topic_name": [
        "Religion"
    ], 
    "description": "\n\n                    \n                    \n                    Le christianisme s’oppose-t-il à la raison philosophique ? Ce questionnement d’ordre général peut trouver une première réponse dans l’étude historique de la confrontation entre christianisme et philosophie dans l’Antiquité. Cette confrontation a joué un rôle très important dans la constitution de la doctrine chrétienne. Elle prend la forme d’une polémique entre les chrétiens et les philosophes, mais également d’un rapprochement, les chrétiens reprenant à la philosophie un grand nombre de concepts et de modes de raisonnement pour penser, exprimer et défendre leur foi. On verra ce qui oppose le christianisme et la philosophie comme deux voies d’accès concurrentes à la vérité, avant d’envisager différents aspects de la dette du christianisme à l’égard de la philosophie antique. On se demandera pour finir quel a été le rôle du christianisme dans l’histoire de la philosophie en tant que telle.\n\nCe cours constitue une introduction au christianisme des origines ainsi qu’au monde intellectuel de l’Empire romain. Il permettra de comprendre comment se sont constitués les aspects centraux de la doctrine chrétienne. On évoquera aussi dans ce cadre les modalités pratiques de la production et de la transmission des idées dans l’Antiquité (papyrus, manuscrits) avec l’intervention de plusieurs spécialistes.  \n\n                                    ", 
    "end_date": "2017-01-05T00:00:00Z", 
    "title": "EG001x : Christianisme et philosophie dans l’Antiquité", 
    "price": 0, 
    "instructors": "Sébastien  Morlet", 
    "institution_name": [
        "Sorbonne Universités"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/christianisme-et-philosophie-dans-sorbonnex-eg001x", 
    "duration": "32 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-05-26T00:00:00Z"
}