{
    "selfpaced": true, 
    "topic_name": [
        "Religion"
    ], 
    "description": "\n\n                    \n                    \n                    When we think of liturgy today, we imagine short, formal, congregational events happening periodically within the confines of churches. Medieval liturgy, however, took up many hours of every day, filled the city's largest meeting halls, and even spilled onto the streets. At the center of the medieval liturgy were the books we will study in this course.\n\nIn this module of The Book: Histories Across Time and Space, we’ll explore and explain the beautiful service books of the medieval church. No prior knowledge of liturgy or Latin is required, but there will be a lot of both, along with music.\n\nThe medieval services consisted of a complex system of cycles, and the liturgical books correspond to the various functions of the people who used them: Laypersons, nuns and monks, readers, singers, priests, and bishops.\n\nWe will explore and examine these precious objects using materials from Harvard’s collections. Close examination of various types of books will help to explain the complex and collaborative nature of medieval worship. Ultimately, we will learn how these beautifully adorned books  represent the importance of liturgy as an essential function of society in the Middle Ages.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                    ", 
    "end_date": "2015-10-12T00:00:00Z", 
    "title": "HUM1.9x: The Book: Books in the Medieval Liturgy", 
    "price": 0, 
    "instructors": "Thomas Forrest Kelly", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/book-books-medieval-liturgy-harvardx-hum1-9x", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-21T00:00:00Z"
}