{
    "selfpaced": true, 
    "topic_name": [
        "Religion"
    ], 
    "description": "\n\n                    \n                    \n                    In Medieval Europe the Book of Hours, so called because its core component consists of the Hours of the Virgin, became the prayer book of choice for worshippers prosperous enough to commission or purchase such a book.\n\nAlthough its contents were of monastic origin, literate lay readers were the most likely to use books of hours, as served not only as a prayer book, but also as a way of keeping track of the calendar, often doubling as a family chronicle.\n\nBooks of hours provide insight into broad patterns of piety marking the High and later Middle Ages, and through their choice of texts, images and added materials, inform us about the interior life and aspirations of everyone from kings and queens and lords and ladies to monks and nuns and, ordinary members of the patrician class, merchants and others.\n\nIn this course, we will explore how books of hours provide the closest thing we have to a comprehensive and continuous record of the development of painting across most of western Europe from the later thirteenth through the early sixteenth century.\n\n“The Book of Hours” is one module of a series of courses called “The Book: Histories Across Time and Space.” You may take this course on its own, or with the other courses of the series.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "HUM1.8x: The Book: The Medieval Book of Hours: Art and Devotion in the Later Middle Ages", 
    "price": 0, 
    "instructors": "Jeffrey F. Hamburger", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/book-medieval-book-hours-art-devotion-harvardx-hum1-8x", 
    "duration": "46 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-21T00:00:00Z"
}