{
    "selfpaced": false, 
    "topic_name": [
        "Religion"
    ], 
    "description": "\n\n                    \n                    \n                    The Bible says that Jesus was identified as God's beloved son at his baptism. The same identification was made about Israel in the Old Testament and the disciples of Christ at their baptism. The striking similarity of these titles establishes a tight interrelationship between the people Israel, the person of Jesus Christ, and the church.\n \nIn this course, we will explore how a close reading of the book of Genesis, the Gospels, and early Christian writers can shed further light on these relationships and, in so doing, deepen our understanding of the figure of Jesus Christ.  Unlike many other treatments, this course does not presume that Jesus’ character can be plumbed solely by an examination of the Gospel stories. The witness of the Jewish scriptures and the lives of the saints are also important sources for this task.\n \nThe course will be eight weeks in length and organized around three topical questions:\nWho is Israel? (primary source material: the book of Genesis)\nWho is Jesus? (primary source material: the Gospels and the Creeds)\nWho is the Church? (primary source material: a selection of post-Biblical Christian writers)\n \nNo matter what your background in the study of theology, this course will provide a fresh approach to the identify of Jesus Christ that will reveal how the church has explored the unmeasurable depths of his person.\n\n                                    ", 
    "end_date": "2015-07-27T00:00:00Z", 
    "title": "TH120.1x: Jesus in Scripture and Tradition", 
    "price": 0, 
    "instructors": "John C. Cavadini and Gary Anderson", 
    "institution_name": [
        "University of Notre Dame"
    ], 
    "commitment": "5-7 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/jesus-scripture-tradition-notredamex-th120-1x", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-06-01T00:00:00Z"
}