{
    "selfpaced": false, 
    "topic_name": [
        "Religion"
    ], 
    "description": "\n\n                    \n                    \n                    The Talmud is one of the richest and most complicated works of literature the world has ever known. Since being composed around 1500 years ago it has inspired not only religious reverence but significant intellectual engagement. In this course learners will be introduced to the unique characteristics of this text and the challenges that inhere in studying it while studying a chapter of the Talmud. Students of the course can expect to develop an appreciation for how the Talmud works and why it continues to inspire religious and intellectual devotion. They will be challenged to employ critical reading skills and to analyze legal and historical concepts.\n\n                                            Syllabus\n                        Introducing the TalmudThe Talmud is a canonical work of Jewish literature that collects the ideas and arguments of rabbis who lived between the first and eighth centuries CE. This module explains the basics of how the Talmud was composed, why the Talmud matters and how it is accessed today.\nFalse Testimony From Bible to RabbisThe Talmud relies heavily on the authority and substance of its canonical predecessor, the Hebrew Bible. This module charts a trajectory from the biblical origins of the treatment of false testimony in Deuteronomy through its treatment within the second temple apocryphal book Susannah and the early Rabbinic law code, the Mishnah. \nReading the Bible &amp; Rabbinic LogicInterpretation is a major component of Rabbinic literature and the Talmud. This module introduces the specific features of Rabbinic interpretation of the Hebrew Bible—its assumptions and its reading tools.\nRedaction &amp; Textual WitnessesTextual Criticism is a form of reading that looks to explain the meaning of a text by figuring out aspects of its composition history. This module will show how Talmudic passages are typically constructed and what scholars can do to figure out the original meaning of a text.\nThe Stam as Reader and WriterThe historical range of the different centuries of rabbinic literature makes it possible to take note of changes in the ways the different rabbis thought about the Bible and law. This module will demonstrate how later rabbis have a more abstract way of thinking about law while simultaneously having a more restrictive way of reading the Bible. \nTosefta, Tannaitic Midrash and Palestinian TalmudRabbinic literature consists of multiple works in three genres—Midrash, Mishnah and Talmud.  This module introduces each of these different genres with a comparative analysis of texts related to false testimony in works of each type.\nNarrative and HistoryThe Talmud contains many stories that feature historical figures from the rabbinic period. In this module we will demonstrate the difficulty of reading these stories as history and model the use of literary tools for reading such materials.\nConclusionWhile some of the material we have studied is unsettling, we need to bear in mind that much of it is rabbinic idealization or fantasy. This module goes through both the fantasy of rabbinic power and the realities of the importance of the Talmud in the post-Talmudic age. \n\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "The Talmud: A Methodological Introduction", 
    "price": 0, 
    "instructors": "Barry Scott Wimpfheimer ", 
    "institution_name": [
        "Northwestern University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/the-talmud", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}