{
    "selfpaced": true, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    本课程将讲解汉语作为第二语言学习中学习者最容易发生偏误的12个汉语最基本的语法项目，帮助学习者进一步理解、掌握这些语法项目在句法、语义及语用上的特点。\n\nImprove your Chinese language proficiency in this intermediate Chinese grammar course. You will explore 12 complex grammatical concepts to help learners studying Chinese as a second language gain a better understanding of Chinese grammar, including syntax, semantics and pragmatics. \n\n课程中提供了大量的语法练习题目，以帮助学习者提高在语境中准确运用语法知识进行表达的能力，包括读、说、写、译等各种技能。\n\nThis course contains many exercises to help you improve skills in reading, speaking, writing and translating accurately and fluently.\n\n本课程也将帮助学习者了解汉语作为一门语言，她自己具有的独特特点，帮助学习者建立起用汉语进行思考的意识。\n\nThis Chinese grammar course will also help you better understand the characteristics of the Chinese language. This course is for learners who want to improve their Chinese proficiency, and use Chinese as a second language with accuracy and fluency. Course participants will learn more than just the basics in this course as it covers more than 1,500 words!\n\n本课程包括教学视频，每个视频时间为10分钟左右。每个教学单元中包括一个课后作业，还有一个期中考试和期末考试。\n\nThe class will consist of lecture videos, which are approximately 10 minutes in length. There will also be standalone assignments that are not part of video lectures in each teaching unit, a midterm exam and a final exam.\n\nFAQ\n\n在这门课上最吸引我的可能是什么？\n\nWhat is the most attractive thing in this class?\n\n在这门课上，你将发现汉语语法非常有意思，你不但可以听老师告诉你汉语语法的规律，而且你自己也可以发现汉语语法的规律。最酷的是，你会有很多的机会运用汉语的语法知识进行自我表达。\n\nIn this class, you will find Chinese grammar is very interesting. You can explore the Chinese grammar rules by yourself with the teacher’s help. The coolest thing is that you have quite a lot of opportunities to express yourself in Chinese.\n\n \n\n学习这门课，可以用哪本教材？\n\nWhich textbook will be used?\n\n《中级汉语语法讲义》，徐晶凝，北京大学出版社，2008。\n\n                                    ", 
    "end_date": "2016-09-20T00:00:00Z", 
    "title": "20000001x: 中级汉语语法 | Intermediate Chinese Grammar", 
    "price": 0, 
    "instructors": "Xu Jingning", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/zhong-ji-yi-yu-yu-fa-intermediate-pekingx-20000001x-0", 
    "duration": "53 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-15T00:00:00Z"
}