{
    "selfpaced": true, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    Welcome to Adventures in Writing, a series of graphic-novel style learning modules designed to help you learn more about and practice a range of effective written communication skills. You’ll immerse yourself in the adventures of Maya and Chris, using each module’s interactive exercises to apply what you’ve learned. Writing instructors in Stanford’s Program in Writing and Rhetoric (PWR) designed the modules to reflect PWR’s philosophy that the best academic and real world communication practices require us to think about more than “correctness” or just getting things right—we must actively consider what we’re trying to achieve with a specific audience for a specific purpose. Through joining Maya and Chris on their adventures, you’ll develop your abilities to communicate in writing—from punctuation and style to argument—increasing the power of your language in the classroom and beyond.\r\nCONCEPTS\r\nWhile there are many challenges related to writing well, we’ve chosen to focus on the following issues, crucial to your writing success:\r\n1. Academic Language\r\nThis module invites you to explore the way in which successful writers consciously change how they use language to work best in different contexts – from tone, to word choice, to style – focusing specifically on how to develop a strong, persuasive academic voice. Join our characters Maya, Chris, and Josh at a baseball game and learn how to make a successful academic writing pitch.\r\n2. Purpose, Audience, and Context: Language as Communication\r\nThis module asks you to develop a nuanced understanding of how language works, suggesting that powerful communication is about more than just what you want to say; you also need to take into account your goals, your audience, and context. Join Maya and Chris on their adventure through an amusement park and learn in the importance of considering “Who,” “Why,” and “What.”\r\n3. Identifying Passive and Active Voice\r\nThis module focuses on one of the most common stylistic choices in writing: the use of passive and active voice. Join Maya and Chris as they watch a zombie movie, and learn the importance of understanding when to be passive – and when being passive puts you in danger of being eaten by zombies.\r\n4. Punctuation: Signposts to Guide Readers\r\nThis module explains that punctuation is more than just a set of rules; it’s a series of communication tools that you can use to increase the clarity and precision of your language. Join Maya, Chris, and Vlad as they rush to try to get Vlad to his orchestra rehearsal on time, and learn how to use punctuation to help you hit the correct notes in your writing.\r\n5. Argument: Making and Supporting Claims\r\nThis module leads you through the steps for constructing an effective argument, from developing a central claim, to supporting it with evidence, considering diverse opinions, and even thinking about why your argument matters. Join Maya, Chris, and Fiona in their quest to establish a community garden at their university and learn what it means to get arguments to effectively take root in academic contexts.\n\n                                    ", 
    "end_date": null, 
    "title": "Adventures in Writing", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://lagunita.stanford.edu/courses/VPUE/PWR/AdventuresinWriting/about", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Stanford OpenEdx"
    ], 
    "start_date": "2015-01-16T00:00:00Z"
}