{
    "selfpaced": false, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    In this project-centered course, you will learn everything you need to research and present an effective and persuasive position paper or policy advice. We recommend you sign up for a certificate as this course is on premium grading and you will only enjoy the full benefit of the project if you can join in with the assignments. In addition this course contains the exciting opportunity to research and analyze historical decisionmaking, international relations, business cases and battles  in an effort to truly understand constructing a convincing argument.\n\nMost important decisions in life, and many unimportant ones, are taken after some degree of reflection. If those decisions affect other people, we may take some advice and we might even follow it. The larger the issue and the greater number of people involved, the more likely that advice process will be institutionalised. Most of us tend to think of policy advice in the context of things as counsel to politicians in matters of national security or policy-making by governments. Of course, we also know that it takes place on a regular basis within businesses and other organisations. But it also happens in local politics and in local campaigns and in everyday life. Every time you try to influence someone’s decision, you are offering policy advice. Even if you are not planning to be an active advisor, the discipline of collecting and arranging the necessary materials is useful in all kinds of research and writing exercises. Writing a policy advice is what we call a ‘transferrable skill’.\n\nThe course requires an academic approach, but no previous experience. The projects can be completed by both novices and advanced learners. One thing is certain. Both groups will learn a lot from the experience. \n\nWhat is a policy advice?\nIn its simplest form, a policy advice is a short paper that argues your position on a particular issue and the course of action you propose. It also tries to convince the audience to adopt your position and to take action on your advice. \n\nWhat advice can I give?\nYou may well have a topic already, based on your work or your social situation. This could be a piece of equipment your firm might want to buy or a new market it might wish to enter. It could be a campaign for a local play area or against pollution in local ground-water. In this case it is a question of arranging and presenting your position, and discussing it with others in a similar position.\n\n On the other hand, you might be open for suggestions. In this case, we have prepared some topics covering business case studies, issues of current affairs, and historical examples. For example, you could look into the archives advise Harry Truman to adopt a different policy towards the Soviet Union at the start of the Cold War. Alternatively you could suggest advise the Incas in 1532 not to be so trusting in their dealings with the Spanish. After all, you will know the outcome. So the course should appeal to everyone interested in practical policy-making as well as amateur historians, strategy gamers. Everyone can have fun applying these techniques to their favourite topics.\n\nWhat will I learn?\nThe project-based course is designed so that you learn by doing rather than by listening. The assignments that you complete, the feedback that you receive and the assignments of others that you read and upon which you comment are all intrinsic parts of the course. The lectures are designed to act as signposts along the way and the readings allow you to explore some of the issues in greater depth. During the whole course experience you will learn to:\n•\tFrame a starting position for your own research\n•\tUse search engines to locate materials required for your advice\n•\tExplore ‘academic’ data-bases\n•\tAnnotate your sources correctly\n•\tTarget your research for statistical data\n•\tChoose a visualisation for your statistical data \n•\tConstruct an argument in a logical manner\n•\tBuild up the logic in each paragraph \n•\tConduct a SWOT analysis\n•\tConduct a Risk Analysis\n•\tPresent the materials in a position paper\n•\tConvert the position paper to a policy advice\n•\tRecognise the policy-making hierarchy and shaping the advice accordingly \n•\tWrite a powerful and effective PowerPoint presentation\n•\tPlace your project in the ‘real world’ context of the policy-cycle\n•\tAnd ... Discover a great, great deal about your chosen topic.\n\nHow much time will the course take?\nThe lecture materials in each module will themselves take no more than 30 minutes to view and review. Each module is accompanied by selected reading materials, but these are not compulsory. There is also a Skills Lab with extra literature and videos to assist you to improve your writing, computer and presentation skills. Combining these parts of the course, and assuming that you make some use of all the facilities offered, the ‘on-platform’ time should take no more than an one hour for each module. \nThe project-time depends on the degree of advancement in the project choice. If you come with a ready prepared idea and knowledge of the area, then the project-time should in total be approximately four to five hours. If you decide to use the suggestions in our collections, then you should add another three to four hours to familiarise yourself with the subject and the necessary materials. If you should decide to start a completely new project from scratch, the you would need to add another three hours or so to orient yourself in the problem and then locating the required materials.\n\nAbout Project-Centered Courses: Project-centered courses are designed to help you complete a personally meaningful real-world project, with your instructor and a community of learners with similar goals providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share\n\n                                            Syllabus\n                        Getting StartedIn this module, after a brief introduction, we will start our policy advice by defining the issue and finding sources. Check out our Resource section if you have not yet decided on an issue for your project. Perhaps you would like to use one of our cases and engage in a simulation?Writing the Position PaperIn this module we will learn how to construct an argument, which will form the backbone of your position paper or policy advice, and think about how to visualise the data supporting the argument. This is the second stage towards your policy advice. Writing the Policy AdviceIn this module you will turn your position paper into a policy advice, but first, we will teach you to apply a SWOT Analysis and Risk Assessment. Do not forget to use the Skills Lab from module 2.Presentation and ReflectionIn this module you will create a presentation to present your policy advice to your target audience, and we will reflect on the course.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Be Persuasive: Write a Convincing Position Paper or Policy Advice (Project-Centered Course)", 
    "price": 0, 
    "instructors": "Richard Griffiths", 
    "institution_name": [
        "Leiden University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/persuasive-writing", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}