{
    "selfpaced": false, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    As part two of the academic writing course series, English Grammar and Essay Writing will focus on:\n\nProofreading\n\tSelf-editing\n\tRevision\n\tCommon English grammar errors\n\tTone\n\tDiction\n\tVocabulary building\nWho should take this course?\n\nAnyone interested in refining persuasive writing techniques and essay development.\n\tAnyone preparing for or applying to college.\n\tAnyone proficient enough in English to follow an introductory level course.\n\tAnyone who is developing English-language writing and communication skills.\nYou do not need to have completed Part 1 to take this course. However, you may want to review College Writing 2.1x, which is archived on edx.org.\n\nThe Part 2 course materials will be offered via readings, videos, and various types of homework assignments. There are suggested optional textbooks for additional writing work. You will participate in online discussions as well as peer review of your writing. You will write one full essay for this part of the course.\n\nUC Berkeley is partnering with the U.S. Department of State to extend the reach of College Writing 2X. Participating U.S. Embassies will host in-person, facilitated discussions sessions around the course content in order to maximize the learning experience.\n\nThe State Department-supported EducationUSA network will also offer facilitated discussions in some locations for students interested in pursuing higher education in the United States. This partnership is part of the English Education Alliance (E2A), a global effort of the U.S. Department of State to address the global demand for 21st century English language skills.\n\n                                    ", 
    "end_date": "2017-03-25T00:00:00Z", 
    "title": "ColWri2.2: English Grammar and Essay Writing", 
    "price": 0, 
    "instructors": "Maggie Sokolik", 
    "institution_name": [
        "University of California, Berkeley"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/english-grammar-essay-writing-uc-berkeleyx-colwri2-2x-0", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2017-02-18T00:00:00Z"
}