{
    "selfpaced": false, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    College Writing 2.1x is an introduction to academic writing for English Language Learners, focusing on essay development, grammatical correctness, and self-editing. The five-week course includes a review of basic grammar terminology and understanding; writing effective sentences and paragraphs; introductions and conclusions; strategies for writing longer texts; and thesis statements. The course materials will be offered via readings and videos. An optional course workbook, in ebook form, may be used for additional writing work. Students will participate in online discussions as well as peer review. Students will complete an essay for this part of the course.\n\nIn partnership with the U.S. Department of State\n\nUC Berkeley is partnering with the U.S. Department of State to extend the reach of College Writing 2X. Participating U.S. Embassies will host in-person, facilitated discussions sessions around the course content in order to maximize the learning experience. The State Department-supported EducationUSA network will also offer facilitated discussions in some locations for students interested in pursuing higher education in the United States. This partnership is part of the English Education Alliance (E2A), a global effort of the U.S. Department of State to address the global demand for 21st century English language skills.\n\n                                    ", 
    "end_date": "2016-11-16T00:00:00Z", 
    "title": "ColWri2.1x: How to Write an Essay", 
    "price": 0, 
    "instructors": "Maggie Sokolik", 
    "institution_name": [
        "University of California, Berkeley"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/how-write-essay-uc-berkeleyx-colwri2-1x-0", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-10-12T00:00:00Z"
}