{
    "selfpaced": false, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    \r\nDigging Deeper: Making Manuscripts introduces you to the study of early text technologies, focusing principally on the medieval book, but covering other textual objects, too, such as scrolls and diplomata. The Digging Deeperteam of scholars from Stanford and Cambridge reveals how to investigate manuscripts within repository settings and through online resources, what to look out for when confronted with manuscript images, and how to exploit all the information a manuscript offers. You will learn major characteristics of book production, the terms and methods used by manuscript historians to describe the book, and key themes in early book history. Where were manuscripts made and who made them? What kinds of materials were used and what can those materials tell us? What kinds of texts were created and copied during these centuries? How did multilingualism matter in the medieval period? In pursuing these questions, you will study some of the most significant and beautiful books held by the university libraries of Cambridge and Stanford.\r\nDigging Deeper is a six-week course, with each week featuring filmed sequences of experts with manuscripts, reading assignments, a short transcription, and self-testing quizzes. Assignments will help you develop a basic knowledge of how to access manuscripts in person and online, skills in codicology (the study of the medieval book and the physical make-up of manuscripts), palaeography (the describing and analysis of medieval scripts), and transcription (the reading and interpretation of writing in manuscripts). Participants who finish the course will earn a Stanford Statement of Accomplishment.\r\nDigging Deeper: Making Manuscripts will be followed in Spring with a course focusing on the interpretation and preservation of manuscripts in the digital era.\r\n \r\n\n\n                                    ", 
    "end_date": "2015-03-03T00:00:00Z", 
    "title": "Digging Deeper: Making Manuscripts", 
    "price": 0, 
    "instructors": "Dr. Orietta Da Rold, Dr. Suzanne Paul, Dr. Benjamin Albritton and Elaine Treharne", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://class.stanford.edu/courses/English/DiggingDeeper1/Winter2015/about", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Stanford OpenEdx"
    ], 
    "start_date": "2015-01-20T00:00:00Z"
}