{
    "selfpaced": false, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    Course 4: Introduction to Research for Essay Writing\n\nThis is the last course in the Academic Writing specialization before the capstone project. By the end of this course, you will be able to complete all the steps in planning a research paper.\n\nAfter completing this course, you will be able to:\n - choose appropriate research topics for college classes\n - write detailed outlines for research papers\n - find source material for research papers\n - take and organize good notes for research\n - use appropriate academic tone and language\n - document sources by creating a Works Cited list in MLA format\n - avoid plagiarizing your sources\n\n                                            Syllabus\n                        Course IntroductionThis is the last course in the Academic English: Writing specialization. In this course, you will learn all of the steps to writing a research paper. You will learn how to choose topics, where to do your research, and how to plan the research paper. You will also master your understanding of using sources and avoiding plagiarism. Introduction to ResearchIn this first module, you will learn about research assignments in American universities. You will practice choosing topics for different assignments. Then you will learn about choosing academic sources and evaluating them for reliability. These are important steps for getting your research off to a good start for any research assignment.Doing Research and Planning the PaperIn this module, you will learn more about finding sources. Then you'll learn about how to be organized in your research by taking good notes on your sources. Also, you'll learn about writing an annotated bibliography, which is a common assignment when writing a research paper in college.Language for Research WritingIn this module, you'll learn about the language used in writing a research paper. You'll learn about academic tone and language. Then you'll learn about using statistics and words from the Academic Word List in your writing.More on Citing Sources and FormattingIn this last module, you will learn more about citing sources in your research paper. You'll review MLA format and learn a little bit about APA format. Finally, you'll learn about some online resources that will make formatting your papers much easier.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Introduction to Research for Essay Writing", 
    "price": 0, 
    "instructors": "Tamy Chapman", 
    "institution_name": [
        "University of California, Irvine"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/introduction-to-research-for-essay-writing", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}