{
    "selfpaced": false, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    Scholarly Communication is a concise but comprehensive course on how to write research papers in English. The course will help the candidates gain a better understanding of the rhetorical conventions of English and the common challenges the candidates may face as an academic writer. The course provides instruction, exercises, structure, and deadlines needed to create a publishable paper.\n\nThe aim of the course is to improve competence in scholarly communications by deepening knowledge of the core features of the scientific writing style. It presents and analyzes the unwritten rules of scientific writing, the ones candidates most likely never learned in academic writing.\n\nThe course will enable the candidates to write clear, detailed and well-structured scientific texts appropriate to a suitable academic journal. In particular, they will develop an awareness of fundamental concepts of academic writing, such as contrastive rhetoric, logical organization, and argumentation. In addition, they will develop skills for self-editing and revision techniques, including editing\nfor precision and clarity. They will also gain a deeper understanding of how to prepare a scientific paper using the IMRAD format. Finally, the candidates will develop an enhanced understanding of the concept of academic integrity and the ethics of scientific writing.\n\nThe candidates will be able to overcome anxiety about academic publishing and get their research papers published in international journals.\n\n                                            Syllabus\n                        Science WritingMODULE I: SCIENCE WRITING will help you develop an enhanced understanding of English written pattern,  based on Anglo-American rhetorical conventions. The module covers issues relating to writing strategies, style, hedging, clear meaning, organization, and choice of first person pronouns. The focus is on improving your ability to write academic English appropriate to a research article.The ChallengeMODULE II: THE CHALLENGE covers issues relating to the internal text structures intrinsic to a research article. The module clarifies the usage of three major types of modifiers (squinting, misplaced, and dangling) and suggests a number of strategies to avoid obvious negation. In addition, you will learn how to create stronger academic writing by choosing the right verb form used either in active or passive voice.  The module teaches Anglo-American style of outlining, paragraphing, and argumentation to make the reading process easier for the reader. Also, you will develop an awareness of the process of journal analysis.The ManuscriptMODULE III: THE MANUSCRIPT will teach you how to prepare a publishable paper in the IMRaD (Introduction, Methods &amp; Materials, Results, and Discussion) format. The module provides clear instructions on manuscript writing. You will gain a better understanding of four elements that underlie the structure of all stories, including those you write in science – Opening, Challenge, Action, and Resolution, which can be easily mapped on the IMRaD format.Scientific CommunicationMODULE IV: SCIENTIFIC COMMUNICATION covers issues concerning the manuscript submission process. The module highlights editorial requirements, scientific integrity and publishing ethics. In addition, you will learn several self-editing techniques that will enable you to prepare your manuscript for submission. The module suggests ways to self-promote in academia.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Scholarly Communication", 
    "price": 0, 
    "instructors": "Vitaly Kartamyshev", 
    "institution_name": [
        "Moscow Institute of Physics and Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/scholarly-communication", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}