{
    "selfpaced": false, 
    "topic_name": [
        "Grammar & Writing"
    ], 
    "description": "\n\n                    \n                    \n                    Wikipédia est aujourd'hui le septième site le plus visité au monde. C'est aussi l'un des rares sites connus à être hébergé par une fondation à but non-lucratif. Étudiants, professeurs, professionnels, particuliers : nombreux sont les internautes à utiliser cette encyclopédie en ligne, qui compte plus de 36 000 000 d'articles en 280 langues, dont 1,7 million en français.\r\nMais le fonctionnement de ce site reste très largement méconnu. Wikipédia permet la construction et la diffusion du savoir de manière ouverte et collaborative, sur un modèle inédit dans l'histoire de l'humanité. Le site est modifiable par tout internaute – ils sont plus de 15 000 chaque mois en France – mais la contribution obéit à un certain nombre de principes et de règles, souvent inconnus des lecteurs.\r\nCe MOOC (des cours en ligne gratuits et ouverts à tous) est conçu pour vous faire entrer dans les coulisses de la plus grande encyclopédie au monde : comprendre son fonctionnement, ses règles, découvrir sa communauté (sans hiérarchie), la manière dont la fiabilité du contenu est assurée, etc. Ces cours vous permettront également d'apprendre à contribuer vous-même à Wikipédia : modifier des articles, les illustrer, les mettre en forme, interagir avec les autres contributeurs, travailler de manière collaborative... À la fin du WikiMOOC, vous serez même amené à créer votre tout premier article sur Wikipédia.\r\n \n\n                                    ", 
    "end_date": "2016-03-28T00:00:00Z", 
    "title": "WikiMOOC : apprenez à contribuer sur Wikipédia !", 
    "price": 0, 
    "instructors": "Rémy Ledoux, Natacha Rault and Valentin Guillaume", 
    "institution_name": [
        "Wikimedia France"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/WMFr/86001/session01/about", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-02-22T00:00:00Z"
}