{
    "selfpaced": true, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Any meaningful experience on the web has a form. Whether it's a form made of text boxes, toggles, buttons, checkboxes, or touchable widgets, web developers need to be purposeful about forms to make users happy and increase [conversions](https://en.wikipedia.org/wiki/Conversion_marketing).\n\nIn this course, you'll learn best practices for modern forms as taught by Google's Ido Green and Udacity's Cameron Pittman. You'll practice your skills along the way with a few self-directed projects, including an e-commerce checkout and an event planner app!\n\nAs a special treat, you'll also watch a series of interviews with Luke Wroblewski, Google Product Director and author of [Web Form Design](http://www.lukew.com/resources/web_form_design.asp), to get his take on interactions for the modern web.Why Take This Course?The modern web is mobile and interactive. Thousands (maybe millions?) of websites include account creation forms and checkout forms. Websites ask you to tap buttons and fill out text boxes. They ask you for information and prompt you to take action. You fill out forms on big screens with physical keyboards and small screens with virtual keyboards.\n\nThere are millions of ways users interact with the modern web, and any website with interactions needs to do everything it can to influence the way users interact in order to ultimately increase conversions.\n\nBuilding High Conversion Web Forms exists to help you, the web developer, think about forms and interactions for all of your users, no matter the form or the device. You'll practice handling user input to build forms that rock!\n\n                                            Syllabus\n                        ### Efficient Inputs Part 1\n\n* You'll be introduced to the principles of useful forms\n* You'll research HTML5 input types\n* You'll build a datalist input\n\n### Efficient Inputs Part 2\n\n* You'll exercise best practices for implementing input labels and types with many sample inputs\n* You'll validate user input with HTML5 attributes and the [Constraint Validation API](https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/Forms_in_HTML#Constraint_Validation_API)\n\n### Fast Forms\n\n* You'll start exploring techniques for making forms faster and easier for users\n* You'll practice empathy for your users in order to simplify and expedite forms\n* You'll apply everything you've learned so far by designing and building an e-commerce checkout\n\n### Touch Support\n\n* You'll explore best practices for responding to and designing user interactions on mobile\n* You'll use touch events to build a mobile-ready touch slider\n* You'll be introduced to the final project - an event planner app!\n                                    ", 
    "end_date": "2015-11-28T00:00:00Z", 
    "title": "Building High Conversion Web Forms", 
    "price": 0, 
    "instructors": "Ido Green and Cameron Pittman", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/building-high-conversion-web-forms--ud890?utm_medium=referral&utm_campaign=api", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-11-14T00:00:00Z"
}