{
    "selfpaced": true, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Cascading Style Sheets (CSS) is a language used to describe the visual look of a web page. Using CSS, it is possible to change colors, margin, padding, fonts, and much more. This content will consolidate the previously released CSS Foundations and CSS3 in a brand new and updated series.\n\n                                            Syllabus\n                        Getting Started with CSS \r\nLearn fundamental CSS concepts and how to add CSS to a page.\r\nSelectors\r\nSelectors allow for styling to be applied to particular page elements. This critical concept makes it easy to choose a specific page element and assign CSS.\r\nAdvanced Selectors \r\nMany advanced CSS selectors help keep our markup clean, semantic and flexible by targeting specific elements without the need of a class or an ID.\r\nValues and Units\r\nEvery CSS property has a type of value it can accept, such as a predefined keyword, a length unit, or a URL. In this stage, we'll cover common values and units CSS properties accept.\r\nText, Fonts, and Lists\r\nText has a significant effect on how we view a web page, and CSS has many options for defining text styles. Font properties also enable us to change the appearance of text by assigning a font family, font size, thickness and more. In this stage, we’ll learn common font properties we can use to enhance our text, along with ways to style our HTML lists.\r\nThe Box Model \r\nEvery HTML element, no matter how big or small, can be thought of as a rectangular box made up of content, padding, borders and margins. The Box Model is the basis of CSS layout and positioning, and it dictates how elements are displayed and interact with each other.\r\nBackgrounds and Borders\r\nWith CSS, any element can have a background and border applied, and certain properties affect how they appear. In this stage, we'll explore common CSS background and border properties, along with ways to add drop shadows and inner shadows to HTML elements.\r\nWeb Typography\r\nWeb typography is an exciting and rapidly evolving area of CSS, wherein layout engines like webkit are pushing beyond W3C standards. In this stage, we’ll cover topics such as best practices for choosing a typeface, text layout, responsive text and vertical rhythm. We'll also explore font resources like the @font-face rule, and other detailed font features and techniques that will enhance our text.\r\nCSS Gradients\r\nCSS gradients allow us to display smooth transitions between two or more colors. In this stage, we'll explore linear and radial CSS gradients, along with the differences in browser syntax.\n                                    ", 
    "end_date": null, 
    "title": "CSS Foundations", 
    "price": 25.0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "12-13 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "http://treehouse.7eer.net/c/259799/289733/3944", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Treehouse"
    ], 
    "start_date": "2016-06-07T00:00:00Z"
}