{
    "selfpaced": true, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    CSS (Cascading Style Sheets) is a style sheet language that describes the presentation of web pages. Whereas HTML is what forms the structure of a web page, CSS is what we use to style the HTML with colors, backgrounds, font sizes, layout, and more. As you'll soon learn, CSS is one of the core technologies for designing and building websites.\r\n \r\nWhat you'll learn\r\n\r\nBasic Selectors\r\nCommon Values and Units\r\nCSS Layout\r\nNew CSS Features\r\n\n\n                                            Syllabus\n                        Getting Started with CSS \r\nGet started with one of the core technologies for designing and building websites and applications. In this stage, you'll learn about the evolution of CSS, helpful resources, and how to add CSS to a page.\r\nBasic Selectors\r\nSelectors are one of the most important and powerful parts of CSS. In this stage, you'll learn the different ways we can target HTML elements with basic selectors.\r\nUnderstanding Values and Units \r\nEvery CSS property has a set of values it can accept. Most properties accept keywords that literally describe a value. Many properties also accept numbers, functions, length values, or a URL. In this stage, you'll learn the common values and units CSS properties accept.\r\nThe Box Model \r\nThe box model is the basis of CSS layout because it dictates how elements are displayed and how they interact with each other.\r\nBasic Layout\r\nIn this stage, we'll continue styling our website with background properties and basic layout methods.\r\nDesigning with the Latest Features\r\nToday's CSS features are becoming closer to tools we'd normally use in a graphics editor. CSS has introduced many in-browser design features like rounded corners, box shadows, gradients, and more. In this stage, we'll add the finishing touches to our page using many of the latest features introduced to CSS. Then, make sure our page looks good on all devices with media queries.\r\nFundamental Concepts\r\nNow that we've explored many of the core features of CSS, it's time to take this knowledge further by learning important fundamental concepts. In this stage, you'll learn all about the CSS cascade, inheritance, and helpful tips and tools to practice and retain what you’re learning.\n                                    ", 
    "end_date": null, 
    "title": "CSS Basics", 
    "price": 25.0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "8 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "http://treehouse.7eer.net/c/259799/287721/3944", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Treehouse"
    ], 
    "start_date": "2016-06-07T00:00:00Z"
}