{
    "selfpaced": false, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Neste curso, assumimos que você já sabe projetar e desenvolver programas mais complexos em Java, graças às boas práticas e princípios orientados a objetos e TDD exercitados nos cursos anteriores; mas você talvez não se sinta ainda confortável em projetar programas para Web e com dados armazenados em banco de dados, bem como em aplicar conceitos mais avançados de Java. \n\nO objetivo deste curso é enriquecer sua experiência com conceitos avançados de Java, programação de aplicações Web e acesso a banco de dados no contexto de modelagem ágil.\n\nOs conceitos apresentados neste curso no contexto da programação Java incluem o seguinte: APIs fundamentais do Java; tipo Generics; reflexão em Java; programação Web com Java; acesso a banco de dados em Java; desenvolvimento de aplicação empresarial; testes de unidade e de integração aplicados a cada conceito avançado apresentado neste curso.\n\nAo final deste curso, você terá amadurecido de tal modo suas habilidades de programação que será capaz de implementar de modo ágil uma versão inicial da aplicação Web em associação com o componente de gamificação constantes do Trabalho de Conclusão da Especialização, com base nas boas práticas exercitadas neste curso.\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "Desenvolvimento Ágil com Java Avançado", 
    "price": 0, 
    "instructors": "Eduardo Guerra and Clovis Fernandes", 
    "institution_name": [
        "Instituto Tecnológico de Aeronáutica"
    ], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.coursera.org/learn/desenvolvimento-agil-com-java-avancado", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "9999-12-31T23:59:59Z"
}