{
    "selfpaced": false, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, we’ll introduce you to the main concepts of the UI development toolkit for HTML5 - SAPUI5. The JavaScript exercises for each unit will give you the technical background needed to develop your own responsive Web apps. We’ll start from scratch with the very basics and lots of hands-on coding. As we go through the weeks of this course, you’ll learn more about the powerful development concepts and truly master SAPUI5. Join us on this journey and enroll today!\r\nSAPUI5 and its open-source variant OpenUI5* help you build enterprise-ready Web apps that are responsive to all devices. The JavaScript UI library and development toolkit contains many feature-rich controls and implements the award-winning SAP Fiori user experience. It helps developers ease and speed up the development of full-blown HTML5 Web applications. This course will kick-start your journey, giving you all the technical knowledge needed to develop Web apps with SAPUI5. Hands-on exercises and practical units will give you a deeper understanding of the main development concepts of SAP’s powerful UI library. Using a cloud-based development environment that requires no additional installation, we’ll introduce you to the library and start with a simple “Hello World” example. Step by step, we’ll then add more features to our app and explain the background so that you can understand how it all comes together. You’ll learn the Model View Controller (MVC) concepts, become an expert in data binding, and get to know many UI controls offered by the framework.\r\nAs you work your way through the course, you can try out everything in your own development project and practice developing with SAPUI5 with lots of exercises. You’ll create responsive apps that adapt to different devices and discover the enterprise-grade features of SAPUI5. After that, you’ll go on to learn about Web app navigation and application testing, truly mastering SAPUI5.\r\nFrom May 17, you will have access to a “Get Started” week to help you understand the skill level required to complete the course and the exercises. This is an optional week and there are no assignments; but you can take the self-tests to check your knowledge, prior to the official start date.\r\n*The content of this course applies to both SAPUI5 and OpenUI5. OpenUI5 is free and open source and includes all the main features of SAPUI5, the library SAP uses for its Web applications.\n\n                                            Syllabus\n                        Week 1:\r\nLearn the EssentialsWeek 2:\r\nBecome a Data Binding ExpertWeek 3:\r\nCreate Responsive AppsWeek 4:\r\nMaster SAPUI5I Like, I Wish:\r\nWe Love Your Feedback … And Want MoreFinal Exam:\r\nGood Luck!\n                                    ", 
    "end_date": "2016-06-21T00:00:00Z", 
    "title": "Developing Web Apps with SAPUI5", 
    "price": 0, 
    "instructors": "Michael Graf, Christiane Goebels and Janina Bläsius", 
    "institution_name": [], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://open.sap.com/courses/ui51", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openSAP"
    ], 
    "start_date": "2016-05-24T00:00:00Z"
}