{
    "selfpaced": true, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    You will learn about challenges of building applications that can serve hundreds of thousands of users, and how you can prepare for them as a developer. And more importantly - you will learn how to harness the power of **App Engine** - Platform as a Service, run by Google, so you can focus on your application's features, not on managing infrastructure that runs your app. Let Google run and scale the infrastructure and do what you do best - write code! \n\nHowever, to use App Engine effectively, you have to learn how it works, and this is exactly what this course will teach! You will also learn the best practices of using Cloud Endpoints that allow you to easily create API services and make them accessible to iOS, Android and Javascript clients. They allow you to automatically generate client libraries to make wiring up the frontend easy. And there are some nifty built-in features, like denial-of-service protection and OAuth 2.0 support.Why Take This Course?Cloud computing is one of the fastest growing fields right now. And no wonder - it provides an easy and affordable way to run your applications. However, the traditional way of hosting and scaling applications on Virtual Machines in the Cloud comes with a cost - even if the infrastructure is virtual, you still have to manage it - do load balancing, bring instances up and down, take care of patching your software and in general spend a lot of your time and resources on just the infrastructure. \n\nGoogle is one of the pioneers in the business of scaling, and now you can use their infrastructure, and let them do all the scaling work so that you can focus on the unique features your app provides.\n\nAre you a Java developer? If so, maybe you'd like to check out our Developing Scalable Apps with Java course.\n\nProject\n-------------\nThere will be an overarching project throughout the course, starting from Lesson 2. You will develop an application for organizing conferences, similar to sites like meetup.com or eventbrite.com. We have provided the frontend of the app, and all your effort will go into making the backend.\n\nAnd because you will be using Cloud Endpoints, it’s really easy to hook up your backend with a native mobile app. We have created an Android app that uses the same backend as the web frontend. You will able to recompile it against your backend, if you so wish!\n\nAt the end of the course you will do a final project, where you will have to expand the functionality of the same app.\n\n                                            Syllabus\n                        ###Overview\nThis course consists of 6 lessons. First one is an overview of cloud computing and the benefits of Platform as a Service. Lessons 2-5 will cover important theoretical concepts of Google App Engine and also plenty of hands-on exercises implementing what you have learned. Lesson 6 will be a short intro on an easy way to create native mobile apps that talk to your backend.\n\n###Lesson 1: Scalability Basics\nDo you know how and why server racks were invented years ago? Have you realized all of the problems that you have to solve if you will try to scale your app by yourself? Learn about a better way.\n\n###Lesson 2: Getting Started\nSet up your first App Engine project and learn how to define Cloud Endpoints. \n\nStart the course project app - Conference Central and add authentication and user profiles.\n\n###Lesson 3: Storing and Retrieving Data\nOne of the most important things you want to do in your app is storing data. In this lesson you will learn what is Google App Engine Datastore, how is it different from RDBMS and how you can use it in your applications.\n\nAdd the ability to store and retrieve user profiles and conferences to the course project app.\n\n###Lesson 4: Advanced Datastore Concepts\nLearn more about how Datastore works, including queries, filters, indexes and transactions. \n\nAdd different ways to query conferences.\n\n###Lesson 5: Advanced App Engine Topics\nThere are a lot of things you might want your application to do in background, without making the user wait, or even initiate the process. Learn about task queues and cron jobs and how you can use them to add advanced functionality to your app. You will also learn about Memcache, and get an overview of topics like Edge Caching, AppStats and other methods of optimizing your apps performance.\n\nAdd a push queue, cron job and a customized Memcache entry to your app.\n                                    ", 
    "end_date": "2015-06-11T00:00:00Z", 
    "title": "Developing Scalable Apps in Python", 
    "price": 0, 
    "instructors": "Karl Krueger and Magnus Hyttsten", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/developing-scalable-apps-in-python--ud858?utm_medium=referral&utm_campaign=api", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-04-30T00:00:00Z"
}