{
    "selfpaced": true, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Canvas is an HTML5 element which gives you drawable surface inside your web pages you can control with JavaScript. Powerful enough to use for compositing images and even creating games.\n\nIn this course, through several sample projects, you’ll learn how to use the canvas; how to make compositions using shapes, images, and text; how to create effects and filters on images and how to create animations.Why Take This Course?You should take this course if you want to move beyond static HTML tag content and build on your JavaScript skills to make interactive and engaging experiences. Maybe you want to start on the journey of creating a game or complex animations, maybe you want to create visually compelling compositions like infographs, or maybe you just want to make memes. Canvas to the rescue.\n\n*This is a recommended course for the Front-End Web Developer nanodegree, and will help you complete the Frogger project.*\n\n                                            Syllabus\n                        You’ll learn how the Canvas 2D API works and how to use it to create interesting applications. Each sample project will expose you to different aspects of HTML5 Canvas that you can use to make your own applications.\n\n### Lesson 1: HTML5 Canvas Basics\n\nIn this lesson, we’ll discuss what the Canvas is, how it affects graphics in the browser and what makes it truly awesome. We’ll make compositions with text and images (e.g. memes) as we learn the API.\n\n### Lesson 2: From Pixels to Animation\n\nIn this lesson, we’ll learn about how images are stored by the Canvas2D context, how to modify them on a pixel level by applying various effects and filters, and how to create animations.\n                                    ", 
    "end_date": "2014-11-27T00:00:00Z", 
    "title": "HTML5 Canvas", 
    "price": 0, 
    "instructors": "James Williams and Cameron Pittman", 
    "institution_name": [], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/html5-canvas--ud292?utm_medium=referral&utm_campaign=api", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2014-11-13T00:00:00Z"
}