{
    "selfpaced": false, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    The web today is almost unrecognizable from the early days of white pages with lists of blue links.  Now, sites are designed with complex layouts, unique fonts, and customized color schemes.   This course will show you the basics of Cascading Style Sheets (CSS3).  The emphasis will be on learning how to write CSS rules, how to test code, and how to establish good programming habits.     \n\nWhen done correctly, the styling of a webpage can take enhance your page.   When done incorrectly the result can be worse than no styling at all.    To ensure that your sites do not put up  barriers for people with cognitive and/or physical disabilities, you will learn how to evaluate pages using the standardized POUR accessibility guidelines.    Upon completion of the course, learners will be able to sketch a design for a given HTML page.  Using that design they will use CSS to implement the design by adding fonts, colors, and  layouts.    \n\nThis is the second course in the Web Design For Everybody specialization.   Subsequent courses focus on adding interaction with JavaScript and enhancing the styling with responsive design.\n\nIt will be difficult to complete this course if you do not have access to a laptop or desktop computer for the homework.\n\n                                            Syllabus\n                        Week One: Getting Started with Simple StylingWelcome to Introduction to CSS3!  In this course you will learn how to style your pages by taking advantage of the power of CSS3.   We will focus on both proper syntax (how to write your styling rules) and the importance of accessibility design (making sure that your style enhances your site, not make it harder to navigate).  It is so important that you jump in ready to make mistakes and typos in this course.  The only way you will really understand the material is to practice typing it in on your own as often as possible.Week Two: Advanced StylingColors and fonts are just the start to styling your page.  The nice thing about starting with these properties is that they are usually very straightforward to implement.  You pick a color and boom - instant, expected results.  This week we move on to new properties that tend to require a little bit of tweaking to get the desired results.  In particular we will talk about the Box Model, background images, opacity, float, columns, visibility, and designing for different browsers.Week Three:  Psuedo-classes, Pseudo-elements, Transitions, and PositioningHave you ever noticed on a web page that some links are blue and others are purple, depending upon if you have clicked on the links?  How is it possible to style some anchor tags and not others?  This week you will learn how to style pseudo-classes (e.g. a link that has been visiting, an element that has the mouse hovering over it) and pseudo-elements (e.g. the first-letter of a heading, the first line of a paragraph).  These elements are not difficult to style, but do require careful coding.  It is also the first step to adding simple animation to your site.  We end this week with the subject of positioning -- how to get elements to stick to a certain part of your page.  Think about annoying pop-up ads.  How do the programmers get them to stay RIGHT IN THE MIDDLE OF THE SCREEN despite the fact that you keep trying to scroll them away.Week Four: Putting It All TogetherThis week I am going to do some code review.  I will show you how I used pseudo-classes and pseudo-elements to style a table.  Then I give you a demonstration of three different navigation bars that utilize different styling options.   We will want to step back and talk about how these different options may affect the accessibility of our site.  The final step to completing this course is the completion of the peer-graded project.  You will have the chance to demonstrate the ability to follow styling guidelines while still putting your own personal touch on the project.  Just remember, you need to validate your work for proper syntax and accessibility.Where To Go From Here?If you would like to do more now that you have finished this course, I have a few recommendations.  The most important thing is that you continue to practice your skills and always have \"something\" that you are working on.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Introduction to CSS3", 
    "price": 0, 
    "instructors": "Colleen Van Lent, Ph.D.", 
    "institution_name": [
        "University of Michigan"
    ], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.coursera.org/learn/introcss", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}