{
    "selfpaced": false, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Vous avez envie de développer des animations ou des petits jeux pour le web. Vous n'avez pas de connaissance particulière des langages web. En revanche, vous avez des notions d'algorithmique et peut-être que vous programmez déjà un peu. Ce MOOC \"Initiation à HTML5 - animations et jeux\" est pour vous. Mais si vous avez déjà une expérience de développement web, ce MOOC vous permettra de découvrir quelques-unes des nouveautés d'HTML5 et de les mettre en oeuvre sur un projet d'animation ou de jeu.\r\nCe MOOC s'échelonne sur 7 semaines. Chaque semaine, votre travail consistera à suivre des vidéos, répondre à des quiz et effectuer de petits exercices.\r\nUne première partie est consacrée à différents langages. Nous verrons qu'une page web est structurée en différents éléments et que c'est le langage HTML qui permet de décrire cette structure. Afin de positionner certains de ces éléments les uns par rapport aux autres et d'appliquer une charte graphique, nous introduirons le langage CSS. Ensuite, grâce au langage JavaScript, nous verrons qu'il est possible de faire en sorte que cette structure HTML et que ce rendu graphique initial soient transformés en direct - repositionnement, création, modification du contenu et du style... - , et ce pour l'instant sans échange avec le serveur. Nous verrons également, que cette page web peut réagir et se transformer suite à un clic souris ou une action au clavier et nous introduirons pour cela les événements JavaScript.\n\n                                    ", 
    "end_date": "2015-11-02T00:00:00Z", 
    "title": "Introduction à HTML5 - Animations et jeux", 
    "price": 0, 
    "instructors": "Jean-Yves Plantec", 
    "institution_name": [
        "American College of Education"
    ], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/groupeinsa/13001S03/session03/about", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}