{
    "selfpaced": true, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Ten minutes into this class you will make your own completely personalized version of the insanely addictive game 2048. Even if you've never coded before. Pretty cool, no?\n\nYou'll do this by making small (but important) modifications to the source code for the original 2048 game. If this sounds intimidating, don't worry. We'll teach you the basics of HTML and CSS and how they interact with Javascript (don't worry if that sentence doesn't mean anything to you yet. It will soon).\n\nThe purpose of this class is to have fun learning how to quickly and easily take an existing open source program, make some changes, and create something that looks and feels completely new. The game you create will be mobile friendly (you can play it on your phone!) and totally shareable.Why Take This Course?**In this course, you'll learn:**\n\n* How a computer program works (specifically small web applications like the 2048 game).\n* What HTML, CSS, and Javascript are and how they interact to make a functioning web application.\n* How to make small changes to HTML and CSS files that have **very large** changes in a program (large enough to turn the original 2048 game into a drastically different Udacity version).\n* How to use Github to make a copy of an open-source program, make changes to that copy, create your own version, and then host that version so you can share it with your friends.\n* Why open-source is such an amazing idea :)\n\n                                            Syllabus\n                        ### Lesson 1: Exploring the HTML and CSS\nYou will create our own version of 2048 by making changes to the existing HTML and CSS files. Within 10 minutes, you'll have your own game. Within an hour, you're friends will be playing **your** 2048 game (fun bonus: your game will be totally mobile-friendly). The topics we'll cover are:\n\n* What is open source? \n* What is HTML? What is CSS? Javascript? \n* How do these three interact to lead to a fully functioning web/mobile app?\n* What is Github?\n* How do I get someone else's code, make changes, and create my own version?\n* How do I host and share my game?\n                                    ", 
    "end_date": null, 
    "title": "Make Your Own 2048", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/make-your-own-2048--ud248?utm_medium=referral&utm_campaign=api", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2014-04-01T00:00:00Z"
}