{
    "selfpaced": false, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Since the introduction of SAP HANA Cloud Platform in 2012 and the first openSAP course about it in 2013, the platform has been continually improved and additional functionality has been delivered. In this course, you will get to know the platform in its most up-to-date state yet.\r\nThis course will introduce you to SAP HANA Cloud Platform and show you how as a developer to take advantage of the various services it provides. Ideally, you should have basic skills in Java programming as well as a basic knowledge of how to use the Eclipse development environment.\r\nIf you took part in the previous courses, you should join this one, because it covers many newly introduced services like the IoT services, gamification services, mobile documents and many more. You will get a more holistic view on the capabilities of the SAP HANA Cloud Platform.\r\nSAP HANA Cloud Platform is an open standards-based, in-memory platform-as-a-service (PaaS) designed for today’s increasingly networked, mobile, social and data-driven world. Developers can quickly build impactful, highly scalable applications leveraging the massive speed and scale of SAP HANA.\r\nThis cloud platform offering allows you to focus on developing your software and use an enterprise-ready, pre-installed environment in the SAP Cloud to deploy and run your applications in a secure and reliable way.\r\nThe registration, learning content, and final exam are free of charge. You will be able to get some practical experience of the platform by using a free developer account. We’ll explain how you can access this at the start of the course.\n\n                                            Syllabus\n                        Week 1: BasicsWeek 2: SecurityWeek 3: ConnectivityWeek 4: PersistenceWeek 5: IoT and CollaborationWeek 6: Additional ServicesWeek 7: Final Exam\n                                    ", 
    "end_date": "2016-06-28T00:00:00Z", 
    "title": "SAP HANA Cloud Platform Essentials", 
    "price": 0, 
    "instructors": "Sven Koolhaas and Rui Nogueira", 
    "institution_name": [], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://open.sap.com/courses/hcp1", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openSAP"
    ], 
    "start_date": "2016-05-10T00:00:00Z"
}