{
    "selfpaced": true, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    The Web has become an object of our daily life and the amount of information in the web is ever growing. Besides plain texts, especially multimedia information such as graphics, audio or video have become a predominant part of the web's information traffic. But, how can we find useful information within this huge information space? Traditional search engines will reach the limits of their power, when it comes to understanding information content. The Semantic Web is an extension of the traditional web in the sense that information in the form of natural language text in the web will be complemented by its explicit semantics based on a formal knowledge representation. Thus, the meaning of information expressed in natural language can be accessed in an automated way and interpreted correctly, i.e. it can be understood by machines.\r\nSemantic Web technologies enable the explicit representation of knowledge and its further processing to deduce new knowledge from implicitly hidden knowledge. Thus, information access and information search will be more precise and more complete compared to today's traditional information retrieval technology. Previously heterogeneous data can be mapped and combined based on common knowledge representation and schemata easily extended in a dynamic way.\r\nIn this course, you will learn the fundamentals of Semantic Web technologies. You will learn how to represent knowledge and how to access and benefit from semantic data on the Web.\n\n                                            Syllabus\n                        \r\n\r\nWeek 1:\r\nIntroduction to the Semantic Web\r\n\r\nWeek 2:\r\nIdentifying Things with URI and RDF\r\n\r\nWeek 3:\r\nQuerying RDF(S) with SPARQL\r\n\r\nExcursus:\r\nSemantic (Meta) Data and the Web\r\n\r\nWeek 4:\r\nKnowledge Representation I\r\n\r\nWeek 5:\r\nKnowledge Representation II\r\n\r\nWeek 6:\r\nApplications in the Web of Data\r\n\r\nFinal Exams:\r\nFinal Exams\r\n\n                                    ", 
    "end_date": null, 
    "title": "Semantic Web Technologies", 
    "price": 0, 
    "instructors": "Dr. Harald Sack", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://open.hpi.de/courses/semanticweb", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openHPI"
    ], 
    "start_date": "2013-02-06T00:00:00Z"
}