{
    "selfpaced": false, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    The presentation tier in a web application is the one that a user interacts with through the web browser. This is a vitally important topic, as the user experience is often what determines the success of a web application. If a user cannot interact with a web application in an efficient and effective manner, the overall success of the application will be compromised, no matter how well the rest of the application is designed and implemented.  This is also an area where there has been much innovation over the past few years, with improvements in browser technology, the release of HTML5, the emergence of responsive design and the release of powerful front-end frameworks.\n\nIn this course you will learn some basic graphic design fundamentals that are intended to produce a pleasing end user experience.  The course will also cover common approaches to wireframing and prototyping, along with the most important concepts behind the JavaScript programming language.  You will learn how to use the Hypertext Markup Language (HTML), Cascading Style Sheets (CSS) and JavaScript triad in order to produce compelling web site content.  More importantly, you will learn the design patterns and design concepts that should support the use of these technologies, allowing you to create web applications that can be easily maintained and modified over time.  Finally you will learn about responsive design, and how to use some of the emerging front-end frameworks, such Bootstrap, AngularJS and Vue.js, to create modern single-page applications.\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Web Application Development: The Presentation Tier", 
    "price": 0, 
    "instructors": "Greg Heileman and Manel Martínez-Ramón", 
    "institution_name": [
        "University of New Mexico"
    ], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.coursera.org/learn/webapps3", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-01T00:00:00Z"
}