{
    "selfpaced": true, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Das Web – eigentlich nichts anderes als ein einfacher Informationsdienst im Internet – hat eine ganz neue digitale Welt entstehen lassen, die eng verwoben mit unserer realen Welt früher Unvorstellbares möglich macht: sekundenschnelle Kommunikation über Kontinente, Filme auf dem Smartphone anschauen, mit Partnern in entfernten Ländern spielen oder Fotos anschauen oder vom Sofa aus einkaufen und Bankgeschäfte tätigen… In unserem Onlinekurs zu den Web-Technologien lernen Sie, wie das alles funktioniert. Zunächst besprechen wir die dem Web zugrundeliegenden Basistechnologien URI, HTTP, HTML, CSS und XML. Auch wenn das zunächst sehr kryptisch klingt, werden Sie schnell verstehen, worum es geht. Wir sehen uns dann Webservices und die Techniken der Webprogrammierung an und üben diese ein. Dann werden wir uns mit der Frage beschäftigen, wie Suchmaschinen, die uns als Webweiser in der digitalen Welt so schnell und zuverlässig helfen, Inhalte und Dienstangebote im Web zu finden, eigentlich funktionieren. Der Kurs schließt mit einem Ausblick auf das Cloud Computing, das die Art und Weise, wie wir in Zukunft auf Rechenleistungen zugreifen werden, grundlegend verändert.\n\n                                            Syllabus\n                        \r\n\r\nWoche 1:\r\nEinführung in das WWW\r\n\r\nWoche 2:\r\nWoche 2\r\n\r\nWoche 3:\r\nWoche 3\r\n\r\nWoche 4:\r\nWoche 4\r\n\r\nExkurs:\r\nExkurs\r\n\r\nWoche 5:\r\nWoche 5\r\n\r\nWoche 6:\r\nWoche 6\r\n\r\nKlausur:\r\nKlausur\r\n\n                                    ", 
    "end_date": null, 
    "title": "Web-Technologien", 
    "price": 0, 
    "instructors": "Prof. Dr. Christoph Meinel", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://open.hpi.de/courses/www", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "openHPI"
    ], 
    "start_date": "2013-06-03T00:00:00Z"
}