{
    "selfpaced": false, 
    "topic_name": [
        "Web Development"
    ], 
    "description": "\n\n                    \n                    \n                    Lernen Sie die Herausforderungen bei Planung, Entwicklung, Test und Wartung von Websites kennen. Sie erwerben die Kompetenz, W3C-konforme, sichere und performante Webpräsenzen zu entwickeln. „Web-Engineering“ bietet Konzepte, Methoden, Techniken und Werkzeuge für die systematische Entwicklung von Websites und Web-Applikationen.\r\nSie üben online den Umgang mit der Infrastruktur und den Werkzeugen, die für die Entwicklung und Wartung einer mit Twitter Bootstrap aufgebauten Website benötigt werden. Sie lernen insbesondere die dafür notwendigen technischen und architektonischen Grundlagen. Der Kurs führt auch in die Sicherheitsproblematik von Websystemen ein. Sie analysieren Angriffsmethoden und entwickeln Gegenmaßnahmen.\r\nKursstruktur\r\nDer Kurs ist in zwei aufeinanderfolgenden Teilen organisiert: Dieser Kursteil, Web-Engineering I, beginnt am 15. Oktober 2013. Jeder Kursteil umfasst 10 Kapitel mit jeweils 6 bis 8 Lerneinheiten. Der wöchentliche Zeitaufwand beträgt ca. 6 Stunden. Für Studierende an Hochschulen entspricht der Arbeitsaufwand für den gesamten Kurs 6 ECTS-Leistungspunkten. Im zweiten Teil des Kurses geht es ab dem 17. Januar 2014 zur eigenen HTML5-App.\r\nBei ausreichenden Vorkenntnissen können Sie den Kurs auch mit dem zweiten Teil beginnen.\r\nLernziel\r\nAm Ende des ersten Kursteils \"Web-Engineering I: Grundlagen der Web-Entwicklung\" sollen Sie die folgende Kompetenz erworben haben: Wie entwickle ich im Kundenauftrag eine standardkonforme, barrierefreie, performante und sichere Website?\r\nAn wen richtet sich dieser Kurs?\r\nDer MOOC „Web-Engineering“ richtet sich an Studierende der Informatik, auch Medien- und Wirtschaftsinformatik, an Auszubildende der Fachinformatik mit der Fachrichtung Anwendungsentwicklung und an berufstätige Web-Designer/innen. Für Studierende der TH Mittelhessen im Fachbereich MNI ist der MOOC „Web-Engineering“ äquivalent zum Bachelor-Modul „Internetbasierte Systeme“ (CS 1024).\r\nKurszertifikate\r\nSie erhalten für jeden Kursteil ein Zertifikat, wenn Sie die folgenden Leistungen erbracht haben:\r\n\r\nWeb-Engineering I: Bestehen der Online-Abschlussprüfung des ersten Kursteils und Erstellen einer Website\r\nWeb-Engineering II: Bestehen der Online-Abschlussprüfung des zweiten Kursteils und Erstellen einer HTML5-App\r\n\r\nVoraussetzung für die Kursteilnahme\r\nSie sollten grundlegende Kenntnisse in der Programmierung mitbringen. Für die Entwicklungswerkzeuge ist ein leistungsfähiger Laptop- oder Desktop-Rechner erforderlich, auf dem Sie Administratorrechte haben.\r\nDie im Kurs eingesetzten Lernressourcen (Websites, YouTube-Videos) sind vorwiegend in Englisch, deshalb sollten Sie gute Englischkenntnisse mitbringen.\r\nUnsere Kompetenzen\r\nWer einen Online-Kurs wie „Web-Engineering“ anbietet, sollte entsprechende Referenzen aufweisen können. In den letzten Jahren haben wir in den Bereichen E-Learning und Suchmaschinen mehrere webbasierte Systeme, wie z. B. die universitäre Suchmaschine Pharus, die Lern- und Kollaborations-Plattform eCollab oder das mobile Abstimmungssystem ARSnova, als Open-Source-Projekte entwickelt, stets als studentische Projekte beginnend und in Bachelor- und Masterprojekten zur Marktreife gebracht.\r\nRückblickend war es der Kurs „Web-Engineering“, der die Studierenden für diese Projekte ausreichend vorbereitet hat. Wenn Sie die beiden Kursteile Web-Engineering I und II absolvieren, werden Sie Gleiches leisten können.\n\n                                            Syllabus\n                        Kursinhalt\r\nSie erlernen die folgenden Inhalte anhand von Lehrvideos, Screencasts und interaktiven Online-Übungen und erproben die technischen Aspekte an Beispielen aus der Praxis.\r\n\r\nKapitel 1: Einführung in den MOOC \"Web-Engineering\"\r\nKapitel 2: Starter Kit: Tools für die Website in der Cloud\r\nKapitel 3: Chronik des Internets: vom ARPANET über HTTP in die Cloud\r\nKapitel 4: HTTP: Hypertext Transfer Protocol\r\nKapitel 5: Interaktives Praktikum: HTML/CSS\r\nKapitel 6: Semantische Textauszeichnung, Unicode &amp; UTF-8, (X)HTML-Standards\r\nKapitel 7: Digitale Barrierefreiheit\r\nKapitel 8: Webdesign | Web-Usability\r\nKapitel 9: Website-Analyse und -Optimierung\r\nKapitel 10: Sicherheitsrisiken einer Website\r\n\n                                    ", 
    "end_date": "2013-12-10T00:00:00Z", 
    "title": "Web-Engineering I: Grundlagen der Web-Entwicklung", 
    "price": 0, 
    "instructors": "Klaus Quibeldey-Cirkel", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://iversity.org/courses/web-engineering-i-grundlagen-der-web-entwicklung", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2013-10-15T00:00:00Z"
}