{"selfpaced": true, "topic_name": ["Career Development"], "description": "\n\n                    \n                    \n                    Are you an international student or graduate in Germany, planning to embark on a career here? That’s great! Germany is among the most attractive destinations for international young professionals. An abundance of opportunities awaits a well-prepared candidate, and ceasing yours is much easier if you know the ins and outs of the German job market and work culture.\r\nThis MOOC enhances those key skills that you will need for a successful transition from studies to employment. In the seven-week course, you will learn about career identities and strategies, job application skills, workplace competences and the psychology of employability. You will also create your personal career development plan to give you immediate guidance for your next steps.\r\nReady to change your backpack to a briefcase? Enrol on our employability skills MOOC today!\n\n                                            Syllabus\n                        Chapter 1 - Introduction. In the first chapter, you will meet the instructors, gain an overview of the course and learn what employability means and how higher education develops it.\r\nChapter 2 - Career identity. Your career identity means the understanding of self on the labour market. This is determined by various factors such as your competences, motivations and values. In this chapter you will learn how these form a coherent career identity.\r\nChapter 3 - Job application skills. This chapter will give you skills in identifying job opportunities, crafting your application documents and carrying out a managed, effective job application process.\r\nChapter 4 - Employability skills 1: Interpersonal skills. Daily work with colleagues is different in every country. This chapter aims at making your integration to the German workplace easier. The topics include communication culture, workplace personality, teamwork skills, and negotiation and conflict resolution.\r\nChapter 5 - Employability skills 2: Work management skills. In this chapter you will learn what is typically expected of you performance-wise at a German workplace. Important topics are proactivity and self-direction, productivity and time management, problem solving skills, and commercial and organisational awareness.\r\nChapter 6 - Attitudes and self-efficacy. Employability is often linked to the psychology of self. How well you tackle workplace challenges and develop professionally significantly depends on your attitudes, self-efficacy beliefs, self-confidence and self-esteem. This chapter will discuss the meaning of these concepts to your personal employability.\r\nChapter 7 - Career development project. In chapter 3, you will receive a career development project assignment, which you will have six weeks to complete. Chapter 7 will focus on supporting your project by providing advice and answering any questions you may have. The projects are due to be uploaded by the end of this week.\r\nChapter 8 - Evaluation and goodbye. Our course is now over and it is time to look back at how we did. At this point your feedback would be very much appreciated and helpful in improving the course. In the background, we will still continue evaluating the projects. The certificate track students will receive a personal review appointment by one of the team members.\n                                    ", "end_date": "2015-09-21T00:00:00Z", "title": "Employability Skills", "price": 0, "instructors": "Antti Kapanen", "institution_name": ["HTW Berlin - University of Applied Sciences"], "commitment": "2-3 hours", "subject_name": ["Personal Development"], "course_url": "https://iversity.org/en/courses/employability-skills-may-2016", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2015-08-03T00:00:00Z"}