{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">You love the excitement of exploring a new city: new culture, new food, sometimes even a new language! There are castles, museums, and art galleries to explore. There are new restaurants to try, new shops to investigate, and new friends to meet.</p><p style=\"\">But one thing you don&#039;t love about traveling is coming back to a hotel or hostel at the end of the day. And it&#039;s not just about the money, although you would really rather not be paying quite so much for your room. </p><p style=\"\">It&#039;s mostly about wishing that you could come home to a real home or apartment after a long day of sightseeing. Someplace that feels a bit more like home. Someplace with personality, and maybe a dog or cat to greet you at the end of the day.</p><p style=\"\">This course is specifically for people who are looking for something different while they&#039;re traveling. People who want a home to come back to after a long day of playing tourist. People who are willing to do things a little “outside the box” to have a great vacation while living like a local for free.</p><p style=\"\"><strong style=\"\">This course is for you if you&#039;ve ever wanted to:</strong></p> <ul style=\"\"><li style=\"\">Explore major cities and tourist destinations while getting to know the locals.</li><li style=\"\">Wake up in the country surrounded by nothing but nature (and maybe a few pets).</li><li style=\"\">Cook some (or all!) of your own meals – and shop like a local, too!</li><li style=\"\">Travel to off-the-beaten track locales in Europe, the US, and Canada.</li></ul> <p style=\"\">If you said “Yes! That&#039;s me!” to one or more of those statements, you&#039;re in the right place. </p><p style=\"\">My name is Felicity Fields, and one year ago I put all my belongings into a storage unit and set off on an extended US/Canadian/European travel adventure.</p><p style=\"\">Along the way, I&#039;ve stayed at a beautiful million-dollar condo overlooking the water in Vancouver, BC; a row-house in Dublin, Ireland for 5 weeks over Christmas; a charming three-bedroom, 2 bath house in an English country village; and a converted barn in the French countryside.</p><p style=\"\">And I haven&#039;t paid a penny to stay in any of these places.</p><p style=\"\"><strong style=\"\">Instead, I used a practice called house-sitting to free places to stay. </strong></p><p style=\"\">At its most basic, house-sitting is the practice of looking after people&#039;s homes and pets. It involves two groups of people. Group A are the home and pet owners who want to go on vacation, but don&#039;t want to leave their home unattended, or put their pets in a kennel or cattery. But they&#039;d be happy to have someone come in and watch their house and pets while they&#039;re away!</p><p style=\"\">Group B are people just like you: people who love to travel, but for whom the cost of a place to stay is a bit more than their travel budget allows. This way, by looking after a house and a few pets, you get a wonderful place to stay – for free!</p><p style=\"\">Over the last year, I&#039;ve made a few mistakes looking after other people&#039;s homes, and I&#039;ve also learned a few things about how to find the perfect opportunities for me. </p><p style=\"\">I want to share with you exactly how I do it, so you can get started on the best possible foot!</p><p style=\"\"><strong style=\"\">Specifically, you&#039;ll learn:</strong></p> <ul style=\"\"><li style=\"\">Where to find people who want you to look after their home and pets</li><li style=\"\">How to maximize your chances of being chosen to look after someone&#039;s home</li><li style=\"\">Things to know before, during, and after you stay in someone else&#039;s home</li><li style=\"\">How to trust the people you meet on the internet</li></ul> <p style=\"\">And, you&#039;ll receive all the worksheets, cheat sheets, and tutorials you need to start looking for your perfect house-sitting assignment.</p><p style=\"\"><strong style=\"\">If you are ready to actually plan your vacation instead of dreaming about it, enroll in this course today. </strong></p><p style=\"\">You&#039;ll learn exactly how to find these opportunities to look after someone else&#039;s home and pets, and how to find the perfect vacation destination for you – at a fraction of the price!</p><p style=\"\">Every minute you delay is another minute you&#039;re not looking forward to your next vacation.</p><p style=\"\">Enroll today and take control of your vacation, and your budget.</p><p style=\"\">See you on the inside!</p><p style=\"\">~ Felicity</p>", 
    "end_date": null, 
    "title": "[New] Travel the US, Canada, and Europe Without Going Broke!", 
    "price": "45.00", 
    "instructors": "Felicity Fields", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481128_5ed9_3.jpg", 
    "course_url": "https://www.udemy.com/travel-us-canada-europe-without-going-broke/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T12:50:53Z"
}