{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">If you had the opportunity to travel anywhere in the World, where would you go? With this class you can learn how to travel the World without spending very much money at all. This is your opportunity to learn how to travel the World. This class will specifically teach you how to get to where ever you would like to go around the World.</p><p style=\"\">Traveling the World is an essential experience in life that enables us to grow as individuals. Imagine how many amazing places you can see and imagine how many amazing people you will meet when you go on your Global adventures. This World is a very beautiful place and worth exploring throughly. Imagine having the ability to go and meet your friends in other countries, making new friends across the World and experiencing the sights and sounds in person of the the beautiful places this beautiful earth has to offer. Marvel at the beauty of our civilizations achievement's around the World, meet your cousins, try new and tasty food, experience the treasures of civilizations past, experience cultural festivals markedly different than your owns, meet beautiful people from other parts of the World, have intricate cultural experiences, communicate with someone for a long time without speaking their language, understanding how different people have different tastes, if you have any desire to peek around the corner then this class definitely is for you. Don't waste this opportunity to acquire this outstanding skill.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Art of World Travel - Live the awesome life", 
    "price": "20.00", 
    "instructors": "Startup Saturdays", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465172_1d46_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-world-traveller/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T18:03:47Z"
}