{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>U.S. law sets out many standards under which a visa application may be denied.</p>\n\n\n\n<p>More than 2 million US visa applicants are denied every year by embassies and consulates around the world.</p>\n\n\n\n\n\n<p>Approximately 75% of these applicants are individuals, who did not <br>prove they would return to their home country or otherwise prove <br>eligibility.</p>\n\n\n\n\n\n<p>Consular officers have a difficult job — they are on the front <br>lines of our fight with terrorism; must deal with fraudulent <br>documentation submitted in support of visa applications; and have very <br>little time to interview applicants.</p>\n\n\n\n\n\n<p>Because of their limited time and resources, it is not surprising <br>that consular officers frequently make factual mistakes, misunderstand <br>applicants, make legal errors, and ignore relevant facts and <br>documentation in reviewing legitimate applications.</p>\n\n\n\n\n\n<p>The course provides relevant information on the student’s US VISA <br>process. It is recommended for any individual who has got an acceptance <br>letter from an institution of the United States, and wants to know about<br> the ways through which he or she can go through the daunting VISA <br>process and secure a place in the institution of his or her choice.</p>\n\n<p>These videos will provide all the necessary information related to <br>the student’s VISA along with the ways through which you can crack the <br>VISA interview. Our informative video will surely improve your chances <br>of getting a student VISA, and help you live your dream of studying in<br> the United States of America. </p>", 
    "end_date": null, 
    "title": "Avoid US Visa Rejection -Student Visa Interview Guide", 
    "price": "50.00", 
    "instructors": "CollMission Advisors", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/804530_24cd.jpg", 
    "course_url": "https://www.udemy.com/avoid-us-visa-rejection-student-visa-interview-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-26T16:03:45Z"
}