{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Updated with new material on January 7th, 2015!</em>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">If you take this course, you are <u style=\"\">guaranteed</u> to earn at least one free flight valued at $200 or more within 3 months!</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;Do yourself a favor and get this course. Spending the money now, will save you many, many times more than that on plane tickets in the future.&quot; - Tiffany N.</em>  </p>  <p style=\"\">  \t<strong style=\"\">Do you dream of traveling the world, but can&#039;t justify paying for expensive flights? </strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>You don&#039;t have to dream. This course may not cost much but it will save you tens of thousands of dollars in travel expenses as you learn how to magically conjure up free flights and hotels with ease!  </p>  <p style=\"\">  \t             Did you know that you can accumulate literally <strong style=\"\">millions</strong> of Frequent Flyer Miles without leaving the comfort of your home or even damaging your credit score? In fact, there are thousands of people who literally fly and stay for free, enjoying the world&#039;s most exciting and exotic destinations while everyone else pays full price.  </p>  <p style=\"\">  \t<strong style=\"\">Now, you can join them, and become a Travel Wizard!</strong>  </p>  <p style=\"\">  \t             Join renowned travel expert Travis Sherry and lifehacking expert Jonathan Levi as they teach you the ins and outs of accumulating and using frequent flyer miles. As owner and editor of the wildly popular ExtraPackofPeanuts blog, Travis has helped countless travel hackers learn the finer points of the trade. <strong style=\"\">In this course, he assumes no prior knowledge, and will teach you everything you need to do, starting from scratch.</strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;There is so much great information here. I&#039;m already planning a trip to Asia with miles using the information I learned here. Free stopover? Yes, thank you.&quot; -Robb H.</em>  </p>  <p style=\"\">  \t<strong style=\"\">Like most people, you may think that Frequent Flyer Miles are a &quot;gimmick&quot; or &quot;not worth it&quot; - you&#039;re wrong!</strong>  </p>  <p style=\"\">  \t           Using Frequent Flyer Miles, people like Travis have been able to fly to over 20 countries, usually for less than $100 <em style=\"\">round trip</em>. Sure, if you only earn miles by flying, and don&#039;t know how to get the best flights, they&#039;re not worth very much. However, if you know how to <em style=\"\">properly</em> earn and spend miles, they can be wildly valuable.  </p>  <p style=\"\">  \t<strong style=\"\">Don&#039;t spend weeks or months digging through websites and forums learning how - Let us show you in about 2 hours!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>We&#039;ll show you how to:  </p>  <ul style=\"\">  \t<li style=\"\">Earn literally hundreds of thousands of miles a year without ever leaving your house</li>  \t<li style=\"\">Choose the right credit card offers and programs for your unique travel aspirations</li>  \t<li style=\"\">Protect your credit score so that you can keep earning miles</li>  \t<li style=\"\">Find hidden partner flights the airlines don&#039;t want you to find, so you can get the most travel for your miles</li>  \t<li style=\"\">Use the right miles for the right trips to avoid surcharges, taxes, and fees</li>  \t<li style=\"\">Get bonus free one-way flights (without spending any extra miles) through loopholes in the system</li>  \t<li style=\"\">Make the most of your travel time with cheap (or free) hotel options</li>  </ul>  <p style=\"\">  \t<em style=\"\">&quot;Travis has the unique ability to simplify the complex world of travel rewards making it easy to maximize your frequent flyer miles and more. This course will pay dividends for years to come... Buy the course.&quot; - Jason P.</em>  </p>", 
    "end_date": null, 
    "title": "Become a Travel Wizard: Learn to Game the System & Fly Free", 
    "price": "20.00", 
    "instructors": "Travis Sherry", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156696_72da_4.jpg", 
    "course_url": "https://www.udemy.com/travel-hacking-like-a-wizard-fly-for-free/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-02T12:11:34Z"
}