{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\"><strong style=\"\">There are some things your need to know BEFORE start walking your Camino de Santiago. Very important things...</strong></p><p style=\"\">  \t        <strong style=\"\">This is the Ultimate Camino de Santiago preparation guide. (Way of St James)</strong>  </p>  <p style=\"\">  \t        The Camino de Santiago (also known as Way of St James) is an 800km (500 miles) pilgrimage on Spain, you will spend around 34 days walking on the absolutely beautiful landscapes of Spain.      (if for any reason you think the Camino is too much for you please scroll down and watch for Free the video called “Is the Camino de Santiago for me?&quot; and      you will see why you need to include the Camino on your plans).  </p>  <p style=\"\">  \t        For this journey you need preparation, this is the absolute best material that you can find on video to help you prepare for the Camino.  </p>  <p style=\"\">  \t        My goal is to inspire and help you to be totally prepare and ready for the best experience of your life! That&#039;s why I created this course.  </p>  <p style=\"\">  \t<strong style=\"\">After the course you will be able to…</strong>  </p>  <ul style=\"\">  \t<li>          Walk the Camino de Santiago with total confidence.      </li>  \t<li>          Choose the best gear/equipment for your specific needs.      </li>  \t<li>Clarify all the millions of doubts and questions you may have about the Camino de Santiago.</li>  \t<li>Be able to choose the perfect boot, backpack, hiking poles, flashlights, Sleeping bag, towel, clothes, socks, etc.</li>  \t<li>          Be able to plan the financial aspect of their Camino.      </li>  \t<li>          You will do the best training to prepare for the Camino.      </li>  \t<li>Know what to do if you need to see a Doctor or have access to a Pharmacy on the Camino.</li>  \t<li>You will know exactly what to pack for the Camino and most important… what not to pack!</li>  \t<li>          You will know how to travel to the starting point on the Camino.      </li>  \t<li>          You will know what&#039;s the best time of the year to go.      </li>  \t<li>You will be able to choose the best technology for the Camino, best camera, everything about cellphones in Spain, SIM cards, extra batteries, adapters      needed in Spain, everything…</li>  \t<li>You will be able to download the Best Camino Apps for your cellphones or tablets.</li>  \t<li>You will know how to take care of your feet during the Camino. VERY IMPORTANT!</li>  \t<li>          You will receive Super Tips from me.      </li>  </ul>  <p style=\"\">  \t        And because you are part of our community… if for any reason you have a question, you can send me a message and I&#039;ll be happy to reply to you personally.      And that&#039;s really important because during preparation you will have lots of questions.  </p>  <p style=\"\">  \t<strong style=\"\">VERY IMPORTANT TO KNOW:</strong>  </p>  <p style=\"\">  \t        This course is always growing, every week I&#039;ll add videos to the course, also I&#039;ll record a video replying questions from students (maybe your question)      and all this will be added to the course constantly, if there are any updates about the Camino that you need to know, or any other subjects I think will be      important, I&#039;ll be adding all this to the course. So please, check the course constantly.  </p>  <p style=\"\">  \t<em style=\"\">        Remember, your Camino starts when you decided you are going to do it!  </em>  </p>  <p style=\"\">  \t        So, let&#039;s get started with this amazing journey! See you inside the course.  </p>", 
    "end_date": null, 
    "title": "Camino de Santiago - Master Preparation Guide for the Camino", 
    "price": "35.00", 
    "instructors": "Diego Davila", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369112_11af.jpg", 
    "course_url": "https://www.udemy.com/camino-de-santiago-ultimate-preparation-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T20:37:34Z"
}