{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Aprende la forma de viajar y vivir por todo el mundo durante largas temporadas de tiempo, gastando siempre lo menos posible. </p><p><strong style=\"\">Haz realidad tu sueño de conocer este bonito planeta en el que vivimos, así como sus gentes y culturas.</strong></p><ul style=\"\"><li style=\"\">Abre tu mente a descubrir las posibilidades que te ofrece la vida de hoy en día para viajar por todo el mundo.</li><li style=\"\">Reevalúa tus creencias sobre el dinero, el mundo en el que vivimos y los viajes.</li><li style=\"\">Conoce las tres mejores formas de financiarte tus viajes y elige una de ellas.</li><li style=\"\">Descubre cómo puedes ahorrarte miles de euros para continuar viajando por largas temporadas.</li><li style=\"\">Quítate los miedos que aún te impiden salir de casa con una mochila e ir a visitar lugares lejanos.</li><li style=\"\">Realiza tu plan personal para pasar a la acción cuanto antes y cumplir tu objetivo de viajar sin ataduras.</li></ul><p><br style=\"\"></p><p><strong style=\"\">Un poderoso método de cambio al alcance de tu mano.</strong></p><p>Después de mi primer viaje de 8 meses alrededor del mundo con una mochila a mis espaldas, descubrí que otra forma de vida, diferente a la que me habían enseñado y la que veía a mi alrededor desde que nací, era posible. </p><p>Esa otra forma de vida suponía visitar de forma sencilla el planeta en el que vivimos, incluyendo  su multitud de gentes y culturas, sus impresionantes paisajes y las aventuras que nos guarda en cada esquina. </p><p>La experiencia fue tan enriquecedora que me cambió la vida, y desde entonces una de mis misiones es enseñar a otras personas cómo hacer lo mismo.</p><p>Al volver a casa, escribí un libro explicando cómo es posible y los pasos necesarios para tomar acción y ahora, al cabo de un año, he creado este curso en Udemy para poder profundizar mucho más en cada apartado y para poder acercarme así aún más a las personas que necesiten vencer sus miedos para hacerlo realidad. </p><p><br style=\"\"></p><p><strong style=\"\">Contenido y visión de conjunto del curso</strong></p><p>Adecuado a todo tipo de personas, desde jóvenes hasta los más mayores, en este curso te enseño de primera mano y gracias a mi experiencia personal cómo es posible viajar por el mundo por largas temporadas de tiempo gastando una cantidad de dinero ridícula cada mes. </p><p>En él aprenderás todo lo que necesitas para cambiar tus creencias sobre ti mismo y la vida que vives actualmente, así como quitarte los miedos que te impiden hacerlo realidad. </p><p>Profundizaremos en temas diversos, como pueden ser el <strong style=\"\">viajar solo,</strong> las <strong style=\"\">enfermedades y la seguridad</strong> en otros países, los <strong style=\"\">visados </strong>o los <strong style=\"\">idiomas </strong>necesarios para poder viajar con garantías, pasando luego a conocer y evaluar los tres principales métodos de <strong style=\"\">financiación para el viaje</strong>, a saber cómo podemos beneficiarnos de los llamados &#039;<strong style=\"\">ahorradores de viaje</strong>&#039; y a realizar un listado con todo lo necesario que debes llevarte en la mochila, así como cosas imprescindibles que llevar a cabo antes de marcharte.</p><p><em style=\"\">Si viajar ha sido siempre uno de tus sueños, lo tienes ahora al alcance de la mano. </em></p><p><strong style=\"\">//Recuerda que tienes una garantía de devolución de 30 días. Si no quedas satisfecho/a con el contenido o la calidad del curso, se te devuelve todo el dinero.//</strong></p><p>¡Completa el curso y ya estarás listo/a para poder empezar a poner todo en orden y lanzarte a la aventura en menos de un mes! </p><p><br style=\"\"></p><p><br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Cómo Viajar y Vivir con 300€ al Mes", 
    "price": "40.00", 
    "instructors": "Pablo Olóndriz", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/391856_f61d_2.jpg", 
    "course_url": "https://www.udemy.com/viajar-con-300e-al-mes/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T09:17:00Z"
}