{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Hey guys! Thanks so much for taking a look at my course. It really means the world to me :)</p><p>For those that don't know me, during the past 5 years, I traveled to over 60 countries, financing my adventures through many location independent streams of income. After many years of exploring the world, emptying my bucket list and building profound happiness, I realized that there must be many like-minded people, who would like to build a similar lifestyle. </p><p>This course is designed for those who want to explore a different area, learn new skills or experiment in order to find their dream job. If you are thinking about making a major shift in your life to finally start doing what you love, exploring the world and building an audience of passionate supporters, this course is for you! </p><p>The objectives of this course are to introduce you to the world of blogs in order to prepare you for your adventure. The course will save you hundreds of hours by guiding you along the entire process of creating a profitable blog and preparing yourself for your travels. </p><p>Becoming a digital nomad is no easy task. If you end up selling all of your possessions in orders to fund your travels, it means you must keep constant track of your earnings, spending and much more! You will need to develop a good source of location independent income to afford your travels. We will teach you basic budgeting and travel hacks to sustain your lifelong adventure.</p><p>You will learn how to create a professionally looking blog on WordPress and format posts and add handy widgets and plugins. In order to survive, your blog will need good content. By the end of the course, you will understand how to come up with lots of good ideas to write about and learn how to create good looking posts so you can keep your visitors reading. </p><p>You will also learn how to establish an online presence, build an engaged audience and develop relationships with them. We will teach you how to create and manage a social media page to communicate effectively with your readers and basic marketing techniques such as email marketing using MailChimp so that you can send reminders, promotions and blog post updates.</p><p>Imagine backpacking through Southeast Asia or motorcycling across europe. There is nothing in the world that stops you from starting your own journey today. Sign up for this class to take a leap and live your dream life today. </p><p><strong>You MIGHT be a digital nomad if:</strong></p><ul><li>You’re not happy in your current environment</li><li>You <em>know </em>that - if free - you could achieve more professionally</li><li>You want more excitement in what you do, and want to focus on your passion.</li><li>You don’t have the best fit in your current company. </li><li>You want to learn how to make a pivot in your life</li></ul><p><strong>Why aren’t you a digital nomad yet? It could be:</strong> </p><ul><li>You need an extra push </li><li>Your current environment [friends, family, coworkers] might not understand how to support you. </li><li>You know you can work digitally, or off-and-on, and be free from a specific geographic location</li><li>You want to become part of a strong network of people who are travelers, explorers and adventurers</li></ul>", 
    "end_date": null, 
    "title": "Digital Nomad: Experience the World as a Travel Blogger", 
    "price": "25.00", 
    "instructors": "David Landau", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/781866_d711_2.jpg", 
    "course_url": "https://www.udemy.com/digital-nomad/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-04T05:02:34Z"
}