{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>LATEST: Course Fully Updated For November 2015</em></p><p>Protecting your health is a crucial part of the international travel preparation process. Even those individuals in decent physical shape are still subject to foreign disease, food and water contamination, and unhygienic sanitary conditions which may leave them with symptoms ranging from unpleasant digestive problems to life-long complications. Prevention is vital to maintaining a superior level of health overseas. Additionally, there are health requirements which have been established by some foreign government and health agencies which cannot be bypassed. For example, entrance to many west African countries requires documentation of yellow fever vaccination, and it is not uncommon for travelers to Japan to have their temperature taken upon arrival. </p><p>This course will walk you through topics relevant to traveler health, including: trusted traveler health resources, World Health Organization vaccination card, traveling with medication, food and water safety, sanitation concerns, unique health circumstances a traveler might encounter, overseas medical insurance, and preparing for medical emergencies. </p><p><em>No prior travel knowledge is required!</em></p><p>+++++++++++++++++++++++</p><p>What You Get:</p><ul><li><em>A food allergy card template. (PDF)</em></li><li><em>An emergency medical plan template. (Word doc)</em></li><li><em>Traveler medical history template (Word doc)</em></li><li><em>A comprehensive travel checklist which details everything you need to do before you depart for your international trip. (PDF)</em></li><li><em>24/7 lifetime access to course content and materials.</em></li><li><em>All future extra lectures and upgrades are always included for free.</em></li><li><em>Unconditional Udemy 30 day money-back guarantee.</em></li></ul><p>You'll Learn How To:</p><ol><li>Navigate the CDC and WHO websites</li><li>Research current CDC travel health notices for your destination</li><li>Research current disease outbreaks being monitored by the WHO</li><li>Determine what vaccinations are recommended or required for travel to your destination</li><li>Find a CDC approved travel vaccination clinic</li><li>Complete properly a WHO vaccination card</li><li>Create an emergency health plan for an international trip</li><li>Travel overseas legally with prescription medication</li><li>Eat abroad by using trusted techniques in food and water safety to avoid getting sick</li><li>Be prepared to encounter numerous types of sanitation devices and culture towards sanitation abroad</li><li>Research a country's regulations regarding entry of HIV-positive persons</li><li>Battle jet lag</li><li>Be aware of risks and hazards travelers might encounter caused by nature and the rapid spread of communicable diseases</li><li>Ask questions of overseas medical insurance providers before purchasing a policy</li></ol><p><em>A final important point:</em></p><ul><li>This course can be taken by anyone, but it was made by a U.S. citizen and from the perspective of a U.S. citizen. The course material is general, but some content is for U.S. citizens only, and the travel checklist does have some U.S. citizen-specific items in it.</li></ul><p>Click the \"take this course\" button, top right, <em>now </em>... and learn how to become a savvy world traveler who can prevent and handle health issues abroad today!<em></em></p><p><strong>Bailey Richert</strong>, Author, Entrepreneur and World Traveler / Founder, Don't Die Abroad</p>", 
    "end_date": null, 
    "title": "Health Topics & Concerns for International Travelers", 
    "price": "20.00", 
    "instructors": "Bailey Richert", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339744_365a_5.jpg", 
    "course_url": "https://www.udemy.com/health-topics-concerns-for-international-travelers/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T09:27:22Z"
}