{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Take 'Er Easy There, Pilgrim! Welcome to Real Fast Campostela!</strong></p>  <p>Are you afraid of the long and dangerous walk through the <strong>Pyrenees</strong> that killed <strong>Martin Sheen’s</strong> character’s son played by <strong>Emilio Esteves</strong> in the hit movie “<em>The Way</em>.”  The <strong>French Way</strong> in the movie is 478 miles! </p>  <p>The <strong>Portuguese</strong> <strong>Way</strong> up from Lisbon is shorter but still a knee rattling 373-mile slog. And the <strong>terrain</strong> is just as mountainous as that of the French trail — treacherous.  </p>  <p>I don’t know about you, but I don’t want to fall off of a cliff and die on the way to <strong>Catholic Mass</strong>.  Have been <strong>asking</strong> yourself, “<em>is there a better way?</em>” <strong>Here</strong> it is …</p>  <p><strong>The English Way</strong></p>  <p>Here is the <strong>least known</strong>, shortest way to fulfill the 100 km walking requirement to complete the <strong>Campostela</strong> in one fifth to one quarter the time, hassle, and pain. Interested?  </p>  <p><strong>Read On!</strong></p>  <p>Who Is <strong>Dr. Scott Brown</strong>?</p>  <p>I am not just an <strong>associate professor of finance</strong> at the AACSB Accredited Graduate School of Business of the <strong>University of Puerto Rico</strong>.  I am also a scholar on the language, history, and culture of both <strong>Galicia</strong> and <strong>Portugal</strong>. </p>  <p>I speak fluent <strong>Spanish</strong> and <strong>Portuguese</strong>.  And I married into a <strong>devote Catholic family</strong> that acts as a sounding board for this course.  </p>  <p>The <strong>benefits</strong> of this course are multifold.  The most important is that you will have a <strong>discussion board</strong> to ask Dr. Brown and other students questions as you plan your walk through the oaken hills and dells of historic Galicia known as Gaul by the Romans — or just the end of the world. </p><p><strong>The Buzz</strong></p>  <p>Here is what other <strong>hikers</strong> are saying in the popular press…</p>  <p>“<strong>I met walkers who had been given a year to live</strong>” writes <strong>Tim Moore</strong> of <strong>The Guardian Newspaper </strong>in<strong> London, England</strong>. And in that same publication <strong>Andrew McCarthy</strong> reports that “<em>I grew physically stronger each day, and by the time I strode into Santiago in late July I felt the way I always wanted to feel yet somehow never quite did</em>.”</p>  <p><strong>Enroll now!</strong> </p>  <p>The <strong>Holy Door</strong> is open this year of 2016. This has only occurred in <strong>4 years</strong> since 1985; 1993, 1999, 2004, and 2010.  This year of 2016 the Pope has opened the door for <strong>Jubilee Indulgences</strong>!</p>  <p>This course is backed with a 30 day no questions asked <strong>guarantee</strong> fulfilled by Udemy as 3<sup>rd</sup> party.  </p>  <p>Enroll right now! I am waiting inside to guide you up the English Way to the Holy Door and Pilgrim Mass with Campostela in hand.</p>  <p>Sincerely, </p>  <p><strong>Dr. Scott Brown</strong></p>  <p><strong>P.S.</strong> WARNING: Don’t hesitate. The Holy door is open.  <strong></strong></p>  <p><strong>P.P.S. </strong>See that blue button up there to the right to enroll.  Click it now!<br> <br></p>", 
    "end_date": null, 
    "title": "Hiking the Northern Ways to Santiago de Campostela Basilica!", 
    "price": 0, 
    "instructors": "Dr. Scott Brown, Daniel Hall", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709620_c0e2.jpg", 
    "course_url": "https://www.udemy.com/hiking-the-northern-ways-to-santiago-de-campostela-basilica/", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T13:19:16Z"
}