{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">House sitting is a now a popular alternative to a regular vacation. It&#039;s also a great option for longer term travel accommodation. </p><p style=\"\">Simply put, house sitting involves looking after someone&#039;s home and pets while they&#039;re away. In return you&#039;ll get to <strong style=\"\">live rent free</strong> in a comfortable home in a worldwide location of your choice! <strong style=\"\"></strong></p><p style=\"\"><em style=\"\">No rent, no utility bills and no property tax or insurance.</em><strong style=\"\"></strong></p><p style=\"\">This course provides all the information necessary to make house sitting a reality – even with no previous experience.</p><p style=\"\"><strong style=\"\">Our step-by-step process gives you the head start you&#039;ll need to secure the house sit of your dreams</strong></p> <ul style=\"\"><li>Learn to save money, house sitting anywhere in the world</li><li>Take practical steps to register with the most successful house sitting websites</li><li>Discover how to build credibility</li><li>Prepare a profile that sets you apart from other applicants</li><li>Create a professional and relevant set of interview questions</li><li>Make a great impression right from the start</li></ul> <p style=\"\">Imagine traveling the world, visiting new and exciting places and staying as long as you want. You can live like a local, experiencing the region&#039;s culture whilst providing an invaluable service to home owners.</p><p style=\"\">It&#039;s not quite as simple as an introduction to the pets and a quick handover of keys. There are many things to consider and this course covers everything you&#039;ll need to know, from website registration through to managing your ideal house sit. </p><p style=\"\"><strong style=\"\">Contents and overview</strong></p><p style=\"\">You&#039;ll progress organically, step-by-step through this interactive course of 50+ lectures. </p><p style=\"\">First we&#039;ll figure out exactly what type of house sit suits you most. We&#039;ll get started together by registering online with some of the most successful house sitting websites. We&#039;ll build your credibility and produce a compelling profile to attract the best assignments.</p><p style=\"\">We&#039;ll look at all the practical issues including how to create a set of relevant, personalized questions for an interview.</p><p style=\"\">You&#039;ll learn how to handle your house sit from handover to completion, develop your skills and guarantee a great reference at the end of your assignment. All the tools and resources are provided for you to become a successful house sitter.</p><p style=\"\"><strong style=\"\">By the end of this course you&#039;ll know how to present yourself as a professional house sitter so that home owners are reassured of your ability to look after their home and pets.</strong></p><p style=\"\">You won&#039;t find a better option to live an exciting life full of travel and adventure. House sitting gives you the freedom and choice to live anywhere in the world, virtually rent free.</p>", 
    "end_date": null, 
    "title": "House Sitting - how to get free world travel accommodation", 
    "price": "20.00", 
    "instructors": "Ian Usher, Vanessa Anderson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476870_8b1b_2.jpg", 
    "course_url": "https://www.udemy.com/house-sitting/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T08:24:28Z"
}