{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \tTravelling with someone else can be really challenging. Whether it’s a couple of weeks of vacation, or travelling the world, your relationship is put under a microscope &amp; every challenge is amplified.  </p>  <p>  \t So I was asked by friends who are professional travellers to create a course to help people overcome the challenges of travelling together, and the result has been this video guide How To Travel The World Without Ruining Your Relationship, an online course for people travelling with people who are close to them be they intimate partners, friends or family, or even singles who are travelling the world and want to join up with others along the way.  </p>  <p>  \tThe guide includes:  </p>  <ul>  \t<li>Your Travelling Together Checklist: The 10 items you need to ‘pack’ before leaving.</li>  \t<li>Your Relationship Travel Guide: The top 10 tips to create &amp; maintain more connection and less conflict on your travels</li>  \t<li>Your Travelling Together Survival Tool: The tool that can save your relationship if you hit rough waters</li>  \t<li>The Travelling Together Tapes: Interviews with Seasoned Travellers sharing their advice, guidance and tips for travelling together.</li>  \t<li>The Travelling Together Workbook: For you to document your journey through the course and make notes that will help you transform your travelling together experience.</li>  </ul>  <p>  \tIn just over 6 and a half hours, you will have everything you need to prepare for your trip to avoid the common mistakes and challenges that travellers make, you&#039;ll have the ten top tips to create more connection and avoid arguments when you&#039;re travelling, you&#039;ll be equipped with the best survival tool to save your relationship if it hits rough waters and you&#039;ll have nearly 3 hours of interviews with seasoned travellers sharing advice, tips and guidance to make the most out of the experience of travelling together.  </p>", 
    "end_date": null, 
    "title": "How To Travel Together Without Ruining Your Relationship", 
    "price": "20.00", 
    "instructors": "Claire Brummell", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244348_99bd_2.jpg", 
    "course_url": "https://www.udemy.com/travelling-together/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T18:40:04Z"
}