{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Going to Paris shouldn&#039;t be difficult, expensive or time-consuming.</p><p>It should be fast, easy and affordable and now it can be with our incredible Udemy course.</p><p>The #1 easiest way to travel to Paris without spending a fortune.</p><p>We teach you all the latest tips and tricks on how to save time, money and unnecessary frustration on your trip to Paris.</p><p>Did you know that it takes an average of 40 hours to plan a trip to Paris?</p><p>That&#039;s valuable time you could be spending with your family or visiting your next destination. </p><p>That&#039;s where we come in!</p><p>We help you find all the hottest tourist spots,</p><p>Top restaurants,</p><p>And exclusive entertainment you simply can&#039;t find online.</p><p>But that&#039;s not all.</p><p>This course was designed by local residents in Paris.</p><p>So we&#039;ll help you find the best local food, local shopping, and cool places to go. </p><p>No more guessing or wasting hours researching online. </p><p>We show you how to find a 3 course meal for a fraction of the price.</p><p>Book a trip to Disneyland and save 25 euros on each ticket,</p><p>and we&#039;ll even show you how you can visit the Grand Opera for only 5 euros.</p><p>It doesn&#039;t get much better than that!</p><p>Learn all the tips to avoid long lines, </p><p>Endless queues and ridiculous crowds. </p><p>And here&#039;s the best part, </p><p>We help you find everything you need at the most affordable rates period. </p><p>We will help you create an unforgettable experience without spending a fortune. </p><p>Enroll today and make your trip to Paris more than you ever dreamed of!</p>", 
    "end_date": null, 
    "title": "How to spend an unforgettable time in Paris 2 times cheaper?", 
    "price": "20.00", 
    "instructors": "Yulia Miss Tourist", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359674_a125_2.jpg", 
    "course_url": "https://www.udemy.com/paris-travel-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T10:31:52Z"
}