{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">LATEST: Course Updated March 2015</em>  </p>  <p style=\"\">  \t<em style=\"\">————————————————————————————————————————</em>  </p>  <p style=\"\">  \t<em style=\"\">OVER 270 DELIGHTED TRAVELERS HAVE TAKEN THIS COURSE</em>  </p>  <p style=\"\">  \t<em style=\"\">———————————————————————————————————————</em>  </p>  <p style=\"\">  \t                 IMPORTANT 1:  </p>  <p style=\"\">  \t<em style=\"\">**This course is for people who own American iPhones with American cell phone service providers.**</em>  </p>  <p style=\"\">  \t               ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>  <p style=\"\">  \t                 Have you heard some of the horror stories of people thinking they signed up for a $25 international cell phone plan and returned home from their trip to a $500 cell phone bill? It&#039;s easy to do and they probably had no idea that they were using their cell phone that much in a foreign country.  </p>  <p style=\"\">  \t<em style=\"\">“Sometime during the 12-day Mediterranean cruise she took in May, MF made a crucial mistake: She turned her cell phone on…her phone synced to the cruise ship&#039;s cell tower and instantly started racking up data roaming charges…She came home to a <strong style=\"\">$1,558 bill</strong>!&quot;</em> - <strong style=\"\">Business Insider</strong>  </p>  <p style=\"\">  \t<em style=\"\">“I just paid the equivalent to a flight to Paris and back just because I wanted to use Google Maps on the iPhone 3G to find my way around gay Paree.&quot;</em> - <strong style=\"\">TechCrunch</strong>  </p>  <p style=\"\">  \t<em style=\"\">“Two weeks of travel with sporadic AT&amp;T EDGE network usage off and on mixed with wifi when available... <strong style=\"\">$3000</strong>.&quot;</em> - <strong style=\"\">BoingBoing</strong>  </p>  <p style=\"\">  \t<em style=\"\">“I am typing this from the floor right now. I am in complete shock. I finally got my first online bill from AT&amp;T yesterday and it came to <strong style=\"\">$5,086.66</strong>!!…Well as you may have guessed by now these are all charges for using the edge network while roaming internationally (in England).&quot;</em> - <strong style=\"\">ArcDesignConsulting</strong>  </p>  <p style=\"\">  \t<em style=\"\">“I used my iPhone 4 data roaming turned on once during my stay in Holland, to check email. Then I turned off data roaming and did not use it again. When I returned home I had a <strong style=\"\">$393.00</strong> dollar charge.&quot;</em>  - <strong style=\"\">T. Cole</strong>  </p>  <p style=\"\">  \t                 The FCC website calls it “bill shock&quot; and warns:  </p>  <p style=\"\">  \t<strong style=\"\">Roaming is complicated! Take time to understand all the rules and rates before you travel. Advance preparation can prevent disappointments such as lack of service or unexpectedly high charges on your next bill.</strong>  </p>  <p style=\"\">  \t               ----------------------------------------------------------------------------------------------------------------  </p>  <p style=\"\">  \t                 You CAN use your iPhone for free (or nearly free) in Europe if you are willing to use it in your hotel or a restaurant with free Wi-Fi and you have prepared your phone and followed this course for the correct settings and apps!  </p>  <p style=\"\">  \t                 I know, I&#039;ve done it many times and developed this course to show you how you can do it too!  </p>  <p style=\"\">  \t                 Learn exactly how to text, email, listen to voicemail, make phone calls, use GPS maps and surf the Internet while in Europe.  </p>  <p style=\"\">  \t                 About this course:  </p>  <ul style=\"\">  \t<li><em style=\"\">Over 250 very happy students</em></li>  \t<li><em style=\"\">It&#039;s designed for everyone, regardless of their technical capabilities, who want to stay connected and use their iPhone in Europe without paying huge international cell phone fees</em></li>  \t<li><em style=\"\">Full, free lifetime access</em></li>  \t<li><em style=\"\">All future extra lectures and upgrades are always included for free</em></li>  \t<li><em style=\"\">Unconditional Udemy 30 day money-back guarantee - that&#039;s my personal promise of your success!</em></li>  \t<li><em style=\"\">Downloadable to your iPhone/iPad for quick reference while you&#039;re traveling.</em></li>  \t<li><em style=\"\">A free bonus - a copy of my ebook &quot;How to Use Your iPhone for Free (or nearly Free in Europe&quot;</em></li>  </ul>  <p style=\"\">  \t<strong style=\"\">Learn How to Use Your iPhone in Europe Without Roaming and an International Calling Plan</strong>  </p>  <p style=\"\">  \t           You&#039;ll learn:  </p>  <ul style=\"\">  \t<li>How to find and plan for using free Wi-Fi in Europe</li>  \t<li>How to set up your iPhone for free access to voicemail</li>  \t<li>How to set up your iPhone for free text messaging</li>  \t<li>How to set up your iPhone for free calling</li>  \t<li> The differences in Skype vs. FaceTime and when to use one over the other.</li>  \t<li>How to download maps of your destinations to use later when you are sightseeing</li>  \t<li>Exactly which settings must be changed on your iPhone before you leave the States</li>  \t<li>How to use your iPhone while in Europe</li>  \t<li>How to return your iPhone to it&#039;s pre-trip settings when your trip is over.</li>  </ul>  <p style=\"\">  \t                 By the end of the course, you&#039;ll have the confidence and peace of mind to set up and use your iPhone in Europe, staying connected back to your friends, family and associates, with no extra international cell phone fees.  </p>  <p style=\"\">  \t                 As a bonus, all students will receive my ebook &quot;How to Use Your iPhone for Free (or nearly Free in Europe&quot; which they can download into their iPhones.  </p>", 
    "end_date": null, 
    "title": "How to Use a US iPhone for Free (or nearly) Free in Europe", 
    "price": "20.00", 
    "instructors": "Lynn Huffman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296526_68c9_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-your-iphone-for-free-or-nearly-free-in-europe/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T18:40:50Z"
}