{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \tIf you’re taking this course, it’s probably because you’re planning a trip to Walt Disney World.  Congratulations!  They call it the most magical place on earth, and who can argue with that??  </p>  <p>  \tBut this land of pixie dust and adventure is also one of the biggest entertainment complexes on the planet.  Covering 43 square miles and including four theme parks, two water parks, a shopping, dining, and entertainment complex, over 20 resorts, hundreds of restaurants, and a slew of other means of entertainment…planning a trip here can be kind of overwhelming.  </p>  <p>  \tOne of my friends told me that planning her family’s upcoming Disney vacation was a part time job! And that really struck me.  I figured, you know, most first time visitors are probably in the same boat.  Overwhelmed with decisions about when to go, where to stay, how to avoid standing in the blazing Florida sun for two hours waiting to ride Splash Mountain…this is where I can help.  </p>  <p>  \tThis course, or series of planning sessions, will feature a combination of informational videos, editorials, resource downloads and links, as well specifically tailored planning tips and sample itineraries.  </p>  <p>  \tI won’t go into pain staking details here about each attraction, resort, and restaurant, but I will tell you what you need to know to take the guesswork out of planning so that you’ll be able to create an amazing trip with memories that will last a lifetime.  But don’t worry…if you’re the type that craves details and extra information, I will give you plenty of resources along the way for the best places to find plenty of photos, ride videos, guest reviews, and the like.  </p>  <p>  \tMousin’ Around’s online planning sessions let you in on all of the secrets you need to know before you go so that once you arrive you can just Take the Mouse by the Ears and Have a Ball!  </p>  <p>  \tAnd as an added bonus for those of you taking this course through Udemy, I&#039;ll be available to answer any trip planning related questions that you may have each week! Always feel free to shoot me an email and I&#039;ll get back to you right away.  </p>", 
    "end_date": null, 
    "title": "How to Plan a Walt Disney World Vacation", 
    "price": "20.00", 
    "instructors": "Cate Lincoln", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329868_fc08.jpg", 
    "course_url": "https://www.udemy.com/how-to-plan-a-walt-disney-world-vacation/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T21:42:53Z"
}