{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t      Walking the Camino de Santiago is actually quite simple…you walk, eat, and sleep, and continue this cycle until you reach Santiago de Compestela.  However, an almost endless amount of decisions about gear, training, travel, and daily life on the Camino can be overwhelming.  </p>  <p style=\"\">  \t      But you don’t need to be overwhelmed…it’s possible to prepare for and walk your Camino with confidence!  </p>  <p style=\"\">  \t<strong style=\"\">Learn How to Add Confidence to Your Camino Experience</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Overcome your fears about walking the Camino</li>  \t<li style=\"\">Gain control over your planning process</li>  \t<li style=\"\">Create a gear list that works for YOU</li>  \t<li style=\"\">Train in the most effective way</li>  \t<li style=\"\">Learn about the different kinds of pilgrims on the Camino</li>  \t<li style=\"\">Apply the lessons learned on the Camino to your life</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Take Control of Your Own Unique Camino</strong>  </p>  <p style=\"\">  \t      You’ve decided to walk the Camino de Santiago, but your initial excitement has now been replaced by fear and anxiety.  You may wonder how you should train, what you should take with you, and what life on the Camino will be like.  And instead of giving you clarity and calmness, the “advice” you’ve been reading only makes you more confused and concerned.  </p>  <p style=\"\">  \t      Believe me, I know how you feel...I felt the same way when I prepared for my Camino!  But then I found that preparing for and walking the Camino doesn’t have to be that hard.  </p>  <p style=\"\">  \t      Let’s sit down face to face, you and me, and talk some sanity into your Camino preparations.  You’ll learn how to effectively plan, train, and walk your Camino while casting out fear and confusion.  </p>", 
    "end_date": null, 
    "title": "How To Walk The Camino de Santiago", 
    "price": "30.00", 
    "instructors": "Jack Pitney", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367360_77c4.jpg", 
    "course_url": "https://www.udemy.com/how-to-walk-the-camino-de-santiago/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T14:52:10Z"
}