{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>In this course you'll learn the <strong>exact, step-by-step</strong> <strong>framework</strong> I used to <strong>travel to around 100 different countries - all while I had normal jobs, working for normal companies.</strong></p><p>It’s a whole new world. In 2016, you can constantly travel to places such as the Maldives, Japan or Brazil and do so still working 9-5.</p><p>You can travel 60-90 days a year, every year, without quitting your job and without putting your career at risk. </p><p>You don’t need to need to be rich. You don’t need to be a blogger. You don’t even need to be a digital nomad.</p><p>Combining timeless principles and new technologies,<strong> </strong><strong>you too can travel 60-90 days a year, without quitting your office job.</strong></p><p>Join me for this course, and you’ll learn a straight-forward system on:</p><p>\n\n<strong>- How to Travel More and Travel Longer.</strong> Backpack Europe, safari across Africa or visit Machu Picchu.<br><strong>- How to Travel Cheaper.</strong> Travel for under $50 a day, without compromising on the experience.<br><strong>- How to Travel With Zero Career Risk.</strong> You won’t need to quit your job.</p><p>I repeat: you won’t need to quit your job. </p><p>Don’t mind the nay-sayers. Just five years ago, I had nothing going for me - I was broke, unemployed and stuck in far-away Argentina. I mentioned I wanted to travel to 100 countries and everyone laughed.</p><p>But nobody is laughing now. I’ve made it to 97 countries so far and worked for major international companies such as Carlsberg (beer) and Maersk (shipping) for most of the time. </p><p>I’ve found the holy grail of more travel and more successful career. In this course I want to share it with you.</p><p>So... Are you ready? I look forward to see you inside!</p>", 
    "end_date": null, 
    "title": "How to Travel 60-90 Days a Year - Even If You Work 9-5", 
    "price": "20.00", 
    "instructors": "Mario Scian", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700172_dd14_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-travel-60-90-days-a-year-even-if-you-work-full-time/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T18:40:30Z"
}