{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Hypnosis - holiday to amazing destinations Guided Hypnosis</strong><br></p>\n\n<p>Hypnosis will help you to travel to any worldwide holiday destination and only have the people who make you feel happy there with you.</p>\n\n\n\n<p>Now you can with this course where I am going to teach you how you can experience the most amazing holidays everyday of your life if you wish.</p>\n\n\n\n\n\n<p> But not only that you will also have the ability to feel all those holiday good feelings that come with leaving all your cares and worries behind and getting to see life with a whole new perspective.</p>\n\n\n\n\n\n<p>All experiences are sensory experiences that are stored in your memory bank so you can access those good feelings when you think about that experience. With this hypnotic journey you will be creating many new amazing experiences just as though you have actually been on amazing journeys to amazing destinations creating amazing holiday memories that will be relaxing, inspiring and motivational.</p>\n\n\n\n\n\n<p>I will also be teaching you in the bonus section of this course how to use EFT a amazingly easy to learn tapping technique that will change your life by allowing you to overcome overcome stress in your life, but not only that you can also use this technique to eliminate limiting emotions and beliefs that hold you back from having the life you deserve.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Hypnosis - holiday to amazing destinations Guided Hypnosis<br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bonus Section Includes</strong></p>\n\n\n\n\n\n<p>1. Emotional First Aid On Tap Pdf<br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Mp3 Downloads</strong></p>\n\n\n\n\n\n<p>2. EFT Instructions</p>\n\n\n\n\n\n<p>3. EFT Breathing Exercise</p>\n\n\n\n\n\n<p>4. Reduce stress with EFT</p>\n\n\n\n\n\n<p>5. EFT Mopping Up Section</p>\n\n\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">All Files and videos are downloadable for easier access</strong></em></p>", 
    "end_date": null, 
    "title": "Hypnosis - holiday to amazing destinations Guided Hypnosis", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651560_ecb3_2.jpg", 
    "course_url": "https://www.udemy.com/hypnotic-holiday/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T18:57:45Z"
}