{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Este curso/guia ajudará todas as pessoas, de todas as idades e classes sociais que pensam em fazer um intercâmbio mas não consegue decidir se devem ou não, a fazer a melhor escolha de se devem ir, quando ir, qual tipo de intercâmbio deveriam fazer, como planejar, que gastos terão, etc.</p><p>Meu nome é Driéli, sou turismóloga, poliglota, tenho experiência com 3 intercâmbios e com trabalho em navios cruzeiros, além de já ter trabalhado com agência de viagens e intercâmbios.</p><p>Nestas videoaulas eu tenho como objetivo, fornecer as melhores informações de acordo com minhas experiências de viagens, estudos e trabalho para que os alunos possam esclarecer suas principais dúvidas e então formular seu intercâmbio com precisão.</p><p>Além disto, dou dicas do que não é legal fazer em um intercâmbio, bem como, informações úteis para que se possa aproveitar a viagem ao máximo e fazer com que ela possa trazer bons frutos no futuro, além é claro, de boas lembranças.</p><p>Abaixo é possível ter acesso ao conteúdo que é abordado no curso:</p><p>SESSÃO 1: INTRODUÇÃO</p><p>Aula 1: Introdução</p><p>Aula 2: O que é um intercâmbio?</p><p>SESSÃO 2: COMO E O QUE ESCOLHER</p><p>Aula 3: Quais são os prós e contras de um intercâmbio?</p><p>Aula 4: Devo fazer um intercâmbio</p><p>Aula 5: Como escolher o intercâmbio adequeado?</p><p>Aula 6: Tipos de intercâmbios</p><p>SESSÃO 3: PLANEJAMENTO</p><p>Aula 7: Quanto vou gastar e como posso economizar?</p><p>Aula 8: Adquirir e planejar através de uma agência ou por conta?</p><p>Aula 9: Como organizar as idéias e a parte burocrática?</p><p>SESSÃO 4: COMO SE PREPARAR E APROVEITAR UM INTERCÂMBIO</p><p>Aula 10: Como me preparar psicologicamente e fisicamente para um intercâmbio?</p><p>Aula 11: Como me dar bem em um intercâmbio e aproveitá-lo ao máximo?</p><p>Aula 12: O que não devo fazer em um intercâmbio?</p><p>SESSÃO 5: INFLUÊNCIAS E CONSEQUÊNCIAS DE UM INTERCÂMBIO</p><p>Aula 13: O que um intercâmbio irá acrescentar e mudar na minha vida?</p><p>Aula 14: Retorno: O que fazer agora?</p><p>SESSÃO 6: CONCLUSÃO:</p><p>Aula 15: Conclusão e agradecimentos</p><p>Após assistir a todas estas vídeo aulas tenho a certeza de que todos poderão planejar seu intercâmbio e fazer as melhores escolhas de acordo com o seu bolso, a sua personalidade, necessidade e desejos.</p><p>Não perca tempo, faça seu futuro agora!</p>", 
    "end_date": null, 
    "title": "INTERCÂMBIO: Como planejar o teu!", 
    "price": "20.00", 
    "instructors": "Driéli Mayresse Sonaglio", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557482_5c9c_3.jpg", 
    "course_url": "https://www.udemy.com/comoplanejarintercambio/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T20:27:17Z"
}