{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>LATEST: Course Fully Updated For November 2015</em></p><p>You've made the decision that this year you will finally commit to cashing in those unused vacation days and book that adventure abroad! <strong>Great</strong><strong>! </strong>Now, where are you going to go? How will you get there? Where will you stay? What will you do when you get there? These are all necessary questions for potential international travelers to ask when at the very beginning stages of planning a new trip, known as crafting an itinerary. But is that really all there is to it? Just book a flight and go?</p><p>What about documents governments might want to see when you land?  What do you need to pack? How will you communicate with friends and family back in the United States if you need to? These are all questions that also must be addressed.</p><p><em>No prior travel knowledge is required!</em></p><p>+++++++++++++++++++++++</p><p>What You Get:</p><ul><li><em>A comprehensive PDF international travel packing list. </em></li><li><em>A Microsoft Excel international clothing sizes conversion chart.</em></li><li><em>A \"last minute\" checklist detailing final things to do to prep your home before departure.</em></li><li><em>A comprehensive travel checklist which details everything you need to do before you depart for your international trip.</em></li><li><em>24/7 lifetime access to course content and materials.</em></li><li><em>All future extra lectures and upgrades are always included for free.</em></li><li><em>Unconditional Udemy 30 day money-back guarantee.</em></li></ul><p>What You'll Learn:</p><ol><li>Why logistical preparation is the key to a successful overseas trip</li><li>Four resources for creating a list of possible destinations</li><li>Eight considerations that can help you narrow down a list of destination choices to pick the one place you want to visit! </li><li>How to evaluate the security of a destination using the U.S. State Department travel website</li><li>The differences between travel alerts and travel warnings</li><li>Resources for identifying the best time to book international flights</li><li>Seven different kinds of lodging you can book while overseas</li><li>Tips for being a good hostel guest</li><li>The three most important factors in crafting a great trip itinerary</li><li>Online resources for finding advice on what to do/see in your trip destination</li><li>Everything you need to know about U.S. passport books and cards</li><li> All about visas: what they are, how to get one, what types exist</li><li>Options available to travelers to make calls back home from abroad</li><li>Tips for combating overpacking</li><li>What to pack for an international trip, including a comprehensive packing list and an explanation of why some items are crucial and not meant to be forgotten!</li><li>An overview of U.S. TSA packing rules</li><li>Services travelers can utilize to manage physical mail while abroad</li><li>Last minute to-do items that must be completed by travelers before an international trip, including learning their own international clothing sizes (conversion chart included!)</li></ol><p><em>Two final very important points:</em></p><ul><li>This course is for beginning, new travelers who want to understand the basics of travel planning and preparation! If you are an experienced traveler, you may glean some new tips and information from this course, but it is not geared towards that audience!</li><li>This course can be taken by anyone, <strong>but </strong>it was made by a U.S. citizen and from the perspective of a U.S. citizen. The course material is general, but U.S. examples are used (i.e. referencing U.S. Dollars), <strong>some content is for U.S. citizens only</strong>, and the travel checklist does have some U.S. citizen-specific items in it.</li></ul><p>Click the \"take this course\" button, top right, <strong><em>now </em></strong>... and learn how to become a savvy world traveler today!<em></em></p><p><strong>Bailey Richert</strong>, Author, Entrepreneur and World Traveler / Founder, Don't Die Abroad</p>", 
    "end_date": null, 
    "title": "Introduction to International Trip Planning and Preparation", 
    "price": "20.00", 
    "instructors": "Bailey Richert", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438272_5307_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-international-trip-planning-and-preparation/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T04:12:02Z"
}