{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>LATEST: Course Fully Updated For November 2015</em></p><p>When entering the borders of a foreign country (and upon re-entering your home country's borders), the government will want to take account of you and your belongings through a two-step process. First, \"immigration\" requires you to present identification and answer questions to verify that you are who you claim. Second, \"customs\" requires you to present a full account of your physical possessions to determine their legality and taxes you may owe on them.</p><p>This course will walk you through the topics of <strong>customs and immigration</strong> from the perspective of a United States citizen traveling abroad and subsequently returning home. First, the general customs and immigration procedures a traveler might encounter abroad are described (such as landing cards and passport control). Then, the specific customs and immigration procedures of the United States are provided in much greater detail (such as personal exemptions, prohibited items and U.S. Customs and Border Patrol Trusted Traveler Programs). </p><p><em>No prior travel knowledge is required!</em></p><p>+++++++++++++++++++++++</p><p>What You Get:</p><ul><li><em>A comprehensive travel checklist which details everything you need to do before you depart for your international trip.</em></li><li><em>24/7 lifetime access to course content and materials.</em></li><li><em></em><em>All future extra lectures and upgrades are always included for free.</em></li><li><em></em><em>Unconditional Udemy 30 day money-back guarantee.</em></li></ul><p>What You'll Learn:</p><ol><li>What landing and departure cards you will be given overseas are, what they look like and how to fill them out</li><li>Questions you may be asked during an immigration interview upon arrival in a foreign country</li><li>What a customs allowance is, and how to determine your customs allowance before visiting a foreign country</li><li>What a U.S. landing and customs card looks like and how to fill one out</li><li>How to pass through U.S. immigration and customs checkpoints</li><li>How U.S. CBP Trusted Traveler Programs can expedite the customs and immigration proceedings</li><li>Which items are prohibited or restricted from being imported to the U.S. upon your return from abroad</li><li>Which items (both tangible and intangible) are dutiable upon your return from abroad to the U.S.</li><li>When you can apply a duty-free exemption in the U.S.</li><li>What duty-free exemption (what dollar amount) you are allowed based on your trip details</li><li>How to legally pay less in customs duty in the U.S. by employing strategies and rules knowledgeably</li><li>What limits to alcohol and tobacco are applied your duty-free exemption</li></ol><p><em>Two final very important points</em><em>:</em></p><ul><li>This course is for beginning, new travelers who want to understand the basics of customs and immigration! If you are an experienced traveler, you may glean some new tips and information from this course, but it is not geared towards that audience!</li><li>This course can be taken by anyone, <strong>but </strong>it was made by a U.S. citizen and from the perspective of a U.S. citizen. A significant portion of content is for U.S. citizens only.</li></ul><p>Click the \"take this course\" button, top right, <strong><em>now </em></strong>... and learn how to become a savvy world traveler today!</p><p><strong>Bailey Richert</strong>, Author, Entrepreneur and World Traveler / Founder, Don't Die Abroad</p>", 
    "end_date": null, 
    "title": "Introduction to Customs and Immigration for U.S. Travelers", 
    "price": "20.00", 
    "instructors": "Bailey Richert", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438286_ed5f.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-customs-and-immigration-for-us-travelers/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T04:21:43Z"
}