{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t        Welcome to “<strong style=\"\">How to Vacation in Costa Rica</strong>” presented by Nicole Ivory,                   Global Destination Course Instructor for iTravel EDU.  </p>  <p style=\"\">  \t <strong style=\"\">Reason to Take this Course </strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>Have you ever wanted to travel to a foreign and exotic destination? Do you have a passion for travelling and exploring new cultures? The beautiful and welcoming country of Costa Rica is the perfect destination for you. Its array of natural reserves, protected rainforest, gorgeous beaches and friendly Tico’s are sure to keep you busy during your stay.  </p>  <p style=\"\">  \t <strong style=\"\">What You Will Learn </strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>In this course, you will be guided through all Seven Provinces of Costa Rica and be informed on how to maximize your stay while there. Whether there for business or for pleasure; travelling solo, as a couple, or in a group; we have expert advice on what to do no matter the length of your trip.  </p>  <p style=\"\">  \t <strong style=\"\">Course Structure </strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>The design of this course provides you with an overview of each travel topic followed by an in depth coverage of subtopics including accommodation choices, dining options, transportation options and more!  </p>  <p style=\"\">  \t        Our <strong style=\"\">See-Print-Go </strong>or (SPG) feature allows you to <em style=\"\"><strong style=\"\">See </strong></em>the video lectures, <strong style=\"\"><em style=\"\">Print</em></strong> the various travel presentations, travel phrases and safety tips; and then finally <strong style=\"\"><em style=\"\">Go</em></strong> on your next   Costa Rican vacation with confidence.  </p>  <p style=\"\">  \t        The Costa Rican Ticos and I are looking forward to meeting you so that you can learn how to experience the Pura Vida way of life.  </p>", 
    "end_date": null, 
    "title": "iTravel EDU: How to Vacation in Costa Rica", 
    "price": "20.00", 
    "instructors": "Nicole Ivory", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151090_bc6d_4.jpg", 
    "course_url": "https://www.udemy.com/itravel-edu-how-to-vacation-in-costa-rica/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T01:29:06Z"
}