{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t    Hi everyone, welcome to the Ultimate Car Guide! I'm Michael Feinstein, a self-proclaimed car nut, and I'll be showing you how to buy or lease your next new or used car the right way. Contrary to popular belief, looking for a car can be a lot of fun, but only if you know what you're looking for and how to make sure you are getting the best bang for your buck. There is a lot of material in this course, but I have designed it to be easily accessible, whether you want the entire rundown or just want to see the best configuration for a given car. The structure of this course is as follows:  </p>  <p>  \t<strong>  1. Figure out what you need your new vehicle to do for you.</strong> Be patient, follow this guide, and you will get what you want.  </p>  <p>  \t<strong>  2. Choose the style of vehicle that satisfies your needs and desires.</strong>  </p>  <p>  \t<strong>  3. Decide how you're going to pay for your vehicle. </strong>This one can get a little dicey because the best choice for you depends on several factors. We will go over these in detail.  </p>  <p>  \t<strong>  4a. Decide whether you want to buy new or used. </strong>I'll go over the pricing pros and cons of both.  </p>  <p>  \t<strong>4b. Learn the proper vehicle-buying process.</strong> I'll go over the various resources that will make your automobile hunt much less stressful and more fun.  </p>  <p>  \t<strong>  5. Learn basic car stats. </strong>You might not care about horsepower, torque, all wheel drive, and other technical bits, but they are very important. I'll break them down so they're easy to understand.  </p>  <p>  \t<strong>  6. Knowing your options. </strong>Options can add anywhere from hundreds to thousands to tens of thousands of dollars, depending which type of car and brand you are looking at.</p>", 
    "end_date": null, 
    "title": "Learn to Buy or Lease a Car without Fear! ", 
    "price": "20.00", 
    "instructors": "Michael Feinstein", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259728_671e_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-buy-or-lease-a-car-without-fear/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-11T16:08:42Z"
}