{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>According to Studies if you ask 10 people: \"What is one of the things you want to do before you Die ?\" 7 of those 10 people will say \"Travel the World\".</strong></p><p>Traveling the World is the Dream of a lot of people but unfortunately many people never get to Experience it. I consider myself the \"Crash Test Dummy\" of World Traveling, I know what works and what doesn't. I will show you the most Important things you need to know to take that Trip you have always Dreamed about.</p><p>Through this Udemy Course I want to share everything I have learned regarding Traveling, everything from Travel Motivation, Travel Safety, Budget Traveling, How to choose the best Bank and Travel Insurance, Getting FREE Accommodations, How to Fund your Travels and much more.</p><p>But it is up to you to take the first step, You need to get this Course right now!, Stop putting off Traveling for a later date because I guarantee you that the time you are Traveling the World it will be one of the if not the most exciting time of your Life. </p><p><strong>Start building Memories that will last you a Lifetime, Click the \"Take This Course\" on the Top Right of your Screen to get started....</strong></p><p><strong>See you on the Other side! </strong></p><p>What a Student had to say about this Course:</p><strong>\"Wow. </strong>Traveling has always been an interest of mine but I have always been overwhelmed not knowing how I could afford it. This course has great tips on how to get free stuff and how to be able to afford to travel. overall amazing course! hope to meet you one day Oscar\" <p>- Kevin Niles</p>", 
    "end_date": null, 
    "title": "Learn How To Budget and Travel the World Without Worry", 
    "price": "20.00", 
    "instructors": "Osc Mont", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469740_9637.jpg", 
    "course_url": "https://www.udemy.com/how-i-travel-the-world-without-worrying/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T09:36:24Z"
}