{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong></strong></p><p><strong></strong><strong></strong><strong></strong></p><p><strong></strong></p><p><strong></strong><strong>Do you dream of paradise?</strong></p>  <p>Have you ever wondered what paradise is and how to find it? Is paradise just a state of mind or is it tropical white sand beaches, palm trees, crystal clear water, and a simpler life? </p>  <p>Do you hate your job or parts of your life? Are you living paycheck to paycheck and tired of making ends meet? Are you looking for a simpler, lower cost adventurous life?  If you are, you are not alone. It seems the more money you make the higher costs become and can result is a life of simply getting by. </p><p><strong>Learn How Easy it Can Be to Choose a Low Cost Adventurous Lifestyle</strong></p><p> Many people are leaving the rat race in record numbers, searching for a more meaningful, cheaper, and simpler way to live and many have chosen blue water sailing.</p>  <p>That is exactly what Captain George did 20 years ago when he left his job to be a sailboat crew member. Since then he has logged over 20,000 sea miles across the South Pacific sailing to remote tropical beaches, uninhabited islands, visiting foreign cultures, and more. He started out as a new crew member and now, is a licensed Captain and here to show you how to do it. </p>  <p>Sound appealing? If so, this is perfect for you. We created this course to show you just how easy it is to put the rat race on hold and fulfill your dream of an adventurous, lower cost lifestyle. </p>  <p>I<strong>n this course you will learn:</strong> </p>  <ul><li>How to become a crew member, even with no experience.</li><li>How you can travel to paradise almost for free.</li><li>What a crew members job is.</li><li>An overview of a boats inner workings.</li><li>An introduction to weather and navigation.</li><li>What to pack and take with you.</li><li>How you can communicate with family &amp; friends, even from the middle of the the ocean.</li><li>How to stay safe at sea and on land.</li><li>What you need to visit foreign lands. </li><li>Ways to make money.</li><li>and more.</li></ul>  <p><strong>You might be surprised to know……..</strong></p>  <p>That you can sail and explore tropical paradise for almost nothing? Captain George once enjoyed 3 months sailing in an absolute true PARADISE: along Australia’s Great Barrier Reef, and his total out-of-pocket costs were $300! Yes, $300 for 3 months! </p>  <p>Did you know you can make money while cruising? Captain George once had a job as Captain of a tour boat at a luxury resort in the South Pacific and his salary was $65,000 per year. </p>  <p>There are many ways to make money as a blue water cruiser and we’ll show you how we and other cruisers do it. So if you do not have a lot of money, don’t worry, this course covers many ways to earn some income to further your adventures in paradise. </p>  <p>This course IS NOT so much about how to sail but instead, how to make life changing decisions and create that simpler, lower cost life you seek. This course also provides you information on where you can get your own Captains certifications for higher paying opportunities.</p><p>Are you wondering if you have to give up your current life to do this? No, we cover ways you can leave for the short term or the long term, and have a dream adventure, or the dream life.</p>  <p><strong>What are the course requirements?</strong><br></p><ul><li>Absolutely nothing! </li><li>Oh, except a sense of adventure. </li><li>A desire for life change, or at least a short adventure.</li><li>No experience or knowledge is required. We show you in the course where you can get all the experience you need. </li></ul><p><strong>What will you get from the course?</strong><br></p><ul><li>Unlimited access FOREVER!</li><li>Udemy's 30 DAY MONEY BACK GUARANTEE and that is also our guarantee.</li><li>All future lectures are included in the course.</li><li>Over 25 lectures, hours of content. </li><li>An understanding of life at sea. </li><li>An introduction to boats and features. </li><li>Learn what you need to take with you.</li><li>Learn what you need to enter foreign countries.</li><li>Learn how you can travel.</li><li>Learn how to find paid crew member positions.</li></ul><p><strong>Who is the target audience?</strong><br></p><ul><li>Anyone who understands the idea that ‘You will never know, if you never go!’</li><li>Anyone with a sense of adventure.</li><li>Anyone looking to try something, no matter short term or long term</li><li>Anyone who has spent a lot of time daydreaming, and now wants to take action.</li></ul>    It is also IMPORTANT to understand that to be crew you do NOT need:<ul><li>A sailboat or any boat.</li><li>Lots of experience!</li><li>A lot of money!</li><li>A license or certification of any kind.</li></ul><p>This course provides many of the important details and removes that Fear of the Unknown by showing how safe the oceans are in our modern world and will help you get started on planning a single adventure or a change in lifestyle.</p>     <p><em>So don't wait! Life is too short! Signup and take a test drive and understand if it is not for you can take advantage of that 30 day refund policy. No questions asked. And no feelings hurt!</em></p><p><strong>Remember: You will never know, if you never go!</strong></p>  <p><br></p>", 
    "end_date": null, 
    "title": "Leave the Rat Race, Sail the World, and Fund Your Adventures", 
    "price": "20.00", 
    "instructors": "Charlie Borland, Captain Geo Ouell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684364_9777_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-leave-the-rat-race-sail-the-world-and-make-money/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T22:22:05Z"
}