{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Welcome to  “Master a Super Simple Life: Going Totally Digital/Paperless”   </p>  <p>  where you will master Your whole life right in the palm of your hands while you&#039;re taking the course.  If you are overwhelmed with all the unnecessary &quot;stuff&quot; and paper that todays world keeps drowning you with, then its time to live a life of freedom.  Once you Remove and let go of the bulky, time consuming, mess of your papers, files, bills, receipts, DVDs, cds, and more.  You&#039;ll discover that you can actually make money and save money, time and energy by turning your physical, paper life all to digital.  You&#039;ll have Freedom to travel, discover or even just relax. You will be able to pull up anything you need in seconds from your phone/tablet or computer.  You&#039;ll have Freedom to store and watch your entire dvd collection in something the size of your phone.  A few things you&#039;ll learn in this course are,   How, why and what to let go and get rid of from your life.  How to create digital files and where to store them with ease.    How to simply scan any paper document with your phone in seconds and have it stored safely in the file you choose.  </p>  <p>  \t  Simply Scan receipts so no more drawers full of receipts as soon as you buy something.  </p>  <p>  \t  Easily Earn Cash from apps on your phone <strong style=\"\">Every Day</strong>.  </p>  <p>  \t  You will learn step by step how to easily convert your DVD’s in a few clicks to digital with no technical skills and get rid of those bulky shelves holding all of them.  </p>  <p>  \tYou will learn quickly and easily which apps and software to use and how to use them step by step so you become a master at your Super Simple Life.  You&#039;ll be able to run your life and business from a coffee shop, the beach or anywhere!  </p>", 
    "end_date": null, 
    "title": "Master a Super Simple Life: Going Totally Paperless/Digital ", 
    "price": "20.00", 
    "instructors": "Chris Weeks", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378696_14ae_4.jpg", 
    "course_url": "https://www.udemy.com/master-a-super-simple-life-going-totally-paperlessdigital/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T18:57:33Z"
}