{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">Big update: My property is officially #1 in San Francisco when you search for 3+ guests. Thats #1 out of 5000+ listings</strong></em></p><p style=\"\"><em style=\"\"><strong style=\"\">  \t<strong style=\"\"><em style=\"\">3483 students, 16+ hours of content and 55 5-star reviews. 100% positive reviews. Join in!</em></strong></strong></em></p>  <p style=\"\">  \t                                                                                                                                                                ————————————————————  </p>  <p style=\"\">  \tRecent reviews<em style=\"\">:</em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;</em>Best course I&#039;ve taken on Udemy. Solid course. I&#039;m in the middle of starting a business and this is perfect. I had heard about how companies had funded their initial start through Airbnb and this course is a complete steal. There are so many ways you can use airbnb to upgrade your situation. This course ROCKS<strong style=\"\">&quot;, </strong><em style=\"\">Jeff Tran</em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;</em><strong style=\"\">Fantastic Investment.</strong> I signed up for this course when it first came out a little over a month ago. I was already a host but I was in what Evan called the &quot;beginning blues&quot; where I was getting bookings but not enough and for little money. I took his course and I&#039;m happy to say already in a month, his techniques are making a really big difference. My bookings next month are already up 30% in price and I&#039;m getting close to filling all my weekends I wanted. Next month I&#039;ve already booked $2300, which is really exciting. I&#039;ve gone back to this course so many times already because its been so valuable. Evan&#039;s even helped me out on several occasions. I just wanted to come back and write this review to encourage anyone reading this to take this course. Its already paid for itself many times over<em style=\"\">.&quot; Laura Greer</em>  </p>  <p style=\"\">  \t                                                                            ————————————————————  </p>  <p style=\"\">  \t                                                                                                                                                               In July last year, I made <strong style=\"\">$7,579</strong> while vacationing in Bali. </p><p style=\"\">How did I make that much? I made it by doing nothing. Absolutely nothing. </p><p style=\"\"> All I had to do was rent my apartment out on Airbnb and leave for the month.  </p>  <p style=\"\">  \t                                                                                                                                                               I know it sounds ridiculous but it&#039;s true. I got paid <strong style=\"\">$260 / day</strong> just to simply not be in my apartment.  </p>  <p style=\"\">  \t                                                                                                                                                               <em style=\"\">Have you heard of Airbnb</em>?  </p>  <p style=\"\">  \t      I bet you have. If you don&#039;t use it, chances are someone you know does. Its that hot new startup that lets you rent out your spare room or your whole space for money, and the company is growing like wildfire. Airbnb now has over <strong style=\"\">350,000 hosts</strong>, who are just ordinary people, renting their spaces in <strong style=\"\">192 countries</strong>. Last year alone, they booked 10 million rental nights in homes, apartments, rooms, and spaces <strong style=\"\">just like yours</strong>.  </p>  <p style=\"\">  \tYou know what the best part is? A private room on Airbnb rents for an <strong style=\"\">average $120 / night</strong>. you could make that just by renting out a spare room (or 3x that for your whole space!)  </p>  <p style=\"\">  \t                                                                                                                                                 Last year, I personally made over <strong style=\"\">$60,000</strong> renting out my space on Airbnb. </p><p style=\"\">On average I spent about 4~ hours per week handling guests, maintaining the space, and everything involved. On a typical month I would make $4,000 - $5,000. If I was traveling I would make between $7,000 - $10,000 a month.  </p>  <p style=\"\">  \t(<em style=\"\">Don&#039;t believe me? Theres a preview course in section 1 where I show you all of my income</em>)  </p>  <p style=\"\">  \t                                                                                                                                                 Is this abnormal? <strong style=\"\">Not at all</strong>. I helped several of my friends list their places on Airbnb and they all make at a minimum $2,000 / month. Thousands of hosts on Airbnb make well over <strong style=\"\">$100,000</strong> a year just from their rental income and with only one property.  </p>  <p style=\"\">  \t                                                                                                                                                 When I first started hosting on AirBNB, I thought &quot;what the heck, its worth a shot&quot; and WOW am I glad I did. You see, I just moved to San Francisco and had signed a big one year lease for an apartment that was $3,000 a month. Big liability, right? Not to mention, I&#039;m self employed, and my business ebbs and flows. What if I hit a bad month and can&#039;t make rent? I know everyone reading this has had to worry about that one time or another. Its a terrible feeling but I knew it could be all too real.  </p>  <p style=\"\">  \t                                                                                                                                                 The first month I started Airbnb, I made <strong style=\"\">$4,963</strong>! It blew my expectations away. That covered my rent, utilities, cleanings, and I pocketed an extra $1,500 that month. In one month, I went from worrying about rent and thinking I would have to move out, to getting rent covered and getting paid an extra $1,500 a month just for occasionally renting my extra space.  </p>  <p style=\"\">  \t                                                                                                                                                 Airbnb <strong style=\"\">saved me</strong>, like it saved so many others.  </p>  <p style=\"\">  \t                                                                                                                                                 Just so you know, the spaces on Airbnb are <strong style=\"\">not</strong> hotel quality spaces. They are spare rooms, apartments, homes that everyday ordinary people live and use. They are spare bedrooms, livings rooms, empty condos, spare family homes, and any other dwelling you can think of.  </p>  <p style=\"\">  \t<strong style=\"\">Look around you</strong>. Do you have extra space where you are living? Do you ever leave for the weekend or go home for the holidays?  </p>  <p style=\"\">  \t                                                                                                                                                 If you&#039;re like me, or really anyone else, I&#039;m sure you can think of a time where you have unused space.  </p>  <p style=\"\">  \t                                                                                                                                                 You could be missing out on a significant amount of money. Money that could make a <strong style=\"\">big difference</strong> in your life.  </p>  <p style=\"\">  \t                                                                                                                                                 -------------------------------------------------------  </p>  <p style=\"\">  \tSome things you&#039;ll learn in the course:  </p>  <p style=\"\">  \t                                  - How to <strong style=\"\">step by step </strong>get your spare room or space renting up to $5,000 / month, or your entire space up to $10,000 / month  </p>  <p style=\"\">  \t                                  - Everything you need to know before starting the process so you can hit the ground running  </p>  <p style=\"\">  \t                                  - How to scope out your competition, create a plan, and land on the first page of search  </p>  <p style=\"\">  \t                                  - How to perfect your listing: from photographs to thumbnails to listing descriptions  </p>  <p style=\"\">  \t                                  - Every tip and trick I used to triple my booking inquiries in just one month  </p>  <p style=\"\">  \t                                  - How to limit your rental related work to 3-4 hours a week MAX.  </p>  <p style=\"\">  \t                                  - How to virtually guarantee 5 star reviews from each guest  </p>  <p style=\"\">  \t                                  - How to become a SuperHost and join the top 5% of Airbnb hosts  </p>  <p style=\"\">  \t                                  - So much more! There are over 100+ lectures and 13 hours of content included in this course.  </p>  <p style=\"\">  \t-----------------------------------------------------  </p>  <p style=\"\">  \t<strong style=\"\">Some common questions:</strong>  </p>  <p style=\"\">  \t                                                                                                       <em style=\"\">Can anyone do this</em>?    </p>  <p style=\"\">  \t                                                                                                                                                 Yes, absolutely anyone can do this. Airbnb is in 192 countries and even in cities with fewer than 10,000 people. With my course I&#039;ll show you exactly how you can be successful in any environment.  </p>  <p style=\"\">  \t<em style=\"\">What if my space isn&#039;t nice</em>?  </p>  <p style=\"\">  \tEvery space has a price and if you follow my steps you can maximize that price. If you&#039;re not happy with the price you get, follow my advice and you can easily get more and more per night.  </p>  <p style=\"\">  \t<em style=\"\">What if I don&#039;t own my space, I just rent it</em>?  </p>  <p style=\"\">  \t                                                                                                                                                 Even if you don&#039;t own your space, even if you don&#039;t think you have room, even if you think your city is too small, you CAN rent out your space.  </p>  <p style=\"\">  \t                              -------------------------------------------------------  </p>  <p style=\"\">  \t                                                                                                                                                 AirBNB was a life changer for me and I want it to be the same for you. I&#039;ve studied the AirBNB market, have hosted personally over 200 guests, and have collaborated with 5 other rockstar hosts to bring this course together. In this course you&#039;ll get everything you need to skip the painful learning process of starting your listing and start maximizing your profit quickly.  </p>  <p style=\"\">  \t                                            If you follow my advice, I guarantee you will be successful with your AirBNB listing. If you&#039;re struggling I&#039;m always here 7 days a week to answer your questions personally. <strong style=\"\">And if you&#039;re not completely thrilled after taking this course, I will personally refund your course purchase. Anytime, any reason.  </strong>  </p>  <p style=\"\">  \t                                            Evan</p>", 
    "end_date": null, 
    "title": "Mastering Airbnb | Learn from SF's top host, 100+ lectures", 
    "price": "30.00", 
    "instructors": "Evan Kimbrell", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361978_1e2b_4.jpg", 
    "course_url": "https://www.udemy.com/hacking-airbnb-how-i-make-60000-a-year-from-my-spare-room/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T04:41:09Z"
}