{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Are you considering a moving to a new country or state and don&#039;t know where to start? <br style=\"\">Has your planned move to a new country or state left you feeling overwhelmed? <br style=\"\">Are you dreading leaving behind friends and family? <br style=\"\"><br style=\"\">What if I were to tell you that the move doesn&#039;t have to be so overwhelming, that it could actually be fun and exciting? It can. <br style=\"\"><br style=\"\"><strong style=\"\">The Secret is Preparation</strong></p><p style=\"\">Now I know from experience, and 30 + years of moving from country to country, that in a busy life the preparation can feel just as overwhelming as the move. So to make it all just that bit easier I have narrowed down the preparation for you in to simple to follow tips. <br style=\"\"></p>  <p style=\"\">  \t  The tips are divided into two easy to follow sections:<br style=\"\">  \t  1. Preparing for your move<br style=\"\">  \t  2. Enjoying and embracing your new environment.  </p>  <p style=\"\">  \t  The sections are designed to enable you to follow the tips from start to finish during your move. I have even included a downloadable PDF for you to print out and read as you go. <br style=\"\"><br style=\"\"><strong style=\"\">Prepare Before you Move</strong><br style=\"\"><br style=\"\">Read and implement the relevant tips before each part of your move takes place. The more prepared you are, the easier the move will be. <br style=\"\"><br style=\"\">The tips take you from preparing, packing, arranging, through to making new friends, staying healthy, and embracing your new environment. <br style=\"\"><br style=\"\">I suggest that you invest in a diary to record important information. As you will see as you work your way through the tips, this really can make a big difference and ease a lot of potential stress. <br style=\"\"><br style=\"\">Enjoy the move without the stress of having to remember everything. It is all here for you to tick off as you go.  <br style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Moving To a New Country or State", 
    "price": "20.00", 
    "instructors": "Kama Frankling", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427164_186e_2.jpg", 
    "course_url": "https://www.udemy.com/104-stress-free-moving-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T20:01:54Z"
}