{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">My Bag is My Home, is not a cliché. When going backpacking, you take with you everything you can possibly need and carry it with you on your back while still manage to have fun! During my backpacking, I saw a lot of travelers who just don&#039;t know how to use their backpack correctly or they over loaded the backpack, making it impossible to travel without back pains. If this scenario sounds familiar or you are about to set off to your first backpacking trip, this course is for you! </p><p style=\"\">Even if you don&#039;t plan to hike a lot, you would find a lot of useful information in this course that will improve your travelling skills! Any traveler could discover new information for backpacking in this course. <br style=\"\"></p><p style=\"\">You will learn a few things about  backpacks:</p><ul style=\"\"><li style=\"\">How to choose the right backpack for your needs</li><li style=\"\">Get to know the different backpacks available today</li><li style=\"\">How to fit it to your body</li><li style=\"\">What to take with you for a backpacking trip</li><li style=\"\">Receive <strong style=\"\">T</strong><strong style=\"\">he Ultimate Modular-Packing List</strong> that will ensure you won&#039;t forget anything behind and will help you keep track of your packing progress!</li></ul><p style=\"\">By the end of this course you will be able to pack your backpack with all you need, efficiently and easily!  and at the same time, learn a thing or two about backpacks....</p><p style=\"\">The course in build from videos presentation and includes some other resources that will help you be a successful backpacker! It is presented with a fun, light atmosphere that address all people! <br style=\"\"></p><p style=\"\">Ready to start packing?</p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "My Backpack is My Home - All about packing for backpackers", 
    "price": "20.00", 
    "instructors": "Einat Haddad", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434074_6304_2.jpg", 
    "course_url": "https://www.udemy.com/my-backpack-is-my-home-all-about-packing-for-backpackers/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T13:22:12Z"
}