{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Ready to get Permanent Residency in Paraguay?</strong></p><p><strong><em>Course price will raise to $197 effective July 1st 2015. Get in now while the price is low!</em></strong></p><p>The simple fact of the matter is that so many people are looking for information all over the Internet on how to get started. A few people know, but they aren't very helpful. Well, I'm not one of those people. I will give you all the required steps, along with my own experience in having completed the process myself. Included are all the documents you will need, where to send them, how much it will cost, and various other tidbits to help.</p><p>With this course now being offered exclusively on Udemy, and the only one tackling the issue of residency in Paraguay, you now have all the information you need to get started. I show you how to get your FBI background report (the essential first step in the whole process), what to tell the FBI in your request, the process of getting an apostille on all your required documents, as well as what money NOT to bring to Paraguay.</p><p>I have created what I believe to be a thorough course in helping you to get started. Anyone who has long been looking into Paraguay residency, I am pleased to tell you that your search is now over. You will not find more comprehensive information in one spot anywhere else on the Internet. You can complete the entire course within an hour. But actually doing the steps as I've shown will take you at least 4 months from start to finish. The sooner you get started, the sooner you will become a permanent resident.</p><p>I am here to help you. I will answer all your questions with promptness. Stop dreaming and begin taking action. </p>", 
    "end_date": null, 
    "title": "Permanent Residency in Paraguay - Getting Started Made Easy", 
    "price": "20.00", 
    "instructors": "Terence Stamp", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/504440_a47a.jpg", 
    "course_url": "https://www.udemy.com/permanent-residency-in-paraguay/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-17T13:22:36Z"
}