{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em><em><em><em><strong><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></strong></em></em></em></em></p>\n\n<p><strong><em><em>Learn Secrets to Increase Profit, Fans, Engagement &amp; Reach on  Facebook, Pinterest, Twitter, Google+, Instagram<br></em></em></strong></p>\n\n\n\n\n\n<p>  \tIf  you are or aspire to be at the management level in the hospitality  industry, then you have got to be aware of the impact social media and  all of its various outlets as on the hospitality industry. </p>\n\n\n\n\n\n<p>Social media  now allows clients and guests to leave and receive almost instantaneous  feedback concerning any hotel anywhere in the world.</p>\n\n\n\n\n\n<p> <strong>And as everyone  knows, the hospitality industry thrives on its reputation.</strong> </p>\n\n\n\n\n\n<p>This is why  it's so important to understand all of the ins and outs of social media  and exactly how they impact your business and reputation.<br></p>\n\n\n\n\n\n<p>Are you ready to become part of the next-generation of  Hospitality business leaders? Harness the power of social media for your business, organisation and career.</p>\n\n\n\n\n\n<p><strong><em>Join our latest social media course with UNLIMITED &amp; LIFETIME access you will learn how to drive sales, attract new customers and master social media.</em></strong></p>\n\n\n\n\n\n<p><em><strong>FULL 30 DAY MONEY BACK GUARANTEE.</strong></em></p>\n\n\n\n\n\n<p><em>Social media sites such as Twitter, Facebook, LinkedIn, Youtube, Pinterest and G+ all have thousands of customers waiting for you to engage!!</em></p>\n\n\n\n\n\n<p>  \tIt  is estimated that at <strong>least 80% of individuals looking for a hotel,</strong>  whether it is for business or pleasure will use the Internet as their  primary resource to gather information on specific hotels and then  purchase their rooms and stay and aside from using the official hotel  website or a third party website to book a stay. </p>\n\n\n\n\n\n<p><strong>60 to 70% of these  individuals use social media such as Facebook twitter, instagram,  pinterest, Google yelp, and many others to gather information before  actually booking their stay the opinions or views and information shared  by social media users will directly sway a guest in their hotel stay  options.</strong> </p>\n\n\n\n\n\n<p>Nothing is kept secret - I reveal all I know ... and as I test even more things, those that are successful are added to the course - at no extra cost to you! This is a course that will continue to grow and grow.</p>\n\n\n\n\n\n<p>As well as the <strong>Udemy 30 day guarantee</strong>, you have my personal promise that you will be wowed and delighted by what you'll learn in the next 3 to 4 hours ... and you'll be kicking yourself if <strong>you already had this Udemy course </strong></p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p>So social media has a great power to directly affect a hotel's  profit margin in this day and age, which is why it is very important  that hotels remain savvy in the best ways to use the social media  outlets to their advantage to maintaining a positive reputation and  attract as much of a given market demographic as possible.<br></p>\n\n\n\n\n\n<p><strong>As with all my courses:</strong><br></p>\n\n\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently <strong>$45</strong>, but will next increase to <strong>$497</strong></li><li>You have unlimited lifetime access at no extra costs, ever</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li><li><strong>30 Day 100% Risk Free Offer!</strong></li></ul>\n\n\n\n\n\n<p><strong>Certificate of completion</strong></p>\n\n\n\n\n\n<p>All students who complete this course will receive a FREE digital 'Certificate of social media marketing' issued by  Udemy</p>\n\n\n\n\n\n<p><strong>DON'T FORGET: Udemy operates a 30 day full money back guarantee, no questions asked! If you're not happy with this course you can request your money back.</strong></p>\n\n\n\n\n\n<p><em><strong>Click the \"take this course\" button</strong> straight away at the top right of this page to unlock the power of social media for your business.</em></p>", 
    "end_date": null, 
    "title": "Social Media Marketing : Hospitality & Travel Professionals", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266798_5e96_3.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-for-hospitality-industry/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T20:46:44Z"
}