{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"><strong style=\"\">What is the India Heritage Experience all  about?</strong></p>    <p style=\"\">As you would  probably agree, Heritage is not about facts, dates, chronology and  personalities.&nbsp; Heritage is about real  life stories - only they happened in the past, in very different times.&nbsp; They teach us quite a bit about various  aspects of life - art, culture, religions, philosophy, technology,  architecture, lifestyle, science, politics and strategy.&nbsp; </p>    <p style=\"\">This course is  about bringing forth some of these aspects of heritage to the forefront, and  eliciting introspection.&nbsp; The style used is immersive and asks the viewer to engage and participate and develop opinions.&nbsp; </p>    <p style=\"\">The course  is focused on one of the most intriguing countries with a heritage as rich as  can be.&nbsp; INDIA.&nbsp; </p>    <p style=\"\">The course adopts a  unique approach of contextualizing history around world heritage sites, ancient ruins and  heritage districts, enabling the learner to frame the concepts around actual  remnants from the past.&nbsp; Rare photographs have been captured by celebrated photographers.&nbsp; Archival images have been dug out and presented in the narrative.&nbsp; You will be mesmerized. &nbsp; &nbsp; </p>    <p style=\"\">The format  of course delivery is a documentary screening.&nbsp;  Narrators are historical characters and not professors. </p>    <p style=\"\"><strong style=\"\">What  heritage sites are covered?</strong></p>    <p style=\"\"></p><ol style=\"\"><li style=\"\"><span style=\"\">Taj Mahal</span><br style=\"\"></li><li style=\"\"><span style=\"\">Agra Fort</span><br style=\"\"></li><li style=\"\"><span style=\"\">Qutb Minar</span><br style=\"\"></li><li style=\"\"><span style=\"\">Red Fort</span><br style=\"\"></li><li style=\"\"><span style=\"\">Humayun&#039;s  Tomb</span><br style=\"\"></li><li style=\"\"><span style=\"\">Golconda  Fort</span><br style=\"\"></li><li style=\"\"><span style=\"\">Gateway of  India - Fort Heritage District of Mumbai</span><br style=\"\"></li></ol><p style=\"\"></p>                            <p style=\"\"><strong style=\"\">What kind of  materials is included?</strong></p>    <p style=\"\">Videos.<br style=\"\"></p>    <p style=\"\">We also have  interesting Crossword puzzles for you to solve after every lesson.&nbsp; These are great to summarize key highlights.&nbsp; </p>    <p style=\"\"><strong style=\"\">How long  will the course take to complete?</strong></p>    <p style=\"\">The Ancient History of India course will  take about 10 hours to complete.&nbsp; About 6 hours video lesson  time.&nbsp; About 4 hours to solve Crossword  puzzles.<br style=\"\"></p>    <p style=\"\"><strong style=\"\">How is the Ancient History of India course  structured?</strong></p>    <p style=\"\">We have  chosen to structure the course monument-wise.&nbsp;  This provides you a very strong context for all information so you can  logically store them in your memory.&nbsp; It  will also help reinforce all information should you travel to any of these  locations anytime soon.&nbsp; </p>    <p style=\"\"><strong style=\"\">Why take  this course?</strong></p>    <p style=\"\"></p><ul style=\"\"><li style=\"\">You love art, photography, history, heritage or stories.</li><li style=\"\"><span style=\"\">You are  curious about India and what was it about its past that made it so special and  an object of desire</span><br style=\"\"></li><li style=\"\"><span style=\"\">You are  connected to India, but don&#039;t know much about it, and would like to spruce up  your knowledge</span><br style=\"\"></li><li style=\"\"><span style=\"\">Award-winning experts have developed the course after months of research and hard work - so you  know you&#039;re receiving absolutely top quality and  authentic</span> experience.<br style=\"\"></li></ul><p style=\"\"></p>            <p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "The India Heritage Experience", 
    "price": "45.00", 
    "instructors": "My IndiEye", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28274_aba8_10.jpg", 
    "course_url": "https://www.udemy.com/myindieyecourse01/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-31T11:30:29Z"
}