{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em></em><em><strong><em><strong><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></strong></em></strong></em><strong></strong></p>\n\n<p><strong>Travel Hacking: Travel Hacking Made Simple Learn Tips to Almost Travel the World for FREE</strong><br></p>\n\n\n\n<p><strong>You'll Save Money on Your Next Travel Purchase Or Your Money Back - Guaranteed!</strong></p>\n\n\n\n<p>LEARN TIPS AND STRATEGIES ON  How to Cleverly Travel The World On A Shoestring Budget While Having The Time Of Your Life</p>\n\n\n\n<p>The Info in this course works for singles, couples and families... normal people just like you!</p>\n\n\n\n<p>Dear Fellow Traveller,</p>\n\n\n\n<p>If you are like me, you probably insist on <strong>getting the most value for your money</strong>,</p>\n\n\n\n<p>  \tTravel can and always should be an eye-opening adventure and a spiritual experience. The early explorers and conquistadors gazed at the New World with wonder and excitement, fear and anticipation, never knowing exactly what they might find or learn, like a new species of animal to catalog and study, or a unique plant with health benefits, or a tribe claiming to know the secrets of the universe.  </p>\n\n\n\n<p><em>Discover the Simple Proven Method That Will Allow You To Travel The World For Pennies on the Dollar! </em></p>\n\n\n\n<p><strong>What You'll Discover in this Course:</strong></p>\n\n\n\n<ul><li>Over 16 lectures and 1.5 hours of content!</li> <li>How to explore a country using alternative means of transportation;</li> <li>How to finance your expedition;</li> <li>How to stick to a budget;</li><li>Travel Hacking</li> <li>How to find the necessary details that allow you to live like a local;</li> <li>How to pack minimally using a backpack, or carry on, and a travel vest;</li> <li>How to secure your personal details and financial assets;</li> <li>How to read a guidebook and pull out essential data;</li> <li>How to communicate if you don't speak a country's native language.</li> </ul>\n\n\n\n<p> <strong>So Who is this Course For???</strong></p>\n\n\n\n<p><em>It is for those wishing to expand their horizons and knowledge of the world around them. This course will teach you to avoid the traps of tour packages and enable you to explore a country like a local. You will learn to find the best travel deals, as well as alternatives such as service and volunteer vacations. Though not a prerequisite, knowledge of a foreign language and different cultures may help you understand this course better.</em></p>\n\n\n\n<p>Although the days of the conquistadors and other explorers such as Meriwether Lewis and William Clark are long gone, with uncharted territory dwindling thanks to GPS (global positioning satellite) technology, you can still travel as though you are a conquistador.</p>\n\n\n\n<p><strong>                                SEE WHAT ENROLLED STUDENTS ARE SAYING...</strong></p>\n\n\n\n<p><strong><em>\"I recommend this course for every passionate traveler. The information is concise and well organized. From planning the journey, to practical advice on how and what to pack, or money saving tips on food and accommodation, the course covers all the major things you want to consider when preparing for a trip. I am sure that not only will I considerably cut down my travelling expenses once I start using the knowledge I gained from this course, but I will also enjoy the whole experience from a new perspective.\" Happy Student #1</em></strong></p>\n\n\n\n<p><strong><em>\"Beyond expectations </em></strong><strong><em>I found this course to be the most informative on the travel subject yet. I have traveled internationally and have always stuck to the “tour\" or travel agent set “itinerary\" This course not only covered the general types of travelling but also indulged students into to the world of backpacking. Usually, one reads about only the most frequented touristic regions and the higher end lodging options. The fact that it caters to all budgets from the big spender luxury tourist and retiree budget to the Cup of Noodle struggling college student trying to leave their mark. The course encourages that all travelers should use the anthropological approach when visiting foreign lands. Promoting the  perspective to further cultural immersion that will bring more in tune with the customs of the region. It covers etiquette and resource tips for on obtaining more out of their travels. The fact of the matter is that, your approach and presentation during your travels will set the mood and pace. This course, is essential for those who wish to gain the most benefits, whether it be by networking [socialization] or by knowledge (cultural exposure). This definitely goes beyond the travel guides most commonly found in the bookstores and libraries. The lectures are presented in a unique manner that focuses on in depth exploration rather than a shopping trip. Audio and text components are perfectly in sync. It allows you to download text documents for safe keeping, should they be required as reference for a later time.\" </em><em>Happy Student #2</em></strong></p>\n\n\n\n<p><em><strong>\"Inspirational! </strong></em><em><strong>This course makes me want to pack up and now and go on a trip! I never knew I could travel the world for such a low expense. This course teaches how to pack, where to stay, how to travel, etc. I highly recommend for all travelers &amp; people who think they can't afford traveling!\" </strong></em><em><strong> </strong></em><em><strong>Happy Student #3</strong></em></p>\n\n\n\n<p>  \tYou just have to be open and willing to try anything the universe places in front of you, and view the world from a new perspective. Then, you will understand the educational and spiritual aspects of traveling, and the wonders it has to offer.  </p>\n\n\n\n<p>  \tThis course teaches you everything you need to know to be a modern-day conquistador so that you may experience the joy of discovering the world.  It will take you off the beaten path. It will give you the skills and knowledge to truly experience the world as a global citizen. You will learn the nooks and crannies and eateries known to locals and gain knowledge and perspective that will make you a better traveler.  </p>\n\n\n\n<p><strong><em>Are You Ready To Learn How to Travel The World and Do it on the Cheap??</em></strong></p>\n\n\n\n<p><strong>***GET THIS COURSE TODAY FOR JUST $35! HURRY BEFORE IT'S RAISED PERMANENTLY TO $50***</strong> </p>\n\n\n\n<p><em><strong>Discover the Simple Proven Method That Will Allow You To Travel The World For Pennies on the Dollar! </strong></em></p>\n\n\n\n<p><strong>As with all my courses:</strong></p>\n\n\n\n<ul><li>You have unlimited lifetime access at no extra costs, ever</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li></ul>\n\n\n\n<p>All future updates to this course are free - you are \"locked-in\" at the current low price of $35 - but you will never pay more if you enroll today at the introductory low price.</p>\n\n\n\n<p>And there's a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really cannot lose! </p>\n\n\n\n<p>Every minute you delay is actually COSTING you  That DREAM VACATION ....Enroll Today!! Pack Tomorrow!! Fly out This Weekend!!</p>", 
    "end_date": null, 
    "title": "Travel Hacking: How To Travel The World (Almost) For Free", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/254638_ec4c_3.jpg", 
    "course_url": "https://www.udemy.com/budget-travel-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-02T18:54:08Z"
}