{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong></strong>  </p>\n\n<p>  \t<strong><em><u>Taught by a bestselling author, professional writing coach,<br>  \t             and former editor for Rick Steves' Europe</u></em></strong>  </p>\n\n<p>  \t<strong><em><br>  \t             Lots of people dream of becoming travel writers.</em></strong>  </p>\n\n<p>  \t<strong><em>This course will help you fulfill that dream.</em></strong>  </p>\n\n<p>  \t<em><strong>Discover how to write travel tales readers love, <br>  \t                       and how to sell your stories to newspapers and magazines.</strong></em></p>\n\n<p><br></p>\n\n<p><em><strong><strong><em><u>This course originally cost $169.<br><strong><em><u>The price has been adjusted to fit Udemy's new pricing guidelines.</u></em></strong></u></em></strong></strong></em><em><strong></strong></em></p>\n\n<p>  \t<strong><em><br>  \t</em></strong>  </p>\n\n<p>  \t<strong>Hi! I’m Dave Fox.</strong> I’m a bestselling author and writing coach. I’ve worked in more than 50 countries as a freelance travel writer, workshop presenter, and international tour guide. I help people write amazing tales about their journeys.  </p>\n\n<p>  \t                                          If you have dreams of becoming a travel writer – whether it’s so you can publish your work professionally, create a popular personal travel blog, or just write about your travels for the fun of it – I can help you achieve your goals.  </p>\n\n<ul>  \t<p>  \t\t<strong>Beginning travel writers:</strong> If travel writing is something you’ve wanted to break into, but you haven’t known how to get started, this course will teach you all you need to know to begin writing lively and exciting travel tales today.  \t</p>  \t<p>  \t\t<strong>Intermediate travel writers: </strong>If you’ve done some travel writing before, but you want to create more polished, compelling stories – stories that stand out in the crowded arena of aspiring travel writers – this course will help you hone your skills, and it will give you a clear understanding of how to succeed in the writing business and get published.  \t</p>  </ul>\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n<p>  \t<strong>Follow these lessons, and I guarantee you will see an immediate improvement in your writing.</strong> You'll learn skills you can start using right away – and skills that will evolve and get even better over time as you keep writing. You’ll gain a clear understanding of the techniques professional writers use to write captivating travel essays, and you’ll discover your own, unique writing voice.  </p>\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n<p>  \t<strong>Some of the topics we’ll cover include:</strong>  </p>\n\n<p>  \t                                          * Transforming your “rough-draft” travel diaries into compelling personal travel essays with attention-grabbing beginnings, streamlined middles, and meaningful endings – and why you <em>must</em> follow a very different writing style from your “on-the-road” journals when you write travel tales for others to read.  </p>\n\n<p>  \t                                          * Spotting and capturing the details that make a story sparkle and writing about them in ways that make readers feel like they’re right there with you.  </p>\n\n<p>  \t                                          * Bringing characters to life through quotes and vivid description, and navigating the ethical and legal issues that come with writing about other people.  </p>\n\n<p>  \t                                          * Avoiding stale clichés that weigh down potentially great writing and coming up with fresh, original alternatives.  </p>\n\n<p>  \t                                          * Getting started in travel blogging.  </p>\n\n<p>  \t                                          * Pitching and selling your articles to newspapers, magazines, and anthology books. (Thousands of newspapers and magazines pay freelance writers more for a single story than you'll pay for this workshop!)  </p>\n\n<p>  \t                                          * The most common beginners’ mistake that keeps many aspiring travel writers from getting published – and how to fix it.  </p>\n\n<p>  \t                                          * And tons of other easy-to-act-on writing tips.  </p>\n\n<p>  \t                                        If you want to be a great travel writer, there’s another thing you must also be able to do. You must know how to have <em>big adventures</em> – because those adventures will spark your boldest stories. So I’ll also share my tips on <strong>how to make exciting things happen when you travel</strong> – how to find richer cultural experiences and more meaningful personal encounters in the places you visit. <em>(Even if you’re an introvert!)</em>  </p>\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n<p>  \t<strong>This course is different from other travel writing courses.</strong> It doesn’t just offer tips on how you should write; it also explains how you <em>shouldn’t</em> write.  </p>\n\n<p>  \t                          Lots of people try to break into travel writing. Those who don’t succeed usually blame it on not being talented enough – but that’s often not their real problem. Their real problem is they have adopted a set of habits that are weakening their writing.  </p>\n\n<p>  \t                          Over the two decades I’ve been teaching travel writing workshops, I’ve identified a series of common mistakes beginning writers make. These mistakes weigh their writing down, and hold them back from writing to their full potential. These habits are <em>easy</em> to fix once you know how to spot them in your own work. This course teaches you how.  </p>\n\n<p>  \t                                          In addition to more than three hours of information-packed videos, this workshop also includes a series of writing exercises to help you practice what you’ve learned, and an online discussion forum where you can ask me questions whenever you like and talk about your writing our international community of writing students.  </p>\n\n<hr>\n\n<p>  \t<strong><em>Q: </em></strong><em>True or False: Only a few lucky people get to become successful travel writers.</em>  </p>\n\n<p>  \t<strong><em>A: </em></strong><em>False! Being “lucky” has nothing to do with it!</em>  </p>\n\n<hr>\n\n<p>  \t                                          Talent doesn’t really work that way.  </p>\n\n<p>  \t                                          If you’re smart enough to understand this webpage, you’ve got all the brain-cells you need to become a successful writer. Doing it on your own is tough, however. Success will come more quickly if you have a teacher, a mentor, to help guide the way.  </p>\n\n<p>  \t<strong>I love engaging with my students, and answering their questions in our online forums.</strong> So ask me questions at an time! I’m here to help! (I also offer in-depth critiquing and one-on-one coaching for an additional fee – but we’re getting ahead of ourselves. If you’re just getting started, you’ll get the most value for your money if you begin with the basic course.)  </p>\n\n<p>  \t<strong>I also believe that we learn faster when learning is fun.</strong> So I promise my lessons are lively, even a bit goofy at times, and never boring. (And if you don’t agree, if you don’t feel you have gotten your money’s worth after joining the course, Udemy offers a 30-day, no-questions-asked, money-back guarantee. You’ve got nothing to lose!)  </p>\n\n<p>  \t                                          We are each in this life for a finite amount of time. We owe it to ourselves to achieve our dreams during that time. If becoming a travel writer is one of your life dreams, I can help you make that dream a reality.  </p>\n\n<p>  \t<strong></strong>  </p>\n\n<p>  \t<strong>Ready to get started? </strong>Just click the blue “Take This Course” button at the top of this page (or the bottom of your screen if you're reading this on your phone) and begin your journey ... <em>right now!</em>  </p>\n\n<hr>\n\n<p><strong>\"(Dave is) the best writing teacher I have ever had. Talented, funny, approachable, and structured.\"</strong><br></p><p>  \t                                   -- Leslie in Surrey, England</p><p><br></p><p>  </p>\n\n<p>  \t<em><strong>\"Dave Fox is an amazing teacher who will give you online feedback as if you were sitting right next to him.\"</strong></em>  </p>\n\n<p>  \t                                          <em>-- Joan in Bakersfield, California</em>  </p>\n\n<hr>\n\n<p>  \t<strong>Also check out my other writing courses on Udemy:</strong>  </p>\n\n<ul>  \t<li>Globejotting: How to Write Extraordinary Travel Journals (and still have time to enjoy your trip!)</li>  \t<li>Professional Humor Tricks for Writers, Speakers, and Other Misfits</li><li>Write-Brained 1: Overcome Writer's Block and Write with Confidence! (The first in my new series of courses on the psychology of writing, this course explores how to cure writer's block, writer's overwhelm, and perfectionism so you write more, write better, and write more happily.)</li>  </ul>", 
    "end_date": null, 
    "title": "Travel Writing: Explore the World & Publish Your Stories!", 
    "price": "45.00", 
    "instructors": "Dave Fox", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203644_b220_12.jpg", 
    "course_url": "https://www.udemy.com/travel-writing-class/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-23T04:38:23Z"
}