{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"text-align: center;\">  \t<strong></strong>  </p>    <p style=\"text-align: center;\">  \t<em><u><strong>Taught by a bestselling travel author, professional writing coach,<br>  \t             and former website editor for Rick Steves' Europe!</strong></u></em></p><p style=\"text-align: center;\"><em><u><strong><br></strong></u></em></p><p style=\"text-align: center;\"><em><u><strong><strong><em>This course originally cost $39.</em><br><strong><em><u>The price has been adjusted to fit Udemy's new pricing guidelines.</u></em></strong></strong><br></strong></u></em></p><p style=\"text-align: center;\"><em><u><strong><br></strong></u></em></p><p><strong>The stories we collect when we travel are some of the biggest tales of our lives. </strong>We get to keep those stories for a lifetime -- <strong><em>if</em></strong> we can remember the details. Journaling about them in a travel diary, helps keep our memories vivid.  </p><p>Most travel diaries fizzle, however. By day six of a big trip, people struggle to recall what happened on days three, four, and five. They return home with mostly blank pages, or bland writing that fails to capture the full spirit of their travel adventures.</p><p>What’s the tool most people use to document their travels? A camera. Nearly everyone brings a camera of some sort on their vacations. Yet there is so much we can't frame in a photograph that we <strong><em>can</em></strong> capture in a well-written travel journal – <em>all</em> of our senses, the unique emotions we experience in unfamiliar places, the tales we hear from people we meet, challenges we overcome, that sense of wonder we feel as we travel through foreign environments, and so much more. You can also journal in tandem with your travel photography to tell the stories behind the photos.  </p><p>So if travel journaling is such a powerful tool for remembering our trips, why is it a struggle for so many people? There are two common frustrations many travel journalers express:</p><ul><li>It’s hard to find time to write in the middle of an exciting vacation.</li><li>Their writing falls flat. They are having some of the biggest adventures of their lives, yet their words are merely step-by-step accounts of their days. Their writing fails to capture the full scope of their adventures.</li></ul><p>This course will help fix both of those problems. </p><p><strong>You’ll learn how to splash bold and vivid details into your travel journals – </strong><em><strong>quickly</strong></em><strong> – so you maximize your time for exploring and your writing won’t gobble up precious vacation time. </strong></p><p><strong></strong>You’ll also discover writing techniques that enhance your experiences, making you more aware of your surroundings as you travel. And you’ll learn fun and efficient ways to write, so that travel journaling doesn’t feel like a chore in the middle of an exciting trip.</p><p>This lively and informative workshop includes 75 minutes of video lessons and set of supplementary readings. Best-selling travel author and humorist Dave Fox teaches you how to write boldly and adventurously as you explore the world. You'll write vivid accounts of your trips, gain a deeper awareness of your surroundings, and keep your memories alive and bright for years to come.</p><p><strong>This course is for you if:</strong></p><ul><li>You've tried writing a travel journal in the past but you want to do it better</li><li>You've never journaled about your travels before and want to do it right the first time</li><li>You haven't managed to get much written on previous trips and want to write more – in ways that bring you deeper in touch with your surroundings and make your journeys more exciting</li><li>You haven't journaled about past journeys and you wish you had. (There's still time to write about trips you've already taken – even if you <em>think</em> you can't remember the details. This course will show you how!)</li><li>You're an aspiring travel writer who needs help spotting and collecting the \"raw footage\" that will make for great travel tales later. (My follow-up course, “Travel Writing: Explore the World and Publish Your Stories,” teaches you how to transform your on-the-road travel journals into tales for others to read.)</li></ul><p><strong>So sign up today and get ready to write, and travel, like you never have before</strong> – with an enhanced awareness of your journeys and an ability to write about those trips in ways that will keep your memories bright for years to come. </p><hr>    <p>“Dave Fox understands how journaling can help that great trip become a candy jar of memories that you can dip into for the rest of your life.\"</p>  <p><strong>-- Rick Steves, PBS TV host and author of <em>Europe Through the Back Door</em></strong></p><hr>      <p><strong>Also check out my other writing courses on Udemy:</strong></p>  <ul><li>Travel Writing: Explore the World and Publish Your Stories</li><li>Professional Humor Tricks for Writers, Speakers, and Other Misfits</li><li>Write-Brained 1: Overcome Writer’s Block and Write With Confidence! (The first in my new series of courses on the psychology of writing explores how to cure writer's block, writer's overwhelm, and perfectionism to make you a more productive, more confident, more successful, and <em>happier</em> writer.)</li></ul>", 
    "end_date": null, 
    "title": "Travel Journaling: How to Write Extraordinary Travel Diaries", 
    "price": "25.00", 
    "instructors": "Dave Fox", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/146636_3463_6.jpg", 
    "course_url": "https://www.udemy.com/travel-journaling/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-14T05:56:39Z"
}