{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Travel Hacking Mastery: This Travel Hacking course will teach you how to fly anywhere in the world for less than $150! If you live in the US and you earn a monthly salary, then this is totally possible. </strong></p>\n\n<p>By using frequent flier points you can book flights by only paying the taxes. You don't even need to travel a lot to earn points. You can earn points by signing up for credit cards and use your regular monthly spending. You don't need to spend a single extra dollar! </p>\n\n<p><strong></strong><strong>In this course you will learn how to </strong></p>\n\n<p><em>1) Book free flights using airline loyalty points</em></p>\n\n<p><em>2) Earn thousands of airline loyalty points by signing up for credit cards</em></p>\n\n<p><em>3) Get the annual credit card fees waived by the banks</em></p>\n\n<p><em>4) Choose the best credit card to sign up for</em></p>\n\n<p><em>5) Maintain a very high credit score</em></p>\n\n<p><em>6) Get credit card applications approved</em></p>\n\n<p><em>7) Earn maximum points by managing credit card spending</em></p>\n\n<p><em>8) Understand the benefits that come with different credit cards</em></p>\n\n<p><em>9) Sign up with the airline loyalty program that fits the student's situation best</em></p>\n\n<p><em>10) And much more...</em></p>\n\n<p><em>*********************************************************************************************************</em></p>\n\n<p><strong>So...what makes this course so unique?</strong></p>\n\n<p>The extremely detailed information you simply won't find anywhere else</p>\n\n<p>The incredible savings you can achieve on your travels by implementing our strategies</p>\n\n<p>*********************************************************************************************************</p>\n\n<p><strong>Who is teaching this course? </strong></p>\n\n<p>The instructors <strong>Jasper</strong> and <strong>Erik</strong> both have a wealth of knowledge and experience on the topic of travel hacking. </p>\n\n<p><strong>Jasper</strong> has been traveling full-time for over five years and has <strong>flown around the world one year without paying for a single flight,</strong> using frequent flyer points. </p>\n\n<p>Erik runs an online business that manages clients award point portfolios. He has helped <strong>thousands of people earn free flights</strong> and free upgrades to business and first class flights. Erik has over 25 credit cards without ever paying a fee! <br></p>\n\n<p>*********************************************************************************************************</p>\n\n<p><strong>Did you know banks often waive credit card fees when you ask for it? </strong></p>\n\n<p>It's much cheaper for a bank to retain a current customer than to acquire a new one. Therefore, banks are often willing to waive credit card fees if you negotiate correctly. <strong>We will teach you how to do this!</strong> In this course we have included real life conversations with bank employees in which <strong>fees of over $100 a year are waived</strong>. That's more than the price of this course, which means that even if this is all you take away from the course, you'll make your money back.</p>\n\n<p>*********************************************************************************************************</p>\n\n<p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Travel Hacking Mastery: Travel Around the World for Cheap ", 
    "price": "50.00", 
    "instructors": "Jasper Ribbers, Erik Paquet", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477690_fac3_2.jpg", 
    "course_url": "https://www.udemy.com/travel-hacking-fly-anywhere-in-the-world-for-less-than-150/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T04:13:45Z"
}