{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<ul>  \t<li><em><strong>Over 40,500 people from 179 countries enrolled in my courses</strong></em></li>  \t<li><em><strong>Featured as one of the Best Instructors on Udemy</strong></em></li>  \t<li><em><em><em><strong>Overall, 1100+ TOP </strong></em><em><strong>Reviews from very happy students</strong></em></em></em></li></ul>\n\n<p><br>In this course I will share with you what I've learnt while traveling to over 45 different countries. We will discuss not only general travel advice, but I will also share with you specific tips including:-lowering your travel costs-staying safe abroad-building motivation and destroying the fear of unknown-negotiating with flea market vendors-making friends abroadand many more.I'm the author of 6 successful Udemy courses that are considered to be amongst the best productions available on Udemy. Working on those courses taught me what it takes to create an amazing user experience. I applied those lessons to make “Travel Hacking\" the best travel course available on the market.  </p>\n\n<p>  \t<strong>What some students say about this course:</strong>  </p>\n\n<p>  \t<em><strong>\"Exciting Course</strong>. Really good course and packed with useful information. Specially about safety while traveling.\"</em> - Dima Pokatov  </p>\n\n<p>  \t<em><strong>\"Great Course.</strong> This course is full of  practical advice. Before taking this course I wasn't very confident  about travelling as I had many misconceptions about it. Jimmy has  cleared up all of it. Now I'm really excited about travelling. Thanks a  lot Jimmy.\" </em>-  Niqash Najim  </p>\n\n<p>  \t<strong><em>\"Very  useful course, would recommend it to anyone, who would like to broaden  the horizon and conquer stereotypes about other countries and nations  around the world</em></strong><em>. Bottom line: 9.5/10 - this course will be tough to beat, will definitely check out Jimmy's other courses.\" - </em>Sergey Bichkov</p><p><strong>\"</strong><strong>awesome video, awesome instructor.</strong> It is totally worth every penny I paid for this course. I feel much more confident that one day I will be a real life hacker like Jimmy\". - Chao Wang</p><p><em><strong>\"</strong></em><em><strong>Great! </strong></em><em><strong>I'm really enjoying this course. Your confidence and enthusiasm is contagious!\"</strong></em> - Bud Brown</p><p><em><strong>\"</strong></em><em><strong>Great travel advice from an experienced world wanderer. </strong></em><em>Jimmy offers some great travel advice in this well produced and informative course. His laid-back style makes for easy learning. </em><em>As a long term traveller myself I still found some great tips in this course that I will be adding to my own mental database of travelling knowledge and skills. </em><em>I would totally second Jimmy's opinion - it is a fascinating world with so much to see.</em><em>Follow Jimmy's guidelines for safe, affordable and fun-filled travel.\"</em> - Ian Usher<br></p>\n\n<p><em>\"</em><strong>Worth every single dollar!!! Best course for travelling!</strong>The BEST course you can ever buy! Very good for beginners!!!!<em>Thank you a lot! :)\" - Elay Elay</em></p><p><em></em><em><strong>\"</strong><strong>Beautifully Done! </strong></em><em>All of Jimmy Naraine's videos and courses are excellent - professionally produced with immediately useful content delivered in an engaging, entertaining manner. I highly recommend anything he does\".</em> - Sean Kearney</p><p><em><strong>\"</strong><strong>Inspiring and Empowering.</strong> </em><em>This is a very inspiring and empowering course. Jimmy does an excellent job at breaking down many mind-barriers\"</em>. - Gary Williams</p>\n\n<p><em><strong>\"</strong><strong>Outstanding delivery! </strong></em><em>Jimmy rocks - watching his courses is like watching a tv show. Very fun, engaging and educational at the same time. Thanks Jimmy!\" </em>- Kirill Eremenko</p><p><em>\"</em><em>Common Sense Defined. </em><em>All of the tips given are useful now and in the future because they are mostly common sense things that you may not have thought of that can save you lots of time, money and keep you safe. <strong>Excellent presentation of subject matter in nice short, to the point, lessons. The first 5 tips will save you the money of this course\".</strong> </em>- Pamela Johnson</p>\n\n<p><em>\"It's the simple things we forget.. </em><em><strong>Jimmy takes your attention back to really basic key things that we take for granted </strong>as well as thoroughly explaining the consequences of using/not using his methods clearly\". </em>- Ravindra Foolheea</p>", 
    "end_date": null, 
    "title": "Travel Hacking: Cheap, Smart & Fun Travel - Travel Smart", 
    "price": "20.00", 
    "instructors": "Jimmy Naraine", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267962_0d73_4.jpg", 
    "course_url": "https://www.udemy.com/travel-hacking-cheap-smart-fun-travel/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-24T10:49:12Z"
}