{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<ul><li><strong>Overall, 4000 students enrolled in our courses. </strong></li><li><strong>Overall, 200+ TOP Reviews from very happy students</strong></li><li><strong>Over 2 hours of TV High Definition Quality Videos</strong></li></ul><p>You are about to learn the lessons I got while travelling to 30 countries with CouchSurfing. You are about to understand what works and what doesn't on CouchSurfing. If you are a beginner, this is an all inclusive course which will teach you everything you need to know about CouchSurfing - from how to create an outstanding profile, to how to find a safe &amp; reliable host, who you can trust and feel comfortable with and how to fix all the logistics on your travel. All questions that you might have about CouchSurfing will be covered - Is it safe? Is it free? How to arrange it? Where to start?</p><p>I want my students to have a great time while learning &amp; that is why I made the course as entertaining and actionable as possible. You will be able to apply the theory at every step of the course and thus by end of it you will have an outstanding CouchSurfing profile &amp; you will be ready for your first amazing CouchSurfing experience.</p> <p>What Some Students Say About My Courses:</p><p><strong>''This course offers a ton of value and was presented in a compelling way... Recommended.''</strong><strong> - </strong><em>Jimmy Naraine</em> (bestselling instructor on Udemy)<br></p><p>\"<em>Martin explains everything <strong>very clear and with a lot of passion</strong>.</em> \" - Joepperd D<br><br>\"<em>The <strong>best step by step guide to Couch Surfing</strong> that I've found so far.</em>\" - Adam Naraine<br> </p><p>\"<em><strong>Very energetic videos</strong> that are motivating by conveying your high vibe and your easy to understand, <strong>practical content.</strong> I found lots of good advice in them that I will start to implement right away. Thank you Martin</em>!\" - Gergely Horváth</p><p>\"<em>He explains step by step not just what to fill in (and what is not needed) but also why and tips and tricks to make sure you are successful. <strong>Many of these things I never would have thought of on my own</strong>. </em><em>His <strong>videos are high quality</strong>, <strong>his voice is clear, and the content is well thought out.</strong></em>\" - Michael Glasser<br></p><p>\"<em>This course is filled with <strong>great tips</strong> ... <strong>very practical</strong>, but if I had one tip for everyone reading this. Make sure you do it step-by-step instead of watching it through THEN attempting to implement.</em>\" - Kevin Hunter</p><p>\"<em>Overall, Martin is a <strong>very inspiring, charismatic and positive</strong> trainer who inspired me to get on the fast track to my goals!</em>\" - Diana Dimitrova</p><p>By implementing the material from this course, you will be able to find a free couch to stay anywhere you go, all over the world. (And I'll let you in on a little secret – sometimes you get much more than a couch, like a comfortable spare bedroom all to yourself.)<br></p><p>Consider that staying in the average hostel costs 25 US dollars per night, while the average hotel room costs 60 US dollars per night. Obviously, in some parts of the world accommodation costs a lot more than even that. </p><p><strong>If you take action and implement what I teach in this course - and you land even just <em>two couches</em> – your entire course is already paid off!</strong> </p><p>_________________________________________________________________</p><p>Now, You could try to do it all yourself and learn from your own mistakes as you go, but you should be prepared for a lot of trial and error and wasted time, and you could end up far from home in a dangerous situation if you do something wrong. </p><p>I would like to save you the time and effort and make sure you start out couch surfing as if you were already an experienced pro. </p>", 
    "end_date": null, 
    "title": "Travel Made Easy: How to See the World on a Budget", 
    "price": "20.00", 
    "instructors": "Martin Georgiev, Edmund Piunow", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480888_7b90_3.jpg", 
    "course_url": "https://www.udemy.com/travel-made-easy-how-to-see-the-world-on-a-budget/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T06:37:37Z"
}