{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Learn new skills, lower the costs of your travel and experience wanderlust once and for all!</p>  <p>  \t<strong style=\"\">This course will give you a map of all the possibilities, so you can either plan ahead or decide to find a job on the spot.</strong></p><p><strong style=\"\">In this course, you will learn:</strong></p>  <p>  \t        -How and where to find various jobs, voluntary work etc.  </p>  <p>  \t        -Travel cheap (and safe)  </p>  <p>  \t        -Working and travelling in and around Europe  </p>  <p>  \t        -Earning money online</p><p>- Build an online business (interview)</p>  <p>  \t        - Teaching jobs</p>  <p>  \t        - Jobs in tourism (no only entry-level jobs) and much more!  </p>  <p>  \t<strong style=\"\">Learn how to work &amp; travel anywhere in the world!</strong></p>  <p>There are <strong style=\"\">many benefits</strong> of working while travelling the world. You don&#039;t need to save money and maybe wait for months or maybe even years to “finally do it&quot;. You can simply just jump on the plane and work your way around a new country or continent. Furthermore, the new skills you gain will help you boost your career upon your return. More and more employers consider a gap year or any other working experience abroad as a great plus!</p><p>However, the majority of people having the same wish you do, never do it! Why? They feel confused and overwhelmed by loads of information on the web, so they simply stop pursuing their goal! That&#039;s a shame, isn&#039;t it?</p><p>I designed this course based on <strong style=\"\">my personal experience and knowledge </strong>as well as on my workshops and DVD. <strong style=\"\">Both have helped</strong> <strong style=\"\">numerous students all around the country</strong> and they can help you work your way around the globe too!</p><p>You will get <strong style=\"\">life-time access</strong> to all lectures and all the updates in the future. Futhermore, there is Udemy&#039;s and mine <strong style=\"\">30-day money back guarantee</strong>, so there&#039;s nothing you can lose :) Sign up <strong style=\"\">TODAY at a better price!</strong></p><p><em style=\"\">This course will be constantly updated!</em></p>", 
    "end_date": null, 
    "title": "Work Your Way Around the World - Proven Tips for Travellers", 
    "price": "20.00", 
    "instructors": "Tina  Grilc", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/335492_60e2_3.jpg", 
    "course_url": "https://www.udemy.com/advance-your-skills-by-travelling-the-world-and-having-fun/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-04T08:30:04Z"
}