{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong style=\"\">Preview</strong></p><ul style=\"\"><li>Get best airfare to dream destinations with a single click.</li><li>Rent castles, villas &amp; islands for less than a hotel room.</li><li>Go on a private safari for less than $1000 per person.</li><li>Hire world&#039;s leading private guides at an amazing price.</li></ul><p><strong style=\"\">What you will learn?</strong></p>  <p>  \t    The aim of this course is to equip students with the skills needed to book and plan their travel using the Internet without relying on travel experts. At the end of this course, students will be able to book their own journeys without expert assistance. In fact, they will likely become a travel authority who are able to help and guide others. Case studies, examples and comparison tables enable students to review the value of learned content by comparing it with the best travel deals advertised on the Internet.. A free preview of lectures on hotel industry should help visitors evaluate if this is a good course to study.  </p>  <p><strong style=\"\">Excerpt from the course</strong></p>  <p><em style=\"\">Hotel Bookings</em></p><p>Learn how you can get a room with a view around almost any major landmark at a reasonable price.  </p>  <p><em style=\"\">Airfares</em></p><p>  \t          Find best airfare deals with a click of your mouse. Visualize the best days to travel, date to travel and compare prices with other weeks and months -- Instantly.  </p><p><em style=\"\">Car Rentals</em></p>  <p>  \t          Rent exotic cars or any vehicle at a 50% or greater discount than advertised on the popular Internet websites.  </p><p><em style=\"\">Tours &amp; Trip Planning</em></p>  <p>  \tEnjoy your own <strong style=\"\">private tour</strong> at a better quality and price than similar escorted tours from popular tour operators.  </p><p><strong style=\"\">&amp; Much More...</strong></p>", 
    "end_date": null, 
    "title": "World's Greatest Travel Bargains", 
    "price": "20.00", 
    "instructors": "Umair Asif", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382054_e2dd_2.jpg", 
    "course_url": "https://www.udemy.com/world-greatest-travel-bargains/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T08:55:09Z"
}