{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t               Этот курс создан для умных путешественников. В нем собраны все самые ценные советы о том, как передвигаться по городу, что посмотреть обязательно, а что интересно, но дополнительно, спланировано в зависимости от количества дней в вашей поездке.  </p>  <p>  \t               Если вы хотите посмотреть все самое интересное, в том числе то, о чем не пишут в туристических гидах, не переплачивать глупо за проезд и за транспорт и не хотите тратить время на подготовку к путешествию, этот курс для вас!  </p>  <p>  \t               На данный момент я живу в Париже, очень его люблю, облазила все уголки этого прекрасного города! В этом гиде я собрала ценнейшую сконцентрированную информацию о всем том, что нужно знать, чтобы ваше пребывание в Париже было просто незабываемым!  </p>  <p>  \t               Вы узнаете, как купить билеты дешевле и без очереди на многие достопримечательности, как посещать экскурсии бесплатно, а также что обязательно нужно попробовать и где в Париже!  </p>  <p>  \t               На мой взгляд, самым ценным разделом этого гида является даже не столько информация как сэкономить, а именно где покушать. Я советую многие вкуснейшие места, которые вы не найдете в гидах, их нужно знать только от местных. Для вашего удобства, помимо видео, вы получите также и карту данных ресторанов.  </p>  <p>  \t               Всю информацию в удобном видео формате можно посмотреть за один вечер за чашечкой чая, вместо того, чтобы месяц рыскать по английским и французским сайтам. Да и то, всю информацию вы там не найдете, многое нужно знать от местных, спрашивать их, жить там.  </p>  <p>  \t     В качестве бонуса вы также получите видеоматериал о том, как купить билет в Диснейленд минимум на 20 евро дешевле,  чем на официальном сайте (абсолютно легально конечно, просто далеко не все знают этот способ)! А так же мою авторскую экскурсию по неизвестному Монтмартру. Сакре-Кёр - одно из красивейших мест в городе! И, если вы не хотите толпиться с туристами на тех же улицах, вам понравится моя карта, в которой вы пойдете по специально разработанному маршруты и узнаете все секреты квартала, где в свое время жили Пикассо и Ван Гог!  </p>  <p>  \t               Так же, при покупке данного курса (доступ к нему и всем обновлениям для вас пожизненен и бесплатен) можно задать индивидуальный вопрос в форуме, я на него с удовольствием отвечу!  </p>", 
    "end_date": null, 
    "title": "Путешествие в Париж!", 
    "price": "20.00", 
    "instructors": "Yulia Miss Tourist", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286914_cf45_2.jpg", 
    "course_url": "https://www.udemy.com/paristrip/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-24T11:50:05Z"
}