{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t                  Этот курс создан для умных путешественников. В нем собраны все самые ценные советы о том, как передвигаться по городу, что посмотреть обязательно, а что интересно, но дополнительно, спланировано в зависимости от количества дней в вашей поездке.  </p>  <p>  \t                  Если вы хотите посмотреть все самое интересное, в том числе то, о чем не пишут в туристических гидах, не переплачивать глупо за проезд и за транспорт и не хотите тратить время на подготовку к путешествию, этот курс для вас!  </p>  <p>  \t                  Я жила в Риме 2 самых лучших года в своей жизни, за это время облазила все уголки этого прекрасного города! В этом гиде я собрала ценнейшую сконцентрированную информацию о всем том, что нужно знать, чтобы ваши Римские каникулы были просто незабываемыми!  </p>  <p>  \t                  Вы узнаете, как купить билеты дешевле и без очереди на многие достопримечательности, как посещать экскурсии бесплатно, а также что обязательно нужно попробовать и где в Риме! На мой взгляд, самым ценным разделом этого гида является даже не столько информация как сэкономить, а именно где покушать. Я советую многие вкуснейшие места, которые вы не найдете в гидах, их нужно знать от местных. Для вашего удобства, помимо видео, вы получите карту данных ресторанов.  </p>  <p>  \t                  Всю информацию в удобном видео формате можно посмотреть за один вечер за чашечкой чая, вместо того, чтобы месяц рыскать по английским и итальянским сайтам, да и то, всю информацию вы там не найдете, многое нужно знать от местных, спрашивать их, жить там.  </p>  <p>  \t                  Так как я очень люблю итальянскую еду, и попробовала ее во всех уголках Италии, я включила в курс бонус. Бонус – гастрономическое путешествие по Италии – обзор традиционной еды по всем регионам! Количество вкусных картинок зашкаливает, ужин перед просмотром настоятельно рекомендован!  </p>  <p>  \t          Так же, при покупке данного курса (доступ к нему и всем обновлениям для вас пожизненен и бесплатен) можно задать индивидуальный вопрос в форуме, я на него с удовольствием отвечу!  </p>  <p>  \t    Ciao!  </p>  <p>  \tThis course is created for smart travelers. We included the most valuable advices of how to move around in the city, what are the most important things to see, and places that are not that touristic , but definitely worth a visit!  </p>  <p>  \tIf you want to discover everything in Rome, including the stuff you won’t find in tourist guide, if you do know want to pay for overpriced frozen untasty food and save your time not standing in queues – this course if for you!  </p>", 
    "end_date": null, 
    "title": "Римские каникулы - с пользой, интересно и не затратно!", 
    "price": "20.00", 
    "instructors": "Yulia Miss Tourist", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285224_9ace_3.jpg", 
    "course_url": "https://www.udemy.com/romatrip/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-21T14:05:04Z"
}