{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Этот курс создан для умных путешественников. В нем собраны все самые ценные советы о том, как передвигаться по стране, что посмотреть обязательно, а что интересно, но дополнительно, спланировано в зависимости от количества дней в вашей поездке.</p><p>Если вы хотите посмотреть все самое интересное, в том числе то, о чем не пишут в туристических гидах, не переплачивать глупо за проезд и за транспорт и не хотите тратить время на подготовку к путешествию, этот курс для вас!</p><p>Я живу в Париже уже достаточно продолжительное времяи, за это время облазила все уголки этого прекрасного города и страны! В этом гиде я собрала ценнейшую сконцентрированную информацию о всем том, что нужно знать, чтобы ваши французские каникулы были просто незабываемыми!</p><p>Вы узнаете, как купить билеты дешевле и без очереди на многие достопримечательности, как посещать экскурсии бесплатно, а также что обязательно нужно попробовать и где во Франции! На мой взгляд, самым ценным разделом этого гида является даже не столько информация как сэкономить, а именно где покушать. Я советую многие вкуснейшие места, которые вы не найдете в гидах, их нужно знать от местных. Для вашего удобства, помимо видео, вы получите карту данных ресторанов.</p><p>Всю информацию в удобном видео формате можно посмотреть за один вечер за чашечкой чая, вместо того, чтобы месяц рыскать по английским и французским сайтам, да и то, всю информацию вы там не найдете, многое нужно знать от местных, спрашивать их, жить там.</p><p>Так же, при покупке данного курса (доступ к нему и всем обновлениям для вас пожизненен и бесплатен) можно задать индивидуальный вопрос в форуме, я на него с удовольствием отвечу!<br></p>", 
    "end_date": null, 
    "title": "Самостоятельное путешествие по Франции", 
    "price": "20.00", 
    "instructors": "Yulia Miss Tourist", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648720_447e_2.jpg", 
    "course_url": "https://www.udemy.com/franciyasamostoyatelno/", 
    "currency": "USD", 
    "subject_name": [
        "Travel"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T09:50:35Z"
}