{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>In 2010, forty-four states and the District of Columbia adopted the Common Core State Standards in Language Arts and Mathematics to establish consistent educational standards across the United States to ensure high school graduates are prepared for college and the work place. Unfortunately, the Common Core Standards are not very clearly written. This course is designed to help parents and teachers navigate and understand the 2nd Grade Common Core Mathematics Content Standards. The goal of this course it to provide you with a resources that you can go to when ever you find that one of the math standards is confusing.  </p><p>The course includes 44 supplemental worksheets provided in .pdf form to help students practice and deepen their understanding of many of the content standards. Many parents are confused over state and national standards for mathematics and frustrated with the lack of resources from schools and districts to support their students learning at home and during school breaks. Other parents are embarrassed to express their own lack of understanding of mathematics and their inability to provide assistance to their own school aged children. In this course, the 2nd Grade Common Core Mathematics Standards are explained in detail, simplified and broken down with step-by-step instruction. This course will demystify and simplify the 2nd Grade Math Common Core Standards.</p>", 
    "end_date": null, 
    "title": "2nd Grade Math Common Core Content Standards", 
    "price": 0, 
    "instructors": "Jeremy Sayers", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526556_761f_4.jpg", 
    "course_url": "https://www.udemy.com/2nd-grade-common-core-content-math-standards/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-12T04:18:09Z"
}