{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Hi everyone, I am Jimmy Ling, a Mathematics teacher in Singapore with more than 10 years of teaching experience. When I am teaching Primary School students, I realised that many of them have difficulties in solving problem sums. </p><p>There are 8 methods which you must know in order to do well for your Mathematics exams. You must learn to first UNDERSTAND the question, then IDENTIFY the method to solve the question, followed by APPLY the method correctly.  </p><p></p><p><strong>What is this course about?</strong></p><p>- Learn the 8 Must Know Methods for Primary School Mathematics Problem Sums</p><p>- Recognise the correct method to use when solving problem sums</p><p>- Learn how to check your answers</p><p>- Learn how to avoid common mistakes </p><p>- Unlimited lifetime access to this course, (rewind and re-watch it anytime you want)</p><p>- Unlimited support from me (Ask me any Math problem sums and I will be glad to help you)</p><p><strong>Structure of the course</strong></p><p>- 28 Videos with examples to explain the 8 methods</p><p>- After each method, worksheets with questions which use the same method are given</p><p><strong>How to learn from this course?</strong></p><p>- I will teach the 8 methods using videos with examples</p><p>- Watch the videos, rewind and watch again and make sure you understand the 8 methods</p><p>- After each method, practice the worksheet given to reinforce your understanding</p><p>- Ask whenever you need help</p><p><strong>Who should attend this course?</strong></p><p>- Singapore Primary 5 and 6 Students</p><p>- Elementary school final year students outside Singapore</p><p>- Parents who want to help their children in their studies </p><p><strong>What is required?</strong></p><p>- A basic understanding of fractions, ratios, percentage and whole numbers</p><p>- Understand simple English</p><p>- Most importantly, a mind which is keen to learn!</p><p><strong>Why take this course</strong></p><p>- To score well for your Mathematics Exams!</p><p>- Learn at your own pace, you can rewind and re-watch the videos again to make sure you understand,</p><p>- Learn anywhere, and anytime you want!</p><p></p><p><strong>I will appreciate any reviews and feedback!</strong></p><p>I created this course initially for Singapore Primary level students. Singapore students are well know for producing top standards in Mathematics, so I will like to share the methods taught in Singapore to students over the world. I think it will be very useful for students in their Elementary level.</p><p>In order to help me improve my future Mathematics course, can you tell me which country you are from and how this methods can apply to your Mathematics in your country?</p><p>I will also appreciate if you can write a review for my course and rate it.</p>", 
    "end_date": null, 
    "title": "8 Must Know Methods for Solving Math Problem Sums", 
    "price": "45.00", 
    "instructors": "Jimmy Ling", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528666_c9e9_6.jpg", 
    "course_url": "https://www.udemy.com/8-must-know-methods-for-solving-math-problem-sums/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T16:18:22Z"
}