{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to my <strong>\"Revolutionary Fast Track Arithmetic Course\"</strong>. This course has been meticulously designed over the course of many years specially for those student who find it hard to complete Quantitative tests in given stipulated time.</p><p>This <strong>Exam Oriented</strong> course has been be specially designed after intensive research keeping in mind the requirements of students for various exams. </p><p>I have adopted a new easy to Understand Layout for this course. Each Chapter will have an <strong>\"Introduction\"</strong> followed by a detailed \"<strong>Descriptive Section\"</strong> and then ends with most important section<strong> \"Fast Track Section\" </strong>which provide students with some invaluable tricks and shortcut techniques to help them solve same problems much faster  compared to traditional methods.<br><br>Important Notice : Many More Sections to be Uploaded in coming weeks - Stay tuned !!<br><br>Sections to be added <br><br>1. Number System - Done<br>2. HCF and LCM - Done<br>3. Square and Cube Roots : Will be Uploaded before 20th Nov.<br>4. Simplification of complex mathematical Operations - Will be uploaded before 30th Nov.<br>5. Average - Will be uploaded before 30th Nov.<br>6. Percentage - Will be uploaded before 30th Nov.<br>7. Simple and Compound Interest - Will be uploaded before 15th Dec.<br>8. Profit and Loss - Will be uploaded before 15th Dec.<br><br></p><p>Regular Discussions and Quizzes will be held regularly every month.</p>", 
    "end_date": null, 
    "title": "A basic Arithmetic Course", 
    "price": "20.00", 
    "instructors": "Er. Pranav Manhas", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630766_ff96_4.jpg", 
    "course_url": "https://www.udemy.com/revolutionary_fast_track_arithmetic_series/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T22:03:08Z"
}