{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This course introduces quantum mechanics in completely non mathematical way. It starts with a brief history of quantum mechanics followed by some of the great successes of quantum mechanics to explain the behavior of atoms and some of most fascinating phenomenon discovered by physicists in the last century such as super fluids, super conductors and condensates of cold atom gases. Then we talk about the fruits of quantum mechanic such as the <em>micro chip</em>, <em>MRI</em> and the <em>laser.</em> It concludes with a discussion of the application of quantum mechanics to understand all the fundamental laws of nature in our universe in of including the <em>theory of everything</em>, the <em>god particle</em> and <em>multiple universes.</em> Some speculations about the nature of human mind are also mentioned.</p><p>The course terminology would be mostly non technical. No mathematical equations would be used and the few technical terms that are introduced, would be fully explained in lay man's terms. Anyone with a high school science back ground should be able to follow the course content. </p><p>The whole course consists of four video lectures and each lecture is fifteen minutes long. All the content of the course is contained in these lectures. This course does not include any quizes or exercises.</p><p>The duration of the course is one hour. Each lecture is a fairly self contained unit. Even though it is recommended that one views the lectures in the order they are presented, each lecture can be viewed separately without much loss of coherence. </p><p>This course is recommended for anyone who has ever thought about the fundamental nature of our world, how it came into existence and how the various physical phenomenon are understood from a scientific point of view.</p><p><br></p>", 
    "end_date": null, 
    "title": "A Gentle Introduction to Quantum Mechanics", 
    "price": "25.00", 
    "instructors": "Dr. Sanjay Sood", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667072_3d65.jpg", 
    "course_url": "https://www.udemy.com/a-gentle-introduction-to-quantum-mechanics/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T19:31:13Z"
}