{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><br></p><p>This course prepares you to take your Masters of Business Administration degree. All business students have to take an introductory financial accounting course for one simple reason - accounting is the language of business. The terms used by business people such as capital, equity, assets, liabilities, revenue, net income etc. are all terms you will become very familiar upon completion of this course.</p><p><strong>Learn and Master the Financial Accounting Process. Part 1 of this course.</strong></p><ul><li>Understand that accounting is the language of business.</li><li>Know business terminology (biz speak).</li><li>Understand the difference between a  corporation and a single proprietorship.</li><li>Know the three forms of business - service company, merchandise company and a manufacturer.</li><li>Understand an Income Statement and how to prepare one.</li><li>Understand a Balance Sheet and how to prepare one.</li><li>Know how to analyse and record business transactions</li><li>Learn how to use debits and credits to record business transactions.</li><li>Know how to use the accounting journal and ledger,</li><li>Complete a set of accounting records for a service business using excel spreadsheets.</li></ul><p><span></span><strong>Learn and Master how to Read Financial Statements - Part 2 of this course.</strong></p><ul><li>Understand how to read the cash flow statement.</li><li>Learn  how to perform horizontal analysis on the Balance Sheet.</li><li>Learn how to perform Vertical analysis on the Income Statement.</li><li>Know how to analyse whether  a company is liquid..</li><li>Know  how to analyse whether a company  is solvent. </li><li>Know how to analyze a company's profitability.</li></ul><p><strong></strong></p><p>This course is unique in that it contains an excel project on a set of accounting records </p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Accounting you need to know to be ready for the MBA", 
    "price": "20.00", 
    "instructors": "Dr. John Mclellan", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655466_75e2_7.jpg", 
    "course_url": "https://www.udemy.com/accounting-you-need-to-know-for-the-mba/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T12:34:50Z"
}