{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Want to ace the AP Statistics exam and also do well in your class? Maybe you are taking an elementary or introductory statistics course in college and need the extra help.  We'll help you do it with 90 lessons, including several hours of illustrated lecture video, several worked-out example questions, and a complete understanding of the graphing calculator and its statistical capabilities.</p><p>Each lesson also comes with a downloadable word document of course notes to help you learn the material as you watch the video lessons.</p><p>Although our course is catered towards high school students taking the AP test, college students in a first year statistics course will also find this class life-saving.</p><p>Did we mention you'll also have an awesome teacher?</p><p>Jerry Linch obtained his B.S. in Mathematics from the University of Nebraska and M.S. in Statistics from the University of Houston Clear Lake.  With several years of practice in the actuarial field, he has an excellent understanding of the material and can explain the concepts at a level which any entry level student can understand.  If you want a comprehensive course of all the AP Statistics topics and most all elementary statistics topics covered in a college course and explained with ease, then this course is for you.<em></em></p>", 
    "end_date": null, 
    "title": "ACE the AP Statistics Exam and MASTER Elementary Statistics!", 
    "price": "20.00", 
    "instructors": "Jerry Linch", 
    "commitment": "22.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656736_c22b_3.jpg", 
    "course_url": "https://www.udemy.com/ap-statistics-and-elementary-statistics-video-series/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T04:04:27Z"
}