{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t   This course is an introduction to the basic principles and skills of algebra. Topics include:  </p>  <ul>  \t<li>Expressions</li>  \t<li>Exponents </li>  \t<li>Linear Equations in one variable </li>  \t<li>Linear Equations in two variables </li>  \t<li>Absolute Value Equations </li>  \t<li>System of Linear Equations</li>  \t<li>Inequalities</li>  </ul>  <p>  \t   The course contains a series of  video tutorials that are broken up into various levels. Each video builds upon the previous one. These videos can be used as a supplement to your current Algebra 1 class or as a stand alone course.  </p>  <p>  \t  The course also contains a Diagnostic Test on Algebra and Functions. This test is an essential part of the course. The purpose of the test is to help find your strengths and weaknesses. As a bonus, the test has questions on basic Functions.  </p>  <p>  \t The course contains 108 minutes of video content plus an additional 20 minutes for the Diagnostic Test for a total of 128 minutes.  </p>  <p>  \t The course primarily targets students who are preparing to take the ACT, CXC CSEC and SAT Maths Test with a focus on the Algebra Section of these test. However, other individuals who wishes to learn basic Algebra principles and skills can benefit from this course.  </p>  <p>  \t This course is consistently monitored/ review and i am ready to answer your questions. Solutions and Review of the Diagnostics Test are available to any student of this course upon request.  </p>", 
    "end_date": null, 
    "title": "ACT, SAT And CXC CSEC Math: Algebra Mastery", 
    "price": "20.00", 
    "instructors": "Easton Olliviere", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259930_2be4_2.jpg", 
    "course_url": "https://www.udemy.com/act-sat-and-cxc-csec-math-algebra-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-11T22:39:05Z"
}