{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<em><em><strong>Course Updated On : 05th May 2016</strong></em><strong></strong></em>  </p>\n\n<p> <strong><em>Top Vedic Math Course on Udemy!</em></strong><strong> Vedic Mathematics</strong> is the name given to the ancient system of Indian Mathematics which was rediscovered from the Vedas between 1911 and 1918 by Sri Bharati Krsna Tirthaji (1884-1960). According to his research all of mathematics is based on sixteen Sutras, or word-formulae. For example, 'Vertically and Crosswise` is one of these Sutras. These formulae describe the way the mind naturally works and are therefore a great help in directing the student to the appropriate method of solution. <br></p><p>  \tIn the Vedic system 'difficult' problems or huge sums can often be solved immediately by the Vedic method. These striking and beautiful methods are just a part of a complete system of mathematics which is far more systematic than the modern 'system'. Vedic Mathematics manifests the coherent and unified structure of mathematics and the methods are complementary, direct and easy.  </p>\n\n<p><strong>Top Three reasons to TAKE THIS COURSE right now!</strong></p>\n\n<ol><li>You get lifetime access which comprises 3+ hours of new lectures with new sections to be added soon in 2015!</li><li>I'll be at your disposal throughout this course so don't hesitate to ask me any doubts and you'll see me respond to every single one of them thoughtfully!</li><li>What you will learn in this course is different <strong>Advance Vedic Math tricks</strong> which will make you're life easy by generalizing the trick to solve complex math problem right away!</li></ol>\n\n<p>  \tIn this course, i have tried to <strong>generalize </strong>the math tricks, so the different tricks that you'll learn in this course will be applied to all the number without any restriction of number range.  </p>\n\n<p>  \t                <strong>Topics Covered:</strong></p>\n\n<p>  \t                In the this course you will learn to speed up:-  </p>\n\n<p>  \t                · High Speed Multiplication using Base Method Multiplication.  </p>\n\n<p>  \t                ·Finding Squares  </p>\n\n<p>  \t· Finding Cubes  </p>\n\n<p>  \t · Instant Subtractions  </p>\n\n<p>  \t                · Square Roots  </p>\n\n<p>  \t                · Cube Roots  </p>\n\n<p>  \t                · Faster Division  </p>\n\n<p>  \t                · Accelerated Addition  </p>\n\n<p>  \t                · Digital Roots  </p>\n\n<p>  \t                · Calendars  </p>\n\n<p>  \t              Many More Topics To be Added In Time To Come...  </p>\n\n<p>  \tTo get the most out of this course is to practice it rigorously when ever your are introduced to a new concept or a new trick you need to practice first on a notebook book and once you get the grip of it you can start mentally solving it.  </p>\n\n<p>  \tIt would take 30 days to complete the course when done with full dedication and rigrous practice.  </p>\n\n<p><strong>And the unconditional, Udemy backed, 30 day money-back guarantee is not just any old guarantee, it's my personal promise there is a ZERO risk in taking this course.</strong></p>\n\n<p><strong>So Hurry </strong>Click on <strong>TAKE THIS COURSE </strong>now to get started!<strong> Before you Miss! this awesome offer.</strong></p>", 
    "end_date": null, 
    "title": "Advance Vedic Math: Increase your Calculation Speed upto10x", 
    "price": "20.00", 
    "instructors": "Jimmy Razo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/114616_e7a9_13.jpg", 
    "course_url": "https://www.udemy.com/advance-vedic-math/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-03T12:26:09Z"
}