{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t   Welcome to Algebra for A-Level Maths. This course is designed to support students who are taking A-Level Mathematics with the algebraic skills required to study Mathematics at a higher level.  </p>  <p style=\"\">  \t   As an 11-19 Mathematics teacher I am regularly faced with having to go over algebra studied at GCSE level before moving onto the new, more difficult Mathematics. The idea of this course is for students to independently review previously taught algebra enabling more time in lessons to be spent on grasping new topics. This course is also suitable for students looking at the higher grades at GCSE level too.  </p>  <p style=\"\">  \t   I have selected some of the GCSE topics that regularly appear at A- Level and produced a video showing examples followed by questions and answers. There is also a mini test at the end of each section.  </p>  <p style=\"\">  \t  You will learn how to  </p>  <ul style=\"\">  \t<li style=\"\"> Solve equations with the unknown on both sides</li>  \t<li style=\"\"> Solve equations with fractions</li>  \t<li style=\"\"> Solve a quadratic equation</li>  \t<li style=\"\"> Sketch a quadratic</li>  \t<li style=\"\"> Use The Formula to solve a quadratic</li>  \t<li style=\"\"> Complete the square</li>  \t<li style=\"\"> Solve simultaneous equations (both linear)</li>  \t<li style=\"\"> Solve simultaneous equations (one linear and one quadratic)</li>  \t<li style=\"\"> Rearrange equations</li>  </ul>  <p style=\"\">  \t   Learning Mathematics can not be achieved by passively reading. You need to actively learn Mathematics so make sure you have a pen and some paper at hand! I hope you enjoy the course and find it useful in your mathematical studies. Good luck!  </p>", 
    "end_date": null, 
    "title": "Algebra for A-Level Maths", 
    "price": 0, 
    "instructors": "Adam Goodridge", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112704_149a_6.jpg", 
    "course_url": "https://www.udemy.com/algebraforalevelmaths/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-30T11:19:49Z"
}