{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to <strong>Algebra Foundations for Calculus</strong>! In this course, you'll learn the foundational Algebra principles needed to be successful in Calculus.</p><p><strong>Instructors:</strong></p><ul><li><strong>Arun Sharma, PhD, Calculus professor at UC Berkeley</strong><br>After majoring in math, Arun got his PhD in pure mathematics from UC Berkeley in 2009. Since 2010 he has been teaching introductory math classes at UC Berkeley. Because of this, he intimately understands the areas in which students struggle. He feels many students entering college math classes are not as prepared in Algebra as they should be. Because of this, he is excited to offer this course to help ensure students succeed in Calculus and beyond. A fun fact about Arun is that he is highly ranked in chess and runs the US Chess League.</li><li><strong>Katie Kormanik, CEO, TURN THE WHEEL</strong><br>Katie designs the courses, selects the experts and leaders the courses feature, and creates all the engaging content that you’ll see when you sign up. She is passionate about education and particularly excited about the potential of online learning. She has designed courses for Udacity, Stanford Graduate School of Business, and McKinsey Academy. Click here to see samples of her work. She has consulted for a number of education non-profits, start-ups, and for-profit companies on product development, curriculum development, pedagogy, and investments in edtech. And of course, she has been an educator in a number of capacities, from tutoring to teaching supplemental college courses, after-school programs, and summer school programs. Her two greatest passions are learning and making learning fun for others.</li></ul><p>In this course, you'll watch videos in which Arun and Katie explain concepts and work through examples. We also provide many practice exercises so you can solidify what you're learning. Remember, learning math is just like learning a language, and the goal of this course is to make you fluent. Or, at least conversational. :)</p><p><strong>A few tips as you work through this course:</strong></p><ul><li>Re-watch the videos to refresh your memory</li><li>Keep a pen and paper with you so you can do the exercises</li><li>Pause the videos occasionally to give you time to process the concepts</li><li>There's no need for calculators. This course is less about performing basic calculations and more about understanding the principles</li></ul><p><strong><em>For a limited time, we are offering the course half-off ($49) to students in exchange for detailed feedback in order to make the course even better. Use the coupon code </em>ALGFOUNDATIONS-HALFOFF4FEEDBACK.</strong></p>", 
    "end_date": null, 
    "title": "Algebra Foundations for Calculus", 
    "price": "45.00", 
    "instructors": "TURN THE WHEEL Inc", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600032_7e7f_3.jpg", 
    "course_url": "https://www.udemy.com/algebra-foundations-for-calculus/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T03:52:49Z"
}