{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Es un curso introductorio al Álgebra Lineal que facilitará la aprobación de cursos universitarios. </p><p>Dirigido a estudiantes universitarios de Ciencias e Ingeniería y Ciencias Económicas, que estén a punto de tomar su primer curso de Algebra Lineal,  y a aquellos que sin ser profesionales de estas rama se interesen en ampliar sus conocimientos de Matemática.</p><p>En las universidades el Algebra lineal  es un tema nuevo ya que los cursos de materias como el cálculo tienen mas de 100 años en el currículo universitario, mientras que en algunas universidades el álgebra lineal no tiene mas de 20 años como materia universitaria. Por ello generalmente la presentan como una materia abstracta e incomprensible. Este curso presenta el álgebra lineal de una manera práctica, clara y sencilla. </p><p>Al inscribirse en el curso podrá plantear preguntas relacionadas con el tema y participar en las videoconferencias adicionales de ampliación de conocimientos que se ofrecen a los participantes. </p><p>El curso cubre los siguientes temas básicos:</p><p>1. Las matrices: Operaciones. Propiedades. Ejemplos de aplicación</p><p>2. Matriz inversa. Matriz no singular.</p><p>3. Una explicación completa del método de Gauss y sus aplicaciones incluyendo solución de problemas de redes eléctricas.</p><p>4. Determinantes y regla de Cramer: Cálculo de determinantes por métodos de reducción y solución de sistemas de ecuaciones lineales</p><p>En los motores de búsqueda este curso se puede conseguir con las siguientes clases y etiquetas: algebra, lineal, matrices, gauss, gauss jordan, solución, sistemas de ecuaciones, matriz adjunta, regla sarrus, determinantes, propiedades, leyes.</p><p>Incluye ayudas teóricas y de aplicaciones en formatos PDF y Power Point, e hipervínculos a documentos de soporte en la nube que se irán ampliando en las siguientes versiones.</p><p>El curso se puede completar comodamente en 4 semanas o menos.</p><p> El profesor José Arturo Barreto es graduado en Matemáticas en la Universidad del Valle en Cali, y Master en Matemáticas de la Universidad de Texas en Austin. Una de sus especialidades es el Algebra Lineal por lo cual puede responder cualquier tipo de pregunta avanzada y orientarle hacia niveles superiores</p><p>Es un curso gratuito. Agradezco sus mensajes y comentarios para indicar como le parece sus ventajas y deficiencias y cuales temas de Matemáticas desea que sean tratados en este y otros cursos </p>", 
    "end_date": null, 
    "title": "Algebra Lineal. Matrices y sus aplicaciones", 
    "price": 0, 
    "instructors": "Profesor José Arturo Barreto. Jose Barreto", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702424_08ba_2.jpg", 
    "course_url": "https://www.udemy.com/algebra-lineal-matrices-y-sus-aplicaciones/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T22:58:41Z"
}