{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>With over 1,600 students enrolled, this module is the first of five on how to build robots.  In this module 1 course, you will build electronic circuits, actually make some electronic components from scratch, learn about electricity, soldering skills, and basic analog electronics.  You'll need some basic math skills and that's it! No prior knowledge of electricity of electronics is required, and yet by the end of this course you'll have built functioning electronic circuits like light flashers, sound effects, and controlling the roboticist's best friend, the servo motor which is a motor that turns to a specific direction at your command.  <strong>All courses have closed captions for the hearing impaired.</strong></p>\n\n<p><strong><br></strong></p>\n\n<p><strong>Course materials:</strong></p>\n\n<p><strong>You will need electronic parts and a breadboard, which you can purchase as an accompanying kit (the Analog Electronics Kit) or provide your own. </strong></p>\n\n<p><strong>The first section of the course explains what the tools and parts are and what you will need if you are supplying your own electronic parts.  </strong></p>\n\n<p><strong>Tools needed: a multimeter, soldering iron and solder, wire, </strong></p>\n\n<p>This course is the prerequisite for the part II course which is digital electronics where you will work with a computer-on-a-chip and hook that computer up to the real world.  In part III you'll learn both physics and robotic drive systems, and gain a wide variety of skills in prototyping so you can actually build your own robots and manufacture your own parts.  In part IV, you'll culminate all you've learned as you build a 3D printer from scratch, hook it up to a desktop computer and make your own plastic parts.  The 3D printer is, in effect, a robot which you can then use to make parts for your other robot designs.</p>", 
    "end_date": null, 
    "title": "Analog electronics - Robotics, learn by building", 
    "price": "50.00", 
    "instructors": "Ian Juby", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655940_ef77_2.jpg", 
    "course_url": "https://www.udemy.com/analog-electronics-robotics-learn-by-building/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T23:07:58Z"
}