{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This is a course in the physiology of animals, or, to use a common phrase, how animals work. \n\n  </p>\n\n<p>Animals are, in one sense, machines, and the aim of the science of physiology is to understand how these machines function—what drives them, how they operate, the interaction of the various systems they comprise, and the physical and chemical constraints on how they work.  \n\n  </p>\n\n<p>Animals are also organisms, and this course is intended to help you understand how animals work as integrated units, <em>i.e.</em> as organisms. We will be concerned with how organisms’ various components work to keep an animal alive, with how these are coordinated, and how the various types of animals, despite their disparate evolutionary histories, solve common physiological problems, sometimes in remarkably innovative ways. \n\n  </p>\n\n<p>This course is intended for the upper-division biology student. It is also a good course for graduate students and practicing professionals looking for a brush-up course in animal physiology. I presume that you come into this course with the background in chemistry, physics, mathematics and biology that can be reasonably expected of a senior biology student. \n\n  The course consists of about five hours of video clips, parceled into six lectures. This is the first module of four similar courses. This module covers respiration. Subsequent modules cover blood and circulation; digestion and metabolism; and heat and water balance. All four comprise one semester of a two-semester course in animal physiology.</p>", 
    "end_date": null, 
    "title": "Animal Physiology 1. Respiration and gas exchange", 
    "price": "20.00", 
    "instructors": "Prof. Scott Turner", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724028_0fdc.jpg", 
    "course_url": "https://www.udemy.com/animal-physiology-1/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T14:04:43Z"
}