{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t          This course includes 23 Video lectures and several handouts designed to introduce you to the hobby of Backyard Astronomy.  </p>  <p style=\"\">  \t          The Course is delivered in to 6 easy to digest sections, to fit in to your busy schedule  </p>  <p style=\"\">  \t          If you are curious about the Night Sky and want to learn more, this is a great  course to get you out and observing in the shortest possible time with the maximum enjoyment.  </p>  <p style=\"\">  \t          This course is a follow-up to an &quot;Introduction to Stargazing&quot;, in this course we will continue our exploration of the Night Sky by learning more about the constellations.  </p>  <p style=\"\">  \t    In the first section we will learn what the constellations are, where they came from and explore the lore of the constellations.  </p>  <p style=\"\">  \t          We will learn about the zodiac, the original constellations set  </p>  <p style=\"\">  \t          The 44 Greek constellations from Ptolemy&#039;s Almagest  </p>  <p style=\"\">  \t          Then we will explore a little of the mythology of the constellations  </p>  <p style=\"\">  \t          Once we have a fair understanding of what the constellations are and where they came from ..  </p>  <p style=\"\">  \t          We will explore the Key constellations month by month and tour the interesting objects you can see in each, with a pair of binoculars or a small telescope.  </p>  <p style=\"\">  \t          I have divided the exploration of the constellations in to four sections for convenience.  </p>  <p style=\"\">  \t          Each section will cover 3 months and represent a &quot;season&quot;  </p>  <p style=\"\">  \t          Remember season are reversed between the Northern and Southern Hemisphere  </p>  <p style=\"\">  \t          so the section covering the Northern Hemisphere Spring, will also cover the Southern Hemisphere Fall  </p>", 
    "end_date": null, 
    "title": "Backyard Astronomy II", 
    "price": "20.00", 
    "instructors": "Rod Miller", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251034_92e6_5.jpg", 
    "course_url": "https://www.udemy.com/backyard-astronomy-2/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T17:21:59Z"
}