{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to the course Basics of Statistics - A Comprehensive Study.</p>\n\n<p>Statistics is required in every walk of business life to take decisions. When we take decision, it should be an informed one. Once we have statistics, we can be sure that decision is taken considering various factors. In this course, you will learn about the basics of statistics in depth covering</p>\n\n<p>a) Introduction to Statistics;</p>\n\n<p>b) Collection of Data;</p>\n\n<p>c) Presentation of Data;</p>\n\n<p>d) Frequency Distribution;</p>\n\n<p>e) Measures of Central Tendency covering Arithmetic Mean, Median and Mode</p>\n\n<p>f) Measures of Dispersion covering Range, Quartile Deviation and Standard Deviation</p>\n\n<p>g) Correlation </p>\n\n<p>h) Regression.</p>\n\n<p><strong>This course is basically a bundle of other courses namely</strong></p>\n\n<p><strong></strong>i) Basics of Business Statistics</p>\n\n<p>ii) Statistics - Measures of Central Tendency</p>\n\n<p>iii) Statistics - Measures of Dispersion</p>\n\n<p>iv) Statistics and Correlation.</p>\n\n<p>If you are buying this course, make sure you don't buy the above courses. This course is structured in self paced learning style. Video lectures are used for delivering the course content. Numerous case studies were solved in hand written presentation.</p>\n\n<p><strong>Take this course to gain good knowledge in basics of statistics. (Please be guided that this course teaches Statistics only from Academic point of view. Hence, teaching style will be absolutely Academic based)</strong></p>", 
    "end_date": null, 
    "title": "Basics of Statistics - A Comprehensive Study (College Level)", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537890_a740.jpg", 
    "course_url": "https://www.udemy.com/basics-of-statistics-a-comprehensive-study/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T12:24:19Z"
}