{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong><em>UPDATED on AUGUST 09, 2015</em></strong></p><p><strong>Course description</strong></p><p><strong>Course is about Vedic method of doing faster calculations involving addition, subtraction, multiplication, squaring, cubing and division of numbers</strong>. Vedic math is the best Ancient Indian method to do calculations in less time and high accuracy. Students really enjoy while performing Vedic formula in Math.</p><p>This course includes Introduction to Vedic formulae and its sub formulae. Each and every formula is covered by sample problem to understand the method.</p><p><strong>Become human Calculator with Vedic mathematics. </strong></p><ul><li>Vedic mathematics is based on 16 formulae and 13 sub formulae.</li><li>These formula and sub formula is useful, many meanings, ubiquitous and extremely     effective.</li><li>Any problem in mathematics can be easily solved by these formulae.</li><li>In world of mathematics, Vedic mathematics is also known as mental math.</li></ul><p><strong>Who is the target audience?</strong></p><ol><li>Students who want to do faster calculation with lesser time.</li> <li>Teachers who want to explore new method of addition, subtraction, squaring, cubing         and multiplication.</li> <li>Parents who want to make their kids brilliant in addition, subtraction and multiplication.</li></ol><p><strong>What topics are covered in the course?</strong></p><ul><li>You will come to know about history of Vedic mathematics and who discovered the Vedic mathematics</li> <li>List of 16 formulae and their sub formulae with brief meaning.</li> <li>In this course 3 formulae and their sub formulae is explained in video tutorial with sample problem. These three formulae have variety of applications in addition, subtraction, squaring, cubing and multiplication.</li> <li>Formula-1 “<strong>Ekadhikina purvena</strong>\" , Formula-14 “<strong>Ekanyunena purvena</strong>\" and Formula-2 <strong>“</strong><strong>Nikhilam Navatashcaramam Dashatah\" and more.</strong><strong></strong></li></ul><p><strong> </strong><strong>How much content is included in the course?</strong></p><p>At this time you will get approximately 1 hour of content.</p><p><strong><em>Course is updated on monthly basis</em></strong> and you will get more content in next month.</p><p><em><strong>Hurry! The price will be increasing soon.</strong></em></p><p><strong>Are there any requirements or prerequisites to take the course?</strong></p><p>Basic understanding of addition, subtraction, multiplication and division by conventional method.</p><p><strong>What will you know, or be able to do, after completing the course?</strong></p><p><strong>Benefits of this course are:</strong></p><ul><li>Calculations will become very simple and small using Vedic mathematics formulae.</li><li>Time require to solve any problem is too short.</li><li>you will have have less mental pressure while doing math problem.</li><li>your confidence grows by checking answer using Vedic formula.</li><li>Your interest  towards mathematics increases, as a result you will achieves best in your    study.</li><li>You can find solution of long and complex calculation with little efforts.</li><li>Computation speed is increased by five times after practicing Vedic mathematics.</li><li>Your Brain/neocortex will start grow rapidly after learning Vedic mathematic.</li></ul>", 
    "end_date": null, 
    "title": "Become a Human Calculator with Vedic Mathematics ", 
    "price": "30.00", 
    "instructors": "Bharat Hassani", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285252_c28e_5.jpg", 
    "course_url": "https://www.udemy.com/highspeedmath-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-21T14:54:41Z"
}