{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>DO YOU WANT TO SAVE TIME AND MONEY?</strong></p>\n\n<p> Are you looking for a shortcut to learn the ENTIRE MODULE'S CONTENT in as little time as possible? </p>\n\n\n\n<p>Why spend money on personal mechanics tutors when you can get taught the entire modules content online for the same price as just one sitting with a tutor?</p>\n\n\n\n<p>I have done this exact course at university, so i am able to explain the concepts in a manner that students understand. Ultimately, i know how and why people struggle with mechanics, and I can help make it easier for you!<br></p>\n\n\n\n<p><strong>How is the course structured?</strong><br></p>\n\n\n\n<ol><li>Particle equilibrium</li><li>Rigid body equilibrium</li><li>Structural analysis</li><li>Centroids and second moments of area (inertia)</li><li>Internal forces in structural members.</li></ol>\n\n\n\n<p> <strong>Why enroll in \"Become a Mechanics Pro!\"</strong>?</p>\n\n\n\n<ul><li>Over 60 worked through examples with Very-Easy-to-Understand explanations.</li><li>Tips and tricks on how to study as well as how to save time in tests and exams.</li><li>Work at your own pace leaving you comfortable and confident for those final exams!</li></ul>\n\n\n\n<p>This course is perfect for anyone currently enrolled in a mechanics class, anyone planning to take it in the near future, or anyone who's interested in learning mechanics. So whether you're looking to just pass or get your distinction, this course will provide you with the necessary tools to help you reach your goals!<br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Become a Mechanics Pro!", 
    "price": "20.00", 
    "instructors": "UP Engineering Videos", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756024_31bd_4.jpg", 
    "course_url": "https://www.udemy.com/become-a-mechanics-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T14:43:11Z"
}