{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Ever wondered what Calculus really is? In this course, you will learn to master the basics of Calculus. This introductory calculus course will introduce you to the terminology, methods and tricks to become a successful Calculus student. </p><p><strong>Master Calculus and Pre-Calculus Algebra </strong><br></p><p>The course is structured with:</p><ul><li>Pre-calculus algebra such as solving linear, polynomial and trigonometric expressions.</li><li>Differentiation of most simple functions using both first principles and derivative rules.</li><li>Integration of polynomial, trigonometric and exponential functions using integration rules.</li></ul><p><strong>Course Includes Fully Worked Solutions and Video Examples</strong></p><p>I have designed this course to be perfect for beginners and will take you through everything that you need. This easy to follow course includes 2 hours of video to teach you the concepts, narrated examples to demonstrate Calculus techniques, practice problems with fully worked solutions and quizzes which assess student's abilities to understand and use the concepts on their own.</p><p>By the end of this course, you will be able to understand and interpret algebraic, differentiation and integration processes. This will provide you with a solid foundation in Calculus for you to be able to progress your studies with further Calculus courses.</p>", 
    "end_date": null, 
    "title": "Beginner Calculus", 
    "price": "20.00", 
    "instructors": "How To Know Everything", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730642_12e8_5.jpg", 
    "course_url": "https://www.udemy.com/beginnercalculus/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-17T03:18:55Z"
}