{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><em><strong>Biophysical field methods online </strong></em>offers a practical approach to biophysical ecology, which applies physical concepts, principles and techniques to the interpretation of animal-environment interactions. These include how physical laws, such as the laws of thermodynamics, affect the abundance and distribution of animals and plants, the nature of microclimate, the ecological niche, and the integration of physiology and evolutionary ecology.</p>    <p>With specific ecological questions in mind, we aim to teach practical methods for reliably measuring temperature and humidity and their physical drivers in the field. Temperature and humidity are commonly reported in field studies, but they are usually measured with little attention to the physical principles that make the measurements meaningful and reliable. Without such attention, the results can be worse than meaningless: they can be misleading.</p>    The course is composed of seven lessons, each subdivided into several sections. The first third of the course deals with the physics of heat: energy, temperature, the differences between them and how biological systems are constrained by the laws of thermodynamics. Next the course delves into the physics of water, its colligative properties, and the energetics of phase changes from ice to liquid water and liquid water to water vapor. Then, the course focuses on the physics of water potential. All these concepts are tied together through their common currency—energy—and are demonstrated with several examples of how these concepts properly applied can lead to a deeper understanding of the organism and its environment.", 
    "end_date": null, 
    "title": "Biophysical Field Methods", 
    "price": "50.00", 
    "instructors": "Prof. Scott Turner, Berry Pinshow", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642268_6bb9.jpg", 
    "course_url": "https://www.udemy.com/biophysical-field-methods/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T09:31:02Z"
}