{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This Course Is Designed For Those Students Who Have Never Taken A Calculus Class But Have A Strong Background In Algebra And Trigonometry.  This Course Would Be Appropriate For High School Students, College Students, Or Gifted Hobbyists Who Need A Refresher.  This Calculus I Course Covers Limits, Continuity, Asymptotes, The Intermediate Value Theorem, The Squeeze Theorem, Derivatives, And Tangent Lines.  I Go Into Great Detail When I Teach.  As such, I Make An Effort Not To Be Overly Assuming When It Comes To The Algebra/Trigonometry Steps Involved In Solving A Calculus Problem.  Indeed, I Often Remind The Student Of How To Proceed In Such Situations.  The Terminology Used Includes Open Interval, Closed Interval, Endpoint, Interior Point, Subset, Superset, Infinity, Asymptote, Limit, Derivative, Difference Quotient, Slope, Secant Line And Tangent Line.  I Make Every Effort To Avoid Abstractions But I Use Them Readily When They Are Needed.  The Student Will Only Need A Calculus Book And A Scientific Calculator.  The Course Will Take About Two Months To Complete.  The Course Is Structured So That The Student Can Move Gradually Toward The Topic Of Derivatives While Simultaneously Appreciating How Any Given Topic Will Often Intertwine With Another Topic. Taking This Course Will Prepare The Student For A First Semester College Calculus Class By Furnishing Him Or Her With A Strong Corresponding Background.  The Student Listens To The Videos And Works The Problems Scattered Throughout This Course Will Walk Into A College Calculus I Class With Better Preparation In Regards To Both Computational Prowess And Mathematical Vocabulary.  </p>", 
    "end_date": null, 
    "title": "Calculus I:   Be Ready For Your College Calculus I Course", 
    "price": 0, 
    "instructors": "Jason Patrick Broadway", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571790_0318_4.jpg", 
    "course_url": "https://www.udemy.com/calculus-i-be-ready-for-your-college-calculus-i-course/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T19:03:10Z"
}