{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>You&#039;ll really appreciate the flexibility of an online course as you study the principles of calculus: derivatives, integrals, limits, approximation, applications and modeling. With no preset test dates or deadlines, you can take as much time as you need to take this course.</p><p>In this course, you get over <strong style=\"\">8 hours of in-person lectures</strong> and over <strong style=\"\">10 hours of material </strong><span style=\"\"></span>specifically designed to cover all of the material in Calculus 1. No longer will you have to try to understand the material from the book - now you have all the in-person lectures you need. The most important part though is that this course makes Calculus fun and easy!<br style=\"\"></p><p><strong style=\"\">Become a Master of Calculus Today!</strong></p><p><strong style=\"\"><span></span></strong>In this course, you get everything that any professor can throw at you in Calculus - all in one course. With this course:</p><ul style=\"\"><li style=\"\">You will be prepared for any test question from any University test</li><li style=\"\">You can easily get college credit for this course</li><li style=\"\">You can be prepared to face difficult applied problems and handle them with ease</li><li style=\"\">You can tell your friends that you were taking antiderivatives for fun (sounds fancy right?)</li><li style=\"\">Most importantly, you can be a Master of Calculus</li></ul><p><strong style=\"\">There Really is No End to the Rewards of Taking This Course!</strong></p><p><strong style=\"\"></strong>So what are you waiting for? Start the class today and be the master of what seems like an intimidating course. By the way, did I mention that the book is free?<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Calculus 1 For Beginners: Math Made Simple", 
    "price": "20.00", 
    "instructors": "Kody D'Amours", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416338_d354_4.jpg", 
    "course_url": "https://www.udemy.com/calculusmadesimple/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T07:30:47Z"
}