{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Work Paper organization is a first step to preparing quality tax and accounting and this course teaches the process. Also get to improve your excel skills along the way. Work papers summarize, explain, calculate, and reference to tax filings and to the source of the glorious information. Better work papers... Better work quality... Better clients... And better pay.\n\n\n\nI frequently get asked how to break into a CPA firm or get a better accounting job. </p><p>This course is a step to make the bridge between academics and making some money in a better position. This not only helps aspiring staff but owners looking to handle more complex work at scale. We will focus on tax, as this is most applicable to smaller firms like mine and tax is a great way to break into the profession.\n\n\n\nOrganizing segments otherwise overwhelming jobs into small tasks and makes the seemingly daunting project manageable. This field to some extent is a methodology of financial organization, so let me show you what goes on behind the scenes of the numbers. </p><p>\n\n\nI am John Gillingham CPA, founder of Accounting Play where we use apps and courses to teach real world accounting, tax and, bookkeeping skills. This course is inspired from my need to teach my own staff and is a culmination of over a decade of experience.\n\n\n\nThe course also comes with valuable downloads to enhance the traditional lessons.\n\n\n\nJoin me in taking this important step for your education and career. Be sure to checkout the other Accounting Play apps and courses and leave feedback. It is greatly appreciated.</p>", 
    "end_date": null, 
    "title": "Certified Public Accountant Tax Preparation Tutorial", 
    "price": 0, 
    "instructors": "John Gillingham", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/778618_3a13_3.jpg", 
    "course_url": "https://www.udemy.com/cpa-tax-prep/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-01T06:08:56Z"
}