{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t  Circuit Analysis is one of the Basic and Fundamental Course that introduces you to the world of electronics and computers.  </p>  <p style=\"\">  \t  Circuits are the veins of Almost All of our equipments, ranging from our car to our mobile phone. These are the building blocks of all electronic equipments.  </p>  <p style=\"\">  \t  This course here is designed in such a way that, even a person with no knowledge in electrical engineering can easily understand it.  </p>  <p style=\"\">  \t  In fact this course is for everyone.  </p>  <p style=\"\">  \t  This course is stuffed with numerous solved and practice problems on all topics. We are here to help you get really good grades in your exams.  </p>  <p style=\"\">  \t  The prerequisite for this course is nothing.  </p>  <p style=\"\">  \t  Just some Basic Algebra, Trigonometry and Calculus.  </p>  <p style=\"\">  \t  You are not required to know these concepts before hand. <br style=\"\">  \t  This course would be more easier to follow and understand, if you knew them already.  </p>  <p style=\"\">  \t  This course Includes 52 video lectures.  </p>  <p style=\"\">  \t  Each concepts are broken down into bits with separate lectures for problems.  </p>  <p style=\"\">  \t  Different types of approach to problem solving is discussed.  </p>  <p style=\"\">  \t  If you are an engineering student, wanting to get a good grade, or you are interested in robotics or homebrew electronics then, look no where, this the course where you should start.  </p>", 
    "end_date": null, 
    "title": "Circuit Analysis and Design : Part 1", 
    "price": "20.00", 
    "instructors": "Muthu Kumar", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/252312_824e_9.jpg", 
    "course_url": "https://www.udemy.com/circuitanalysis1/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-29T03:52:15Z"
}