{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to High School Algebra 2 / College Algebra explained.\n\n  </p>\n\n<p>Hi, my name is Shaun Reilly and I have been a math and computer science teacher for over 10 years.  I have taught everything from Algebra and Geometry to Game Design and AP Computer Science.  Because of the varying ranges of difficulty that my courses have, I also have much greater flexibility in teaching a wide range of students on different skill levels.   Whether you have taken a College Algebra class in the past and just need to brush up, or you are a current or even future student who wants to get jump on concepts or have the concepts explained in a different way, this is the class for you.  In addition, this class mimics many of the concepts found in a High School Algebra 2 class as well, so those students can also benefit from the material.\n\n  </p>\n\n\n\n<p>This course is broken up into learning sections, each having 3 items.  The first item is a guided notes video.  This video explains the theory behind what you will learn, as well as some facts about why the concepts within that section are important.  As math teachers we tend not to spend enough time telling the importance of the subject matter, and how it actually pertains to real life.  The second item consists of example problems that I complete step by step.  I highlight problem areas and give you tips for solving problems of that type.   The third and final item consists of extra homework problems for you to try, along with an answer key.  \n\n  </p>\n\n\n\n<p>After completing this course, you will have a strong foundation in advanced Algebra concepts, and you should be ready to take a more advanced course such as Trigonometry or Pre-Calculus.\n\n  </p>\n\n\n\n<p>\n\n During this course I will cover a wide variety of Algebra topics including, but not limited to:</p>\n\n<p><br></p>\n\n<p>-Solving and graphing linear equations and inequalities</p>\n\n<p>-Solving systems of linear equations</p>\n\n<p>-Using matrices</p>\n\n<p>-Factoring monomials, binomials, and polynomials</p>\n\n<p>-Using rational expressions, equations, and exponents, and solving quadratic equations</p>\n\n<p>-Working with exponential and logarithmic functions and equations  </p>\n\n<p><br></p>\n\n<p>If that sounds like a lot…it is!  But I will be here walking you through step by step with tons of examples and background information.\n\n  </p>\n\n\n\n\n\n<p>The ideal student for this course really varies.  You could be a high school student who will be taking or is currently taking Algebra 2, a college student who will be taking or is currently taking a College Algebra course, or someone who wants to take a more advanced math course such as Trigonometry or Pre-Calculus and wants to brush up on their Algebra skills beforehand.  \n\n  </p>\n\n\n\n\n\n<p>Thanks for your interest in High School Algebra 2/ College Algebra Explained.  If you’re still unsure if this is the right course for you, please try the free preview of this course.  I’m hoping that after a few minutes you’ll see how valuable this course really can be.  See you in the classroom!\n\n  </p>", 
    "end_date": null, 
    "title": "College Algebra Explained", 
    "price": "20.00", 
    "instructors": "Shaun Reilly", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761060_a7ad_3.jpg", 
    "course_url": "https://www.udemy.com/college-algebra-explained/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-12T22:54:32Z"
}