{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong style=\"\">Course Description</strong></p><p>This course is designed to give you an intuitive understanding of Linear Equations We took all the major concepts and simplified them into plain English using animations and visual effects, not just endless symbols and equations.</p><p>It can help you understand questions more thoroughly, concentrate more effectively in your studies and reduce the stress that comes with not understanding the content. </p><p><br style=\"\"></p><p><strong style=\"\">Contents and Overview</strong> </p><p>This course is aimed at any student who is struggling in Methods. It has tutorials that explain each of the major concepts step by step and in detail.</p><p><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li>The goal of this course is to give you an intuitive understanding o</li><li>Revolutionary way of learning without all the Mathsy language</li><li>Animations and visual effects to give you a better idea of what all the concepts mean</li><li>Taught by an educator with degrees in Mathematics/Astrophysics, Philosophy and Classics</li></ul><p><strong style=\"\">Why do students struggle in Maths?</strong></p><p>Classes move so fast and cover so many topics that it&#039;s easy for them to miss a few key concepts. </p><p>Suddenly, Maths is no longer a logical subject but a painful experience where they try to <em style=\"\">remember</em> <em style=\"\">how</em> to answer questions rather than actually understanding the content.<br style=\"\"> </p><p><strong style=\"\">How can we help?</strong></p><p>We simplify Maths so that they understand the fundamentals of what they are studying and really understand what the question is asking rather than hoping that they remember how to answer it.</p><p>Practice is key but there is no point spending hundreds of hours on questions if they don&#039;t <em style=\"\">really</em> know what they are doing: as they simply won&#039;t get the results they deserve.</p><p><strong style=\"\">The Solution</strong></p><p>Our tutorials contain every major concept about drawing Linear Graphs and are full of animations and visual effects and only contain simple, non-technical explanations. They are designed to give students an intuitive understanding of the subject which in turn increases concentration and makes Maths a lot less stressful for everyone.</p>", 
    "end_date": null, 
    "title": "Colourful Maths! How to Draw Any Linear Graph", 
    "price": "20.00", 
    "instructors": "Alex Bell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452754_fb59_6.jpg", 
    "course_url": "https://www.udemy.com/mathsmethods/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T01:57:30Z"
}