{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Calculus taught in a simple, visual way that helps students understand it intuitively. Our educator has degrees in Mathematics/Astrophysics, has taught students for years and has been a professional entertainer: so he knows how to captivate an audience.</p><p>Calculus has never been so simple, enjoyable, colourful and entertaining!</p><p><br></p><p><strong>Students, teacher and parents love the video tutorials:</strong></p><ul><li>“I was thrilled to see the video tutorials that Alex Bell put together, they are informative, highly visual and engaging!\"</li></ul><div><br></div><ul><li>“They are fantastic. I really liked the tutorials because they reinforced conceptual knowledge.\"</li></ul><div><br></div><ul><li>\"He teaches the concepts \nstep by step and this never overwhelms our son, but empowers him.\"</li></ul><p><br></p><p><strong>A bit about the educator:</strong><br></p><p>My aim is to make Maths easier and more enjoyable for every student so that they can achieve the results they deserve. I hold degrees in Astrophysics, Mathematics, Philosophy and Classics from Monash University, used to be a professional entertainer and have trained and educated people all around the world for over 6 years and specialise in teaching Mathematical concepts.</p><p>After spending thousands of hours researching and redefining the terminology, symbols and concepts of Mathematics, it became clear that it could be taught much more intuitively and I put that to the test. I started teaching Mathematics almost like it was a Humanities subject: defining all the symbols and terminology, providing simple explanations and using lots of pictures and animations. Students began to understand Maths using common sense instead of complex proofs because they could visualise the concepts rather than just accept them. I found that if students were taught the basics then they could figure out the more complex ideas all by themselves: They learnt things quicker, became less stressed and could concentrate on their school work more effectively.</p><p>With the aid of a visual designer, an IT professional and a couple of videography experts, I spent next year researching, testing and developing the most effective way to teach students online using these proven techniques. The culmination of over 2 years work is these easy to understand, online tutorials full of animations and visual effects that has revolutionised the way students learn Maths.</p>", 
    "end_date": null, 
    "title": "Colourful Maths! Calculus for beginners ", 
    "price": "40.00", 
    "instructors": "Alex Bell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499876_88f2_3.jpg", 
    "course_url": "https://www.udemy.com/basiccalculus/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T12:11:20Z"
}