{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Common Core is a new math curriculum that has been adopted across the nation by many K - 8 schools. These courses are taking common math equations and greatly expanding the formulas and processes for solving equations. What we formerly just accepted with rote memorization, is now a complex sequence of steps that is designed to teach children the theory of math and now you will have the tools to simplify these principles for your student.</p><p style=\"\">This course is meant to teach the teacher, parent or student the fundamentals of Common Core Math at the 4th grade level. The lectures are organized by <strong style=\"\">subject, grade level, module, lesson and topic</strong>. Students can easily navigate to the specific lesson in this course and review the day&#039;s work that your student very likely just covered in class the same day using the same examples.</p><p style=\"\">Instructional videos and worksheets are provided to illustrate the theoretical lessons about the following subjects: </p><ul style=\"\"><li>Creating place value charts</li><li>Interpreting a multiplication equation as a comparison</li><li>Grouping by 10s in each place value</li><li>Multiplying/dividing by 10 shifts digits one place to the left or right</li><li>Skip-counting related to advance place value</li><li>Writing multi-digit numbers in expanded, standard, word, unit forms</li><li>We can express numbers using different base units in hundreds, thousands, ten thousands and hundred thousands.</li><li>How to separate the thousands place from the numbers in the hundreds, tens, and ones places in both the standard form and word form.</li></ul><p style=\"\">The complete course should take approximately 18 days to complete if one lesson per day is attempted.</p><p style=\"\">You will find that this course contains everything that you wish was in the homework packet or book that your student brought home to complete his/her homework. With this course, you&#039;ll be equipped translate the math you were taught into the Common Core essentials that your student is learning now.</p>", 
    "end_date": null, 
    "title": "Common Core Math - Grade 4 - Module 1", 
    "price": "20.00", 
    "instructors": "Selena Culpepper", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409732_eb01_4.jpg", 
    "course_url": "https://www.udemy.com/common-core-math-grade-4-module-1/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T07:13:03Z"
}