{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Complex adaptive systems are all around us from financial markets to ecosystems to the human immune system and even civilization itself, they consist of many agents that are acting and reacting to each other&#039;s behavior, out of this often chaotic set of interactions emerges global patterns of organization in a dynamic world of constant change and evolution where nothing is fixed.</p><p>In these complex adaptive systems no one is in control, no one has complete information, patterns of order emerge through self-organization between agents. Individual cells self-organize to form differentiated body organs, ants interact and self-organize to form colonies, and people interact to form social networks. These patterns of global organization emerge out of a dynamic between order and chaos that we are only just beginning to understand but as we do we are finding that these apparently very dissimilar systems share fundamental commonalities. </p><p>The aim of this course is to give a comprehensive, clear and accessible outline to the new area of complex adaptive systems that is finding application in many areas. We will be covering all the main topics within this domain, as we start by talking about adaptation itself where we will be discussing cybernetics and looking at how systems regulate themselves to respond to change. We&#039;ll go on to talk about the dynamics of cooperation and competition, looking at how and why agents work together to create local patterns of organization. Next we will be talking about the process of self-organization and asking the big questions about how do we get and sustain ordered patterns out of randomness and chaos? Lastly we will be looking at the process of evolution as a powerful and relentless force that shapes complex adaptive systems on the macro scale and we will be taking it apart to get a solid grasp of its basic functioning. </p><p>This course requires no prior specific knowledge of mathematics or science, it is designed as an introduction presenting concepts in a nonmathematical and intuitive form that should be accessible to anyone with an interest in the subject </p>  ", 
    "end_date": null, 
    "title": "Complex Adaptive Systems", 
    "price": "20.00", 
    "instructors": "Complexity Academy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486224_83d6_4.jpg", 
    "course_url": "https://www.udemy.com/complex-adaptive-systems/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-25T19:49:54Z"
}