{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">This course is for K-11 and K-12 grade students, who want an introduction to the topic,&quot;Complex numbers&quot;.</p><p style=\"\">The course begins with a quiz which will serve as a self assessment tool for students to see how much do they know about real numbers before they start learning complex numbers.</p><p style=\"\">The first lecture presents a clear  understanding of  the need for complex numbers and define imaginary numbers.<br style=\"\"></p><p style=\"\">And hence the students get to know how the real number system is extended to the complex number system.<br style=\"\"></p><p style=\"\">The students will be introduced to the  term iota (i), the notation for imaginary numbers.<br style=\"\"></p><p style=\"\">The definitions of positive and negative integral powers of i (iota) are very clearly explained.<br style=\"\"></p><p style=\"\"> Appropriate examples to understand the powers of iota are taken up.</p><p style=\"\">The  terms:  Complex numbers, Real part of a complex number, Imaginary part of a complex number,  purely real and purely imaginary complex numbers are explained with the help of examples.<br style=\"\"></p><p style=\"\">Two of the lectures explain the equality of two complex numbers and the operation addition of complex numbers.<br style=\"\"></p><p style=\"\">Section 4  comprises of videos which establish  the laws of addition. i.e. Closure law, commutativity, associativity , existence of additive identity and inverse.</p><p style=\"\">The quizzes in the course help the students to test their understanding.</p><p style=\"\">The videos <em style=\"\">can be completed  in an hour.</em></p><p style=\"\">This course of Complex numbers (part 1) is sure to make understand your concepts  easily and this will serve as  a great foundation for other advanced courses in complex numbers which you may want to take up in the future.</p><p style=\"\"><em style=\"\">Good Luck!</em></p>", 
    "end_date": null, 
    "title": "Complex Numbers (Part-1)", 
    "price": "20.00", 
    "instructors": "Surya Kumari Gandikota", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380080_48d6.jpg", 
    "course_url": "https://www.udemy.com/complex-numbers-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T16:18:11Z"
}