{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong style=\"\">   Complexity Science</strong> is a science for the complex world we live in at the turn of the 21st century, by using new theories that let us look at age old problems with a fresh perspective and leveraging the use of powerful computation and large data sets it is offering us new insight into the fundamental workings of our interconnected world of networks, globalization and sustainability.  </p>  <p>  \t               This course gives an overview to the emerging new area of science that is complexity science. By applying the tools of complexity theory such as network analysis, systems theory  and self organization, complexity science studies the complex systems in our world that have traditionally been some what overlooked, such as chaotic weather patterns, social networks, transportation systems or the spread of pandemics, to name just a few. This course will cover some of the main applications of complexity theory to various scientific, domains such as:  </p>  <p>  \t<strong style=\"\">Social network analysis</strong> is the application of network theory and the tools of data analysis to the modeling of social systems. With the arrival of high-powered computing and the proliferation of data sets relating to social interaction, social network analysis is taking off.  </p>  <p>  \t<strong style=\"\">Earth systems science</strong> is the study of earth as a complex adaptive system. Inherently interdisciplinary it crosses the scientific boundaries to treat the earth as an integrated system. This section introduces you to the application of complexity theory to the modeling and analysis of our planet.  </p>  <p>  \t<strong style=\"\">Complexity economics </strong>is part of a new set of ideas surrounding economic theory, it sees the economy as a complex system evolving over time through the interaction of multiple adaptive elements that give rise to the emergent structures of enterprises and whole markets.  </p>  <p>  \t<strong style=\"\">Complex technology systems</strong> are large networks composed of multiple highly interconnected technologies, such as electrical power grids, telecommunication networks, transportation networks or global supply chains. The organization of these systems involves a web of connections and demonstrates self-driven adaptability and emergence behaviour.  The tools of complexity theory are beginning to be applied to modeling these technologies and helping us to get a better understanding of their operations.  </p>", 
    "end_date": null, 
    "title": "Complexity science: an introducton", 
    "price": "20.00", 
    "instructors": "Complexity Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/252674_df8a_3.jpg", 
    "course_url": "https://www.udemy.com/complexity-science/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-29T16:28:25Z"
}