{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Learn the steps for conducting a One-Way MANOVA procedure in SPSS with Dr. Amanda Rockinson-Szapkiw.</strong>  </p>  <p style=\"\">  \t      From assumption testing to hypothesis testing, you will learn how to use SPSS outputs to make conclusions and write a results section.  </p>  <p style=\"\">  \t  Whether you’re a doctoral candidate, graduate or undergraduate student, or researcher, my research, statistics, and SPSS courses will facilitate you in developing  research and analysis knowledge and skills to  be successful in reaching your goal -- passing a statistics class, successfully defending a dissertation, or publishing a research project.  </p>  <p style=\"\">  \t<strong style=\"\">I want to see you <em style=\"\">succeed</em>.</strong>  </p>  <p style=\"\">  \t  So check out the courses I offer here. I am a full-time doctoral professor who truly enjoys teaching in the online and distance education environment. Many research and statistics courses like the ones found here on Udemy have helped hundreds of students learn the knowledge and skills needed to complete their courses, research projects, or successfully complete and defend their dissertations on their doctoral journeys.  </p>  <p style=\"\">  \t  All the best in finding success on <em style=\"\">your </em>journey!  </p>", 
    "end_date": null, 
    "title": "Conduct a One-Way MANOVA Using SPSS", 
    "price": "20.00", 
    "instructors": "Dr.  Amanda Rockinson-Szapkiw", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354260_3873_9.jpg", 
    "course_url": "https://www.udemy.com/conduct-a-one-way-manova-using-spss/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T05:04:02Z"
}