{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong style=\"\">AVISO</strong>: El curso completo comprende 8 secciones, no todas estan publicadas. Las secciones se irán subiendo mientras se vayan completando. Al inscribirte tienes acceso al curso para siempre, y a todas las secciones que se añadan y se mejoren. Para cualquier sugerencia: phd.barinas@gmail.com</p><p><strong style=\"\">Intro:</strong></p><p>Este curso pertenece a una serie que estan preparadas para demostrar el procedimiento básico del diseño de las instalaciones sanitarias de una edificacion.</p><p>Aqui aprenderás de manera práctica las herramientas necesarias para tomar cualquier proyecto residencial y plasmar las distribuciones y equipos relacionados con el abastecimiento de agua potable, y en los próximos la recolección de aguas residuales y drenaje pluvial.</p><p>Los procedimientos explicados fueron simplificados al más mínimo detalle para que cualquier interesado lo pueda entender y poner en práctica de inmediato.</p><p>Siguiendo las lecciones podrás aprender como los profesionales especialistas en instalaciones sanitarias calculan los tamaños de las tuberías, tanques de presión, bombas, cisternas, tinacos, sépticos, trampas de grasa, registros, pozos filtrantes y otros componentes hidráulicos. </p><p>Si eres un profesional de la arquitectura o la ingeniería ya conoces el alto valor que tiene el conocer estos procedimiento y el poder tomar desiciones inteligentes sobre instalaciones sanitarias sin depender de otros que se dedican al área.</p><p>Pero sin importar quien seas, se que te será de gran provecho y de utilidad.</p><p>Nos vemos dentro!</p>", 
    "end_date": null, 
    "title": "Cómo Diseñar el Suministro de Agua Potable de Edificaciones", 
    "price": "20.00", 
    "instructors": "MSc Gabriel Barinas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505662_71ca_3.jpg", 
    "course_url": "https://www.udemy.com/tbarinas-sap/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T00:18:56Z"
}