{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">A lo largo de este curso no sólo revisarás conceptos que ya conoces sino que aprenderás a aplicarlos y a conocer la metodología básica utilizada para el diseño de sistemas de captación y conducción de aguas pluviales en urbanismos.</em></strong></p><ul style=\"\"><li style=\"\">Empezaremos revisando la Aplicación del <strong style=\"\">Método Racional</strong>, enfocándonos en aspectos tales como la determinación del Tiempo de Concentración, Cálculo del Coeficiente de Escorrentía Ponderado y Selección del Período de Retorno en función del Riesgo Aceptable, entre otros aspectos.</li><li style=\"\">Daremos un repaso a los aspectos relacionados con el <strong style=\"\">Flujo a Superficie Libre y la Ecuación de Manning,</strong> así como a la determinación de parámetros como las alturas de agua en canales trapezoidales, rectangulares y circulares,resaltando la aplicación de la <strong style=\"\">Fórmula de Izzard</strong> para el Cálculo de la Capacidad Hidráulica de Calles y Avenidas.</li><li style=\"\">Estudiaremos la forma de captación de las aguas utilizando Sumideros<em style=\"\">.</em>Conocerás aquí la <strong style=\"\">Conceptualización general del Sistema de Captación,</strong> estudiando los criterios de ubicación de los sumideros de Ventana y de los de Rejilla en sectores Urbanos. Aprenderás a determinar el Caudal Captado en función de la Eficiencia del Sumidero y de sus características. Verás, a través de un <strong style=\"\"><em style=\"\">Vídeo Interactivo,</em></strong> lospasos y cálculos realizados para el cálculo del Sistema de Captación de un sector Urbano</li><li style=\"\">Por último Estudiaremos los Aspectos relacionados con la <strong style=\"\">Definición Planimétrica y Altimétrica de las Tuberías </strong>destinadas a la Recolección de las Aguas de lluvia, conociendo los aspectos hidráulicos a ser tomados en cuenta al momento de determinar pendientes y diámetros para la red. <span style=\"\"></span></li></ul>", 
    "end_date": null, 
    "title": "Diseño de Sistemas de Drenaje Urbano", 
    "price": "40.00", 
    "instructors": "Aula Virtual Tutoriales al Día", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569358_8fb3_5.jpg", 
    "course_url": "https://www.udemy.com/diseno-de-sistemas-de-drenaje-urbano/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T15:59:12Z"
}