{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t      Many School students consider Mathematics a very difficult subject. Some students encounter difficulty with basic arithmetical operations. In other words, abstract and logical reasoning is their hurdle.  </p>  <p>  \t    Can you divide 43213 by 9 in just 3 seconds?  </p>  <p>  \t    This course is going to help you and you can perform this division in just 3 seconds. This is just an example and this course will teach you many faster division methods.  </p>  <p>  \t      This course contains 10 video lectures ranging from 3 to 17 minutes and in total it is around 1 hour 10 minutes lectures which covers simple to complex Division techniques. It also contains 5 Practice tests to check what you have learned.  </p>  <p>  \t      This course provides some fastest methods of division derived from the Veda. Many techniques are one line, mental and super- fast methods along with quick cross checking systems.  </p>  <p>  \t      How it helps to individual?  </p>  <p>  \t      - Improves academic performance in school and universities.  </p>  <p>  \t      - Sharpen your mind. Also improves memory and logical reasoning.  </p>  <p>  \t      - This course will help students from school to universities, Entrance exam aspirants and also teachers.  </p>  <p>  \t      - More faster and easy to grasp methods than any conventional methods.  </p>  <p>  \t      I am sure these techniques converts a tedious subject into a playful and blissful one which students learn with smiles.  </p>", 
    "end_date": null, 
    "title": "Division made simple - Fastest vedic methods", 
    "price": "20.00", 
    "instructors": "Nirav Shah", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374380_a1fc_5.jpg", 
    "course_url": "https://www.udemy.com/fastest-division-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T09:05:21Z"
}