{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<em>'Recognized as a <strong>top instructor</strong> by Udemy for high quality academic courses'</em>  </p>  <p>  \t<em>'First time on Udemy, courses delivered by <strong>Nobel Prize laureates and international academic authorities</strong>'</em></p><p><em>If you are as crazy and passionate about true knowledge as our community and believe that true <strong>knowledge is true wealth</strong>, then our courses are for you.</em></p>  <p>  \t  In this masterclass we will see the discovery of the structure of DNA through the words of one of its creators, the Nobel Prize Winner for Medicine <strong>James Watson</strong>.  </p>  <p>  \t                          In the mid-nineteenth century biology had taken great leaps and bounds thanks to the research of Mendel and <strong>the discovery of DNA</strong>. A century later, a couple of fundamental questions still keep scientists searching: what is DNA made up and how is its hereditary information transmitted? The story of a sensational discovery and the dawn of a new era in genetics.  </p>  <p>  \t<strong>This course is for:</strong>  </p>  <ul>  \t<li>Anyone with inquisitive and open mind</li>  \t<li>Anyone with Interest in science</li>  \t<li>Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li>Attending the course does not need any scientific skill since it is presented in a clear and simple manner</li>  \t<li>Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates' works.</li>  </ul>  <p>  \t<strong>With this course you will learn:</strong>  </p>  <ul>  \t<li>Over 20 lectures and 1.5 hours of content!</li>  \t<li>You will learn what DNA is</li>  \t<li>You will learn how DNA was discovered and its structure</li>  \t<li>You will learn how DNA is made up and how its hereditary information is trasmitted</li>  </ul>  <p>  \t  From literature to economics, art to philosophy, <strong>EdooTv</strong> gives voice to the world's leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p>  \t  Don't wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong>best gift</strong> you can give to yourself and your loved ones.  </p>  <p>  \t  Feel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "DNA the Secret of Life - James Watson", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303676_c39b_5.jpg", 
    "course_url": "https://www.udemy.com/james-watson-dna-the-secret-of-life/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-19T14:25:13Z"
}