{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">A Faculty Project Course - Best Professors Teaching the World</p>  <p style=\"\">Water. It caresses and comforts us, provides sustenance and refreshment, is something that humanity has cherished since the beginning of history, and means something different to everyone else. Yet the historical facts and information about water remains little known.</p>  <p style=\"\">Water tells the story of changing human relationships with water over the past 10,000 years and tries to answer some basic questions:</p>  <ul style=\"\">  <li style=\"\">How have human attitudes to water changed since people first began to manage their water supplies?</li>  <li style=\"\">What major events in the past have defined our present relationship to water, not as something revered, but treated as an anonymous commodity?</li>  <li style=\"\">Why are we now facing a global water crisis and what are prospects for the future?</li>  </ul>  <p style=\"\">This is the story of gravity and human ingenuity, of irrigation and aqueducts, of humble farming villages, ancient cities, and the rise and fall of civilizations. We draw on archaeology and hydrology, on anthropology and ancient oral traditions, on classical literature and Islamic agriculture—on a broad array of scientific inquiries in many languages and in all parts of the world.</p>  <p style=\"\">Taking this course will make you look at water in an entirely new way.</p>  ", 
    "end_date": null, 
    "title": "Elixir: A History of Water and Humans", 
    "price": 0, 
    "instructors": "Brian Fagan", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/12943_97eb_4.jpg", 
    "course_url": "https://www.udemy.com/elixir-a-history-of-water-and-humans/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-01-22T02:00:57Z"
}