{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Gene enrichment analysis</strong> is the most popular <strong style=\"\">systematic approach to assign ontologies, pathways, and transcription factors to gene lists</strong> usually resulted from high throughput experiments. This short course introduces the two most frequently applied methods to locate the common features of large gene lists, and provide opportunities to practice this analysis in the most common research scenarios using <strong style=\"\">GeneTrail</strong> (for gene set enrichment analysis) and <strong style=\"\">WebGestalt</strong> (for over-representation analysis), the two web tools used most often in the field.  </p>  <p style=\"\">  \t     You get <strong style=\"\">written material,</strong> <strong style=\"\">video explanations</strong> for the background, and prepared <strong style=\"\">example data files for practices</strong>. You are provided with (almost) real life discussions between a wet-lab biologist and a bioinformatician to clarify the most common misunderstandings related to this analysis. You are led <strong style=\"\">step by step by two experts of the field</strong>, both active researchers; and in the meantime, you are challenged to proof your knowledge in quizzes.  </p>  <p style=\"\">  \t     If you have a solid background in molecular biology research, you will be able to expert these methods in a maximum of <strong style=\"\">8-10 active course hours</strong>, but if you have only a general idea of the field, you will get a plenty of background material to learn and practice all in a few days. We recommend to cover all the provided material <strong style=\"\">approximately in a week</strong> to maximize the efficiency of your learning.  </p>  <p style=\"\">  \t     As you know, bionformatics and data analysis skills are highly demanded among molecular biology and pharma researchers. Why not equip yourself with these easy but very useful tools to <strong style=\"\">extend your future potential as a researcher</strong>?  </p>", 
    "end_date": null, 
    "title": "Enrichment analysis: interpret gene lists like a pro", 
    "price": "20.00", 
    "instructors": "Dr. Csaba Ortutay, PhD Zsuzsanna Ortutay", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255214_0df8_3.jpg", 
    "course_url": "https://www.udemy.com/gene-enrichment-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-03T17:15:21Z"
}