{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong>Course</strong> <strong>Synopsis</strong>  </p>\n\n<p>  \t  If you have ever wondered what makes you, “you”, or about the relationship between the “mind” and the brain, or what consciousness is, or how visual illusions fool our mind, then you may be interested in the study of experimental psychology.  </p>\n\n<p>  \t  The course is designed to give students a basic overview of the study of experimental psychology at university, looking at the major areas that constitute an experimental psychology degree.  The fascinating case studies looked at in this course – such as the mysterious case of Phineas Gage, the American railway worker who survived an iron bar passing through his brain – will provide great material to help you in your application or simply provide an insight into a fascinating area of study.  </p>\n\n<p>  \t<strong>What's Included?</strong>  </p>\n\n<p>  \t  This courses consists of 4 X e-tutorials - audio recordings with accompanying presentation material - each taking approximately 30 minutes to complete. Regular quizzes and exams ensure that students can check that they are following the topics covered. This courses is available to start instantly online through Udemy – once you’ve chosen the course you want to take, you can get started straight away.  </p>\n\n<p>  \t<strong>How Does it Work?</strong>  </p>\n\n<p>  \t  The course is broken down into e-tutorials, which is an interactive presentation accompanied by an audio lecture that takes around 30 minutes to complete. Each tutorial is broken down into its major topics - chapters. This ensures that course content is broken down into bitesized educational units that are easy to digest, and also means that content is easily navigable at the pace of the student.  </p>\n\n<p>  \t<strong>Why Take this Course?</strong>  </p>\n\n<p>  \t  This course is ideal preparation for students thinking of studying psychology, medicine, and related subjects at university, exploring a range of academic theory and practical methods.  </p>", 
    "end_date": null, 
    "title": "Experimental Psychology", 
    "price": 0, 
    "instructors": "ORA Prep", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309932_f4a9_3.jpg", 
    "course_url": "https://www.udemy.com/experimental-psychology/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-29T10:07:02Z"
}