{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This is a concise but in-depth course that gives you a deep understanding of the muscles of the arm from the shoulder to the wrist.</p><p><strong>Master the Muscles of the Arm</strong></p><ul><li>Learn names easily from explanations of the latin names </li><li>Know where each muscle attaches to the skeleton</li><li>See clearly how they overlap</li></ul><p><strong>Three-Dimensional Models are Used to Explain the Three-Dimensional Body</strong></p><p>This course is the culmination of many years of experience sculpting and studying anatomy.  The arm is complex. How the muscles overlap and fit together is extremely difficult to learn through books and static images.  I present each muscle three-dimensionally in a video that highlights different aspects of the muscles as I explain them.  This is a fast and easy way to learn anatomy at a deep level.</p><p><strong>Watch as the Arm is Built Out of Clay</strong></p><p>After 3d explanations of the important aspects of each muscle you will see it sculpted in clay. In the final video we start from scratch and build the arm out of clay muscle by muscle. </p><p>Don't be afraid of long names. I will cover naming conventions that make names such as \"Extensor Carpi Radialis Longus\" easy to understand and memorize.</p><p><strong>38 Muscles</strong></p><p>At the end of this course you will know the name, placement and action of the 38 muscles from the shoulder to the wrist.  </p><p>It does not cover the small muscles of the hand.</p>", 
    "end_date": null, 
    "title": "First Anatomy Arm Muscles", 
    "price": "40.00", 
    "instructors": "Jake Hebbert", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665816_e9b1_2.jpg", 
    "course_url": "https://www.udemy.com/first-anatomy-arm-muscles/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-10T13:39:56Z"
}