{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t  Este curso está pensado para que cualquiera entienda fracciones, desde los conceptos básico necesarios para el manejo de fracciones, hasta las operaciones básicas de fracciones y algunos problemas aplicados de fracciones. Vamos a empezar desde los conceptos como mínimo común múltiplo y máximo común divisor, hasta las operaciones con fracciones hasta llegar a fracciones complejas. Además contiene material para trabajar en casa como unas regletas de fracciones que puedes imprimir, y continuamente se está agregando mas material como problemas y ejercicios que te ayudaran a mejorar mucho en tu dominio y manejo de fracciones.  </p>  <p>  \t  Las fracciones no tienen por qué ser difíciles, y por eso es que los papas deben poder ayudar a sus hijos con sus área, cosa imposible si ellos también tienen deficiencias en este tema, así que el curso no es solo para estudiantes, también es para padres y madres de familia que quieran ayudar a sus hijos con sus tareas.  </p>  <p>  \t  Los temas que se abordan van desde lo que son números primos y números compuestos, y su utilización para encontrar el mínimo común múltiplo y máximo común divisor, temas muy necesarios para un buen manejo de fracciones y sus operaciones básicas. Cada video dura realmente poco, pues están divididos por temas específicos y tiene ejercicios que realizamos juntos para que tengas una rápida referencia al tema que necesites repetir, sin que pierdas tiempo buscando entre eternos videos. Anímate y piérdele el miedo a las matemáticas, ellas te abrirán muchas puertas en el futuro y son la base para una educación de calidad.  </p>  <p>  \t  Después de este curso veras que las fracciones no son tan feas como creías, ni tan difíciles, deja tus miedos y ataduras, toma este curso en línea fácil, sencillo y bien orientado para que aprendas desde el primer video, a tu ritmo y hasta profundidad  </p>", 
    "end_date": null, 
    "title": "Fracciones fáciles para todos", 
    "price": "20.00", 
    "instructors": "ing Mayra Lorena Lopez Rivera", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327786_9d96_3.jpg", 
    "course_url": "https://www.udemy.com/fracciones-faciles/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T01:38:02Z"
}