{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>En un mundo perfecto y con el gran avance de las Infraestructuras de Datos Espaciales, deberíamos encontrar toda la información para nuestro proyecto SIG de forma gratuita y en un único sitio web de una fuente autorizada y confiable, por supuesto. Pero no, no vivimos en un mundo perfecto.</p><p>Este curso es una compilación de distintas fuentes de información geográficas a nivel internacional interesantes para obtener datos y cartografía básica frecuentemente utilizados en los proyectos SIGs con enfoque medioambiental, de conservación o análisis de biodiversidad.</p><p>Conoceremos distintas bases de datos y fuentes de información geográficas que nos permitirán obtener un gran volumen de información  de alta calidad y de libre acceso, para ser utilizadas en nuestro proyectos. </p><p>Aprenderemos cuales son los mejores sitios para obtener: imágenes satelitales, modelos digitales de terreno, datos de biodiversidad, datos climáticos, cartografía básica o información temática en formato raster y vectorial como por ejemplo: NDVI, vegetación, variables climáticas, corrientes oceánicas y mucho más.  <br></p><p>Así que si quieres conocer donde obtener información geográfica o datos para tus proyectos de sistemas de información geográfica, no dudes en realizar este curso, seguro conocerás nuevos sitios para localizar información.</p><p>Nos vemos en el aula.<br></p>", 
    "end_date": null, 
    "title": "Fuentes de información geográfica para SIGs ambientales", 
    "price": 0, 
    "instructors": "Isis Gómez López", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553406_559e_2.jpg", 
    "course_url": "https://www.udemy.com/fuentes-de-informacion-geografica-para-sigs-ambientales/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T15:33:46Z"
}