{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This course covers fundamental concepts and methods in static structural analysis. Starting with the very basics, we consider forces, moments and how to use the principle of static equilibrium. In section 2, we look at pin-jointed structures or trusses; what are they and how do we analyse them? We'll cover the joint resolution method and method of sections in detail.</p><p>Based on the instructor's experience lecturing to engineering undergraduates, the course focuses on those areas students find particularly tricky when starting out. Worked examples are used extensively to demonstrate the practical application of theory. The link between theory and practice is reinforced using the instructor's own experience as a structural design engineer. </p><p>The course includes video lectures which combine screencast voice over with traditional style lectures. The emphasis is on worked examples with students encouraged to try questions before the detailed solution is presented. The teaching philosophy is 'learn by doing!'. Each section concludes with a supplementary worksheet to help test your understanding. Accompanying solution videos provide detailed discussion of each solution to help you learn from any mistakes. </p><p>This course is suitable for engineering students who find their structures lectures confusing and feel a little lost when it comes to structural analysis. Students wishing to get a head start before starting their degree program or more advanced engineering students who need a refresher would also benefit from taking this course.</p>", 
    "end_date": null, 
    "title": "Fundamentals of Statics for Engineering Undergrads", 
    "price": "20.00", 
    "instructors": "Dr. Seán Carroll", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518410_861b_3.jpg", 
    "course_url": "https://www.udemy.com/statics-for-engineering-undergrads/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T21:11:34Z"
}