{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>Welcome To My New Course!</strong></p><p><strong>The course is on a fascinating topic of Submarines! </strong>You will be learning how submarines work, the different engineering aspects behind it, and also how submarines got evolved right from from year 1776!</p><p><strong>NOTE:<em> <u>This course is NOT</u></em><em><u> like a simple \"How submarines work\" course! </u></em></strong></p><p><strong><em></em></strong>I will go <strong>in depth</strong> with detailed explanation of all the navigation systems used by submarines, the various life supports, maneuvering techniques, power sources, and even the historical development and working of torpedoes.</p><p><strong>Frequently Asked Questions!</strong></p><p><strong>1. What if I get some queries in between the course?</strong></p><p><strong>Answer:</strong> <strong><u>I promise you, that each and every query will be replied within 24 hours! </u></strong><u></u>The reason for doing this is two folds. </p><p>First, you joined my course to learn, and I wish to give you the best experience possible.</p><p>Second, I enjoy learning as well as teaching. In clearing your queries, I will learn too.</p><p><strong>2. I don't know much of engineering. Can I take this course?</strong></p><p>YES!! You just need you to know basic science &amp; physics and curiosity to learn about this topic. Engineering after all is application of science and physics all around! If you can understand the terms like force, velocity, speed, distance, torque, pressure etc, you are knowledgeable enough to take this course. And don't forget the answer to previous question. I will be there with you to help in any doubts you have!</p><p><strong>3. Are there any activities in the course? or is it only for passive learning?</strong></p><p><strong></strong>Yes and No.</p><p><strong>This is an Activity - based course. </strong>There are activities in each section of the course. And by activities, I don't just mean simple quizzes but much more. </p><p>There will be - </p><p>1. An activity on making a (working) measuring device at your home, </p><p>2. An activity by which you will find out your location similar to how people used to do years back. </p><p>3. Experiment to do at home -  to learn (and bust some myths) associated with airfoil. </p><p>All these will be enhanced by presence of additional regular quizzes in between too. It will be great fun to have you do all the activities and enhance the learning.<br></p><p><strong>4. How long the course will take to complete?</strong></p><p>You can finish all the videos and write-ups in 3-4 hours. Since this is an activity based course, I would recommend keeping around one day for finishing all the activities.</p><p><strong>5. How did you get inspiration to make this course?</strong></p><p>I realized that there are very few sources online, that take the topic of submarines and explain it from basics. Plus, I was really fascinated when I learnt about submarines and its Evolution. This prompted me to make my third course on submarines.</p><p><strong>7. What if I realized, after completing the course, that it was not helpful?</strong></p><p>You will get complete refund of your money spent - with 30 days money back guarantee.</p><p><strong>8. Any additional free stuff?</strong></p><p>Yes! You will get a detailed book written by me on Bicycle - An engineering marvel.</p><p><strong>9. I have some more queries, which are not answered here?</strong></p><p>Click on my name on top to get an option to drop a message. I am very easily approachable.</p><p><strong>10. I wish to enroll, how do I proceed?</strong></p><p>Great! Click \"Take This course\" button on right hand side of the page. You will get the step by step instructions.</p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Fundamentals of Submarine Engineering", 
    "price": "20.00", 
    "instructors": "Arjit Raj", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568266_0b2a.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-submarine-engineering/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T13:10:37Z"
}