{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><em style=\"\"><em style=\"\"><strong style=\"\">If you can understand my language in the promo video, I GUARANTEE you of an awesome journey of learning. Else, ENTIRE MONEY will be refunded - EVEN AFTER 30 DAYS!</strong></em></em></p><p><strong style=\"\">&quot;Fundamentals of Airplane Engineering&quot;</strong></p><p>You don&#039;t need to have a degree in Aerospace or Mechanical Engineering to understand working of Airplanes! </p><p><strong style=\"\">[ All students are promised to get reply to their queries within 24 HOURS in this course ]</strong></p><p>This course is all about learning the working of airplanes right from basics. The course will take you on a journey in which you will learn all about airplanes piece by piece. We will take the journey in four parts. <strong style=\"\">I also promise you of within - 24 hour - reply - to - any - genuine - query, so that your learning is concrete.</strong></p><p><strong style=\"\">STEP 1:</strong> We will take a passenger airplane standing on a runway and understand its different components - engines, wheels, landing gear, main body structure etc.</p><p><strong style=\"\">STEP 2:</strong> We will turn the engine on and let the airplane move forward. During this period we will learn all about the flight. How a plane flies and what actually is needed for a successful flight to happen. We will also bust some very common myths surrounding this topic. This will involve an <strong style=\"\">experiment</strong> which students can do at home.</p><p><strong style=\"\">STEP 3: </strong>Now the airplane is flying, we will see different components and their working, which helps the airplane to take various turns and undergo variety of motions.</p><p><strong style=\"\">STEP 4: </strong>Finally, we will jump in some other topics that are important for any airplane to work smoothly. Air Traffic control, Black Box, Cockpit, How exactly the pilot does the controls.</p><p>I will not be using unnecessary jargon and terms that only an engineer will be knowing! The journey will be for people from variety of backgrounds. So even if you are a person involved in photography, or making websites or travelling through forests, you can happily enroll in the course, if you have interest in knowing about Airplanes!</p><p>The course will be mostly in form of video lectures, where I will be explaining the different components using diagrams on whiteboard. For very complicated diagrams, I will be including images and pdfs so that your understanding can become concrete. It can take a total of 2-2.5 hours for completing the entire course.</p><p>To make this more interesting, I promise to reply to each and every genuine queries of the students, irrespective of the level of toughness of the query! I wish to have every student enrolled in the class,enjoy this journey with me.</p><p>At the end of the course, you will have a strong understanding of what happens inside and outside the airplane and how different components work together in making a airplane the way they are!</p><p>Come, join me in this beautiful journey!</p>", 
    "end_date": null, 
    "title": "Fundamentals of Airplane Engineering", 
    "price": "30.00", 
    "instructors": "Arjit Raj", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475688_cb7f_6.jpg", 
    "course_url": "https://www.udemy.com/airplane-engineering-from-zero-to-100-for-everyone/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T05:32:53Z"
}