{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p></p><p>As science  and spirituality increasingly merge, a new worldview is concurrently emerging  that embraces the idea that energy and consciousness (the physical and  metaphysical experience of reality) are a unified whole, and that all “things”  are entirely and instantly interconnected as one. Building upon the  foundational research of Buckminster Fuller, Arthur Young, David Bohm and other  20th century pioneers, a contemporary understanding of the fundamental  patterns, structures and dynamics of the “cosmic geometry” that underlies  universal manifestation is informing this worldview with elegance and  precision. </p>  <p>The  insights of both scientific and sacred geometry that have grown over centuries  of inquiry are now revealing an increasingly accepted model of a fractal and  holographic universe, wherein the whole is found to be present in every  &quot;part&quot; at every scale, from micro-atomic to macro-galactic.</p><p>In  Fundamentals of Cosmometry, we‘ll explore the basics of this model and the  foundational research that supports it, including some of the most contemporary  knowledge from today‘s pioneers. We‘ll also look at ways in which this  knowledge pertains to our own Human Experience, as well as practical  applications in various fields.<br style=\"\"></p><p>  </p><p><strong style=\"\">This course consists of 6 Sections and 24 visually-rich presentations.&nbsp;</strong></p><p><strong style=\"\"><em style=\"\">(NOTE: This course was originally presented and recorded live as an online webinar series.)</em></strong></p><p>Topics  include:</p>  <p><strong style=\"\">SECTION 1:  Foundational Concepts: The Holographic Whole</strong></p>  <p><strong style=\"\">SECTION 2:  Starting from Zero: Understanding the Unified Field of Infinite Energetic and Creative  Potential</strong></p>  <p><strong style=\"\">SECTION 3: Structural  Cosmometry: Exploring the “Tensional Integrity” of Manifestation</strong></p>  <p><strong style=\"\">SECTION 4:  Flow Process: The Torus as Fundamental Dynamic System</strong></p>  <p><strong style=\"\">SECTION 5:  Field Patterning: Radials, Waves and Spirals</strong></p>  <p><strong style=\"\">SECTION 6:  Bringing It All Together: Applications and the Human Experience</strong></p>  <p>This is a  very visual and conceptual exploration, not requiring any mathematical or  deeply technical knowledge of physics or sacred geometry. We will touch into  these realms just enough to build an understanding of the basics of cosmometry  with the objective of seeing the beauty of the integral wholeness that creates the  magnificence of life on Earth and beyond.</p><p><strong style=\"\"><em style=\"\">Testimonials:</em></strong></p><p><em style=\"\">&quot;This course and  our discussions brought the geometry &quot;alive&quot; for me – within me – so now  I am feeling it as much as thinking it. Such excellent, broad and deep  material. Such coherent mind, heart and body unity. Such stellar visual images...&quot;</em></p><p><em style=\"\">&quot;Awesome class! I  have been moved and transformed beyond the ability of words to sufficiently  describe.&quot;</em></p><p><em style=\"\">&quot;Thank you for your wonderful&nbsp;course and the way you present it!&nbsp;It has truly been a life-changing experience  which&nbsp;has&nbsp;ignited&nbsp;something&nbsp;inside me - a&nbsp;living  energy/consciousness.&quot;</em></p><p><em style=\"\">&quot;I feel an absolute thrill with the information you&#039;re presenting in  these sessions, Marshall... I looove how it demonstrates the true interconnectedness of all things, and  the pattern which underlies All. It’s something I’ve always strongly sensed,  and my whole Being comes alive with the recognition of the truth of what you’re  sharing. Can’t get enough of it!!&quot;</em></p><p><em style=\"\">&quot;It was  illuminating! &nbsp;And I appreciated how you &#039;took us by the hand&#039; and slowly  introduced even the hardest subjects.&nbsp;My mind blew out a few times - but  now it seems to be working in a much more expanded way. Your class really  connected many dots for me.&quot;</em></p><p></p><p></p>  ", 
    "end_date": null, 
    "title": "Fundamentals of Cosmometry", 
    "price": "50.00", 
    "instructors": "Marshall Lefferts", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/34427_bbcf_7.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-cosmometry/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-04T00:07:15Z"
}