{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>If you need help with Physics, you're in the right place. The Physics<br> Boot Camp team has decades of experience of helping students of all <br>abilities <em>improve their GCSE Science Grade.</em></p>\n\n<p>This course includes <em>video lectures</em> for every section, <em>downloadable worksheets</em> (with answers) for practice and a <em>summary quiz</em> for each section. Before you spend money on a private tutor, try our course - you can access the course when and where it suits you and the whole unit <em>costs less than one session</em> with a tutor!</p>\n\n<p>This course covers the unit <strong>P4 - Radiation for Life</strong>, which is part of the <strong>OCR Gateway Additional Science </strong>or <strong>Physics B </strong>course. If this is not your exam board or course, then check out our instructor page for a suitable course for you.</p>\n\n<p>In this unit you will learn about why some materials are radioactive, the <br>properties of the three different types of radiation, their uses and <br>effects. You will also learn how circuits work, how static electricity occurs<br> and the use of electricity in the home. <br></p>\n\n<p>We use our expertise from helping <em>thousands </em>of students to highlight the <em>key areas that you need</em> for your exam, along with helping you <em>avoid the mistakes</em> that everyone else makes!</p>\n\n<p>Background music: Nicolai Heidlas - Sunny Afternoon, Hawaiin Winter, Summertime<br></p>", 
    "end_date": null, 
    "title": "GCSE Physics (OCR Gateway) P4 Radiation for Life", 
    "price": "20.00", 
    "instructors": "Michael Hall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801744_a0df.jpg", 
    "course_url": "https://www.udemy.com/ocr-gateway-p4-radiation-for-life/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T09:49:41Z"
}