{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \tThe demand for my basics course was so high, I decided to expand it and charge a small fee for the extra time and effort for pulling these lectures and external resources together.  The first expansion includes explanation and practice for about a quarter of the Common Core standards.  Specifically it includes all the “Congruence” standards which encompasses the new focus on transformations as well as a lot of traditional two column proofs.  Eventually I hope to make it to make it through all of the Common Core standards - either here or in other courses.  </p>  <p>  \t  THE BASICS - The original Course:  </p>  <p>  \t Having taught Geometry for almost a decade, I&#039;ve learned that one of the biggest challenges is simply the vocabulary.  This first (and original) section is a very broad overview of Geometry and the language that it uses.  If you&#039;ve never heard this vocabulary, this will introduce it. If you have, this will reinforce it and put it into context.  </p>  <p>  \tSaid another way there are a few different kinds of students who would benefit from this section:  </p>  <ul>  \t<li>Those who are about to take Geometry</li>  \t<li>Those who are taking Geometry and want a review or another perspective</li>  \t<li>Those who are curious as to the overall nature of Geometry but not wanting to take time for an entire course</li>  </ul>  <p>  \tSome of the vocabulary and concepts discussed are used in every day conversations, whereas others are specialized and not usually found in everyday conversation (I&#039;m looking at you, hypotenuse!). Some of these terms SHOULD be familiar while others will not be. The course also includes a lot outside resources to practice as well as Udemy-style quizzes.  </p>  <p>  \t There&#039;s an old joke about what you remember from a college course five years after you&#039;ve taken it. For Economics, it&#039;s supply and demand. For Chemistry, it&#039;s the periodic table is the organization of the elements. For English Composition, it&#039;s always start with an outline. This limited course is along those same lines: it will give you the general feeling for topics in Geometry without many of the details.  </p>  <p>  \t The first section could be watched in one sitting if you don&#039;t do any of the exercises. A better way to take it would be to target one day for a week to watch one video (less than 10 minutes) and then spending 20 minutes after each lecture to explore the additional material that&#039;s included.  </p>  <p>  \tSECTION 2 - Common Core Congruence Standards  </p>  <p>  \tFirst, a word about Common Core.  IF you live in a state that has rigorous Mathematical Standards, Common Core is simply a nationalized version of a variation of what has been taught over the last 20 years.  It stresses some new topics and ignores some traditional stuff, but it’s simply a road map for a GIANT TOPIC.  In 180 school days, only so much can be learned about any given field - these standards attempt to point out what’s important and what’s not: Both in general and related to what will be on State/National assessment tests.  </p>  <p>  \tThere are 13 standards related to “Congruence” in the New Common Core and this section explains (at varying levels of depth in it’s first iteration) all of them.  I attacked this first because it had transformations in it and it was the one topic I knew I would have to do a fair amount of research on before I could teach it.  </p>  <p>  \tThis section is primarily for students:  </p>  <ul>  \t<li>Interested in learning more about transformations and why they have become a new item of importance</li>  \t<li>Need more and different examples of two column proofs and strategies for solving these.</li>  </ul>", 
    "end_date": null, 
    "title": "Geometry - The Basics & Beyond", 
    "price": "20.00", 
    "instructors": "Michael Taylor", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346464_df8f_2.jpg", 
    "course_url": "https://www.udemy.com/geometry-the-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-16T18:51:50Z"
}