{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<ul>  \t<li><em><strong>Accelerate your learning NOW for only $20</strong></em></li><li><em><strong>Join the hundreds of  students who enrolled to learn how to learn quickly and remember.</strong></em><em></em></li><li><em><strong>Get study tips</strong></em></li><li><em><strong>Learn how to stay calm and confident in exams.</strong></em></li><li><em><strong>For students of all ages.</strong></em></li></ul>\n\n<p>  \t                      Ever wondered why some students are able to learn quickly, get great grades and still have time for fun?  </p>\n\n<p>  \t<strong>At the end of this course, you will know  how your brain works and how you can use simple study tips to access the Learning part of your Brain. </strong></p>\n\n<p>You will</p>\n\n<ul>  \t<li>feel calm and confident with your test prep.</li>  \t<li>know that you can calm yourself quickly and easily with simple study skills.</li><li>be able to accelerate learning.</li>  \t<li>get outstanding exam results.</li>  \t<li>find that you can balance time for learning and time for fun.</li>  </ul>\n\n<p>  \t                      The course is made up of a lesson for each Study Tip. Over my 40 years of teaching Science, Mathematics and Reading, I have developed this series of tips that can help you learn.  </p>\n\n<p>  \t                      Each of the Learning Tips is based on current research and theory of how the human brain works and how learning takes place.  </p>\n\n<p>  \t                      To use these tips, listen and read and use one of the skills each week of the school year, just like I do with my classes. Make posters and infographics of each Secret. Put these on your study wall. Use the accelerated learning skilss to learn the tips!  </p>\n\n<p>  \t                      Over time, you will use the tips from previous weeks and gradually build up your skills in learning. You will see your results increase very quickly.  </p>\n\n<p>  \t                      Learn life long skills: how to <em><strong>learn, unlearn, and relearn</strong> … the new literacy of the 21st century, </em>(Alvin Toffler).  </p>\n\n<p>  \t                      Enrol now to download<strong> your FREE ebook.</strong>  </p>\n\n<p>  \t<strong>Enjoy confidence in your learning and high self-esteem.  </strong>  </p>", 
    "end_date": null, 
    "title": "Get Great Learning Skills and Have More Time for Fun!", 
    "price": "20.00", 
    "instructors": "John Terrey", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383696_f9b1_3.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-learning-learn-quickly-get-more-time-for-fun/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T02:42:15Z"
}