{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>¿Te gusta viajar por el mundo? ¿Te gustaría ver información geolocalizada? ¿Quieres ver las pirámides de Egipto en 3D?</p><p>Conviértete en un verdadero experto en Google Earth Pro y aprovecha que ahora este programa es <strong>gratuito</strong>.</p><p>Para particulares, profesionales, profesores, académicos, alumnos, etc. Todo el mundo puede usar este software y emplearlo en su ámbito correspondiente. </p><p>------------------------------------------------------------------------------------------</p><p>Google Earth es un software que permite observar mediante vistas satelitales, pero también mediante <em>'street view', </em>nuestro planeta Tierra. Ahora la versión <strong>Pro</strong> es totalmente <strong>gratuita</strong> y permite acceder a todas las funciones avanzadas.</p><p>Tanto si eres un <strong>particular</strong> que solamente quieres 'viajar' por el mundo, como si eres un <strong>profesional </strong>que lo va a utilizar para colocar información y generar mapas, este curso te será de utilidad.</p><p>Este programa también es una herramienta más que interesante para el <strong>mundo educativo</strong>, ya que es posible complementar las asignaturas con actividades vinculadas a Google Earth (por ejemplo ver formaciones geológicas, realizar ejercicios de geografía, historia, etc...)</p><p>El curso esta estructurado en <strong>4 secciones</strong>:</p><ul><li><strong>Introducción</strong>: Aprenderán a buscar lugares, introducir coordenadas y manejar las diferentes secciones de la interfaz de Google Earth Pro.</li><li><strong>Añadir información</strong>: Aprenderás a añadir marcas de posición, líneas y polígonos. Cargar información en diferentes formatos e importar datos de un GPS.</li><li><strong>Exportar información</strong>: Aprenderás a organizar tus capas y crear archivos kmz. Exportarás imágenes y crearás tours.</li><li><strong>Opciones avanzadas</strong>: Aprenderás a usar la regla y calcular áreas y perímetros. Añadirás fotos y conocerás el historial de imágenes.</li></ul><p>Cada sección va acompañada de una serie de <strong>ejercicios</strong> y preguntas para practicar los conceptos vistos, así como documentación en <strong>PDF</strong> descargable.</p>", 
    "end_date": null, 
    "title": "Google Earth Pro. Llega a experto desde cero.", 
    "price": "30.00", 
    "instructors": "Carles Fernández", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636204_bb78_5.jpg", 
    "course_url": "https://www.udemy.com/introduccion-a-google-earth-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T21:44:01Z"
}