{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t <em>   If you are bored or habitual of using calculators too often and want to learn short tricks to make yourself more efficient in percentage calculation, this is the course you should take. This course is for all those people who want to learn to calculate percentages in head in seconds and as mentioned earlier there is no rocket science involved but just plain simple common sense in numbers.</em>  </p>  <p>  \t <em><strong>   Once you take this course you will be more productive and efficient in every aspect of life in which percentages are involved, be it School,College or Work</strong>. A lot of tricks discussed in the course actually take lesser time than what you take if you calculate the same by a calculator.</em>  </p>  <p>  \t <em>   The course content is around 150 minutes but it is advised to take breaks between sections and practice the tricks discussed in them.</em>  </p>  <p>  \t <em>   The course is structured over 5 Sections and 15 lectures and you will get to learn the following:</em>  </p>  <ul>  \t<li><em>That there are only two kinds of calculations involved in percentages. </em></li>  \t<li><em>5 sec short tricks for some commonly occuring cases.</em></li>  \t<li><em>How to calculate any percentage of a number in seconds.</em></li>  \t<li><em>How to calculate a number is what percentage of another (Including Complicated cases) in seconds.</em></li>  </ul>", 
    "end_date": null, 
    "title": "GRIP ON PERCENTAGES -  Do any PERCENTAGE CALCULATION in SECS", 
    "price": "25.00", 
    "instructors": "Saurabh  Moharikar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260112_5f1f_7.jpg", 
    "course_url": "https://www.udemy.com/grip-on-percentages/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-12T11:28:20Z"
}