{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t                        Solving Linear equations is a fundamental skill that all high school math students must master if they wish to succeed in mathematics.  Ace your next math test and rise to the top of your class!  </p>  <p>  \t                                            This course contains everything you will need to know to solve any linear equation:  </p>  <ul>  \t<li><strong>32 lectures</strong> with <strong>150 minutes of video content</strong></li>  \t<li>20 example questions with <strong>full step-by-step video guided solutions</strong> for each of the 4 types of linear equations that students will encounter</li>  \t<li><strong>Practice sheets</strong> loaded with 32 practice questions with numerical answers provided to help students master equation solving!</li>  \t<li><strong>Challenge questions</strong> covering all 4 types of linear equations</li>  \t<li>A full video guided solution to each challenge question</li>  \t<li>A downloadable <strong>course e-book</strong> containing Karim&#039;s 5 simple steps to solving linear equations along with all the practice sheets and challenge questions and quiz solutions in one pdf file for easy reference</li>  \t<li>A short <strong>quiz </strong>with full solutions provided in the course e-book</li>  </ul>  <p>  \t  Here&#039;s a testimonial from Alexander, one of my high school students:  </p>  <p>  \t  &quot;<em>Karim is a great teacher that is motivating and patient. Every time I go  to see him he gives me warm-up questions that are very challenging and  causes me to think outside the box. He also comes up with strategies, steps and formulas for  concepts that were very difficult for me to understand that have helped  me to gain a better understanding of them. Karim is one of the best  teachers not just because of his knowledge but also because of his work ethic  and attitude.  :)</em>&quot; -Alexander  </p>", 
    "end_date": null, 
    "title": "How to Solve Linear Equations in 5 Simple Steps", 
    "price": "20.00", 
    "instructors": "Karim Premji", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/300836_abbf_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-solve-linear-equations-in-5-simple-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-15T19:01:28Z"
}