{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This course offers a series of lectures for thesis students and supervisors alike: taking the student throughout their journey from start of topic conceptualization to finalizing conclusions and recommendations. The series is suitable for any stage: whether you are venturing out on a new topic for supervision or are half-way through the thesis.<br></p><p>This course uses examples in the field of Medical Image Processing, yet other Thesis areas and specializations may apply similar strategies emphasized in this course. Medical Image Processing is selected as an exciting field for research students and lecturers interested in algorithm design and development, for detection and classification of structures and anomalies inside the human body that can be captured in an image data set.<br></p>\n\n<p>With over 15 years of experience in academic Thesis supervision, including medical image processing, and having supervised a range of theses (topics and levels), I have compiled material that offers support, guidance, advice and teachings, using this research specialization as an example.</p>\n\n<ul><li>Recommended Level: PhD, Masters or Bachelors (Honors, Level 4) Candidates by research, or Supervisory in those areas.</li><li>Interest Areas: Medical, Engineering, Computer Science, with emphasis in Medical Image Analysis, Classification, Decision Support Systems</li><li>Desirable Skills: Algorithm Development, Programming (moderate), Image Processing</li><li>Included in this Course:<ul><li>15 modules in total: Approach, Methodologies, Performance and Strategies, as well as Writing (Documentation) in this specialization.<ul><li>Handouts, Examples, Working Sheets, Quizzes</li></ul></li></ul></li><li>Outcome: this course seeks to provide advice, support and guidance throughout the thesis journey, highlighting important criteria for submission success such as in this specialization.</li></ul>", 
    "end_date": null, 
    "title": "How to Get a Thesis: for Students and Supervisors", 
    "price": "25.00", 
    "instructors": "Dr. Catherine Todd", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759334_b659_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-thesis-for-students-and-supervisors/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T06:04:14Z"
}