{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>Master Your Casio Calculator and make sure you have the complete calculator skills required for you to get the grade you want in the exam or teach your students how to use their calculator effectively. Updated April 2016! </strong></p>\n\n<p><strong>What benefits do I get from this course?</strong></p>\n\n\n\n<p><strong><strong>⇩⇩⇩⇩⇩</strong> Click here for more!<br></strong></p>\n\n\n\n<ul><li>Use your Casio scientific calculator with confidence both in the classroom and during exams. </li><li>Explore mathematics in new ways with the helpful features of the Casio calculator.</li><li>Apply your knowledge of these calculator functions to questions you might encounter in your math related course.</li><li>Access all the unique and powerful functions of a modern scientific calculator.</li><li>Impress your friends or teacher ...or students with your calculator skills.</li><li>Includes exclusive content not available on the YouTube channel - The Calculator Guide</li></ul>\n\n\n\n<p>✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰✰<br></p>\n\n\n\n<p>For less than the typical price of an hour's private teaching, the course will take you through many of the impressive functions of the\n calculator, step-by-step, telling you which buttons to press and how \nthey can be used to help you with questions. <br></p>\n\n\n\n<p>In this course you are going to gain mastery over your calculator. Maybe you are curious as to how the features and functions can help you with your mathematical learning, build you confidence and succeed in your mathematics exam. <br></p>\n\n\n\n<p>With this course you get 1080p HD videos and a full demonstration with a calculator emulator of the buttons you need to press.<br></p>\n\n\n\n<p>You also get updates and bonus extras, which will be added to the course.</p>\n\n\n\n<p>You also get access to ask me questions regarding the course or anything you are stuck on.</p>\n\n\n\n<p>In buying this course you are helping support me to continue to make more courses to help you and future students feel confident about using their calculator.</p>\n\n\n\n<p>So if you are currently using a Casio calculator, then what are you waiting for? Make the most out of your calculator, be confident and achieve the qualification you want.</p>\n\n\n\n<p><strong>About the calculator.</strong></p>\n\n\n\n<p>This course assumes that you have a Casio calculator or have regular access to one. </p>\n\n\n\n<p>It is primarily designed for the <strong>FX-83GT Plus / FX-85GT Plus</strong> available in the UK. Similar textbook display or Natural V.P.A.M calculators are known by different codes around the world.</p>\n\n\n\n<p><strong>FX-300ES Plus, </strong><strong>FX-350ES Plus, fx-82DE PLUS, fx-82ES PLUS, fx-82ZA PLUS, fx-83GT PLUS, fx-85DE PLUS, fx-85ES PLUS, fx-85GT PLUS, fx-86DE PLUS, </strong><strong>FX-95ES Plus, </strong><strong>FX-500VN Plus, </strong><strong>FX-82AU PLUS II and others</strong></p>\n\n\n\n<p><strong>And silver edition models </strong></p>\n\n\n\n<p><strong>FX-991ES Plus, </strong><strong>FX-115ES Plus, </strong><strong>FX-570ES Plus, </strong><strong>FX-100AU PLUS, </strong><strong>FX-991DE</strong></p>\n\n\n\n<p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "How To Master Your Casio Calculator -Total Calculator Skills", 
    "price": "20.00", 
    "instructors": "Steven Gardiner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624774_393c_6.jpg", 
    "course_url": "https://www.udemy.com/master-your-casio-calculator-and-get-ready-for-math-success/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T14:36:45Z"
}