{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Its unfortunate that <strong>our schools don’t teach the basics of finance, saving and investment to our kids</strong>. As an adult, don't you wonder why our schools don't make it mandatory for children to take finance classes? In fact, isn’t that what all our adult problems are these days – thinking about managing our finances, our loans etc.? Just imagine as kids if we were knew this stuff, we would be on our way to a successful retirement a lot earlier than expected.</p><p>That’s why we're here today. Over the past 2 years, our course instructor has been teaching at Chicago’s public schools – <strong>the basics of stock market investing to 8th grade students as part of their Math class</strong>. This course is the online version of the same class.</p><p>At the end of it, you will all <strong>be prepared to invest in the stock market</strong>. So next time you give your kids some pocket money or they earn some, they will know exactly where to put it – in the stock market and watch that money grow. If they don’t have any money, not a problem, we'll <strong>show you exactly how to paper trade</strong>, so they'll be ready when you have some.</p><p>So parents, get your kids onboard, get them a notebook, get them ready to take some notes and lets get started. Its going to be a lot of fun. </p><strong>WHO IS THIS COURSE FOR?</strong><ul><li><strong>Middle and High school students</strong> who are interested in learning the basics of investing in the stock market. </li><li><strong>Entry level investors</strong> who want to learn the absolute basics of stock market investing before they get started. </li></ul><strong>COURSE OUTLINE</strong><ol><li><strong>What is the stock market</strong> and why is it important?</li><li>How to <strong>pick the right stocks</strong>?</li><li>Understanding <strong>Price and Earnings</strong> to make good investment decisions. </li><li>When to <strong>sell a stock</strong> and how to measure return on investment?</li><li>The importance of <strong>Diversification</strong></li><li>The Importance of <strong>Savings, Investing and Compounding Interest</strong></li><li><strong>Bonds</strong></li></ol><strong>WHAT DO YOU GET WITH THE COURSE?</strong><ol><li><strong>155 page kid friendly detailed presentation in pdf</strong> format walking you step by step through the entire course.</li><li><strong>24/7 support access</strong> at any point of time for any questions. </li></ol>", 
    "end_date": null, 
    "title": "How to Trade the Stock Market - For School Students", 
    "price": "20.00", 
    "instructors": "Coursetake Course Marketplace", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759254_cd3d_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-trade-the-stock-market-for-school-students/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T04:02:27Z"
}