{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Watch the promo video above to see why you must join this course and how you can master all there is to know about percentages in 2 hours. (1 hour of video instruction PLUS question practice with solutions)</strong></p><p style=\"\">This course is based on my many years as a college lecturer of mathematics and seeing how many students have received so much misguided information on percentages in their previous schooling. </p><p style=\"\">Many students who I have taught are able to grasp the concepts quickly and are able to solve many related problems. </p><p style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p style=\"\">Now just imagine how you are going to feel once you have finally worked out how to deal with percentages. </p><p style=\"\">Whether you are a student looking to improve your math skills or a parent trying to teach your own children, any feelings of being overwhelmed just by looking at percentages is going to disappear. The entire experience is going to be quick, easy and it is also going to be fun. </p><p style=\"\">Once you have completed this course it really will have an impact on your performance in school but also in the real world as percentages are used in my scenarios. </p><p style=\"\">In this course you are going to master the following skills:</p><ul style=\"\"><li style=\"\">Be able to define what a percentage is </li> <li style=\"\">Understand the relationship between fractions and percentages</li> <li style=\"\">Be able to use multiple methods to answer percentage questions</li> <li style=\"\"> How to quickly determine the profit or loss of anything using a simple formula</li> <li style=\"\">And more....</li></ul><p style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p style=\"\">This is what some of my private student&#039;s have said about my teaching ability:</p><p style=\"\"><strong style=\"\">Alexandra Mason</strong></p><p style=\"\">Hi Sadhiv, I&#039;ve just picked up my results and I&#039;ve got an A* in maths!! I got 100 in my resit and 99 in C4! I found the exam really really hard, but I did it! I just wanted to let you know and thank you for all the help you gave me this year, I would not have been able to do it with out you!! I hope you are and your daughter are well, and enjoy the rest of your summer holiday! Thank you so so much, Alexandra xx</p><p style=\"\"><strong style=\"\">Jenny Matthews</strong></p><p style=\"\">Hi Sadhiv,  Yeah I got an A*, I am so so happy! Thank you for everything you did! Jenny</p><p style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p style=\"\">With this course:</p><ul style=\"\"><li style=\"\">Price of the course will increase with demand<strong style=\"\"></strong></li> <li style=\"\">Once a member you will receive lifetime updates at no extra cost, ever<strong style=\"\"></strong></li> <li style=\"\">Any future lessons will always be free<strong style=\"\"></strong></li> <li style=\"\">If you have any questions, whether they are questions set in the course, your homework from school or a situation that you have seen in the real world related to percentages, send me a message through the discussion forum and I will get back to you<strong style=\"\"></strong></li></ul><p style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p style=\"\"><strong style=\"\">30 Day Money Back Guarantee </strong></p><p style=\"\">Do not forget that this course with a 30 day money back. What this means that you have absolutely no risk in taking this course. If you feel that you are not learning then just ask for a refund and no questions will ever be asked – you will receive a 100% refund promptly</p><p style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p style=\"\">This course is going to continue to grow with new lessons, new questions and more techniques....<strong style=\"\">but also means that the price will also need to grow! </strong></p><p style=\"\">Take the course at the great price that you see today because as mentioned as the course grows so will the price. </p><p style=\"\"><strong style=\"\">But if you join today then you are LOCKED IN and you will receive any new lessons at no extra cost – ever!</strong></p><p style=\"\"><strong style=\"\">Lifetime access is available but you must take action and join today</strong></p><p style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p style=\"\">Take action and click on the “Take This Course” button in the top right hand side of this page and follow the instructions that are then provided</p><p style=\"\">If you don&#039;t act today then classes in school will continue to be difficult or as a parent trying to help your children learn percentages will become frustrating. And remember percentages exist in the real world from real estate to buying and selling a car. </p><p style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p style=\"\">Just imagine how you are going to feel when you fully understand percentages. Any fear that you currently might have is just going to disappear! </p><p style=\"\">Remember the course comes with a 30 day money back guarantee so you have no risk in taking this course. </p><p style=\"\">Imagine the satisfaction you are going to feel when you are more successful when working with percentages – in school, as a teacher and in life</p><p style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p style=\"\"><strong style=\"\">Take action and click on the blue “Take This Course” button now</strong></p>", 
    "end_date": null, 
    "title": "How to do percentages in less than 2 hours ", 
    "price": "45.00", 
    "instructors": "Sadhiv Mahandru", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566384_46d7_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-percentages-in-less-than-2-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T19:00:23Z"
}