{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This prep course is meant for university or college students who are considering a career in Naturopathic Medicine. This course may also apply to those who are working and considering a career change into Naturopathic Medicine. It is not for those who are already enrolled at a Naturopathic Institution and it is not for Naturopathic Doctors.</p>\n\n<p>This course is a step-by-step guide to determining if becoming a Naturopathic Doctor is the right career path for you. We walk through the day to day work, common obstacles, and discuss the earning potential of various career paths in Naturopathic Medicine.</p>\n\n\n\n\n\n<p>There are 10 videos included with full lecture notes available. The course should take approximately 2 hours to complete. It is structured in 4 major sections with specific goals for each. After the first section, you should have a good sense of how much it costs to become a Naturopathic Doctor, what the work is like, what the challenges are, and how much money you can make. After the second section, you should know where and how to apply to an accredited institution. After the third section, you should understand how the interview process works and the key to a good interview. The fourth section should give you some guidance on how to proceed after graduation, but knowing these things ahead of time can help you plan ahead. </p>\n\n\n\n\n\n<p>Overall, the course is perfect for anyone thinking about becoming a Naturopathic Doctor who wants to obtain accurate information from an unbiased and experienced source.</p>", 
    "end_date": null, 
    "title": "How To Become A Naturopathic Doctor", 
    "price": "50.00", 
    "instructors": "Chris Habib", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753710_7c6e.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-naturopathic-doctor/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T19:29:02Z"
}