{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Many students struggle in secondary level Math despite doing well in primary schools. The most common reason is “My child is weak in Algebra”.</p><p>This course is designed to help your child to master Algebra. In order to do well in secondary level math, your child must be very strong in his Algebra. Algebra foundation has to be built up from Secondary 1. Many topics in later years require a strong grasp of Algebra too.</p><p>There is no shortcut to master Algebra. Practice is essential. Your child need to put in lots of practice. However, doing lots of questions is not the key. He needs to do the <strong>right types</strong> of questions. He needs to know what the different types of questions are which will appear in exams. Then your child needs to practice questions from each type until he is confident that he has mastered them.<br><br></p><p><strong>What will you get from this course?</strong></p><p>– Key Concepts of Each Topic</p><p>– Common Exam Questions</p><p>– Assignments at the End of Each Topic to test your child’s understanding (Lots of Questions to ensure sufficient practice)</p><p>– Unlimited lifetime access to this course, (Your child can re-watch it anytime he want)</p><p>– Support from me (You can post your question in the discussion board and I will help you)</p><p>- You can email me any algebra questions and I will help you too</p><p>– 1 lesson is broken down into a series of videos, notes and assignments. <br><br></p><p><strong>Topics Covered:</strong></p><p>1. Algebraic Substitution</p><p>2. Algebraic Simplification and Expansion</p><p>3. Algebraic Fractions</p><p>4. Algebraic Factorization</p><p>5. Solving Linear Equations</p><p>6. Solving Equations with Brackets</p><p>7. Solving Equations with Fractions<br><br></p><p><strong>How to learn from this course?</strong></p><ol><li>Start from the first topic. Watch the lessons first. Then download the assignment and do the first 5 questions. After doing the questions, check the answers which I have provided and make sure you are correct.</li><li>If you have any mistakes or you are stuck with any question, circle the question number and learn to spot your mistakes. Do your corrections till you get the correct answer.</li><li>Once you have solved correctly and feel that you are <strong>comfortable </strong>with this topic, then continue to the next topic and repeat the same process.</li><li>If you feel that you are still not comfortable with that topic, <strong>do not</strong> jump to the next topic. Continue with the rest of the questions until you know you have mastered the topic. How will you know? Simple. After you have solve the questions, check the answers and make sure you are correct. If you are consistently correct, it means you have mastered that topic and you are ready to move on.</li><li>Before your test or exams, simply look through the questions again and <strong>focus</strong> on the questions which you have circled. Re-do them or look through the solutions again to make sure you can do the questions.</li></ol><p><strong>Who should attend this course?</strong></p><p>– Secondary School Students</p><p>– Parents are welcomed to learn together<br><br></p><p><strong>Why take this course?</strong></p><p>– Master your Algebra from Secondary 1!</p><p>– Learn at your own pace, you can re-watch the videos again to make sure you understand.</p><p>– Learn anytime and anywhere you want!</p>", 
    "end_date": null, 
    "title": "Introduction to Algebra for Secondary Schools", 
    "price": "45.00", 
    "instructors": "Jimmy Ling", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650412_a8e3_2.jpg", 
    "course_url": "https://www.udemy.com/secondary-one-math-course/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-25T14:40:19Z"
}