{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>The course is about website survey sampling.</p><p>The terminology my target student would expect to find in my course is elementary technical statistical concepts like the mean, standard deviation, variance and standard error. The generic statistical business process model. The Statistics Canada Survey Methods and Practices.</p><p>The survey methodology part of the course is composed material from the Statistics Canada Survey Methods and Practices (2013 publication)-chapter one, chapter six: section 6.1, section 6.2.1, section 6.2.2, section 6.2.3, section 6.2.5, and section 6.2.6. The survey methodology part of the course is also composed of material from the United Nations Economic Commission for Europe (UNECE) Generic Statistical Business Process Model (Version 5) Word Document under the Creative Commons License. The R programming part of the course is composed of material from the Introduction to R manual. The website survey sampling software part of the course is composed of material from the KwikSurveys Free Software and Google Forms.</p><p>The course will take one hour and forty four minutes to complete.</p><p>The course gives students an introduction to website survey sampling. The course has a theoretical component composed of probability sampling, non-probability sampling, sample survey theory, website survey sampling software, introduction to R programming and statistical business process modeling. The applied component is composed of website survey sampling software.</p><p>Students have the option to register for the SAS OnDemand\nfor Academics program to access free SAS software educational bundle. The SAS\nsoftware educational bundle is closely related to the course material.\nRegistration for the SAS OnDemand for Academics program is required in order to\naccess the SAS software educational bundle.  </p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Introduction to Website Survey Sampling ", 
    "price": "25.00", 
    "instructors": "Instructor Hariz Naam", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595640_1783_6.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-website-survey-sampling-course/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T05:12:07Z"
}