{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t  El curso está divido en 15 lecciones básicas de la estadística, al final del curso habrás aprendido las lecciones con un duración total de 2.5 horas que prepara profesionales pluridisciplinares capaces de gestionar adecuadamente su formación estadística con el objeto de poder analizar de forma correcta y profesional cualquier situación en la que la \"incertidumbre\" tenga un papel relevante.</p><p>Hoy puede decirse que la recopilación y la interpretación de los datos obtenidos en un estudio es tarea de la estadística, considerada como una rama de la matemática. Las estadísticas (el resultado de la aplicación de un algoritmo estadístico a un grupo de datos) permiten la toma de decisiones dentro del ámbito gubernamental, pero también en el mundo de los negocios y el comercio.</p><p>La estadística como ciencia o método científico tiene un proceso de recolección, organización, análisis e interpretación de la información dentro de una población o muestra que permite tomar decisiones racionales en la realización de estudios, diagnósticos, proyectos, tipos de investigaciones, fenómenos aleatorios permitiendo, medir el grado de incertidumbre, probar hipótesis, investigación en busca de la productividad y rentabilidad económica de la Empresa. Esta formación debe permitir al profesional de la Estadística, al menos identificar la utilidad y la potencialidad de sus conocimientos en estos campos.  </p>", 
    "end_date": null, 
    "title": "Introducción a la Estadística", 
    "price": "30.00", 
    "instructors": "Neumann Business School", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401246_f833.jpg", 
    "course_url": "https://www.udemy.com/introduccion-a-la-estadistica/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T15:51:46Z"
}