{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<em>Introduction to Physics </em>is a comprehensive, self-paced video course for high school students, college students or anyone with an interest in the study of physics. </p>\n\n<p>  \t                                    Each lesson in <em>Introduction to</em><em> Physics</em> stresses conceptual understanding of physics principles commonly taught in both high school and college-level classes. In this course you will discover rigorous, conceptual video presentations of traditional and not-so-traditional topics in classical physics.  Each professionally-produced video offers an exciting array of audiovisual resources:  computer animations, close-ups of complicated experiments, mathematical equations, and historical re-enactments that provide a philosophical fabric for understanding the development of ideas of physics.  </p>\n\n<p>  \t                          The course lessons cover classical and modern physics topics in the following broad subject areas:  </p>\n\n<ol>  \t<li>Physics on Earth and In the Heavens</li>  \t<li>Conservation Laws and Fundamental Forces</li>  \t<li>Kinematics and Scientific Methods</li>  \t<li>From Kepler to Einstein</li>  \t<li>Electricity</li>  \t<li>Magnetism and Beyond</li>  \t<li>Modern Physics</li>  </ol>\n\n<p>  \t                                    All 28 video lessons are accompanied by student study guides that were field tested by high school physics teachers in both rural and urban communities.  Key terms and points to look for in the video are provided.  Short, simple and effective demonstrations are also included that tie into the concepts presented in the video.  Each lesson also includes a quiz for checking your understanding of the concepts presented.  </p>\n\n<p>  \t                                    So whether you are a student currently enrolled in a high school or college physics class, homeschooling, or simply interested in the machinery of the world, this is the course for you.  Upon completion, you will have a solid understanding of physics principles as well as a better appreciation of the role of mathematics in physics.  </p>", 
    "end_date": null, 
    "title": "Introduction to Physics", 
    "price": "20.00", 
    "instructors": "Intelecom Learning", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255182_d65f_4.jpg", 
    "course_url": "https://www.udemy.com/high-school-physics/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-03T16:17:33Z"
}