{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">The course is an introduction to the chemical reactor design and is constricted to the isothermal, constant density systems.  You&#039;ll learn the know-how of design of ideal batch reactor, plug flow reactor and the continuous stirred tank reactor. </p><p style=\"\"><strong style=\"\">Build a strong foundation which will help you tackle additional advanced topics in the chemical reactor design!</strong></p><p style=\"\"> In this course you will be able to:</p><ul style=\"\"><li>distinguish between batch and continuous operating mode</li><li>derive the mole balances which are the basis of the reactor design. </li><li>derive design equations</li><li>provide analytical solutions for the first and second order reactions</li><li>relate the parameters such as volume, conversion and reaction time to each other. </li><li>size flow reactors graphically using the Levenspiel Plot</li><li>compare  flow reactors graphically and discuss the meaning of  their differences.</li></ul><p>The course deals with ideal reactors which are strongly simplified models of real chemical reactors. It conveniently summarizes the introduction to the chemical reactor design with its user friendly, colorful and concise approach.</p><p>I designed this course mainly for students at undergraduate levels of chemical engineering. There are many equations  necessary to be understood in this course. Write them down many times and you are well on your way to <strong style=\"\">design</strong> and specify <strong style=\"\">chemical reactors</strong> confidently.</p>", 
    "end_date": null, 
    "title": "Introduction to the Chemical Reactor Design ", 
    "price": "20.00", 
    "instructors": "Jana Štromajer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274536_5d63_12.jpg", 
    "course_url": "https://www.udemy.com/chemical-reaction-design/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T15:05:11Z"
}