{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t        iSeahorse harnesses the power of “citizen scientists” — anyone, anywhere in the world who sees a seahorse in the wild — to improve our understanding of these animals and protect them from overfishing and other threats. These citizen scientists include divers, photographers, scientists, and other nature lovers. You don’t need to be a scuba diver to monitor seahorses; it is possible to find and count seahorses while snorkeling or walking along the shore at low tide as well. More than seahorse sightings, we want to find out if seahorse populations are declining, increasing, or staying stable through time, to monitor seahorse population trends. Through this course, you will learn how to contribute to the conservation of seahorses and their habitats by monitoring seahorse populations and sharing your data with iSeahorse. The data you collect will enable researchers to track population status, reveal potential impacts from human activities and discover new aspects of seahorse biology. Are you ready to get started?  </p>  <p>  \tCourse length = 55min  </p>  <p>  \t      This course is based on the iSeahorse Trends toolkit by T.-L. Loh, S. Foster and C. Knapp. Special thanks to M. Grzybek, R. Pollom, S. Finestone and K. Furnweger for reviewing course content and to Shedd P&amp;D for graphic artwork and video editing.  </p>", 
    "end_date": null, 
    "title": "iSeahorse Trends: Finding & monitoring seahorse populations", 
    "price": 0, 
    "instructors": "Tse-Lynn Loh, Project Seahorse", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/290390_e7a8.jpg", 
    "course_url": "https://www.udemy.com/iseahorse-trends-underwater-monitoring/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-29T21:27:31Z"
}