{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">This course is designed to help students self-prepare for the JEE/AIPMT engineering/medical entrance exams in India.</p><p style=\"\">This course will enable you to master all the concepts you need to know in Physical Chemistry to feel comfortable and confident about cracking the engineering/medical entrance exam. </p><p style=\"\">We cover<strong style=\"\"> chapters like Basic Concepts of Chemistry, Chemical Kinetics, Structure of Atom, Solid State, Electrochemistry, Chemical Equilibrium, Chemical Bonding, Solutions</strong> and provide </p><ul style=\"\"><li><strong style=\"\">Videos</strong> where we teach the basic concepts of physical chemistry.</li><li><strong style=\"\">Mind maps</strong> which contain the whole content of a topic in one single page, represented in the form of infographics which will able you to remember and retain the concept better</li><li><span></span><strong style=\"\">Revision notes</strong> specially designed to brush up on your concepts after you have finished the topic</li><li><strong style=\"\">Step by Step Complete NCERT solutions</strong> prepared by Subject Experts</li><li><span></span><strong style=\"\">Study planner</strong>- We give you a recommended schedule and timeline for each chapter  so that you can plan out your study schedule better</li><li><strong style=\"\">1 Test Paper with Video solutions</strong> which will help you to check your strengths and weakness in each topic so that you can find and resolve the problem areas in that chapter.</li><li><strong style=\"\">Previous year exam questions</strong> which will help you benchmark yourself to ensure you can crack the final exam!</li></ul>", 
    "end_date": null, 
    "title": "JEE/AIPMT Exam Prep: Essentials of Physical Chemistry", 
    "price": "20.00", 
    "instructors": "askIITians Engineering | Medical | Foundation", 
    "commitment": "35.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468752_54cd_3.jpg", 
    "course_url": "https://www.udemy.com/jee-exam-prep-essentials-of-physical-chemistry/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T07:48:29Z"
}