{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>In this course, we cover the many Management Accounting tools and techniques that would be part of a Managerial ( Management) Accounting university course.</p>\n\n<p><strong>Learn and Master Each Management Accounting Tools and Techniques.</strong></p>\n\n<ul><li>Understand how costs change when sales changes</li><li>Know how a job costing system works.</li><li>Complete a Job Costing accounting system using excel spreadsheets.</li><li>Design an activity based costing system using excel spreadsheets.</li><li>Solve Make or Buy decisions using Incremental analysis.</li><li>Solve Special Order decisions using incremental analysis.</li><li>Solve Equipment Replacement questions using relevant cost analysis.</li><li>Prepare a Master Budget using excel spreadsheets to plan business operations.</li><li>Know how to use the Flexible Budget to control operations.</li><li>Perform Budget variance analysis.</li><li>Understand the Balanced Scorecard and how it used in evaluating performance.</li></ul>\n\n<p> There are a number of excel projects on costing systems and budgeting and practice midterm and final exams with marking keys that highlight where an exam marker will award you marks. You can mark yourself.</p>\n\n<p><strong>If you can get an \"A+\" on the midterm and final exams in this course - you'll get an A from your accounting prof.</strong></p>", 
    "end_date": null, 
    "title": "Know how get an \"A\" in your  Management Accounting 101", 
    "price": "20.00", 
    "instructors": "Dr. John Mclellan", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234552_7e96_5.jpg", 
    "course_url": "https://www.udemy.com/get-an-a-in-your-management-accounting-101-college-course/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-31T10:12:51Z"
}