{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This course covers all the financial accounting concepts offered in an introductory financial accounting course at university or college. Business students have to take an introductory financial accounting course for one simple reason - accounting is the language of business. The terms used by business people such as capital, equity, assets, liabilities, revenue, net income etc. are all terms you will become very familiar upon completion of this course.</p>  <p><strong>Learn and Master the Financial Accounting Process.</strong></p>  <ul><li>Understand that accounting is the language of business.</li><li>Know business terminology (biz speak).</li><li>Understand the difference between a corporation and a single proprietorship.</li><li>Know the three forms of business - service company, merchandise company and a manufacturer.</li><li>Understand an Income Statement and how to prepare one.</li><li>Understand a Balance Sheet and how to prepare one.</li><li>Know how to analyse and record business transactions</li><li>Learn how to use debits and credits to record business transactions.</li><li>Know how to use the accounting journal and ledger,</li><li>Complete a set of accounting records for a service business using excel spreadsheets.</li><li>Complete a set of accounting records for a merchandise company using excel spreadsheets.</li><li>Understand LIFO and FIFO.</li><li>Understand how to use the accounting system for Internal Control.</li><li>Understand the different methods of depreciation.</li></ul>                            <p>This course is unique in that it contains  a number of excel projects on using a set of accounting records first for a service company and then a merchandise company. There are  practice midterm and final exams with marking keys that highlight where an exam marker will award you marks.</p>  <p><strong>If you can get an \"A\" on the midterm and final exams in this course - you'll get an A from your accounting prof.</strong></p>", 
    "end_date": null, 
    "title": "Know how to get  an \"A\" in your Financial Accounting 101 .", 
    "price": "20.00", 
    "instructors": "Dr. John Mclellan", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206092_4aa3_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-an-a-in-accounting-lessons-from-the-log-cabin/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-27T17:50:24Z"
}