{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">&#039;Recognized as a <strong style=\"\">top instructor</strong> by Udemy for high quality academic courses&#039;</em>  </p>  <p style=\"\">  \t<em style=\"\">&#039;First time on Udemy, courses delivered by <strong style=\"\">Nobel Prize laureates and international academic authorities&#039;</strong></em></p><p style=\"\"><em style=\"\"><strong style=\"\"></strong>If you are as crazy and passionate about true knowledge as our community and believe that true <strong style=\"\">knowledge is true wealth</strong>, then our courses are for you.</em></p>  <p style=\"\">  \t    In this masterclass Nobel laureate <strong style=\"\">Harold Kroto</strong> leads us into the fascinating world of modern chemistry.  </p>  <p style=\"\">  \t    From the experiments of alchemists, among philosophy and religion, to the “Nothing is created and nothing is destroyed&quot; of <strong style=\"\">Lavoisier</strong>, up to the invention of the periodic table of <strong style=\"\">Mendeleev</strong>: the birth, development and future scenarios of science that inquires into the nature of the universe.  </p>  <p style=\"\">  \t<strong style=\"\">This course is for:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Anyone with inquisitive and open mind</li>  \t<li style=\"\">Everyone interested in science and who would like to learn more about Lavoisier and Mendeleev and the periodic table</li>  \t<li style=\"\">Anyone with Interest in science</li>  \t<li style=\"\">Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li style=\"\">Attending the course does not need any scientific skill since it is presented in a clear and simple manner</li>  \t<li style=\"\">Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates&#039; works.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">With this course you will learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Over 29 lectures and 1.5 hours of content!</li>  \t<li style=\"\">26 masterclasses and 1.5 hour and more of content</li>  \t<li style=\"\">You will learn why Lavoisier is today considered the father of modern chemistry</li>  \t<li style=\"\">You will learn about the invention of the periodic table of elements of Mendeleev</li>  </ul>  <p style=\"\">  \tFrom literature to economics, art to philosophy, <strong style=\"\">EdooTV</strong> gives voice to the world&#039;s leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p style=\"\">  \tDon&#039;t wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong style=\"\">best gift</strong> you can give to yourself and your loved ones.  </p>  <p style=\"\">  \tFeel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "Lavoisier and Mendeleev - Harold Kroto", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399020_ae29.jpg", 
    "course_url": "https://www.udemy.com/lavoisier-and-mendeleev-harold-kroto/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T10:30:50Z"
}