{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>\n\n</p><p style=\"\">This lesson is an excerpt from the published, Strategic Economic\nDecision-Making: Using Bayesian Belief Networks to Solve Complex Problems\n(Grover 2013). I have realized that during the literature review how much\nindustry has greatly benefited from the utility of Bayesian Belief Networks (BBN).\nIn fact, my latest Google search using the keyword \"Bayesian\"\npopulated more than 12,000,000 hits. When I wrote this book, this search term\nhad 4,000,000 hits. I am predicting exponential interest in Bayes' theorem and\nBBN in the next decade. Now, we have high performance computers and enormous\namount of data that is being collected globally by governments and private\nsector industries, especially Twitter, Facebook, and Google, which is\nmind-boggling. My goal is to provide the learner with simple proofs to use and\nreference to learn how to convert this data information into business\nintelligence and BBN are proving to be the tool of choice in this endeavor. A\nlimitation to learning BBN is that the statistical and computer programming\nsymbology are not straight forward for the naive student to read and\ncomprehend. My concern is that this eloquent concept is not transparent to the\nhuman consumer of decision-making processes. The use of Bayes' theorem and\ninductive logic allows for the embedding of subjective matter expertise as a\nstarting point for executive decision-making and is an indispensable tool in\ndecision theory. </p><p>\n\n</p><p style=\"\">The scope of this course is to explore the\nconstructs of statistical proofs of two, three, and four event Bayesian Belief\nNetworks (BBN). The target audience are those learners who are interested in\nthe mathematical underpinnings of BBN.</p><p>\n\n</p><ol type=\"1\">\n <li style=\"\">This course is about the\n     utility of Bayesian proofs that lead to the formulation of BBN.</li>\n <li style=\"\">The terminology is basic\n     statistical notation as referenced in basic discrete math application.</li>\n <li style=\"\">The materials include in this\n     course are step-by-step videos with accompanying PowerPoint presentations\n     that complement the videos.</li>\n <li style=\"\">This course should take 5 hours\n     to complete.</li>\n <li style=\"\">This course is structured as a\n     step-by-step approach to learning mathematical proofs.</li>\n <li style=\"\">Learners should take this\n     course to increase their understanding of BBN.</li>\n</ol><p>\n\n</p><p style=\"\"> </p><p></p>", 
    "end_date": null, 
    "title": "Learn Bayes' Theorem Proofs", 
    "price": "20.00", 
    "instructors": "Dr. Jeff Grover", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45939_a30b_2.jpg", 
    "course_url": "https://www.udemy.com/learn-bayes-theorem-proofs/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-15T02:37:50Z"
}