{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Welcome to the course Resolving Forces for Maths, Physics and Engineering. The course is aimed at those students who are primarily taking A Level subjects or the equivalent or who may be doing a introduction to mechanics for a engineering course.</span>  </p>  <p style=\"\">  \t    As a college mathematics lecturer this is one area of mechanics that students do find challenging to understand. Yet it is a vital topic that overlaps into many other areas of mechanics so its understanding is essential.  </p>  <p style=\"\">  \t    I have covered the areas of resolving forces that are frequently taught at A Level or its equivalent as well as including over twenty practice questions with my own hand written solutions. You should note that my solutions are model answers to exam questions and this is how you should be producing your solutions.  </p>  <p style=\"\">  \t  The course includes 90 minutes of video instruction together with over 20 exam-style questions for you to try.  </p>  <p style=\"\">  \t    In this course you will learn how to:  </p>  <ul style=\"\"><li><strong style=\"\">Define a resultant force &amp; normal reaction</strong></li><li><strong style=\"\">Understand that a force has an impact either horizontally or vertically</strong></li><li><strong style=\"\">Resolve two or more forces and to determine the resultant force and the direction it makes with the horizontal</strong></li><li><strong style=\"\">Resolve forces acting on a plane</strong></li><li><strong style=\"\">Determine unknown forces and angles</strong></li></ul>          <p style=\"\">  \t    The best way to learn mathematics is to do it so please do have a pen and notepad to hand. Do try all the questions provided and you have the opportunity to compare your work to the solutions provided.  </p>  <p style=\"\">  \t    I really hope that you find the course to be very beneficial.  </p>", 
    "end_date": null, 
    "title": "Learn How to Resolve Forces in Easy Steps", 
    "price": "50.00", 
    "instructors": "Sadhiv Mahandru", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/391308_ee89_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-resolve-forces-in-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-11T17:05:32Z"
}