{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>**April 2016 update** The course has been redesigned from scratch with 2 more hours of material. Hope you guys enjoy!</strong></p>\n\n<p><strong>Over a 1000 students and counting with some great reviews already. See what some of my students have to say..</strong><br></p>\n\n<p><em>\"Nice course structure. Additional diagrams drawn by the instructor make the material easier to understand. Option to type notes while watching the video is very convenient. Delivery of content is excellent and well paced which makes it easy to follow. Explanations are visually clear and the instructor does a good job of making his delivery engaging with a positive tone. He seems to know his stuff. Would highly recommend\" </em></p>\n\n\n\n<p><em>\"I really enjoyed this course. Everything was well presented and explained at just the right pace. If you need to brush up on basic maths skills, this is a great course to boost your confidence. Thanks Adi!\"</em></p>\n\n\n\n<p>Welcome to <strong>Learn basic high school maths the easy way</strong>. After teaching maths to students for a better part of the decade, one thing that I've come to understand is how difficult a transition from primary school to high school can be for students.<br></p>\n\n\n\n<p><strong>Have you ever wondered how some students are so far ahead in their learning?</strong> </p>\n\n\n\n<p><em>Are they all born Maths geniuses?</em> Definitely not. It's because they have a really firm understanding of the fundamentals which allows them to progress a lot quicker when it comes to the more challenging topics, since every topic needs you to have a good base. </p>\n\n\n\n<p><strong>How will this course help you?</strong> </p>\n\n\n\n<p><em></em>Every topic that I cover in this course will come up in some form in years to come. I go through every single topic in a step by step form so it's really easy for you to follow along. <em>Not convinced? </em>Then I suggest you check out the previews before you decide to enroll, to make sure my teaching style is easy to follow, I am very confident that it is. To go a step further, Udemy's 30-day money back guarantee should also make you feel at ease.</p>\n\n\n\n<p><strong>Are you having a tough time keeping up in Maths at school? Do you think Algebra is just the worst or maybe indices is your green kryptonite?</strong> </p>\n\n\n\n<p><em></em>Then let me be your personal guide and teach you these topics in a way that will make you wonder why your teachers didn't just explain it to you like that. This course will not only help you catch up but also help you get ahead; if of course, you put in the required effort. I go through each chapter doing questions step by step using simple language.</p>\n\n\n\n<p><strong>Something missing in the course?</strong><br></p>\n\n\n\n<p>If you find I haven't covered a topic that you need at this level, let me know on the discussion board and I'll be happy to add it in :)</p>\n\n\n\n<p>**BONUS** I've provided worksheets (with answers) at the end of every chapter to test your knowledge from the lectures.</p>\n\n\n\n<p>I can guarantee that you'll be miles ahead of the competition if you take this course seriously and best part about knowing it all is - you can teach others as well. <em>When you're willing to spend upwards of $50 an hour for a private tutor, it seems like a no brainer to at least give this a go, so that you have access to your very own private tutor any time you wish.</em></p>\n\n\n\n<p>I'm good with messages and emails so if you have questions, make sure to get in touch with me. And furthermore, I want you guys to make full use of the discussion board because one of the best ways to learn is by sharing your knowledge with others. Thanks guys, really hope you enjoy.</p>", 
    "end_date": null, 
    "title": "Learn basic high school Maths the easy way!", 
    "price": "20.00", 
    "instructors": "Chanda Academy", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646602_1d0b_4.jpg", 
    "course_url": "https://www.udemy.com/learn-basic-high-school-maths-the-easy-way/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T09:22:25Z"
}