{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>What is the course about?</strong></p><p><strong></strong>As a primary school teacher I have been asked, on countless occasions by confused and bewildered parents, how I deliver maths to children in my class? The reason for this question is simply that maths is taught very differently to when they were in school.  When their children ask for help parents revert to the way they were taught and are simply told by their children - <strong>We don't do it like that!</strong> This leads to arguments and frustration in the household.<br></p><p>This course has been developed simply to teach you the methods and strategies that are used in school so that you can help your child at home. You can share your understanding with your child and ensure that learning at home is enjoyable and successful.</p><p><strong>What terminology is used in the course?</strong></p><p> Throughout the keynote presentations the terminology is simple and uncomplicated. I have used the key terms that your child will hear in the classroom. I have veered away from educational jargon that can be confusing unless you are in profession. </p><p><strong>How is the course structured?</strong></p><p>The course is structured into SIX keynote presentations that I talk you through step by step. FOUR of those presentations are based on key mathematical strategies and techniques to help with:</p><ol><li>Number sequences</li><li>Place Value</li><li>Mental and written calculations</li><li>Data, Measurement and shape</li></ol><p>The remaining two presentations look a Growth Mindset and Key Resources. Growth Mindset looks into the importance of practice and effort in maths, whilst Key Resources look in to practical activities that can be used to help your child in maths.</p><p><strong>Additional materials required</strong></p><p>A simple pad and paper to take notes are all that are required to complete the course.</p><p><strong>Why take the course?</strong></p><p>So, if you want to develop that understanding of how your child is being taught in school and you want to be able to guide them in right direction this course is must for you. </p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Primary School Maths Strategies Yr2 (age 6&7)", 
    "price": "25.00", 
    "instructors": "Nadia Jones", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615868_36e6_2.jpg", 
    "course_url": "https://www.udemy.com/learn-primary-school-maths-strategies-yr2-age-67/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T15:10:44Z"
}