{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Curve Sketching is an incredibly useful tool in mathematical problem solving, as well as an opportunity to improve and test your algebraic understanding.</p><p>As you study mathematics through school and college to degree level, your algebraic skills will be increasingly tested. In order to become a strong mathematician, you need to understand what the algebra is telling you. Curve Sketching is often examinable and can be a challenging topic to master due to the multitude of techniques that need to be learnt. This course is here to help.</p><p>Computer programs like Autograph, Desmos, Maple and Matlab can all plot curves, but understanding why a curve behaves the way it does relies on your understanding of algebra and calculus. Using techniques that we will learn on this course, you will be able to successfully sketch complicated functions and learn about the behaviour of different graphs.</p><p>The course is structured so that you will learn about Graph Transformations and Differentiation and its uses in the initial sections. You will not need to have met these concepts before. I go through Differentiation from its basics, through the derivatives of different functions, and up to the Chain Rule, Product Rule and Quotient Rule.</p><p>We then start Sketching, and within this we will learn many different techniques along the way.</p><p>Linear Graphs:</p><ul><li><span></span>Find where the graph crosses the coordinate axes.</li><li>Learn how to deal with different forms of Linear equations.</li></ul><p>Quadratic Graphs: </p><ul><li>Learn methods of Factorising.</li><li>Learn how to use the Quadratic Formula.</li><li>Learn about the Discriminant and what it tells us.</li><li>Learn how to Complete the Square.</li></ul><p>Cubics and Higher Polynomials:</p><ul><li>Learn about the Remainder Theorem and the Factor Theorem.</li><li>Learn how to perform and use Polynomial Division.</li></ul><p>Rational Functions:</p><ul><li>Learn about Asymptotes and how to determine how each section of the graph behaves.</li><li>Learn how to determine how a graph behaves for large positive or negative values of x.</li></ul><p>Trigonometric Functions:</p><ul><li>Learn about sin(x), cos(x) and tan(x) from the Unit Circle.</li><li>Learn how to sketch cosec(x), sec(x) and cot(x).</li><li>Learn how to sketch transformations of each trigonometric curve.</li></ul><p>Exponential and Logarithmic Functions:</p><ul><li>Learn about e^x and be introduced to Logarithms.</li><li>Learn about the Laws of Logarithms.</li><li>Learn how to solve equations involving Exponentials and Logarithms.</li></ul><p>Modulus Functions:</p><ul><li>Learn about |x| and how to sketch a host of graphs involving the Modulus Function. </li><li>Learn about the difference between y = |f(x)| and y = f(|x|).</li></ul><p>Each of these sections is introduced from scratch and involves several worked examples and exercises for you to complete. There are several quizzes to try along the way to test your understanding, and if there are any problems please do not hesitate to start a discussion and ask for help. </p><p>With over 100 lectures and 13 hours of content, this course is perfect for anybody studying a Calculus course or A-Level Mathematics, or for those wanting to test and improve their mathematical ability before tackling a Mathematics-related undergraduate degree course at university.</p>", 
    "end_date": null, 
    "title": "Learn to Sketch Curves using Calculus", 
    "price": "25.00", 
    "instructors": "Jack Brown", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513984_ecf1_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-sketch-curves-using-calculus/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T20:10:32Z"
}