{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Course Description</strong><br style=\"\"></p><p style=\"\">The course teaches you how to use the C programming to control the LEGO Robot. It is not the NXT software but more cool NXC coding. You can learn the basic C coding skill and special function for the LEGO Robot.  You can develop an algorithm to let your Robot auto pilot the field and find enemies.</p><p style=\"\"><strong style=\"\">Build a strong foundation for beginner for the C coding and hardware control.</strong><br style=\"\"> </p><p style=\"\">Learn the function definition.</p><p style=\"\">How to use parameter.</p><p style=\"\">Loop control, while, repeat and  If else.</p><p style=\"\">Hardware IO control.</p><p style=\"\">Advanced function like PID controller.</p><p style=\"\">Synchronize the two wheels.</p><p style=\"\"><strong style=\"\">A powerful skill to learn</strong></p><p style=\"\">C is the basic language for a lot of coding projects. It also share very similar grammar with all other advanced coding language. Through the classes, you could learn the C basic format and the essential functions like the while loop, if/else control. It open the door to beginner. </p><p style=\"\">The classes also teach how the C code connect to the hardware through the input/output (I/O) ports. After compiling, the C code could translate to lower level language to read and write the hardware IO and then control the Robot.</p><p style=\"\">Through the I/O interface, the sensor could send feedback information back to Robot processor. So you could write an algorithm to control the Robot based on what it sees.</p><p style=\"\">The two Robot motors are controlled by the I/O. You could learn how to control the motor from basic speed control and motor rotate control. A classic PID control could be implemented to speed up the response. A synchronous control could guide the Robot to move in a straight line or in a specified curve.</p><p style=\"\"><strong style=\"\">Content and overview</strong></p><p style=\"\"><strong style=\"\"></strong>First, you will learn how to download the software compiler and how to use it to compile the code and download to LEGO Robot.</p><p style=\"\">Second, you learn the basic coding to send a message to Robot screen. You can see how the computer talk to your Robot. By using basic function like repeat and while loop, if/else functions, you could move the Robot and make it turns.</p><p style=\"\">After learned the coding basic, you could use the coding to control the sensors like touch sensor and ultra sound sensor. Using the sensors allow you to control the Robot to achieve your tasks. I show you an example the Robot will search enemies in the filed and attack it.<br style=\"\"></p><p style=\"\">More complicated function will also be taught. The PID control will control the Robot precisely. The synchronous control will control the two wheel in phase or has a phase shift. By using the function, the Robot could move straight line or circle or a curve.</p><p style=\"\">All of these could be done using the coding. It reveals a new fun world for the LEGO Robot. It does much more than self contained NXT software.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "LEGO Robotic C Programming", 
    "price": "20.00", 
    "instructors": "Charlie Zhang", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449162_5bf0.jpg", 
    "course_url": "https://www.udemy.com/lego-robotic-c-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T05:50:53Z"
}