{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>-------------------------------------------------------------------------------------------------------------------<br></p><p><strong>The sequel to the course <em>Linear Algebra for Beginners: Open Doors to Great Careers.</em><em></em></strong></p><p>-------------------------------------------------------------------------------------------------------------------</p><p>Would you like to learn a mathematics subject that is crucial for many high-demand lucrative career fields such as:<br></p><ul><li><strong>Computer Science</strong></li><li><strong>Data Science</strong></li><li><strong>Actuarial Science</strong></li><li><strong>Financial Mathematics</strong></li><li><strong>Cryptography</strong></li><li><strong>Engineering</strong></li><li><strong>Computer Graphics</strong></li><li><strong>Economics</strong></li></ul><p>If you're looking to gain a solid foundation in Linear Algebra, allowing you to study on your own schedule at a fraction of the cost it would take at a traditional university, to further your career goals, this <strong>online</strong> <strong>course</strong> is for you. If you're a working professional needing a <strong>refresher</strong> on linear algebra or a <strong>complete beginner</strong> who needs to learn Linear Algebra for the first time, this online course is for you.</p><p><strong>Why you should take this online course</strong>: You need to refresh your knowledge of linear algebra for your career to earn a higher salary. You need to learn linear algebra because it is a required mathematical subject for your chosen career field such as computer science or electrical engineering. You intend to pursue a masters degree or PhD, and linear algebra is a required or recommended subject.</p><p><strong>Why you should choose this instructor</strong>: I earned my PhD in Mathematics from the University of California, Riverside. I have extensive teaching experience: 6 years as a teaching assistant at University of California, Riverside, over two years as a faculty member at Western Governors University, #1 in secondary education by the National Council on Teacher Quality, and as a faculty member at Trident University International.</p><p>In this course, I cover the core concepts such as:</p><ul><li><strong>Inner Product Spaces</strong></li><li><strong>Linear Transformations</strong></li><li><strong>Eigenvalues and Eigenvectors</strong></li><li><strong>Symmetric Matrices and Orthogonal Diagonalization</strong></li><li><strong>Quadratic Forms</strong></li><li><strong>Singular Value Decomposition</strong></li></ul><p>After taking this course, you will feel <strong>CARE-FREE AND CONFIDENT</strong>. I will break it all down into bite-sized no-brainer chunks<strong>. </strong>I explain each definition and go through each example <strong>STEP BY STEP</strong> so that you understand each topic clearly. I will also be <strong>AVAILABLE TO ANSWER ANY QUESTIONS</strong> you might have on the lecture material or any other questions you are struggling with.</p><p><strong>Practice problems</strong> are provided for you, and <strong>detailed solutions</strong> are also provided to check your understanding.</p><p><strong>30 day full refund if not satisfied.</strong></p><p>Grab a cup of coffee and start listening to the first lecture. I, and your peers, are here to help. We're waiting for your insights and questions! <strong>Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "Linear Algebra for Beginners: Open Doors to Great Careers 2", 
    "price": "20.00", 
    "instructors": "Richard Han", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630112_f1dc_2.jpg", 
    "course_url": "https://www.udemy.com/linear-algebra-for-beginners-open-doors-to-great-careers-2/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T05:27:46Z"
}