{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Have you ever wanted to fully understand the fourth dimension? How about the fifth? How about a space that is infinite dimensional? This is likely the most applicable mathematics course ever. We cover in depth everything about dots, lines, planes, spaces, and whatever is beyond that. We detail special functions on them and redefine everything that you have ever learned. Prepare to have your mind blown!</p><p style=\"\">  \t<strong style=\"\">Master and Learn Everything Involving Spaces</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Vector Spaces</li>  \t<li style=\"\">Linear Transformations</li>  \t<li style=\"\">How to Measure Space</li>  \t<li style=\"\">Definition of a Right Angle (The Real One)</li>  \t<li style=\"\">Inner-Product Spaces</li>  \t<li style=\"\">Eigenvalues and Eigenvectors</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Linear Algebra Can Be Easy. Start Your Course Today!</strong>  </p>  <p style=\"\">  \t                  This course includes everything that a university level linear algebra course has to offer *guaranteed*. This course is great to take before or during your linear algebra course. The book isn&#039;t enough - trust me. You will succeed with these lectures. It&#039;s hard to believe that such a difficult class can be made simple and fun, but I promise that it will be. This is a topic that is widely used with everyone, and can be understood. The reason that I succeeded in my linear algebra course is because I had a great professor, and you deserve one too! So what are you waiting for?</p><p style=\"\"><strong style=\"\">Join today!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Linear Algebra Math Made Simple: The Study of Spaces", 
    "price": "20.00", 
    "instructors": "Kody D'Amours", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382606_6686_2.jpg", 
    "course_url": "https://www.udemy.com/linearalgebra/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T01:06:33Z"
}