{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Un esbozo del contenido del curso es el siguiente:</p><p><br></p><p>1. Proposiciones: En este tópico se definirá qué es una proposición,  como operan los conectores y los valores de verdad que pueden tomar las proposiciones. </p><p><br><br></p><p>2. Equivalencias lógicas y reglas de inferencia: en este tópico se analizarán las principales equivalencias lógicas y algunas reglas de inferencia que nos permitirán desarrollar deducciones acertadas o correctas. Apoyándonos en lo anterior mostraremos una primera forma de demostrar, la deducción; es decir, a partir de unas hipótesis deducir una consecuencia lógica.</p><p><br><br></p><p>3. Propiedades básicas del cálculo de predicados: En esta sección se analizarán los diferentes tipos de cuantificadores: el existencial, el universal y el existencial único. Se examinará cada uno con cierto detalle; se mostrará como se da la negación de estos y cómo se comportan a la hora de combinar varios de ellos.</p><p><br><br></p><p>Además,  analizaremos cómo se mezclan el cálculo proposicional y los cuantificadores, para formar una teoría un poco más general: el cálculo de predicados. Solo se trataran las principales propiedades.</p><p><br><br></p><p>4.  Demostraciones: En esta sección se analizarán los métodos  más comunes de demostración como lo son  la  deducción, el contrarrecíproco, reducción al absurdo, la disyunción de casos y la inducción matemática. <br></p>", 
    "end_date": null, 
    "title": "Lógica proposicional básica ", 
    "price": "20.00", 
    "instructors": "Juan José Ortiz García", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687606_9a77_2.jpg", 
    "course_url": "https://www.udemy.com/logica-y-demostraciones/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T01:27:00Z"
}