{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to the easily learning basic math, a place where you can come and learn the basic topics of math from scratch. In this course we will be covering the most important fundamentals math concepts, that will help you in everyday life, and will help you move on to Pre Algebra.</p><p>You maybe someone who hasn't practices the core math fundamentals that are taught in grade school and need  a good refresher, or you maybe a college student who needs to pass a college entrance exam, or you just might just be a parent who wants to make sure your kid becomes excellent at math and doesn't to fall victim to the \"Math is difficult syndrome.\"</p><p>In reality Math isn't hard at all, all that's require is learning a few necessary steps to solve any given problem, and thats what you'll learn in this course.<br></p><p>I structured this course sort of like an encyclopedia, where if you have questions or want to learn any topic you can just go to that section watch the first video, where I explain the concept of the topic from scratch, than we move onto solve a few example problems together where you get to see the concept in use, than at the end of the section you take a quick quiz which will help reinforce what you learned in the section.<br></p><p>Stop letting math frustrate you, click now on the take this course button, grab a piece of paper an a pencil  and lets learn some math.<br></p>", 
    "end_date": null, 
    "title": "Mastering Basic Math skills", 
    "price": "20.00", 
    "instructors": "Front End Developer Kevin Ventura", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519906_9f8e_5.jpg", 
    "course_url": "https://www.udemy.com/easily-learn-basic-math/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T04:07:57Z"
}