{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>What's Organic Chemistry? </strong></p><p><strong></strong>Organic Chemistry is defined as the branch of chemistry, originally limited to substances found only in living organisms, dealing with the compounds of carbon. </p><p><br></p><ul><li><strong>What's with all the hype? </strong></li></ul><p>Most science majors would have to undergo an organic chemistry module which has been proven to be a very daunting and challenging field to excel in. Students often struggle to even pass the subject. Organic Chemistry can get progressively tough especially when the core foundation is not strong. </p><ul><li><strong>So why should you take this course? </strong></li></ul><p>This isn't a typical organic chemistry course where I explain to you concepts just for you to memorize. I'll make you understand the most basic principles and show you how simple questions are when you've got your foundation solid. In addition, I'll drop some tips and tricks for typical questions so that you have it all covered! At the end of the course, you'll be able to take your exam in absolute confidence and get superb grades!</p><ul><li><strong>How's this course gonna be like?</strong></li></ul><p>3 different sections with bite-sized lectures each covering different concepts. There is no rush, you can take things slowly and re-watch the lectures till you get it. At the end of every section, there will be an 'exam' for to test what you've learned. </p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Master the basics of Organic Chemistry ", 
    "price": "20.00", 
    "instructors": "Mr Luth Faris", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616572_503b_2.jpg", 
    "course_url": "https://www.udemy.com/basicorgo/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T12:00:07Z"
}