{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t  E&#039;tiboringizga havola qilinayotgan ushbu video-darslar maktab matematikasini o’rgatishga qaratilgan. Undagi darslar asosan o’tilgan mavzularni esga olmoqchi bo’lgan, maktab matematikasini mustaqil o’rganmoqchi bo’lgan o’quvchilarga mo’ljallangan bo’lsada undan maktab o’qituvchilari ham foydalanishlari mumkin.  </p>  <p>  \t Matematikani yangi boshlayotgan o’quvchilarga dastlab video-darslarda yechilgan misol va masalalarni qaytadan mustaqil yechib, so’ngra dars oxirida berilgan topshiriqlarni yechishni tavsiya qilamiz.  </p>  <p>  \t                            Biz darslarni shartli ravishda ikki qismga ajratdik:  </p>  <ul style=\"\">  \t<li>1-qismda asosiy qoidalar, formulalar, v.k. beriladi. Bu qismda mavzular misollar yordamida tushuntiriladi.</li>  \t<li>2-qismda esa ayrim mavzular kengaytiriladi, darsliklarda uchramaydigan, lekin tez yechimga olib keluvchi  formulalar ham berilishi mumkin.</li>  </ul>  <p>  \t                            2-qism faqat 1-qismni o’zlashtirgan o’quvchilarga tavsiya qilinadi. Undan oily o’quv yurtlariga kirish ishtiyoqida bo’lgan o’quvchilar ko’plab misollarning yechimlarini o’rganishlari mumkin. 2-qismning oxirida ham topshiriqlar berilgan bo’lib ular asosan test to’plamlaridan olingan. Video-darslarda yechilgan misollar bu topshiriqlarning nisbatan murakkabrog’i yoki tipik misollarini tashkil etadi.  </p>  <p>  \t                            O’zlarining qimmatli vaqtlarini ayamay ushbu kursga taaluqli fikr va mulohazalarini bildiradigan tinglovchilarga oldindan o’z minnatdorchiligimizni bildiramiz.  </p>  <p style=\" text-align:center;\">  \t<a href=\"https://www.udemy.com/course/subscribe/?courseId=182256\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"><img src=\"https://dl.dropboxusercontent.com/u/13897227/register2.gif\" alt=\"Darslarga a&#039;zo bo&#039;lish\" style=\" margin:5px; max-width:100%;\"></a>  </p>", 
    "end_date": null, 
    "title": "Matematika (maktab kursi)", 
    "price": 0, 
    "instructors": "G'ofurjon Ibragimov", 
    "commitment": "23 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/182256_fcfe_2.jpg", 
    "course_url": "https://www.udemy.com/matematika-darslari/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-14T03:17:35Z"
}