{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Las matemáticas han estado en nuestras vidas desde siempre, desde que nacemos forman una parte muy importante en el día a día de todos nosotros.  Por desgracia nos han sido enseñadas de una forma extremadamente complicada que a muchos nos alejaba de ellas con cada uno de sus anticuados métodos. </p>\n\n<p>Cualquiera desde un niño hasta un adulto podrá tomar estas clases de <strong class=\"redactor-inline-converted\">matemáticas mágicas</strong>, todo es muy sencillo de seguir.<br></p>\n\n<p>Existen <strong class=\"redactor-inline-converted\">varios métodos</strong> muy sencillos para poder hacer cálculos matemáticos mentales. Este curso está dedicado a las multiplicaciones, explico varios métodos diferentes muy detallados cada uno de ellos, <strong class=\"redactor-inline-converted\">me veréis como voy haciendo cada ejercicio paso a paso</strong>, para que no haya dudas del proceso.<br></p>\n\n\n\n<p>También es necesario cuando se aprende algo nuevo disfrutar de ello con algún juego, por ello <strong class=\"redactor-inline-converted\">he decidido poner varios juegos matemáticos</strong> para que vuestra mente se pueda adaptar mejor a los cambios que tendréis que hacer al aprender a calcular mentalmente. \n\n  </p>\n\n\n\n<p>Todos disfrutaremos aprendiendo, jugando y calculando mentalmente como nunca habéis hecho antes. <strong class=\"redactor-inline-converted\">Poco a poco os iréis convirtiendo en unos genios matemáticos</strong>, los cálculos mentales no serán un problema para vosotros. Esto hará que vuestra mente este más abierta a la hora de resolver cualquier problema tanto en el trabajo, vida cotidiana o estudios, vuestra mente tendrá una visión más amplia y lo que en el pasado no veíais ahora no será un problema.\n\n  </p>\n\n\n\n<p>La psicología siempre forma parte muy importante en cada uno de nosotros a la hora de aprender, desde aquí os animo a dar un paso adelante y todos aquellos sueños que tengáis como conseguir un trabajo mejor remunerado, aprobar esos exámenes que necesitamos para conseguir nuestras metas y cualquier otra cosa. </p>\n\n<p><strong class=\"redactor-inline-converted\">CONFIO AL 100% QUE LO VAIS A CONSEGUIR.</strong>  \n\n  </p>\n\n\n\n<p>Mi curso os ayudara a conquistar vuestros sueños y yo personalmente os ayudare en todo aquello que necesitéis tanto con los problemas como con palabras de ánimo siempre que necesitéis. <strong class=\"redactor-inline-converted\">AQUÍ ESTARE!!</strong> \n\n  </p>\n\n\n\n<p><strong>Matemáticas mágicas es la solución.</strong></p>", 
    "end_date": null, 
    "title": "Matemáticas Mágicas - calcula mentalmente, mejora tu trabajo", 
    "price": "45.00", 
    "instructors": "Eien Nuñez", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831154_b515_2.jpg", 
    "course_url": "https://www.udemy.com/matematicas-magicas-calcula-mentalmente-mejora-tu-trabajo/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T08:39:26Z"
}