{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>In this course, we see what math classes you should take and in what order depending on your age and what your interests are. We even give road maps to potential math majors and guidance for graduate school! You may not know this, but most people don't know what math class they need to take 3 years from now, and when students take a class without knowing what that class is intended for, many students end up forgetting material and become ill-prepared for their future math classes.</p><p>For example, if you are a senior in high school, chances are that you can take either college algebra, probability and statistics, or pre-calculus. This decision is extremely important because if you choose statistics and you go to college, there is an 80% chance that you need to take Calculus 1 when you enter. The problem is, you aren't ready for that class with statistics... Another example that we go into in this course is if you consider becoming a math major. There are multiple variations of a math major - but which one fits for you?</p><p><strong>Start Your Course Today!</strong></p><p>Upon finishing this course, you will:</p><ul><li>Be prepared for future math classes</li><li>Understand what each class teaches</li><li>Know what courses you need to take depending on your interests</li><li>See what each math class teaches up through graduate school mathematics!</li><li>Have confidence knowing what you are getting in to</li></ul><p><b>This Course Is Cheap For A Limited Time Only! Sign Up Today!</b></p>", 
    "end_date": null, 
    "title": "Math For Beginners: Algebra, Geometry, And Calculus Basics!", 
    "price": "20.00", 
    "instructors": "Kody D'Amours", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461812_32c7.jpg", 
    "course_url": "https://www.udemy.com/mathematics101/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T03:20:38Z"
}