{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>We're confident that you'll be able to follow through and learn fractions with confidence and ease, no matter what struggle and difficulties you've experienced up to this point!</strong></p><p>A bold statement, but we're fully behind it!</p><p><strong>Do you or your child struggle with math?</strong></p><p><em>“My kid is in 5th grade, dyslexic, and with ADD. He's been struggling with math which is why we signed up. After watching your videos, he no longer find the problem difficult at all. Thank you very much for a superb way of presenting math concepts in an easy to digest, bite-sized bits!\"-Ragnheidur, mother</em></p><p>Did you know that Fractions are a frequent cause of severe difficulties in higher maths, such as Algebra and Geometry?</p><p>This course contains a high quality videos backed up with a training material that will take you from struggle to mastery in fractions, simply by following the steps of the course.</p><p><strong>Disclaimer:</strong> Our goal was <strong>NOT </strong>to add extra content that has little or no value for you (the student), only to make the course look bigger.</p><p><strong>By the end of this course, you will have a great understanding of fractions and learn to solve fraction problems with ease and confidence.</strong></p><p>The course is self explanatory, so you'll be able to follow through even if it's suffering from learning disabilities, such as <strong>dyslexia or ADD/ADHD.</strong></p><p>The course will also help you to build <strong>an excellent foundation</strong> for learning more complicated mathematical concepts.</p><p>It is the goal of this course to help you get rid of the confusion, by introducing strategies to deal with fractions with ease and confidence.</p><p><strong>Increase self confidence and skills by simply following the already proven step-by-step instructions</strong></p><ul><li>Each section builds on the previous one and ensures progress.</li><li>No fluff. Scripts are to the point and videos kept as short as possible.</li><li>The course elevates the student from a \"beginner's state\" to mastery in fractions, leaving him with a great skill set for more advanced math, such as Algebra and Geometry.</li></ul><em>“The fractions were instant success. It was amazing to watch my child wanting to learn more and do the exercises instead of choosing to do something else. I'm 100% confident on this. Her attitude towards math is so much better today than it was in the past.\"</em>-Arna, mother<em>“This has been a great journey and we're so happy that we signed up. My daughter find this so much fun to do. She's more confident now and it's showing in her math skills at school. She's going to benefit from this for a long, long time!\"</em>-Gudbjorg, student's grandmother<p><strong>Solve Math Fractions Faster and Easier </strong></p><p>You need a clear understanding of fractions, to be able to understand higher and more complex math concepts. However, many still struggle learning fractions primarily because of the complicated and traditional approach in classrooms.</p><p><strong>NOTE:</strong> All modules of the course are related and are built based from the previous ones, providing you with step-by-step approach to learning fractions. </p><p><strong>p.s.</strong></p><p><strong>This course contains high quality teaching material which includes no-fluff, step-by-step and to the point animated videos and worksheets to practice what you've learned.</strong></p><p>By the end of this course, you will have a great understanding of fractions and be able to solve fraction problems with ease and confidence.</p><p>The knowledge and skill you'll gain from taking the course will also serve as a foundation for learning more complicated mathematical concepts</p><p><strong>Note about the authors</strong></p><p>For more than 10 years Kolbeinn Sigurjonsson has specialized in helping students overcome learning disabilities. He has a Bsc. degree in Computer science from Reykjavik University and a diploma in hypnotherapy and Dyslexia Consultation from Davis Dyslexia Association International.</p><p>Halldor Thorsteinsson is an enthusiastic Math teacher and has for over six years taught students suffering with math difficulties. He has a Bsc. &amp; Msc. degrees in Business administration.  Halldor is also a certified teacher from the University of Iceland.</p>", 
    "end_date": null, 
    "title": "Math: How To Go From Struggle To Mastery In Fractions", 
    "price": "20.00", 
    "instructors": "Kolbeinn Sigurjónsson, Halldor Thorsteinsson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512808_9eda_2.jpg", 
    "course_url": "https://www.udemy.com/math-how-to-go-from-struggle-to-mastery-in-fractions/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T14:34:21Z"
}