{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>**** FREE BONUS OFFER! ****</strong></p>\n\n<p><em><strong>Buy now and get my book 'How to get an A in math'* - absolutely FREE!</strong></em></p>\n\n\n\n<p>How to get an A in math* is <strong>definitely not</strong> another 'this is how to add fractions, calculate an angle or solve algebra' math guide. Based on 14 years tutoring experience, this ebook is practical and straightforward:</p>\n\n\n\n<ul><li>where to start with math</li><li>look for the 'tells'</li><li>draw the question</li><li>try not to underline</li><li>three calculation methods you absolutely need to know for math</li><li>top tips for working with math fractions simply and easily</li><li>.. and many more</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>**** <strong>FREE</strong> WITH MATH FRACTIONS - ADDING, SUBTRACTING, MULTIPLYING, DIVIDING. ****</p>\n\n\n\n<p>* Amazon Bestseller RRP £2.99 ($5) value!<br></p>\n\n\n\n<p><strong>Course Information:</strong></p>\n\n\n\n<p>Math can sometimes be a little tricky as there just seems so much to learn. In high school there are around 60 topics, from trigonometry to cumulative frequency and back again to quadratic formulas - that's a whole range of subjects that you need to know to be successful in your studies!</p>\n\n\n\n<p>The good news is that there are common threads.. and a great understanding of math fractions, will help you to feel confident about working through some of the more challenging questions. <br></p>\n\n\n\n<p>Questions that involve math fractions - adding, subtracting, multiplying and dividing are very popular in exam papers. Whether you're studying GCSE, or SAT a great understanding of math fractions can really make a difference in your grade score. </p>\n\n\n\n<p>If math was always about \"arithmetic\" you might not need this course. When you have been given an addition or multiplication math question it's usually fairly straightforward. The difficulty is when math is presented as a \"word problem\" and you need to work through to a final answer. </p>\n\n\n\n<p>This course will help you to spend time understanding the wording, without worrying about the calculation. Math fractions - adding, subtracting, multiplying and dividing - is a crash course in helping you to get the very best from your math studies:</p>\n\n\n\n<ul><li>the two key skills you need, to work with math fractions</li><li>how to use 'equivalence' for easy fraction calculation methods</li><li>get rid of lots of big numbers that take too much time to work through</li><li>find ways of really understanding the question... without worrying about the numbers</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>Math fractions - adding, subtracting, multiplying and dividing - is ideal for all high school students wanting to improve their grade, parents helping with math homework, career changers or anyone wishing to gain a deeper understanding of math.<br></p>\n\n\n\n<p>Each short lecture is easy to understand and presented using actual exam questions. There's a little bit of humour, a lot of whiteboard and a logical development through all of the topics:</p>\n\n\n\n<ul><li>adding, subtracting, multiplying and dividing math fractions</li><li>easy to solve 'word problems' by using equivalent math fractions</li><li>ratio, percentages and people selling raffle tickets</li><li>some really hard stuff at the end - introducing 'algebraic math fractions' (a great way to really impress your kids)</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>* In the UK 'math<strong>s'</strong></p>", 
    "end_date": null, 
    "title": "Math Fractions - add, subtract, multiply, divide fractions", 
    "price": "20.00", 
    "instructors": "Simon Deacon", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442672_bcef_2.jpg", 
    "course_url": "https://www.udemy.com/how-you-can-be-good-at-maths-and-great-at-fractions/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-09T11:45:15Z"
}