{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>For those who get jittery whenever anything faintly related to math is brought up, think that math is difficult, confusing, dull or just plain scary, then this course is your ideal companion. It covers all the basics from the four arithmetical operations, fractions, decimals, to probability &amp; statistics, leading you clearly &amp; surely towards a greater understanding of this fascinating subject. Even apparently daunting concepts are explained simply, with the assistance of useful diagrams, &amp; with a refreshing lack of jargon. It has 30 lectures in video format totaling 4.25 hours. The contents of the lectures are pre-formatted &amp; presented consistently with no delivery pauses, so there is no waiting time involved in writing out a particular concept or problem on a white board which is the norm with many such courses. It starts out with the concept of numbers, then onto the four basic operations of addition, subtraction, multiplication, &amp; division, onto primes, factors, &amp; multiples, negative numbers, fractions, decimals, powers, scientific notation, roots, logarithms, percentages, proportions, ratios, algebra, equations, lines &amp; angles, 2-D &amp; 3-D shapes, polygons &amp; polyhedra, geometry, trigonometry, coordinates, graphs, statistics, probability, &amp; finally to charts. To test your level of understanding of the concepts learned from each lecture, resources in the form of problems for each of the subject-related topics are available in the Question &amp; Answer &amp; Practice makes Perfect downloadable documents. This course is unique in the sense that it starts out with the most fundamental concept, that is numbers, &amp; gradually builds upon each topic so that by the end of Lecture 30, a coherent perspective of the fundamentals of mathematics is formed while helping you get past any aversion you may feel toward the subject in general.</p>", 
    "end_date": null, 
    "title": "Mathematics 101: Building a Solid Foundation", 
    "price": "30.00", 
    "instructors": "Gurmeet Grewal", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706268_d68c_2.jpg", 
    "course_url": "https://www.udemy.com/mathematics-101-building-a-solid-foundation/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-25T10:19:18Z"
}