{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Since childhood the one subject that kids develop a phobia for - has always been MATHEMATICS. These simple trick if practiced can help you master the mathematical operations as if it were a fun-game! You will start loving the subject and with time also develop how to manipulate numbers.</p>\n\n<p>These simple one-lined <u>Sutras</u> are the mathematical FORMULAS that can be used for a  variety of mathematical operations. Each Sutra can handle multiple operations as per your requirement.</p>\n\n\n\n<p>Further you will learn tricks which help you CHECK YOUR CALCULATION.</p>\n\n\n\n<p>Now as far as the question of “learning the basic concepts again?” comes- then each journey begins from its origins so we begin with the basic concepts of Addition, Subtraction and Multiplication. But these basic mathematical operations also require the knowledge of some basic facts like digit sums, nine point circle, ten point circle, bar numbers, etc. which have also been dealt with.</p>\n\n\n\n<ul><li>It has been basically designed to make clear the basic concepts of mathematics.No day goes by that you have no addition/subtraction/multiplication to do. Everyday calculations include each of this topic so even if you want to do fast calculations in your dailywork, it will certainly be a lighted path to walk upon.</li><li>All competitive exams make sure that you have a clear understanding and working knowledge of these basic calculations, but time is a constraint when attempting such calculations in a given time limit, so there you go- this is a course for you!</li><li>If you are a parent dealing with kids who are of an age group where maths typically starts becoming difficult to understand- AGAIN- this is the place to start with brushing up your maths and answering their DIFFICULT sums.</li><li>If you don’t feel very confident in calculations as you take a long time to calculate a simple sum, you have hit upon the right key- this is the course for you.</li><li>You can also learn these tricks to amaze your friends and followers as well!</li><li>These are cool tricks to make you feel confident and COOL.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>This simple course on mathematics demands only an interest in learning and exploring these comparatively easier ways to doing faster calculations easily. BUT be ready to do a lot of practice to master these tricks. This is required because you have been used to following the conventional methods of mathematical calculations as you were exposed to them since you first started off with mathematics. Now to write on a paper on which has been imprinted deeply, you need to write with a darker colour( more will power) and erase out the earlier notes( practice the new learnt tricks). So grab a thick notebook and pick up a pencil to begin the journey to the heart of the subject.</p>\n\n\n\n<p>You certainly know these basic calculations, but what I need the most is -you should know tables of 1-5 till 5-times……...is it a large expectation?</p>\n\n\n\n<p><br></p>\n\n\n\n<p>What you will get from this course?</p>\n\n\n\n<ul><li>you will develop the SKILL for doing sums in your head! And that too accurately as you shall know the tricks to double check your answer!</li><li>you will become confident and become a master in these trick, rather than being a novice.Certainly impressive!!</li><li>your cognitive skills and intuition will get an outlet and you will certainly have a better memory.</li><li>you will be able to choose the best trick to use for faster and correct calculation</li><li><div>Last you will overcome the FEAR of the subject, if any! ✌</div></li></ul>", 
    "end_date": null, 
    "title": "Mathematical Calculations Made Easy and Quick", 
    "price": "20.00", 
    "instructors": "Archana Bhadoria", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776848_2d7a_3.jpg", 
    "course_url": "https://www.udemy.com/maths-made-easy-and-quick/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-28T14:07:06Z"
}