{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t  Maths the Wacky Way is a course designed to help students to achieve their full potential in mathematics in an enjoyable and unforgettable way. Many consider mathematics as difficult/boring but Maths the Wacky Way brings maths to life using dance moves, comparing methods to computer games, generally breaking it down so children (and adults) find it easy and fun!  </p>  <p>  \t  Maths the Wacky Way originally came about after praise by students and parents alike for my highly successful teaching methods. Six years ago my book Maths the Wacky Way was published.  Four years ago I produced three sample videos and received feedback as shown below:  </p>  <ul style=\"\">  \t<li>&#039;Love it!! Super helpful for my son. Thank you!!!&#039;</li>  </ul>  <ul style=\"\">  \t<li>&#039;Claire - I am 52 years old and for the first time in my life I understand fractions thank you thank you thank you&#039;</li>  \t<li>  \t<p style=\"\">  \t\t  &#039;Cool way to learn! =) Thanks!&#039;  \t</p>  \t</li>  \t<li>  \t<p style=\"\">  \t\t  &#039;I love the way you teach! Your style is engaging with youngsters, I wish my teachers were as cool as you are. Thank you for sharing!&#039;  \t</p>  \t</li>  \t<li>  \t<p style=\"\">  \t\t  &#039;All your videos are brilliant. Thank you for the simple and affective (and fun) methods. Phew, to think I struggled with these concepts 40 years ago and it is this simple!!!!!&#039;  \t</p>  \t</li>  </ul>  <p>  \t  I have now created the course below which includes 12 videos covering over two hours of lectures, the wacky way! There is a quiz containing five multiple choice questions after each topic, so 55 questions in addition to the lectures.  </p>  <p>  \t<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Maths the Wacky Way", 
    "price": "20.00", 
    "instructors": "Claire Gallagher", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351336_10e7_3.jpg", 
    "course_url": "https://www.udemy.com/maths-the-wacky-way/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T22:44:11Z"
}