{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>When we grow up and take math courses, we tend to ask: &quot;Why is that true?&quot; Most of the time, the teacher tells you something like &quot;because that&#039;s the way it is.&quot; In this course, we reintroduce all of mathematics in the perspective that we should have. We answer and PROVE the &quot;why&quot; in our lives. The greatest part is that we are dealing with truth - something that science or any other subject can talk about. Everything proven in this course is absolute truth and cannot be denied.</p><p>Many students get their first exposure to mathematical proofs in a high school course on geometry. Unfortunately, students in high school geometry are usually taught to think of a proof as a numbered list of statements and reasons, a view of a proof that is too restrictive to be very useful.</p><p><strong style=\"\">Learn How To Prove It Today!</strong></p><p>In this course, we learn how to prove amazing mathematical facts:</p><ul style=\"\"><li>The square root of 2 is irrational</li><li>An even number plus an even number is an odd number</li><li>Prove that certain functions are continuous</li><li>Prove that there are infinitely many prime numbers</li><li>Understand infinity!</li><li>What is equality and inequality?</li></ul><p>The proofs in this course may sound extremely simple, but if I were to ask you to prove 1+1=2, could you do it? It takes 362 pages to prove this fact! Well, there are better methods today, but the process of proving things is more fun than you can imagine!</p><p><strong style=\"\">What Are You Waiting For? Sign Up Today!</strong></p>", 
    "end_date": null, 
    "title": "Math Proofs 101: Mathematical Structures, Sets And Logic", 
    "price": "20.00", 
    "instructors": "Kody D'Amours", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481770_1fe4_3.jpg", 
    "course_url": "https://www.udemy.com/settheory/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T03:07:02Z"
}