{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Taught by a former college math instructor with over 8 years of experience teaching and over 14 years of experience tutoring.</p><p style=\"\">This course will teach you how to factor with the GCF (greatest common factor), how to factor by grouping, how to factor special types of expressions, and most importantly, how to factor the well-known-but-not-so-well-liked quadratic expression.</p><p style=\"\">We begin with an outline of the topics to be discussed, then we jump right in with explanations and examples. Each section has explanations, examples, and review worksheets with full solutions. The solutions are provided in separate documents so you can do the worksheets without having the answers in front of you. Sort of like a mini self-quiz.</p><p style=\"\">Why take this course? It will make your life significantly easier in your math classes, leading to an easier life in general. F<strong style=\"\"></strong>actoring is one of the most important concepts taught in math at this level. It is widely used in more advanced math classes for things like solving equations and performing other, more advanced operations. Please trust me when I say that your future math courses - and even your current course later on - will be very difficult if you do not have adequate factoring skills. I have seen it myself too many times. Students in more advanced courses like precalculus and calculus (and beyond) struggle with the concepts early on in those courses because they don&#039;t have a solid background in the basics, including and especially factoring. I can&#039;t count how often I&#039;ve seen this, and I&#039;m usually pretty good at counting stuff.</p><p style=\"\">But really, it&#039;s an important skill to have, and an absolutely indispensable one if you are planning to continue taking courses in math.</p>", 
    "end_date": null, 
    "title": "Math - How to Factor", 
    "price": 0, 
    "instructors": "Chris W", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479712_8948_3.jpg", 
    "course_url": "https://www.udemy.com/math-how-to-factor/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T13:36:27Z"
}