{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<em>'Recognized as a <strong>top instructor</strong> by Udemy for high quality academic courses'</em>  </p>  <p>  \t<em>'First time on Udemy, courses delivered by <strong>Nobel Prize laureates and international academic authorities'</strong></em></p><p><em><strong></strong>If you are as crazy and passionate about true knowledge as our community and believe that true <strong>knowledge is true wealth</strong>, then our courses are for you.</em></p>  <p>  \t  In this masterclass Nobel Prize Winner in Physics Sheldon Lee Glashow presents a revolutionary theory and its creator.  </p>  <p>  \t  The insights, experiments and achievements of Max Planck and his successors. How the understanding of the invisible structure of matter has paved the way for futuristic technological applications, from the laser to the cellular phone. It's a new vision of physics; one of the most famous theories but also the most complex of modern science.  </p>  <p>  \t<strong>This course is for:</strong>  </p>  <ul>  \t<li>Anyone with inquisitive and open mind</li>  \t<li>Everyone interested in science and who would like to learn more about Max Planck and his quantum theory</li>  \t<li>Anyone with Interest in science</li>  \t<li>Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li>Attending the course does not need any scientific skill since it is presented in a clear and simple manner</li>  \t<li>Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates' works.</li>  </ul>  <p>  \t<strong>With this course you will learn:</strong>  </p>  <ul>  \t<li>Over 25 lectures and 1.5 hour of content!</li>  \t<li>24 masterclasses and 1.5 hour and more of content</li>  \t<li>You will learn how Max Planck originated quantum theory and what quanta are</li>  \t<li>You will learn how the discovery of quanta is fundamental also in everyday life</li>  </ul>  <p>  \tFrom literature to economics, art to philosophy, <strong>EdooTV</strong> gives voice to the world's leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p>  \tDon't wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong>best gift</strong> you can give to yourself and your loved ones.  </p>  <p>  \tFeel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "Max Planck – Sheldon Lee Glashow", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389538_2890.jpg", 
    "course_url": "https://www.udemy.com/max-planck-sheldon-lee-glashow/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T15:12:31Z"
}