{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \tThere are various applications of differentiation. In this course, we learn to apply derivatives to find the maximum and minimum values of differentiable functions in their domains. To begin with in the first section, a brief note about the need to study the topic Maxima and Minima is given.  </p>  <p style=\"\">  \t In sections 2,3,4 the definitions and the concepts of the points of local / global /absolute maxima and minima which can be obtained by using differentiation is discussed.Also the behavior of f ‘(x) at local maxima and local minima points is discussed.  </p>  <p style=\"\">  \t In section three, the terms stationary points, critical points and points of inflexion are taken up. In this section we also discuss about the concept of concavity, concave upward curves and concave downward curves. Also we see how the concept of concavity is applied to identify the points of inflexion.  </p>  <p style=\"\">  \t The next section deals with various derivative tests for local maximum and local minimum. The tests discussed are the first derivative test, the second derivative test and in general the higher order derivative test. Working rule to use these tests is also included at the end of the lectures. Also downloadable supplementary material is provided under the heading &quot;Concepts to Remember&quot; . This covers the key concepts covered lecture-wise.  </p>  <p style=\"\">  \t  Every concept is well explained with appropriate graphical figures.Every topic includes videos of  examples which have been carefully selected and properly graded and solved to illustrate the concepts and techniques. Wherever possible the solutions include graphical explanations as well.  At the end of the course the applications of maxima and minima under the heading &#039;optimization problems&#039; have been discussed.  </p>  <p style=\"\">  \t This topic is very important and useful for higher studies in Science, Technology and Economics in optimization problems. For example in Economics, we can tackle the problems like 1.Minimize cost production.i.e. expenses, effort etc.  </p>  <p style=\"\">  \t 2.Maximize profits, efficiency and outputs etc.  </p>  <p style=\"\">  \t In Mensuration, we can find the solutions to the problems where we need to maximise or minimise the volumes or areas of geometric figures such as cylinder, cuboid etc.  </p>  <p style=\"\">  \t However, we are today equipped with graphing calculators and computers to find the maximum and minimum values of functions.  </p>  <p style=\"\">  \t But having said that it is still required to study this topic of “ Maxima and Minima” in Calculus to increase our understanding of functions and the mathematics involved.  </p>", 
    "end_date": null, 
    "title": "Maxima and Minima 2 : Applications of Derivatives", 
    "price": 0, 
    "instructors": "Surya Kumari Gandikota", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/201782_378f_3.jpg", 
    "course_url": "https://www.udemy.com/maxima-and-minima-2-applications-of-derivatives/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-19T17:25:18Z"
}