{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<em>'Recognized as a <strong>top instructo</strong>r by Udemy for high quality academic courses'</em>  </p>  <p>  \t<em>'First time on Udemy, courses delivered by <strong>Nobel Prize laureates and international academic authorities</strong>'</em></p><p><em>If you are as crazy and passionate about true knowledge as our community and believe that true <strong>knowledge is true wealth</strong>, then our courses are for you.</em></p>  <p>  \t            In this masterclass <strong>Sheldon Lee Glashow</strong>, Nobel Prize Winner for Physics in 1979, describes the history of electromagnetism.  </p>  <p>  \t            Electricity and magnetism; two physical phenomena strongly linked to each other, two forces that have revolutionized everyday life. From Franklin's lightning rod to the experiments of Galvani and Volta, and the fundamental discoveries of Faraday and <strong>Maxwell</strong>; the path of science to the conquest of electricity and its unlimited power.  </p>  <p>  \t<strong>This course is for:</strong>  </p>  <ul>  \t<li>Anyone with inquisitive and open mind</li>  \t<li>Everyone interested in science and who would like to learn more aboutphysics, electricity, magnetism, light etc.</li>  \t<li>Anyone with Interest in science</li>  \t<li>Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li>Attending the course does not need any scientific skill since it is presented in a clear and simple manner</li>  \t<li>Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates' works.</li>  </ul>  <p>  \t<strong>With this course you will learn:</strong>  </p>  <ul>  \t<li>Over 25 lectures and 1.5 hours of content!</li>  \t<li>22 masterclasses and 1 hour and more of content</li>  \t<li>You will learn what the electricity and magnetism are</li>  \t<li>You  will learn how Maxwell showed that electricity, magnetism, and light  are together manifestations of the same phenomenon: the electromagnetic  radiation </li>  \t<li>You will learn physics like never before</li>  </ul>  <p>  \tFrom literature to economics, art to philosophy, <strong>EdooTV</strong> gives voice to the world's leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p>  \tDon't wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong>best gift</strong> you can give to yourself and your loved ones.  </p>  <p>  \tFeel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "Maxwell: Electricity, magnetism and light - S. L. Glashow", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308188_1796_2.jpg", 
    "course_url": "https://www.udemy.com/sheldon-lee-glashow-maxwell/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T08:19:47Z"
}