{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>South-West China is a biodiversity hot spot, an area of tremendous scenic beauty and also of intense cultural diversity. This course provides a photographic tour of the plants found in the mountainous areas of Sichuan and Yunnan. You will also see the scenery and gain a little understanding of the cultural diversity of this wonderful area.<br style=\"\"></p><p>As many gardeners know, China has played a significant role in the development of garden flora throughout the world. The mountain plants of South-West China are quite hardy (covering ranges H5-H7 in the UK&#039;s Royal Horticultural Society&#039;s hardiness ratings), so the course will be of interest to horticulturalists as well as botanists and general travellers.</p><p>I use Latin (scientific) names for plants throughout the course. You will find a lecture covering the principles behind the naming of plants, and I do explain the significance of many of the specific names. As a result, if you are not so familiar with the science behind the naming of plants, you will gain a little more understanding as you progress through the course. Please note also that I have tried hard to be accurate in my naming, but please send me a message if you believe I have incorrectly identified a plant - this will improve the course for all. I have taken as my primary reference for current names Christopher Grey-Wilson and Phillip Cribb&#039;s most excellent <em style=\"\">Guide to the Flowers of Western China</em>.</p><p>I should emphasise that seed and plants of almost all the plants shown are commercially available through a range of nurseries. Plant material and seed should never be collected from the wild unless this is done under properly authorised and regulated expeditions. If you are encouraged to visit the areas shown in this course, please only take photographs and notes - leave all the plants for others to enjoy.</p>  ", 
    "end_date": null, 
    "title": "Mountain Plants of South-West China", 
    "price": 0, 
    "instructors": "Paul Krause", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40219_af57_8.jpg", 
    "course_url": "https://www.udemy.com/mountain-plants-of-south-west-china/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-05T22:58:07Z"
}