{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Are you wanting a clear, easy way to learn Biology? Are you wanting to brush up on revision before exams? Are you studying Biology at home? If so, this course is for you! </p>\n\n<p><strong class=\"redactor-inline-converted\">Learn and Master Biology so that you are confident in the exam</strong></p>\n\n<p>The topics covered include:</p>\n\n<ol><li>Characteristics and classification of living organisms</li><li>Organisation of the organism</li><li> Movement in and out of cells</li><li>Biological molecules</li><li>Enzymes</li><li> Plant nutrition</li><li>Human nutrition.</li></ol>\n\n<p>Together with my teaching experience, passion for Biology and love of creating videos that make Biology come alive, you will find a high quality course that is easy to understand. The video lectures have information linking to real life so that you can see why the topic is beneficial to learning. </p>\n\n<p>By the end of this course, you'll have valuable skills that will help you to draw the key concepts from the content and retain the knowledge more easily. You'll know how to describe, list, calculate, explain, draw and interpret necessary information. <br></p>\n\n<p><strong class=\"redactor-inline-converted\">What to expect</strong></p>\n\n<p>I designed this course in the same way that I teach in the classroom, honing in on key points. You will find over 40 teaching videos that explain the content relevant to the syllabus and linking it to real life. You will also be able to download, print and cut out flash cards of questions and terminology that will help you to learn a difficult topic easily. You can carry these questions in your pocket and use them to study anywhere. At the end of each section is a short quiz for you to check that you are on track.</p>\n\n<p>There are clear learning outcomes at the beginning of each lecture. The videos are short and to the point, honing in on the key points that are important. This means that you can press pause, grab something to drink and watch it again if necessary. I've used real life examples so that you can link the concepts together.</p>\n\n<p>This course is for you if you are studying the Cambridge IGCSE syllabus or an equivalent board. Check the curriculum to see if the content overlaps with what you are studying!</p>\n\n<p>Enjoy and all the best with your revision! :)</p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Ms Cooper's IGCSE Biology: mastering the first 7 topics", 
    "price": "35.00", 
    "instructors": "Leanne Cooper", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/716102_63d5.jpg", 
    "course_url": "https://www.udemy.com/ms-coopers-biology-topics-1-7/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T21:09:38Z"
}