{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This course, which is taught by Neil deGrasse Tyson, the famed astrophysicist, will discuss the most fundamental and fascinating questions that humans have ever asked.</p><p>By exploring these questions and their answers, you'll begin to more clearly understand not only Planet Earth, but also the whole universe.</p><p>You'll learn from one of the most brilliant minds in science today as you move through 12 lectures, during which you'll dive deep into every aspect of the cosmos, from what shapes our planet, to what happens in the galaxy and beyond.</p><p>If you have a genuine curiosity about the way the world works but you've been searching for an easy-to-understand teacher, this course will explain even the most complex scientific concepts in simplified ways.   </p><p><strong>Understand the Origins, Evolution, and Future of the Universe</strong></p><ul><li>Comprehend the shared properties of the Earth and the cosmos</li><li>Discover cosmic catastrophes that could result in the destruction of Earth</li><li>Learn about the Big Bang and the evolution of the cosmos</li><li>Realize the possibility of alien life in the universe</li></ul><p><strong><br>Dive into Various Scientific Schools to Learn About the Cosmos and Planet Earth</strong></p><p>Throughout this course, Neil discusses his 12 favorite subjects in all of science. These lectures are arranged into four groups.</p><p>The first set of lectures is called \"On Being,\" and they present some of the machinery that forms and shapes the cosmos. You'll see that the properties of energy and matter on Earth are found elsewhere in the universe.</p><p>The second set of lectures will discuss \"Cosmic Catastrophes\" that could result in the end of the world. You'll learn about what happens inside black holes, as well as the threat of asteroids and comets.</p><p>The third set of lectures, appropriately called \"The Big Bang,\" will move from the Big Bang theory, to how the universe evolved and how it will continue to evolve.</p><p>The final set of lectures discusses the possibility of alien life forms, and where life could exist outside of Earth.</p><p><strong>Contents and Overview</strong></p><p>At the start of this course, you'll dive into the many aspects of the universe that are spherical. You'll also learn about rarefied objects to comprehend what air really is and how it affects life, and you'll tackle objects with density.</p><p>In the section on catastrophes, you'll discover what black holes are and how they cause death. You'll also learn about three other scenarios that would make total obliteration of the galaxy possible, before discussing asteroids.</p><p>Moving away from death and destruction, you'll view images from outer space and learn how the Big Bang started it all. Concepts from physics, astrophysics, biology, and chemistry are brought together to create a story of the birth and evolution of the cosmos.</p><p>Next, you'll tackle the origin of elements, as well as the tools that scientists are using to find out if other planets could be hospitable to life. You'll think about the evidence that has been gathered thus far regarding the possibility of aliens.  </p><p>By the time you complete this course, you'll have a thorough understanding of some of the most fascinating concepts in science today. You'll be able to comprehend how the universe came to be, the threats it potentially faces, and how it can be expected to evolve.<br></p>", 
    "end_date": null, 
    "title": "My Favorite Universe by Neil deGrasse Tyson", 
    "price": "50.00", 
    "instructors": "The Great Courses", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680870_e5ba.jpg", 
    "course_url": "https://www.udemy.com/neil-degrasse-tyson/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T20:05:42Z"
}