{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>(30 Day Money Back Guaranteed)</p><p>For thousands of years, mathematicians have been curious about numbers. Where did they come from? What properties do they have? The truth is that you will never learn the secrets of numbers until you take Number Theory, and all you need is a curious mind to understand (no prerequisites to this course!). One of the biggest problems in history has been: how to you factor a number into prime factors? Well, 26=13*2, but try factoring 1432479... Not so easy now? What if I asked what the next prime number was after 1432479 is? These are tough questions and their answers involve a different type of math - one that you don&#039;t need calculus for - but you need a lot of curiosity.</p><p>In this course, you will look into the secrets of the integers and the many properties that they hold. You do not need Calculus or any advanced mathematics to understand this course, however this is an advanced mathematics course. The material will not involve &quot;solve for...&quot; problems. This course is designed to prove things, and so most of the lectures will cover proofs, and not problem solving. This is a great introduction to what pure mathematics actually deals with, and what many modern professors research.<br style=\"\"></p>  <p style=\"\">  \t<strong style=\"\">Learn and Master Arithmetic, Prime Numbers and Factorization</strong>  </p>  <ul style=\"\">  \t<li>Solving Diophantine Equations</li>  \t<li>Quadratic Reciprocity Theorems and Legendre Symbol</li>  \t<li>Continued Fractions</li>  \t<li>Primitive Roots</li>  \t<li>Extended Euclidean Algorithm</li>  \t<li>Advanced Modern Factorization</li>  \t<li>Algebra of Prime Numbers</li>  \t<li>Pythagorean Triples</li>  </ul>  <p style=\"\">  \t<strong style=\"\">See the Algebra of Modern Mathematics</strong>  </p>  <p style=\"\">  \t      This is not just a basic math course. This course offers over 7 hours of content that will blow your mind. You will learn more material than most Universities offer in their own Number Theory courses. We go into depth on everything with clear examples that helps you understand.  </p>  <p style=\"\">  \t      How in depth do we go? Take for example the proof of Wilson&#039;s Theorem. We will prove it Once, Twice, Three times each in a different way. And that&#039;s just one theorem in this course.<br style=\"\">  </p>  <p style=\"\">  \t      So what are you waiting for?</p>", 
    "end_date": null, 
    "title": "Number Theory: The Secrets of Numbers: Math Made Simple", 
    "price": "20.00", 
    "instructors": "Kody D'Amours", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270596_100e_4.jpg", 
    "course_url": "https://www.udemy.com/numbertheory/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-28T22:26:42Z"
}