{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Particle Swarm Optimization (PSO)</strong> is an intelligent optimization algorithm based on the Swarm Intelligence. It is based on a simple mathematical model, developed by Kennedy and Eberhart in 1995, to describe the social behavior of birds and fish. The model relies mostly on the basic principles of self-organization which is used to describe the dynamics of complex systems. PSO utilizes a very simplified model of social behavior to solve the optimization problems, in a cooperative and intelligent framework. PSO is one of the most useful and famous metaheuristics and it is successfully applied to various optimization problems.</p>\n\n<p>In this video tutorial, implementation of Particle Swarm Optimization (PSO) in MATLAB is discussed in detail. In the first part, theoretical foundations of PSO is briefly reviewed. Next, PSO is implemented line-by-line and from scratch, and every line of code is described in detail. The instructor of this course is <strong>Dr. S. Mostapha Kalami Heris</strong>, Control and Systems Engineering PhD and member of Yarpiz Team.</p>\n\n\n\n<p>After watching this video tutorial, you will be able to know what is PSO, and how it works, and how you can use it to solve your own optimization problems. Also, you will learn how to implement PSO in MATLAB programming language. If you are familiar with other programming languages, it is easy to translate the MATLAB code and rewrite the PSO code in those languages.<br></p>", 
    "end_date": null, 
    "title": "Particle Swarm Optimization in MATLAB", 
    "price": 0, 
    "instructors": "Yarpiz Team, Dr. Mostapha Kalami Heris", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858430_4360_2.jpg", 
    "course_url": "https://www.udemy.com/pso-in-matlab/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T09:59:30Z"
}