{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This is the complete Patterns of Inheritance course, including videos and quizzes. This course is designed for you to gain a basic understanding of genetics and be able to predict outcomes of genetic crosses. Genetics plays the biggest role about why you are you, but do you really understand patterns of inheritance? This course will help you to better understand the basics of genetics as you learn the following concepts: </p><ul style=\"\"><li>Gregor Mendel and how he became known as the “Father of Genetics”</li><li>Mendel&#039;s experiments that lead to a greater understanding of how genes are passed on from one generation to the next. </li><li>The differences between dominant and recessive traits and how recessive traits can be masked</li><li>The various types of genotypes including homozygous dominant, heterozygous, and homozygous recessive</li><li>How to complete a Punnett Square for monohybrid and dihybrid crosses</li><li>How to predict the phenotypes and genotypes of offspring from monohybrid and dihybrid crosses</li><li>The importance of pedigrees when tracking X-Linked genes through families</li></ul><p>I&#039;ve written this course to help you gain a better understanding of how genes are passed from one generation to the next. Genes affect everyone, whether they understand it or not and it&#039;s important to have at least a basic understanding to better understand yourself and your potential offspring. </p><p>This course covers the following topics; 1. Gregor Mendel, 2. Mendel and the Idea of Alleles, 3. Inheritance of Alleles, 4. Punnett Squares, and 5. X-Linked Inheritance. </p><p>By following each lecture, you will be gaining a better understanding of the current knowledge base of how genes are passed from one generation to the next. It will also help you gain a better grasp upon some of your own traits, as well as the traits future offspring could have. </p><p>I&#039;ve used my experience as a high school Biology teachers to create a high quality learning experience for students, while sticking to the basic material to provide support for learners who are new to the material. </p><p><strong style=\"\">How to Use the Course</strong></p><p>I&#039;ve recorded five lectures that cover the basic concepts needed to understand patterns of inheritance. I&#039;ve also created three short quizzes for you to check your understanding of various concepts. Each lecture is kept short, but plenty of information is included. </p><p>It may be necessary for you to watch videos several times in order to feel confident enough to take each quiz, but that is perfectly fine! Feel free to pause videos, or come back to them later if you don&#039;t have enough time to finish it right away. Each student it going to learn in a different way, at their own unique pace. I&#039;ve also provided learning objectives before each lecture and quiz, so you know what to expect each and every time. </p>", 
    "end_date": null, 
    "title": "Patterns of Inheritance: A Brief Overview", 
    "price": 0, 
    "instructors": "Marlee Clark", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526238_b50a_5.jpg", 
    "course_url": "https://www.udemy.com/patterns-of-inheritance-a-brief-overview/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T18:54:13Z"
}