{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>\nThis course\nteaches introductory physics students how to\ncalculate torque and how to set up free body diagrams\nand solve problems involving torque.  Torque is one of the\ntrickiest concepts in introductory physics, and it is quite common\nfor students to stumble with it at first.  </p><p>\nThis\ncourse is designed to teach you the fundamentals as quickly as\npossible.  Using short-and-sweet videos, this course\nbreaks torque skills into bite-sized chunks and gives lots of\npractice with detailed examples and rapid-fire calculations in\nwhich you pause the video to try the problem and then resume to see\nhow you did.  You can save time by using this interactivity to\nmaster torque in one shot, and you can also pick and choose\nindividual topics to review specific skills or even speed up or slow\ndown each video to help you understand it better.</p><p>\nThe\nvast majority of this course is video.  There is also a PDF\nworksheet that you may optionally print out to help you understand\nsome hands-on concepts.</p><p>\nBefore\ntaking this course, students should understand vectors, especially\nvector components.  It can help if students already know\nhow to use geometry and trigonometry to find angles between\nlines, although this is demonstrated in many examples.</p><p>\nThe\ngoal of this course is to give you the benefits of a private\ntutor at a fraction of the cost. This\ncourse is perfect for students who need to catch up with their class\non their own time, who don't learn well by reading their\ntextbook, or who want to learn tricks and techniques to master torque\nfaster and easier than studying on their own.</p>", 
    "end_date": null, 
    "title": "Physics: Master 2D Torque in Record Time", 
    "price": 0, 
    "instructors": "Scott Redmond", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673472_79c8_4.jpg", 
    "course_url": "https://www.udemy.com/physics-master-2d-torque-in-record-time/", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T16:09:21Z"
}