{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This math course gives you (or reminds you) what is on the basis of mathematics: the numbers. And it is as useful as numbers are: how could you do without counting ability?<br></p><p>The way it leads you into the great wold of numbers is very practical and progressive. <br></p><p>You are guided into the different kinds of numbers, from natural integers to fractions, by the means of actions: count, subtract, divide.<br></p><p>By the end of that course, you will be an efficient calculator, with the theoretical background that helps you to integrate the knowledges.<br></p><p>This will allow you to perform your accountancy, calculate the gain of a financial placement, and generally to do the many things calculation skills allow you to do in everyday life.<br></p><p>You will also be introduced to the rest of our series about practical mathematics.<br></p><p>The course is made of 16 lectures with 3 hours video and many pdf additional files, that get deeply inside the matters and give solved exercises.<br></p><p>The lectures are accompanied by 6 quizzes that, together with the exercises in the pdf files, help you to assess the knowledges you got.<br></p><p>The course is structured in 6 sections that follow the progression into the land of numbers.<br></p><p>The section 1 is an introductory lecture that gives you the taste of getting into the course.<br></p><p>The section 2 shows the natural integers, the numbers we use to count. The counting action sustains all the section.<br></p><p>The section 3 shows how the subtraction leads to the negative numbers that, together with the natural integers, form the relative integer set Z.<br></p><p>The section 4 explores the multiplication of relative integers, in particular the signs rule.<br></p><p>The section 5 shows how the division leads to fractions that, together with the relative integers, form the rational numbers set Q. That section explores in detail the addition, subtraction, multiplication and division in Q.<br></p><p>And the section 6 is a conclusive lecture, that recapitulates the course and introduces to the rest of the series of courses about Practical Mathematics.</p>", 
    "end_date": null, 
    "title": "Practical Mathematics 1: The Numbers", 
    "price": "30.00", 
    "instructors": "Fabienne Chaplais", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446462_f64a_2.jpg", 
    "course_url": "https://www.udemy.com/practical-mathematics-i-the-numbers/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T11:17:19Z"
}