{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>In this course, you will learn how to successfully apply the concept of constant rate of change and functions to great problems. This course is compatible with Common Core and any university-style Precalculus course. This is the first part of a three part course that covers every detail you need to know about Precalculus from an actual university professor who has worked with the author of the book designed just for this class.</p><p><strong>Success in Precalculus Has Never Been So Easy!</strong></p><p>You will learn about:</p><ul><li><strong></strong>Constant Rate of Change</li><li>Function Definitions</li><li>Inverse Functions and Composition of Functions</li><li>Applying Simple Concepts to Solve Hard Problems</li></ul><p><strong>Master the Art of Mathematics!</strong></p><p>This course is designed to change the way Precalculus should be taught. Most teachers struggle with teaching this topic - and that is because they struggled being taught this topic. These authors brought together the greatest researchers in the world to create a Precalculus course that makes sense and is easy to teach. This course is extremely modern, but it applies to everyone.</p><p>For example, the domain of a function is a concept that almost every student struggles with. This course has proven countless times to introduce this topic in a way that makes sense to everyone. This course was designed for you!</p><p>So what are you waiting for? Time to sign up!</p>", 
    "end_date": null, 
    "title": "Precalculus Made Simple: Constant Rate of Change & Functions", 
    "price": "20.00", 
    "instructors": "Kody D'Amours", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747180_e9ca.jpg", 
    "course_url": "https://www.udemy.com/precalculus-part1/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T20:10:06Z"
}