{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t  A course on quantum physics for everyone, which will lead you by hand as clearly as possible from the abc of quantum mechanics to the most recent experiments and its philosophical implications. This course does not only introduce you to the basics of quantum theory, but covers also with a simple and non academic approach topics and several experiments that usually are discussed only among specialists. We review the standard concepts like the wave-particle duality, Heisenberg`s uncertainty principle, Schrödinger`s cat, the vacuum zero-point energy and virtual particles, among several others. Then we deepen the subject analysing quantum entanglement, the so called &quot;EPR paradox&quot; which question our naive understanding of the meaning of reality and locality, together with other effects and ground braking discoveries of the last century physics. Another, more advanced section, and that is usually not explained to the popular audience in an accurate but clear and understandable way, is what I call the &quot;quantum philosophy experiments&quot;, like the &quot;which way&quot;, &quot;quantum erasure&quot;, &quot;delayed choice&quot;, &quot;interaction free&quot; and &quot;quantum teleportation&quot; experiments.  </p>  <p style=\"\">  \t                This course is unique in the sense that, after delivering a historic introduction and the foundations, getting rid of typical popular misunderstandings, it discusses also several topics which go to the essence of the quantum phenomena, making it available for the first time in an easy understandable way to everyone. It is for those who always wanted to understand the principles of quantum physics, but are not physicist. Especially the part on quantum philosophy experiments may be interesting for physicists too who want to deepen the conceptual foundations and the philosophy of QM. For those who always have been attracted by the fascinating and weird quantum world, but found only advanced level university courses, or superficial popular science hypes where you couldn&#039;t discriminate between serious sensical and nonsensical stuff and between scientific and pseudo-scientific theories. For those who searched for a course that explains the basics of quantum mechanics, but that does not presuppose a technical preparation, and yet furnishes the most rigorous account as far an (almost) non mathematical exposition allows for.  </p>  <p style=\"\">  \t               By covering the basics of quantum theory, from its birth about a century ago until today&#039;s modern research, its aim is to deliver the material necessary so that you will be able by yourself to distinguish between mere speculative (and more or less extravagant) interpretations in fashion, and the real experimental facts.<br style=\"\">  \t<br style=\"\">  \tNote: students from schools or colleges will get a free bonus. Send an email to marco.masi@gmail.com from your school/department mail account and you will get the coupon.  </p>", 
    "end_date": null, 
    "title": "Quantum Physics: an overview of a weird world", 
    "price": "20.00", 
    "instructors": "Marco Masi", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/88718_852e_11.jpg", 
    "course_url": "https://www.udemy.com/quantum-physics/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-05T17:58:48Z"
}