{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \tEl curso enseña a resolver sistemas de ecuaciones lineales con 2 variables como un experto, de forma fácil y rápida.  </p>  <p style=\"\">  \tEl curso cuenta con clases en las cuales el instructor desarrolla y enseña las formas principales para resolver ecuaciones con 2 variables. Se estudian los métodos de igualación, sustitución y eliminación.  </p>  <p style=\"\">  \tCada problema se analiza de la siguiente manera  </p>  <p style=\"\">  \t·Método a utilizar  </p>  <p style=\"\">  \t·Variable a conocer primero  </p>  <p style=\"\">  \t·Encontrar valor de la primera variable  </p>  <p style=\"\">  \t·Encontrar el valor de la segunda variable  </p>  <p style=\"\">  \t·Verificación de resultados  </p>  <p style=\"\">  \t·Solución final  </p>  <p style=\"\">  \tEl curso comienza con información acerca de los conocimientos previos necesarios para sacar el mayor provecho de las clases. En las clases se desarrollan ejemplos ilustrativos para la enseñanza y cuenta ejercicios propuestos que se invitan a resolver y poner a pruba tus conocimientos. Finalmente, hay un exámen para que pongas a prueba tus conocimientos y revises que fallas cometiste y si tienes que volver a retomar alguna lección.  </p>  <p style=\"\">  \tNecesitarás 3 horas (incluyendo realizar los ejercicios propuestos) para terminar el curso y tener la habilidad necesaria para resolver los sistemas de ecuaciones lineales con 2 variables.  </p>", 
    "end_date": null, 
    "title": "Resuelve ecuaciones lineales con 2 variables", 
    "price": "20.00", 
    "instructors": "Mario Clavijo", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301026_6644_5.jpg", 
    "course_url": "https://www.udemy.com/sist-ec-lineales-2variables/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T01:01:46Z"
}