{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t                      Scientific Word is the Windows program used for professional scientific word processing by leading academic and commercial researchers in universities and central banks around the world: from editing screen to printed page. It&#039;s a WYSIWYG (what you see is what you get) interface to LaTeX, the international standard for mathematical typesetting.  </p>  <p style=\"\">  \t                     This Training Course, which we have evolved over the last 20 years, is available live around the world for £6400 ($10k) - or just £1600 ($2600) for small groups of 4. I teach all the courses personally (I love it!). This video version gives the exact same teaching: you don&#039;t get me live for Q&amp;A, but you have the opportunity to watch and re-watch - all for a fraction of the cost.  </p>  <p style=\"\">  \t                This is originally a Two-Day Course, each day comprising 3 one-and-a-half hour sessions. The video version contains over 4 hours of 720HD teaching, with several exercises for you to complete throughout. The course ends with The Advanced Challenge!  </p>  <p style=\"\">  \t<strong style=\"\">Important:</strong> When playing the videos, <strong style=\"\">be sure to watch in HD mode (click the HD button so that it lights up) and full screen mode</strong> for the fine detail.  </p>", 
    "end_date": null, 
    "title": "Scientific Word Technical Typesetting (WYSIWYG LaTeX)", 
    "price": "50.00", 
    "instructors": "Christopher Mabb", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276278_87ab_6.jpg", 
    "course_url": "https://www.udemy.com/scientific-word-technical-typesetting/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-06T22:35:08Z"
}