{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Learn how to write a statement of purpose (or 'graduate school essay') that will make your background and experience stand out from other applicants. This course will cover the basics of writing a statement of purpose (what exactly to include <em>and</em> what to leave out) - including several interactive and fun exercises that will help you define your passion in a format that will make applicant reviewers want to accept you. This course will also provide you with insider information about the graduate school review process and how to avoid common application mistakes.</p><p><strong>Write a compelling narrative about you and your experience </strong></p> <ul><li>Build a convincing argument for why you are a perfect fit for your top grad program</li> <li>Elaborate your experience in a way that captivates reviewers</li> <li>Create a theme that makes the graduate essay easy to write and exciting to read</li> <li>Avoid common mistakes in your statement writing</li></ul> <p><strong>Easy to follow steps and exercises will get you to a terrific statement quickly</strong></p><p>Writing a statement of purpose is very difficult! This course breaks down the process into easy to follow steps, guidelines, and fun exercises that will help you create a statement that will be enjoyable to write. In this course you will break down the statement into important 'puzzle pieces', and then use these pieces to create a theme that is specific to you and your background. At the end of the course you will have a completed statement that is unlike the rest of the pack. </p><p><strong>Content and Overview</strong></p><p>This course contains 11 lectures and over 3 hours of content. In addition there are 11 unique exercises that will help you define various components of the graduate statement of purpose.</p><p>This course is designed for anyone planning on applying to graduate school – whether the application is due in a few weeks or roughly a year away. The course content is applicable for both applied (e.g., medical school, law school, social work) or more research/STEM based programs.</p><p><strong>What are the requirements?</strong></p> <ul><li>A plan to apply to one (or more) US-based graduate school programs in the next year.</li></ul> <p><strong>What am I going to get from this course?</strong></p> <ul><li>11 lectures and more than 3 hours of video content</li> <li>By the end you will have a complete statement of purpose written</li> <li>You will also have a better understanding of the review process for graduate schools</li></ul> <p><strong>What is the target audience?</strong></p> <ul><li>People applying to graduate school (applied or more research-based) in the next year</li></ul>", 
    "end_date": null, 
    "title": "Standout Statements - Get in to Your Top Graduate Program ", 
    "price": "50.00", 
    "instructors": "David Gard, Ph.D.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242970_08b8_2.jpg", 
    "course_url": "https://www.udemy.com/standout-statements-get-in-to-your-top-graduate-program/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-13T23:03:15Z"
}