{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t               This course takes the viewer through the key steps of entering and processing questionnaire/survey data and Likert scales in SPSS, including creating variables in SPSS, entering value labels, using statistical analyses to identify data entry errors, recoding Likert items, computing total (composite) scores, conducting reliability analyses of Likert scales, and computing other statistics, including frequencies, descriptive statistics (mean and standard deviation), and correlations. In addition to this, a number of additional database management skills in SPSS are also covered. Created by an award-winning university instructor with a focus on simple and accurate (step by step) explanations of the material.  </p>  <p>  \t               Specifically, in this course you will learn the following:  </p>  <ul style=\"\">  \t<li>How to enter questionnaire data for qualitative and quantitative variables in SPSS</li>  \t<li>How to reverse code negatively-worded Likert scale items</li>  \t<li>How to create composite (total) scores in SPSS</li>  \t<li>How to conduct reliability analyses (coefficient alpha) in SPSS</li>  \t<li>How to use statistical analysis to detect data entry errors</li>  \t<li>How to use SPSS syntax to quickly and efficiently analyze data</li>  \t<li>How to score/recode true/false (dichotomous) data in SPSS</li>  \t<li>How to create professional looking Likert scales in Microsoft Word</li>  \t<li>Learn SPSS database management skills, including inserting variables and cases, recoding variables, applying value labels to several variables at once, handling missing values in SPSS, and more</li>  \t<li>Learn how to conduct statistical analyses in SPSS, including frequencies, descriptives, correlation, and more. (The primary focus of this course is on questionnaire/survey data and Likert scales; for a more detailed look at <em style=\"\">data analysis</em> in SPSS, our courses descriptive and inferential statistics in SPSS courses are recommended)</li>  </ul>  <p>  \t               This course is perfect for professionals looking to increase the data processing skills in SPSS, for those working on survey research, and for students working on theses or dissertations (or other research projects).  </p>", 
    "end_date": null, 
    "title": "Statistics / Data Analysis: Survey Data and Likert Scales", 
    "price": "30.00", 
    "instructors": "Quantitative  Specialists", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244692_a02f_16.jpg", 
    "course_url": "https://www.udemy.com/survey-data/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-17T04:37:14Z"
}