{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">STATISTICS &amp; ZEN is a &quot;pre-statistics&quot; course. This is a brief, clear and succinct course for four possible audiences. NOTE: This is a unique course in that it has built in techniques to reduce anxiety and to enable exponential retention of what is learned. <em style=\"\">If you are willing to learn statistics in a new way - using breathing, focusing and relaxation exercises - this course is for you.</em></p><p style=\"\">1) Preparation for anyone getting ready to take their first statistics course;</p><p style=\"\">2) Those anxious - from nervous to downright terrified - about taking statistics course; </p><p style=\"\">3) A refresher course for those who have been away from statistics a long time; and,</p><p style=\"\">4) The novice in statistics going into a business (or a business meeting) where &quot;stat speak&quot; is going to happen and you don&#039;t want to look like an idiot.</p><p style=\"\">The course is taught with videos, Powerpoint slides with narrations, and audio files, but more importantly, breathing and relaxing techniques are included to lower fear and confusion and to speed up retention of the material. </p><ul style=\"\"><li style=\"\">You will learn basic symbols and notation used in statistics.</li><li style=\"\">You will learn basic math operations.</li><li style=\"\">You will know how and why tests of significance are needed.</li><li style=\"\">You will know what functions to use for <em style=\"\">samples</em> vs. <em style=\"\">populations</em></li><li style=\"\">You will understand central tendencies of <em style=\"\">mean, median </em>and<em style=\"\"> mode </em>and know how to compute them.</li><li style=\"\">You will understand the Bell Curve and what it means.</li><li style=\"\">You will know how to derive percentiles.</li><li style=\"\">You will know how to do standard deviations for samples and populations.</li><li style=\"\">You will know basic math operations in statistics.</li><li style=\"\">If you are taking an intro statistics course you WILL ACE YOUR FIRST TEST (and, more than likely the second one as well) without studying.  </li><li style=\"\"><span style=\"\"></span>At the end of the course, a 3 page Crib Sheet is included that encapsulates the course. </li></ul>", 
    "end_date": null, 
    "title": "Statistics and Zen", 
    "price": "20.00", 
    "instructors": "Dr. Anthony Dallmann-Jones", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570438_b5cf_2.jpg", 
    "course_url": "https://www.udemy.com/statistics-and-zen/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T20:23:20Z"
}