{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This course is for <em style=\"\">anyone </em>that is looking to take their academics to the next level. These are hacks that have taken years to cultivate but minutes to implement. You will see school as something that can be enjoyable and fun. It is a game that you will WIN! I have included great videos that really articulate what kind of student you should be. The course will take a couple days to really soak in the material but for the over achievers it can completed in an afternoon. </p><p><strong style=\"\">Section 1: Introduction to the Course</strong></p><p>In this video section I will dive into what this course is all about, why I created it, and why I am qualified to teach it. I understand that I have a gift and gifts need to be shared.</p><p><strong style=\"\">Section 2: How to Network in your classes: The Key to Unlocking Your Unlimited Potential</strong></p><p>This lecture is a video lecture with the premise that two heads are better than one. You can rapidly increase your success with the help of others. In these video lectures I will go over the best practices to identify the people you should and should NOT associate yourselves with in the classroom. You will learn tips to make friends easily and keep that connection alive via a mobile app. This is the equivalent of having a group of people in your corner urging you to finish your assignments. It acts as a personal assistant that reminds you when your assignments are due and also an extended resource outside of the classroom. When you go into this will a pure heart people will recognize that and want to help you succeed. You will also help others succeed as well. This is a WIN-WIN relationship that you can cultivate for a lifetime!</p><p><strong style=\"\">Section 3: The Magic Piece of Paper You Severely Overlook and Office Hours</strong></p><p>In this screen recording you will get to have the opportunity to see what I do before day 1 to make sure I don&#039;t lose any points for assignments and to get notification when tests are coming up. I take you step-by-step and show you the framework that I, and soon to be others, will be using to make class a breeze! The other lecture talks about how to utilize a teachers office hours to get insider information that other students simply don&#039;t have. Also to put your teacher in your corner even in a 300+ person class. </p><p><strong style=\"\">Section 4: The Art of Efficient Studying</strong></p><p>In this screen recording and document I will show you how to cut your studying time into a fourth of what you used to study. You will find this section humorous because you probably studied like I used to. You will also see how to pick your study spot and how to organize your class binders to NEVER lose anything again!</p><p><strong style=\"\">Section 5: Course Wrap-Up and Things to Remember</strong></p><p>Here is where I wrap-up the course and give you a road map to remind you everything that you have learned and the best way to implement it. I also show you how to get personal consulting via Skype for a little extra kick of confidence!</p><p><strong style=\"\">Section 6: Exclusive Bonus Content</strong></p><p>In the first lecture I show you how to get most books free. School is expensive enough as it is and books can sometimes send people over the edge. I show you my step-by-step method on finding practically any book for free. Many people want the feeling of a book so they buy one and if you do that and find the bookstore is not giving you much money when you return it then this section is for you. I will show you the better way to return your books to get a bigger return on investment. In the last lecture of this course I show you my secret sauce for my success. </p>", 
    "end_date": null, 
    "title": "Study Less, Achieve More - Untold Secrets from Inner Circle", 
    "price": "20.00", 
    "instructors": "Joseph Frazey", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/509800_af34_3.jpg", 
    "course_url": "https://www.udemy.com/makebettergrades/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-23T19:55:47Z"
}