{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong></strong><strong></strong><strong></strong><strong></strong><strong>Overview</strong></p><p>This course is an introduction to the area of systems ecology, the application of systems theory to the study of ecosystems. Systems ecology uses mathematical modeling and computation to try and understand the networks of interactions between biotic and abiotic elements that give rise to the complex system of an ecology on all scales, from modeling the flow of energy within a microbial ecosystem to trying to understand the nonlinear dynamics of earth’s entire biosphere.</p><p>Taking an integrative and interdisciplinary approach it bridges many areas from physics and biology to the social sciences. Whereas traditional ecology has studied ecosystems with little reference to human society, systems ecology breaks down this barrier to include industrial ecologies as an integral part of earth’s systems in the era of the anthropocene, when understanding the complex interaction between society and ecology is central to gaining traction on major contemporary environmental challenges.</p><strong>Content</strong><span></span><p>This course is focused on providing you with the core principles and concepts in system ecology and is broken down into three main sections. In the first section we will be laying down the basics of systems theory in ecology as we talk about, energetics, thermodynamics, emergent integrative levels and ecosystem dynamics.</p><p>Next we will be looking at nonlinear systems theory within ecology, as we talk about feedback loops, how ecosystems self-organize, the nonlinear dynamics of abrupt ecosystem regime shifts, stability landscapes and ecological networks.</p><p>The final section will be dedicated to socio-ecological systems, we will firstly talk about the new geological era of the anthropocene and the rapidly changing relationship between ecosystem and society. We will look at the area of industrial ecology, models for interpreting socio-ecological systems, their adaptive capacity and resilience, finally we will take an overview to the new area of sustainability science.<br></p><span></span>", 
    "end_date": null, 
    "title": "Systems Ecology An Introduction", 
    "price": "20.00", 
    "instructors": "Complexity Academy", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758322_1fb1_2.jpg", 
    "course_url": "https://www.udemy.com/systems-ecology/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T12:40:17Z"
}