{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t This course introduces the different number systems commonly discussed and studied in different computer and information technology allied courses - the binary, octal, decimal and hexadecimal number systems and how the conversion process from one number system to another take place.  </p>  <p>  \t The materials in this course are presented in video with audio format. Additional learning materials in other formats may also be included in select sub-sections of the course.  </p>  <p>  \t The course may be completed in a week&#039;s time to a maximum of two weeks on the average by spending one to two hours a day of viewing/learning the video course. For those with slower pacing, the course may be completed in four weeks time. Advance learners may finish the course in one a day and the gifted ones will complete the course right after viewing the whole video course in one sitting including the Course Assessment.  </p>  <p>  \t The course is structured by modules, presenting one topic at a time. It begins with an introductory concept and gradually elevates to the core topic discussion. In the core topic discussion, the underlying concepts and principles are presented first, followed by examples and reinforced with exercises, all in the same video. The degree of difficulty of examples and exercises are also presented gradually. The course wraps up with an assessment that contains 10 complex problems with answer keys presented but on a separate video.  </p>  <p>  \t This course provides a very sound and strong foundation for anyone attempting to pursue any computer or technical allied (vocational or degree course) as this video course could help implicitly enhance a student&#039;s ability to assimilate logic, reasoning, programming skills, vivid mind&#039;s view of computer memory mapping, computer memory management and design, cache operation, input/output hardware device interfacing and more, provided they acquired the thorough familiarity with the hexadecimal number system as presented in this course.  </p>", 
    "end_date": null, 
    "title": "Tech-Tutor: Mastering Conversion of Number Systems", 
    "price": "20.00", 
    "instructors": "Ma. Jimda Tarriela  Mariano", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63955_446d_6.jpg", 
    "course_url": "https://www.udemy.com/conversion-of-number-systems/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-05T13:08:51Z"
}