{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<em>'Recognized as a <strong>top instructor</strong> by Udemy for high quality academic courses'</em>  </p>  <p>  \t<em>'First time on Udemy, courses delivered by <strong>Nobel Prize laureates and international academic authorities'</strong></em></p><p><em><strong></strong><em>If you are as crazy and passionate about true knowledge as our community and believe that true <strong>knowledge is true wealth</strong>, then our courses are for you.</em></em></p>  <p>  \t                                                        In this masterclass <strong>Nobel Prize winner John Nash</strong>, one of the most famous scientists of our time, takes us into the heart of the theory of games.  </p>  <p>  \t                                                        Is it possible to build a mathematical model of behavior from a game of chess?  </p>  <p>  \t                                                        An innovative theory for understanding the elaborate strategies that underlie the choices of men. A rational approach that has become a point of reference in many different fields, from economics to psychology to political science.  </p>  <p>  \t<strong>This course is for: </strong>  </p>  <ul>  \t<li>Anyone with inquisitive and open mind</li>  \t<li>Everyone interested in science and who would like to learn more about theory of games and its use in different fields</li>  \t<li>Anyone with Interest in science</li>  \t<li>Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li>Attending the course does not need any scientific skill since it is presented in a clear and simple manner</li>  \t<li>Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates' works.</li>  </ul>  <p>  \t  With this course you will learn:  </p>  <ul>  \t<li>Over 22 lectures and 1 hour of content!</li>  \t<li>22 masterclasses and 1 hour and more of content</li>  \t<li>You will learn what the game theory is</li>  \t<li>You will learn how the game theory can be used in everyday life</li>  \t<li>You  will learn how game theory is closely related to mathematics and how  from a game of chess it is possible to build a mathematical model of  behavior.</li>  </ul>  <p>  \t                                                        From literature to economics, art to philosophy, <strong>EdooTV</strong> gives voice to the world's leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p>  \t  Don't wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong>best gift</strong> you can give to yourself and your loved ones.  </p>  <p>  \t  Feel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "The Game Theory - John Nash", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294530_3d1e_4.jpg", 
    "course_url": "https://www.udemy.com/john-nash-the-game-theory/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T10:35:10Z"
}