{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Many of us, in one way or another, have some kind of a connection to sport. Some will be sports professionals, such as coaches and athletes, whereas others may just be casual spectators admiring the achievements of competitors. Like most things in life, those achievements are determined by scientific principles.</p><p>This course aims to provide an understanding of the physical mechanisms behind many popular sporting events. </p><p><strong>Understand the Science driving Sporting Performance</strong></p><ul><li>Learn how speed and acceleration relate to sprinting</li><li>Understand how Newton's laws of motion determine the path of a football</li><li>Apply the principles of rotational motion to gymnastics, figure skating and diving</li><li>Use the principle of energy conversion for estimating the height achieved in the pole vault</li><li>Learn what the optimum launch angles are for the long jump and other sports projectiles</li><li>Apply basic aerodynamics principles to the javelin throw, ski jumping and swimming</li><li>Estimate the effect of wind speed, altitude, temperature and equipment on various sports</li></ul><p><strong>Based on my successful book, \"An Introduction to the Physics of Sports\"!</strong></p><p><strong>Contents and Overview</strong></p><p>How are Newton's three laws connected to football, and various forms of energy to cycling? What is the relationship between figure skating pirouettes and rotational motion? Do basic aerodynamics concepts influence performance in ski jumping, and hydrodynamics mechanisms, the world records in swimming?</p><p>The aim of this course is to present the physical laws that affect various sports. With the help of simple simulations and graphs, it is easily appreciated that science defines the performance of athletes, whereas at the same time the student is introduced to basic physics concepts in a novel and pleasant way.</p><p>In the seven sessions of the course, the scientific principles and theory governing specific sports and the performance of athletes are presented. For example, the concepts of velocity and acceleration are analysed through the performance of the leading short-distance athlete, Usain Bolt and Newton's three fundamental laws of motion are portrayed in football and basketball. </p><p>The course includes 24 lectures with almost 2 hours of video content, links to numerous scientific articles of mine on sports physics and links to many videos of great sporting moments. At the end of each session a quiz is included to assess student understanding.</p>", 
    "end_date": null, 
    "title": "The Physics of Sports", 
    "price": "20.00", 
    "instructors": "Dr Vassilios McInnes Spathopoulos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455916_b7f6_2.jpg", 
    "course_url": "https://www.udemy.com/the-physics-of-sports/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T17:12:07Z"
}