{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t      Ever wonder why afternoon thunderstorms form in the summer, or how hail forms? Maybe you have another question about weather but do not want to learn all of the complicated mathematics and science that are included in a detailed meteorology class? In this course, The Weather Around You, I will teach you what you want to know about basic weather phenomenon, from how small air eddies form, to how the earth&#039;s tilt and orbit impact our weather.  </p>  <p>  \t    We will work our way into many different concepts necessary for understanding the weather. As we move through the course together, we will discuss air pressure, energy and how it actually warms us up, water&#039;s role, clouds, precipitation, storm formation and so much more. Toward the end of the course we will also discuss how different weather events are formed, such as thunderstorms, tornadoes and lightning.  </p>  <p>  \t  Each lecture will cover a specific idea or concept about the weather, without lingering too long on any one subject. lectures are generally 5 - 10 minutes in length and have a brief review at the end. After each section you will be given the opportunity to see how much you have learned by taking a short quiz pertaining to the information we have covered! When you finish this course you will have a great understanding of what the weather is doing around you, as well as know what the weather forecasters actually mean when you hear them use weather related terms!  </p>", 
    "end_date": null, 
    "title": "The Weather Around You, Understanding How the Weather Works", 
    "price": "20.00", 
    "instructors": "Patrick Frank", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334490_ae15_8.jpg", 
    "course_url": "https://www.udemy.com/the-weather-around-you/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T02:36:46Z"
}