{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<em>'Recognized as a <strong>top instructor</strong> by Udemy for high quality academic courses'</em>  </p>  <p>  \t<em>'First time on Udemy, courses delivered by <strong>Nobel Prize laureates and international academic authorities</strong>'</em></p><p><em>If you are as crazy and passionate about true knowledge as our community and believe that true <strong>knowledge is true wealth</strong>, then our courses are for you.</em></p>  <p>  \t                        In this masterclass <strong>Andrew Wiles</strong>, one of the great mathematicians of our time, guides us into the fascinating world of numbers.  </p>  <p>  \t                        The principles and developments of the <strong>theory of numbers</strong>, the discipline that the famous scientist Gauss called “the queen of mathematics\"; a journey among its leading figures, an inheritance of theories and puzzles handed down to us, the progress of a subject matter that is constantly evolving.  </p>  <p>  \tThis course is for:  </p>  <ul>  \t<li>Anyone with inquisitive and open mind</li>  \t<li>Everyone interested in science and who would like to learn more about theory of numbers and its developments</li>  \t<li>Anyone with Interest in science</li>  \t<li>Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li>Attending the course does not need any scientific skill since it is presented in a clear and simple manner</li>  \t<li>Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates' works.</li>  </ul>  <p>  \tWith this course you will learn:  </p>  <ul>  \t<li>Over 22 lectures and 1 hour of content!</li>  \t<li>22 masterclasses and 1 hour and more of content</li>  \t<li>You will learn what the theory of numbers is</li>  \t<li><span></span>You will learn how Andrew Wiles discovered his proof of Fermat's Last Theorem</li>  \t<li>You will learn how mathematicians think while discovering a theorem.</li>  </ul>  <p>  \tFrom literature to economics, art to philosophy, <strong>EdooTV </strong>gives voice to the world's leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p>  \tDon't wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong>best gift</strong> you can give to yourself and your loved ones.  </p>  <p>  \tFeel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "The Theory of Numbers - Andrew Wiles", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307510_a553_4.jpg", 
    "course_url": "https://www.udemy.com/andrew-wiles-the-theory-of-numbers/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-25T09:02:38Z"
}