{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">&#039;Recognized as a <strong style=\"\">top instructor</strong> by Udemy for high quality academic courses&#039;</em>  </p>  <p style=\"\">  \t<em style=\"\">&#039;First time on Udemy, courses delivered by <strong style=\"\">Nobel Prize laureates and international academic authorities&#039;</strong><br style=\"\">  \t      ---------------------------------------------------------------------------------------------------------------------</em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Introductory Promo</u> - Buy any 2 courses from us, and get 1 course of your choice free. Price to go up soon.</em>  </p>  <p style=\"\">  \t<em style=\"\">---------------------------------------------------------------------------------------------------------------------</em>  </p>  <p style=\"\">  \t      If you are as crazy and passionate about true knowledge as our community and believe that <strong style=\"\">true knowledge is true wealth</strong>, then our courses are for you.  </p>  <p>  \t        In this masterclass the great scientist <strong style=\"\">James Watson, Nobel Prize Winner</strong> for Medicine in 1962, tells us about the Human Genome Project and his ambitions.  </p>  <p>  \t        In 1988, when the U.S. Congress gave the official go-ahead to the Human Genome Project, it opened a season of great excitement in the field of biology. The objective was to identify the genetic code that every human being carries in its cells. The fundamental stages of a race to reach the sequence of life.  </p>  <p style=\"\">  \t<strong style=\"\">This course is for:</strong>  </p>  <ul style=\"\">  \t<li>Anyone with inquisitive and open mind</li>  \t<li>Everyone interested in science and who would like to learn more about human genome and its development in biology and medicinal field</li>  \t<li>Anyone with Interest in science</li>  \t<li>Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li>Attending the course does not need any scientific skill since it is presented in a clear and simple manner</li>  \t<li>Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates&#039; works.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">With this course you will learn:</strong>  </p>  <ul style=\"\">  \t<li>Over 24 lectures and 1 hour of content!</li>  \t<li>21 masterclasses and 1 hour and more of content</li>  \t<li>You  will learn how The Human Genome Project determined the sequence of the  human genome and identified the genes that it contains</li>  \t<li>You will learn the history of human genome by James Watson, one of the discoverers of the structure of DNA</li>  </ul>  <p style=\"\">  \t      From literature to economics, art to philosophy, EdooTV and The Thought Flame gives voice to the world&#039;s leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p style=\"\">  \t      Don&#039;t wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong style=\"\">best gift</strong> you can give to yourself and your loved ones.  </p>  <p style=\"\">  \t      Feel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "The Human Genome - James Watson", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389416_bd77_2.jpg", 
    "course_url": "https://www.udemy.com/the-human-genome-james-watson/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T11:42:42Z"
}