{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t   Everything we now know about the universe—from the behavior of quarks to the birth of entire galaxies—has stemmed from scientists who’ve been willing to ponder the unanswerable. And with the advent of modern science, great minds have turned to testing and experimentation rather than mere thought as a way of approaching and grappling with some of the universe’s most pressing and vexing dilemmas.  </p>  <p>  \t        So what is our latest picture of some of the most inexplicable features of the universe? What still remains to be uncovered? What are some of the next avenues of exploration for today’s chemists, physicists, biologists, and astronomers?  </p>  <p>  \t        Pondering the answers to these and other questions is a great way to  </p>  <p>  \t        ·appreciate the grandeur and complexity of the world around you,  </p>  <p>  \t        ·better understand and discuss news and developments in science, and  </p>  <p>  \t        ·spark further interest in some of science’s many exciting areas of study.  </p>  <p>  \t        “We know a lot about the universe. But there’s even more that we <em style=\"\">don’t</em> know,” says astrophysicist and Professor Neil deGrasse Tyson, director of the Hayden Planetarium, an award-winning lecturer, and one of the world’s foremost experts on the secrets of the universe. And his course <strong style=\"\">The</strong> <strong style=\"\">Inexplicable Universe: Unsolved Mysteries</strong> is the perfect gateway into this mind-bending and eye-opening subject. This visually stunning course, which has been honored with a 2013 Telly Award for Outstanding Educational Program, features six self-contained lectures that transport you on a marvelous journey to the frontiers of the known (and unknown) universe and introduce you to tantalizing questions being addressed by the world’s top scientists. Undeniably engaging and fascinating, this lecture series is a wonderful entrée to scientific pursuits that lie at the very heart of the history and nature of our universe.  </p>  <p>  \t<strong style=\"\">An Informed Scientific Conversation</strong>  </p>  <p>  \t        Central to <strong style=\"\">The</strong> <strong style=\"\">Inexplicable Universe</strong> is the way it takes you deep into hidden layers of the universe in a manner that is extremely accessible. Rather than a stern lecture given before a podium complete with confusing mathematics, Professor Tyson’s lectures have the feel of an informed conversation that manages to be both thorough and easy to grasp.  </p>  <p>  \t        With each of the inexplicable mysteries he lays bare for you, Professor Tyson  </p>  <p>  \t        ·introduces you to the history behind it,  </p>  <p>  \t        ·lays out the science that has helped us grasp it,  </p>  <p>  \t        ·explains what researchers have discovered to date, and  </p>  <p>  \t        ·reveals what we have yet to discover.  </p>  <p>  \t        And while the topics explore subjects in everything from quantum mechanics to cosmology to string theory, you’ll never feel overwhelmed by what you’re learning. In fact, you’re more likely to find yourself intrigued by just how much we know—and curious about what the near future will possibly reveal.  </p>  <p>  \t<strong style=\"\">Explore Fascinating Territory</strong>  </p>  <p>  \t        So what territory will you chart in this course? Here are some of the inexplicable ideas you’ll investigate in these lectures.  </p>  <p>  \t        ·<strong style=\"\">Neutrinos:</strong> Discovered in 1956, these fast-moving, ghostlike particles are made in abundance in the sun’s core. They hardly interact with matter; it takes a light-year’s worth of lead (5.8 trillion miles) to stop a neutrino. Not only that, but 65 billion neutrinos pass through every centimeter of your body that’s facing the sun every second of every day.  </p>  <p>  \t        ·<strong style=\"\">String theory:</strong> This astounding theory offers the hope of unifying all the particles and forces of physics. In the past several decades since the dawn of string theory, it’s been imagined that all the fundamental particles we see and measure are just the manifestation in our dimension of strings vibrating in higher dimensions and at different frequencies.  </p>  <p>  \t        ·<strong style=\"\">Quantum foam:</strong> This idea posits that when the fabric of space and time is so tightly curved on itself, space-time is less a smooth curve and more like the froth on a latte. In this state of matter and energy, quantum fluctuations can spawn entire universes, each with slightly different laws of physics within them!  </p>  <p>  \t        In addition, you’ll also  </p>  <p>  \t        ·get a peek at what it would be like to travel through a black hole,  </p>  <p>  \t        ·ponder the possibility that life on Earth originated in debris from Mars,  </p>  <p>  \t        ·probe the supposed existence of multiple universes, and  </p>  <p>  \t        ·even imagine the possible end of the universe itself.  </p>  <p>  \t<strong style=\"\">A One-on-One Chat with a Renowned Science Educator</strong>  </p>  <p>  \t        Professor Tyson is renowned throughout the scientific community and the media for his vast knowledge, his penetrating insights, and his amazing ability to make even the most intimidating areas of science accessible, engaging, and—most of all—enjoyable. He brings the same inviting tone and sharp intellect to <strong style=\"\">The</strong> <strong style=\"\">Inexplicable Universe </strong>as he does to his range of media appearances on popular television programs, including <em style=\"\">The Daily Show with Jon Stewart</em>, <em style=\"\">The Tonight Show</em> <em style=\"\">with Jay Leno</em>, and <em style=\"\">Real Time with Bill Maher</em>.  </p>  <p>  \t        Professor Tyson’s lectures also feature expertly crafted animations, explanatory graphics, and other instructive visual elements designed to better explain to you some of the grand, intricate ideas being discussed.  </p>  <p>  \t        With <strong style=\"\">The</strong> <strong style=\"\">Inexplicable Universe</strong>, you’ll feel as if you’re participating in an exclusive chance to sit one-on-one with this renowned science educator and have a provocative, intriguing, and illuminating conversation. No other learning experience—including the most detailed science textbook—can bring you this close to interacting with an expert about the mysteries of the universe around you.  </p>  <p>  \t<strong style=\"\">ABOUT YOUR PROFESSOR</strong>  </p>  <p>  \t        Dr. Neil deGrasse Tyson is the Frederick P. Rose Director of the Hayden Planetarium at the American Museum of Natural History in New York City. He is also a research associate in the Department of Astrophysics at the museum. Professor Tyson earned his undergraduate degree in physics from Harvard University and his Ph.D. in Astrophysics from Columbia University.  </p>  <p>  \t        In addition to his professional publishing and research interests, which include star formation, exploding stars, dwarf galaxies, and the structure of the Milky Way, Dr. Tyson has written prolifically for the public, including a series of essays in <em style=\"\">Natural History</em> magazine on which his previous Great Course, <strong style=\"\">My Favorite Universe</strong>, is based. His books include <em style=\"\">Space Chronicles: Facing the Ultimate Frontier</em>;a memoir, <em style=\"\">The Sky is Not the Limit: Adventures of an Urban Astrophysicist</em>; and <em style=\"\">One Universe: At Home in the Cosmos</em> (coauthored with Charles Liu and Robert Irion), winner of the 2001 American Institute of Physics Science Writing Award to a Scientist.  </p>  <p>  \t        Dr. Tyson is host of the PBS television series <em style=\"\">NOVA scienceNOW.</em> His contributions to the public appreciation of the cosmos have been recognized by the International Astronomical Union in its official naming of asteroid “13123 Tyson.” He has also appeared on a range of popular television programs, including <em style=\"\">The Daily Show with Jon Stewart</em> and <em style=\"\">The Colbert Report</em>.  </p>", 
    "end_date": null, 
    "title": "The Inexplicable Universe with Neil deGrasse Tyson", 
    "price": "30.00", 
    "instructors": "The Great Courses, Neil DeGrasse Tyson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/85290_51db_15.jpg", 
    "course_url": "https://www.udemy.com/inexplicableuniverse/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-29T00:58:21Z"
}