{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>**June 2016 update** Course has been fully redesigned from scratch and a ton of new content has been added. Hope you enjoy!</strong><br></p>\n\n<p>Welcome to <strong class=\"redactor-inline-converted\">Ultimate guide to</strong> <strong class=\"redactor-inline-converted\">Trigonometry</strong>. This course will have all the different topics covered between Grade 7 and 10, therefore will be a comprehensive A-Z guide. The topics are in a sequential order, gradually going up in difficulty, so you can work your way through them at your own pace depending on what you're doing at school.</p>\n\n<p><strong class=\"redactor-inline-converted\">What will this course have and who will benefit?</strong><br></p>\n\n\n\n\n\n\n\n<p>This course is going to cover all the concepts that will be covered in school from basic trigonometry topics such as Pythagoras' Theorem through to more advanced topics such as Angles of Elevation and Depression. During my time as a tutor, I've seen students really struggle to grasp the different elements of this topic, so this course can serve as a permanent reference point for you guys going forward.</p>\n\n\n\n\n\n\n\n<p>If you're high school at the moment and have started doing trigonometry, then this course will be a big help because it can either complement your studies at school or serve as the official guide. I will step you through every topic systematically and run through a number of questions to really help you cement your learning.</p>\n\n\n\n\n\n\n\n<p>A lot of my students are actually parents who are home schooling their kids, so if you're someone looking to brush up on your knowledge to help your kids at home, I know this course along with all my other courses will be a big help.<br></p>\n\n\n\n\n\n\n\n<p>I go through every single topic in a step by step form so it's really easy for you to follow along. <em>Not convinced? </em>Then I suggest you check out the previews before you decide to enroll, to make sure my teaching style is easy to follow, I am very confident that it is. To go a step further, Udemy's 30-day money back guarantee should also make you feel at ease.<br></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What topics will the course cover?</strong></p>\n\n\n\n\n\n\n\n<p>I'll cover the following topics in the course:</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Pythagoras' Theorem:</strong><br></p>\n\n\n\n\n\n\n\n<ol><li>Right-angled triangles</li><li>Finding the hypotenuse</li><li>Finding the other sides</li><li>Composite shapes</li><li>Pythagorean triples</li><li>Pythagoras' Theorem in 3-Dimensions</li></ol>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Trigonometry:</strong></p>\n\n\n\n\n\n\n\n<ol><li>Introducing SOH, CAH and TOA</li><li>Calculating unknown side lengths</li><li>Calculating unknown angles</li><li>Angles of elevation and depression</li><li>Bearings and compass directions</li><li>Word problems</li></ol>\n\n<p><strong class=\"redactor-inline-converted\">Non right-angled triangles:</strong></p>\n\n<ol><li>Sine rule</li><li>Cosine rule</li><li>Heron's Formula</li><li>Word problems</li></ol>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why Trigonometry?</strong></p>\n\n\n\n\n\n\n\n<p>Trigonometry is a huge part of maths at school and it's a shame that a lot of the fundamentals are just not taught properly by teachers and then students are expected to do quite advanced operations in higher grades. That's why I created this course for you guys so you always have a reference point and furthermore always have access to me when you need help :)</p>\n\n\n\n\n\n\n\n<p>**BONUS** I've also added worksheets (with answers) for each chapter to help you further test and implement your learning from the lectures.</p>\n\n\n\n\n\n\n\n<p>I'm working on a number of courses like this, which cover a variety of maths topics. I'll keep you guys updated as I release them :)</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Something missing in the course?</strong><br></p>\n\n\n\n\n\n\n\n<p>If you find I haven't covered a topic that you need at this level, let me know on the discussion board and I'll be happy to add it in :)</p>\n\n\n\n\n\n\n\n<p>I can guarantee that you'll be miles ahead of the competition if you take this course seriously and best part about being able to do it all is that you can teach others as well. <em>When you're willing to spend upwards of $50 an hour for a private tutor, it seems like a no brainer to at least give this a go, so that you have access to your very own private tutor any time you wish.</em></p>\n\n\n\n\n\n\n\n<p>I'm good with messages and emails so if you have questions, make sure to get in touch with me. And furthermore, I want you guys to make full use of the discussion board because one of the best ways to learn is by sharing your knowledge with others. Thanks guys, really hope you enjoy.</p>", 
    "end_date": null, 
    "title": "Ultimate guide to Trigonometry", 
    "price": "20.00", 
    "instructors": "Chanda Academy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748286_678a_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-guide-to-trigonometry/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-31T23:46:20Z"
}