{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>**<strong>May 2016 update: Course completely redesigned with a lot of new questions to further improve your learning**</strong><br></p>\n\n<p>Welcome to <strong>Ultimate guide to maths word problems - Intermediate Part Two</strong>. This course is tailored towards Grade 10 students who're looking to get a leg up on their ability to tackle the dreaded word problems. If you have significant trouble with problem solving questions, then I suggest you enroll in <strong></strong><strong>Ultimate guide to maths word problems Intermediate Part One</strong><strong> </strong>before attempting this course as we'll be building on a lot of the things covered in those ones.</p>\n\n<p><strong>What are word problems?</strong><br></p>\n\n\n\n<p>We all learn basic concepts like fractions, decimals, algebra etc. at school. We know how to add fractions or simplify algebraic expressions, but what stumps us is having to apply our knowledge to \"real life scenarios\". These are <em>word problems</em>. I'm sure you've come across these during your schooling. For example, <em>Luke buys milk and bread on his way home, paying with a $10 note. If he buys three cartons of milk and two loaves of bread, he receives 5 cents in change. If he buys two cartons of milk and one loaf of bread, he receives $4.15 in change. How much does each item cost? </em><em>Show full working.</em></p>\n\n\n\n<p><em></em></p>\n\n\n\n<p>This is a typical linear-equations based word problem where you have to use the concept of simultaneous equations. Not sure how to do these? Then let me help :)</p>\n\n\n\n<p>A lot of students find these types of practical questions quite challenging to answer as they have trouble linking their basic knowledge of linear equations in this case to the real life scenario at hand.</p>\n\n\n\n<p><strong>How will this course help you?</strong><br></p>\n\n\n\n<p><em></em>Every topic that I cover in this course will come up in some form in years to come. I go through every single topic in a step by step form so it's really easy for you to follow along. <em>Not convinced? </em>Then I suggest you check out the previews before you decide to enroll, to make sure my teaching style is easy to follow, I am very confident that it is. To go a step further, Udemy's 30-day money back guarantee should also make you feel at ease.</p>\n\n\n\n<p><strong>What will this course have?</strong></p>\n\n\n\n<p>As I mentioned, this particular course is geared towards students in Year 10. I will go through a number of<strong> </strong>problem solving / word problem questions, split into the different topics listed below. I go through each question in a systematical step by step manner making it super easy to follow along and adopt in your own workings.</p>\n\n\n\n<p><strong>What topics will the course cover?</strong></p>\n\n\n\n<p>The course will cover most topics that come up in this grade and are prone to have a lot of worded problems attached to them.</p>\n\n\n\n<p>Linear equations, trigonometry, measurement, quadratic equations, probability and finance.</p>\n\n\n\n<p><strong>Why did I decide to create two intermediate courses?</strong><br></p>\n\n\n\n<p>If you're wondering this then that was because I saw that the level of difficulty jumps up heaps from Grade 9 to Grade 10 and some new concepts are introduced as well. So instead of piling everything into one course and confuse you, I decided to create two different ones so you could gradually go up in levels :).</p>\n\n\n\n\n\n<p>**BONUS** I've also added worksheets (with answers) for each topic to help you further test and implement your learning from the lectures.</p>\n\n\n\n<p>**WARNING** I'm going to assume knowledge of how to perform the actual operations involved with these word problems. This course is only to show how to approach the word problems, NOT the operations behind them.<br></p>\n\n\n\n<p><strong>Something missing in the course?</strong><br></p>\n\n\n\n<p>If you find I haven't covered a topic that you need at this level, let me know on the discussion board and I'll be happy to add it in :)</p>\n\n\n\n<p>I can guarantee that you'll be miles ahead of the competition if you take this course seriously and best part about being able to do it all is that you can teach others as well. <em>When you're willing to spend upwards of $50 an hour for a private tutor, it seems like a no brainer to at least give this a go, so that you have access to your very own private tutor any time you wish.</em></p>\n\n\n\n<p>I'm good with messages and emails so if you have questions, make sure to get in touch with me. And furthermore, I want you guys to make full use of the discussion board because one of the best ways to learn is by sharing your knowledge with others. Thanks guys, really hope you enjoy.<br></p>", 
    "end_date": null, 
    "title": "Ultimate guide to math word problems Intermediate Part Two", 
    "price": "20.00", 
    "instructors": "Chanda Academy", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707462_a48f_2.jpg", 
    "course_url": "https://www.udemy.com/maths-word-problems-year-10/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-27T06:22:35Z"
}