{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">**June 2016 update** The course has been redesigned from scratch with 2 more hours of material. Hope you guys enjoy!</strong><br></p>\n\n<p>Welcome to <strong class=\"redactor-inline-converted\">Ultimate guide to </strong><strong class=\"redactor-inline-converted\">Linear Equations</strong>. This is an end to end course on Linear Equations, starting from the very basics all the way to complicated topics such as sketching linear inequations.</p>\n\n<p><strong class=\"redactor-inline-converted\">What will the course have and who will benefit?</strong><br></p>\n\n\n\n<p>By the end of Grade 8, students are able to solve standard linear equations using a variety of methods. Once in Grade 9, students are introduced to new concepts such as working with brackets and sketching linear graphs. My current students in Grade 9 and 10 find linear equations and graphs to be one of the most challenging topics and have a hard time complementing their existing knowledge with the new topics that are introduced at this level. </p>\n\n\n\n<p>In the course, I systematically step you through the different topics, so by the end of it you'll be proficient in not only solving equations but also plotting them using a variety of methods. </p><p>As you'll see in the topics below, we start at the very bottom, and slowly build our way up to the more complex topics.</p>\n\n\n\n<p>I go through every single topic in a step by step form so it's really easy for you to follow along. <em>Not convinced? </em>Then I suggest you check out the previews before you decide to enroll, to make sure my teaching style is easy to follow, I am very confident that it is. To go a step further, Udemy's 30-day money back guarantee should also make you feel at ease.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What topics will the course cover?</strong><br></p>\n\n\n\n<p>I'll cover be covering all the major topics in Linear Equations:</p>\n\n\n\n<p><strong>Start here:</strong></p><ol><li>Solving linear equations using trial and error parts 1 and 2</li><li>Using inverse operations</li><li>Building expressions</li><li>Solving equations using backtracking parts 1 and 2</li><li>Checking solutions </li><li>Keeping equations balanced</li><li>Identifying patterns</li><li>Solving linear equations with unknowns on both sides (beginner level)</li></ol><p><strong class=\"redactor-inline-converted\">Linear Equations:</strong><br></p>\n\n\n\n<ol><li>What are linear equations? *NEW*</li><li>Solving standard linear equations</li><li>Solving linear equations with brackets</li><li>Solving linear equations with unknowns on both sides (more advanced than beginner)</li><li>Problem solving with linear equations</li><li>Rearranging formulas</li></ol>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Linear Graphs:</strong></p>\n\n\n\n<ol><li>Cartesian plane in 2D *NEW*</li><li>Plotting linear graphs</li><li>General equation of a straight line</li><li>Sketching linear graphs</li><li>Determining linear rules</li><li>Parallel and perpendicular lines *NEW*</li><li>Midpoints and distances between points</li><li>Non-linear relations *NEW*</li><li>Graphing solution of simultaneous linear equations</li><li>Solving simultaneous equations using substitution</li><li>Solving simultaneous using elimination</li><li>Problem solving using simultaneous equations</li><li>Solving linear inequations</li><li>Sketching linear inequations</li><li>Solving simultaneous linear equations</li></ol>\n\n\n\n<p>As you can see, with all the topics, we'll be stepping through them systematically and I'll give you guys plenty of opportunities to practice along with me to help you cement your learning.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why linear equations?</strong><br></p>\n\n\n\n<p>I've seen students really struggle with linear equations. I've noticed that a lot of teachers in schools simply don't spend the required time to help their students learn their fundamentals so when they have to do topics like the above, it's just a real pain. That's why I created this course for you guys so you always have a reference point and furthermore always have access to me when you need help :)</p>\n\n\n\n<p>**BONUS** I've also added worksheets (with answers) for each chapter to help you further test and implement your learning from the lectures.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Something missing in the course?</strong><br></p>\n\n\n\n<p>If you find I haven't covered a topic that you need at this level, let me know on the discussion board and I'll be happy to add it in :)</p>\n\n\n\n<p>I can guarantee that you'll be miles ahead of the competition if you take this course seriously and best part about being able to do it all is that you can teach others as well. <em>When you're willing to spend upwards of $50 an hour for a private tutor, it seems like a no brainer to at least give this a go, so that you have access to your very own private tutor any time you wish.</em></p>\n\n\n\n<p>I'm good with messages and emails so if you have questions, make sure to get in touch with me. And furthermore, I want you guys to make full use of the discussion board because one of the best ways to learn is by sharing your knowledge with others. Thanks guys, really hope you enjoy.<br></p>", 
    "end_date": null, 
    "title": "Ultimate guide to Linear Equations", 
    "price": "20.00", 
    "instructors": "Chanda Academy", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707480_2f16_4.jpg", 
    "course_url": "https://www.udemy.com/ultimate-guide-to-linear-equations-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-27T06:51:25Z"
}