{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">This course will take you from understanding what a parabola really means to being able to draw one in basically any form!</p><p style=\"\">It is so simple and so visual: Animations and visual effects that bring these concepts alive. Maths will never be the same again. <br style=\"\"><strong style=\"\"></strong></p><p style=\"\"><br style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Why do students struggle in Maths?</strong></p><p style=\"\">Classes move so fast and cover so many topics that it&#039;s easy for them to miss a few key concepts. </p><p style=\"\">Suddenly, Maths is no longer a logical subject but a painful experience where they try to <em style=\"\">remember</em> <em style=\"\">how</em> to answer questions rather than actually understanding the content.</p><p style=\"\"><br style=\"\"> </p><p style=\"\"><strong style=\"\">How can we help?</strong></p><p style=\"\">We simplify Methods so that they understand the fundamentals of what they are studying and really understand what the question is asking rather than hoping that they remember how to answer it.</p><p style=\"\">Practice is key but there is no point spending hundreds of hours on questions if they don&#039;t <em style=\"\">really</em> know what they are doing: as they simply won&#039;t get the results they deserve.</p><p style=\"\"><strong style=\"\">The Solution</strong></p><p style=\"\">Our tutorials contain every major concept in the topic and are full of animations and visual effects and only contain simple, non-technical explanations. They are designed to give students an intuitive understanding of the subject which in turn increases concentration and makes VCE a lot less stressful for everyone.</p>", 
    "end_date": null, 
    "title": "Understand Quadratics and Parabolas", 
    "price": "20.00", 
    "instructors": "Alex Bell", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460452_831f_4.jpg", 
    "course_url": "https://www.udemy.com/parabola/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T08:36:26Z"
}