{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>En este curso trataremos las nociones iniciales para un curso de funciones de variable compleja, un curso de gran utilidad para ingenieros y científicos en general por sus grandes aplicaciones en la mayoría de áreas matemáticas, desde la geometría hasta las ecuaciones diferenciales.<br><br>En derrotero del curso es el siguiente: <br><br><strong>1) Números complejos y sus propiedades:</strong> En este primer módulo se definirán los números complejos y sus operaciones usuales de suma y multiplicación, además de las definiciones se mencionarán las propiedades principales, no se harán muchas pruebas en esta primera parte ya que son bastante intuitivas y no muy relevantes en el contenido siguiente como sí lo son las propiedades en sí.<br><br>También en este módulo mostraremos la concepción geometrica de los números complejos,  su forma polar y exponencial, asi tendremos claridad en las tres maneras en que se consideraran los números complejos en el curso.<br><br>Para terminar esta unidad mostraremos el cálculo de raices y potencias de números complejos ilustrando con ejemplos.<br><br><strong>2) Regiones del plano complejo (Topología en C): </strong>En esta sección mostraremos conceptos escenciales de la topoloía en C, concepos como conjuntos cerrado, abierto, conexo son definidos en esta unidad, y cada uno de estos conceptos van acompañados de ejemplos.<br><br><strong>3) Funciones complejas:</strong> En este módulo definiremos que es una función de variable compleja y mostraremos ejemplos. También mostraremos cómo una función compleja se puede definir por medio de dos funciones reales llamadas parte real e imaginaria de la función, de esto mostraremos ejemplos.<br><br><strong>4) Límites:</strong> Esta sección la dedicaremos  concepto de límite complejo y sus propiedades. Definiremos límite formalmente, mostraremos su unicidad, y veremos las principales propiedades. Todo se aclarará por medio de ejemplos.<br><br><strong>5) Continuidad:</strong> Por último analizaremos el concepto de continuidad, mostraremos sus principales propiedades y mediante ejemplos clarificaremos la parte teórica.</p>", 
    "end_date": null, 
    "title": "Variable compleja: Números complejos y límites", 
    "price": "30.00", 
    "instructors": "Juan José Ortiz García", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715190_3f83_2.jpg", 
    "course_url": "https://www.udemy.com/numeros-complejos-y-limites/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T04:53:00Z"
}