{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>Teachers, Students and Parents Love these Tutorials</strong><br></p><p>“The videos are a great help and I would recommend them to all VCE Maths Methods students.\" <em><strong>A.M, Student</strong></em></p><p>“For the first time our son understands what he did not in his previous year of schooling.\" <em><strong>K.D., Parent</strong></em></p><p>“I was thrilled to see the video tutorials that Alex Bell put together.\" <strong><em>W.T, Teacher</em></strong></p><p><strong><br></strong></p><p><strong><br></strong></p><p><strong>The only method that allows them to revise the whole year in 2 hours.</strong></p><p>In year 12, there is very little time to waste so they need every resource they can access.</p><p>Our Maths Methods Tutorial Videos are short, simple and focus on the fundamentals they need to know. All the ideas are explained using simple language and we use animations and pictures so that they can visualise the concepts – not just accept them.</p><p>We've translated the complicated language of Maths Methods into simple English to help them read equations as easily as they would read a line out of a book. This simple and effective method has completely changed how students learn Maths and enables them to understand the fundamentals more effectively than ever before.</p><p><br></p><p><br></p><p>“They are fantastic. I really liked the tutorials because they reinforced conceptual knowledge.</p><p><em><strong>W.M, Teacher</strong></em> <br> <br></p><p><br><br></p>", 
    "end_date": null, 
    "title": "VCE Maths Methods in 2 hours", 
    "price": "50.00", 
    "instructors": "Alex Bell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595858_122c_3.jpg", 
    "course_url": "https://www.udemy.com/revisemathsmethods/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T11:59:23Z"
}