{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Mathematical Skills are one of the most important aspect of normal life. You need good mathematical acumen at every point of life. Be it shopping in a supermarket or working in office, a good neck for maths always helps!<br></p><p>With the introduction of technology in our lives, nowadays people are more dependent on calculators, mobiles or computers for even small calculations. But we feel learning some skills will always benefit us.</p><p><strong>What is Vedic Mathematics?</strong></p><p><strong></strong>Vedic mathematics was introduced by Saint Tirthaji in the 1960s and since then it has become very popular among the students of different ages.</p><p>The techniques in vedic mathematics helps us in doing faster mental calculations. In today’s world with the use of technology we hardly use our brains for calculations and thus learning vedic mathematics can help in many ways. Not only it enables us do faster calculations but it also gives us a new way of thinking.</p><p>Mathematics is always seen as a very hard subject by students but if we know vedic mathematics, we really start enjoying mathematics and it becomes fun and easy.</p><p><strong>Details</strong></p><p>Whether you are preparing for competitive exams like CAT, GMAT etc or you are studying in school or you are preparing for a job interview, this course is for you. Infact anyone looking to improve their mathematical skills should take this course.</p><p>The total duration of the course is 2 hours 20 minutes and it contains 15 video lectures which covers all the multiplication and division techniques.</p><p>At the end of the course there are two quizzes which have to be completed in order to finish this course.</p>", 
    "end_date": null, 
    "title": "Vedic Maths: Learn to do calculations upto 10 times faster", 
    "price": "20.00", 
    "instructors": "Ashutosh Parihar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604608_a0d7.jpg", 
    "course_url": "https://www.udemy.com/complete-vedic-mathematics-the-art-of-faster-calculations/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T07:26:12Z"
}