{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\"><em style=\"\"></em>The course gives an in-depth understanding of the most important concepts of Electrical Engineering - Current, Voltage, Resistance, and the Ohm&#039;s Law . The visualizations used to explain these concepts are completely unique. There are a lot of interesting simulations with the help of which you will not only understand the root concepts of Current, Voltage and Resistance but will also be able to see them through your eyes. This way all this learning will stay in your mind throughout your life.</p><p style=\"\">In this 40 min course you will first understand the relationship between the Voltage, the Current and the Resistance with the help of interesting simulations while at the same time visualizing them which will be a unique learning of its kind. Next you will be introduced to the most fundamental law of Electrical Engineering - The Ohm&#039;s Law and its applications. Soon after this you will learn about the V-I graph, its properties and applications. After each topic there is a practice lecture where I solve the questions for you in live to make you perfect in the concept explained and at the same time develop problem solving ability in you. Not only this, with each section there is a Quiz associated for the self assessment of your understanding of that section.</p><p style=\"\">If you have heard of the terms like Current , Voltage or Resistance ever in your life, then taking this course will give you the real meaning of those terms. You will be able to create a picture of these in your mind whenever you hear them next.</p><p style=\"\">This course is must for any Electrical Engineering or Physics student who is at the beginner or intermediate level. You will get to learn a lot from this course on the topics covered and I would say this will be the end of the long search you have been doing to get something incredible on these topics. By the time you finish this course you will be a perfectionist in these topics in all aspects.</p>", 
    "end_date": null, 
    "title": "Visualize Current,Voltage,Resistance & The Ohm's Law", 
    "price": "25.00", 
    "instructors": "Electrical Engineering Laws and Concepts With Visuals", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497478_8247_2.jpg", 
    "course_url": "https://www.udemy.com/current-voltage-resistance-and-the-ohms-law/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T10:30:55Z"
}