{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Dieser Kurs ist eine zielgerichtete Einführung in das Thema Wechselstrom und Zeigerdiagramme. Hier lernst Du, die Konzepte der Wechselstromtechnik konkret anzuwenden - und zwar so, wie Du sie in der <strong class=\"redactor-inline-converted\">Praxis und bei Prüfungen in der Ausbildung</strong> benötigst.</p>\n\n<p><strong class=\"redactor-inline-converted\">Werde fit in einem der wichtigsten Bereiche der Elektrotechnik und bereite Dich effektiv für die nächste Prüfung vor.</strong>\n\n  </p>\n\n<p>Schritt für Schritt werden zunächst die grundlegenden Konzepte der Wechselstromtechnik und der Umgang mit Zeigerdiagrammen erklärt. Hierzu gehören Begriffe wie <strong class=\"redactor-inline-converted\">Amplitude</strong>, <strong class=\"redactor-inline-converted\">Effektivwert</strong> aber auch der Zusammenhang zwischen der <strong class=\"redactor-inline-converted\">Phasenverschiebung</strong> im Linien- und Zeigerdiagramm. Die Untersuchung von <strong class=\"redactor-inline-converted\">Schein-, Wirk und Blindleistung</strong> und der Zusammenhang zum <strong class=\"redactor-inline-converted\">Leistungsfaktor</strong> runden diesen ersten theoretischen Teil ab.\n\n  </p>\n\n<p>Anschließend werden wir in diesem Kurs <strong class=\"redactor-inline-converted\">konkrete Beispielschaltungen</strong> simulieren. Anhand der Simulationsergebnisse wirst Du den Zusammenhang zwischen Wechselstrom und Zeigerdiagrammen verstehen und <strong class=\"redactor-inline-converted\">eigene Simulationen durchführen</strong> können. \n\n  </p>\n\n<p>Hierzu stehen Dir die verwendeten Simulationstools für eigene Experimente zur Verfügung.\n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">Zahlreiche Übungsaufgaben</strong>\n\n  </p>\n\n<p>Aufbauend auf den erarbeiteten theoretischen Grundlagen wirst Du anhand von <strong class=\"redactor-inline-converted\">Übungsaufgaben mit ausführlichen Lösungsvideos</strong> die vermittelten Inhalte vertiefen und üben.\n\n  </p>\n\n<p>Du lernst hier <strong>konkrete, in der Praxis und Prüfungen häufig vorkommende Aufgabenstellungen</strong>, wie beispielsweise die Blindleistungskompensation eines Wechselstrommotors, zu lösen.\n\n  </p>\n\n<p>Mit Hilfe der Übungsaufgaben stellst Du sicher, dass das Thema Wechselstrom und Zeigerdiagramme wirklich „sitzt“.\n\n  </p>\n\n<p>Am Ende des Kurses wirst Du den Zusammenhang von Wechselstrom und Zeigerdiagrammen verstanden haben und zur Berechnung von typischen Wechselstromschaltungen anwenden können.</p>", 
    "end_date": null, 
    "title": "Wechselstrom und Zeigerdiagramme", 
    "price": "50.00", 
    "instructors": "Wolfgang Bengfort", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/847918_3442.jpg", 
    "course_url": "https://www.udemy.com/wechselstrom-und-zeigerdiagramme/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T10:03:35Z"
}