{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Are you struggling with some of the \"new\" approaches being taught now to math students? Are you a parent, or a teacher who struggles with teaching math, or an interested adult who wants to understand more about why these new approaches are being used?<br></p>\n\n<p>This course addresses many of the foundational areas of math in the early elementary grades, from the concept of equivalence to using the distributive property in multiplying larger numbers. If you aren't sure what the point of some of the strategies are, or your child says, \"That's not how my teacher said to do it,\" or why certain strategies are taught when, this course is for you. </p>\n\n\n\n<p>The course, Basic Concepts, covers:</p>\n\n\n\n<ul><li>Number sense and how to help it develop</li><li>The relationships of numbers to each other </li><li>The relationships of mathematical operations to each other</li><li>The concept of equivalence and how it's taught to young children</li><li>Mental addition and subtraction strategies</li><li>Viral Common Core memes, and what we can learn from the math behind them</li><li>Connections between addition and multiplication, and subtraction and division</li><li>Different models for multiplying and dividing</li><li>Mental math tips for multiplying and dividing</li><li>Strategies for making even the hardest word problems easier to solve</li></ul>\n\n\n\n<p>Lessons are delivered in an easy-to-follow video format, with accompanying downloadable documents where they are useful, and for additional practice with the strategies. Answer keys are provided for problem sets too. Periodic quizzes help make sure you are on the right track.</p>\n\n<p>You even get bonus activities to do at home with your children, and useful printed tips for making your own mental math easier!</p>\n\n\n\n<p>This course can be used as a basic introduction for teachers, but it is not meant for in-depth professional development.</p>", 
    "end_date": null, 
    "title": "What Kids Learn in Math Class that You Never Learned: Basics", 
    "price": "40.00", 
    "instructors": "Susan Midlarsky", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/719852_158c_2.jpg", 
    "course_url": "https://www.udemy.com/kids-learn-basic/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-07T18:32:23Z"
}