{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>As the slogan makes you want to believe “milk it does your body good…” with the thought the calcium in the milk is what makes bones strong and keeps bones healthy, especially when combined with vitamin D.  Along with this dietary concept, we have been classically taught that there are two types of bone cells that based on our diet will influence the overall health and strength of the bones of body.  But how true are these concepts?  What actually makes bones function and stay “strong” throughout one’s life?  Bone is a tissue that is highly metabolic with a variety of cellular activities and regulatory mechanisms.  Activities and regulation of cells that function to ensure that our bones are capable of withstanding the stresses that we place upon them in our everyday activities.  This lesson will allow us to explore these issues through the concept of bone physiology and the principle of bone remodeling based on the concept of Wolff’s Laws.  In which we will delve into what is meant by cells being “Blastic” or “Clastic” and how these activities lead to changes in the bone’s density (usually called “bone mineral density).  And how all of this will impact the ability of the bone to resist stresses placed on it so it will not fracture. Lastly, we will delve into the concept of losing bone mineral density and the what constitutes the disease osteoporosis.<br></p>", 
    "end_date": null, 
    "title": "What makes healthy bones?", 
    "price": "20.00", 
    "instructors": "Professor James Clark", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/861922_426b.jpg", 
    "course_url": "https://www.udemy.com/what-makes-healthy-bones/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-28T02:06:08Z"
}