{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t                                  Confused from word problems ? don't know where to start solving ? in this course we'll learn how to handle these and much more.  </p>\n\n<p>  \t<strong>What is this course about ?</strong>  </p>\n\n<p>  \t                        We will learn an approach toward solving word problems. This approach is based on a <strong>systematic</strong> process to follow when facing word problems.  </p>\n\n<p>  \t<strong>Why take this course ?</strong>  </p>\n\n<p>  \t                        After this course you will:  </p>\n\n<ul>  \t<li>Become more confident Student.</li>  \t<li>Have much more better success in exams and assignments.</li>  \t<li>Have better mathematical understanding.</li>  \t<li>Be able to reason, communicate ideas, make connections, and apply your knowledge and skills.</li>  \t<li>Be able to asses your understanding of concepts and your ability to apply them.</li>  \t<li>Find more enjoyment in Science and Math.</li>  \t<li>Significantly increase your critical thinking skills. </li>  </ul>\n\n<p>  \t<strong>Course Material</strong>  </p>\n\n<p>  \t                      All the lessons are presented in a clear language using animated video slideshows.  </p>\n\n<p>  \t<strong>Audience</strong>  </p>\n\n<ul>  \t<li>Students</li>  </ul>\n\n<p>  \t                    Students who make the effort required to learn this course will become much more confident in math, physics and other science areas and more motivated to workout word problems.  </p>\n\n<p>  \t                    Students are encouraged to actively pursue opportunities to apply their new problem-solving skills outside this course to extend and enrich their understanding of mathematics.  </p>\n\n<ul>  \t<li>Parents</li>  </ul>\n\n<p>  \t                Parents have an important role to play in supporting student learning. By becoming familiar with the curriculum of this course, parent can find out ways to discuss their children's work with them and improve their learning. In addition to supporting regular course study, parents can encourage their sons and daughters to apply their problem solving skills to other disciplines or to real world situations.  </p>\n\n<ul>  \t<li>Teachers</li>  </ul>\n\n<p>  \t            Recognizing that students need a solid conceptual foundation in problem solving in order to further develop and apply their knowledge effectively, teachers can use this course to develop appropriate methods for assessing and evaluating students problem solving skills. They can also support students in developing these skills needed for success in their mathematics and science courses.  </p>", 
    "end_date": null, 
    "title": "Word Problem Solving", 
    "price": "20.00", 
    "instructors": "Eduactivity Courses Online", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299534_c45f_3.jpg", 
    "course_url": "https://www.udemy.com/word-problem-solving/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T08:16:53Z"
}