{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This is a course designed for students enrolled in a high school or college Algebra course who have difficulty with algebraic word problems and want to gain further skills and strategies in how to solve them.  As I want to keep the focus on problem solving, I will not cover equation solving from scratch, i.e. assume the student has algebra skills such as equation solving, ability to use distributive property, etc.  </p><p>The structure of the course is an introduction, followed by a tutorial in translating word problems to mathematical equations.  Each lesson from that point covers a specific type of word problem, and the course finishes up with a wrap-up section including more advanced word problems.</p><p>Why take this course?  I made this course because as a math teacher I have seen many good students hit roadblocks when it comes to solving word problems.  I believe it doesn't have to be this way!  I believe they can be easy, and even fun (ok maybe the fun part is just the math geek in me, but I do believe it).  </p><p>The course will take as little or as much time to complete as you need :).  The idea is it's there to supplement the traditional Algebra course, not to teach Algebra from scratch, so go at your own pace.  If you feel you're good with money-based problems but need a lot of help in motion (rate-time-distance), feel free to skip ahead.  Lessons do not depend on previous topics, so they can be viewed in any order, independently or together.</p>", 
    "end_date": null, 
    "title": "Word Problems Made Easy!", 
    "price": "35.00", 
    "instructors": "David Britz", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408324_ba3e_3.jpg", 
    "course_url": "https://www.udemy.com/wordproblems/", 
    "currency": "USD", 
    "subject_name": [
        "Math & Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-30T19:19:51Z"
}