{"selfpaced": false, "topic_name": ["Sociology"], "description": "\n\n                    \n                    \n                    Philosophy is like sex: sure you can get some interesting results, but that's not why we do it. Going one step beyond…why do you FEEL pain or pleasure? Do plants have emotions? How is possible that some people do not understand other’s emotions? Emotions seem to be everywhere, giving meaning to all events of our lives. They are the backbone of social activities as well as they drive the cognitive processes of several living entities. Several animals, including humans, have emotions but…what about machines?...Do machine can have emotions?\nThis course will help you to understand and to identify most important philosophical ideas and debates about emotions, as well as it will provide you a rich source of data about neurological, psychological or anthropological analysis of emotions. \nIn a nutshell: this is a course to feel and think about.\n\n                                            Syllabus\n                        Welcome!Welcome to this amazing course on the nature of emotions. You’ll see that emotions are everywhere. They are the true meaning of our lives and guide us all throughout our daily actions. There is a lot to discuss, to think about, to discover about them! Six weeks for a Course, one Course for new Knowledge!Where do emotions come from?At the very beginning of this course we will look at the basic definitions and concepts related to the emotional events. At the same time we will introduce basic philosophical ideas in order to make possible the understanding of the nature of emotional values.How many emotions do exist?After the clarification about the different aspects we can find in emotional analysis, we will look at the number and type of different emotions. There are several theories about their number, and all of them also contain a way to understand how emotions emerged and evolved. The debate will be fun!What does a plant feel?Not only humans do have emotions. Other mammals have also them. And even insects. But do plants have emotions? Even bacteria, a so small entity, have also these emotional mechanisms. An evolutionary reconstruction will understand to understand how emotions are spread among living entities.A neuroanthropological approach to emotions: from neurons to societiesEmotions regulate several key aspects of our life. But they are fundamental for social cohesion. Cooperation or altruism are fundamental aspects of human socialization that must be understood from an emotional perspective. Neurons will show the path to the creation of societies.The philosophies on emotionsThere are plenty of historical debates on the nature and role of emotions into philosophical spaces. Usually, this approach is made studying at Western thinkers, but we will also include Eastern ones. Therefore, we will analyse how most important philosophical traditions have understood and explain the role of emotions. [Spoiler: they always said they were BAD!].21st Century &amp; emotions:  affective computing and sociable robotsAt the end of this course we will look on how emotions are displayed into new technological frameworks: social networks, mass media,…but we will think about how emotions are implemented into robots or computers. A new technological era come to us, with the same necessities of all previous ones: emotional. Machines will be emotional, if we want they be really smart, autonomous, and efficient.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Emotions: a Philosophical Introduction", "price": 0, "instructors": "Jordi Vallverdú", "institution_name": ["Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"], "commitment": "3-5 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/emotions", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}