{"selfpaced": false, "topic_name": ["Sociology"], "description": "\n\n                    \n                    \n                    In this course, we’ll explore what it means to work collaboratively in building a more sustainable and equitable society for all people. Students in this course will learn to acknowledge their context, privileges and disadvantages, and the different ways they have of knowing the world. In this course, learning and teaching will be generative, fluid processes. Much of the hard work of this course will be outside the classroom: reading, thinking, organizing and providing situated context for our ideas so our class colleagues can come to a fuller, richer understanding of our own shared and individual experiences. The students and instructor will come together to discover and explore the ideas shaped by the readings, and build emergent systems that provide deeper understanding of our own boundaries and possibilities.\n\n                                            Syllabus\n                        Session 1: Welcome Course Introduction\r\nSession 2: Gender Studies/ Feminist Studies 101 Jump into readings and wiki editing workshop.\r\nSession 3: The Histories Of Sexuality, Gender, And Identity Read \"A Cyborg Manifesto: Science, Technology, and Socialist- Feminism in the Late Twentieth Century,\" in Simians, Cyborgs and Women, \"Split Subjects, Not Atoms; or, How I Fell in Love with My Prosthesis.\" The Cyborg Handbook, and \"Tinysex and Gender Trouble.\" Sex/Machine: Readings in Culture, Gender and Technology.\r\nSession 4: Technology And Vision Read \"Digitizing race: Visual cultures of the Internet\", and \"Entering the picture: Judy Chicago, the Fresno Feminist Art Program and the collective visions of women artists\".\r\nSession 5: Technology, Gender, And Desire Read works from Judith Halberstam, Adranne Wadewitz, and Amy Adele Hasinoff. Introduction of WikiStorming Assignment.\r\nSession 6: Technology, Whiteness And Racialization – Part I Read works from L. Nakamura, Vernadette V Gonzalez, and Robyn Magalit. We will also be looking at \"Black Girls Code\" and continuing work on the WikiStorming assignment.\r\nSession 7: Technology &amp; Privacy Look at readings; “Spectatorship, Power and Knowledge”, \"Facegen and the Technovisual Politics of Embodied Surfaces.\",“Face to Anti-Face - Op-Art”, and \"Camouflage From Face Detection”. Start work on Feminist Mapping Project.\r\nSession 8: The Body In The World Read works by Anne Fausto-Sterlng, Susan Best, Elizabeth Grosz, and Elizabeth Wilson. Continue work with collecting data for Feminist Mapping assignment.\r\nSession 9: Technology, Representation And The Female Body Read \"The Myth of the Vaginal Orgasm\", \"Castration and Medusa: Orlan's Art on the Cutting Edge\", \"Serene and Happy and Distant: An Interview with Orlan\", and \"Anger, Art and Medicine: Working with Orlan\". Continue work on Feminist Mapping project with tools and best practices.\r\nSession 10: Activism: Social Justice &amp; Social Media Read ‘Our Demand Is Simple: Stop Killing Us’: How a group of black social media activists built the nation’s first 21st-century civil rights movement, and “Equal Rights Takes to the Barricades - NYTimes.com”. View “Egypt: The viral vlog of Asmaa Mahfouz that helped spark an uprising – Boing Megan Winget, PhD 5 Boing”. Continue Feminist Mapping project with spiffifying the data.\r\nSession 11: Activism: Technology, Masculinity And Militarism Read \"Video Games and Machine Dreams of Domination\", \"Breakdown in the Gray Room: Recent Turns in the Image War\", and Columbia University Report on US Drone Strikes. Continue with Feminist Mapping assignment focusing on tools; Google Maps, HyperCities and StoryMaps.\r\nSession 12: Gendering Climate Change, Engendering Responsibility Read selected works from Margaret Atwood and L. Weintraub. Watch \"Chasing Ice\". Continue with Feminist Mapping and mapping tools.\n                                    ", "end_date": "9999-12-31T23:59:59Z", "title": "Gender, Feminism, Art and Technology", "price": 0, "instructors": "", "institution_name": ["The University of Texas at Austin"], "commitment": "", "subject_name": ["Social Sciences"], "course_url": "https://www.kadenze.com/courses/gender-feminism-art-and-technology/info", "duration": null, "language_name": ["English"], "provider_name": ["Kadenze"], "start_date": "2016-11-27T00:00:00Z"}