{"selfpaced": false, "topic_name": ["Sociology"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Social Sciences\n                                                                                                    &gt; Sociology\n                                                            \n                            \n                                                \n                    \n                    \n                    Everywhere, every day, everybody uses language. There is no human society, no matter how small or how isolated, which does not employ a language that is rich and diverse. This course introduces you to linguistics, featuring interviews with well-known linguists and with speakers of many different languages. Join us to explore the miracles of human language!\n\nThe Miracles of Human Language introduces you to the many-faceted study of languages, which has amazed humans since the beginning of history. Together with speakers of many other languages around the world, as well as with famous linguists such as Noam Chomsky and Adele Goldberg, you will learn to understand and analyse how your native tongue is at the same time similar and different from many other languages. You will learn the basic concepts of linguistics, get to know some of the key features of big and small languages and get insight into what linguists do.\n\nThis course gives an introduction into the study of languages, the field of linguistics. With the support of the basic linguistic terminology that is offered in the course, you will soon be able to comment both on variety between languages, as well as on a single language’s internal structure. Anyone who wishes to understand how languages work, and how they can give us insight into the human mind is very welcome to join.\n\nThe course is useful if you want to get a fairly quick introduction into linguistics, for instance because you are considering studying it further, or because you are interested in a neighbouring discipline such as psychology, computer science or anthropology. Furthermore, the course will help you develop analytical skills.\n\nIf you are curious to understand how language works and how it gives insight into the human mind, this course is definitely for you!\n\n                                            Syllabus\n                        Introduction to LinguisticsIn this first week, we will try to determine what makes language human: why do (almost) all human beings have a language, and what makes human language different from animal communication systems? We will furthermore discuss the many different places where linguists work, and the many different methodologies that they use for conducting their research. You will moreover get to know all the other participants in this MOOC: my students Inge and Marten, as well as the speakers of six different languages. Finally, don't forget to watch our first expert interview: Marten and Inge have talked with Dr. Victoria Nyst of Leiden University, who has enlightened us in the fascinating world of sign languages! For the assignments with the support of Ethnologue, please make sure to study the instructions listed in 'required and optional readings' of this module.The study of sound:  Phonology and PhoneticsIn this module we will delve into what appear to be the smallest building blocks of spoken language: 'sounds'. As we will see however, all is not what it seems, as we will in fact encounter an even smaller building block of language, a true atom. Another interesting thing about this module is that as of this week our 6 informants will all only speak their own language. Naturally, there is also an interview with my very special friend Prof. dr. Claartje Levelt, whom I have announced before.The study of words and sentences: Morphology and SyntaxIn this module we will discuss words and sentences. All languages have them; but as I will illustrate, they can be organized in very different ways in different languages. I will furthermore demonstrate what cupcakes have in common with words in a sentence. This module's interview is with one of the most cited and re-knowned linguists alive, Prof. Noam Chomsky! Finally, our 6 language informants will provide us with information about the word order in their languages.The study of meaning: Pragmatics and SemanticsThis module deals with a topic which many of you find very interesting: meaning. How do we determine what a word means? To what extent does our language influence our thinking? How can we change the world with language? As usual, we also have an additional interview with an expert of the current module's theme: in this module Barend Beekhuizen talks to Inge and Marten about his work as a Leiden PhD student in computational linguistics.Language in the BrainThis module features all of the well-known parts of the current MOOC. Informants tell us about speech errors in their native tongue, I discuss everyday mistakes with my students Marten and Inge, and we have an interview with Prof. Niels Schiller of Leiden University. He discusses with us his own research among others. We moreover go on a little outing, to see linguists in their natural habitat! Furthermore, thanks to our friends at 'Babel, -The Language Magazine' we have some interesting reading for you. For example, linguist Jörg Schwyter tells us all about how he had to deal with aphasia, and how that has influenced him as a multilingual speaker. Language in the SocietyIn the previous modules we have dissected the structure of languages, but now we will study language in its real context: how does language change? How do people use language to be polite? Our informants are demonstrating their acting skills, and furthermore we have an interview with Prof. Adele Goldberg! She presents us with an alternative view of language, compared to the one as previously discussed by Prof. Chomsky in the third module.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Miracles of Human Language: An Introduction to Linguistics", "price": 0, "instructors": "Marc van Oostendorp", "institution_name": ["Leiden University"], "commitment": "4-6 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/human-language", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}