{"selfpaced": false, "topic_name": ["Sociology"], "description": "\n\n                    \n                    \n                    Sociology examines individuals in their social contexts and provides insights into factors such as class, gender and age shape societies at the individual and institutional levels. This introductory course introduces you to key concepts and theories used in examination of and for understanding social action, social institutions, social structure and social change. This course seeks to introduce you to some of sociology’s central concepts, that describe and analyse critically the social forces shaping human behavior and attitude in contemporary social life. This includes examining the ways in which the social, economic and cultural creation of social groups influence their local, national and global environment. This course provides a systematic and critical understanding of the essential components in the structure of society, and examines the main conflicting social processes that create social instability and promote social change.\r\nWhat will I learn?\r\n\r\nWhat is the sociological imagination\r\nHow to connect your biography with society\r\nWhat is social inequality\r\nHow inequality impacts on both the individual and the society\r\nThe institutions of our society and how they impact the individual\r\nThe social changes that are happening around us\r\n\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nPolicy development\r\nAdministration\r\nTeaching\r\nPublic service\r\nHuman resources\r\nSales and marketing\r\nSocial research\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: THE SOCIOLOGICAL IMAGINATION\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: INEQUALITY IN THE 21ST CENTURY: LOCAL AND GLOBAL STRATIFICATION\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: SOCIAL STRUCTURES\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: FROM THE CONCRETE TO THE ELASTIC\r\n\r\n\r\n\r\n\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Sociology", "price": 0, "instructors": "Dr Alphia Possamai-Inesedy", "institution_name": ["University of Western Sydney"], "commitment": "", "subject_name": ["Social Sciences"], "course_url": "https://www.open2study.com//node/1757", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Open2Study"], "start_date": "2016-01-11T00:00:00Z"}