{"selfpaced": false, "topic_name": ["Sociology"], "description": "\n\n                    \n                    \n                    The National Consortium for the Study of Terrorism and Responses to Terrorism (START), a Department of Homeland Security Center of Excellence housed at the University of Maryland, offers a course looking at the who, what and how of Terrorism Studies, by introducing students to cutting-edge research from the social and behavioral sciences and the experts investigating these topics.  \n\nThe course will begin with a unit looking at widely held myths about terrorism and utilizing empirical data to discuss the realities of broad trends and patterns in terrorist attacks over time. The course will then review the psychological factors at play in individual radicalization and recruitment into terrorism, followed by an analysis of terrorist group dynamics. The course will next look at terrorist group operations, including their attacks and some of the supporting behaviors that allow them to carry out attacks, including use of media, financing, recruitment, and training. The course will conclude by looking at the factors that drive terrorist group persistence or endurance versus terrorist group desistance, and will bring the varied course concepts together through a detailed look at the case of Al-Qa’ida.  \n\nThroughout the course, students will have the opportunity to study and work with the University of Maryland’s Global Terrorism Database (GTD), the largest database of terrorist incidents in the world, learning its capabilities and developing basic skills in searching and displaying terrorism data.\n\n                                            Syllabus\n                        IntroductionAfter the completion of this module, you will be able to: 1) Comfortably navigate course pages; 2) Understand the course structure and requirements; 3) Post on the discussion forums.Module 1: How Do We Study Terrorism?At the completion of this module, you will be able to: 1) Explain the necessity for an interdisciplinary approach to studying terrorism; 3) Describe the most commonly held myths about terrorism; 2) Describe challenges and definitional issues related to the empirical study of terrorism; and 4) Describe geographic trends in terrorism from 1970-2012. Module 2: Individual RadicalizationAt the completion of this module, you will be able to: 1) Define radicalization;Understand and discuss the importance that ideology plays in the radicalization process; 2) List key components of extremist ideologies and examples; 3) Understand the Profiles of Individuals Radicalized in the United States (PIRUS) dataset and what we can learn from it; and 5) Understand the theory of the \"Quest for Significance\" as it relates to the radicalization process.Module 3: Terrorist Group DynamicsAt the completion of this module, you will be able to: 1) Identify terrorist group structures; 2) Understand the operational security and operational capacity trade-off for four levels of terrorist organizations: lone-actor, cellular, networked, and hierarchical; 3) Understand how leaders operate in various types of organizational structures, and how that translates to performance (i.e. innovation &amp; destructiveness); and 4) Understand and explain the connection between terrorist group connectivity and lethality. Module 4: Terrorist OperationsAt the completion of this module, you will be able to: 1) Describe and explain seven major terrorist strategies;    2) Explain how terrorist group effectiveness can be understood in three levels of analysis: tactical, organizational, and strategic; 3) Describe trends in terrorist tactics using Global Terrorism Database data;    Describe trends in terrorist targets using Global Terrorism Database data; 4) Describe trends in weapon use by terrorists using Global Terrorism Database data; 5) Describe secondary enabling factors and behaviors that allow terrorist groups to carry out their attacks; and 6) Describe terrorist use of media for recruitment using the example of \"Inspire\" magazine. Module 5: Al-Qa'ida Case StudyAt the completion of this module, you will be able to: 1) Understand and describe the evolution of global jihadism and al-Qa'ida's place in it; 2) Understand and describe the theological context of al-Qa'ida; 3) Describe al-Qa'ida's political landscape; 4) Describe the virtual architecture established by al-Qa'ida; 5) Describe the historical narrative al-Qa'ida uses to create and espouse its identity;Analyze the al-Qa’ida example within the larger context of the course; and 6) Understand and describe trends and patterns in terrorism in recent years.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Understanding Terrorism and the Terrorist Threat", "price": 0, "instructors": "Gary  LaFree and Bill Braniff", "institution_name": ["University of Maryland, College Park"], "commitment": "4-6 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/understandingterror", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}