{"selfpaced": true, "topic_name": ["Business Analytics and Intelligence"], "description": "\n\n                    \n                    \n                    The Classification Models course provides students with the foundational knowledge to use classification models to create business insights. You will learn:\r\n\r\nHow classification modeling differs from modeling with numeric data\r\nTo use binary classification models to make predictions of binary outcomes\r\nTo use non-binary classification models to make predictions of non-binary outcomes  Throughout this course you’ll also learn the techniques to apply your knowledge in a data analytics program called Alteryx. At the end of the course, you’ll complete a project based on the principles in the course.  This course is part of the Business Analyst Nanodegree.Why Take This Course?Predictive analytics has proved to be a powerful tool to help businesses analyze data and predict future outcomes and trends. In this course, you’ll learn how to use classification predictive models to solve business problems such as predicting whether or not a customer will respond to a marketing campaign, the likelihood of default on a loan, or which product a customer will buy. You'll learn this through improving your fluency in Alteryx, a data analytics tool that enables you prepare, blend, and analyze data quickly. This course is ideal for anyone who is interested in pursuing a career in business analysis, but lacks programming experience.\r\n\n\n                                            Syllabus\n                        Lesson 1 - Introduction to Classification Modeling In this lesson you’ll learn the key terminology used in predictive modeling, such as the difference between target and predictor variables. You’ll learn key things to consider when choosing variables to use in a model. You’ll also have some practice in preparing a dataset for modeling.  Lesson 2 - Binary Classification Models In this lesson you’ll learn how to use binary classification models to predict categorical data with two potential results. You’ll learn how to use logistic regression, stepwise logistic regression, and decision tree models; how to compare the models; and how to interpret the results.  Lesson 3 - Non-Binary Classification Models In this lesson you’ll learn how to use non-binary classification models to predict categorical data with more than two potential results. You’ll learn how to use decision tree, forest, and boosted models; how to compare the models; and how to interpret the results.\n                                    ", "end_date": null, "title": "Classification Models", "price": 0, "instructors": "", "institution_name": [], "commitment": "6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.udacity.com/course/classification-models--ud978?utm_medium=referral&utm_campaign=api", "duration": null, "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2016-06-07T00:00:00Z"}