{"selfpaced": false, "topic_name": ["Business Analytics and Intelligence"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Business &amp; Management\n                                                                                                    &gt; Business Analytics and Intelligence\n                                                            \n                            \n                                                \n                    \n                    \n                    This course provides an analytical framework to help you evaluate key problems in a structured fashion and will equip you with tools to better manage the uncertainties that pervade and complicate business processes. Specifically, you will be introduced to statistics and how to summarize data and learn concepts of frequency, normal distribution, statistical studies, sampling, and confidence intervals.\n\nWhile you will be introduced to some of the science of what is being taught, the focus will be on applying the methodologies. This will be accomplished through the use of Excel and data sets from many different disciplines, allowing you to see the use of statistics in very diverse settings. The course will focus not only on explaining these concepts, but also understanding the meaning of the results obtained.\n\nUpon successful completion of this course, you will be able to:\n\n•\tSummarize large data sets in graphical, tabular, and numerical forms.\n•\tUnderstand the significance of proper sampling and why you can rely on sample information.\n•\tUnderstand why normal distribution can be used in so many settings.\n•\tUse sample information to infer about the population with a certain level of confidence about the accuracy of the estimations.\n•\tUse Excel for statistical analysis.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\n                                            Syllabus\n                        Course OrientationYou will become familiar with the course, your classmates, and our learning environment. The orientation will also help you obtain the technical skills required for the course.Module 1: Introduction and Summarizing DataData is all around you, but what is the data telling you? The first step in making better decisions and taking action is to get a good understanding of information you have gathered. In this module we will learn about some of the tools in statistics that help us achieve this.Module 2: Descriptive Statistics and Probability DistributionsWe all have heard the phrase that a \"picture is worth a thousand words,\" but you certainly don’t want one of those to be \"what exactly am I looking at?\" So, now that you know to use \"pictures\" to summarize your data, let’s make those pictures easier to understand.Module 3: Sampling and Central Limit TheoremYou are charged with analyzing a market segment for your company. You and your team have figured out what variables you need to understand; you also have an idea what factors might be influencing these variables of interest. Now you are ready to do your analysis. But, wait! Where is the data? How do you begin to get the data? In this module we will review the means by which you can begin to produce data – the concepts of sampling and Central Limit Theorem – and will help you understand how to produce \"good\" sample data and why sample data will work.Module 4: InferenceYou have sample data and have done the analysis – you think you can say something about the population based on your sample study.  But, do you have a sense of what are the chances of you being right or wrong?  How can you be surer? What else should you have considered? In this module, you will learn how to find the answers to these questions.\n                                    ", "end_date": "2016-06-29T00:00:00Z", "title": "Exploring and Producing Data for Business Decision Making", "price": 0, "instructors": "Fataneh Taghaboni-Dutta", "institution_name": ["University of Illinois at Urbana-Champaign"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/business-data", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-01T00:00:00Z"}