{"selfpaced": false, "topic_name": ["Business Analytics and Intelligence"], "description": "\n\n                    \n                    \n                    This course will give you some beginning ideas on how to understand and negotiate business in Asia. The emphasis is on the social and cultural aspects of business, such as leadership, management and personal relationships. We focus on China, Japan, Korea and some countries in South East Asia including Indonesia, Malaysia, Singapore, the Philippines, Thailand and Vietnam.\r\nAfter completing this course, you should have some understanding of how to work with business managers in Asia, how to build business relationships in Asia, and how to understand and approach cultural differences that you may encounter.\r\nWhat will I learn?\r\n\r\nThe social aspects of business in Asia\r\nFrameworks for analysing cultural issues relevant to business in Asia\r\nThe values relevant to business in Asia\r\nSome historical points relevant to doing business in China\r\n\r\nThis course requires approximately 2 - 4 hours of study per week, but can vary depending on the student. This includes watching videos, and taking quizzes and assessments.\r\nIf you pass this course you'll receive a Certificate of Achievement. While this certificate isn't a formal qualification or credit, you can use it to demonstrate your interest in learning about this area to potential employers or educational institutions.\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nBusiness management\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: ASIAN LEADERSHIP AND MANAGEMENT STYLES\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: CULTURE AND BUSINESS IN ASIA\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: PERSONAL RELATIONSHIPS AND BUSINESS IN ASIA\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: BUSINESS IN CHIN\r\n\r\n\r\n\r\n\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Introduction to Business in Asia", "price": 0, "instructors": "Dr. Peter Woods", "institution_name": ["Griffith University"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.open2study.com//node/1773", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Open2Study"], "start_date": "2016-01-11T00:00:00Z"}