{
    "selfpaced": false, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    New: It is our pleasure to announce that English subtitles and English-translated Powerpoint slides will be made available with this new session of the MOOC\r\nSurveiller les maladies, mener les enquêtes en population pour identifier leurs causes (comportements, expositions environnementales, facteurs génétiques) : c’est le rôle de l’épidémiologie dont ce cours vous enseigne les principes et méthodes.\r\nMonitoring diseases and carrying out population-based surveys to identify their causes (behaviours, environmental exposure, and genetic factors): such is the role of epidemiology, the principles and methods of which you will learn during this course.\r\nCe cours débute par une présentation des grands principes de l’épidémiologie descriptive (surveillance des maladies, investigation d’épidémies) et de l’épidémiologie analytique (identification des facteurs de risque des maladies). Les principaux indicateurs de risque, la formulation d’une hypothèse scientifique, les schémas d’étude utilisés pour les enquêtes en population, la prise en compte des fluctuations d’échantillonnage, l’analyse statistique des résultats et l’interprétation des biais seront expliqués et illustrés par des exemples et des études de cas tirés de la vie réelle.\r\nThe course begins with a presentation of the key principles of descriptive epidemiology (monitoring of diseases, investigation of epidemics) and analytical epidemiology (identification of disease risk factors). Principal risk indicators, the formulation of a scientific hypothesis, the study schemes used in population-based surveys, taking sampling fluctuations into account, the statistical analysis of results and the interpretation of bias: all of these will be explained and illustrated by examples and case studies drawn from the real world.\r\nSeront également abordés les grands principes de causalité et les niveaux de preuve demandés aujourd’hui pour dire qu’une « exposition » est responsable d’une maladie.\r\nThe course will also address the main principles of causality and the levels of proof required today to be able to say that a given “exposure” is responsible for a disease.\r\nAu terme de ce MOOC, les étudiants auront les clefs pour interpréter les articles scientifiques traitant de ces sujets, et seront préparés pour suivre des enseignements spécialisés en épidémiologie et en santé publique.\r\nAt the end of this MOOC, the students will have the keys to interpret scientific articles dealing with these subjects, and will be prepared to pursue specialised teaching in epidemiology and public health.\r\nFormat : 5 vidéos de 10-15 minutes par semaine, pendant 6 semaines (sauf la dernière semaine où la dernière vidéo est remplacée par l’examen final, soit 29 vidéos au total).\r\nFormat: 5 videos of 10-15 minutes every week for six weeks (except for the last week, where the last video will be replaced by a final exam, making 29 videos in total).\r\nEvaluation : les étudiants pourront tester régulièrement leurs connaissances via :\r\n \r\n\r\ndes QCM proposés en fin de session (2 par session ; cinq minutes de travail personnel)\r\ndes QCM et questions ouvertes en relation avec des articles scientifiques à analyser (trois au total sur la période ; compter deux heures de travail par analyse d’articles). Le corrigé des QCM se fera par voie électronique et celui des questions ouvertes par une vidéo de l’enseignant.\r\n\r\n \r\nL’évaluation finale, seule retenue pour l’obtention de l’attestation de réussite au cours, sera faite par QCM le dernier jour.\r\nEvaluation: the students will be able to test their knowledge regularly via: \r\n\r\nMCQs offered at the end of the session (two per session; 5 minutes of personal work) \r\nMCQs and open questions relating to the scientific articles to be analysed (three in total over the course: allow two hours’ work for each article analysis ). The MCQs will be corrected electronically and the open questions will be explained with a teaching video. \r\n\r\nThe final assessment, the only way to obtain a course completion certificate, will be in the form of MCQs on the final day. \r\n \n\n                                            Syllabus\n                        Semaine 1 : Introduction / Week 1: Introduction\r\n \r\n\r\nContexte et définitions / Context and definitions\r\nHistoire de l’épidémiologie / History of epidemiology\r\nEpidémiologie descriptive / Descriptive epidemiology\r\nEpidémiologie analytique / Analytical epidemiology\r\nNiveau de preuve et causalité / Level of proof and causality\r\n\r\n \r\n \r\nSemaine 2 : Indicateurs / Week 2: Indicators\r\n \r\n\r\nPrévalence et incidence / Prevalence and incidence\r\nTaux de morbidité / mortalité / Morbidity/mortality rate\r\nStandardisation des taux / Standardisation of rates\r\nRisque relatif – cohorte / Relative risk – cohort\r\nRisque relatif – études cas-témoins / Relative risk – case-control studies\r\n\r\n \r\nDistribution de l’article sur la surveillance du mélanome en France\r\nDistribution of an article on melanoma monitoring in France\r\nSemaine 3 : Surveillance / études cas-témoins / Week 3: Monitoring/case-control studies \r\n \r\n\r\nSurveillance des maladies / Monitoring of disease\r\nTest d’hypothèse – valeur P – intervalle de confiance / Hypothesis test – value P – confidence interval \r\nEtudes cas-témoins : design / Case-control studies: design\r\nEtudes cas-témoins : analyse / Case-control studies: analysis\r\nCorrection de l’article sur la surveillance du mélanome en France / Correction of the article on melanoma monitoring in France \r\n\r\n \r\nDistribution de l’article sur l’étude cas-témoins sur les hépatites aiguës C en Egypte\r\nDistribution of an article about case-control studies on acute hepatitis C in Egypt\r\nSemaine 4 : Etudes de cohorte / Week 4: Cohort studies\r\n \r\n\r\nEtudes de cohorte – design / Cohort studies – design\r\nEtudes de cohorte – analyse / Cohort studies – analysis\r\nBiais de confusion – diagnostic / Confounding factors – diagnostic\r\nBiais de confusion – analyse / Confounding factors – analysis\r\nCorrection de l’article sur l’étude cas-témoins sur les hépatites aiguës C en Egypte / Correction of the article on case-control studies of acute hepatitis C in Egypt\r\n\r\n \r\nDistribution de l’article sur la cohorte étudiant la relation fruits oléagineux et infarctus.\r\nDistribution of an article on the cohort studying the relation between oleaginous fruits and heart attacks\r\nSemaine 5 : Essais randomisés / dépistage / Week 5: Randomised trials/screening \r\n \r\n\r\nEssais randomisés / Randomised trials\r\nCalcul de la taille d’échantillon / Calculation of the sample size\r\nSensibilité / spécificité / valeurs prédictives d’un test / Sensitivity/specificity/predictive values of a test\r\nDépistage des maladies / Screening for diseases\r\n\r\n \r\nCorrection de l’article sur la cohorte étudiant la relation fruits oléagineux et infarctus\r\nCorrection of the article on the cohort studying the relation between oleaginous fruits and heart attacks\r\nSemaine 6 : Divers / Week 6: Miscellaneous\r\n \r\n\r\nBiais de classement / Selection bias\r\nEnquêtes et sondages / Surveys and polls\r\nAppariement / Matching\r\nFractions attribuables / Attributable fractions\r\n\r\n \r\nExamen / Exam\n                                    ", 
    "end_date": "2015-02-26T00:00:00Z", 
    "title": "Concepts and methods in Epidemiology", 
    "price": 0, 
    "instructors": "Arnaud Fontanet", 
    "institution_name": [
        "CNAM"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/CNAM/01001S02/Trimestre_1_2015/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-01-15T00:00:00Z"
}