{
    "selfpaced": true, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    Il s’agit d’un MOOC sur la crise internationale sur Ebola partie d’Afrique de l’Ouest en 2014 ; d’une durée de 5 semaines, où interviendront plus de 30 professeurs des universités, chercheurs, responsables politiques, autorités sanitaires nationales et internationales, membres d’ONGs, et autres acteurs d’Europe et d’Afrique sur plus de 60 séquences vidéos. Les thèmes abordés se dérouleront selon une séquence hebdomadaire décrite ci-dessous (section « plan du cours »).\n\nLe virus Ebola qui a été à l’origine de l’épidémie en Afrique de l’Ouest est une souche Zaïre, considérée comme la plus dangereuse. Cependant le spectre des tableaux cliniques rencontrés s’est montré très large : depuis des formes assez bénignes (pour environ 30% des infections), jusqu’à des formes très sévères, presque hors de toute ressources thérapeutiques et fréquemment mortelles en une dizaine de jours en moyenne (environ 30%), en passant par des formes d’une gravité dépendant de l’infrastructure sanitaire responsable de leur prise en charge (c’est-à-dire généralement de bon pronostic en cas de bonne prise en charge diagnostique et thérapeutique). Près de 60% des contaminations en Afrique avaient comme origine les rites funéraires non sécurisés. Les personnels de santé exposés ont également payé un très lourd tribut à l’épidémie. Enfin les conséquences non sanitaires, d’ordre social, politique et économique de l’épidémie ont été considérables, tant localement, que régionalement ou internationalement. Peu de pays ont connu à ce jour d’importants développements de chaînes de contaminations, en dehors de la Guinée, du Libéria et du Sierra Leone, mais la situation au Mali à la fin novembre 2014 était encore source d’incertitude et d’inquiétude. Les modèles mathématiques, s’ils ont été d’un apport précieux dans l’éclairage des politiques publiques, ils ont aussi participé à une amplification exagérée du problème, notamment lorsqu’ils ont livré des prévisions allant au-delà de plusieurs mois, parfois endossées par de grandes agences sanitaires, car elles risquent de se révéler fausses et décrédibilisantes.\n\nNous tenterons de mieux savoir quels espoirs on peut avoir de disposer d’un vaccin prochainement, et nous essaierons de comprendre pourquoi il aura fallu attendre 38 ans, depuis la découverte du virus Ebola, pour que la communauté internationale se décide à chercher et développer un vaccin contre ce type de virus que l’on savait hautement pathogène et contagieux. La réponse internationale a-t-elle été à la hauteur des enjeux ? L’OMS a-t-elle pu mettre en œuvre le Règlement Sanitaire International dans des conditions satisfaisantes ? Quelle a été la place des ONG dans le règlement du problème ? Toutes ces questions feront l’objet, au cours de ce MOOC, de débats et de points de vue interdisciplinaires, parfois contradictoires. De même, l’importance de la communication, le rôle des médias, la perception du risque par la population et par les décideurs eux-mêmes seront analysés. Une large plage sera réservée aux réponses aux questions des participants adressées aux orateurs par le forum de discussion, afin de réfléchir comment vaincre ensemble Ebola.\n\nPUBLIC CIBLE\nCe MOOC est ouvert et gratuit pour tous les publics. Le public cible est principalement le milieu des soignants francophones et les acteurs (publics et privés) des politiques publiques.\n\nPLAN DU COURS\nModule 1: Présentation générale\nModule 2 : Comprendre la maladie\nles aspects cliniques\nles aspects virologiques\nles aspects immunologiques\nles traitements symptomatiques actuels\nl’épidémiologie de la maladie\n\nModule 3 : Ebola comme symptômes d’un désordre social et politique\nles causes sociales économiques et politiques du problème\nla faiblesse du système\nles aspects culturels\nla pauvreté\n\nModule 4 : Les impacts sur nos vies et nos sociétés\nles impacts sanitaires et économiques sur la société et les institutions\nprésentation de modèles mathématiques et prévisions\n\nModule  5 : Les réponses pour l’Afrique et le monde\nles interventions\nla prise en charge des malades\nles principaux obstacles rencontrés\nla réponse internationale\nla perception du risque\nles développements de médicaments et vaccins\nle volet éthique\nla réponse de l'OMS\nla place de la recherche et des médias\n\nModule 6 : Conclusion\n\n_________________________________\nCe cours est co-produit par l'Université de Genève (UNIGE) et l'Université Numérique Francophone des Sciences du Sport et de la Santé (UNF3S).\nIl est proposé en partenariat avec :\nL'Agence Universitaire de la Francophonie (AUF)\nLe Conseil supérieur de la Formation et de la Recherche Stratégique (CSFRS)\nL'Organisation Mondiale de la Santé (OMS)\nMédecins Sans Frontières (MSF)\nSwiss Tropical and Public Health Institute (Swiss TPH)\nFédération Internationale des Sociétés de la Croix-Rouge et du Croissant-Rouge (FISCR)\nCentre Virchow Villermé de santé publique Paris-Berlin\nRadio Télévision Suisse (RTS)\nOffice fédéral de la santé publique (OFSP)\nHôpitaux Universitaires de Genève (HUG)\nInstitut Pasteur\nCampus Biotech\nInfection Control African Network (ICAN)\nThe Graduate Institute Geneva\nMinistère de la Santé et de l'Action Sociale du Sénégal\n\n                                            Syllabus\n                        Présentation généraleComprendre la maladieDes virologues, des épidémiologistes, des vétérinaires, des infectiologues ainsi que des écologues vont vous aider à Comprendre la maladie, c’est parti pour le deuxième module! Veuillez regarder toutes les vidéos du module 2 et suivre les liens suggérés pour chacune d’elles.Après chaque leçon, vous aurez l’occasion de tester vos connaissances grâce à des questions à choix multiple (QCM). Notez que ces questions ne feront pas partie de l’évaluation finale, il s’agit simplement d’une auto-évaluation.Symptômes d'un désordre socio-politiquePendant le module  2, nous avons parlé des symptômes biologiques d’Ebola. Au cours du troisième module, nous allons discuter des Symptômes d’un désordre socio-politique.Veuillez regarder toutes les vidéos du module 3 et suivre les liens suggérés pour chacune d’elles.Après chaque leçon, vous aurez l’occasion de tester vos connaissances grâce à des questions à choix multiple (QCM). Notez que ces questions ne feront pas partie de l’évaluation finale, il s’agit simplement d’une auto-évaluation.ImpactPendant le module 3, nous avons parlé des Symptômes d’un désordre socio-politique. Au cours de la semaine 4, nous allons discuter de l’Impact de cette épidémie à différentes niveaux.Veuillez regarder toutes les vidéos de la semaine 4 et suivre les liens suggérés pour chacune d’elles.Après chaque vidéo, vous aurez l’occasion de tester vos connaissances grâce à des questions à choix multiple (QCM). Notez que ces questions ne feront pas partie de l’évaluation finale, il s’agit simplement d’une auto-évaluation.Bien-sûr n’hésitez pas à poster vos questions et commentaires dans le forum comme beaucoup parmi vous l’ont déjà fait pour lors des modules 1,2 et 3. Réponse de l'Afrique et du MondePendant le module 4, nous avons parlé de l’Impact de cette épidémie. Au cours du module 5, nous allons discuter de la Réponse de l’Afrique et du Monde à cette épidémie.Veuillez regarder toutes les vidéos du module 5 et suivre les liens suggérés pour chacune d’elles.Après chaque vidéo, vous aurez l’occasion de tester vos connaissances grâce à des questions à choix multiple (QCM). Notez que ces questions ne feront pas partie de l’évaluation finale, il s’agit simplement d’une auto-évaluation.Bien-sûr n’hésitez pas à poster vos questions et commentaires dans le forum comme beaucoup de vous l’a déjà fait pour les semaines précédentes. Conclusion\n                                    ", 
    "end_date": "2015-10-13T00:00:00Z", 
    "title": "Ebola : Vaincre ensemble !", 
    "price": 0, 
    "instructors": "Antoine Flahault and Rafael Ruiz De Castaneda", 
    "institution_name": [
        "University of Geneva"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/learn/ebola-vaincre-ensemble", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-09-01T00:00:00Z"
}