{
    "selfpaced": false, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    Il s’agit d’un MOOC sur la crise internationale sur Ebola partie d’Afrique de l’Ouest en 2014 ; d’une durée de 5 semaines, où interviendront plus de 30 professeurs des universités, chercheurs, responsables politiques, autorités sanitaires nationales et internationales, membres d’ONGs, et autres acteurs d’Europe et d’Afrique sur plus de 60 séquences vidéos. Les thèmes abordés se dérouleront selon une séquence hebdomadaire décrite ci-dessous (section « plan du cours »).Le virus Ebola qui a été à l’origine de l’épidémie en Afrique de l’Ouest est une souche Zaïre, considérée comme la plus dangereuse. Cependant le spectre des tableaux cliniques rencontrés s’est montré très large : depuis des formes assez bénignes (pour environ 30% des infections), jusqu’à des formes très sévères, presque hors de toute ressources thérapeutiques et fréquemment mortelles en une dizaine de jours en moyenne (environ 30%), en passant par des formes d’une gravité dépendant de l’infrastructure sanitaire responsable de leur prise en charge (c’est-à-dire généralement de bon pronostic en cas de bonne prise en charge diagnostique et thérapeutique). Près de 60% des contaminations en Afrique avaient comme origine les rites funéraires non sécurisés. Les personnels de santé exposés ont également payé un très lourd tribut à l’épidémie. Enfin les conséquences non sanitaires, d’ordre social, politique et économique de l’épidémie ont été considérables, tant localement, que régionalement ou internationalement. Peu de pays ont connu à ce jour d’importants développements de chaînes de contaminations, en dehors de la Guinée, du Libéria et du Sierra Leone, mais la situation au Mali à la fin novembre 2014 était encore source d’incertitude et d’inquiétude. Les modèles mathématiques, s’ils ont été d’un apport précieux dans l’éclairage des politiques publiques, ils ont aussi participé à une amplification exagérée du problème, notamment lorsqu’ils ont livré des prévisions allant au-delà de plusieurs mois, parfois endossées par de grandes agences sanitaires, car elles risquent de se révéler fausses et décrédibilisantes.Nous tenterons de mieux savoir quels espoirs on peut avoir de disposer d’un vaccin prochainement, et nous essaierons de comprendre pourquoi il aura fallu attendre 38 ans, depuis la découverte du virus Ebola, pour que la communauté internationale se décide à chercher et développer un vaccin contre ce type de virus que l’on savait hautement pathogène et contagieux. La réponse internationale a-t-elle été à la hauteur des enjeux ? L’OMS a-t-elle pu mettre en œuvre le Règlement Sanitaire International dans des conditions satisfaisantes ? Quelle a été la place des ONG dans le règlement du problème ? Toutes ces questions feront l’objet, au cours de ce MOOC, de débats et de points de vue interdisciplinaires, parfois contradictoires. De même, l’importance de la communication, le rôle des médias, la perception du risque par la population et par les décideurs eux-mêmes seront analysés. Une large plage sera réservée aux réponses aux questions des participants adressées aux orateurs par Twitter et/ou par le forum de discussion, afin de réfléchir comment vaincre ensemble Ebola.\n\n                                            Syllabus\n                        Semaine 1: Comprendre la maladieles aspects cliniquesles aspects virologiquesles aspects immunologiquesles traitements symptomatiques actuelsl’épidémiologie de la maladie\r\nSemaine 2 : Ebola comme symptômes d’un désordre social et politiqueles causes sociales économiques et politiques du problèmela faiblesse du systèmeles aspects culturelsla pauvreté\r\nSemaine 3 : Les impacts sur nos vies et nos sociétésles impacts sanitaires et économiques sur la société et les institutionsprésentation de modèles mathématiques et prévisions\r\nSemaine 4 : Les réponses pour l’Afrique et le mondeles interventionsla prise en charge des maladesles principaux obstacles rencontrésla réponse internationalela perception du risqueles développements de médicaments et vaccinsle volet éthiquela réponse de l'OMSla place de la recherche et des médias\r\nSemaine 5 : Enfin sera organisé un colloque en direct, entièrement virtuel, sur la plateforme du MOOC, réservé aux participants inscrits sur FUN, avec la participation d’un panel d’orateurs du MOOC. Cette session de deux heures permettra de réaliser une mise à jour des informations sur la situation épidémique, et sera l’occasion d’une intégration des connaissances dispensées tout au long de ce cours.\n                                    ", 
    "end_date": "2015-02-15T00:00:00Z", 
    "title": "Ebola, vaincre ensemble !", 
    "price": 0, 
    "instructors": "Rafael Ruiz de Castañeda and Antoine Flahault", 
    "institution_name": [
        "University of Geneva"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/unige/57001/Trimestre_1_2015/about", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-01-11T00:00:00Z"
}