{
    "selfpaced": false, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    Around the world, we are increasingly socially and economically interdependent. Health on one side of the globe affects people on the other. Global health, once merely an ethical consideration, now dominates discussions and policies of global security. A diverse team of experts in this emerging field has come together to help you contextualize your experiences as a new or seasoned global health responder. \n\nBy the end of this course, you will be enlightened about the changing world you live in, and have a much better understanding of the machinations on how organizations and governments are striving to improve health worldwide.  You'll also learn how to keep yourself safe and be a savvy participant in the global health arena. You'll be prepared to travel and to take your skills to chronic/emergent situations and help respond to the pressing needs while participating in global health activities throughout the world.\n\nWeek one will serve as an introduction to global health concepts with a look at changing trends in the 21st century; urbanization, environmental stress and resource scarcity. During week two, we will dive into global health security: food, water, energy, and the threats of a changing climate. Week three will cover the global burden of disease, infectious disease, the rise of non-communicable diseases, mental health, and access to care. During week four, we will learn about the stakeholders in global health: NGOs, governments, non-state actors; understanding where the money comes from, how it is allocated and the challenges of measuring results; human rights: what are they and how are they protected? During week five, we move onto complex humanitarian emergencies: forced migrations, wars, response standards, and the legal basis for interventions. Finally, during week six, we will end our course by learning how to be an effective participant--caring for yourself: pre-travel preparation, understanding risks when traveling outside your home country, and physiologic vulnerability.\n\nThis course also serves as a prerequisite to the hands-on 'Global Health Responder' certification from the University of Colorado School of Medicine.  If you're interested in taking this 3-day hands on course-- offered throughout the world-- please go to coloradoWM.org or email our administrator: marisa.burton@ucdenver.edu.\n\n                                            Syllabus\n                        Changing TrendsWe're starting off with two of our heavy hitter faculty. Dr. Skip Burkle will lead-off with a fascinating overview of emerging health threats to our planet in a sweeping narrative of changing conflict, urbanization, loss of biodiversity, and climate change. Dr. Steve Berman will then bring us up to speed on the millennium development goals, and give us an intimate look at how global health activities can be sustainable and responsible. Dr. Jay Lemery will round out the week of changing trends by covering what he thinks is the biggest threat -- climate change, and will first introduce the best available science, and the delve into the health effects. Global Health SecurityLast week we learned about emerging global health threats, millennium development goals, and climate change. This week, we're going to take a closer look at the underpinning of health-- the 'preconditions' if you will, including food, water and shelter. Daniel Silverstein will give a terrific 2-part overview on malnutrition and food security. Dr. Ryan Paterson will likewise explain why it's such a struggle to gain access to clean water, and both lecturers will discuss the challenges for funding agencies to fix these problems. Dr. Burkle will finish off the week discussing population growth and urbanization. Global Burden of DiseaseLast week's lectures focused on the 'preconditions' of health, including food, water, and shelter. This week, we'll get into the substance of the \"health\" in global health. A stellar line up of clinicians will outline their take on disease burden as well as how healthcare systems have succeeded and failed to meet emerging needs. Dr. Renee King will discuss the rise of non-communicable diseases (hypertension, diabetes, obesity) as well as the often stigmatized illnesses of mental health. Finally, Drs. Mould-Millman and Richards will explain how medical systems are responding to meet the global burden of disease. StakeholdersYou've now learned about emerging global health threats, climate change in global health, the 'preconditions' of health, and disease burden. We're over the halfway point, and now it's time to meet the stakeholders-- the players, if you will who shape how global health is financed and how programs are prioritized and executed. Arlan Fuller talks us through the legal and moral constructs that underpin global health activities, and then we'll meet Dr. Satchit Balsari, who will interview Skip Burkle on the legal basis for giving aid-- very much setting the stage for week 5 when we focus on humanitarian crises. Dr. Balsari will finish the week by discussing the established standards in humanitarian activities-- i.e. the guidelines that humanitarian responders are expected to withhold. War &amp; Complex Humanitarian EmergenciesLast week you learned about the stakeholders in global health, and the guidelines for humanitarian responders. This week is disaster week! Whether man-made or natural -- or a combination of both, we look at how the global health community responds to large scale humanitarian crises. Dr. Skip Burkle and Dr. Satchit Balsari will look to recent crises in the middle east and share insights into forced migrations, refugees and internal displacements. Dr. Omeed Saghafi will then interview Dr. Skip Burkle on his take on the recent Fukushima nuclear power plant failure. Being an Effective ParticipantYou've now been educated in the nuances of global health, and it's time to get involved. We've pulled a crack team of travel experts to give you all the tips you need to stay healthy and thriving as a global health responder. Dr. Tracy Cushing is going to open her go-bag backpack and show you the high yield tools that every traveler should consider. Dr. Chris Davis and Dr. Mould-Millman will clarify just what dangers exist and how to protect yourself when leaving your home country, and Dr. Ryan Paterson returns to explain how a warming planet is changing the risk profile for infectious disease. Be sure to tune in for a final wrap-up from Dr. Jay Lemery at the end of the week, when he'll impart some parting thoughts and next steps for you in the world of global health. \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Foundations for Global Health Responders", 
    "price": 0, 
    "instructors": "Jay Lemery", 
    "institution_name": [
        "University of Colorado System"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/learn/ghresponder", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}