{
    "selfpaced": true, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    This is the second of three courses designed by a team of global health experts to help you prepare for successful global health learning experiences and projects.\n\nThe Practitioner’s Guide to Global Health-Part 1: The Big Picture helped you identify and assess global health learning experiences and decide which program is right for you. Part 2 will help you prepare for your departure and rotations, and how to handle on-the-ground situations and assess information. This course provides guidance for undergraduate and graduate students, medical trainees, and volunteers. \n\nIn this course, you’ll start by learning how to prepare and arrange logistics, improving security and cultural awareness and obtaining guidance to limit health hazards. You’ll have the opportunity to create an appropriately inclusive yet “light” packing list.\n\nThe second part of the course will teach you how to identify and manage common situations you may encounter on the ground, including personal and property safety risks, professional, ethical, and cultural issues,and the appropriate use of various modes of communication, including social media. You will have the opportunity to learn through interactive scenarios.\n\nPrior completion of The Practitioner’s Guide to Global Health - Part 1: The Big Picture is required.    \n\n                                    ", 
    "end_date": "2016-12-12T00:00:00Z", 
    "title": "GlobalHealthX.2: The Practitioner’s Guide to Global Health-Part 2: Preparation and On The Ground", 
    "price": 0, 
    "instructors": "Gabrielle A. Jacquet MD, MPH, FACEP, Payal K. Modi MD, MPH, Justin Myers DO, MPH, Rachel A. Umoren MB, BCh, MS, Silpa Gadiraju MD, James Hudspeth MD and Stephen Dunlop MD, MPH, CTropMed", 
    "institution_name": [
        "Boston University"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.edx.org/course/practitioners-guide-global-health-part-2-bux-globalhealthx-2", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-12-07T00:00:00Z"
}