{
    "selfpaced": false, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    Policy is the art of achieving a desired outcome in the presence of constraints and differing priorities.\n\nPolicy is largely a coordination problem. Here data and models can help. The Ebola outbreak in West Africa did not spread worldwide because science-based policies were implemented, replacing ineffective policies such as restricting movement by closing borders.\n\nModel policy problems with Global Systems Science\n\nThe science of epidemics is one of the successes of Global Systems Science (GSS) – an interdisciplinary approach to modelling the complex, multi-faceted and intertwined problems of the modern world. Another example is the use of network science in financial regulation dealing with many interconnected financial actors.\n\nAs its name suggests, most of those problems have a global context, but GSS addresses policy issues at all levels – from the individual to local communities to nations to regions.\n\nUnderstand the four main elements of Global Systems Science\n\nThis free online course will help you understand the four main elements of Global Systems Science, and how they can work together to create better formulated policy with better outcomes:\n\n1. Policy at all levels, from individuals to the world: we will begin with policy problems at global and national scales. How can these problems be tackled? How can we know which, if any, proposed policy options will work.\n\n2. The new, interdisciplinary approach: we will explore how the science of complex social, economic, political, biological, physical and environmental systems can inform policy makers in their work.\n\n3. Data science and computational modelling for policy makers: we will look at so-called “policy informatics” – the new, policy-oriented methods of modelling complex systems on computers.\n\n4. Citizen engagement: a central concept of GSS is that the behaviour of social systems emerges bottom-up, from the interactions of individuals and institutions, in the context of top-down policy constraints. We will explore what this means in practice – why individual citizens must be involved in decision making and policy formulation.\n\nBecause no method can provide perfect knowledge of the outcomes of policy, we will end with a critical evaluation of Global Systems Science, helping you understand its capabilities, limitations and future development.\n\n\n                                    ", 
    "end_date": "2016-09-19T00:00:00Z", 
    "title": "Global Systems Science and Policy: an Introduction", 
    "price": 0, 
    "instructors": "Jeffrey Johnson", 
    "institution_name": [], 
    "commitment": "2 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/global-systems-science?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-05T00:00:00Z"
}