{
    "selfpaced": false, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    Welcome to the exciting world of Healthcare Delivery Providers!\n\nThis second course in the Healthcare Marketplace Specialization will help you understand the various providers of healthcare across the U.S. delivery continuum. We will explore the unique value proposition of the various providers- from hospitals and clinics to physicians to community based providers. We will dissect this important value chain using various lenses such as- site of care delivery, people who provide the care and payers who pay for care. You will also learn about the challenges facing these providers and the innovations they are creating in order to help transform this important industry.\n\nI will use readings such as a case study and videos to make this learning more experiential for you, so that you can see and feel the world of healthcare delivery. I will also explain the various acronyms and specialized terms used in healthcare, so that you become more proficient and familiar with the language.\n\nGiven the fact that Healthcare is one of the largest industries in the U.S. and growing at an rapid pace, it is critical that current and future leaders understand the internal and external drivers that are shaping this industry. Current and future leaders will need to constantly innovate in order to sustain this industry into the future- by creating value for the end customer and the entire population, as well as increasing engagement of the humans who work within this industry.\n\nGet ready to take a deep dive into the complex ocean that is U.S. healthcare delivery- and make sure your oxygen tank is securely fastened!\n\n                                            Syllabus\n                        INTRODUCTION TO U.S. HEALTHCARE DELIVERYWelcome to the world of healthcare delivery providers! In this first module, I will introduce important concepts in this field including how value in healthcare is measured, what some key influencers of healthcare are and how the healthcare delivery system will be examined in this course. We will use various lenses such as: site of care delivery, payment models, payers and humans that work in the delivery system to dissect this value chain. I will also discuss emerging paradigms like the Triple and Quadruple Aims and Accountable Care, which are rapidly spreading across the US healthcare industry.HOSPITALS: COMMUNITY &amp; SPECIALTYIn this module I will lead you into the exciting and rapidly changing world of the Acute Care Hospitals. We will discuss the various types of hospitals in the US including community hospitals and specialized hospitals. We will also dissect the hospital as an organization through the lenses of org structure, humans, services and performance measurement. Throughout this module I will also cover the challenges facing the hospitals in the US and the innovations that they are leading through continuous quality improvement.POST-ACUTE CARE &amp; COMMUNITY-BASED SERVICESIn this module I will review post-acute care with you, i.e. care for patient after discharge from the acute care in the hospital. We will discuss the various post acute care providers and how they are organized. We will also examine how post acute care providers are measured, what challenges they face and what innovations they are leading.PHYSICIANS: PRIMARY, SPECIALTY, NEWER SETTINGS &amp; POPULATION HEALTHIn this module I will review the various types of physician practices and clinics. These include primary care physicians and specialty care physicians and their clinics. We will review how the various physicians are organized, how their performance is measured, how they get paid and also what challenges they face and what innovations they are leading. Welcome to the exciting world of physicians!HEALTHCARE DELIVERY OF TOMORROWAs a way to wrap up this course, I will discuss some key stakeholders and their roles in influencing the healthcare delivery system and providers such as pharmaceutical and device companies, employers etc. I will then share some innovations in healthcare that I have personally experienced in order to showcase how the delivery providers are constantly improving the delivery model. Finally, I will offer some closing reflections and highlight some leadership skills that I have found essential in emerging healthcare leaders.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Healthcare Delivery Providers", 
    "price": 0, 
    "instructors": "Rahul Koranne", 
    "institution_name": [
        "University of Minnesota"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/learn/healthcare-delivery-providers", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}