{
    "selfpaced": false, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    In this course in the Healthcare Marketplace specialization you will identify, define, and describe potential business and public policy solutions to the challenges facing society’s growing demand for health services.  Students will master a body of knowledge on the health care sectors major components through reading and reflection.  \n\nHealthcare has many different cultural components that will be discussed as historic trends as well as future demographic challenges.  You will understand diverse philosophies and cultures within and across societies as they relate to healthcare.  This outcome is particularly critical because of the tradeoffs needed to be assessed as medical technology advances faster than budgets and perhaps cultures are sometimes willing to tolerate.  \n\nAt the end of the day, you will gain an appreciation for the role of creativity, innovation, discovery, and expression across disciplines in the development of new medical care solutions through and examination of the physician, medical technology and financing sub-sectors of the health economy.\n\n                                            Syllabus\n                        EVOLUTION OF THE HEALTHCARE MARKETPLACEIn this module you will learn about the economic history of one of the largest segments of the world’s economy.  You will become acquainted with world trends in health and the stakeholders that comprise the healthcare marketplace ranging from physicians to hospitals to insurers and pharmaceutical firms.\n\nThe take-away messages from this module are that there are many competing voices in the health economy.  Furthermore, many of these voices have growing and evolving economic interests that spill over into all aspects of society.\n\nThe skills gained from this module to enable a successful capstone is an appreciation of the role of government and regulation in the making and destruction of markets.  One person’s new law may be a huge hindrance but also a giant opportunity for profit from another party.  You will be better prepared to distinguish the difference and succeed.PHYSICIAN AND HOSPITAL SERVICES MARKETIn this module you will learn about the provider market in the health economy.  The provider market mainly consists of the physician and hospital sectors.  Combined they are largest source of expenditure in the health economy.  \n\nThe take-away messages from this module are the provider market has demonstrated significant monopoly and the ability to set prices as well as price discriminate.  The market is also one of the most technology advanced, regulated and human capital intensive markets on the planet – all of which contribute to significant barriers to entry that reinforce market power. \n\nThe skills gained from this module are an understanding of the physician and hospital’s voice of customer for a market research plan.  In addition, the learner will gain an understanding of the range of sites of care as well provider reimbursement mechanism that are so critical for revenue generation within the hospital setting.  INSURANCE MARKETIn this module you will learn about the health insurance market.  Since the mid-20th century government and private health insurance has been the primary funding vehicle of health care in the industrialized world.  The long story of US and other nations health reform will be examined as well.  The take-away messages from this module are the health insurance market is a unique form of insurance.   Furthermore, its design has been greatly impacted by government intervention over a 100-year arc.The skills gained from this module are an understanding risk and insurance as well as the technology platforms used by the insurance industry to measure cost and quality.  Key knowledge for use in the capstone is an understanding health insurance reimbursement and the issues faced by insurers when they consider funding a new medical technology for patient use.  MEDICAL TECHNOLOGY MARKETSIn this module you will learn about the medical technology market.  This will provide an excellent overview for the in depth look at this in Course 3 of this specialization.  The focus is on the medical device and pharmaceutical market.  \nThe take-away messages from this module are medical technology prices are costly because high regulatory and development burden to get to market.  In addition, the pathways to payment for medical devices are pharmaceuticals are distinct but share more in common than are dissimilar.   \nThe skills gained from this module are an understanding of the regulatory burden of securing intellectual property rights as well as getting the technology clear for use from a safety and effectiveness perspective.  Learners will under the key ingredient of technology dossier required for sales and marketing of a product on a global scale. \nGLOBAL MEDICAL INNOVATIONIn this module you will learn about the global market trends.  You will also learn the key components of medical technology valuation.  \nThe take-away messages from this module are that health economy continues to expand and there are many behavior challenges that are problems as well as opportunities.  The module concludes showing a promising technology that is novel, needed, cost-effective and will deliver return – rare qualities when all are checked-off.  \nThe skills gained from this module are targeting global health market trends ripe for opportunity as well as knowledge of the checklist of key areas to be covered for the capstone project’s assessment of a promising new innovation.    \n\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Healthcare Marketplace", 
    "price": 0, 
    "instructors": "Stephen T Parente", 
    "institution_name": [
        "University of Minnesota"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/learn/healthcare-marketplace", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}