{
    "selfpaced": false, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    This course will explore the different dimensions of sustainability in healthcare and ways to incorporate those ideas into the managerial and quality improvement processes of healthcare organizations. Then it will compare how those issues have been addressed in different healthcare systems around the world. The course will    and discuss the key elements of the five pillars of sustainability of healthcare organizations, which are: environmental, socio-cultural, institutional capacity development, financial, and political.\r\n\r\nWe will review critical issues such as recycling medical waste; sustainable energy solutions for hospitals and healthcare organizations in countries with different levels of development; how to improve community health through sustainable healthcare; and many other issues equally relevant to large and small healthcare organizations in developed or developing countries.\r\n\r\nAs the participants review and exchange lessons learned in different corners of the world, they will discover and exchange ideas and tools to assess the sustainability efforts of their organizations and to implement feasible strategies to advance their initiatives.\n\n                                    ", 
    "end_date": "2013-10-28T00:00:00Z", 
    "title": "International Health Systems: Incorporating Sustainability Strategies", 
    "price": 0, 
    "instructors": "Bernardo Ramirez", 
    "institution_name": [
        "University of Central Florida"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.canvas.net/courses/international-health-systems-incorporating-sustainability-strategies", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2013-09-23T00:00:00Z"
}