{
    "selfpaced": false, 
    "topic_name": [
        "Public & Global Health"
    ], 
    "description": "\n\n                    \n                    \n                    Many Americans complain that they do not understand the U.S. health reform law called the Affordable Care Act (or Obamacare). They are right, and the main reason is because most Americans do not understand the basics of the U.S. health care system and U.S. health policy. Featuring some of the nation’s foremost teachers and thought leaders, this course provides students with a basic and thorough understanding of the U.S. health care system focusing on access, quality of care, and costs. Students will learn how the system is structured, how care is organized, delivered, and financed, and how the Affordable Care Act will influence the future of the system. Students will understand the U.S. health policy making structure process at the federal, state, and local levels. Students who complete this course will be able to interpret current controversies around US health policy and develop informed opinions on future policy developments.\n\n \n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code : https://www.edx.org/edx-terms-service. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement : http://harvardx.harvard.edu/research-statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form : https://www.edx.org/contact-us.\n\n \n\n                                    ", 
    "end_date": "2014-07-07T00:00:00Z", 
    "title": "PH210x: United States Health Policy", 
    "price": 0, 
    "instructors": "John E. McDonough", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.edx.org/course/united-states-health-policy-harvardx-ph210x", 
    "duration": "13 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-04-07T00:00:00Z"
}