{"selfpaced": false, "topic_name": ["Data Science and Big Data"], "description": "\n\n                    \n                    \n                    Mediante este curso serás capaz de identificar, evaluar y aprovechar las distintas oportunidades que te presenta el análisis de datos para generar valor en tu organización. Al finalizarlo, habrás desarrollado la capacidad de utilizar métodos de análisis de datos, así como herramientas y modelos de apoyo que soportarán tu toma de decisiones a nivel personal y en tu organización.\n\nEn la parte inicial de este curso conocerás la importancia y rol que juega el análisis de datos (Analytics) en el mundo actual, para apoyar la toma de decisiones en nuestra vida diaria, nuestro trabajo y nuestra organización. Conocerás no solo el enorme crecimiento que ha tenido esta área en los últimos años, sino también el gran potencial y oportunidades que te presenta en el futuro inmediato. Conocerás y analizarás diversos casos de éxito tanto a nivel mundial, como en países de habla hispana.\n\nDe igual forma, habrás desarrollado la capacidad de utilizar distintos métodos que te apoyarán en tu análisis de datos y proceso de toma de decisiones, utilizando además herramientas computacionales para explorar bases de datos, realizar predicciones y crear infografías asociadas al problema o decisión de tu interés. Además, identificarás elementos clave para la modelación matemática, que serán de gran utilidad para identificar el mejor curso de acción que deberás seguir.\n\nFinalmente, este curso te permitirá conocer y utilizar distintos criterios bajo los cuales podrás tomar decisiones, a partir del análisis de datos e información clave asociada a la misma. Estos criterios incluyen aspectos fundamentales como costos de oportunidad, escenarios de incertidumbre, así como distintos objetivos o metas a seleccionar, para que puedas elegir en forma efectiva la mejor decisión a tomar.\n\nAgradecemos a Fundación Televisa por su participación en la producción de este curso; con lo cual colabora a inspirar y desarrollar el potencial de las personas, a través de su compromiso con la educación y la cultura.\n\n                                            Syllabus\n                        Los datos y la toma de decisiones en tu vida y en las organizaciones¡Bienvenido a Fundamentos del análisis de datos para la toma de decisiones! \nTe invito a explorar el rol que desempeña el análisis de datos en el mundo actual y su importancia para apoyar la toma de decisiones, tanto en tu vida diaria como en tu contexto laboral. Al concluir este módulo serás capaz de identificar la importancia y el rol que juega el análisis de datos en las organizaciones, así como su enorme utilidad para apoyar la toma de decisiones en las mismas. Conocerás el crecimiento que ha tenido esta área de conocimiento en los últimos años, pero sobre todo el gran potencial que te presenta en tu futuro inmediato. \nDe manera particular, este módulo te permitirá no solo identificar casos y ejemplos de aplicación en distintos sectores e industrias, sino también datos e información clave en tu vida y organización, para utilizarlos en forma efectiva en las decisiones más importantes que te interese considerar.Exploración y predicción de datosA través de este módulo lograrás desarrollar capacidades iniciales para el Análisis de Datos, que te serán de gran utilidad para una buena toma de decisiones en tu organización. Para lograrlo, nos enfocaremos en dos tareas que son fundamentales en esta rama de conocimiento: la exploración de patrones y comportamientos clave en los datos, así como el realizar predicciones y pronósticos a partir de los mismos.\n\nPara lograrlo, desarrollarás la capacidad de utilizar un conjunto de herramientas estadísticas, así como apoyarte en software computacional especializado para este tipo de actividades y que te permitirá generar análisis y resultados de gran utilidad para ti y tu organización, revisando diversos casos reales en donde se han aplicado este tipo de herramientas y estrategias.\nIntegración y análisis de datos para el diagnóstico organizacional A través de este módulo lograrás realizar un análisis integral de datos e información, para generar un diagnóstico que apoye la toma de decisiones en tu organización. Para lograrlo, desarrollarás la capacidad de generar diversos análisis y reportes, que te servirán como base para la identificación de áreas de oportunidad y cursos de acción a tomar.\n\nPara lograrlo, desarrollarás la capacidad de utilizar un conjunto de herramientas estadísticas, así como apoyarte en software computacional especializado para este tipo de actividades y que te permitirá generar análisis y resultados de gran utilidad para ti y tu organización, revisando además diversos casos reales en donde se han aplicado este tipo de herramientas y estrategias.\nHerramientas y métodos para la toma de decisionesAl terminar este módulo serás capaz de identificar los distintos criterios bajo los cuales podrás tomar decisiones en tu vida y tu organización, a partir de las capacidades de análisis de datos e información que adquiriste en los módulos previos. Conocerás la estructura y beneficios de seguir distintos enfoques para la toma de decisiones, así como cuándo y bajo qué contextos es deseable seguir cada uno de ellos. Además, identificarás también la mejor estrategia a seguir bajo criterios específicos como los costos de oportunidad o escenarios de alta incertidumbre.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Fundamentos del análisis de datos para la toma de decisiones", "price": 0, "instructors": "Dr. Marco Antonio Serrato García", "institution_name": ["Tecnológico de Monterrey"], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/analisis-de-datos", "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}