{"selfpaced": false, "topic_name": ["Data Science and Big Data"], "description": "\n\n                    \n                    \n                    Are you an engineer, scientist or technician? Are you dealing with measurements or big data, but are you unsure about how to proceed? This is the course that teaches you how to find the best estimates of the unknown parameters from noisy observations. You will also learn how to assess the quality of your results.\n\nTU Delft’s approach to observation theory is world leading and based on decades of experience in research and teaching in geodesy and the wider geosciences. The theory, however, can be applied to all the engineering sciences where measurements are used to estimate unknown parameters.\n\nThe course introduces a standardized approach for parameter estimation, using a functional model (relating the observations to the unknown parameters) and a stochastic model (describing the quality of the observations). Using the concepts of least squares and best linear unbiased estimation (BLUE), parameters are estimated and analyzed in terms of precision and significance.\n\nThe course ends with the concept of overall model test, to check the validity of the parameter estimation results using hypothesis testing. Emphasis is given to develop a standardized way to deal with estimation problems. Most of the course effort will be on examples and exercises from different engineering disciplines, especially in the domain of Earth Sciences.\n\nThis course is aimed towards Engineering and Earth Sciences students at Bachelor’s, Master’s and postgraduate level.\n\n \n\nLICENSE\n\nThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License.\n\n                                    ", "end_date": "2016-10-22T00:00:00Z", "title": "OT.1x: Observation Theory: Estimating the Unknown", "price": 0, "instructors": "Ramon Hanssen, Sandra Verhagen and Sami Samiei-Esfahany", "institution_name": ["Delft University of Technology"], "commitment": "6 hours", "subject_name": ["Computer Science"], "course_url": "https://www.edx.org/course/observation-theory-estimating-unknown-delftx-ot-1x", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-10-01T00:00:00Z"}