{"selfpaced": false, "topic_name": ["Data Science and Big Data"], "description": "\n\n                    \n                    \n                    In this course you will get an introduction to the main tools and ideas in the data scientist's toolbox. The course gives an overview of the data, questions, and tools that data analysts and data scientists work with. There are two components to this course. The first is a conceptual introduction to the ideas behind turning data into actionable knowledge. The second is a practical introduction to the tools that will be used in the program like version control, markdown, git, GitHub, R, and RStudio.\n\n                                            Syllabus\n                        Week 1During Week 1, you'll learn about the goals and objectives of the Data Science Specialization and each of its components. You'll also get an overview of the field as well as instructions on how to install R.Week 2: Installing the ToolboxThis is the most lecture-intensive week of the course. The primary goal is to get you set up with R, Rstudio, Github, and the other tools we will use throughout the Data Science Specialization and your ongoing work as a data scientist. Week 3: Conceptual IssuesThe Week 3 lectures focus on conceptual issues behind study design and turning data into knowledge. If you have trouble or want to explore issues in more depth, please seek out answers on the forums. They are a great resource! If you happen to be a superstar who already gets it, please take the time to help your classmates by answering their questions as well. This is one of the best ways to practice using and explaining your skills to others. These are two of the key characteristics of excellent data scientists. Week 4: Course Project Submission &amp; EvaluationIn Week 4, we'll focus on the Course Project. This is your opportunity to install the tools and set up the accounts that you'll need for the rest of the specialization and for work in data science.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "The Data Scientist’s Toolbox", "price": 0, "instructors": "Jeff Leek", "institution_name": ["Johns Hopkins University"], "commitment": "1-4 hours", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/data-scientists-tools", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}