{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">MY PERSONAL GUARANTEE - I AM SO CONFIDENT YOU WILL LOVE THIS  COURSE THAT IF YOU DON&#039;T, I WILL REFUND YOU ALL THE MONEY (within 30  days of purchasing) WITH NO QUESTIONS ASKED . THIS IRONCLAD GUARANTEE IS  BACKED UP BY UDEMY.</strong>  </p>  <p style=\"\">  \t  Do you ever feel you play the same stuff on your harmonica over and over? I&#039;ve felt that at times and to get my mojo back I study other players and see what they do to see if it will work for me.<br style=\"\">  \t<br style=\"\">  \tYou need 101 Blues Riffs - and here they come!  </p>  <p style=\"\">  \t<br style=\"\">  \t        This course will increase your musical vocabulary; it will teach you how to play riffs in the styles of De Ford Bailey, Sonny Terry, Little Walter, Sonnyboy Williamson 2, William Clarke, JJ Milteau, Brendan Power, Big Walter, Charlie McCoy, Charlie Musselwhite and more...<br style=\"\">  \t<br style=\"\">  \t        By learning these riffs you will be a much broader musician and able to impress your audience and bandmates.<br style=\"\">  \t<br style=\"\">  \t        Every riff is written down as harmonica tab and normal music notation on a pdf and I&#039;ll play it for you at different speeds with a click track as well on an mp3.<br style=\"\">  \t<br style=\"\">  \t        All you need is a &#039;C&#039; diatonic harmonica and you&#039;re away!<br style=\"\">  \t<br style=\"\">  \t        I&#039;ll walk you through every riff in order before moving on to the next one.<br style=\"\">  \t<br style=\"\">  \t        If you want to free up your playing and explore the styles of some of the most successful blues harp players you&#039;ve come to the right place!  </p><br style=\"\">", 
    "end_date": null, 
    "title": "101 Blues riffs - learn how the harmonica superstars do it", 
    "price": "20.00", 
    "instructors": "Ben Hewlett", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384928_b91d_5.jpg", 
    "course_url": "https://www.udemy.com/play-harmonica-riffs-like-the-blues-harp-superstars-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T16:10:40Z"
}