{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t  88 Logic is a theory and method of playing piano developed by Stephen Mackay. The course hands you the key to unlocking one of the simplest techniques for learning piano. Designed for those who have never touched a piano and to assist those who need help developing their skills this course works for you.  </p>  <p>  \t<strong style=\"\">&quot;88 logic - The Mackay Method. Giving You The Power To Play Piano In Next To No Time.&quot;</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\"></strong>why are there 88 keys on a piano keyboard?</li>  \t<li>you will unlock a simple mathematical system of chord discovery</li>  \t<li>you will discover unique 16 key octave</li>  \t<li>you will learn how to invert chords and play basic chord progressions</li>  \t<li>You will learn how to create simple melodies.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">&quot;Time Poor?... The This Is The Course For You&quot;</strong>  </p>  <p>  \t    The real beauty of this course is in it&#039;s overall simplicity. The theory that unlocked this method of learning is a little more involved and explained in full however, even without a comprehensive understanding of the theory anyone can use this method to start playing.  </p>  <p>  \t    88 Logic will give you the skills you need to find your way around the keyboard with confidence and allow you the freedom to find your own sense of timing, in your own time.  </p>  <p style=\"\">  \t<strong style=\"\">&quot;It&#039;s All About You&quot;</strong>  </p>  <p style=\"\">  \t  88 logic was designed to make piano playing easy and fun. This course is quick and simple and you will take away everything you need to get you started on your path to being a great player.  </p>", 
    "end_date": null, 
    "title": "88 Logic - The Essential Guide To Learning Piano", 
    "price": "25.00", 
    "instructors": "Stevie  Mac", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383852_8aa3_2.jpg", 
    "course_url": "https://www.udemy.com/88-logic-the-ultimate-course-for-learning-piano/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T08:06:29Z"
}