{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>A secret is uncommon information. In this course you will learn from my 20+ years experience working with analog synths, all of the ins and outs of using analog synths and begin Sound Designing today. I say sound designing, as the components you will learn about are the fundamental components of this course, and are critical and essential for sound design. </p>\n\n<p>Have you ever sat there and said, man! I wish that sound lasted a bit longer, or I wish it did not start so harsh, or it did this or that. If you have asked that question, than you are in the right place, because that is what this course was designed to teach.<br></p>\n\n\n\n<p>I made this course to serve you the knowledge and understanding that it takes to really reveal and expose the power of synths, especially analog based synths. It does not matter if it is analog modeled or an actual analog synth, the same principles apply. </p>\n\n\n\n<p>I am going to take you through analog synthesizers one step at a time, and break down a complex interacting device into smaller and more manageable pieces. First we will start with the overview, and then section by section. After that we start work on the interactions, the most fun part about analog synths. The interactions is what makes the analog highly desired and sought after, and its essentially the fundamental components used in many places. The fact is filters and envelopes are used in a massive array of technology, and in this course you will start to understand the wide universe of applications as you listen and hear sounds, now you will have some new understanding of how those sounds or made or how that EDM or Trance track is created. You will be equipped to use off-the-shelf synthesizers and quickly be able to wow sounds out of them, you will become the synth master. </p>\n\n\n\n<p>I have owned many analog synths and now they are more readily available than ever. With micro keyboards, to software synth, and craigslist as well as ebay, there are so many ways to own analog synths. Not only that, but even the digital synths work the same, they have the same basic components and filters and envelopes. </p>\n\n\n\n<p>I show you the fun and excitement of tweaking analog synths, just like you were in my own lab and studio, and of course feel free to ask questions, and let me know if you are missing something, I want to help you understand and get comfortable with analog synths. I have amassed this knowledge and I want to pass it on to you, so you can go and do all the fun and exciting things with analog synths. I made this course to take out those frustrating trial and error steps, and bring you right to the choice cut meat. </p>\n\n\n\n<p>If you want to hear analog synths in music, I'll be happy to point you to my free to listen videos on youtube, with my band name Onitod, featured as onitodmusic, and you can hear analog synths at work. Enroll now, and let's get started enjoying and learning all about analog synths. <br></p>\n\n\n\n<p> <br></p>\n\n\n\n<p> <br></p>", 
    "end_date": null, 
    "title": "A Guide to Analog Synths: For the modern EDM enthusiast.", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635570_a99d_2.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-analog-synths/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T04:56:21Z"
}