{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t                          This follow-on course will improve your guitar playing.  </p>  <p style=\"\">  \t                    I will show you:  </p>  <ul style=\"\">  \t<li style=\"\">how to read TAB</li>  \t<li style=\"\">exactly where to place your fingers to play finger-style guitar</li>  \t<li style=\"\">how to decide what rhythm to use in a song</li>  \t<li style=\"\">how to play chords of A, A7, A7sus4, B7, D7, Dsus2, Dsus4, E7, Em7, F, Fmajor7, G6 </li>  \t<li style=\"\">more complex strumming patterns</li>  \t<li style=\"\">how to pick individual notes using a plectrum</li>  \t<li style=\"\">how to use a capo</li>  \t<li style=\"\">techniques hammer-ons and pull-offs</li>  </ul>  <p style=\"\">  \t                           The videos follow a carefully designed order to help you improve quickly. The course is divided into sections, the first dealing with improving your rhythm by introducing more complex strumming patterns using various songs while also introducing new chords. The next section gets you started reading TAB and learning the basics of finger-style guitar. And the final section takes a look at some more advanced techniques such as hammer-ons and pull-offs.  </p>  <p style=\"\">  \t        During the videos any chords that are  being used will appear onscreen and there are video inlays to give you a  closer look at what my left-hand fingers are doing. For lessons on finger-style and picking there are also video inlays that will show you a close-up of the right hand. A visual  representation of the strumming patterns and for finger-style songs TAB will also be shown onscreen  where necessary.  </p>  <p style=\"\">  \t                    The strumming patterns and chord sequences are included as supplemental materials so they can be  downloaded and studied separately from the videos.  </p>  <p style=\"\">  \t                     The course should take approx. 10-15weeks to complete but that will depend on the amount of time you are able to dedicate to practicing the guitar. If you can only practice for an hour at the weekend it could take considerably longer than if you can practice on a more regular basis.  </p>  <p style=\"\">  \t      To put the cost into perspective, a 10 week group class in the school where I teach would cost approx. $210 and it would be unlikely to cover half the amount of material featured in this course.  </p>", 
    "end_date": null, 
    "title": "Acoustic Guitar After The Basics", 
    "price": "45.00", 
    "instructors": "Francis Long", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198692_c09d_4.jpg", 
    "course_url": "https://www.udemy.com/acoustic-guitar-after-the-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T12:34:58Z"
}