{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Let's learn how to play acoustic blues guitar in the style of the greatest Bluesmen like Robert Johnson, Big Bill Broonzy, Son House and many others. This course will show you how to play the most important styles of acoustic blues guitar.<br></p><p>The course will show you, in all its sections, how to play acoustic blues through several accompaniment techniques with pick but above all with fingerpicking with and without thumb pick. The course target is to reveal all the secrets and tricks of the 12-bar blues.</p><p>Following the lectures will be very easy as every exercise is presented with a central angle view at first and later right hand and left hand views will be shown together with the structures and diagrams for the accords; moreover the exercises will be shown at different speeds and music sheets are synchronized with the lesson.</p><p>Once you'll have acquired all the techniques, learning to play the most famous acoustic blues songs will be so much easier: a dedicated section for this purpose is included in the course, with 6 great classics from the acoustic blues repertoire.</p><p>The course is addressed to people who can already play guitar and want to know and master acoustic blues in the right way.</p><p><strong>Contents and Overview</strong><br></p><p>The course includes 100 HD video lectures with related music scores in pdf, for a total length of more than 4 hours. These lectures are divided into 5 sections:</p><ul><li>Acoustic blues shuffle</li><li>Delta blues</li><li>Slide</li><li>Fingerstyle</li><li>Songs</li></ul><p>In this final section you will put into practice the knowledge acquired in the previous ones.</p><p><strong>A complete method to learn acoustic blues</strong></p><ul><li>0% theory, 100% practice</li><li>HD Video and Audio </li><li>Central Angle View</li><li>Right Hand and Left Hand</li><li>Repetition of lessons at different speeds</li><li>Structures and diagrams for the accords</li><li>Sheet synchronized with the lesson</li><li>Music Scores Pdf download </li></ul>", 
    "end_date": null, 
    "title": "Acoustic Blues Guitar Lessons", 
    "price": "40.00", 
    "instructors": "Daniele Pacchini", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647276_801a_5.jpg", 
    "course_url": "https://www.udemy.com/acoustic-blues-guitar-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T21:29:20Z"
}