{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t              This Free course will get you playing the acoustic guitar in no time.  </p>  <p>  \t        I will show you:  </p>  <ul style=\"\">  \t<li>how to hold the guitar</li>  \t<li>exactly where to place your fingers to play the basic guitar chords</li>  \t<li>how to read chord diagrams</li>  \t<li>how to play chords of G, D, C, Em,  Am, Cadd9<br style=\"\">  \t</li>  \t<li>basic strumming patterns</li>  \t<li>how to tune the guitar</li>  \t<li>how to use a capo</li>  </ul>  <p>  \t              You will learn all  the basics needed to get you started, along with strumming patterns that will have you playing songs in a very short period of time. During the videos any chords that are being used will appear onscreen and there are video inlays to give you a closer look at what my left-hand fingers are doing. A visual representation of the strumming patterns will also be shown onscreen where necessary.  </p>  <p>  \t        The strumming patterns and chord diagrams are included as supplemental materials so they can be downloaded and studied separately from the videos.  </p>  <p>  \t        The course should take approx. 5 weeks to complete if you are an absolute beginner with  no previous experience. Also if you&#039;ve always wanted to play guitar or tried to learn guitar before but found changing chords or strumming was difficult then this is the course for you.  </p>", 
    "end_date": null, 
    "title": "Acoustic Guitar Basics", 
    "price": 0, 
    "instructors": "Francis Long", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198690_90ac_4.jpg", 
    "course_url": "https://www.udemy.com/acoustic-guitar-basics/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T12:22:19Z"
}