{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>COURSE UPDATES:</strong>  </p>\n\n<ul>  \t<li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li>  </ul>\n\n\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>COURSE DESCRIPTION:</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t    In this series, MusicProfessor instructor John Holt guides you through five challenging, engaging etudes (also know as 'studies'). John breaks down each piece section by section, covering all of the important rhythmic, phrasing, and musical elements as well as performing each piece at various tempos.  Learn how to master a challenging piece from beginning to end!  </p>\n\n\n\n\n\n\n\n<p>  \t    If you're looking to improve your Trumpet skills, MusicProfessor provides the perfect easy, online way to do it!  Private lessons cost anywhere from $30 - $100/hr, and as you improve, unfortunately, so does the cost of lessons.  Each MusicProfessor Trumpet course provides an entire year's worth of instruction, for a fraction of the cost, and at your own convenience.  Plus, each course is taught by an industry leading instructor!  </p>\n\n\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>COURSE FEATURES:</strong>  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Over 80 video lessons</li>  \t<li>Downloadable sheet music for each lesson</li>  \t<li>Master five challenging Trumpet etudes</li>  \t<li>Extend your abilities with multiple warm-up exercises</li>  \t<li>Learn how to troubleshoot difficult fingering passages</li>  \t<li>Learn how to increase tongue speed</li>  \t<li>Review multiple complicated rhythms</li>  \t<li>Learn how to break down each piece into manageable practice sections</li>  \t<li>Play each etude at various tempos, including a final performance tempo</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t    MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy's 30-day guarantee.  </p>\n\n\n\n\n\n\n\n<p>  \t    Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR:</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t    John Holt is Associate Professor of Trumpet and Chair of the Division of Instrumental Studies at the University of North Texas. Holt is also principal trumpet with the Dallas Opera Orchestra, a position he has held since 1989.  </p>\n\n\n\n\n\n\n\n<p>  \t    The consummate musical artist, Holt has appeared as a soloist with orchestras throughout the United States and Europe. Committed to the advancement of contemporary chamber music in performance, recordings and education, Holt has commissioned, premiered and recorded numerous works since 2003. Trumpet Panoply CD 769 is Holt's seventh solo CD recording with Crystal Records and was released in April of 2011. His six previous solo recordings, all on the Crystal Records label, have received unanimous critical acclaim by industry publications Fanfare, American Record Guide, Instrumentalist, Gramophone and the International Trumpet Guild.  </p>\n\n\n\n\n\n\n\n<p>  \t    Born in Dallas, TX, Holt began studying trumpet at the age of 12 with Richard Giangiulio, former Principal Trumpet of the Dallas Symphony. He continued his studies at the University of Miami with Gilbert D. Johnson, former Principal Trumpet of the Philadelphia Orchestra. At age 22, Holt performed as Co-Principal Trumpet of the Philharmonic Orchestra of Ft. Lauderdale, under the direction of Emerson Buckley. At age 24, Holt became Principal Trumpet of the Orchestra del Maggio Musicale Fiorentino in Florence, Italy, Zubin Mehta, music director. While in Italy, Holt had the great privilege of playing under some of the worlds most renowned conductors including: Luciano Berio, Georges Prtre, James Conlon, Gerd Albrecht, Carlos Kleiber, Krzysztof Penderecki, Riccordo Chailly and Carlo Maria Giulini.  </p>\n\n\n\n\n\n\n\n<p>  \t    At the invitation of artistic director and conductor Nicola Rescigno, Holt became Principal Trumpet of the Dallas Opera Orchestra in 1989. He received distinguished opera service awards in 1999, 2004 and 2009. Holt's orchestral discography includes numerous recordings with the Dallas Symphony Orchestra, Fort Worth Symphony Orchestra, The Dallas Opera Orchestra and The Voices of Change. He is a Yamaha Performing Artist, performing on the Yamaha Chicago C trumpet and uses TrumCor mutes, for whom he is a consultant.  </p>\n\n\n\n\n\n\n\n<p>  \t    —  </p>\n\n\n\n\n\n\n\n<p>  \t<em>This course has been provided by MusicProfessor, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Advanced Trumpet Studies - Learn to Master the Trumpet!​", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188498_2056_9.jpg", 
    "course_url": "https://www.udemy.com/trumpet-etudes-allegretto/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-25T15:25:03Z"
}