{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>COURSE UPDATES:</strong>  </p>\n\n<ul>  \t<li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n\n\n<p><strong><br></strong></p>\n\n<p>  \t<strong>COURSE DESCRIPTION:</strong>  </p>\n\n\n\n<p>  \t      In this series, MusicProfessor instructor Mary Druhan guides you through three challenging, through engaging Clarinet etudes (also know as 'studies'). Mary breaks down each piece section by section, covering all of the important rhythmic, phrasing, and musical elements as well as performing each piece at various tempos.  Learn how to master a challenging piece from beginning to end!  </p>\n\n\n\n<p>  \t      If you're looking to improve your Clarinet skills, MusicProfessor provides the perfect easy, online way to do it!  Private lessons cost anywhere from $30 - $100/hr, and as you improve, unfortunately, so does the cost of lessons.  Each MusicProfessor Clarinet course provides an entire year's worth of instruction, for a fraction of the cost, and at your own convenience.  Plus, each course is taught by an industry leading instructor!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>COURSE FEATURES:</strong>  </p>\n\n\n\n<ul>  \t<li>Over 75 video lessons</li>  \t<li>Downloadable sheet music for each lesson</li>  \t<li>Master complex, challenging fingering passages</li>  \t<li>Discuss trouble areas and troubleshooting techniques</li>  \t<li>Learn how to interpret and perform tough rhythmic passages</li>  \t<li>Learn how to slowly increase speed and accuracy for fast pieces</li>  \t<li>Learn to play expressively with dynamics and phrasing</li>  \t<li>Review multiple complicated rhythms</li>  \t<li>Break each piece down into manageable bite-sized sections</li>  \t<li>Practice each etude at various tempos, including a final performance tempo</li>  </ul>\n\n\n\n<p>  \t      MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy's 30-day guarantee.  </p>\n\n\n\n<p>  \t      Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR:</strong>  </p>\n\n\n\n<p>  \t      Dr. Mary Alice Druhan is serving as Associate Professor of Clarinet at Texas AM University Commerce after holding previous teaching positions at James Madison University (VA) and Louisiana State University.  </p>\n\n\n\n<p>  \t      She has enjoyed invitations to many prestigious events in the United States, Puerto Rico, England, Germany, Italy, and Thailand in recitals and in conference performances for the International Clarinet Association (ICA) ClarinetFest [Atlanta, Kansas City, Austin, Lincoln, and Assisi, Italy], OU Clarinet Symposium, International Double Reed Society, Midwest International Band and Orchestra Clinic, Texas Music Educators Association, Louisiana Music Educators Association, International Harp Society, World Saxophone Congress, American Bandmasters Association, and the College Band Directors National Association.  </p>\n\n\n\n<p>  \t      Dr. Druhan currently performs with the Dallas Wind Symphony, the Dallas Festival of Modern Music, Triforia Winds, and the Color of Sound chamber series. She has also performed as the solo Eb clarinetists with the US Army Band, Pershings Own, as well as a Bb section member of the Ceremonial Unit and as a featured soloist with the concert band. She has worked with the East Texas Symphony Orchestra (Eb, Bb/A, Bass), Shreveport Symphony Orchestra (Eb, Bb/A), Baton Rouge Symphony Orchestra (Eb, Bb/A, Bass), Acadiana Symphony Orchestra (Eb, Bb/A, Bass), Plano Symphony Orchestra, Natchez Opera, Shreveport Opera, Sorg - Whitewater Opera, and Ohio Light Opera. Her research and creative activities were recognized by Texas AM University-Commerce in 2010 with the awarding of the University Faculty Research Award, Office of the Provost.  </p>\n\n\n\n<p>  \t      Texas AM University-Commerce has recognized Dr. Druhan's excellence in teaching with the James Jim Vornberg Award for Teaching in 2011. Her lecture on mentoring the college music student through the applied studio was presented for the national conference of NACWPI in 2011. Dr. Druhan served on a teaching panel discussion for the International Clarinet Association in Los Angeles/Northridge. She also serves on the Education Committee for the Dallas Wind Symphony and her recent work includes teaching and performance video guides of the 2013-14 Texas UIL all-state etudes for MusicProfessor. Dr. Druhan is the founder and director of the Northeast Texas Clarinet Day, an event which has evolved into the Texas Clarinet Colloquium, recipient of the 2011-2012 Community Seed Grant award from the College Music Society and a nationally attended event which hosts hundreds of musicians annually.  </p>\n\n\n\n<p>  \t      Mary Alice Druhan is a Buffet-Group USA Performing Artist as well as an Artist with the World Clarinet Alliance. Her teachers include Diana Haskell, Timothy Wright, Steve Cohen, and Ronald de Kant. She is a member of the International Clarinet Association, Sigma Alpha Iota, Texas Music Educators Association, American Chamber Society, American Federation of Musicians-Dallas, World Clarinet Alliance, NACWPI, and the College Music Society.  </p>\n\n\n\n<p>  \t      —  </p>\n\n\n\n<p>  \t<em>This course has been provided by MusicProfessor, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Advanced Clarinet Studies - Learn to Master the Clarinet!", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373556_a8a7_2.jpg", 
    "course_url": "https://www.udemy.com/clarinet-etudes/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-19T00:07:23Z"
}