{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t¿Alguna vez quisiste tocar esas canciones que hicieron historia como  lo hacen las bandas más famosas de rock? ¡Por fin llegó el momento de  que conozcas todos los secretos para lograrlo!  </p>  <p>  \tTenemos para ti una compilación de los mejores solos en guitarra  eléctrica, incluidos en canciones de reconocidos artistas como Queen,  Metallica, Pink Floyd, Carlos Santana, AC/DC, Audioslave, Eric Clapton,  Ozzy Osbourne, Led Zeppelin y Black Sabbath.  </p>  <p>  \tEn los dos volúmenes que componen este curso te explicamos en cámara  lenta y con lujo de detalles todos los acordes y técnicas que debes  utilizar para que tu guitarra suene como la de los músicos más famosos  de la época contemporánea. Además te proporcionaremos un CD adicional  con las pistas de cada una de las canciones explicadas para que  practiques los solos fantásticos recopilados en esta colección.  </p>  <p>  \tUno de los mejores guitarristas de América Latina te enseñará todos  los secretos para que toques algunas de las canciones de rock más  famosas como siempre lo deseaste, con explicaciones claras y precisas,  acercamientos de cámaras y la pista de cada canción para que puedas  practicar los solos.  </p>  <p>  \tCon el curso Solos Fantásticos aprenderás paso a paso cómo  interpretar los solos de canciones emblemáticas para que puedas lucirte  en el escenario.  </p>", 
    "end_date": null, 
    "title": "Aprende a tocar los mejores solos en la guitarra eléctrica", 
    "price": "30.00", 
    "instructors": "Virtuosso Producciones", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208126_fa95_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-tocar-los-mejores-solos-en-la-guitarra-electrica/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-30T16:47:44Z"
}