{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>El <strong>NIVEL INTERMEDIO </strong>de curso <em>Aprende el Acordeón de oído y con técnica</em> es el apropiado para aquellas personas que hayan avanzado en el Nivel de Principiante y, también para aquellos/as que tengan conocimientos básicos del Acordeón. </p><p>En este<strong> Nivel INTERMEDIO </strong>encontramos:</p><p style=\"\"><strong>a) 5 sesiones.</strong></p><p style=\"\"><strong>b) 20 canciones</strong> populares e internacionales, propuestas por el profesor Néstor José León, de una forma evolutiva y pedagógica, a través de su <strong>Sistema Especial de Gráficos</strong> para aprender el Acordeón \"de oído y con técnica\". </p><p style=\"\"><strong> <strong>c) Un </strong>Sistema de Gráficos <span><strong>diseñado </strong><span>por el profesor, </span></span></strong>sin necesidad de anteponer los estudios de Lenguaje Musical o Solfeo, Armonía tradicional, etc. que sólo son necesarios para aquellas personas que, con el apoyo del Conservatorio de Música, pretendan sacar la carrera del instrumento. </p><p style=\"\"><strong>d) </strong>En este Nivel, aparte de las 5 sesiones que hemos mencionado, las 20 canciones están repartidas en <strong>51 clases </strong>en las encontramos –aparte de los apuntes técnicos de la primera sesión–, dos clases dedicadas a cada canción: una para la explicación de la técnica a seguir en <strong>la botonera </strong>y otra para aprenderse la técnica de cada canción en el <strong>teclado.</strong></p><p style=\"\"><strong>d) </strong>En este Nivel –a través de las canciones propuestas por el profesor– encontraremos los ritmos de <strong>Vals, Habanera, Swing, foxtrox, tango y polka</strong>. </p><p style=\"\"><strong>e) </strong><strong>En la botonera</strong> (mano izquierda) ampliaremos su estudio, respecto al Nivel anterior, evolucionando con progresiones, o acordes vecinos del fundamental, pero haciendo hincapié en \"alternar dos bajos diferentes sobre un mismo acorde\".</p><p style=\"\"><strong>f) En el teclado</strong> evolucionaremos con partes y melodías a dos y tres voces (en triadas).</p><p style=\"\"><strong>g) </strong>Respecto al<strong> fuelle, </strong>se aprenderá a abrirlo y cerrarlo correctamente ya que \"es la base de la expresión\" en este instrumento. </p>", 
    "end_date": null, 
    "title": "Aprende el acordeón de oído y con técnica –Nivel Intermedio–", 
    "price": "25.00", 
    "instructors": "Néstor José León Ojeda", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733922_f479_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-el-acordeon-de-oido-y-con-tecnica-nivel-intermedio/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T10:16:08Z"
}