{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t Si alguna vez has querido aprender a tocar el piano, este es el curso que estabas esperando.  </p>  <p>  \t Tocar el piano requiere desarrollar diversas habilidades y el curso  de piano de Virtuosso te ayudará a mejor considerablemente tu técnica  pianística, ya que incluye una gran cantidad de ejercicios y técnicas  diseñadas especialmente para lograr la coordinación entre la vista y las  manos.  </p>  <p>  \t Tocar el piano por nota es uno de los grandes retos a los que se  enfrentan todos los pianistas o tecladistas y por fin tienes a tu  alcance un curso de piano que te permitirá hacer tus sueños realidad.  </p>  <p>  \t La mayoría de los métodos de piano tradicionales son obsoletos,  aburridos y no llevan una secuencia gradual. El curso de piano de  Virtuosso es totalmente diferente ya que es un sistema audiovisual,  contiene varias tomas y las explicaciones están muy detalladas, además  se incluyen ejercicios para que practiques todo lo demostrado por el  instructor.  </p>  <p>  \t Los ejercicios que se incluyen en el curso de piano son totalmente  prácticos y fueron diseñados por los mejores maestros de piano de  América Latina.  </p>  <p>  \t En el curso de piano de Virtuosso Producciones te explicamos cada  lección paso a paso, de manera gradual, con acercamientos de cámara,  partituras y material adicional para que desarrolles tus habilidades  hasta un nivel profesional.  </p>  <p>  \t <strong style=\"\">¡Decídete a aprender a tocar el piano con los mejores!</strong>  </p>  <p>  \tEl curso de piano de Virtuosso incluye lecciones en video y pistas en mp3 para que practiques.  </p>", 
    "end_date": null, 
    "title": "Aprende a tocar el piano desde cero", 
    "price": "50.00", 
    "instructors": "Virtuosso Producciones", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204014_fcc3_4.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-tocar-el-piano-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-23T17:11:50Z"
}