{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tEl teclado y el piano son sin duda de los instrumentos musicales más  populares, su riqueza armónica y melódica los colocan entre los  instrumentos más completos.  </p>  <p>  \tSin embargo, aprender a tocar el teclado y piano no siempre es  sencillo, pues los cursos tradicionales pueden resultar complejos y  profesores poco accesibles pueden provocar que un alumno principiante  abandone sus estudios. Por ello, Virtuosso te ofrece un sistema de  aprendizaje que te permitirá avanzar a tu ritmo con la guía de  profesionales.  </p>  <p>  \tEl curso completo para piano y teclado de Virtuosso, totalmente en  español, fue desarrollado por músicos profesionales y especialistas en  la educación musical y está diseñado para que aprendas a tocar de forma  gradual, ya que está dividido en tres niveles de aprendizaje: básico,  intermedio y avanzado.  </p>  <p>  \tEn el curso de teclado y piano encontrarás todos los aspectos básicos  de armonía, melodía y acompañamientos, además de técnicas y ejercicios  que te permitirán desarrollar eficazmente tus habilidades.  </p>  <p>  \tAprenderás a tocar tus canciones favoritas, a interpretar el ritmo que más te guste y acompañarte mientras cantas.  </p>  <p>  \tCon el curso para piano y teclado de Virtuosso podrás desarrollar tus  habilidades musicales y descubrirás en la práctica lo fácil que es  empezar a tocar las canciones que te gustan.  </p>", 
    "end_date": null, 
    "title": "Aprende a tocar el teclado como los expertos", 
    "price": "50.00", 
    "instructors": "Virtuosso Producciones", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/211780_b248_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-tocar-el-teclado-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-06T18:23:57Z"
}