{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>En este curso  aprenderás a tocar piano leyendo las notas en clave de sol y clave de fa a fín de que puedas desarrollar un entendimiento e independencia en tu estudio, sé capaz de leer las notas de partituras de piezas sencillas para que puedas tocar siendo tú el que dirige tu aprendizaje. Cabe mencionar que este curso ha sido <strong><em>actualizado el </em></strong><strong><em>1 Enero 2016</em></strong></p><p>Este curso te mostrará a través de videos totalmente prácticos como leer ejercicios en clave de fa y clave de sol, siempre guiando el proceso de aprendizaje para que sepas como practicar y seas capaz de saber como debes de practicar para que tu experiencia pianística sea un éxito.</p><p>Este curso tiene material que puedes descargar para que puedas estudiar sin tener que tener la computadora o dispositivo ahí mismo, además de tener un foro de discusión donde puedes externar tus dudas y contribuir al crecimiento de este curso.</p><p>Este curso contiene información general necesaria para que si estas considerando aprender piano, sepas que es lo que se necesita para iniciar clases de una manera exitosa. Aprende como elegir instrumento, maestro, escuela así como saber cuáles son los elementos esenciales de una rutina de estudio eficiente. Reflexiona en los tipos de programas educativos, para que tomes la mejor decisión. Ya sea una escuela, un maestro privado o continuar con el aprendizaje online.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Aprendiendo piano: Lectura de piezas clásicas Vol.I", 
    "price": "25.00", 
    "instructors": "Ilse Lozoya", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631444_a5b3_3.jpg", 
    "course_url": "https://www.udemy.com/aprendiendo-piano/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T15:41:39Z"
}