{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t El curso de guitarra eléctrica de Virtuosso contiene todos los  elementos necesarios para que desarrolles tu habilidad como guitarrista.  No necesitas experiencia previa, pues los contenidos están diseñados  para que aprendas desde los aspectos básicos.  </p>  <p>  \t En los tres volúmenes del curso se explican de manera gradual las  técnicas de ejecución que utilizan los profesionales. De esta forma  podrás desarrollar diversas habilidades necesarias para convertirte en  un buen guitarrista.  </p>  <p>  \t El curso de guitarra eléctrica de Virtuosso está diseñado en un  formato audiovisual innovador, por lo que en los videos podrás ver las  técnicas claramente explicadas desde diferentes ángulos, de manera que  no te quede duda sobre cómo llevarlas a cabo.  </p>  <p>  \t Con el curso de guitarra eléctrica aprenderás a generar  acompañamientos, acordes, ritmos, riffs, técnicas del manejo de la púa,  ejercicios de coordinación, así como a tocar melodías en el estilo  característico que sola la guitarra eléctrica es capaz de producir.  </p>  <p>  \t Este curso de guitarra eléctrica incluye las técnicas básicas para  tocar como todo un profesional como el legatto, staccato, tapping,  sweeping, bending, hammer on, pull off y muchas más.  </p>  <p>  \t Encontrarás además conceptos esenciales de armonía y acordes, así  como numerosos tips y técnicas para que tu aprendizaje sea sólido y  consistente.  </p>  <p>  \t También te enseñaremos a desarrollar tu velocidad, improvisar y  utilizar técnicas como el muting e incluso aprenderás trucos que sólo  los guitarristas de experiencia conocen.  </p>", 
    "end_date": null, 
    "title": "Aprende a tocar la guitarra eléctrica", 
    "price": "50.00", 
    "instructors": "Virtuosso Producciones", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207304_e5d8_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-tocar-la-guitarra-electrica/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T15:45:08Z"
}