{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Welcome</strong></p><p>Hello I'm Paul Gronow &amp; this course will walk existing &amp; new guitar students step by step  through beginner to intermediate guitar level &amp; offers you plenty of opportunity to practice what you've learnt following along with backing tracks.</p><p><strong>What You'll Learn </strong></p><p>The Beginner Guitar Lessons by Paul Gronow Course will teach guitar students like you guitar through 5 essential sections:</p><ol><li><strong>Getting started<br></strong></li><li><strong>Guitar chords<br></strong></li><li><strong>Reading &amp; playing rhythm<br></strong></li><li><strong>Chord progressions<br></strong></li><li><strong>E</strong><strong>ssential guitar music theory toolkit</strong></li></ol><p><strong><br></strong></p><p><strong>Section 1: Getting Started</strong><br></p><p>In the Beginner Guitar Lessons Course by Paul Gronow you'll begin by looking at how to set up a successful '<em>How To Study Guitar Programme</em>', that'll help you to establish &amp; set your unique goal/s &amp; the steps you'll want to take.</p><p>Once this is set you'll then move onto looking at the parts of a guitar &amp; tuning the guitar. Then once the guitar is in tune, discover the individual notes on the guitar fretboard (<em>the importance of the Chromatic Scale</em>) &amp; play the notes up to the 5th fret on each guitar string.</p><p>This section will conclude with a useful recap &amp; Quiz.</p><p><strong><br></strong></p><p><strong>Section 2: Guitar Chords</strong><br></p><p>In addition to learning the notes on your guitar fretboard you'll want to learn guitar chords as they allow us guitarists' to create &amp; play songs. </p><p>Firstly, you'll master how to read a guitar chord chart, then work through with me Paul Gronow as you learn to form &amp; perfect chord shapes such as major, minor, Major 7th , 7th, diminished, minor 7 flat 5 &amp; power chords.</p><p>Time is taken to show you how to best form a chord as well as how to move between chords; these tips are priceless &amp; highly effective.</p><p>This section will conclude with a useful recap &amp; Quiz.<br></p><p><strong><br></strong></p><p><strong>Section 3: Reading &amp; Playing Rhythm</strong><br></p><p>Your guitar toolkit will certainly start to grow by this point, what with your knowledge &amp; skills added around, the parts of the guitar, tuning a guitar, chromatic scale, being able to read, form &amp; play many guitar chords &amp; be able to move around a variety of guitar chords.</p><p>This section will take you step-by-step through the essentials of understanding rhythm. This is achieved by looking at what rhythm actually is, learn about &amp; play on your guitar the essential musical notes such as a semibreve, minim, crotchet, quaver &amp; semiquaver. Learn to read rhythm charts as you play along with 27 backing tracks with 27 rhythm patterns; that can be found in music styles such as: Jazz, Rock, Blues, Reggae, Country &amp; Funk styles. </p><p>Learn how to play popular major, minor, 7th, M7 &amp; m7b5 along with guitar tab &amp; a backing tracks with a click track.</p>This section will conclude with a useful recap &amp; Quiz.<p><br></p><p><strong>Section 4: Chord Progressions</strong></p><p>By now you'll be in a place to identify the parts of your guitar, play specific notes on your guitar fretboard, form &amp; play many guitar chords, read, play many popular guitar chords such as major, minor, 7th, M7th, diminished, m7b5 chords. So what's next?</p><p>Well it'll now be time to learn about &amp; apply 5 popular chord progressions across 3 major scales. You'll discover that chords are grouped together into scales, (<em>more about this in Section 5</em>), but for now learn that chord progressions are use to move around the related chords in a scale such as C major, D major &amp; G major.</p><p>By learning this you'll get to hear chords that sound great for you to possibly used to create music &amp; songs &amp; secondly understand a little more about music theory &amp; music composition.</p><p>This section will conclude with a useful recap &amp; Quiz.<br></p><p><br></p><p><strong>Section 5: Essential Guitar Music Theory Toolkit</strong></p><p>By now you'll have all four elements in place;</p><ol><li>Single notes (<em>or melody</em>)</li><li>Chords or (<em>harmony</em>)</li><li>Read, play &amp; create a variety of rhythms</li><li>Be able to select &amp; use one of many chord progressions with the triad chords found within 3 major scales</li><li>???</li></ol><p>Okay, so that just leaves Section 5. So what of it?</p><p>Well, there's one large gap in the learning &amp; that is (<em>for some</em>) the dreaded topic of music  theory!!! Music theory is often seen as the elephant in the room, the topic not discussed, not required, well if you feel that there has been a barrier stopping you learning music theory then I have great news for you!</p><p>For many years I didn't feel comfortable around music theory, it wasn't until I wanted to take teaching guitar a little more seriously in the early 90's that I decided to teach myself guitar music theory...</p><p>Soon enough, I began to discover that it was in fact possible (<em>although if not hard, time consuming &amp; expensive as I had to purchase a lot of books etc to teach myself music theory as a guitarist</em>) if you work hard.</p><p> Many decades on I now understand the benefit of learning the essentials of guitar music theory &amp; particularly from a guitarists perspective; I can now read &amp; play other people's music as well as being able to create my own.</p><p> So why not join me in this beginner guitar course &amp; discover the essential guitar music theory toolkit today...</p><p> <strong>So just what's involved in learning guitar music theory?</strong></p><p>This section will conclude with a useful recap &amp; Quiz.<br></p><p>Learn that the chords we play &amp; the notes we use as musicians are all related &amp; they all stem from the master scale the Chromatic Scale.<br></p><p>In the section you'll discover, that the Chromatic scale is used to form major scales using a scale template &amp; that the chords we use are created using only the notes in the major scale. </p><p>Your guitar music theory education will be developed within the time it takes to work through 15 minutes of study; of course you'll want to start &amp; pause.</p><p>This section will conclude with a useful recap &amp; Quiz.<br></p><p><br></p><p><strong>Beginner Guitar Lessons by Paul Gronow Course Completion</strong></p><p>Okay so if you decide to take this course then at its completion you'll be in a great place to be able to play other people's music as well as make a great start in writing your own.</p><p>I really hope that you believe in yourself to take this course &amp; get to meet me on the inside; after all with Udemy 30 day Money Back Guarantee &amp; the quality &amp; expertise that has been put into this course the Risk is all mine.</p><p>Thank you for taking the time to view the beginner Guitar Lessons by Paul Gronow Course. I really look forward to meeting you on the Inside of this Course. I wish you every success, in learning to play your guitar.</p><p>Please look out for other guitar lessons from me.</p><p>Kind Regards,<br></p><p>Paul Gronow.</p>", 
    "end_date": null, 
    "title": "Beginner Guitar Lessons by Paul Gronow", 
    "price": "20.00", 
    "instructors": "Paul Gronow", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585946_10ba_3.jpg", 
    "course_url": "https://www.udemy.com/beginner-guitar-lessons-by-paul-gronow/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T01:07:54Z"
}