{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>The&nbsp;<strong style=\"\">G4&nbsp;GUITAR&nbsp;METHOD</strong>&nbsp;is based on over 27 years of research and teaching experience. Created by David Hart who began teaching in 1984. David went on to establish a chain of guitar schools called the&nbsp;G4&nbsp;GUITAR SCHOOLS&nbsp;which led to the G4 Guitar Teacher Worldwide Network with guitar teachers in Australia, Canada, USA and Japan.&nbsp;</p><p>What you will receive.</p><p>Included are 6 x ebooks along with 150 minutes of video and some additional downloads. Everything you need.</p><p>Duration</p><p>The course is intended as a 5 week course but may take longer with children.</p><p>Who can do this course.</p><p>It is suitable for children and adults but children should do together with a parent.</p><p>7 Skills<br style=\"\"></p><p>There are 7 essential skills all guitar players need to learn and practice. We have included a dedicated section on each of the 7 skills to ensure students clearly understand each skill. The 7 skills include *Picking *Chords *Arpeggios *Scales *Rhythm *Reading &amp; *Aural. By developing these 7 important areas you will not only master guitar but music in general.</p><p>Checklists</p><p>Part of our secret to success is the use of thoroughly researched levels with checklists that ensure students always know what to practice.&nbsp;The&nbsp;G4GUITAR&nbsp;METHOD COMPLETE KITcontains a total of 11 checklists starting from the absolute beginner up to an intermediate level. We even have a special checklist for the very young beginner.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Beginner Guitar Method", 
    "price": "20.00", 
    "instructors": "Program Director David Hart", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22825_5315_4.jpg", 
    "course_url": "https://www.udemy.com/beginner-guitar/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-14T02:12:56Z"
}