{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Learn all the guitar basics! In this course we will cover everything from parts of the guitar, how to use a tuner, string names and notes, how to hold a pick, how to strum, and learn 4 chords: A,D,G, and E Minor. All of this is taught in an easy to understand format.</p><p>One of the focuses of this course is to learn how to switch between chords in a quick and smooth fashion using visual skills and visual landmarks. I abbreviate some of the chords to make things easier as you are learning. There is also detailed sections on tuning so that you are not playing an instrument that is out of tune. I take you step by step through the process of learning the basics.</p><p>This course is fairly short but sweet, right around 45 minutes. It's a good jumpstart into the world of guitar playing and includes all of the essential knowledge you need to get started. </p><p>The course follows a simple structure with only the basics necessary to begin strumming chords. Straight to the point and simple factual information.</p><p>This course is geared towards someone who just purchased a guitar and needs a solid starting point. Take this course if you are looking for a way to understand all the basics very quickly with a minimum time investment. Adult and kid friendly terminology and vocabulary that makes it easy to follow along. Have fun!</p>", 
    "end_date": null, 
    "title": "Beginner's Guitar: Tuning, Strumming, and Chords!", 
    "price": 0, 
    "instructors": "Daniel Luthjohn", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288854_ed13.jpg", 
    "course_url": "https://www.udemy.com/beginners-guitar-tuning-strumming-and-chords/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-27T10:00:15Z"
}