{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t                        Learn the basic concepts and ideas behind the ideal violin set up and save hundreds or more on costly repairs due to lack of proper maintenance and care.  </p>  <p style=\"\">  \t<strong style=\"\">Ensure A Successful Start to Your Violin Learning Experience</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Find out what gear you need for the best start possible</li>  \t<li style=\"\">Learn how to perform minor repairs</li>  \t<li style=\"\">Recognize common signs of damage and neglect</li>  \t<li style=\"\">Learn how to tune all four strings </li>  \t<li style=\"\">Discover the best ways to maintain and prolong the life of your violin</li>  \t<li style=\"\">And much more!</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Set-up, care, and maintenance are some of the most often overlooked aspects of violin instruction and yet they can completely dictate the course of one&#039;s progress.</strong>  </p>  <p style=\"\">  \t  After taking this course, you&#039;ll feel much more confident in your ability to not only diagnose issues but also prevent avoidable issues from arising. Every beginner course on the violin needs to start with a comprehensive discussion of the &quot;hardware&quot; aspects of the instrument. The violin is an instrument capable of great feats of expression but at the same time (and perhaps because of it) it is also one of the most fragile instruments. Take the guesswork out of what makes your violin &quot;tick,&quot; a happy violin makes for a happy violinist!  </p>", 
    "end_date": null, 
    "title": "Beginner Violin 101: Care, Maintenance, and the Right Gear", 
    "price": 0, 
    "instructors": "Daniel Martinho, BM, MM", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364716_17ee_2.jpg", 
    "course_url": "https://www.udemy.com/beginner-violin-101-care-maintenance-and-the-right-gear/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T17:43:49Z"
}