{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong><em>Want the very best guitar lessons on the web?</em></strong><br></p><p><strong><em>\"This course will teach you how to master your fretboard, understand music theory, and most importantly, how to use these tools to craft your own unique sound.\"</em></strong><br></p><p><strong><em>Watch lecture one (free preview) for a course introduction video</em></strong>.<br></p><p>This course is a multiple part, interactive, step-by-step, all HD video course which teaches you everything you need to play with complete confidence and control in any genre of music!<br></p><p>By the end of this course you will know the foundations and fundamentals of electric blues guitar to create your own style. You will learn how to play with feel but also the theory behind blues guitar. We will start from the basics, go over technique, learn the theory, examine the styles from the blues greats. We will go over chords, scales, and modes, especially the ones used in blues. Learn how to incorporate other styles like jazz, country, and rock to create your own style. We will go over common blues chord progressions and solo over them. We will go over tone, gear, feel, versatility, and stylistic approaches. We will go through techniques from string bending, hammer ons, pull offs, vibrato, legato, and much more. We will go through picking styles like alternative and economy picking. We will go through basic theory like intervals, modes, scales, and chords. You will learn to create your own unique sound and licks. We will study innovative blues players.</p><p>Practice is essential to success. I genuinely care about your personal success and will be happy to answer any questions via email.</p><p>I have been playing and teaching guitar for 10+ years. I was Guitar Center's King of the Blues Southwest district champion meaning I was one of the top twenty competing guitar players picked in the nation. I was also a 3 year store winner in Arizona. </p><p>After completing this course, if you wanted, you will have the tools to be a working professional guitarist... Or, you could just be a great guitar player and have a TON of fun. Either way, I personally GUARANTEE you won't find another course as streamlined, simple, and effective as this one. I've spent my whole professional life crafting this unique approach to the guitar, and I stand by it 100%.<br></p>", 
    "end_date": null, 
    "title": "Blues Guitar Lessons: Play Like the Greats - All Levels", 
    "price": "20.00", 
    "instructors": "Stetson Rylee", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663696_8a24.jpg", 
    "course_url": "https://www.udemy.com/guitar-greats-professional-guitar-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-08T10:06:08Z"
}