{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>In this series of lessons, taught by top UK session guitarist, Bobby Harrison, we’re going to be focusing on soloing over a slow blues.</p><p>You’ve probably heard this kind of playing if you’re familiar with songs such as \"Red House\",\"Texas Flood\", \"How Blue Can You Get\", \"Be Careful With A Fool\", \"The Sky Is Crying”, “Five Long Years”…the list goes on. </p><p>Slow blues is an extremely expressive form of blues, since it allows for a lot of freedom in terms of phrasing and dynamics. </p><p>Since the blues is an improvisational form of music, it’s harder to teach than some other styles. For generations, blues musicians have picked up licks and soloing ideas from other players, so feel free to use the ideas presented here in your own solos. Eventually, like the generations of blues guitarists before you, you’ll make them your own. </p><p>As Bobby mentioned in Blues Guitar Lessons - Volume 1, in order to play blues, you need to be able to hear blues and in order to hear it, you need to listen to a lot of it. The ingredients are pretty straight forward in terms of the scales and chords used, but there’s so much more to this form of music in terms of feel, taste, phrasing and expression.</p><p>Again, put together a play list of your favourite blues songs and listen to it as often as you can to really internalise the style. </p>", 
    "end_date": null, 
    "title": "Blues Guitar Lessons - Volume 2 - Slow Blues Essentials", 
    "price": "30.00", 
    "instructors": "FretHub Guitar Lessons", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/760300_b6cb.jpg", 
    "course_url": "https://www.udemy.com/blues-guitar-lessons-volume-2-slow-blues-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-12T02:47:50Z"
}