{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<hr>\n\n<p>  \t<strong>Would You Like to Supercharge Your Understanding of the Guitar Without All the \"fluff\" That Most Guitar Instructors Teach You?</strong>  </p>\n\n<p>  \t  If you are looking for the best way to quickly advance your guitar skills to the highest level it has ever been then this is the most important online guitar course you will ever have to take.  </p>\n\n<hr>\n\n<p>  \t<strong>What's Inside?</strong>  </p>\n\n<ul>  \t<li>130 lectures/videos with most lectures having a PDF attachment</li>  \t<li>7 hours of video </li>  \t<li>PLUS New Videos added Each month</li>  </ul>\n\n<p>  \t  This is the perfect community for Intermediate players looking to increase their level of skill in becoming an advanced player AND it's also GREAT for existing advanced players as well.  </p>\n\n<hr>\n\n<p>  \t<strong>Who is this guitar course for?</strong>  </p>\n\n<ul>  \t<li>Passionate Guitar Players with a Desire to \"up\" Their Guitar Game</li>  \t<li>Those Players Who Want to Finally Understand the MOST Essential Music Theory Principles, Allowing Limitless Possibilities on Their Fretboard</li>  \t<li>Intermediate and Advanced Players</li>  \t<li>Blues Enthusiasts</li>  </ul>\n\n<hr>\n\n<p>  \t  You Will Be Learning From a Veteran in the Guitar Industry.  </p>\n\n<p>  \t<strong>Erich's Guitar Videos, Ebooks, Online Guitar Courses and Books Have Reached Millions of People All Around the World.</strong>  </p>\n\n<ul>  \t<li>With More Than 30 Million Views on Youtube alone</li>  \t<li>Nearly 30 Years Experience in Teaching and Playing</li>  \t<li>Over 125k Youtube Subscribers</li>  </ul>\n\n<p>  \t  We all know you have to practice to become better at guitar.  </p>\n\n<p>  \t  Most teachers don't have a \"plan\" for beginners to follow for them to see actual results.  </p>\n\n<p>  \t  This course, and all of Erich's courses on Udemy, are laid out in a \"no fail\" order.  So all you have to do is follow the videos in order and put your practice to good use.  </p>\n\n<p>  \t  Erich will teach you the correct techniques and exercises to incorporate into your practice so you begin to establish the <em>Right Practice</em> habits.  </p>\n\n<p>  \t<strong><em>THIS course will get you moving in the right direction.</em></strong>  </p>\n\n<p>  \t  No other advanced course will be like this one.  This course is one of a kind.  </p>\n\n<hr>\n\n<p>  \t<strong>Here are some key highlights to this Advanced Guitar Course:</strong>  </p>\n\n<ul>  \t<li>Knowing construction of chords, gettting to Jam out to any song</li>  \t<li>Having the confidence to go join a band if you choose to</li>  \t<li>Call and Response style guitar becomes second nature to you</li>  </ul>\n\n<hr>\n\n<p>  \t<strong>**Add 5 Bonus Videos on Two-hand Tapping Techniques**</strong>  </p>\n\n<p>  \t  There's really no other advanced guitar course like this anywhere else but here.  </p>\n\n<p>  \t<strong>Get Started Today For Only $99</strong>  </p>\n\n<p>  \t And here's my, no questions asked, money back guarantee!  </p>\n\n<hr>\n\n<h5>There's a 30 Day Money Back Guarantee</h5>\n\n<p>  \t  Is this course for you?  </p>\n\n<p>  \t  Honestly, I have know idea.  And that's why we are offering a 30 day money back guarantee.  </p>\n\n<p>  \t<strong><em>Scroll up and click the </em>\"Take This Course\"<em> button now.</em></strong>  </p>\n\n<p>  \t  WARNING:  <strong>This course is </strong><strong>NOT</strong> for the person who thinks by purchasing this course it will then magically give them all your guitar skills to you without you having to put the time, effort and practice.  It does take practice if you want to see results. :)  </p>\n\n<p>  \t<strong>Get Started Today</strong>  </p>\n\n<hr>\n\n<p><br></p>\n\n<hr>", 
    "end_date": null, 
    "title": "Blues and Advanced Guitar Lessons", 
    "price": "20.00", 
    "instructors": "Erich Andreas", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42251_3b8d_7.jpg", 
    "course_url": "https://www.udemy.com/blues-and-advanced-guitar-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-18T18:36:58Z"
}