{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\"> This is an excellent course that will be extremely useful for anybody from total beginners to intermediate players. </p><p style=\"\">All you need is a C harmonica (10-hole diatonic is best) - and your OPEN ears!</p><p style=\"\">Each video lecture is acompanied by mp3 playalong tracks and the written music with standard notation, harmonica tabs and the words to say.</p><p style=\"\">It starts very easy and will challenge you as you go on - but you will manage it, nothing impossible!<br style=\"\"></p><p style=\"\">The idea behind it is to play&#039; Rhythm harmonica&#039;. Part of the role of a harmonica player is to provide rhythmic backing and that is what this course is all about. </p><p style=\"\">When I was learning trumpet and tabla I realised that speaking the rhythms is a very good way of creating interesting sounds and rhythmic textures. </p><p style=\"\">It also became clear to me as I was trying to teach people how to play like Sonny Terry that using words was a good way for me to explain it and easy thing for people to understand. </p><p style=\"\"> &#039;Chugging&#039; is all about saying, or rather whispering, crazy percussive words into the harmonica like &#039;choo chacka choo&#039;.  Just whisper Choo Chacka, Choo Chacka, Choo Chacka Chooooo into the harmonica and I think you will see what I mean, manage this well and enjoy the rhythm it produces. </p><p style=\"\">You will also learn to play some train sounds.</p><p style=\"\">Everybody likes to play a train whistle and here comes yours. </p><p style=\"\">Exhale to prepare (not through the harmonica), grab holes four and five, breathe in, and articulate the word &#039;WOWW&#039; as you do it.</p><p style=\"\">As you breathe in try to &#039;chew&#039; the sound by moving your tongue and jaw around a bit. Like &#039;wow wow wow&#039;</p><p style=\"\">Don&#039;t forget to pull the imaginary steam train whistle chord as you are coming round the mountain Casey Jones style.</p><p style=\"\">It is starting small and simple but will get up to about 30 lectures. The advantage of getting it now is that it will have a low price and when the other lectures are added you will not have to pay any more! The more lectures it gets the higher the price will go.</p>", 
    "end_date": null, 
    "title": "Chugging - it don't mean a thing if it ain't got that swing!", 
    "price": "20.00", 
    "instructors": "Ben Hewlett", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475914_1eb3_2.jpg", 
    "course_url": "https://www.udemy.com/getchugging/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T10:44:20Z"
}