{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>COMMENT JOUER DU PIANOFORTE</strong>\n\n  </p>\n\n<p><strong>Comment se familiariser avec le pianoforte</strong>\n\n  </p>\n\n<p>1.      <strong>Motivations</strong>\n\n  </p>\n\n<p>Beaucoup de personnes, lorsque vous leur dites que vous êtes professeur de musique, et surtout de piano, tout de suite ils sont intéressés, et ils disent : « je veux apprendre ». Mais dans la plupart des cas vous ne les reverrez jamais. Pourquoi ?\n\n  </p>\n\n<p>Le facteur primordial : <strong><em><u>le temps !</u></em></strong>, Ils n’ont pas de temps. Mais derrière ce prétexte, se cache très souvent un manque de volonté criard. \n\n  </p>\n\n<p>Mais alors quand il y a un seul grain de volonté ! Alors ce sont les frais relatifs très souvent au déplacement pour prendre des cours, qui font défaut.\n\n  </p>\n\n<p>Et quand bien même il pourrait avoir un arrangement du fait des déplacements soit de l’enseignant que de l’apprenant, l’on aura tôt fait de se rabattre sur les prix des cours.\n\n  </p>\n\n<p>Ces cours en ligne viendront à coup sûr remédier à la plupart de ces manquements.\n\n  </p>\n\n<p>2.      <strong>Buts</strong>\n\n  </p>\n\n<p>·         Démystifier l’instrument de pianoforte\n\n  </p>\n\n<p>·         Vulgariser l’instrument de pianoforte\n\n  </p>\n\n<p>·         Encourager les uns et les autres à la pratique de l’instrument de pianoforte\n\n  </p>\n\n<p>·         Jouir des bienfaits de la pratique musicale et instrumentale, en l’occurrence ici, le pianoforte.\n\n  </p>\n\n<p>  <br>\n\n  </p>\n\n<p>3.      <strong>Objectifs</strong>\n\n  </p>\n\n<p>A la fin de ce stage d’apprentissage, vous serez à même \n\n  </p>\n\n<p>·         De lire les notes de musique en clé de Sol et de Fa.\n\n  </p>\n\n<p>·         D’interpréter les signes élémentaires d’une partition\n\n  </p>\n\n<p>·         D’appliquer cette interprétation sur le pianoforte\n\n  </p>\n\n<p>·         De jouer des deux mains à la fois\n\n  </p>\n\n<p>·         De jouer au rythme des battements à la ronde, à la blanche, et à la noire.\n\n  </p>\n\n<p>·         De lire et d’écrire des partitions pour soi-même.\n\n  </p>\n\n<p>·         De jouer des petites pièces de piano des niveaux 5,6, et 7 suivant les nomenclatures des différentes éditions de concours de piano qui se tiennent à travers le monde entier.\n\n  </p>\n\n<p> \n\n  </p>\n\n<p>4.      <strong>Bénéfices</strong> \n\n  </p>\n\n<p>Les bénéfices reliés à l’apprentissage de la musique pour un jeune :\n\n  </p>\n\n<p>«La musique n’a que des effets positifs sur le développement de l’enfant. Les recherches vont souvent dans le même sens : des programmes de musique à l’école ou des écoles spécialisées amènent les enfants à mieux performer dans les autres matières. L’enfant apprend à écouter son jeu, à coordonner ses mouvements, à développer sa mémoire, à affiner sa sensibilité, à s’extérioriser. Il en retire satisfaction et fierté, et augmente, par le fait même, son estime de soi.» \n\n  </p>\n\n<p>Nicole MALENFANT, <strong><em><u>L’éveil du bébé aux sons et à la musique</u></em></strong>, \n\n  </p>\n\n<p>Presses de l’Université Laval \n\n  </p>\n\n<p>La formation musicale amène l’élève à développer diverses compétences touchant les domaines intellectuel, personnel, affectif, physique et culturel.</p>", 
    "end_date": null, 
    "title": "Comment jouer du Pianoforte", 
    "price": 0, 
    "instructors": "Comment jouer du Pianoforte Léopold Mandeng", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823494_1603_2.jpg", 
    "course_url": "https://www.udemy.com/comment-jouer-du-pianoforte/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-16T07:37:30Z"
}