{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<hr style=\"\">  Would You Like to Eliminate Every Struggle That You Are Faced With When Starting to Play Guitar?  <p>  \t     This course is your <strong>\"<em>Free Pass</em>\"</strong> to playing guitar.  <strong>It is the most <em>direct and to the point</em> complete online guitar course.</strong>  </p>  <hr style=\"\">  Follow the Videos in the Exact Same Order and You Will See a Huge Positive Change in Your Playing  <ul>  \t<li>277 Lectures/Videos with PDF Attachments</li>  \t<li>28 hours of video</li>  \t<li>It's available on a PC or MAC and there is a iPad and iPhone app ready to go! (Android app is coming soon).</li>  \t<li>Keeping track of which videos(lectures) you have already watched is a breeze.  Udemy has a great way of keeping track of your completed lessons(lectures).</li>  \t<li>The entire course is organized in step-by-step easy to follow layout</li>  </ul>  <p>  \t     The more you practice the better you will get.  With the <em>Right Practice</em> style you will be able to witness fast results!  </p>  <p>  \t     Erich's teachings are different than all of the other online teachers.  He has made it super easy to be successful at playing guitar.  All you have to do is follow the videos in order and put together some good practice habits.  </p>  <hr style=\"\">  Here is what Renee Martin had to say about Erich's Course: See reviews on right side.  <p>  \t <strong>\"WOW! 0 to 60 in 221 Lessons!</strong>  </p>  <p>  \t     I have learned soooo much from Erich's lessons! I've had my guitar for less than 5 months and I have such a firm foundation and core understanding of the principles and techniques I need. The sky is the limit, If my fingers can catch up to my brain. It will take a lot of practice, but thanks to this Complete Guitar System, I KNOW WHAT to practice and HOW (and why) to do it CORRECTLY!!! I'm on the continuum to being a great guitar player, and I'm loving it!!! It's been a pleasure and I look forward to revisiting many of the lessons since I get to keep them FOREVER!! Thanks Erich for answering all my questions!! You RAWK!\"  </p>  <hr style=\"\">  Who is this Guitar Course For?  <ul>  \t<li>If you are a beginner then this course is perfect for YOU!</li>  \t<li>If you have tried to play guitar before and quite.. then this course is perfect for YOU!</li>  \t<li>If you have or do take personal one-on-one guitar lessons with a guitar instructor and feel like you are not getting the results you feel like you deserve than this course is perfect for YOU!</li>  </ul>  <hr style=\"\">  <p>  \t <strong>Erich's Guitar Videos, Ebooks, Online Guitar Courses and Books Have Reached Millions of People All Around the World.</strong>  </p>  <ul>  \t<li>With More Than 47.3 Million Views on Youtube alone (combining my two Youtube Channels)</li>  \t<li>Nearly 30 Years Experience in Teaching and Playing</li>  \t<li>Over 300,000k Youtube Subscribers</li>  </ul>  <p>  \t     We all know you have to practice to become better at guitar.  </p>  <p>  \t     Most teachers don't have a \"plan\" for beginners to follow for them to see actual results.  </p>  <p>  \t     This course, and all of Erich's courses on Udemy, are laid out in a \"no fail\" order.  So all you have to do is follow the videos in order and put your practice to good use.  </p>  <p>  \t     Erich will teach you the correct techniques and exercises to incorporate into your practice so you begin to establish the <em>Right Practice</em> habits.  </p>  <p>  \t <strong><em>From picking up your first guitar to being able to jam out to songs that you have always dreamed about being able to play on the guitar THIS course will get you moving in the right direction.</em></strong>  </p>  <hr style=\"\">  <p>  \t     Beginner to Advanced and EVERYTHING in between!  </p>  <ul>  \t<li>271 Lectures and 28 hours of Video = $7,000.00 Value</li>  \t<li>PDF Attachments for Almost Every Lecture</li>  \t<li>\"fail proof\" if You Practice and Have a Determined Attitude</li>  </ul>  <hr style=\"\">  **Add 5 Bonus Videos** - That Makes it a Total of 277 Video Lectures!  <p>  \t     Two-hand Tapping Technique Series is a 6 part video series over 20 minutes long.  These bonus videos will help you quickly learn how to start using the two-hand tapping technique.  </p>  <p>  \t <strong>Let's Break This Course Down</strong>  </p>  <p>  \t     How many one-on-one lessons would this course equal out to be if you wanted to have lessons with Erich?  </p>  <p>  \t     This course has 277 lectures which translates into 70 hours of one-on-one lessons.  That would be a total of $7,000.00 for 70 hours of 277 lectures, $100/per hour.  </p>  <ol>  \t<li>There's no way I could charge you $7,000.00 for this course!</li>  \t<li>There's no way I could charge you $3,500.00 for this course.. or even a tenth of that!</li>  </ol>  <p>  \t <strong>It's only $197</strong>  </p>  <p>  \t     And here's my no questions asked money back guarantee.  </p>  There's a 30 Day Money Back Guarantee  <p>  \t     Is this course for you?  </p>  <p>  \t     Honestly, I have know idea.  And that's why we are offering a 30 day money back guarantee.  </p>  <p>  \t <strong><em>Scroll up and click the </em>\"Take This Course\"<em> button now.</em></strong>  </p>  <p>  \t     WARNING:  <strong>This course is </strong><strong>NOT</strong> for the person who thinks by purchasing this course it will then magically give them all your guitar skills to you without you having to put the time, effort and practice.  It does take practice if you want to see results. :)  </p>  <hr style=\"\">  <p>  \t <strong>Get Started Today</strong>  </p>", 
    "end_date": null, 
    "title": "Complete Guitar System - Beginner to Advanced", 
    "price": "30.00", 
    "instructors": "Erich Andreas", 
    "commitment": "27.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42271_886a_6.jpg", 
    "course_url": "https://www.udemy.com/complete-guitar-system-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-18T21:11:03Z"
}