{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>ENJOY FOR A LIMITED TIME FOR ONLY $25! </p><p>Have you ever wanted to learn to play the violin? Have you ever wished there was an easier way to do it, at home, any time of day, having your teacher always available for an advice? Than this course is for you! It is a very convenient way to learn to play the violin, from the comfort of your own home! Just keeping a regular practice routine of 15-20 min a day will let you pick this beautiful instrument quickly and play your favorite songs in no time. As an added bonus, you can send me a video of your performance and I will personally reply pointing out all the accomplishments you have made and the areas on which you can focus more. </p>\n\n<p>Thank you for your interest in this course! I am certain it will truly change your relationship with the violin and help you achieve your dream! Our first reviews have been nothing short of enthusiasm and encouragement. Join this vibrant group of people on your way to play one of the best musical instruments!</p>\n\n\n\n\n\n<p>“Cracking the Violin Code” is an online course which introduces you to violin playing in a very detailed and progressive way. Even if you have no previous experience and knowledge about how the violin works and how we play it, here you will find most of the information you will need: you will learn how to hold the instrument in a most natural way, how to play on all the strings, as well as master a few popular songs. Along the way, I will describe how we read music notation and you will start reading music, however, you will still be able to play the songs at the end, even if your music reading skills are not fully developed (preview lectures 33 and 35).</p>\n\n\n\n\n\n<p>Video violin lessons are a very convenient way to learn to play this beautiful instrument, as you have the freedom to go at your own pace, revisit particular lectures multiple times or skip parts with which you already feel comfortable. This course starts with an introduction of the parts of the violin and the way we make sound. After that, you learn how to hold the bow, followed by a few exercises clarifying the body posture and alignment, which leads to the violin position and the way we support the instrument with the left arm. All of that is explained and demonstrated in detail, with a lot of attention on anatomy and focus on the natural way of using our body. We continue with learning how to play on open strings, emphasizing the different parts of the bow arm movement. As soon as you are comfortable with it, you can start using your left hand fingers, play a few exercises on all the strings and start learning the songs. Since all of the exercises I am recommending are very intuitive, just keeping a regular practice routine of 15-30 min a day would be enough for you to pick them up quickly and help you progress by creating healthy habits.  </p>\n\n\n\n\n\n<p>This online violin program is supplemented with step by step exercises and practice sessions, where I demonstrate and practice along with you, with close-up shots on my hands and fingers. This way, even if something is not very clear in the explanation, you can see it working in action and get all the information you need. If something is still complicated, or if you feel that more detailed video is necessary, you can send me a personal message, or post your question on the discussion board. I, and my associate, Dr. Smiliana Lozanova, DMA, will be happy to answer all of your questions and consider your suggestions on how to make this course better. As a bonus to this course, until July 1, 2016, once a month you will be able to send me a video of yourself playing, and I will personally look at it and give you suggestions on the areas you need to improve, as well as how to do it. </p>", 
    "end_date": null, 
    "title": "Cracking the Violin Code!", 
    "price": "25.00", 
    "instructors": "Dr. Yuliyan Stoyanov, DMA", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657518_9cef.jpg", 
    "course_url": "https://www.udemy.com/learnviolin/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T06:13:37Z"
}