{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>The piano is a very beautiful instrument that most people wish they could play. Unfortunately, one of the reasons stop people from learning:</p><p>1. <strong style=\"\">Cost </strong>- The price to hire a professional piano teacher, someone who really knows what they&#039;re doing is too much of a financial burden for those that really want to learn. It&#039;s easy to spend hundreds or even thousands of dollars learn the skills you need.</p><p>2. <strong style=\"\">Time</strong> - Learning how to play the piano the traditional way requires a lot of time of which most people don&#039;t have. Going to piano lessons three day a week for 1-2 hours is not feasible to most people.</p><p>Because of these two reasons, most people never pursue their passion of learning how to play the piano...until now!</p><p>Finally, the secret is revealed  how to make beautiful music on your piano with or without any prior experience. This course is designed for all levels. So even if you&#039;ve never played a single note your entire life, at the end of this course, you&#039;ll be able to create beautiful music in minutes.</p><p>If you&#039;ve ever wanted to sit at the piano and play something beautiful, then this course is exactly what you&#039;re looking. You&#039;ll learn chords, progression and melody that some of the most popular songs ever created used.</p><p>This is a get to the point course which means that you&#039;ll learn how to use chords and make them sound amazing.</p><p>Benefits of taking this course includes:</p><p><strong style=\"\">1. One to one training </strong>- It&#039;s like having your personal piano teacher sitting next to you and showing you exactly what you need to do.</p><p><strong style=\"\">2. See It In Action </strong>- This is a very interactive course which means that you&#039;ll not just watch but also follow and play along.</p><p><strong style=\"\">3. Virtual Screen</strong> - The latest virtual screen technology is used to help you identify the chords as they&#039;re being played.</p><p><strong style=\"\">4. Pace Yourself </strong>- There&#039;s no need to rush through the course. You&#039;ll be able to watch in the comfort of your home on your laptop, tablet, PC, or any video device.</p><p><strong style=\"\">5. Forum Support </strong>- Have questions? No problem. Post them in the forum and get a fast response.</p><p>Here&#039;s the bottom line, if you&#039;ve ever desire to sit at the piano and play something beautiful, then you need to sign up for this course today. Within minutes, you&#039;ll be on your way to making beautiful music.</p><p>To sign up, click on the TAKE THIS COURSE at the top right hand of this page. It takes less than a minute to sign up. Once you&#039;ve signed up, you&#039;ll get instant access to the course including future lessons and updates.</p><p>NOTE: You have 30 days to try it. If you don&#039;t like it, Udemy will refund your money back...no questions asked! <strong style=\"\">You have absolutely NOTHING TO LOOSE</strong>.</p><p>So what are you waiting for? Sign up today!</p><p> </p>", 
    "end_date": null, 
    "title": "Create Beautiful Music On The Piano Like a Pro In Minutes", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510098_c935.jpg", 
    "course_url": "https://www.udemy.com/create-beautiful-music-on-the-piano-like-a-pro-in-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-24T09:56:41Z"
}