{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>El curso de \"Guitarra Española\" será un viaje que comenzará desde cero, para apoyar la tesis de aquellos que dicen: \"No sé nada de nada\";\"No tengo oido musical\";\"Los ritmos se me dan fatal\"; \"Lo he intentado muchas veces y no he podido\" y sabemos que cuando hayas acabado el curso apoyarás a los que dicen: \"No  tan difícil\";  \"Lo he entendido en poco tiempo\";  \"Con la práctica cotidiana se avanza muchísimo\". <br></p><p>Si eres constante, te aseguro que verás los resultados en menos de lo que imaginabas. Ello no significa que será un camino facil. Nunca nada lo ha sido. Sin esfuerzo no hay logros. Sin embargo este curso está diseñado para que logres tus objetivos sin <br>prisa, tu mismo marcas tus tiempos y metas, a fin de cuentas siempre lo tendrá ahí.</p>\n\n<p>Un primer módulo estudiaremos aquellas cuestiones que nos parecen importantes para entender este instrumento. No se trata solo de colocar figuras con los dedos en el diapasón, sino además entender por qué lo ponemos de una u otra forma. La colocación correcta, la organización de las notas musicales, los fundamentos teóricos y el <br>lenguaje musical son algunos aspectos que trataremos en este primer Tema.</p>\n\n\n\n<p>Un segundo módulo estudiaremos los Acordes Mayores, su estructura armónica y cómo colocarlos en el diapasón.</p>\n\n\n\n<p>Un tercer módulo estará dedicado a los Acordes Menores y al final veremosun resumen de los 24 acordes estudiados.</p>\n\n\n\n<p>El cuarto módulo estudiaremos algunos ritmos genéricos que nos permitirán tocar nuestros temas preferidos. <br></p>", 
    "end_date": null, 
    "title": "Curso de Guitarra para Principiantes", 
    "price": "20.00", 
    "instructors": "Sr Raúl González", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/852426_ea08_3.jpg", 
    "course_url": "https://www.udemy.com/curso-de-guitarra-para-principiantes-p/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-17T22:13:34Z"
}