{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course will teach you all the basics of playing the Darbuka Dounbek Goblet drum originating in the Middle East. The drum dates back over 2000 years ago to it's beginnings in Babylon. Learn how to play this fascinating instrument. It has a sharp crisp clear sound that makes you want to dance. Over an hour of video instruction by master middle eastern musician Malik Terblizi, hosted by Somesh De Swardt. It's an interactive teaching experience. The course takes place in 5 sections starting right at the beginning of learning the basics until basic rhythms and exercises. Both beginner and intermediate players will have plenty of substance to further their study and playing ability. Take this course if you are interested in learning how to play and improve your technique. Finding teachers for this instrument isn't easy, but with this course you can learn at your own speed and in your own time.</p><p>Malik Azeri is a master percussionist, vocalist and producer who plays Nagara, Darbouka, Daf, Tombak &amp; Congas. His music is influenced by a variety of Middle-Eastern, South Caucasus and Latin traditions. Since moving to London he has worked with oriental, hip-hop and contemporary dancers and has given master classes and performed in concerts and festivals throughout the country and worldwide. Through an exploration of different ethnic rhythms and fusion music Malik has created a unique personal style through which he hopes to reflect unity in diversity.<br></p>\n\n<p>Many thanks to Malik for his amazing playing and to Theo at Inclusive Video http://www.inclusivevideo.com for their production of the video.</p>", 
    "end_date": null, 
    "title": "Darbuka Drumming: Learn how to play the Darbuka Dounbek", 
    "price": 0, 
    "instructors": "Percussionist Somesh De Swardt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/829962_8421.jpg", 
    "course_url": "https://www.udemy.com/learning-the-darbuka-dounbek-drum/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-23T12:07:12Z"
}