{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">It really does not matter if you&#039;ve never picked up a guitar before, or what age you are, you just need to enthusiastic about learning to play</p><p style=\"\">I&#039;ve drawn on all my expertise and experience to ensure you make maximum progress in the shortest possible time and I would be delighted if you now take your first steps towards mastering this wonderful instrument using some of my favourite simple pieces.</p> My aim at the end of this course is for you to perform some or all of the music you have learned to family and friends<strong style=\"\"></strong> <p style=\"\">Let me take you through the course.</p><p style=\"\">We begin by learning to play Parts 1 and 2 of Malaguena,. exciting music from Spain.</p><p style=\"\">We then take a look at technique, I&#039;m sure you want to play at an advanced standard so this a is really important lesson.</p><p style=\"\">Next comes a simplified version of Cascade which is romantic in style and introduces you to a right hand finger pattern called an arpeggio.</p><p style=\"\">And then 3 descriptive very pieces, The Spider, In the Garden and Playtime.</p><p style=\"\">Numerous scientific studies have proved that playing an instrument has huge benefits and enhances general educational learning as well as being incredibly enriching, not only that but playing the guitar is a great way for you to make new friends.</p><p style=\"\">You don&#039;t even have to read music to take this course. In addition to all the video lessons, every piece of music you will be playing is writtenout in very easy to understand TAB form as well as standard music notation for those of you who can already sight read. </p><p style=\"\">I&#039;ve also written course notes to complement the video lectures. </p><p style=\"\">I absolutely believe learning has to be fun and I look forward to you joining me on this enjoyable and adventurous journey.</p>", 
    "end_date": null, 
    "title": "Discover Classical Guitar Level 1", 
    "price": "20.00", 
    "instructors": "David Green", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464844_4c22_2.jpg", 
    "course_url": "https://www.udemy.com/discover-classical-guitar-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T09:46:12Z"
}