{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>This course's material is equal to 25+ private piano lessons.</strong><br></p><p>This course is different than all the other piano courses you've seen. It has technique, terminology, practice, quizzes and fun! This is the way to start your piano journey!</p><p>This piano course is designed for kids and will give you parents a chance to become your kid's first piano teacher. This beginner level course teaches :</p><ul><li>Pre-reading : Playing according to finger numbers without the knowledge of notes</li><li>Basic musical terminology ( dynamics such as piano,forte,crescendo , time signatures , playing legato and staccato etc. )</li><li>Rhythm : different note and rest values </li><li>Staff : How the notes are aligned , drawing Treble and Bass clefs</li><li>Notes : Reading notes in both Treble and Bass clefs, intervals</li><li>Play : Starting from easy piano pieces and at the end of the course you will be playing easy versions from Beethoven, Mozart, Bach and Haydn.</li></ul><p>In this course , I used</p><ul><li>Videos            : in which I show you how to play on the piano. </li><li>E-Book          : there is an downloadable e-book that I prepared for this course and we will                             follow throughout this course. </li><li>Quizzes        :  to test you if you were following the course properly. </li><li>Worksheets :  you can print for each section as additional study material.</li></ul><p>The material in this course is equivalent to 4 months of private lessons. If you follow this online course regularly it will take 5-8 weeks.</p><p>If your kid wants to play piano and you want to try if he/she really wants it before giving a lot of money to hire a private piano instructor, this is the course you are looking for. You can easily teach your kid piano by following the instructions in the videos and the book.</p><p>I hope you will have a great time learning together!</p>", 
    "end_date": null, 
    "title": "Easy Piano for Kids - Complete Beginner Piano Course", 
    "price": "35.00", 
    "instructors": "Dilhan Sener", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476000_0437_3.jpg", 
    "course_url": "https://www.udemy.com/easy-piano-for-kids-pinogi/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T12:40:55Z"
}