{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>COURSE UPDATES:</strong></p>\n\n<ul><li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p><br></p>\n\n<p><strong>COURSE DESCRIPTION:</strong></p>\n\n\n\n<p>In this series, MusicProfessor instructor Dr. Shauna Thompson guides you through the entirety of three intermediate flute solos \"The Swan,\" \"Mozart Mineuts,\" and \"Telemann Minuet.\" Learn the important musical, rhythmic and stylistic elements of each piece in various tempos, while also learning how to practice and perform. </p>\n\n\n\n<p>If you're looking to improve your Flute skills, MusicProfessor provides the perfect easy, online way to do it! Private lessons cost anywhere from $30 - $100/hr, and as you improve, unfortunately, so does the cost of lessons. Each MusicProfessor Flute course provides an entire year's worth of instruction, for a fraction of the cost, and at your own convenience. Plus, each course is taught by an industry leading instructor! </p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>COURSE FEATURES:</strong></p>\n\n\n\n<ul><li>Over 60 video lessons</li><li>Downloadable sheet music for each lesson</li><li>Master three rewarding, fun Flute solos</li><li>Extend your abilities with multiple warm-up exercises</li><li>Learn how to troubleshoot difficult fingering passages</li><li>Learn how to improve finger speed and accuracy </li><li>Review multiple complicated rhythms</li><li>Master vibrato technique</li><li>Discuss trouble areas and troubleshooting techniques</li><li>Learn how to break down each piece into manageable practice sections</li><li>Play each etude at various tempos, including a final performance tempo</li></ul>\n\n\n\n<p>MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy's 30-day guarantee. </p>\n\n\n\n<p>Fulfill your musical destiny by enrolling today! </p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>ABOUT THE INSTRUCTOR:</strong></p>\n\n\n\n<p>Shauna Kay Thompson is Assistant Professor of Flute at Texas Christian University. She holds a DMA and a MM in flute performance from the University of Cincinnatis College-Conservatory of Music where she studied with Brad Garner and served as his teaching assistant. She completed additional studies with Randy Bowman of the Cincinnati Symphony. Dr. Thompson also received a Bachelor of Music from Texas Tech University where she studied with Lisa Garner Santa. Prior to joining the TCU faculty Dr. Thompson served as consortium instructor of flute at the University of Evansville and principal flute with the Evansville Philharmonic Orchestra. Dr. Thompson has previously been the principal flute of the Lubbock Symphony Orchestra and second flute with the Midland Odessa Symphony Orchestra.</p>\n\n\n\n<p>Dr. Thompson won the 26th annual Myrna Brown competition with the Texas Flute Society and was honored to return as a guest artist to their 2012 convention. She is also prize winner of many other competitions including the Pittsburg Flute Club Young Artist, National Flute Association, Frank Bowen, Claude Monteaux, and MTNA. Other performance highlights include a duet with Carol Wincenc at the Texas Flute Society convention, playing for James Galway, and multiple concerto performances.</p>\n\n\n\n<p>— </p>\n\n\n\n<p><em>This course has been provided by MusicProfessor, an online music education company.</em></p>", 
    "end_date": null, 
    "title": "Flute Solos: Learn how to Perform Three Fun, Unique Pieces", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618586_3234.jpg", 
    "course_url": "https://www.udemy.com/flute-solos/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T22:57:06Z"
}