{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tIn this course you will learn universal tools that you can apply on just any song! You´ll start of with the basics like the names of the keys, how meters work, fingering, tempos,how to use the pedal, etc. Then you´ll move on to learn songs in three “steps” starting with melodies in the right hand, adding bassnotes in the left and finally put chords to the songs. This will be based on a system which I call ”the sing-and-play-way”, meaning that you should first learn to sing the music, then sing and play it, THEN play it without singing it. In this way you will learn to “sing” with you instrument which according to me is the absolute best and most effective way. Wouldn&#039;t it be great if you could play all the songs that you can sing??  </p>  <p style=\"\">  \t  You will also learn scales, about  a lot of different chords and how to practice them, and also the wonderful pianostyles of stridepiano(jazz from the 30´s) and salsa!  </p>  <p style=\"\">  \t------------------------------------------------------------------------------------------------------------------------  </p>  <p style=\"\">  \tDown below follows some important tips for ANYONE interested in learning how to play. I hope that you´ll find this useful! :)  </p>  <p style=\"\">  \t  1. THE MOST COMMON MISTAKE is to believe that music comes from your fingers playing. The music comes from inside of you and COMES OUT through your fingers.  </p>  <p style=\"\">  \t  2. YOU CAN AVOID THIS MISTAKE by three simple steps: 1: Sing, 2: Sing &amp; play 3: Play.  </p>  <p style=\"\">  \t  3. ONE OF THE BIGGEST SECRETS is actually very easy. Always notice where you&#039;re going and prepare yourself for the next step. I talk about this in the presentation video (free). Don&#039;t miss out, this is so important.  </p>  <p style=\"\">  \t  4. THE WAY TO PRACTICE THAT NO ONE TALKS ABOUT is to practice &quot;backwards&quot;. It might sound strange at first, but not if you think about it. If you&#039;re practicing starting from the beginning all the time, what will you learn best? The beginning of course! But as the song goes on you get more and more insecure. Start to practice the end of the song (or the end of the part that you want to learn) first. You will learn the beginning anyway, for sure. This is how most students waist their time, including myself once.  </p>  <p style=\"\">  \t  5. TAKE A COURSE ONLINE  </p>  <p style=\"\">  \t  Ok, this might sound a little bit cheesy coming from me, being the creator of this course. But I sincerely believe that this kind of teaching is the future. It has so many advantages in the possibilities to watch the videos over and over, the visual aspect and the ability to bring the lessons to you whenever you want and where you want.  </p>  <p style=\"\">  \t  Well, that was some advices from me. I hope that I´ll see you in the course!  </p>  <p style=\"\">  \t  Take care! :)  </p>  <p style=\"\">  \t  //Peter  </p>", 
    "end_date": null, 
    "title": "Get Piano Skills TODAY!!! ", 
    "price": "20.00", 
    "instructors": "Peter Nydahl", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326310_ef25_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-play-piano2/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T10:48:29Z"
}