{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">This course shows you the basic principles you will need in order to start playing blues harmonica. It is designed for the absolute beginner who may or may not already own a harmonica. Most importantly you have the desire to play but are not entirely sure how to go about it.<br style=\"\"><br style=\"\">Maybe, you have already bought a harmonica and assumed it was super simple to play but then quickly discovered that those soaring blues licks sound a little weird or muddy when you try to do them. That&#039;s why I am here. To explain the basic fundamentals which you need in order to do anything and progress on the instrument.<br style=\"\"><br style=\"\"><strong style=\"\">You will learn;</strong></p><p style=\"\"><br style=\"\">- what kind of harmonica you need (harmonica in C) <br style=\"\">- how to hold it <br style=\"\">- how to read harmonica music<br style=\"\">- how to play clean notes and some simple melodies <br style=\"\">- how to play chords and keep time <br style=\"\">- what a 12 bar blues is and how to start improvising over one!<br style=\"\"><br style=\"\">I approach teaching this course assuming that you do not know any technical jargon yet so will share some with you if and when it is appropriate.<br style=\"\"><br style=\"\">You also do not need to know how to read music or already play another instrument.<br style=\"\"><br style=\"\"><strong style=\"\">You will be provided with;</strong><br style=\"\"><br style=\"\">- harmonica tablature (this is how harmonica music is written down)<br style=\"\">- audio examples for you to practice along to<br style=\"\">- explanation videos<br style=\"\"><br style=\"\"><strong style=\"\">How long will it take?</strong><br style=\"\"><br style=\"\">If you sat down and played the course through in one sitting it would not take very long but that is not really the point. I really recommend that you spend around a month working on the various aspects of the instrument that I have shown you so that they become a strong foundation for you to build on.<br style=\"\"><br style=\"\">Things like playing clean notes consistently take a little while to become completely ingrained in your muscle memory. So, to start with I am expecting practice - little and often.<br style=\"\"><br style=\"\">If, during the course you are having difficulties with anything, just give me a shout!</p>", 
    "end_date": null, 
    "title": "Get started playing blues harmonica", 
    "price": 0, 
    "instructors": "Tomlin Leckie", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409818_39f6_3.jpg", 
    "course_url": "https://www.udemy.com/get-started-playing-blues-harmonica/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T10:09:02Z"
}