{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<hr>\n\n<h5>Eliminate All the Major Struggles When Getting Started With Playing Guitar</h5>\n\n<p>  \tThis course is the most <strong>\"Direct and To the Point\"</strong> course for <u>ANY</u> guitar player to watch and learn.  </p>\n\n<p>  \tFinding 2 Hours of Quality Guitar Lessons that can be accessed <em>anywhere</em> for FREE and at <em>any time</em> of the day is hard to come by these days.  </p>\n\n<p>  \tThis free course solves all of those problems.  </p>\n\n<hr>\n\n<h5>Follow the Videos in the Exact Same Order and You Will See a Huge Positive Difference in Your Playing</h5>\n\n<p>  \t<strong></strong>  </p>\n\n<ul>  \t<li>Over 2 hours of Video and PDF attachments for most Lectures</li>  \t<li>Access this course 24/7, Mac or PC, Iphone or Ipad (Android coming soon)</li>  </ul>\n\n<p>  \tEstablishing solid core practice habits helps the speed of your results and also the quality of your results.  </p>\n\n<hr>\n\n<h5>You'll Go From First Time User, Picking Up the Guitar, to Chord Transitioning AND Everything in Between Including the 9 Most Essential Chords</h5>\n\n<ul>  \t<li>Erich Andreas is Consider a Top 5 Online Guitar Teacher</li>  \t<li>With <strong>more than 123,000</strong> Youtube subscribers and <strong>over 31 Million</strong> views his teachings have been able to reach Millions of people all around the world</li>  </ul>\n\n<p>  \tThe built in learning center allows you to track which videos you <strong>have or have not</strong> seen or watched.  This is a great feature that gives the student the ability to learn at their own pace.  </p>\n\n<h5>Still undecided?  Check out the value that's in this course.</h5>\n\n<p>  \t23 Lectures equals out to be 6 hours of one-on-one lessons with Erich.  That holds a value of $600 ($100/hr) and you get all of these videos, lectures, and PDFs for FREE.  </p>\n\n<ul>  \t<li>Nearly 30 years of guitar experience both teaching and playing</li>  \t<li>Incredible $600 value for Free</li>  </ul>\n\n<hr>\n\n<h5>Add 2 <em>Bonus Videos</em> - That Makes it a Total of <u>25</u> Videos!</h5>\n\n<p>  \t<strong>Special Tip:</strong>  You're also the first to be notified about any promo codes for any of my other Udemy courses but you have to become a student of this free course to receive these special one-time promo codes.  </p>\n\n<p>  \t<strong>In all honesty, you can't find a hook-up as good as this anywhere else. 25 videos that will quickly help <u>anyone</u> get started with playing guitar ALL for Free.</strong>  </p>\n\n<p>  \tMy guarantee is that you will see great guitar results if you follow this course and put in the practice.  </p>\n\n<p>  \t<strong><em>Scroll up and click on the </em>\"Start Learning Now\"<em> button.</em></strong>  </p>\n\n<p>  \tCheck out what our students have to say.  Read the reviews.  </p>\n\n<hr>\n\n<h5>Get Started Today</h5>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Getting Started with Playing Guitar", 
    "price": 0, 
    "instructors": "Erich Andreas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41884_8039_4.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-playing-guitar/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-16T00:20:15Z"
}