{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">This course begins with an introduction of me showing that you can go from zero knowledge of the guitar, to playing awesome blues riffs that everyone will tap they´re foot to.</p><p style=\"\">You´ll realise that playing the guitar is much easier then you thought, regardless of previous fear and doubt that might have been stopping you until now.</p><p style=\"\">I walk you through all the elements that you´ll need to know in order to play those groovy blues riffs you´ve always been dreaming about.</p><p style=\"\">Each short, intense (and sometimes funny) lecture helps you learn about different aspects of playing the guitar (not just blues). </p><p style=\"\">Every lecture has a supported guitar playalong, so that you can watch and listen to me, while playing along at home. This way, you´ll never get lost, and you can listen to the track as many time as you need to.</p><p style=\"\">You have the opportunity to become the guitar player you have always dreamed of. The lessons in the course are designed to teach the blues, but much of the lessons can be used in any other style that you want to play. </p><p style=\"\">Throughout the course, you&#039;ll have the opportunity to ask me questions and get quick support. This way you´re never alone, I´m always cheering you on!</p><p style=\"\">By the end of this course, you&#039;ll know what you need to play guitar riffs with confidence and pride. You´ll be able to pull out your guitar and friends/family will be shocked by the fast and amazing progress you made in such a short period time. </p>   ", 
    "end_date": null, 
    "title": "Guitar - Blues Guitar for Beginners", 
    "price": "20.00", 
    "instructors": "Henry Olsen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476988_a197_16.jpg", 
    "course_url": "https://www.udemy.com/beginner-blues-guitar/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T11:44:44Z"
}