{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Learn to construct and play basic triads, basic 7th chords, inversions, optional voicings, and power chords on your guitar. Become a guitar Jedi!  <strong>Enroll Now!</strong>  <em>Course Creation March 7, 2016</em></p><p>Over <strong>1,0</strong><strong>00 students</strong> enrolled!<br></p><p><strong>Gain more freedom and a greater feel for guitar by learning how to visualize chord structures anywhere on the guitar neck.</strong></p><ul><li>Learn the foundational role of basic triads</li><li>Learn how to play 7th chords and inversions anywhere on the guitar neck</li><li>Learn the effectiveness of power chords and barre chords</li><li>Understand why certain notes work so well together on the guitar</li></ul><p><strong>Content and Overview</strong></p><p>Have you learned the basics of open and moveable chord shapes on guitar, but aren't sure how or why the individual notes within a chord work so well together? Are you unsure of the ways by which you can develop this chord knowledge to unlock the mysteries of the guitar fretboard?</p><p>In this course, I'll help you obtain a better knowledge of the guitar fretboard. We'll explore how notes relate to each other when they are combined. I will also guide you to understand how you can expand your knowledge and build on what you already know. </p><p>This will assist you to focus less on the shape of an individual chord, and more on the notes that the chord is based around. We will also pay close attention to the sound of each chord. This will give you more freedom and command of your instrument - the guitar!</p><p>By the End of the Course You Will Be Able to:</p><ul><li>play various chord voicings up, down, and across the guitar neck</li><li>have a greater knowledge of constructing triads, 7th chords, inversions, and power chords</li><li>play and know the voicings of various chord qualities such as major triad, minor triad, diminished triad, augmented triad, suspended triads, dominant 7, and minor 7</li><li>have a greater knowledge of Cycle 4 and how it relates to the guitar</li></ul>", 
    "end_date": null, 
    "title": "Guitar Chord Riot! Learn to Play Guitar Like a Guitar Jedi", 
    "price": "45.00", 
    "instructors": "Pippin Jag", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783292_1b38.jpg", 
    "course_url": "https://www.udemy.com/guitar-chord-riot-learn-to-play-guitar-like-a-guitar-jedi/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T18:15:36Z"
}