{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Welcome to the &quot;Eatmystrings - Guitar Insanity Workout&quot;</strong>  </p>  <p style=\"\">  \t  This course will help you develop guitar-picking techniques through  guitar picking exercises<strong style=\"\">, master  pentatonic shapes, modes and arpeggios! It will work for beginners as well as  advanced guitarists.</strong>  </p>  <p style=\"\">  \t  First, you will start from 85 BPM with simple warm-up guitar exercises,  then it will move to 5 E minor pentatonic shapes, scales and the last technique  would be sweep.  </p>  <p style=\"\">  \t  Don&#039;t skip the slow part because this is how you will get the best  workout! The slower you do it, the more control you have over your hands!  </p>  <p style=\"\">  \t  Play through section 1 every day once a week. You will notice the  improvement on your right hand touch and will have full control over your  hands!  </p>  <p style=\"\">  \t<strong style=\"\">Once you feel  comfortable with section 1, start working on section 2 (100 BPM), and continue  your daily workout on section 1</strong>  </p>  <p style=\"\">  \t  When you get to section 2 you will notice different and more complicated  pentatonic licks and instead of 5 pentatonic shapes, we will get into 7 modes  from G major scale to 6 string arpeggios.  </p>  <p style=\"\">  \t<strong style=\"\">Start adding exercises from part  2 into your daily workout and keep practicing part 1 daily!</strong>  </p>  <p style=\"\">  \t  It will take some time to master part 2, but pretty soon you will start  seeing results!  </p>  <p style=\"\">  \t<strong style=\"\">Once you are comfortable playing  through section 2 move on to section 3 (120 BPM)</strong>  </p>  <p style=\"\">  \t  Section 3 is the final part of the workout and will help you polish your  technique and make all the transitions smooth! It contains a new set of warm up  licks, all 7 modes and sweep arpeggios.  </p>  <p style=\"\">  \t  Gradually start adding section 3 to your daily workout and continue  practicing sections 1 and 2.  </p>  <p style=\"\">  \t  By the time you get to the third section you will see a difference in  your playing!  </p>  <p style=\"\">  \t  After completing section 3, practice this workout daily. After all the  shapes are mastered and desired level is achieved, you can use part 3 as a  daily warm-up!  </p>  <p style=\"\">  \t  &lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "Guitar Insanity Workout - Eatmystrings!", 
    "price": "50.00", 
    "instructors": "Alex Feather Akimov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20387_6e6d_3.jpg", 
    "course_url": "https://www.udemy.com/eatmystrings-guitar-insanity-workout/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-30T02:33:58Z"
}