{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">&quot;Guitar Kick Start&quot;</strong> with Rick Spurgin is a great way to get started!  This is a free course designed for the very beginner with over 20 video easy to follow examples along with printable PDFs.  </p>  <p style=\"\">  \t You will start off learning the basics such as, what kind of guitar is right for you, the differences between electric and acoustic guitars, how to hold your guitar and how to properly tune it. You will then learn how to read chord graphs and some easy form chords along with strumming exercises to build your skills. <strong style=\"\">“Guitar Kick Start&quot;</strong> is a great way to start your journey in playing guitar and will give you a taste of what&#039;s to come.  </p>  <p style=\"\">  \tAfter completing <strong style=\"\">“Guitar Kick Start&quot;</strong> the next step will be to join <strong style=\"\">“Introduction to Guitar&quot;. </strong>Here you will then begin to learn more chords and practice with commonly used chord progressions to develop your chord knowledge. In this course you will learn how to read TAB, rock power chords, and how to play a 12-Bar Blues. At the end of this course you will have the skills that you always wanted to be able to play your favorite songs.  </p>  <p style=\"\">  \tEveryone learns at a different pace. Be patient. Allow yourself plenty of practice time to properly develop your new guitar skills.  </p>  <p style=\"\">  \tThese courses have small easy to comprehend video lectures to practice with. This will allow you to work a little at a time or keep going if you like a faster pace.  </p>  <p style=\"\">  \tIf you always wanted to learn the guitar, but just didn&#039;t have the time or the budget for private lessons, this is the course for you.  </p>", 
    "end_date": null, 
    "title": "Guitar Kick Start", 
    "price": 0, 
    "instructors": "Rick Spurgin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385684_4682_4.jpg", 
    "course_url": "https://www.udemy.com/guitar-kick-start/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T14:30:46Z"
}