{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Our brand new course for beginners and intermediates has been designed to ensure that beginners learn correctly from and avoid bad habits that slow down progress, and shows you intermediate players exactly how to correct any bad habits that you may have already picked up and seriously speed up your learning, taking your playing to the next level!</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>For beginners we will set you off on the right foot by showing you how important structure is to your learning! We start by taking you through a cool rock song to get you picking properly and stretching the fingers across the neck, followed by adding the ultimate rock chords and playing through the entire song! We then take you through open chord changes, how to strum properly and finally apply everything we have learnt to a challenging song that you can master! This course is perfect for any beginner, wether they have acoustic, electric guitar, young or old!</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>For intermediates we will show you how to play an awesome blues solo using the classic rock and blues scales that will open the door to your own improvisation. We then show you a simple trick that will immediately allow you to solo over every single key, in just a few minutes! We then bring our attention to expanding your chords and even learning how Hendrix played chords and lead all at the same time! Finally we finish up with a ‘how to improvise’ video where we demonstrate how you apply everything you have learnt to your own soloing. </p><p>Above all else this course is fun, engaging and makes the whole process of learning exiting! After every lesson you will feel you have improved and can give yourself a massive pat on the back!</p>", 
    "end_date": null, 
    "title": "Guitar Lessons: The Essential Beginner & Intermediate Course", 
    "price": 0, 
    "instructors": "Dan Holton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/873386_8e09.jpg", 
    "course_url": "https://www.udemy.com/guitar-lessons-the-essential-beginner-intermediate-course/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-09T13:33:56Z"
}