{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course is filled with 10 short and sweet lectures. I´ve been teaching guitar on a daily basis for the last 4 years. Through out that time I´ve leaned the secrets to helping students just like you learn in the most fast and easy way possible. I understand the problems you are going through and This course is going to give you lot´s of the answers you´ve been looking for.</p><p>I also included a FREE BONUS!</p><p>As soon as you sign up to this course, you will be able to download my 42 page picture chord book!</p><p>This chord book is filled with coloured pictures of all the chords you will need in order to play all the chords to your favourite songs.</p><p>You have the opportunity to become the guitar player you have always dreamed of. The lessons in the course are designed to teach the chord progressions that nobody can resist. After taking this course, friends and family will be begging you to <em style=\"\"><strong style=\"\">\"play just one more, please!\"</strong></em></p><p>Throughout the course, you'll have the opportunity to <em style=\"\"><strong style=\"\">ask me questions</strong></em> and <em style=\"\"><strong style=\"\">get quick support</strong></em>. This way you´re never alone, I´m always cheering you on!</p><p>By the end of this course, you'll have a clear understanding of how chords fit together and you´ll also be equipped with lot´s of new strumming patterns to keep you having fun for years and years to come!</p>", 
    "end_date": null, 
    "title": "Guitar:10 Ways Beginners Can Make Fast Progress On Guitar", 
    "price": 0, 
    "instructors": "Henry Olsen", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515258_fc68_3.jpg", 
    "course_url": "https://www.udemy.com/10-guitar-secrets/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T06:09:39Z"
}