{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t  This course is dedicated to <strong style=\"\">absolute beginners </strong>of the guitar who are <strong style=\"\">highly skeptical </strong>of the quality and credibility of the other stuff out there on the Internet.  </p>  <p style=\"\">  \t  This course was designed, edited and reviewed by professionals, including experts in Online Learning and graduates from Berklee College of Music. In this course you will learn the <strong style=\"\">groundwork </strong>for your <strong style=\"\">first three months </strong>of playing the guitar.  </p>  <p style=\"\">  \t  You will learn <strong style=\"\">fundamental skills </strong>of guitar playing, the same that are taught by the world&#039;s best teachers.  </p>  <p style=\"\">  \t  You will begin on the path to:  </p>  <ul style=\"\">  \t<li style=\"\">Read and understand <strong style=\"\">real sheet music</strong> instead of only learning tab.</li>  \t<li style=\"\">Learn the established music tradition of <strong style=\"\">ear training </strong>that will eventually allow you to play all of the music you hear without any written notation.</li>  \t<li style=\"\">Learn to express yourself by <strong style=\"\">improvising your own guitar solos</strong>. </li>  \t<li style=\"\">Learn to <strong style=\"\">accompany </strong>another musician by playing the chords to your favorite songs.</li>  </ul>  <p style=\"\">  \t    This course, presented by Grey, a graduate from Berklee College of Music and professional guitar teacher, will guide you through the first steps of playing the guitar.  </p>  <p style=\"\">  \t    By the end of the course, you will know how to:  </p>  <p style=\"\">  \t    • Play the notes of music you hear by ear only  </p>  <p style=\"\">  \t    • Play the chords for dozens of songs, and use special techniques to adapt other songs to the chords you already know, allowing you to play 100&#039;s more.  </p>  <p style=\"\">  \t    • Read real sheet music instead of just numbers printed on a line.  </p>  <p style=\"\">  \t    • Improvise your own melodic guitar solo over the included karaoke-style backing track.  </p>", 
    "end_date": null, 
    "title": "Guitar Crash Course (No Experience Necessary)", 
    "price": 0, 
    "instructors": "Hub Guitar", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315576_89b8_3.jpg", 
    "course_url": "https://www.udemy.com/hub-guitar-crash-course/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T05:41:44Z"
}