{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Join Over 2,000 + Successful Students Have Taken This Course!</strong></p>\n\n<p><strong><br></strong></p><p><strong>Order Now ! Price Increase 7/1/16!!!</strong></p><p><strong><br></strong></p><p><strong>Going up Stop Spinning Your Wheels! Take decades off your mastering the guitar!</strong></p>\n\n<p>Are you tired of random, disorganized lessons that throw a handful of chords shapes at you and expect you to memorize them without any system to help you remember them?</p>\n\n<p>Still Feel Like You can't connect the dots, or see the big picture?! </p>\n\n<p><br></p>\n\n<p>You are not alone!</p>\n\n<p><br></p>\n\n<p>The Problem....</p>\n\n<p>Common Approaches To Learning Guitar Lead To Common Problems And Mediocre Playing...</p>\n\n<p>The common approach to learning guitar (which almost all books, videos, and courses teach). approach teaching guitar it the same way...starting with open chords, barre chords, scale boxes.</p>\n\n<p>This may help new guitar players up and running fast, but then you hit a BRICK WALL!</p>\n\n<p>This common approach leaves you \"Sounding Like\" you know what you are doing (to untrained ears)</p>\n\n<p>But...</p>\n\n<p>Not \"Actually Knowing\" what you are doing!</p>\n\n<p>This means there is a locked door in front of you which stops you from Creating the music you want to create, and the way you wanto create it.</p>\n\n<p>This leads to other problems such as lack of confidence, or the feeling of \"Faking It\". You can play a song,  but could you come up with it?</p>\n\n<p>The Irony is that it takes the same amount of time to be a good guitar player as it does to be an average, uninspired, or frustrated one.</p>\n\n<p>That's why you need the key to unlock that door.</p>\n\n<p>you need a system...</p>\n\n<p>Well, It's time to fill in those gaps in your knowledge and unlock the fretboard with the TOTAL FRETBOARD MASTERY SYSTEM.</p>\n\n<p>Rather than focusing on picking patterns and physical technique, Total Fretboard Mastery System is designed to give you a solid musical foundation and combine it with a deep knowledge of the guitar's unique layout by...</p>\n\n<p>Developing a complete understanding of TRUE FUNDAMENTALS of chords and harmony.</p>\n\n<p>Applying those concepts immediately to the fretboard and see things right under your fingers that you were missing.</p>\n\n<p>Breakthrough all of those old barriers that have held you hostage for years...even decades!</p>\n\n<p>Gain confidence to propel you to achieve any musical goal you have!</p>\n\n<p>Here Is What You Will Learn:</p>\n\n<p>Phase 1 - Develop The Virtuoso Musical Mind With Ease</p>\n\n<ul><li><strong>First, you will learn to simplify complex musical ideas</strong>...by developing a birds eye view of how music is made that eliminates excessive detail that other courses force down your throat which only confuses rather than helps</li><li><strong>Understand Music without needing to sightread traditional notation or tab</strong>...good if you can rad it, but not needed</li><li><strong>Declutter your brain</strong>... by learning only the most important musical terms in easy to understand language</li><li><strong>The three most powerful tools you can use</strong> to make comprehending scales chords keys in arpeggios that are almost never taught</li><li><strong>Develop a incredible ear for music</strong>...by learning why chords sound the way they do, and when to use them.</li><li><strong>Gain control over your own playing</strong>...by knowing which chord voicings to use and when.</li><li><strong>Write songs faster</strong>...increasing your options with a different chord choices yet keeping the chords simple</li><li><strong>Learn to create one of the most powerful tools in music with lightning speed</strong>...The cycles of 4th's and 5th's</li><li><strong>Dispel all the misconceptions</strong> about how chord scales keys and intervals work together to create seamless understanding to apply to the fretboard</li><li><strong>Finally be able to target notes in chords when soloing</strong>... by gaining the ability to spell chords in any key.</li></ul>\n\n<p><br></p>\n\n<p><br></p>\n\n<p>Phase 2 Turn Your Mind Into A Fretboard Roadmap</p>\n\n<ul><li><strong>Learn a completely new way of understanding</strong> the musical layout of the fretboard.</li><li><strong>Find any note in all locations</strong> in 5 seconds or less.</li><li><strong>Learn when to use the sharp or flat names of notes</strong>, and find out why almost all of the images of fretboards you see in the books and online are incomplete</li><li><strong>Learn the secret way of seeing the fretboard layout</strong> that even many advanced players don't understand at all.</li><li><strong>Make one chord sound like a dozens of different chords</strong>...by mastering different chord voicings.</li><li><strong>Find hidden chord shapes that you never new were under your fingers</strong>, and get to them by moving just one finger!</li><li><strong>Always choose the right chord voicing,</strong> by knowing why chord voicings sound different.</li><li><strong>Never get lost aga</strong><strong>in</strong>...by gaining complete freedom anywhere on the neck by making the whole neck your safe zone.</li><li><strong>Play like the virtuoso's.</strong>..by using small string groups instead of large bulky Bar/Barre Chords </li><li><strong>Simplify and Systematize thousands of chord Shapes</strong> by learning \"the symmetrical system\"  method of fretboard visualization which is even more in depth than the CAGED system.</li><li><strong>Speed up your thinking</strong> by learning to use a numbers rather than letters</li><li><strong>Never get confused again</strong> by keeping musical concepts and geographic concept separate in your own mind then combined them directly on the fretboard to </li><li><strong>Make giant leaps beyond normal guitar players</strong> to understand thousands of chords...by using instantly recognizable shapes that even a non-musician can remember.</li></ul>\n\n<p>In Just a couple of hours you can completely change the way you think about music and the guitar!</p>\n\n<p>Clear, Concise, and To The Point, without boring technical lingo, and<strong> ALL WITHOUT LEARNING TO SIGHT READ TRADITIONAL NOTATION OR TABLATURE!</strong></p>\n\n<p>This course is not just information, but a training partner! With real music to play over.</p>\n\n<p>And Of course You have a <strong>totally unconditional moneyback guarantee</strong>. Study the course. Test the waters. If you are in any way unhappy, you will get a full 100%, absolutely no conditions attached, no questions asked, refund direct from Udemy</p>", 
    "end_date": null, 
    "title": "Guitar Secrets! Turn Your Brain Into a Chord Encyclopedia!", 
    "price": "35.00", 
    "instructors": "Andrew Mcnaughton", 
    "commitment": "28 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206088_1721_4.jpg", 
    "course_url": "https://www.udemy.com/total-fretboard-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-27T17:33:07Z"
}