{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>In these online guitar lessons for beginners, I will teach you how to confidently perform 1 very popular rock guitar song in <strong>1 day </strong>to 1 week even if you've never played a guitar or sang before! I'll do this by teaching only the most crucial guitar &amp; music fundamentals, and then focus purely on the elements of the song itself, wasting <strong>no </strong>time.</p><p> Overview of the online guitar lessons:</p><ul><li>What's the best beginner guitar equipment to buy, and where?</li><li>How to set up and use your guitar equipment</li><li>Song structure &amp; counting</li><li>How to hold the guitar</li><li>Guitar chords used for the song</li><li>Tips for sounding like you've played guitar for years</li><li>How to put it all together to play &amp; sing the song</li><li>How to conquer stage fright and confidently perform on stage, <em>like a boss<br><br></em></li></ul><p>As you complete these rock guitar lessons, you'll be able to rehearse as often as you want using my free pre-recorded backing tracks. It will feel just like playing guitar with a real band! If you don't already have a guitar and amplifier, no problem! I will recommend exactly which beginner guitar equipment to buy and where to buy it.</p><p>So whether your child has a talent show coming up, or you're a mid-forties accountant who's yearning to get up on stage at an office party and stun your colleagues, now is the time to <strong>unleash your inner rock star</strong>! You will never find an easier way to learn to play rock guitar than these online guitar lessons!</p><p>The best part is... <em>everything </em>you learn in this course can help you learn &amp; play literally <strong>hundreds </strong>of other similar rock songs on guitar.</p>", 
    "end_date": null, 
    "title": "Guitar Lessons : Rock Guitar in 1 Day!", 
    "price": "50.00", 
    "instructors": "Bryan Lamb", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648492_f6ff_2.jpg", 
    "course_url": "https://www.udemy.com/rock-guitar/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T03:12:10Z"
}