{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><br>This course begins with an explanation of how to make best use out of the course.</p><p>You´ll realize that within just a few minutes you´ll be playing and strumming really fun and easy beginner guitar songs!<br><br>I walk you through all the elements that you´ll need to know in order to play along with ease. Each video has a \"quick-sheet\" of the chord progression embedded into the video, making it super-simple for you to follow along! :-)</p><p>Every lecture has a supported guitar playalong, so that you can watch \nand listen to me, while playing along at home. This way, you´ll never \nget lost, and you can listen to the track as many time as you need to.<br></p><p>Each short, intense (and sometimes funny) lecture helps you learn about different aspects you will need to make playing and strumming to all the songs easy and FUN!</p><p>You have the opportunity to become the guitar player you have always dreamed of. The lessons in the course are designed to teach you easy song and the strumming patterns that will fit millions of songs and give YOU confidence to come up with new ones of your own. After taking this course, friends and family will be begging you to \"play just one more, please!\"</p><p>Throughout the course, you'll have the opportunity to ask me questions and get quick support. This way you´re never alone, I´m always cheering you on!</p><p>By the end of this course, you'll have a clear understanding of how easy strumming really is!</p><p>I have tested and refined this method on hundreds of real “one on one\" students and I can't wait to help you too!</p><p>You´ll be provided a 42 page picture e-book as a special BONUS. This is my way of saying “thanks\" for joining the course. The book alone is valued at $50,- and it will teach you how to master the guitar fretboard in the most simple and easy way possible!</p><p>This is a no brainer, get in now and you will be happy you did :-)</p><p>To your success!</p><p>See ya on the inside :-)</p><p>-Henry<br></p>", 
    "end_date": null, 
    "title": "Guitar: Learn To Play 10 Guitar Songs Using Just 3 Chords", 
    "price": "20.00", 
    "instructors": "Henry Olsen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757214_3e35_5.jpg", 
    "course_url": "https://www.udemy.com/10-beginner-guitar-songs/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T14:33:57Z"
}