{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course begins with an explanation of how to make best use out of the course. </p><p>You´ll realise that most of the top hit songs use simple strumming patterns that are at your access right now.</p><p>I walk you through all the elements that you´ll need to know in order to play along with ease.</p><p>Each short, intense (and sometimes funny) lecture helps you learn about different aspects you will need to make strumming to any song easy and Fun!</p><p>Every lecture has a supported guitar playalong, so that you can watch and listen to me, while playing along at home. This way, you´ll never get lost, and you can listen to the track as many time as you need to.</p><p>You have the opportunity to become the guitar player you have always dreamed of. The lessons in the course are designed to teach the strumming patterns that will fit Millions of songs and give YOU confidence to come up with new ones of your own. After taking this course, friends and family will be begging you to &quot;play just one more, please!&quot;</p><p>Throughout the course, you&#039;ll have the opportunity to ask me questions and get quick support. This way you´re never alone, I´m always cheering you on!</p><p>By the end of this course, you&#039;ll have a clear understanding of how easy strumming really is!</p><p>I have tested and refined this method on hundreds of real “one on one&quot; students and I can&#039;t wait to help you too!</p><p>You´ll be provided a 42 page picture e-book as a special BONUS. This is my way of saying “thanks&quot; for joining the course. The book alone is valued at $50,- and it will teach you how to master the guitar fretboard in the most simple and easy way possible!</p><p>This is a no brainer, get in now and you will be happy you did :-)</p><p>To your success!</p><p>See ya on the inside :-)</p><p>-Henry</p>", 
    "end_date": null, 
    "title": "Guitar - 12  Strumming Patterns You Must Know For Guitar", 
    "price": "20.00", 
    "instructors": "Henry Olsen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515256_d2bb_5.jpg", 
    "course_url": "https://www.udemy.com/12-must-know-strumming-patterns/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T06:08:23Z"
}