{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>In one sentence, what is Guitar Super System?</strong></p><p>Guitar Super System is the final destination for those on a quest for infinite guitar knowledge, featuring eight comprehensive levels of literally everything you can know about the guitar.</p><p><strong>Why should you listen to me?</strong></p><p>I spent four years learning from the absolute best guitar players and teachers IN THE WORLD at the world renowned Berklee College of Music, featuring prestigious alumni like Steve Vai, John Petrucci of Dream Theater, Al Di Meola, and even John Mayer. I graduated with my bachelor's degree in 2011, and have taught hundreds of students since.</p><p><strong>That's great, but what does that mean for me?</strong></p><p>I realized not everyone has the opportunity or the money to attend one of the most expensive institutions on the planet. With that in mind, I've taken everything from the Berklee guitar handbook and crafted it into easy-to-follow video lessons. The average four year tuition to acquire this information is in the $200,000 range. Guitar Super System is your 99% discount on that ludicrous amount, and it will be yours forever.</p><p><strong>Why shouldn't I take another course or just watch free YouTube lessons?</strong></p><p>The reason has two parts: 1) your time is valuable, and 2) my instruction is based on the most successful and credible system there is. Other courses may have certain great information or certain great guitar players, but they also may not. On top of that risk, the structure of every Guitar Super System course is in place to optimize your learning and understanding. The right information presented in the correct way in the proper context. Don't waste time sifting through lessons that may not be teaching you the right way -- Guitar Super System has you covered.</p><p><strong>I think I'm sold! You mentioned there are 8 levels, though. What's that all about?</strong></p><p>In order to convey all the information in a digestible format, Guitar Super System is broken into eight levels. Essentially, each level is one semester of information from Berklee. Some people will never want to learn all eight levels of information, which is why the course is broken up in this way. After each completed course, you can gauge if you'd like to move on to the next level or if you've achieved what you sought out to do. This particular course is Guitar Super System Level 1, and Level 2 has just been released as of November 2015. Future levels are in production.</p><p><strong>I like that freedom. Can you give me some specifics?</strong></p><p>Guitar Super System includes relevant PDF attachments to nearly every lesson, so you can follow along with no problems. It's also recommended that you print out most of the attachments, so you might use them for practice outside the videos. In each Section, new concepts are introduced, accompanied by Berklee-standard play-through examples. You'll be testing your knowledge with real exercises used by the most prominent minds in music. Also included are professional quality downloadable backing tracks for you to apply your learnings over. </p>", 
    "end_date": null, 
    "title": "Guitar Super System Level 1", 
    "price": "40.00", 
    "instructors": "Tyler Larson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/484670_7b3d.jpg", 
    "course_url": "https://www.udemy.com/guitar-super-system-level-1-unlock-your-potential/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-23T20:40:25Z"
}