{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course begins with an explanation of how to make best of the course. </p><p>You´ll realise <em><strong>how simple</strong></em> the guitar neck is laid out, AND completely open to  YOUR access right now.</p><p>I walk you through all the elements that you´ll need to know in order to play chords ALL OVER THE FRETBOARD with ease!<br></p><p>Each\n short, intense (and sometimes funny) lecture helps you learn about \ndifferent aspects you will need to make COMPLETE sense out of the guitar fretboard.<em><strong>It´s  easy and fun!</strong></em></p><p>Most lectures have a supported guitar playalong, so that you \ncan watch and listen to me, while playing along at home. This way, \nyou´ll never get lost, and you can listen to the track as many time as \nyou need to.</p><p>You have the opportunity to become the guitar player \nyou have always dreamed of. The lessons in the course are designed to \nteach <em><strong>total fretboard freedom</strong></em> and <em><strong>understanding</strong></em> so that <em><strong>YOU</strong></em> can play Millions of songs and have confidence to come up with new ways on your own. After taking this \ncourse, <em><strong>friends and family</strong></em> will be begging you to <em><strong>\"play just one more, \nplease!\"</strong></em></p><p>Throughout the course, you'll have the opportunity to ask\n me questions and get quick support. This way you´re never alone, I´m \nalways cheering you on!</p><p>By the end of this course, you'll have a clear understanding of how simple the guitar really is!</p><p>I have tested and refined this method on hundreds of real “one on one\" students and I can't wait to help you too!</p><p>You´ll\n be provided a 42 page picture e-book as a special BONUS. This is my way\n of saying “thanks\" for joining the course. The book alone is valued at \n$50,- and it will support you on your path to mastering the guitar fretboard in the \nmost simple and easy way possible!</p><p>This is a no brainer, get in now and you will be happy you did :-)</p><p>To your success!</p><p>See ya on the inside :-)</p><p>-Henry</p>", 
    "end_date": null, 
    "title": "Guitar: Master The Guitar Fretboard In 6 Easy Steps", 
    "price": "20.00", 
    "instructors": "Henry Olsen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515260_e2c0_3.jpg", 
    "course_url": "https://www.udemy.com/fretboard-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T06:10:40Z"
}