{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Get Ready To Rock Your fingers &amp; Take Your Skills To The Next Level!!!!!</strong></p><p>You have learnt chords, cracked some good strumming techniques, you can play cool licks and riffs, and you have learnt a handful of your favorite songs... Well now it is time to challenge yourself to the next level!</p>  <p>The objective of this course is to give you a taste of what is to come later down the line in your guitar journey, but at the same time you will guarantee see a vast improvement in your overall skills with this one course.</p>  <p><strong>Inside my Next Level course</strong> you will learn all the important pentatonic scales to help you rip a lick and improvise to a jam track.  You will also learn how to apply the pentatonic scale to chords or free style, and how to be ‘free’ with the scales so you sound good and feel confident.</p>  <p>You will also learn a bunch of awesome <strong>licks and riffs</strong> taken from the <strong>pentatonic scale’s </strong>you will be learning, and don’t worry, these are VERY easy licks to play that will instantly make you sound awesome.</p>  <p>And if that wasn’t enough, you will also learn how to play the <strong>12 bar blues</strong>, AND.... I have added a <strong>jam lesson</strong> where you and me, (your teacher) will jam along together playing awesome blues music.</p>  <p>You will also learn from my <em><strong>interactive tab music</strong></em>, where the tab moves along at the same time you play so you know exactly where we are <strong>while we jam!</strong></p>  <p>In order to learn how to solo and improvise in blues and rock you must know the most commonly used <strong>8 pentatonic scale shapes</strong>. A lot of beginner guitarists get stuck in the first pentatonic scale shape, but to be truly free and improvise across the entire fretboard you need to know all the shapes, and I teach you how to play them.  Knowing all the shapes is easy, and believe it or not, you will also learn a little bit on music theory, and learning these scales will also help with barre chords later on (that’s if you can’t play barre chords).</p>  <p>And it’s not just about that. Every shape gives it’s own sound and feeling to a guitar lick. This is where the magic happens. </p><p>This is where the coolness and the beauty comes through all these different shapes. </p><p>They have all got their own personality.</p><p>And now you can confidently learn them all and experiment more on your guitar. YES... Even at a beginners level.</p>  <p>And even if you are full of confidence or in a band already, or you have always been the rhythm guitar player and fancied a change and challenge, then this course suits all guitarists at any level.</p>", 
    "end_date": null, 
    "title": "Guitar: The Next Level", 
    "price": "20.00", 
    "instructors": "Jack Long", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624662_b388_2.jpg", 
    "course_url": "https://www.udemy.com/guitar-the-next-level/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T13:22:39Z"
}