{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t       Blind Blake was a complete master of ragtime blues guitar - so how do we define that? <br style=\"\">  \t<br style=\"\">  \t        First of all, his performances had a joyful quality typical of the ragtime piano feel of the likes of Scott Joplin which the style emulated. Secondly, Blake introduced some techniques that gave the music a syncopation that almost defies belief. Although his playing inspired many artists since his passing, very few can capture the feel of his picking patterns. He picked with his bare thumb and probably two fingers. A great many legendary blues men used just one finger for picking acoustic blues, but the triplets you can hear in much of Blake&#039;s music makes this just about impossible. His fingers were indeed fast and very, very accurate. <br style=\"\">  \t<br style=\"\">  \t       He would vary his techniques within a song to make it more interesting and exciting, singing along with an alternating bass picking pattern and regularly throwing in fast single string runs picked with his thumb and forefinger. He could also reverse his bass picking pattern seemingly at will, also changing from a two string pattern to a three string variation. He might double up on the timing in the middle of a song and then seamlessly return without missing a beat (for example, Tootie Blues). When he combined all of these techniques in one song, it was formidable. <br style=\"\">  \t<br style=\"\">  \t          Blake&#039;s most famous technique is also the one most difficult to copy. He would slip or roll his thumb from one bass string to another, so instead of hearing one bass note per beat, we hear two! Your thumb needs to be super disciplined to do this correctly, as your fingers will be picking the treble strings at the same time! Now it&#039;s time to sing as well - wow, this is great fun! Good Luck.  </p>  <p style=\"\">  \t      Jim Bruce was voted N°2 Internet Guitar Instructor by Truefire in 2013.  </p>  <!-- Perfect Audience - Udemy Pixel - DO NOT MODIFY -->  <img src=\"http://ads.perfectaudience.com/seg?add=2465989&amp;t=2\" width=\"1\" height=\"1\" style=\" max-width:100%;\" />  <!-- End of Audience Pixel -->", 
    "end_date": null, 
    "title": "Guitar Lessons - Blind Blake - King Of Ragtime Blues Guitar", 
    "price": "45.00", 
    "instructors": "Jim Bruce", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101500_8439_6.jpg", 
    "course_url": "https://www.udemy.com/guitar-lessons-ragtime-blues-blind-blake/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-04T17:53:18Z"
}