{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">Ever wanted to learn how to understand the guitar neck notes at an expert level?  Well here is your chance with this awesome program - where I will take through  all the steps that your need to expertly handle the guitar.</p><p style=\"\">This is an intermediate to advanced course on guitar neck notes and hard rock guitar  solo improvisation that you can take at your own pace.</p><p style=\"\">This is from a DVD I did a while back, now out of print called  &quot;Curt Mitchells Chop Shop&quot;</p><p style=\"\">It will show you how to divide the guitar neck into five &quot;visual  positions&quot;&nbsp; or &quot;boxes&quot;  thereby freeing you from the standard guitar solo positions that confine us to  a very small portion of the guitar neck.</p><p style=\"\"><ul style=\"\"><li style=\"\"><span>This course contains 19 video sections or  &quot;lectures&quot; and a matching PDF file of the material. (total 20  lectures)</span><br style=\"\"></li><li style=\"\"><span>Depending on your current skill level, this course on guitar neck notes should take between  2 days and a week to complete.</span><br style=\"\"></li><li style=\"\"><span>You will need a guitar and Adobe PDF reader.</span><br style=\"\"></li><li style=\"\"><span>Prerequisites: This course is for people with some  experience playing the guitar. It&#039;s not for beginners.</span><br style=\"\"></li><li style=\"\"><span>When the course is completed, you should have a clear  knowledge of the entire fret board, and the scales used in most hard rock  guitar solos, using the entire guitar neck.</span><br style=\"\"></li></ul></p><p style=\"\">                                </p><ul style=\"\">  </ul>  ", 
    "end_date": null, 
    "title": "Hard Rock Guitar Improvising with Curt Mitchell", 
    "price": "25.00", 
    "instructors": "Curt Mitchell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/19385_3649_4.jpg", 
    "course_url": "https://www.udemy.com/hard-rock-guitar-improvising-with-curt-mitchell/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-11T21:25:40Z"
}