{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tHave you always wanted to be the life of the party, able to sit down at the piano and play fun, toe-tapping music for family and friends without needing to drag a lot of music books around or even needing to know how to read music?  </p>  <p>  \tIf you&#039;ve taken piano lessons before, have you ever been embarrassed because you couldn&#039;t just sit down and play, any time, any place, without needing music in front of you?  </p>  <p>  \tPlaying the blues is a lot of fun!  And with a little time and effort, you too can impress your family and friends with the piano pieces you will learn – and even create – after going through this course.  </p>  <p>  \tIn this course we will:  </p>  <p>  \t-look at 2 common variations of the 12 bar blues pattern;  </p>  <p>  \t-learn how that pattern translates to the keyboard; and  </p>  <p>  \t-learn several riffs, blues-y sounding chords and an ornament or two that will get you playing blues in no time.  </p>  <p>  \tAdded to that will be a handful of simple patterns or grooves for the left hand and finally, instruction on how to put it all together.  </p>  <p>  \tBy the time the course is completed, you will have the information you need to start creating your own simple blues pieces to play for your own enjoyment or to share with others.  </p>  <p>  \tThrough the use of videos, you will be encouraged to play along as I demonstrate each piece a chunk at a time.  Key concepts or patterns found on the keyboard will be reinforced through  text documents so you have vital pieces of information to easily access during your practice time. While written music  will also be provided I strongly encourage you to learn the pieces as presented in the videos.   Of course if you don&#039;t already read music, that&#039;s fine too. Just prop up the music on your keyboard when you are playing and see how impressed family are friends are when they see what you can play!  </p>  <p>  \tAs you are going through the course I will be available for questions, responding to them at least once a week if not sooner.  </p>  <p>  \tThis course can be completed in as little as a month depending on amount of time put into practicing and prior experience.  If you have never played blues before, this course will give you a brief but detailed introduction into playing 12 bar blues.  </p>  <p>  \tNot sure you like blues? Even if you never played another blues piece again, after this course, you will find your hand independence has developed, you are more skilled at putting the hands together in different rhythms, and you have increased confidence in your improvisation abilities. All of these skill will improve your playing, whatever the style or genre.  </p>  <p>  \tWhat are you waiting for? Make your dreams of playing fun, energizing pieces (without even needing to be able to read music) now. You may never see a better deal than this.  </p>", 
    "end_date": null, 
    "title": "Have Fun with Beginner Blues Piano", 
    "price": "20.00", 
    "instructors": "Karen Gibson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71912_33b2_7.jpg", 
    "course_url": "https://www.udemy.com/have-fun-with-beginner-blues-piano/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-31T01:46:51Z"
}