{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course combines in-depth examinations of basic harmony, melody and rhythm as they relate to playing (and understanding) music by ear. <br></p><p><strong>Develop your musicianship beyond academics and technique by learning how  philosophy, intuition and emotion play an essential role in your development as a musician and artist.</strong>  </p><ul><li>Learn intuitively from graphically enhanced lectures</li><li>Understand how to “groove” </li><li>Recognize “tension” and “resolution” in music</li><li>Discover and understand common chord progressions</li><li>Understand more than the average text book or private lesson will ever be able to teach.</li></ul><p><strong>There’</strong><strong>s more to music than just academics and technique. </strong> </p><p>Whether you’re a beginner, a regular performer or aspiring song-writer, this course finally offers a refreshing and engaging perspective that goes beyond the scales and chords into the realm of expression and a holistic understanding of music - an understanding you can build on and grow with for the rest of your life!</p><p><strong>Content and Overview</strong></p><p>This course is ideal for beginner and intermediate guitarists (and any musician who understand how to play guitar).  I’ve thoughtfully prepared 38 lectures - all clear and concise explanations of focused, useful topics that will teach you a holistic approach to music.  You’ll begin with in-depth lectures that cover all of the essential information you need to know about harmony and melody.   Most lectures include activities and exercises designed to apply the topics we discuss, so that you can internalize your lessons on a much more intuitive level.</p><p>Throughout the course, you’ll learn about the power of your intellect to learn new material, while also leveraging the flexibility of your intuition to understand concepts like “groove”,“tension” and “resolution”.</p><p>The later sections of the course explain Rhythm, The Blues and Ear Training. You’ll be able to play along, following chord diagrams, guitar tab and music notation.  You’ll understand why and how hit songs contain similar chords and you’ll learn how to use your ears to learn new music quickly and accurately. </p><p>As a performing musician and private instructor with over 12 years of professional experience, my methods not only explain how music fundamentals work logically, but also demonstrate the interconnected relationships that are essential to understand if you want to play music by ear and from the heart.</p>", 
    "end_date": null, 
    "title": "Holistic Guitar: Ear Essentials", 
    "price": "50.00", 
    "instructors": "Will Edwards", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/602812_a8d9.jpg", 
    "course_url": "https://www.udemy.com/holistic-guitar-ear-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-04T21:17:19Z"
}