{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t Never has there been any method that promises quicker results than this one. In here, the traditional first steps that are dull and boring for new learners have been set aside. They are the steps that will find their way only later.  </p>  <p style=\"\">  \t <br style=\"\">  \t To be able to fully appreciate the significance of this unorthodox and original system, one has to personally get involved in the program. This is hands-on training, no holds barred, as if a real teacher was sitting there next to you. You will not be doing anything you’re not capable of. Except, of course, if you’ve got no hands or maybe fewer than ten fingers!<br style=\"\">  \t <br style=\"\">  \t But since that’s highly unlikely, you will very soon be playing the piano the way you really want yourself to sound, not just like what music books tell you to do.<br style=\"\">  \t <br style=\"\">  \t To be able to achieve this, a different set of steps are to be taken in this course, steps that would at first seem ridiculous, but which would later yield results that are more deep-seated and lasting.<br style=\"\">  \t <br style=\"\">  \t You will find it to your advantage to follow the course meticulously, knowing that every lecture is an advancement towards your development as a true musician.<br style=\"\">  \t <br style=\"\">  \t So then, what is Pianish? It’s a language, just like English and Spanish. It’s the language a pianist uses to communicate. And it’s what this whole course is all about.<br style=\"\">  \t <br style=\"\">  \t Have a go and see how, after all, it’s so easy to speak Pianish!  </p>", 
    "end_date": null, 
    "title": "How to speak Pianish (beginner level)", 
    "price": "40.00", 
    "instructors": "Anton R. Tajanlangit", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/213532_77ea_11.jpg", 
    "course_url": "https://www.udemy.com/pianish101/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-09T01:26:14Z"
}