{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>FIRST 7 DAYS FREE!! TRY BEFORE YOU BUY!!</strong></p><p><strong>If you've wanted to start from scratch, play guitar, and improve every single day, listen up!</strong></p><p><strong>If you don't have the time or money to take guitar lessons with a 1-on-1 instructor, listen up!</strong></p><p>I began learning guitar ten years ago; though I was fortunate enough to have a teacher every week, I didn't really know what to do every single day. </p><p>And I know how you feel; <br> How should you spend your time? <br> How do you improve consistently?<br> What should you learn?</p><p>This is why I spent many hours creating this course, which is what I wished I had watched when I began learning how to play guitar.</p><p><strong>Today, enroll in this 'How to Play the Guitar' course and take your guitar playing to the next level!!</strong><br></p><p>This online guitar course is a 30-day series of guitar lessons for beginners. Each day, we ratchet up the level of challenge.</p><p>It is meant to take you from knowing little (or nothing) about playing guitar to playing the guitar with proper technique, and even a bit of flair.</p><p>Whether you want to learn how to play electric guitar or how to play acoustic guitar, we've got you covered; these lessons apply to both the electric or acoustic guitar.</p><p>Each lesson comes with guitar exercises and video lessons for both left-handed and right-handed players.</p><p>Believe it or not, the guitar is not one single skill; it is dozens of individual skills that you must learn in order to 'play the guitar'.</p><p>Each day, I hold your hand and teach you these skills, one at a time. I start with the very simplest (holding a pick, playing a note) and take you to the complex (playing an entire song).</p><p>Each day's lesson requires only 5 to 15 minutes, and is guaranteed to keep you engaged, interested, and CHALLENGED.</p>", 
    "end_date": null, 
    "title": "How to Play the Guitar: Your 30-Day Guide to Learn Guitar", 
    "price": "20.00", 
    "instructors": "Dan Amerson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749686_59c0_3.jpg", 
    "course_url": "https://www.udemy.com/absolute-beginners-30-day-guitar-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T04:12:58Z"
}