{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tHarmony is the basis of composition and improvisation, band-playing, songwriting, musical interpretation and understanding the emotions of music.  </p>  <ol>  \t<li>Analyze, play and Improvise the most famous dramatic Tosca aria \"And The Stars Were Shining\" (E Lucevan le Stelle) of the great Opera Composer Giacomo Puccini.</li>  \t<li>Learn scales, chords and notations, progressions and their emotional repercussions, music structure and improvising techniques, all in one.</li>  \t<li>Derive your own music from classical musical material.</li>  </ol>  <ul>  </ul>    <p>  \t      The course shows you step by step the whole compositional process from the harmonic analysis of Puccini´s dramatic aria “And the Stars were Shining\" through to your own personal improvised interpretation.  </p>  <p>  \t   Th aria is well known for its induction of strong emotions. The aria´s chord progression which is shown in full detail during the course explains in depth these parts of high emotional arousal.</p>  <p>  \t      To meet the needs also of the advanced beginner there are introductory videos about the concepts of scales and chord-construction.  </p>  <p>  \t<strong>This course is designed especially for the enthusiast of classical and modern music who wants to improve his harmony knowledge and who wants to learn compositional and improvisational techniques.</strong>  </p>", 
    "end_date": null, 
    "title": "Improvise Puccini´s \"E Lucevan le Stelle\" on Piano", 
    "price": "20.00", 
    "instructors": "Peter Janzen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62252_225c_32.jpg", 
    "course_url": "https://www.udemy.com/compose-and-improvise-through-puccini/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-26T01:19:18Z"
}