{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Description of the course</strong>  </p>  <p style=\"\">  \t        The main aim of IDT is to show and to explain the processes necessary to go through in order to develop a technique that allows us to play in a relaxed, controlled and musical way.  </p>  <p style=\"\">  \t        Along these videos I will do my best to show in detail the physical sensations that can be experienced when starting to study the technique. To achieve this, I will do a careful analysis of every movement made.  </p>  <p style=\"\">  \t        I will place particular emphasis on the importance of passing through some stages which, in my opinion, are vital to acquire an effective hand drumming technique. I will show that by working in a constant and progressive way, with clear goals, it is possible to achieve tangible results and to avoid frustrations.  </p>  <p style=\"\">  \t        I want to share with you my belief that a constant thirst for knowledge and the feeling of satisfaction when developing news skills can lead to a creative way of studying our instruments.  </p>  <p style=\"\">  \t        The satisfaction of learning how to make a stroke comfortably will surely encourage us to keep on practicing to strive for perfection. This way we will reach more complex stages each time. As we become more confident and more curious we will feel more motivated to improve our technique and to practice regularly. Such practice should not be experienced as a dull and monotonous routine but as an opportunity to learn new things and to become better drummers, better musicians and better artists.  </p>  <p style=\"\">  \t        Mi chief aim is to encourage you to discover and experience this. If this happens, then this work has achieved its purpose.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Our conception about technique</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>To acquire a good technique does not mean becoming extremely virtuous only. It means having the ability to produce the right sound effect in a certain musical moment, as well. The more tools we have to create these effects, the better our technique and the richer our music.  </p>  <p style=\"\">  \t        To sum up, I believe studying in detail the technique allows us to express better when playing our instruments. Hence, we play in a more colorful and versatile way.  </p>  <p style=\"\">  \t        Although this guide is focused on studying and analyzing the technique, I firmly believe a good musician should develop its creativity and musical sense as well.  </p>  <p style=\"\">  \t        I think this work I am sharing with you would be worthless if its aim was not a musical one.  </p>  <p style=\"\">  \t        I insist on the fact that the technique should always serve music, for this is the only way it gains real value.  </p>  <p style=\"\">  \t        - The 25 videos/chapters are in high definition [HD] mp4 format. -  </p>", 
    "end_date": null, 
    "title": "Inside Drum Technique", 
    "price": "20.00", 
    "instructors": "Rodrigo  del Castillo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131512_892e_8.jpg", 
    "course_url": "https://www.udemy.com/insidedrumtechnique/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-09T20:43:03Z"
}