{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course shows you how to play single notes on your harmonica. </p><p>If you can already do this you can skip this (or take it and improve your playing) and go straight to the Instant Harmonica Series ie any of my courses with the words i'nstant harmonica' in the title - or just search for those words or even search for Ben Hewlett and you'll get there.</p><p>This is for beginners and is very slow and easy to understand. I'll show you how to do it with demonstrations and I'll be using the whiteboard. You will learn to play the Doh Re Me tune - known as the scale of C.</p><p>We will learn 8 notes.</p><p>One at a time.</p><p>Very slowly.</p><p>Once you can get single notes the world is your lobster - you can play thousands of tunes with these 8 notes.</p><p>Let me know if there is a song or solo you want to learn and I'll try teach you how.</p><p>Look for any of my courses called<strong> 'INSTANT HARMONICA' </strong>and you will have the skills to play the tunes.</p><p>So here are some of the tunes coming up/available in my <strong>'INSTANT HARMONICA'</strong> series:</p><p>Ode to Joy</p><p>The Kesh</p><p>Cock o' the North</p><p>Oh Suzanna</p><p>When the Saints</p><p>Scarborough Fair</p><p>Dirty Old Town</p><p>Summertime</p><p>Amazing Grace</p><p>Over the Rainbow</p><p>Also you will be able to play solos similar to the harmonica playing of Neil Young, Bob Dylan, Bruce Springsteen, Mick Jagger, Paul Jones, John Lennon...</p><p>Let me know if there is a song or solo you want to learn and I'll try teach you how.</p>", 
    "end_date": null, 
    "title": "Instant Harmonica - how to get single notes in 5 easy steps", 
    "price": "20.00", 
    "instructors": "Ben Hewlett", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560662_f255_8.jpg", 
    "course_url": "https://www.udemy.com/instant-harmonica-how-to-get-single-notes-in-5-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T16:56:34Z"
}