{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>INSTANT BODHRAN – play the Irish drum now!</p><p>Take this course and play the Bodhran instantly. No musical experience needed.</p><p>I NEED TO KNOW IF YOU WANT A FOLLOW UP COURSE. THIS IS THE ONLY BODHRAN COURSE I'VE DONE SO FAR, BUT  I WILL MAKE MORE  IF YOU MESSAGE ME - IF YOU DON'T I WON'T - SO TELL ME IF YOU WANT MORE!</p><p>You will pick it up straight away without needing any music skills. This is easy to play and really fun to learn. You will be proud of your achievements and happy with the results.</p><p>'INSTANT BODHRAN' is a new course where you learn one simple idea per lecture. You will find it is taught in a friendly and encouraging manner and most importantly is it taught v-e-r-y s-l-o-w-l-y. </p><p>'Ben Hewlett is a very experienced music teacher who is able to be very patient and methodical. Each lecture will introduce you to the next rhythm or technique – usually just one new idea and that's it.</p><p>You'll know Ben better as a harmonica teacher but he studied Bodhrah and tin whistle in the 1990's with the now very famous Steafan Hannigan and Marc Moggy from Renegade Rhythms. He got so into Bodhran he bought an expensive tuneable drum from Marc and it works better than ever to this day. Ben has played Bodhran in bands and sessions for years and even has a Senheiser bass drum microphone embedded into his drum.</p><p>Ben is an experienced teacher and uses his skills to get the message across to you in a clear and concise way.'</p><p>This method is very easy for you to pick up the rhythms and strokes as they are repeated over and over again until you have got it. You can even re-run the video if you find it useful.</p><p>Imagine how amazing it will feel when you whip out your bodhran and play this tune – your friends and family will carry you shoulder high in triumph. Hopefully they don't carry you out of town and dump you in the river, but hey, swimming's good as well.</p><p>The health benefits of playing the music are well documented – google it. Playing music makes you smarter they say. </p><p>You will have fun on your own and with your friends, and more power to the brain will make you think you are having a good time so it's all good.</p>", 
    "end_date": null, 
    "title": "Instant Bodhran - learn Irish drum for fun and in sessions", 
    "price": 0, 
    "instructors": "Ben Hewlett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708696_e06f.jpg", 
    "course_url": "https://www.udemy.com/instant-bodhran-learn-irish-drum-for-fun-and-in-sessions/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T15:59:28Z"
}