{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>INSTANT HARMONICA – play the wonderful Yesterday right now!</p>\n\n<p>If you have a tune that you would like me to teach please message me.</p>\n\n<p>Take this course and play the tune instantly. No musical experience needed.</p>\n\n<p>You will pick it up straight away without needing any music skills. This is easy to play and really fun to learn. You will be proud of your achievements and happy with the results.</p>\n\n<p>'INSTANT HARMONICA' is a new series of courses where you learn one tune per course. You will find it is taught in a friendly and encouraging manner and most importantly is it taught v-e-r-y s-l-o-w-l-y. </p>\n\n<p>Ben Hewlett is a very experienced music teacher who is able to be very patient and methodical. Each lecture will introduce you to the next group of notes – usually just 4 new notes and that's it.</p>\n\n<p>This method is very easy for you to pick up the tunes as they are repeated over and over again until you have got it. You can even re-run the video if you find it useful.</p>\n\n<p>Take one course and learn your favourite tune. The try another. Remember you can always get your money back if you wish but otherwise you have lifetime access to the course.</p>\n\n<p>Imagine how amazing it will feel when you whip out your harmonica and play this tune – your friends and family will carry you shoulder high in triumph. Hopefully they don't carry you out of town and dump you in the river, but hey, swimming's good as well.</p>\n\n<p>The health benefits of playing the harmonica are well documented – google it. Your lungs get exercised, your lung capacity increases, aerobic movement is good for you, playing music makes you smarter they say. </p>\n\n<p>You will have fun on your own and with your friends, and more oxygen to the brain will make you think you are having a good time so it's all good.</p>", 
    "end_date": null, 
    "title": "Instant Harmonica - play the groovy Beatles Yesterday today!", 
    "price": "20.00", 
    "instructors": "Ben Hewlett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729464_faca_3.jpg", 
    "course_url": "https://www.udemy.com/instant-harmonica-play-the-groovy-beatles-yesterday-today/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T21:33:51Z"
}