{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Productive use of a person's time and enhances relationships.  This course introduces the learner to care and consideration of their musical status and instrument. It is about </p><li>Realising that Ukulele has given them the knowledge of themselves that one can achieve playing a musical instrument. </li><p>The benefits of playing ukulele and Famous Musicians alongside them. </p><li>Types of ukulele before you buy</li><li>Parts of the instrument</li><li>Care for your instrument</li><li>Warm up your fingers</li><li>Name of the open strings</li><li>How to hold the Ukulele</li><li>Tune the Ukulele</li><li>Materials necessary are a ukulele and tuner. Perhaps a printer to download the songs to practice. </li><li>The course is structured in lesson format and has audio to help understand what the pdfs are about. This course is all about an introduction to the instrument. It is suitable for the new learner, refresher from children to grandparents and someone who wants to learn ukulele as well as their guitar. </li><li>Terminology that is used will be keys, chords, tuning, ukulele, soundboard, frets, strings, warmup, fingers, uke, soprano, concert, tenor and GCEA. </li><li>The course covers the above listings. It is taught through pdfs, audio and images. Why a student ought to enroll is for company, to join a group that plays ukulele, to improve their social skills and knowledge with something in common with the upsurge of ukulele players since George Formby. Songs are downloadable. </li>", 
    "end_date": null, 
    "title": "Introduction to Ukulele 1", 
    "price": "20.00", 
    "instructors": "Michelle Daley", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650836_089a_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-ukulele/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T02:33:43Z"
}