{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong> </strong></p><p><strong>Course updated 11/01/16</strong><strong> </strong> </p>  <p><em>“I would have been playing piano for years by now if I'd </em>realised how easy it would be<em>....\" Sue, one of our students.</em> Discover the four simple shortcuts that helped this student achieve their dream of playing piano   </p><p><em><strong>What's stopped you so far?</strong></em></p><p>Two things are usually responsible for preventing people learning how to play Piano (1) Thinking it's too complicated, because you have to know how to read music and (2) Having been made to think you're not musical, due to negative music experiences at school. That kind of thinking stops here, Just like Sue, neither of these need stop you achieving your dream of playing piano anymore!</p><p><em>\"For years I've been wanting to learn the piano, but always postponed it as it seemed so difficult. Half way this course I was already trying all kind of things out on my piano, and was in shock that it all worked out.</em>\" Gregory, One of our students.<br></p><p><strong>Why a short course rather than really long one?</strong></p><p>Designed to be just long enough to give you exactly the knowledge and confidence in themselves beginners need, yet short enough that you actually complete it (no filler or rote learning) over a thousand students have discovered it really is possible, in just one hour, to learn enough to have a lifetime of fun and enjoyment actually playing. And you can do it using a completely different approach using shapes and patterns rather than notes and theory.</p><p><strong><em> \"I'm more of a pick up and play sorta guy! This course has literally taken me from knowing a few chords (and not remembering them!) to opening up a whole new world of musical possibilities\"</em> <strong>Adam, o</strong></strong><strong>ne of our</strong><strong> students</strong> <br></p><p><strong>But is it 'Proper music'?</strong></p><p>One of the things people sometimes worry about is \"but is it a proper way to learn?\" The dominant form of traditional piano teaching is focussed on first knowing how to read music, with the majority of people falling at that hurdle. By removing that barrier we enable anyone to experience the joy of playing, incredibly quickly and easily.</p><p>You don't actually have to suffer the tyranny of theory or reading to enjoy getting started on the Piano and don't you think you might learn far quicker playing the songs that inspire you rather than those chosen for you?</p><p><strong><strong></strong></strong></p><p><em>\"Making something that appears extremely complicated into something simple and understandable is an art. This course is the first I have ever done that had me hooked from the first minute and Simon is a superb instructor\" Gerry, o</em>ne of our Udemy students<br></p><p><strong><strong>Guarantee</strong></strong></p><p>Nothing we do prevents you learning traditionally, We are so confident in the effectiveness of our method that there is a guaranteed 30-day refund if you're not satisfied, but you will be.</p><p>Read enough? Enrol now and get playing!<br></p>", 
    "end_date": null, 
    "title": "Is playing piano on your bucket list? Play whole songs today", 
    "price": "30.00", 
    "instructors": "Simon Glenister", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372416_733e_17.jpg", 
    "course_url": "https://www.udemy.com/piano-hack-28-chords-in-under-an-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T14:49:34Z"
}