{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>COURSE UPDATES:</strong></p>\n\n<ul><li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p><strong><br></strong></p>\n\n<p>  \t<strong>COURSE DESCRIPTION:</strong>  </p>\n\n\n\n<p>  \t        Clarinet is an extremely fun instrument to play, and MusicProfessor's comprehensive curriculum will help you get the most out of your learning. Master the range, tone, and technique necessary to become a great clarinetist.  </p>\n\n\n\n<p>  \t        Start from opening your case for the first time and progress all the way to playing your first melodies. On the way, you'll also learn basic music theory and musicianship skills.  </p>\n\n\n\n<p>  \t        Private lessons cost anywhere from $30 - $100/hr.  Factor in driving time and expenses and you realize just how costly lessons can be.  Each MusicProfessor Clarinet course provides an entire year's worth of lessons, for a fraction of the cost, and at your own convenience.  Plus, each course is taught by an industry leading instructor!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>COURSE FEATURES:</strong>  </p>\n\n\n\n<ul>  \t<li>Nearly 90 video lessons</li>  \t<li>Downloadable sheet music for each lesson</li>  \t<li>Animated fingering charts</li>  \t<li>Dozens of familiar melodies and songs</li>  \t<li>Dozens of technique-building exercises</li>  \t<li>Major scales and scale exercises</li>  \t<li>Clarinet-specific troubleshooting tips and advice</li>  \t<li>Music Theory basics, including how to read music </li>  \t<li>Clarinet equipment recommendations </li>  </ul>\n\n\n\n<p>  \t        MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy's 30-day guarantee.  </p>\n\n\n\n<p>  \t        Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>NOTABLE REVIEWS</strong>  </p>\n\n\n\n<p>  \t<em>“The videos are great.  Really get a lot out of them.  We are excited about the opportunity to integrate these videos into our monthly/weekly/daily curriculum.\"</em>  </p>\n\n\n\n<p>  \t        -R. Lira  </p>\n\n\n\n<p>  \t<em>“Thank you for this! This is my first year playing clarinet and this helped me learn my first 3 notes.\"</em>  </p>\n\n\n\n<p>  \t        -haleyisnotawesome  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR:</strong>  </p>\n\n\n\n<p>  \t        Kathryn Nevin earned her Masters and Doctoral degrees in Clarinet Performance from the University of Southern California, where she studied with Mitchell Lurie, Michele Zukovsky, David Howard and Yehuda Gilad. Originally from the Chicago area, she was a student of Melvin Warner at Northern Illinois University where she received a Bachelor of Music.  </p>\n\n\n\n<p>  \t        In Southern California, Dr. Nevin has performed with many orchestras including San Diego Symphony, Pasadena Symphony, New West Symphony, Long Beach Opera, Santa Barbara Symphony, Opera Santa Barbara, Monterey Symphony and Fresno Philharmonic. She is a member of St. Matthews Chamber Orchestra, Desert Symphony in Palm Desert, Redlands Symphony Orchestra and Long Beach Municipal Band.  </p>\n\n\n\n<p>  \t        Dr. Nevin is an active soloist and chamber musician, having been a founding member of several award-winning ensembles, including Triole, recipient of an NEA Chamber Music Residency. She is currently a member of Calico Winds, an award-winning internationally touring wind quintet, whose recordings and performances around the country have received critical acclaim, including those at Carnegie Halls Weill Recital Hall. The ensembles most recent commercial release,Vintage America, A Musical Meritage (Albany), features 19th and early 20th century American music. Her playing can also be heard on the CDs Hymns to Forgotten Moons (Centaur) and Tango Rojo (Red Tango) (Candlelight Music). She has been a concerto soloist with the Redlands Symphony, Culver City Symphony, La Sierra Symphony, University of Redlands Wind Ensemble and Wheaton (Illinois) Municipal Band.  </p>\n\n\n\n<p>  \t        Dr. Nevin has been featured on NPR's Performance Today and numerous times on local classical music radio live broadcasts. She has appeared in chamber music concerts with faculty at the University of Redlands, the Taylor String Quartet, the Shanghai Quartet, as well as with Los Angeles Philharmonic principal strings. Dr. Nevin is the editor of Solos for the Intermediate Clarinetist, Music from Four Centuries arranged for Clarinet and Piano by Daniel Kelley, Last Resort Music, Inc. She has taught at La Sierra University, the University of California, Riverside, Riverside Community College, Mt. St. Mary's College, Pasadena Conservatory of Music and Glendale College. She is currently the Artist Teacher of Clarinet at the University of Redlands.  </p>\n\n\n\n<p>  \t        —  </p>\n\n\n\n<p>  \t<em>This course has been provided by MusicProfessor.com, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Learn to Play Clarinet: Beginner to Pro in Under Five Hours", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338926_01cd_4.jpg", 
    "course_url": "https://www.udemy.com/clarinet-a-beginners-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T00:19:47Z"
}