{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p></p><p>Most beginners think that you need to know thousands of chords to play thousands of songs. NOT SO! You really only need to know a handful of chords and a few strumming patterns to play thousands of rock, folks, blues and pop songs.</p><p>The reason guitar is the most popular instrument on the planet is because it&#039;s the quickest and easiest instrument to learn how to play. You do NOT need to read music. You do NOT need to learn music theory. You do NOT need to struggle through exercises, or practice scales, or learn how to play Mary Had A Little Lamb.</p><p>Fact is that thousands of popular songs can be played with 8 simple chords or less. Learn just the A chord, D chord and E chord and you&#039;ll be able to play hundreds of blues, folk, pop and rock songs. Why is this so? Because rock, pop, folk and blues songwriters all use the same handful of chords - it&#039;s their melodies and arrangements that make their songs distinctive, NOT the chords they are using in the song.<br style=\"\"></p><p>So, if you learn that handful of chords, and learn those few strumming patterns, along with the basics of holding and tuning a guitar, then you too will be able to play thousands of songs. And that&#039;s the simple truth.</p><p><img src=\"http://truefire.com/educators/images/ravi.jpg\" class=\"ltImg\" style=\" margin:0px 15px 10px 0px; max-width:100%;\" align=\"left\">World renowned guitar educator Ravi has taught thousands of people to play their favorite songs on guitar with his breakthrough 21-day course. The &quot;trick&quot; behind this course is really no trick at all; over the 21 days you&#039;ll learn how to hold and tune the guitar, how to play eight simple chords, how to strum, and how to keep a beat.</p><p>No gimmicks. No &quot;magic&quot; formula. No nonsense.</p><p>You will need to set 20 minutes a day aside for your practice sessions. No more and no less. And you are asked to do this for 21 days straight. Yes, you can skip a day or two but the daily repetition and practice regiment is the key to your success.</p><p>Ravi has also included additional lessons for you to work with beyond the 21 days. You&#039;ll learn more open position chords, the moveable barre chord system (worth the price of admission alone!), how to read chord charts, and how to easily and quickly learn songs from sheet music, song books and lyric sheets that you download from the internet.</p><p>Ravi will step you through the course and each of your practice sessions on the video lessons. Follow the course for those 21 days and beyond and we guarantee that you&#039;ll be prepared to start playing and building your own repertoire of favorite songs to accompany yourself or play in a band setting.</p><p>No, you will not be an Eric Clapton in 21 days and we wouldn&#039;t suggest you book your first gig on the 22nd day BUT you will be a guitar player and you will be well equipped to learn ALL of your favorite songs.</p><p>If you&#039;ve always wanted to learn to play guitar so that you can strum along and sing your favorite songs, Learn Guitar in 21 Days is likely the answer you&#039;ve been seeking. Grab your guitar, boot up Ravi&#039;s first lesson and let&#039;s start making music right away!</p><p><strong style=\"\">NOTE!</strong>&nbsp;We get asked all the time why a guitar educational company with so many advanced courses would offer such a simple solution to learning guitar without having to learn how to read music, learn theory or work through a more &quot;formal&quot; learning methodology. The answer is really simple; you never stop learning music but you do have to start. If your introduction to music is boring, tedious and generally a struggle, you&#039;ll likely pack the guitar up in its case and stick it in the closet. If it&#039;s fun, engaging and you can prove to yourself that you can really do it, then you&#039;ll spend a lifetime enjoying and learning guitar. Hopefully, TrueFire and our massive library of instruction will enhance that lifetime of enjoyment.</p><p></p>  ", 
    "end_date": null, 
    "title": "Learn Guitar in 21 Days", 
    "price": "20.00", 
    "instructors": "True Fire", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26956_8baf_4.jpg", 
    "course_url": "https://www.udemy.com/learn-guitar-in-21-days/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-17T14:01:04Z"
}