{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t          Learn How to Play Blues, Rock and Boogie Woogie Piano Today is a primer course for everybody who has an interest in learning the piano or keyboards, or adding a new genre to their existing piano repertoire.  </p>  <p style=\"\">  \t            Blues, Rock and Boogie puts the fun back into piano playing, whilst also teaching you chords, inversions, progressions, improvisation, rhythm patterns, and soloing. It&#039;s as if a professional pianist is sitting next to you as you practice!  </p>  <ul style=\"\">  \t<li style=\"\">You will quickly learn how to play the most recognizable 12 Bar piano Blues patterns in both hands, and how to improvise solo patterns.</li>  \t<li style=\"\">The course consists of six sections, including 14 lectures, 1 fun quiz, and over 38 minutes of easy to understand lessons that stay on-topic, teaching you the basics of what you need to know, step-by-step.</li>  \t<li style=\"\">You have the ongoing support of a professional pianist and music teacher with 27+ years experience.</li>  \t<li style=\"\">All future new bonus content, and regularly added lesson updates, will be included at no additional cost to you. What you pay today is all you ever need to pay. Available 24 hours a day, 7 days a week.</li>  \t<li style=\"\">By the end of this course you will be able to confidently play and perform the most recognized Blues and Rock &#039;n&#039; Roll 12 Bar piano patterns in the key of C Major. </li>  \t<li style=\"\">You will also be able to improvise 2,3, and 4 note solo patterns over the chords of C, F, and G Major. </li>  \t<li style=\"\">You could complete this course in only two weeks, learning only one new lesson a day; or spread the lessons out at your own convenience and complete them in a time frame that makes you comfortable. It is entirely up to you. </li>  \t<li style=\"\">If that&#039;s not all, you will even get a Certificate for completing the course!</li>  </ul>  <p style=\"\">  \t                      So don&#039;t delay, Learn How to Play Blues, Rock, and Boogie Piano today.  </p>  <p style=\"\">  \t        Join a 1,200+ strong community of fellow piano students learning together in this growing new Udemy music course. Bigger, Better, Learn Faster.  </p>  <p style=\"\">  \t        You could be playing cool piano pieces before you can say &quot;Woke up this morning.&quot;  </p>  <p style=\"\">  \t          Course description last updated on 27th October 2014  </p>", 
    "end_date": null, 
    "title": "Learn How to Play Blues, Rock, & Boogie Woogie Piano Today", 
    "price": "20.00", 
    "instructors": "David Brogan", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311530_6a34_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-play-blues-rock-boogie-woogie-piano-today/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T14:37:59Z"
}