{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p> <strong>Updates:</strong><strong></strong></p>\n\n<p><strong>Thu 12th May 2016: </strong> </p>\n\n<p> <strong><strong>Section 2 recording is complete and is to be uploaded very soon. Latest lectures uploaded to Section 2 include 'Drags' and 'Cross Stick Technique' and more to be uploaded over the next weeks. Over 500 students enrolled already \non this course! If you want to learn to play the drums then enrol on\n this course now. With lectures being added all the time, this will be \nthe ultimate guide to playing the drums. Sign up now whilst the price is\n low. What are you waiting for?</strong></strong> </p>\n\n<p> Welcome to my course Learn To Play The Drums. </p>\n\n<p> This course will turn you from being a drumming novice into a drumming expert. </p>\n\n<p> The lectures provide step by step instruction to suit everyone and cover skills that are both basic and advanced. </p>\n\n<p> Each section has downloadable PDFs to help your understanding and to aid practice. </p>\n\n<p> The lectures contain exercises that I have learnt, use and teach in my career as a professional drummer and tutor. </p>\n\n<p> By the end of the course you will be a proficient drummer. All you need to do is to pay attention to the lectures, be patient and devote some practice time to the exercises shown in the course. </p>\n\n<p>You'll have life long access to the all the videos with a 30 day money back guarantee so you have nothing to lose. </p>\n\n<p>Lectures are being added all the time so the course is constantly getting bigger and better. <strong>Latest lectures added: 'Drags'</strong><br></p>\n\n<p> <strong>If you've always wanted to learn the drums this course is for you. </strong> </p>\n\n<p> <strong>Enrol now!</strong> </p>", 
    "end_date": null, 
    "title": "Learn To Play The Drums", 
    "price": "25.00", 
    "instructors": "Billy Baker", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392958_b8d3.jpg", 
    "course_url": "https://www.udemy.com/learndrums/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T11:47:15Z"
}