{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>COURSE UPDATES:</strong>  </p>\n\n<ul>  \t<li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n\n\n<p><strong><br></strong></p>\n\n<p>  \t<strong>COURSE DESCRIPTION:</strong>  </p>\n\n\n\n<p>  \t        Oboe is an extremely fun instrument to play, and MusicProfessor's comprehensive curriculum will help you get the most out of your learning. Master the range, tone, and technique necessary to become a great oboist.  </p>\n\n\n\n<p>  \t        Start from opening your case for the first time and progress all the way to playing your first melodies. On the way, you'll also learn basic music theory and musicianship skills.  </p>\n\n\n\n<p>  \t        Private lessons cost anywhere from $30 - $100/hr.  Factor in driving time and expenses and you realize just how costly lessons can be.  Each MusicProfessor Oboe course provides an entire year's worth of lessons, for a fraction of the cost, and at your own convenience.  Plus, each course is taught by an industry leading instructor!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>COURSE FEATURES:</strong>  </p>\n\n\n\n<ul>  \t<li>Over 70 video lessons</li>  \t<li>Downloadable sheet music for each lesson</li>  \t<li>Animated fingering charts</li>  \t<li>Dozens of familiar melodies and songs</li>  \t<li>Dozens of technique-building exercises</li>  \t<li>Major scales and scale exercises</li>  \t<li>Oboe-specific troubleshooting tips and advice</li>  \t<li>Music Theory basics, including how to read music </li>  \t<li>Oboe equipment recommendations </li>  </ul>\n\n\n\n<p>  \t        MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy's 30-day guarantee.  </p>\n\n\n\n<p>  \t        Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR:</strong>  </p>\n\n\n\n<p>  \t        Jonathan Marzluf is one of Southern California's most active freelance oboists. He began his oboe and reed-making studies at the young age of eleven years old, in Columbus, Ohio, and is now an internationally recognized oboe performer, instructor, reed maker, clinician, and repair technician.  </p>\n\n\n\n<p>  \t        Mr. Marzluf has played oboe for many fine ensembles, including: the CAPA Broadway Series, Opera Roanoke, the Columbus Symphony, the United States Marine Corps Field Band and Woodwind Quintet, the Central Ohio Symphony, the Pacific Woodwind Quintet, the Rio Hondo Symphony, Divan Consort, the Crystal Cathedrals Hour of Power Orchestra, Center Stage Opera of Los Angeles, and the Okinawa Symphony. In 1996, Mr. Marzluf was the recipient of the Navy Achievement Medal for fostering cross-cultural relations in Japan by establishing an ongoing chamber music series featuring both U.S. Military and Japanese civilian musicians.  </p>\n\n\n\n<p>  \t        Mr. Marzluf earned his Bachelor of Music degree in oboe performance at The Ohio State University, and his Master of Music degree in oboe performance at California State University, Fullerton. His principal teachers have included Robert Sorton, William Baker, Steven Rosenberg, and Larry Timm. He has also studied with John Mack, James Caldwell, David Weiss, and Alan Vogal.  </p>\n\n\n\n<p>  \t        Currently residing in Fullerton, California, with his wife, Jennifer, and their two children, Mr. Marzluf serves on the applied music faculties of Concordia University, Irvine, and California State University, Fullerton, and performs regularly as a founding member of the celebrated flute/oboe/piano trio, Triple Entendre.  </p>\n\n\n\n<p>  \t        —  </p>\n\n\n\n<p>  \t<em>This course has been provided by MusicProfessor.com, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Learn to Play the Oboe: Beginner to Pro in Under Four Hours", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/347104_8db3_3.jpg", 
    "course_url": "https://www.udemy.com/oboe-a-beginners-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T07:24:25Z"
}