{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<ul>  \t<ul>  \t\t<ul>  \t\t\t<li>Learn how to Play the piano at any age. Join a 5,900+ strong community of fellow piano students learning together in  this much-loved Udemy music course.</li>  \t\t\t<li>Bigger, Better, Learn Faster. - Play entire piano pieces from the  earliest lessons. (Be sure to watch and try out the course 'preview'  lessons)</li>  \t\t</ul>  \t</ul>  </ul>\n\n<ul>  \t<ul>  \t\t<ul>  \t\t\t<li>No prior musical theory knowledge, nor the ability to read piano  sheet music necessary for this course. Easy to understand lessons that  stay on-topic, teaching you the basics of what you need to know,  step-by-step.</li>  \t\t\t<li>Learn how to transform from a complete novice beginner  to the level of an early intermediate standard pianist. </li>  \t\t\t<li>Learn all the skills to achieve mastery of the piano - With  time-stamped video lessons, extensive lesson descriptions, and detailed  notes.</li>  \t\t\t<li>Learn an extensive repertoire of well-loved piano favorites -  Available 24 hours a day, 7 days a week. (See the course section  listings.)</li>  \t\t\t<li>Have the online support and mentoring of an expert piano teacher and  performer, with 27+ years experience. Have all your questions answered -  just drop me a message, or ask your fellow piano students on the course  discussion board.</li>  \t\t</ul>  \t\t<p>  \t\t\t                                                            In a recent  PhD research paper, 94% of all adults surveyed and 82% of the overall  population said they would love to be able to play the piano.  \t\t</p>  \t</ul>  </ul>\n\n<p>  \t                                                            Check out  Lecture One of the course: '100 Personal Benefits of Learning Piano  Today.' You can read and/or download the document with no further  obligation.  </p>\n\n<p>  \t                                                            Why not test  drive the course and learn your first piano pieces today, as shown in the sample  video lessons? Just look for the 'Preview' sign beside the available  videos.  </p>\n\n<p>  \t                                                            Remember:  All updates, insider tips and tricks, supplementary material, and  exclusive additional lesson content will come to you at no extra charge.  </p>\n\n<p>  \t                                                            What you pay  today is all you will ever pay. Period. For a  course that never expires!  </p>\n\n<p>  \t                                                           There's even a 30 day money back guarantee.  </p>\n\n<p>  \t                                                            Receive a  year's worth of piano lessons for the price of a few hours  face-to-face. Simple, fast, easy, direct, convenient, - and all  delivered instantly at outstanding value.  </p>\n\n<p>  \t                                                      Rewind, replay, repeat, download - Learn in your own time at your own pace.  </p>\n\n<p>  \t            Learn how to play your first piano pieces within minutes.  </p>\n\n<p>  \t            You want it, you need it, you like it, and you can afford it. So why not buy it? Don't delay, 'Learn Piano Today'.  </p>\n\n<p>  \t                                                      Note: This course is equally suitable for beginner keyboard players.  </p>\n\n<p>  \t                                          Course materials last updated on 26th June 2016.  </p>", 
    "end_date": null, 
    "title": "Learn Piano Today: How to Play Piano Course in Quick Lessons", 
    "price": "30.00", 
    "instructors": "David Brogan", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42038_2e9e_14.jpg", 
    "course_url": "https://www.udemy.com/learnpianotoday/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-17T02:57:20Z"
}