{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course covers all of the different bowing techniques for the violin. It covers both on the string and off the string techniques.  There are also helpful practicing tips as well as different exercises for mastering each bow stroke.  Learning the different bow strokes will greatly improve your ability to add musicality to the songs that you are already playing or learning to play.<br></p>\n\n<p>Students who enroll will get to learn all of the violin bow strokes without having to take costly private lessons. This course could take anywhere from one month to one year (or longer) to complete, depending on how much practice time you have, and how committed you are to getting the techniques just right.<br></p>\n\n<p>This course is a very low pressure way to get to improve technique on the violin.  You will be able to improve upon the knowledge you already have, and take these new bowing techniques and apply them to any piece of music that you are working on.<br> </p>\n\n<p>This course consists of all video lectures.  It will be as if you are having private lessons from me.  I will break down each bow stroke, cover different ways to practice them, and give helpful tips. <br></p>\n\n<p>Above all, this course is for anyone with a love of the violin.  With a 30 day money back guarantee and lifetime access, you can be confident in your purchase. Lifetime access will also allow you to take as long as you need to complete the course, and will also allow you to go back and review lectures once you have completed it. It's a fail safe way of learning <br>the violin and mastering different bowing techniques.</p>", 
    "end_date": null, 
    "title": "Learn the Violin - Bowing Techniques", 
    "price": "20.00", 
    "instructors": "Kathleen Kromphardt", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/807494_5571_2.jpg", 
    "course_url": "https://www.udemy.com/learn-the-violin-bowing-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-29T18:53:53Z"
}