{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \tThis course will introduce students to the very basics of violin playing and music theory. It starts with learning the parts of the instrument itself, applying music to the violin, and finally teaching how to play the classic &quot;Twinkle Twinkle&quot;. The terminology used will be explained in detail as the course progresses, and will be revisited throughout. This course is very video-intensive, with occasional power-points to emphasise certain material to help students achieve full understanding of the music theory covered in the class. The actual course will take about a week to accomplish. This time depends on how much time the student will devote to practicing the material outside of the actual video training. The course is structured in two sections. The first incorporates learning about the bow hold, the violin hold, proper positions, and bowing techniques. The second will focus on beats, in-depth music theory, and scales.  </p>  <p style=\"\">  \tLearning an instrument is a fun way to exercise your creative muscles and the violin presents a challenge, but not a difficult challenge. The violin is a very diverse instrument. It can be played in the most beautiful symphonies, and can also transition into bluegrass music. Anyone who wants to learn violin at their own pace will excel during this course, as it will teach them all the basics they will need on their way to becoming a great violinist.  </p>", 
    "end_date": null, 
    "title": "Learn How to Play the Violin - Violin Basics", 
    "price": "20.00", 
    "instructors": "Anthony Terrano", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/264396_656a_2.jpg", 
    "course_url": "https://www.udemy.com/violin-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-19T01:44:26Z"
}