{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>Updates:</strong>  </p>\n\n<p><strong>Friday 13th May 2016: </strong> <br></p><p>  \t<strong>1400+ students have now signed up. 48 lectures are live with more to be added. My follow up to this course - 'Learn to Play the Drums' - is also available. If you think you have rhythm then what are you waiting for? Sign up now</strong>  </p>\n\n<p>  \t      Welcome to my course Learn To Play The Drums Without A Drum Kit.  </p>\n\n<p>  \t        This course is aimed at anyone with an interest in learning to play the drums by teaching you the skills you need without any equipment.  </p>\n\n<p>  \t      The lectures provide step by step instruction to suit everyone and cover skills that are basic and advanced.  </p>\n\n<p>  \t      Each section has downloadable PDFs to help your understanding and to aid practice.  </p>\n\n<p>  \t        These exercises are based on the skills I learnt, use and teach in my career as a professional drummer and tutor.  </p>\n\n<p>  \t        By the end of the course you will have improved your coordination, rhythm and timing. You'll have life long access to the all the videos with a 30 day money back guarantee so you have nothing to lose.  </p>\n\n<p>  \t<strong>If you've always wanted to learn the drums this course is for you. </strong>  </p>\n\n<p>  \t<strong>Enrol now!</strong>  </p>", 
    "end_date": null, 
    "title": "Learn To Play The Drums Without A Drum Kit", 
    "price": "25.00", 
    "instructors": "Billy Baker", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/195576_d3b9_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-play-the-drums-without-a-drum-kit/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-08T10:46:21Z"
}