{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>COURSE UPDATES:</strong></p>\n\n<ul><li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n<p>  \t<strong>COURSE DESCRIPTION:</strong>  </p>\n\n\n\n<p>  \t    Flute is an extremely fun instrument to play, and MusicProfessor's comprehensive curriculum will help you get the most out of your learning. Master the range, tone, and technique necessary to become a great flutist (yes, we said flutist, not flautist).  </p>\n\n\n\n<p>  \t    Start from opening your case for the first time and progress all the way to playing your first melodies. On the way, you'll also learn basic music theory and musicianship skills.  </p>\n\n\n\n<p>  \t    Private lessons cost anywhere from $30 - $100/hr.  Factor in driving time and expenses and you realize just how costly lessons can be.  Each MusicProfessor Flute course provides an entire year’s worth of lessons, for a fraction of the cost, and at your own convenience.  Plus, each course is taught by an industry leading instructor!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>COURSE FEATURES:</strong>  </p>\n\n\n\n<ul>  \t<li>Over 100 video lessons</li>  \t<li>Downloadable sheet music for each lesson</li>  \t<li>Animated fingering charts</li>  \t<li>Dozens of familiar melodies and songs</li>  \t<li>Dozens of technique-building exercises</li>  \t<li>Major scales and scale exercises</li>  \t<li>Flute-specific troubleshooting tips and advice</li>  \t<li>Music Theory basics, including how to read music </li>  \t<li>Flute equipment recommendations </li>  </ul>\n\n\n\n<p>  \t    MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy’s 30-day guarantee.  </p>\n\n\n\n<p>  \t    Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>NOTABLE REVIEWS</strong>  </p>\n\n\n\n<p>  \t<em>“You may think learning an instrument is hard. But when you come to Music Professor they dumb it down to the bare bones, and then start adding the muscle.”</em>  </p>\n\n\n\n<p>  \t    -@lindaakiwi  </p>\n\n\n\n<p>  \t<em>“With cuts to arts ed, it's great to find a resource that's easy to access and can help fill the void.  Great idea and solid course.”</em>  </p>\n\n\n\n<p>  \t    -B. Cook  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR:</strong>  </p>\n\n\n\n<p>  \t    Lisa Garner Santa currently serves as Artist-Performer and Professor of Flute at Texas Tech University where she enjoys a diverse career as teacher, recitalist, soloist, and chamber musician. Performance highlights include the world premiere of Mike Mowers Concerto for Flute and Wind Ensemble and a Carnegie Hall debut recital featuring Chamber Works for Flute.  </p>\n\n\n\n<p>  \t  --  </p>\n\n\n\n<p>  \t    Rver en Couleur (Dreaming in Color): French Music for Solo Flute and Piano, presented in collaboration with Gabriel Sanchez, is her most recent CD release on MSR Classics.  </p>\n\n\n\n<p>  \t<em>I am quite taken [with this disc]...It is all magnificent music, played with finesse. The flutist has the kind of tone I prefer - rich, colorful, perfectly in control, and always in tune. Her phrasing is all well-shaped and thoughtful, just what this elegant music deserves. Sanchez is an equal partner. [Garner Santa] is a truly remarkable artist with dazzling musical ability. Flutists and non-flutists alike should find this wonderful disc. I look forward to hearing more from this duo.</em>  </p>\n\n\n\n<p>  \t    - American Record Guide  </p>\n\n\n\n<p>  \t    —  </p>\n\n\n\n<p>  \t    Her 2004 CD release ofFrom Noon to Starry Night, a compilation of 20th Century chamber works for flute and piano (with TTU Faculty, Lora Deahl, piano), has also received outstanding reviews.  </p>\n\n\n\n<p>  \t<em>The title track (From Noon to Starry Night by Matthew Santa)...is a wonderful addition to the flute repertoire...Garners colors, vibrato use, and interpretations are excellent. This interesting, well-produced CD should be in every flutists record collection.</em>  </p>\n\n\n\n<p>  \t    - Flute Talk  </p>\n\n\n\n<p>  \t<em>gorgeous - flat-out gorgeous...a true artist. It serves me and All the Words EXTREMELY well.</em>  </p>\n\n\n\n<p>  \t    - Dan Welcher, Composer  </p>\n\n\n\n<p>  \t  --  </p>\n\n\n\n<p>  \t    As an active member of theNational Flute Association, Dr. Garner Santa recently served as Program Chair for the 2011 convention in Charlotte, NC, and continues to serve as a member of the NFA Executive Committee. She has been a featured performer at the Boston, Atlanta, Phoenix, Dallas, Nashville, Kansas City, and Las Vegas conventions as well as an adjudicator and/or coordinator for many NFA events and competitions including the High School Soloist Competition, the NFA Newly Published Music Competition, the NFA Professional Flute Choir Competition, and as the NFA General Competitions Coordinator.  </p>\n\n\n\n<p>  \t    As a pedagogue, Lisa Garner Santa presents masterclasses throughout the United States and abroad. Recent international exchanges include masterclasses at the Royal College of Music in London, England and Victoria University in Wellington, New Zealand. Presentations and performances at various regional and national conventions include invitations from theTexas Music Educators Association, the Texas Music Teachers Association, the National Association of Wind and Percussion Instructors, and theCollege Music Society. Her research and pedagogical articles are frequently published in The Flutist Quarterly, Flute Talk, and The Instrumentalist.  </p>\n\n\n\n<p>  \t    In recognition of her creative teaching, she was awarded the Texas Tech Big 12 Fellowship as well as the Texas Tech Alumni Association New Faculty Award and is also an elected member of Texas Tech University’s prestigious Teaching Academy.  </p>\n\n\n\n<p>  \t    With co-authors Matthew Santa and Thomas Hughes, Lisa Garner Santa developed theFlute/Theory Workout, a method that efficiently introduces full-range scalar and chordal flute technique while introducing music theory fundamentals at the same time. The Workout, which comes with an entertaining accompaniment CD, is available throughCarolyn Nussbaum Music Co., and Flute World.  </p>\n\n\n\n<p>  \t    Dr. Garner Santa holds performance degrees from West Texas State University, Florida State University, and The Shepherd School of Music at Rice University. Her teachers to whom she is eternally grateful include Carol Wincenc, Charles DeLaney, Sally Turk, Helen Blackburn.  </p>\n\n\n\n<p>  \t    In addition to her active role as a flutist, Lisa Garner Santa is also a certified Kripalu Yoga Instructor and member of theYoga Alliance. She teaches Yoga for Musicians at the TTU School of Music and Kripalu Yoga classes at various locations throughout Lubbock.  </p>\n\n\n\n<p>  \t    —  </p>\n\n\n\n<p>  \t<em>This course has been provided by MusicProfessor.com, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Learn to Play the Flute: Beginner to Pro in Under Five Hours", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324224_3c7d_9.jpg", 
    "course_url": "https://www.udemy.com/beginnerflute/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T15:35:30Z"
}