{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<em><strong>MY PERSONAL GUARANTEE - I AM SO CONFIDENT YOU WILL LOVE  THIS COURSE THAT IF YOU DON'T, AND SO FAR ALL BUT ONE PERSON WAS HAPPY, I WILL REFUND YOU ALL THE MONEY (within  30 days of purchasing) WITH NO QUESTIONS ASKED. THIS IRONCLAD GUARANTEE  IS BACKED UP BY UDEMY.</strong></em>  </p>\n\n<p>  \t            **OVER 4 thousand STUDENTS**  </p>\n\n\n\n<p>  \t              Many video lectures added or updated 7.1.15 and  21.1.15  </p>\n\n\n\n<p>  \t              If you ever wanted to learn to play the harmonica this updated course is for you!  </p>\n\n\n\n<p>  \t                       I will hold your hand all the way through the  videos with my 'infectious and humourous' style of teaching. People tell  me that and who am I to argue.  </p>\n\n\n\n<p>  \t            You will feel like I'm right with you in a one to one  lesson showing exactly you how to do it, and encouraging to to become  confident and go it alone.  </p>\n\n\n\n<p>  \t  \t                            This course gives you the basics in  125 (and growing) easy lectures.  </p>\n\n\n\n<p>  \t  \t                            It's designed to be fun, friendly,  easy for anyone to learn - even non-musical people! It is is designed to  help you succeed and lead you on to the next in the series.  </p>\n\n\n\n<p>  \t                       There are pdfs and mp3 downloads with many  lectures so you can read the tablature and play along with the audio  music written especially for learning harmonica.  </p>\n\n\n\n<p>  \t                        Please be sure to visit the Questions area and  Forum to interact with other students. It's a great way to learn more  and helps you apply what the course gives you.  </p>\n\n\n\n<p>  \t                   I check my Udemy messages most days so feel free to  message me if you have a question and I'll do my best to come back to  you quickly.  </p>\n\n\n\n<p>  \t  \t<em>\"Ben Hewlett is the UK's most respected harmonica  teacher and most prolific author. He will lead you through the ins and  outs of harmonica playing through a series of short video lessons. His  teaching style is confident, practiced, humorous, skillful,  knowledgeable and packed with information in bite sized chunks.\" </em>  </p>\n\n\n\n<p>  \t  \t                            I am used to teaching all over the  world at prestigious harmonica festivals, one to one, groups, night  school, corporate teambuilding, as a guest lecturer on cruise ships and  but now it's your turn!  </p>\n\n\n\n<p>  \t        Do you want to get so good you'll be able to confidently play  the songs you love for family and friends, jam with musicians, or even  play on stage with a band?  </p>\n\n\n\n<p>  \t        Don't play an instrument? Learn the Harmonica, it's easy, cheap, portable, and sounds great.  </p>\n\n\n\n<p>  \t        If you can breathe you can play the harmonica.  </p>\n\n\n\n<p>  \t        Why play the harmonica?  </p>\n\n\n\n<ul>  \t<p>  \t\t        ·It's easy to play – you don't even need to use fingers  \t</p>  \t<p>  \t\t        ·The harmonica is an accessible and relatively easy introduction to music  \t</p>  \t<p>  \t\t        ·You can play scales and tunes over three octaves  \t</p>  \t<p>  \t\t        ·You can play rhythms with chords, as well as melodies (sometimes even both at the same time!)  \t</p>  \t<p>  \t\t        ·You can also play pairs of notes simultaneously using different intervals, including octaves  \t</p>  \t<p>  \t\t        ·It's cheap and fits in your pocket  \t</p>  \t<p>  \t\t        ·You can play along / accompany on the piano – the harmonica equates to the white notes on the piano  \t</p>  \t<p>  \t\t        ·It sounds great right out of the box  \t</p>  </ul>\n\n\n\n<p>  \t        You can learn to play it chromatically (all the sharps and  flats) but most people generally don't get to this stage so initially we  play it modally to access C major, D minor (dorian), E minor  (Phrygian), F major (Lydian), G major (mixolydian) A minor (aeolian), B  minor (locrian)  </p>\n\n\n\n<p>  \t        You can play the Blues – where it is best known  </p>\n\n\n\n<p>  \t        You hear it on adverts and TV theme tunes all the time – now you can join in  </p>\n\n\n\n<p>  \t        A lot of bands use the harmonica as part of their show – that could be you  </p>\n\n\n\n<p>  \t        There are a thousand harmonica performances viewable for free on YouTube – you thought you were the only one?  </p>\n\n\n\n<p>  \t        It can lead to work if you want it to; there are many people  who play music in bands and who teach and write about music as a full  time or part time living.  </p>\n\n\n\n<p>  \t        The world's most popular instrument – Guinness book of world records – so they say  </p>\n\n\n\n<p>  \t        You can:  </p>\n\n\n\n<ul>  \t<p>  \t\t        ·Play on stage  \t</p>  \t<p>  \t\t        ·Or with your friends  \t</p>  \t<p>  \t\t        ·Or at a jam session  \t</p>  </ul>\n\n\n\n<p>  \t        The harmonica is a small, versatile instrument played in  nearly every kind of music and most cultures the world over. Though it  may seem confusing to learn at first glance, the harmonica is actually  an easy and fun instrument to get started playing.  </p>\n\n\n\n<p>  \t  \t         'You're not just learning an instrument : you're  exploring your soul. You need what Virginia Woolf called \"a room of  one's own,\" i.e., a place where you can practice obsessively and/or cut  loose without worrying too much about the wife or husband, the roomate,  the dogs, the kids, or the neighbors overhearing and critiquing you.  This can be your bedroom or bathroom, a stereo room, the basement, an  office, or it can be outdoors, in an abandoned park tunnel or along a  windswept boardwalk--anywhere in which you feel as though you're away.'  From Adam Gussow's site  </p>\n\n\n\n<p>  \t        Best of all, learning the harmonica is fun.  </p>\n\n\n\n<p>  \t        You all know the sound of a harmonica; you hear it on a  Beatles track, in a Western Movie, in a TV theme tune or on a advert.  It'll always be in classic rhythm and blues songs. The voice of the  harmonica is all around us, it's distinct and wherever it is found, it  always sounds cool.  </p>\n\n\n\n<p>  \t  \t         The harmonica has been enjoyed on top of mountains, in  deserts, jungles, trenches, and prisons and even in a Gemini Space  Rocket, so keeping one in your pocket is no problem.  </p>", 
    "end_date": null, 
    "title": "Learn HARMONICA, amaze your friends and have fun - it's easy", 
    "price": "45.00", 
    "instructors": "Ben Hewlett", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/200598_16d5_11.jpg", 
    "course_url": "https://www.udemy.com/benhewlettharmonicatuitionultimate-harmonica-course/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-17T09:18:05Z"
}