{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t             Welcome to The Passive Trumpet Tutor where you will progressively learn  step by step to quickly play trumpet even when you are not blowing your horn.  </p>  <p>  \t             Each lecture is designed to teach you the trumpet notes and tones as well as key fingering and mouth pressure for each one.  </p>  <p>  \t                As you progress through each lesson you will gain confidence in reading, listening and remembering the fingering as well as observe the patterns and progressions of each note.  </p>  <p>  \t                Each lecture or tutorial includes a fingering chart to highlight each lesson&#039;s focus and will help you to observe the musical patterns both visually as well as listening to each tone or scale. We give you tips along the way as well as a simple quiz to ensure  your comprehension and retention is high.  </p>  <p>  \t   You can also ask questions to ensure  that your can maximize your learning. We are happy to also receive feedback in ways to improve the Passive Trumpet Tutor to benefit your fellow students and trumpet enthusiasts.  </p>  <p>  \t                You will learn where each note sits on the staff, what they sound like, which notes are associated with what fingers also referred to overtone positions and the combination of fingerings with embouchure pressure which we refer to here as positions.  </p>  <p>  \t          Depending how advanced you are we have designed the course so that you can repeat each lecture several times a week before continuing. This course is designed for you to watch a trumpet practice drill and should reflect some of your practice sessions. We use sight, sound and motion to integrate all your learning faculties and accelerate your learning.  </p>  <p>  \t   If you prefer the more faster embouchure position drills or the fingering scale drills you can skip to those at anytime. The Passive Trumpet Tutor will compliment your existing practice and will allow you some time to recover from fatigue and to rest your embouchure.  </p>  <p>  \t             From now on, your practice does not have to stop when you put your trumpet down or get tired. You will quickly gain confidence in your playing and find that not only will you start to read faster but you will also tune your ear and be able to improvise sooner too.  </p>", 
    "end_date": null, 
    "title": "Learn To Play Trumpet Fast Using The Passive Trumpet Tutor", 
    "price": "30.00", 
    "instructors": "Trumpet Genius", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/149602_52eb_8.jpg", 
    "course_url": "https://www.udemy.com/passive-trumpet-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-20T15:19:20Z"
}