{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong><em>Now with 1,300+ satisfied students! </em></strong>  </p>\n\n<p>\t<em>LATEST: Course Updated On June 3rd, 2016 </em></p>\n\n\n\n\n\n<ul>\t<li><em><strong>Would you like to play guitar SO THAT you can worship and play your favorite songs!?</strong></em></li>\t<li><em><strong>Would you like to learn at your own pace, when you want, where you want, and at the most affordable price!?</strong></em></li>\t<li><em><strong>What if you could learn only 4 songs that would unlock a thousand songs!?</strong></em></li>\t<li><em><strong>I believe ANYONE can learn with this method! Yes, even you!</strong></em></li>\t<li><em><strong>Enroll and be jamming in a week!!!</strong></em></li>\t<li><strong><em>30 day, full money back guarantee, with no questions asked!</em></strong></li>  </ul>\n\n\n\n\n\n<p>\t About this course:</p>\n\n\n\n\n\n<p>\t I believe, this is the simplest and easiest way to learn the basics of guitar. Right off the bat I get you playing guitar and learning techniques through PLAYING SONGS! People learn best when they are actively doing what they enjoy! I cut out all the unnecessarily lingo and theory and get you right in.</p>\n\n\n\n\n\n<p>\t After one week, you will be able to play a song!</p>\n\n\n\n\n\n<p>\t Believe it or not, but most worship songs are not very different. Most are either one of four different chord patterns. I will teach you 4 different songs that will empower you to play almost every popular worship song!</p>\n\n\n\n\n\n<p>\t<strong>Artists like,</strong>  </p>\n\n\n\n\n\n<p>\t<em>Hillsong, Tomlin, Crowder, Sovereign Grace, Jesus Culture, and Classic Hymns.</em>  </p>\n\n\n\n\n\n<p>\t<strong>In this course I will teach you,</strong>  </p>\n\n\n\n\n\n<ul>\t<li><strong>\"Crash Course\"</strong> - How to choose a guitar, tune it, strum it, change the strings, how to play a chord, etc.</li>  </ul>\n\n\n\n\n\n<p>\t After the \"Crash Course\" you will start learning how to play songs. I will teach you how to play 4 different songs that contain the basic framework and skills of most songs out there!</p>\n\n\n\n\n\n<ul>\t<li><strong>4 songs that will unlock a thousand. </strong></li>\t<li><strong>How do I continue to progress without this course?</strong></li>  </ul>\n\n\n\n\n\n<ul>\t<li><strong>\"Advanced Songs\"</strong>- If there is a demand, I will continue to add different songs and teach you how to play them focusing on new techniques from each, like slapping, advanced picking, advanced strumming, body percussion, and more.</li>  </ul>\n\n\n\n\n\n<p>\t<strong>How long will it take?</strong>  </p>\n\n\n\n\n\n<p>\t Remember, Udemy frees you up to learn as quick or slow as you want. Its on your terms! But I suggest that it will take the average student about 1-2 months to learn (Depending on your natural talent and diligence).</p>\n\n\n\n\n\n<p>\t While many others would still be learning basic theory, you will be jamming away!</p>", 
    "end_date": null, 
    "title": "Learn Guitar to Worship: Learn 4 Songs and unlock a 1,000! ", 
    "price": "30.00", 
    "instructors": "Sam  Choi", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265888_056a_9.jpg", 
    "course_url": "https://www.udemy.com/learnguitartoworship/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T18:45:17Z"
}