{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>COURSE UPDATES:</strong></p>\n\n<ul><li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p><br></p>\n\n\n\n<p><strong>COURSE DESCRIPTION:</strong></p>\n\n\n\n<p>The Bassoon is an instantly recognizable and fun instrument to play, and MusicProfessor's comprehensive curriculum will help you get the most out of your learning. Master the range, tone, and technique necessary to become a great bassoonist.</p>\n\n\n\n<p>Start from opening your case for the first time and progress all the way to playing your first melodies. On the way, you'll also learn basic music theory and musicianship skills.</p>\n\n\n\n<p>Private lessons cost anywhere from $30 - $100/hr. Factor in driving time and expenses and you realize just how costly lessons can be. Each MusicProfessor Bassoon course provides an entire year's worth of lessons, for a fraction of the cost, and at your own convenience. Plus, each course is taught by an industry leading instructor!</p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>COURSE FEATURES:</strong></p>\n\n\n\n<ul><li>Nearly 80 video lessons</li><li>Downloadable sheet music for each lesson</li><li>Dozens of familiar melodies and songs</li><li>Dozens of technique-building exercises</li><li>Major scales and scale exercises</li><li>Bassoon-specific troubleshooting tips and advice</li><li>Music Theory basics, including how to read music</li><li>Bassoon equipment recommendations</li><li>Bassoon reed troubleshooting tips</li></ul>\n\n\n\n<p>MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy's 30-day guarantee.</p>\n\n\n\n<p>Fulfill your musical destiny by enrolling today!</p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>NOTABLE REVIEWS:</strong></p>\n\n\n\n<p><em>\"This was very helpful - it is hard to find a good lesson that is the right level. Thank you for making your video, pleases I beg you to make more!\"</em></p>\n\n\n\n<p><em>-S. Ferguson</em><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>ABOUT THE INSTRUCTOR:</strong></p>\n\n\n\n<p>Leslie Massenburg began her musical studies with piano at the age of 5. She started playing the bassoon in 1995 and continued to Baylor University for her undergraduate degree in bassoon performance and piano pedagogy. She furthered her bassoon studies with a masters degree from Southern Methodist University and three years at the Aspen Summer Music Festival where she studied with Wilfred Roberts, principal with the Dallas Symphony Orchestra and Per Hannevold, principal of the Bergen Philharmonic in Norway, respectively. </p>\n\n\n\n<p>Leslie is a frequent substitute with the Dallas Symphony, recently accompanying them on their residency in Vail, as well as the Ft. Worth Symphony, Dallas Summer Musicals, and the New World Symphony in Miami, Florida.  Leslie is the principal bassoonist for the Las Colinas, Garland, and Arlington Symphonies, the contrabassoonist for the Dallas Wind Symphony and Plano Symphony, and plays second bassoon for Enviso.</p>\n\n\n\n<p>Leslie is adjunct bassoon professor for Brookhaven College and has an extensive private teaching studio in the Dallas area. In the summers, she has served as bassoon faculty at Baylor University Summer Music Camps and is the director of the Bassoon Academy of Dallas. She recently completed filming for MusicProfessor, a series of online, interactive bassoon lessons for schools and students without access to a private teacher. Leslie lives with her husband and children in Richardson.</p>\n\n\n\n<p>—</p>\n\n\n\n<p>This course has been provided by MusicProfessor.com, an online music education company.</p>", 
    "end_date": null, 
    "title": "Learn to Play Bassoon: Beginner to Pro in Under Four Hours!", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/457206_ef33_2.jpg", 
    "course_url": "https://www.udemy.com/beginning-bassoon/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T22:49:27Z"
}