{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>What is the course all about?</strong></p>  <ul><li>This Course is all about understanding Complex Carnatic Music Exercises that Include ‘Janti Varses, Tharasthayi Varses, Mandrasthayi Varses.  </li><li>This course also covers a very interesting Music Theory and also a new Raga is explained with systematic fingering chart and example exercises</li><li>This course is ideally for those who are interested in Indian Classical Music, who have a very basic knowledge about the instrument like ‘Holding the instrument correctly, getting the sound and who can play basic Sarali Varses </li></ul>      <p><strong>What kinds of Materials are included?</strong></p>  <ul><li>Professional Quality pictures and Block Diagrams are used to explain concepts to make it more interesting.</li><li>PDF files at the end of every section with summary and exercises</li><li>The videos are of very High quality with lesson highlights and key pointers embedded in 'High Quality - PNG images' in the background</li></ul><p><strong></strong></p><p><strong>How long will the Course take to complete?</strong></p><ul><li>The complete course is for around 3.5 Hrs.</li><li>To complete the course with perfection, it will take close to 2 - 3 months where the students have to dedicate 1/2 Hour ~ 45min daily for practice</li></ul>      <p><strong>How is the Course Structured?</strong></p>  <ul><li>This course is structured systematically where complex exercises pertaining to Carnatic Music System are decoded and explained in a simplest way possible. </li><li>For Example, A 10- line complex exercise will be decoded taking only 2 lines per explanatory slide that highlights difficulties and possible solution to overcome them in a High-quality Video embedded in each slide</li><li>The exercises related to syllabus are explained clearly and few assignment exercises are added towards the end of couple of chapters to bring in more confidence.</li><li>An interesting Carnatic Theory Concept pertaining to Different Types of Swaras are explained systematically with block diagrams and examples</li><li>One of the Parent Raga called Shankarabaranam is introduced and is explained systematically with importance of learning the Raga with some explanatory exercises and assignments</li><li>Step by Step Tutorial for Indian National Anthem  - Jana Gana Mana is covered at the end of the tutorial</li><li>PDF notes are included at the end of each section with a brief about what was covered in that particular section</li><li>This course is Structured systematically keeping in mind the wide range of age group 10 ~ 55 Years</li></ul>                    <p><strong>Why take this course? What are my Key - Takeaways?</strong></p>  <ul><li>Take this course to understand the complex Carnatic Music exercises in the simplest way possible</li><li>Take this course to cherish your dream of learning the famous ‘Indian National Anthem’ </li><li>Take this course to get a flavor of '<strong>Richest South Indian - Carnatic Music</strong>' through this divine instrument</li><li>At the end of this course, you will feel proud to have known the Complex Carnatic Music Exercises and a new Raga and would be enjoying yourself playing the famous Indian National Anthem – Jana Gana Mana with confidence!</li></ul>", 
    "end_date": null, 
    "title": "Learn Basics of South Indian Carnatic Flute - Level 2", 
    "price": "50.00", 
    "instructors": "Sriharsha Ramkumar", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644654_8c5a_2.jpg", 
    "course_url": "https://www.udemy.com/carnatic-flute-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T12:15:00Z"
}