{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>By the end of this course, you'll be to play one of the favorite pieces for classical guitar, Fernando Sor's \"Study in B minor.\" The course is split up into small, manageable sections so you'll be able to learn quickly and see progress immediately. By taking this course you'll join a group of over 1300 guitarists, and be able to play this piece up to a performance standard. </p><p><strong>By the end of this course, you can expect to</strong>:</p><ul><li>Be able to play a simple but beautiful piece of music from beginning to end</li><li>Learn how advanced players bring out the melody while playing an arpeggio texutre</li><li>Have tools for problem-solving and know exactly how to practice tricky sections.</li></ul><p>This is a relatively short, easy-to-follow course on a commonly played and taught composition for classical guitar. It's so commonly played for a reason, and it's a great piece that can help you get better and move to the next level as a classical guitarist. </p><p>The Study in B minor is that difficult, but by approaching it as it was meant to be approached, as a study, you can start building good habits and improving your classical guitar playing. </p><p>You'll have a great time going through this course and you'll be able to learn easily because you can clearly see the hands from a variety of angles (a must in any guitar course). You'll have lifetime access to the course and you'll be able to download PDF files of the sheet music for the music.</p><p>You can start playing better and having a great piece of music that you can perform and play for others (or just yourself), but you have to start sometime. You can click the button that says \"Start Learning Now\" to start playing Fernando Sor's \"Study in B minor.\"<br></p><p><span></span><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Learn to Play Fernando Sor's \"Study in B minor\"", 
    "price": "20.00", 
    "instructors": "Brian Riggs", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/149716_3055_2.jpg", 
    "course_url": "https://www.udemy.com/study-in-b-minor/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-20T19:26:45Z"
}