{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>If you want to learn how to play the piano, but have little to no experience, this course if for you! If you have some experience with music or piano, and want to learn the techniques to become a master, this course may be for you too! Sign up now by clicking the enroll button.<br></p><p><br></p><p>In this course, you will learn:</p><p><strong>Section 1: Welcome to the Course </strong></p><p><span></span><strong><em>Introduction: Presentation and Overview</em></strong></p><ul><li>Learn about Juan and his experience being a pianist. </li></ul><p><strong><em>Course Overview</em></strong></p><ul><li>In this lecture, we will discuss the tools you will need to start this course. We assume you do not have any experience with music, or the piano. We will discuss what you will learn in the three sections of this course, including how to read sheet music, scales, and how to read chords. </li></ul><p><strong><em>What is the perfect piano for me?</em></strong></p><ul><li>Learn about the various types of pianos and decide which one is right for you. We will be discussing keyboards &amp; synthesizers, digital pianos, and acoustic pianos.</li></ul><p>----------</p><p><strong>Section 2: How to Read Sheet Music</strong></p><p><strong></strong><strong><em>Why Reading Sheet Music is Useful </em></strong></p><ul><li>Learn why it’s important to understand how to read sheet music if you want to become a great pianist. </li></ul><p><strong><em>The Staff</em></strong></p><ul><li>Learn what the staff is, and how it relates to reading sheet music. You may recognize the staff if you’ve ever seen sheet music, now you get to learn what it’s all about!</li></ul><p><em><strong>The Musical Notes</strong></em></p><ul><li>Now that you understand the staff, let’s start to study the notes that are found on the staff. You’ll learn how to interpret what a note is trying to tell you based on its location, size, and shape.</li></ul><p><em><strong>Song Practice: “Twinkle, Twinkle, Little Star”</strong></em></p><ul><li>Get your first practical experience playing a piano by playing a true classic “Twinkle, Twinkle, Little Star”. You’ll see how to play, step by step.</li></ul><p><em><strong>Song Practice: “Over the River &amp; Through the Woods”</strong></em></p><ul><li>Get some more practice by playing “Over the River &amp; Through the Woods”. You’ll see how to play, step by step.</li></ul><p><em><strong>Tempo (Speed)</strong></em></p><ul><li>Learn what Tempo is, how to measure it, and how it effects your music.</li></ul><p><strong><em>Playing the C Scale</em></strong></p><ul><li>In this video we will play the C scale, and learn about why the C scale is important. </li></ul><p><strong><em>What About the Black Keys?</em></strong></p><ul><li>Have you ever wondered what the black keys on pianos are for? Well in this video you’ll learn what they’re for, and how to use them properly.</li></ul><p>----------</p><p><strong>Section 3: Scales, Hanon and How to Become a Virtuoso Pianist </strong></p><p><strong></strong><strong><em>What is Hanon?</em></strong></p><ul><li>Hanon is all about training your fingers for the piano. In this video, we’ll show you the best exercises available. Training your figures is the first step in become an expert pianist.</li></ul><p><em><strong>The Hanon Exercises</strong></em></p><ul><li>It this video, you’ll learn the Hanon exercises that you need to play everyday if you’re serious about becoming a great pianist. The exercises will take you about an hour a day depending on how fast you catch on, and how naturally gifted you fingers are. </li></ul><p>----------</p><p><strong>Section 4: Chords, Common Progression and Learn 70+ Songs</strong></p><p><strong></strong><strong><em>What is a chord?</em></strong></p><ul><li>Long story short, a chord is when you play more than one note at a time. Learn about the importance of chords in music, and the best ways to play them.</li></ul><p><em><strong>The Four most Important Chords</strong></em></p><ul><li>There are four chords that are responsible for some of the most famous songs in history. Learn about them, and how to play them, in this lecture. </li></ul><p><strong><em>How to Play 70+ Famous Songs</em></strong></p><ul><li>Lets review some of the songs you’ll be able to play once you master the four most important chords.</li></ul><p><strong><em>Three Famous Song Examples</em></strong></p><ul><li>We play a snip-it of three famous songs, to show you what’s possible with just four chords. </li></ul>", 
    "end_date": null, 
    "title": "Learn to Play Piano From a Concert Pianist - For Beginners", 
    "price": "20.00", 
    "instructors": "Think Forward Online Training, Juan Carlos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/666322_2a4e_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-play-piano-from-a-concert-pianist-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T00:38:21Z"
}