{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>COURSE UPDATES:</strong>  </p>\n\n<ul>  \t<li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul><p><br></p>\n\n<p><strong>COURSE DESCRIPTION:</strong></p>\n\n\n\n<p>  \t    Saxophone is an extremely fun instrument to play, and MusicProfessor's comprehensive curriculum will help you get the most out of your learning. Master the range, tone, and technique necessary to become a great sax player.  </p>\n\n\n\n<p>  \t    Start from opening your case for the first time and progress all the way to playing your first melodies. On the way, you'll also learn basic music theory and musicianship skills.  </p>\n\n\n\n<p>  \t    Private lessons cost anywhere from $30 - $100/hr.  Factor in driving time and expenses and you realize just how costly lessons can be.  Each MusicProfessor Saxophone course provides an entire year’s worth of lessons, for a fraction of the cost, and at your own convenience.  Plus, each course is taught by an industry leading instructor!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>COURSE FEATURES:</strong>  </p>\n\n\n\n<ul>  \t<li>Over 75 video lessons</li>  \t<li>Downloadable sheet music for each lesson</li>  \t<li>Animated fingering charts</li>  \t<li>Dozens of familiar melodies and songs</li>  \t<li>Dozens of technique-building exercises</li>  \t<li>Major scales and scale exercises</li>  \t<li>Saxophone-specific troubleshooting tips and advice</li>  \t<li>Music Theory basics, including how to read music </li>  \t<li>Saxophone equipment recommendations </li>  </ul>\n\n\n\n<p>  \t    MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy’s 30-day guarantee.  </p>\n\n\n\n<p>  \t    Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>NOTABLE REVIEWS</strong>  </p>\n\n\n\n<p>  \t<em>“Just starting. So far, first impressions are excellent : very professional recording and very clear explanations.  I started learning sax a few years ago with a teacher. This is a great way to get a \"refresher\" and get back to train and play. Thanks !!!”</em>  </p>\n\n\n\n<p>  \t    -G. Bochi  </p>\n\n\n\n<p>  \t<em>“So far it's really easy to follow. Fantastic job with the lessons!!”</em>  </p>\n\n\n\n<p>  \t    -T. Lee  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR:</strong>  </p>\n\n\n\n<p>  \t    Born and raised in the Chicago area, Los Angeles-based saxophonist-composer Dave Wilson graduated from the Indiana University Jacobs School of Music, studying under David Baker, Tom Walsh, and Pat Harbison. Following that, he lived in Macedonia for two years,working in the non-profit sector yet immersed in a world of Balkan music, performing with local folk, jazz, and rock musicians in the studio, in local clubs, and at festivals.  </p>\n\n\n\n<p>  \t    His collaborators have included Curt Smith (Tears for Fears), Dave Stewart (Eurhythmics), Engelbert Humperdinck, James Torm, composer Mateo Messina (Juno, Thank You for Smoking), producer Charlton Pettus, and French gypsy jazz artist Jessica Fichot.  </p>\n\n\n\n<p>  \t    His performance work has taken him to the stages of the Chicago World Music Festival, the Lotus Festival, the Guadalajara International Book Fair, the London Palladium, the Sydney Opera House, and the Araneta Coliseum, where Ali and Frazier met at the Thrilla in Manila. In 2010 at the Walt Disney Concert Hall in Los Angeles, he debuted Light Connected, a piece for clarinet, alto flute, cello, bass, cajon, dancer, and spoken word poet that he conceptualized and co-composed.  </p>\n\n\n\n<p>  \t    In addition to his work as a composer-musician, Dave just completed a Ph.D. in Ethnomusicology at UCLA's Herb Alpert School of Music. His work there focused on the Macedonian folk tradition, and on how traditional and popular music reflect, articulate,and construct national identity, politics, class, and ethnic tensions in the context of a post-socialist capitalist society.  </p>\n\n\n\n<p>  \t    —  </p>\n\n\n\n<p>  \t<em>This course has been provided by MusicProfessor.com, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Learn to Play Saxophone: Beginner to Pro in Under Four Hours", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174562_9df5_8.jpg", 
    "course_url": "https://www.udemy.com/saxophone-a-beginners-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-28T19:10:15Z"
}