{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t I designed this course for singers, songwriters, and music producers who were tired of not being able to play the piano for themselves. To get you playing the piano fast, I start off by teaching you to play chords first. After you learn chords, we put the chords together to play chord progressions; chord progressions are what most songs are made of.  </p>  <p style=\"\">  \t There are 3 (three) books provided in pdf form along with audio clips that support the video lessons. You watch the video(s) and then read the corresponding section of the book, you can also listen to audio clips of what you want to learn next. Watching just the videos, you will be able to play the piano, the books and audio clips are for those who want to learn more chords and progressions.  </p>  <p style=\"\">  \t This is a self-paced course, it will take from a couple of weeks to a few months to finish. As with any instrument, you will have to practice to develop your ear for hearing and skill in playing the piano. The more you put into it, the more you get out of it.  </p>  <p style=\"\">  \t The course is broken into 8 (eight) sections. You will go from the basics, including how to play chords, tricks to sounding professional and how to find the key of a song to playing advanced chords in a matter of weeks.  </p>  <p style=\"\">  \t Take this course to give yourself the musical freedom you&#039;ve always wanted.  </p>", 
    "end_date": null, 
    "title": "Learn To Play The Piano Using Pop, R&B and Gospel Chords", 
    "price": "50.00", 
    "instructors": "Andrae Alexander", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104304_231a_6.jpg", 
    "course_url": "https://www.udemy.com/learn-to-play-the-piano-using-pop-rb-and-gospel-chords/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-10T20:16:36Z"
}