{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t  This course covers the basics such as holding  the violin and bow properly and tuning the instrument. It progresses through the scales and culminates in learning a few simple songs. It is taught by video lessons with straightforward, easy to follow instructions. There is also some supplemental material to help guide you along the way.  There are lectures on the extras such as the proper way to hold the instrument, as well as lectures focusing on different techniques to improve your playing.  </p><p>Students who enroll will get to learn a challenging instrument without having to take costly private lessons. This course is about the equivalent of 6-12 months of private violin lessons, so could take anywhere from one month to twelve months to complete.  It all depends on how much time you have to put into it.</p><p>This course is a very low pressure way to get to learn a new instrument.  Without the time commitment and cost of weekly private lessons, students will be able to discover the joy of playing the violin without any added pressure. </p><p>If you have ever had any interest in learning a musical instrument, then this course if for you.  It starts with the basic foundations and builds from there, so you do not need to have any previous music experience.  If you want to be able to enjoy playing some simple songs on the violin, but would also appreciate having the correct technique while doing so, then you would greatly benefit from this course.</p><p>Above all, this course is for anyone with a love of music.  You can take the course yourself, give it as a gift to friends or family, or to anyone you know that also loves music.  With a 30 day money back guarantee and lifetime access, you can be confident in your purchase.  Lifetime access will also allow you to take as long as you need to complete the course, and will also allow you to go back and review lectures once you have completed it.  It's a fail safe way of learning the violin.  <br></p>", 
    "end_date": null, 
    "title": "Learn the Violin - No Music Experience Necessary!", 
    "price": "30.00", 
    "instructors": "Kathleen Kromphardt", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342398_c4b4_2.jpg", 
    "course_url": "https://www.udemy.com/learn-the-violin-no-music-experience-necessary/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T14:25:49Z"
}