{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<h4><strong style=\"\">Welcome Future Jazz Master!</strong></h4>  <p>  \t                               Learn Jazz piano faster than ever – be one of the first to take on this science-based course for Jazz piano on Udemy.  Perfect for intermediate to advanced players; designed and taught by Jazz pianist, music cognition specialist, and lifehacker MacLain Christie.  </p>  <h4><strong style=\"\">The Goal</strong></h4>  <p>  \t                                    Imagine that you’re out at a social gathering. The atmosphere is classy; maybe you have a cocktail in your hand. Out of the corner of your eye you notice a handsome piano alone in the back of the room. Wouldn’t it be smooth if you had the confidence and piano chops to waltz over there and surprise everyone with a beautiful Jazz ballad?  </p>  <p>  \t                                     Whether you want to become the unexpected Jazz piano virtuoso, a gigging musician (or a better one), the local favorite at an open-mic jazz club, or you just want to entertain your friends and loved ones, this course will give you the confidence and skills you need to get there.  </p>  <h4><strong style=\"\">The Secret to Success</strong></h4>  <p>  \t                                You can go the traditional route and spend thousands of dollars a year on top notch piano lessons. But if you don’t practice, it’s a complete waste of money. That&#039;s why the <strong style=\"\">number one goal of this course is to make sure that you actually practice</strong>. This is the only way you’re going to massively upgrade your Jazz piano skills. Most piano teachers take your money and don&#039;t care if you come back the next week having practiced. Fortunately, I really care. I care so much that I&#039;ll actually <strong style=\"\">pay you 30% back</strong> if you reach your practice goals. What&#039;s better, I&#039;ve designed this course specifically to make it easier for you to achieve success.  </p>  <h4><strong style=\"\">During This Course You&#039;ll:</strong></h4>  <ul style=\"\">  \t<li>Learn 10 Jazz piano standards in 10 weeks </li>  \t<li><strong style=\"\">Win cash back</strong> if you actually practice!</li>  \t<li>Learn an invaluable method for highly efficient piano practice that you can use for the rest of your life</li>  \t<li>Learn the science behind rapid skill acquisition and behavior change</li>  \t<li>Be held accountable for your progress - <em style=\"\">I want you to win</em></li>  \t<li>Receive weekly support and check-ins from your instructor</li>  \t<li>Track and review your progress</li>  \t<li>Save thousands of dollars in traditional piano lesson fees</li>  </ul>  <p>  \t<strong style=\"\">Extras</strong>  </p>  <ul style=\"\">  \t<li>Learn how to increase mindfulness for improved piano practice and performance</li>  \t<li>Design your practice space for enhanced focus</li>  \t<li>Plus a couple surprises</li>  </ul>  <h4><strong style=\"\">Why it Works</strong></h4>  <p>  \t<strong style=\"\">A Jazz piano course based in science.</strong>  </p>  <p>  \t                                     The design of “Learn Jazz Piano Fast” integrates the latest research from cognitive science, behavioral science, and behavioral economics to help you learn faster and stick to a high quality practice regimen. There’s a lot to know about learning and memory, rapid skill acquisition, and behavior change. In this course you’ll use essential principles to optimize your Jazz piano study so that you get the biggest bang for your buck. If you&#039;re ready to become the Jazz piano player you&#039;ve always wanted to be, enroll today!  </p>  <p>  \t*Note that a key part of this course is to learn by ear. For this reason there will be no lectures demonstrating how to play. Instead, the goal here is to create more growth in less time by guiding you towards highly focused and productive practice.  </p>", 
    "end_date": null, 
    "title": "Learn Jazz Piano Fast - A Lifehacker's Guide to Jazz Mastery", 
    "price": "20.00", 
    "instructors": "MacLain Christie", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/316256_2234.jpg", 
    "course_url": "https://www.udemy.com/learn-jazz-piano-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-09T02:56:54Z"
}