{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<div></div>\n\n<p><em><strong><em>COURSE UPDATES:</em></strong></em></p>\n\n<ul><li><em class=\"redactor-inline-converted\">(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p><br></p>\n\n<div><strong class=\"redactor-inline-converted\">COURSE DESCRIPTION:</strong><br></div>\n\n<p>  \t              Playing in the Percussion section can be extremely challenging, but also extremely fun and rewarding.  MusicProfessor's comprehensive curriculum will help you get the most out of your learning, and help you master the techniques needed to become a great percussionist.  </p>\n\n\n\n<p>  \t              Start from learning basic stick and mallet grips to building your muscles and instrument know-how. On the way, you'll also learn basic music theory and musicianship skills.  </p>\n\n\n\n<p>  \t              Private lessons cost anywhere from $30 - $100/hr. Factor in driving time and expenses and you realize just how costly lessons can be. MusicProfessor's Percussion course provides an entire year’s worth of lessons, for a fraction of the cost, and at your own convenience. Plus, each lesson is taught by an industry leading instructor!  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\"><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">COURSE FEATURES:</strong>  </p>\n\n\n\n<ul>  \t<li>Nearly 200 video lessons</li>  \t<li>Downloadable sheet music</li>  \t<li>Dozens of technique-building exercises</li>  \t<li>Major scales and scale exercises</li>  \t<li>Percussion-specific troubleshooting tips and advice</li>  \t<li>Music Theory basics, including how to interpret rudiments and percussive notation</li>  \t<li>Percussion equipment recommendations </li>  \t<li>Learn how to repair and maintain each instrument</li>  </ul>\n\n\n\n<p>  \t              MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy’s 30-day guarantee.  </p>\n\n\n\n<p>  \t              Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\"><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">ABOUT THE INSTRUCTORS:</strong>  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Cory Hills - </strong>  </p>\n\n\n\n<p>  \t              Multi-percussionist, composer, and improviser Cory Hills thrives on breaking down musical barriers through creative, interdisciplinary projects. He has received degrees from Northwestern University, Queensland Conservatorium, and the University of Kansas, and was awarded a research fellowship to Institute Fabrica. Currently, Hills is active performer, composer, and recording artist in Los Angeles, as well as a member of the Grammy-nominated Los Angeles Percussion Quartet.  </p>\n\n\n\n<p>  \t              An advocate of new music, Hills has individually commissioned and premiered over 70 new works for percussion. He has given solo and chamber recitals across Europe, Australia, The United States, Mexico, and China. These include a featured performance for the International Society of Improvised Music, the Days of New Music Festival in Chisinau, Moldova, the Queensland Music Festival, the Ravello Concert Festival, the Venice Art Biennale, four PASIC conventions, and the Morelia Percussion Festival. An advocate for percussion as an artistic discipline, Hills has been the artist-in-residence at Rocky Mountain National Park, Conservatorio de Las Rosas (Morelia, Mexico), and a fellow at the OMI international artists colony.  </p>\n\n\n\n<p>  \t              Percussive Storytelling, a program that brings classical music and storytelling to kids in fun and accessible ways, was launched by Hills while he was a fellow at Institute Fabrica. The program recently marked its 320th performance, and has reached more than 22,000 children in eight countries. For this work, Hills has been the recipient of numerous arts grants, and was named the 2009 Emerging Artist through the Kansas Arts Commission. The Lost Bicycle, Hills debut solo CD of percussive stories, has received four national parenting and creative arts awards (NAPPA Parents Awards Gold, Parents Choice Award Silver, World Storytelling Honors Award, and a Creative Child preferred choice).  </p>\n\n\n\n<p>  \t              Hills is an artist for Innovative Percussion, Remo, Yamaha, Sabian, and Black Swamp Percussion.</p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">--  </strong>  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Matthew Cook - </strong>  </p>\n\n\n\n<p>Matt Cook is a GRAMMY® Award winning percussionist based in Los Angeles, CA. He is known for his work with the Los Angeles Percussion Quartet, the experimental classical ensemble WildUP, and microtonal band PARTCH. He is also involved in projects ranging from folk rock music to jazz and international ensembles. </p>\n\n\n\n<p>Matt’s work is often heard on studio and film recordings but can be seen in performance at major concert halls and venues across the country. As an educator, Matt has been a featured clinician and performer at several universities including Stanford, The San Francisco Conservatory of Music and the University of Southern California. He also presents at events like the Percussive Arts Society’s International Convention and the American Composers Jazz Institute. </p>\n\n\n\n<p>He has experience consulting and designing curriculum for university students and k-12 programs with success securing them scholarships to major conservatories and Honor bands across the country. He is Instructor of Percussion at Fullerton and Ventura Colleges. </p>\n\n\n\n<p>  \t              —  </p>\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\">This course has been provided by MusicProfessor, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Learn to Play Percussion: Beginner to Pro made the Easy Way!", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374566_dbff_2.jpg", 
    "course_url": "https://www.udemy.com/percussion/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T17:24:12Z"
}