{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t            Quieres aprender a tocar la guitarra pero te falta tiempo, te duelen los dedos y con tanto tutorial en internet no sabes por donde empezar.  </p>\n\n<p>  \t            Empieza por los acordes. <strong>Los acordes son el corazón de una canción</strong>.  </p>\n\n<p>  \t            ¿Sabias que la mayoría de las canciones tienen de 3 a 5 acordes? ¿y sabías que siempre se repiten los mismos acordes una y otra vez? Son solo 7 acordes.  </p>\n\n<p>  \t            Con este curso te darás cuenta de lo sencillo que es poner los 7 acordes para tocarlo todo, de simplificarlos para que no te cueste poner cejilla, y de aprenderte tus canciones favoritas en muy poco tiempo.  </p>\n\n<ul>  \t<li>Si aprendes a tocar desde cero hemos diseñado este curso para hacer fácil lo difícil, que te sientas menos torpe, que aprendas poco a poco, y que domines los acordes de guitarra en un fin de semana intensivo.<br>  \t<br>  \t</li>  \t<li>Si ya ya sabes tocar la guitarra, ¿sabías que puedes progresar el doble de rápido si tu mejor amigo toca la guitarra? Prueba a regalarle este curso desde la pestaña \"Regalo\". Te lo agradecerá siempre y yo también.</li>  </ul>\n\n<p>  \t<strong> 10 años de docencia y 170.000 seguidores en Youtube</strong><strong> nos respaldan. Estos son algunos testimonios de nuestros alumnos: </strong>  </p>\n\n<p>  \t<em>\"Amigo, entendí más de la guitarra viendo 20 minutos de tus vídeos que viendo los libros de guitarra que tengo desde los 7 años. FELICITACIONES!\" </em>-judiac95  </p>\n\n<p>  \t<em>\"Muy buen curso. La mayoría de los profesores saben tocar pero no tienen ni idea de enseñar. El alumno necesita entender lo que está haciendo\"</em> -hudini430<br>  \t<br>  \t<em>\"Me encantas tío dices las cosas tal y como son sin fanfarria y sin po****. Muchísimas gracias si algún día me hago músico profesional a unos de los que les daré las gracias será a ti.\"</em> -narfcisco95<br>  \t<em><br>  \t            \" Fue mi base para ser lo que ahora soy de guitarrista. He mejorado mucho! sigo siendo novato pero el cambio es radical! GRACIAS!!\" </em>- Alex Lara  </p>\n\n<p>  \t            Además este curso es interactivo y puedes:<strong></strong>  </p>\n\n<ul>  \t<li>Preguntarme directamente para que te responda</li>  \t<li>Seguir este curso también en tu smartphone o tableta</li>  \t<li>Bajarte documentos con trucos, herramientas y consejos para tu guitarra<br>  \t</li>  </ul>\n\n<p>  \t           Toma este curso por menos de lo que vale una clase particular y si no te gusta te devolvemos el dinero.  </p>", 
    "end_date": null, 
    "title": "Los 7 Acordes para Tocarlo Todo en un fin de semana", 
    "price": "20.00", 
    "instructors": "Chachi Guitar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/55569_9385_8.jpg", 
    "course_url": "https://www.udemy.com/los-7-acordes-para-tocarlo-todo/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-21T16:52:03Z"
}