{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course is for anyone interested in making electronic music with the amazing technology the iPad has to offer.</p>\n\n<p>Whether you've made music before or have never touched an electronic instrument, there are new and exciting skills to be learned here. Your iPad is a powerful music creation tool and the music apps available to everyone on the app store represent some of the most advanced music technologies out there.</p>\n\n<p>All of the apps are free to download, and the course is designed for you to follow along with me as I cover the essential concepts involved in creating electronic music such as synthesis, performance techniques and the principles of sound design. Think of this course as an interactive experience where you will learn by doing. Included are workshops with some of the very best music apps out there, sound creation exercises that explore how to make specific types of instruments and effects, my own specific philosophies on making music intuitively, a comprehensive beatmaking class in a wide variety of styles and genres, and app recommendations at the end of each chapter will guide you on your music making journey long after the course is finished.</p>\n\n<p>This is not a traditional music course or recording class, instead it’s a new kind of learning platform where you are an active participant, playing along with the music apps and experiencing the technology for yourself. The goal of this course is to gain autonomy through a deeper understanding of how electronic music works and the essential techniques involved in its creation, such as how to use an LFO to build more dynamic sounds, automating modulation for performance and layering sounds for richer sonic qualities. Music making should be fun and involving, and this course is designed to reflect that excitement.</p>\n\n<p>Through the apps, you’ll learn to make beats in a variety of styles, build your own track from scratch and perform them in realtime, work with powerful synthesizers and experience new instruments that could only exist on the iPad. Music making is a skill like anything else, and this course will provide you with the knowledge and understanding to approach it with confidence and inspiration.</p><p>I invite you to join me in exploring the iPad as an endless source of musical enjoyment and creative possibilities.</p>", 
    "end_date": null, 
    "title": "Make Electronic Music with the iPad", 
    "price": "20.00", 
    "instructors": "Michael Feld", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794398_3a6f_2.jpg", 
    "course_url": "https://www.udemy.com/playspacemusic/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T04:11:35Z"
}