{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><strong style=\"\"></strong></strong>  </p>  <p style=\"\">  \t        In this course you&#039;ll learn to <strong style=\"\">master guitar chords</strong> that are fundamental to exploring your favorite songs.  </p>  <p style=\"\">  \t        By the end of the course you will have developed a taste for most of the &quot;open&quot; guitar chords and you&#039;ll also learn exercises that will help you remember them quickly. Also during this course, you&#039;ll start practicing intermediate techniques that include finger style strumming, 7th chords, and a flamenco technique called rasqueo.  </p>  <p style=\"\">  \t     This course will also help you <strong style=\"\">overcome one of the toughest challenges</strong> when learning guitar, that is chord changes. Your instructor Matt will show you a sure-fire way to <strong style=\"\">master chord changes</strong>, a skill that stops many in their tracks.  </p>  <p style=\"\">  \t        This course is structured in three sections:  </p>  <p style=\"\">  \t <strong style=\"\"> 1. The basics</strong> - How to hold your guitar, hand positions, reading tabs and strumming  </p>  <p style=\"\">  \t <strong style=\"\"> 2. The chords</strong> - Develop your knowledge of chords and how to play chords  </p>  <p style=\"\">  \t <strong style=\"\"> 3. Going beyond </strong>- Practicing songs and riffs using the chords you&#039;ve learned  </p>  <p style=\"\">  \t  As well, by using this platform to learn music it allows you to interact and ask questions as you go. Your instructor Matt will be available to answer any questions you have. That said, we expect that this will be a self-sustaining course in that your peers can help you too.  </p>  <p style=\"\">  \t        This course will take you about 1.5 hours to go through all of the material, but learning music should be a lifelong journey. Take your time to master this skill and before you know it you&#039;ll be playing for your friends and family!  </p>  <p style=\"\">  \t        Now, if you want to learn guitar chords and get started playing your favorite songs this course is for you!  </p>", 
    "end_date": null, 
    "title": "Mastering the Art of Guitar Chords", 
    "price": "20.00", 
    "instructors": "Matt Martin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/82960_0c8d_9.jpg", 
    "course_url": "https://www.udemy.com/mastering-the-art-of-guitar-chords/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-24T01:41:57Z"
}