{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Chapter 1 of the Drum-Set Crash Course,</strong> will provide you with the tools necessary to successfully play the drums in no time at all.  I will take you through a logical step-by-step process that focuses on understanding how rhythms are constructed and how to develop the essential coordination needed to comfortably apply that knowledge to the drum-set.  </p><p>If you follow my course and complete each exercise you will be able to play basic rhythms, drum beats and drum fills that will get you through many songs.  Whether your goal is to play Rock, Pop, Hip Hop, Classic Rock, Country, Funk, etc..., <strong>the tools learned in this course will give you the foundation necessary to play most styles of drumming. </strong></p><p>For the price of two private drum lessons, you get nineteen lessons that include HD quality instructional video with multiple camera angles so you can see what I'm doing with the foot pedals in addition to the hands.  PDF files notating the exercises demonstrated.  In addition to me demonstrating the exercises in the videos, I also include audio files of me playing through the exercises in certain lessons that I feel will make the learning experience much easier. </p><p><strong>I have a degree in Music Performance from Towson University and have been teaching and performing for more than 15 years!  Seven of those years were spent touring the world. P</strong><strong>laying upwards of 200 shows a year. </strong>  <br></p><p>I have taken my experiences as both a performer and educator and used it to create a curriculum that I believe is very user friendly, providing a logical step-by-step progression that is informative, engaging and most importantly, fun.     </p><p><strong>My passion for teaching is evident in my students experiences.  Check out what my students are saying about Chapter 1 of the Crash Course:</strong> </p><p><em>What a GREAT course, this is awesome. A plus plus and more. Mike G did a tremendous job with curriculum, explaining things in detail, and production. This course is user friendly and a great value. Mike is an excellent educator &amp; musician which is transparent throughout this course.</em><em></em><br></p><p><em>-Frank Russo</em></p><p><em>Great Curriculum Probably the best Introduction to drumming! This course has a very logical structure and is cleverly designed so that pseudo beginners like me or even complete beginners can profit and learn a lot from these lectures. Every lesson is build on the previous one or extends the previous to a further aspect of drumming. Almost every lesson has pdf file and some have audio clips with the material made even more accessible and to practice separately. Already in lesson 10 there are some improvisations possible with the fills and the variations and i enjoyed this very much. Lesson 13 gives an insight how to transfer the techniques and rudiments around the tom-toms. This freedom to play around almost enlightened me and motivated to practice even more. I do not want to rush through the lessons, so that i have enough pleasure still waiting for me... thank you very much, Mike - this is a great course!!! Almost through and i need to add, that this is the best course i have got from udemy - i am enthusiastic about this great course!!<span><br></span></em></p><p><em><span>-Rainer W</span></em></p><p><em><span>Hi Micheal, just want to give you thumbs up on your Drum-Set Crash Course. I never new how important it is to read drum notes than to just bash away at your drums. Your course have really improved my drumming experience and can't wait for part 2.<span><br></span></span></em></p><p><em><span><span>-Deon</span></span></em></p><p><em><span><span>This drum course is excellent with comprehensive curriculum for drumming fundamentals. You immediately gain confidence during lesson one. Mike effortlessly breaks it down, explains it, demonstrates it, and teaches it with clarity. He keeps you at the perfect pace to grasp the techniques and continue advancing with skill. I highly recommend this course for any age student boy or girl.<span><br></span></span></span></em></p><p><em><span><span><span>-Heather</span></span></span></em></p><p><strong>This an interactive course, so don't hesitate to ask me any questions</strong> if you need help along the way.  I will usually respond within 24 hours.<br></p><p>If you find that this course isn't living up to your expectations, there is a <strong>30 day no questions asked money back guarantee.</strong>  Please let me know what it was that made you lose interest so I can further better my teaching experience for all.  </p><p>Just so you get an idea of what the lessons look like, <strong>you can view three of the lessons for free to help you decide if my course is for you. </strong></p><p>Get started working on fulfilling your dream of playing the drums and<strong> ENROLL TODAY!</strong></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Mike G's Drum-Set Crash Course: Part 1", 
    "price": "35.00", 
    "instructors": "Michael Gambone", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544234_a11f.jpg", 
    "course_url": "https://www.udemy.com/drumlessons/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T17:24:23Z"
}