{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Ever since I was a little kid, I wanted to learn drums.</p><p>My brothers and I would be banging pots and pans and plastic containers in the kitchen, but it never got past that point.</p><p>I wasn't allowed to have a drum kit because of the noise and the price, so I never got to learn the drums.</p><p>Then, about a year ago, I came across something called pen tapping.</p><p>And that's what lead me to my co-instructor, Julius Wright.</p><p>Julius made a name for himself several years ago on Youtube -- his top videos have millions of view each.</p><p>He is one of the top, if not the most prominent, pure pen tappers in the world.</p><p>At the beginning of this year, I decided I wanted to do something to finally learn drums.</p><p>I didn't want to buy a kit, I just wanted to learn the basics of how beat making works. Because it's not just about being able to play in a band, it's about understanding the deep structure of any song.</p><p>The drum is the heartbeat. It's the structure that everything else leans on for direction.</p><p>And it's very important to understand beat making for creating electronic music. </p><p>If you've ever tried a program like FL Studio, you know that having a blank slate in front of you, with infinite options for instruments and notes, can be very intimidating.</p><p>So wanting to learn pen tapping was a combination of all of these reasons.</p><p>I started off on my own, learning pen tapping by slowing down my favorite song by Julius (Midnight over Instrumental) by 8x until it was slow enough that I could start to deconstruct the beat pattern and play it myself on my desk.</p><p>Over the months, I practiced that one song over and over.</p><p>And then one day, I decided to reach out to Julius to see if he might be interested in teaching a course with me.</p><p>Honestly, I never expected to hear back from him. Julius has a lot of things going on and I didn't think teaching a course would be high on his priority list as a musician.</p><p>But it turns out Julius was happy to share his skills with the world, and this course is a result of us working together to create a course that will take you from being an uncoordinated mess like I was to being able to play...and UNDERSTAND...how to make a play beats using pen tapping.</p><p>Pen tapping is the easiest and fastest way to get started playing the drums and understanding percussion and beat making. </p><p>We hope you enjoy the course,</p><p>Timothy and Julius</p>", 
    "end_date": null, 
    "title": "Music Fundamentals: Learn Beatmaking with Pen Tapping", 
    "price": "20.00", 
    "instructors": "Timothy Kenny, Julius Wright", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624118_d75e.jpg", 
    "course_url": "https://www.udemy.com/music-fundamentals-learn-beatmaking-with-pen-tapping/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-27T23:22:39Z"
}