{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">PI-101 Top 10 Classical Piano Pieces for Beginners </strong></p>\n\n<p>In this course, I will show you how to play ten of the most beautiful and famous classical piano pieces for beginners. I am always available for feedback, dialogue, and questions. As a teacher, my goal is to help you master the piano as I do. Teaching you to play the piano is more than a task, it is my passion. I am only satisfied when I see you succeed! It is my hope that you will like my teaching style and that we will hit it off as we together venture out on this musical journey towards piano mastery. Don’t worry if you have never played the piano before: the first week I teach you all you need to get started. On the other hand, if you already know clefs, notes, scales, and chords you can jump straight to the first song. </p>\n\n\n\n\n\n\n\n<p>Easy piano is my mantra and making it as easy as possible for my students is my goal. I show you how to play the piano one hand at a time: first the right hand, then the left hand, and lastly both hands together. We start with easy songs and gradually move on to pieces that teach you new and better techniques. This is fun: you start out knowing very little, and before you know it you are playing famous classical piano pieces by Johann Sebastian Bach, Ludwig van Beethoven, and Antonín Dvořák! I can’t wait to get started. </p>\n\n\n\n\n\n\n\n<p>PI-101 is the first in a series of courses designed to teach you to play some of the most famous and beautiful classical piano pieces. It is an introductory course for beginners containing 12 weeks of lessons. You may take this course even if you have never played the piano before. Check out the schedule below. </p>\n\n\n\n\n\n\n\n<p><strong>Learn to play the piano for beginners through step-by-step instructions by experienced and professional piano teacher:</strong></p>\n\n\n\n\n\n\n\n<p>1st Week: Introduction. Clefs. Notes. Scales. Chords.<br>2nd Week: Learn to play “Allegro” by Alexander Reinagle.<br>3rd Week: Learn to play “Minuet in C” by James Hook.<br>4th Week: Learn to play “Prelude No. 1” by Johann Sebastian Bach.<br>5th Week: Learn to play “Minuet” by Johann Sebastian Bach.<br>6th Week: Learn to play “Fur Elise” by Ludwig van Beethoven.<br>7th Week: Learn to play “Ninth Symphony: by Ludwig van Beethoven.<br>8th Week: Learn to play “Vivace” by Cornelius Gurlitt.<br>9th Week: Learn to play “Gentle Plaint” by Johann Franz Burgmüller.<br>10th Week: Learn to play “Finlandia” by Jean Sibelius.<br>11th Week: Learn to play “New World Symphony” by Antonín Dvořák.<br>12th Week: Piano Exercises. Conclusion.</p>\n\n\n\n\n\n\n\n<p>Good luck!</p>", 
    "end_date": null, 
    "title": "PI-101 Top 10 Classical Piano Pieces for Beginners", 
    "price": 0, 
    "instructors": "Dan Hegelund", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/824044_1c3b_2.jpg", 
    "course_url": "https://www.udemy.com/pi-101-piano/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-17T00:16:59Z"
}