{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">LEARN THE PIANO CHORDS THAT PROFESSIONALS USE.</em></strong>    </p><p>  \t                  This course is designed to teach you to play piano using chords, even if you can&#039;t read music. I show you exactly how professional piano players do it; why they don&#039;t bother with reading sheet music, and yet are able to play any song easily and quickly, sounding as if they have practiced the song for weeks.  </p>  <p>  \t<em style=\"\">See the simple tricks that I have used to earn a living as a full-time pianist and keyboardist for the past 40+ years.</em>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Master chord-based Popular Style Piano in a matter of hours</em></strong><br style=\"\">  </p>  <p>  \t                  Whether you want to play just for fun, play for friends, at parties, or make money playing music, this course will show you how to do it. You will:  </p>  <ul style=\"\">  \t<li>Learn to use the piano as an accompaniment instrument</li>  \t<li>Learn how to build major chords easily in any      key</li>  \t<li>Learn how to create a minor or dominant 7<sup style=\"\">th</sup>      chord</li>  \t<li>Learn augmented, diminished, suspended and major 7th chords  </li>  \t<li>Learn how to play easily with both hands</li>  \t<li>Find out how to read chords from sheet music without      reading the notes</li>  \t<li>Learn in two hours what takes years for most</li>  \t<li>Discover the secrets to turn simple, basic chords into      beautiful, full-sounding Jazz, Rock, and Gospel chords.</li>  </ul>  <p>  \t                  +++++++++++++++++++++++++++++  </p><p>  \t<strong style=\"\">Learn quickly and efficiently how to sound skilled on the piano</strong><br style=\"\">  </p>  <p>  \t    If you want to make beautiful music on the piano without years of grueling, expensive lessons, this is the course you want.  </p>  <p>  \t<em style=\"\">I do not teach note-reading in this course. If your goal is to play Beethoven, Bach, or other classical music, this course is not for you. It is a course in popular piano playing.</em>  </p>  <p>  \t    I spent years taking weekly lessons as a child, studying music in school and college – but when I became a full-time, professional piano player 45 years ago, I discovered that most of what I learned did not apply to what I was trying to do. I wanted to play popular music in night clubs, cabarets, casinos and show rooms. I learned more from working with other professional musicians than I ever did from teachers, either privately or in school.  </p>  <p>  \t                  What I show you in this course are the things that I learned to make music easy, effective and fun. It&#039;s how the pros play.  </p>  <p>  \t<em style=\"\">In addition, you have an unconditional,no questions asked, 30 day, money-back guarantee. Nothing at risk!</em>  </p>", 
    "end_date": null, 
    "title": "Piano: The Chord Based System - Learn To Play As The Pros Do", 
    "price": "20.00", 
    "instructors": "Stan Prentice", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398746_ea53_2.jpg", 
    "course_url": "https://www.udemy.com/learn-popular-piano-successfully-have-fun-making-music-now/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T02:36:43Z"
}