{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This is a complete learning experience of professional piano lessons, delivered by an experienced piano teacher in a real-life environment. You will feel like you're gaining personal tuition, as you follow close-ups of the finger movements and learn from whiteboard lessons. You also have PDFs to print out of all the main learning points and of course the music you are learning. With 30 videos totaling 4 hours of learning (including a bonus piece at the end), and lots of supporting PDFs, you have everything you need here to get off to a flying start playing the piano.</p><p>Piano lessons are sometimes started by people just like you and then, due to expense or lack of time or focus, dropped after a few weeks. This is a frustrating experience for both the student and the teacher, which could be overcome if the student could just get a stronger understanding of the basics. This course goes through all the basic concepts and techniques in detail, and provides lessons for not just the ten pieces and grade 1 scales as promised but also four beginning pieces (for right and left hands separately). On top of this there is an extra bonus piece at the end for those who are hungry for more.</p><p>Each of the pieces and scales are shown slowly with close-up finger movements and explanations, and there is a custom-made PDF with every piece so you can print them out and improve your sight reading as well as your playing technique.  As a committed piano teacher with twenty-five years' experience, I have put everything you need into this beginning 'learn piano' course to make sure you truly benefit from the lessons and resources provided.  It should take you about one month to complete the course, although you may wish to keep working on and improving the new skills you have for up to six months.<br></p>", 
    "end_date": null, 
    "title": "Piano Lessons for Beginners: Play the Piano AND Read Music!", 
    "price": "40.00", 
    "instructors": "Simon Halliday", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628606_b97f.jpg", 
    "course_url": "https://www.udemy.com/your-first-10-piano-pieces/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T06:34:02Z"
}