{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<h4><strong>Pianoforall is one of the most popular online piano courses with over 50,000 students worldwide</strong></h4><h4></h4><h4>Now ANYONE Can Learn Piano or Keyboard</h4>\n\n<p>  \t           Imagine being able to sit down at a piano and just PLAY - Ballads,  Pop, Blues, Jazz, Ragtime, even amazing Classical pieces? Now you can...  and you can do it in months not years without wasting money, time and  effort on traditional Piano Lessons.  </p>\n\n<h4>An Incredible Set of ebooks and Videos</h4>\n\n<p>  \t           Pianoforall is specially designed to take complete beginners to an  intermediate level faster than any other method. You start with popular  rhythm style piano (think of artists like Lennon &amp; McCartney, Elton  John, Billy Joel,  Barry Mannilow, Lionel Ritchie, Coldplay, Norah Jones  and so on) which means you get to sound like a pro right from the  start. <br>  \t<br>  \t           You then expand step-by-step into Ballad style, Blues, Jazz, Ragtime,  Improvisation and creating your own melodies. You will even learn how to  read music AS you learn how to ‘play-by-ear’ and eventually you will be  able to play some amazing Classical pieces.  </p>\n\n<h4>The course is divided into 9 very easy to follow sections:</h4>\n\n<ol>  \t<li>Party Time - Play-By-Ear - Rhythm Style Piano</li>  \t<li>Basic Blues &amp; Rock ’n’ Roll</li>  \t<li>Chord Magic &amp; Inversions</li>  \t<li>Advanced Chords Made Easy</li>  \t<li>Ballad Style &amp; Improvisation</li>  \t<li>Jazz Piano Made Easy</li>  \t<li>Advanced Blues, Fake Stride &amp; The Entertainer</li>  \t<li>Taming The Classics</li>  \t<li>Speed Learning</li>  </ol>", 
    "end_date": null, 
    "title": "Pianoforall - Incredible New Way To Learn Piano & Keyboard", 
    "price": "50.00", 
    "instructors": "Robin Hall", 
    "commitment": "30 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238934_4d81_4.jpg", 
    "course_url": "https://www.udemy.com/pianoforall-incredible-new-way-to-learn-piano-keyboard/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-07T21:38:52Z"
}