{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<ul style=\"\">  \t<p style=\"\">  \t\t         This course is by far the easiest and most effective method to learn Hip Hop Songs and production styles on piano. Within mere minutes you will be playing popular songs on piano from the greatest Hip Hop Producers of today.  \t</p>  \t<p style=\"\">  \t\t         Piano for Hip Hop Fans is a course is geared towards musicians who have a love and passion for Hip Hop and want to learn the different regional styles for piano or keyboard. Whether it be West Coast, East Coast, Southern,  or International styles, hours of lectures have your interests covered in this beautiful genre.  \t</p>  \t<p style=\"\">  \t\t  Lecture includes the following songs:  \t</p>  </ul>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Song Cry - Jay-Z (Produced by Just Blaze) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">The Dynasty Intro - Jay-Z (Produced by Just Blaze) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">The Roots - You Got Me (Produced by Scott Storch) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Big Poppa - Notorious BIG (Produced by Chucky Thompson) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Frontin - Pharrell and Jay-Z (Produced by Pharrell Williams) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Diced Pineapples - Rick Ross (produced by Cardiak) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">NY State of Mind - Nas - (Produced by DJ Premier) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">The World Is Yours - Nas (Produced by Pete Rock) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">In The Morning - J. Cole (Produced by L&amp;X) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Overnight Celebrity - Kanye West (Produced by Kanye West) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Bad - Wale (Produced by Tiara Thomas and Kelson Camp) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Heads Ringing - Dr. Dre (Produced by Dr. Dre) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">I Ain&#039;t Mad At Cha - Tupac (Produced by Daz Dillinger) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Xxplosive - Dr. Dre (Produced by Dr. Dre and Mel Man) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Still D.R.E (Produced by Dr. Dre, Scott Storch) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Lay Low - Snoop Dogg (Produced by Dr. Dre) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Leave You Alone - Neyo and Young Jeezy (Produced by Warren G) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Another Round - Fat Joe and Chris Brown (Yung Ladd) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Aston Martin Music - Rick Ross (Produced by the J.U.S.T.I.C.E League) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">All I Do Is Win - DJ Khaled (DJ Nasty and LVM) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Maybach Curtains - Meek Mill, Nas, John Legend, Rick Ross (Produced by Infamous) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Bag Of Money - Rick Ross and T-Pain (Produced by Beat Billionaire) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Dufflebag Boy - Playaz Circle and Lil Wayne (M16) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Lollipop - Lil Wayne (Produced by Deezle and Jim Jonsin) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Love Me - Lil Wayne feautring Drake, and Future (Produced by Mike-Will-Made-It) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Ready - Fabolous and Chris Brown (Produced by The Runners and Monarch) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Look What You&#039;ve Done - Drake (Produced by Chase N. Cashe) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">From Time - Drake and Jhene Aiko (Produced by Noah Shebib and Chilly Gonzalez) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Swimming Pools - Kendrick Lamar (Produced by T-Minus) </u></em>  </p>  <p style=\"\">  \t<em style=\"\"><u style=\"\">Moment 4 Life - Nikki Minaj (Produced by T-Minus) </u></em>  </p>  <ul style=\"\">  \t<ul style=\"\">  \t\t<p style=\"\">  \t\t\t         ·Save time and money by learning remotely rather than travel to traditional music instruction  \t\t</p>  \t\t<p style=\"\">  \t\t\t         ·A pressure-free approach to playing music, no judgment or stress involved with your musical journey.  \t\t</p>  \t\t<p style=\"\">  \t\t\t         ·Take 20 minutes a day and watch your progress grow!  \t\t</p>  \t\t<p style=\"\">  \t\t\t         ·Keyboard or a piano is all you will need to get started.  \t\t</p>  \t\t<p style=\"\">  \t\t\t         ·Remote tutoring exists well past the course time.  \t\t</p>  \t\t<p style=\"\">  \t\t\t         ·Do the lessons on your own time and adjust them according to your personal schedule.  \t\t</p>  \t</ul>  \t<p style=\"\">  \t\t         To learn piano, one will only need a will and desire to practice and  most importantly, have fun. The only physical requirements needed to  finish this course would be: piano/electric keyboard, computer, and a  printer. The visual method of this course will allow you to quickly  ascertain music theory, piano fingerings, rhythm, cadences, and chord  structures within a very short amount of time.  \t</p>  \t<p style=\"\">  \t\t         Pace yourself and enjoy the musical journey as you will be exposed to 20+ great years of Hip Hop songs arranged for piano!!  \t</p>  \t<p style=\"\">  \t\t         Pianist, James Gaither provides a detailed, chord-based, and relaxed  music course that will span well over 3 hours of concise and detailed  instruction. Class and coursework will be enjoyable as his teaching  style is stress-free and is oriented to have users learn at their own  pace.  \t</p>  \t<p style=\"\">  \t\t         The supplementary materials in this course will be midi files for playback and experimentation within most music production software and accompanying sheet music for each respective lecture.  \t</p>  \t<p style=\"\">  \t\t         A mere 20 minutes a day will have you playing like a professional in no time!  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Piano Lessons For The Hip Hop Fan", 
    "price": "20.00", 
    "instructors": "James Gaither", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/214418_e05d_3.jpg", 
    "course_url": "https://www.udemy.com/piano-lessons-for-the-hip-hop-fan/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-10T04:12:22Z"
}