{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong></strong><strong>Yes You Can! You Can Learn Piano or Keyboard!</strong></p><p>Imagine being able to sit at the piano and play beautiful, entertaining music. The joy and reward that playing the piano brings is unmatched. </p><p><strong>You can certainly learn to play the piano or keyboard</strong>, thanks to the many, perfectly explained lessons in this course. Everything is broken down to its very basics so that you can totally and perfectly grasp each concept presented. </p><p>In this beginner's piano course, you will learn how to play the piano in a way that is fun, fast and easy. Traditionally, piano lessons have been very boring.  Most learners and even music teachers will tell you that it's because of the absolute focus on the most uninspiring aspects of music theory. In this course, the lecturer takes a different approach to get you playing quickly. You learn the fundamentals of reading sheet music only towards the end. </p><p>This piano lessons course will teach you how to play the piano in a well-presented step by step manner. It starts with very basic, easy lessons and continues to build upon this, lecture after lecture. By the end of this course, you will have all the knowledge you need to totally understand piano and keyboard playing. By doing the various exercises, watching videos and putting in the time, <strong>you will be able to play songs,</strong> from very simple, to popular hit songs that you hear on the radio.</p><p><strong>Here's a preview of what you will learn in this course.</strong><br></p><ul><li>The piano keyboard. The names of the keys. White and black keys. Pattern of black keys. Repetition. Finger numbers.</li><li>Enharmonics. What are sharps and flats? Location of C and F will help you find the other keys.</li><li>Major scales: C, D, E, F, G and A major. Correct fingering for right and left hand. Major scale formula for every key.</li><li>How to form basic major and minor chords. Chord formulas.</li><li>The keys of C, D, E, F, G and A major. Basic chords in these keys. I IV V vi Chords.</li><li>Major and minor chords in all keys. Chord diagrams.</li><li>How to play chords in root position, 1st and 2nd inversions. Voice Leading.</li><li>Play chords and melodies to simple songs and more advanced pop songs.</li><li>How to play common chord progressions for popular songs. Voice leading, fingering and chord inversions.</li><li>More advanced chords. How to play dominant 7th, major 7th, minor 7th, diminished and augmented chords.</li><li>How to read notes on the bass and treble clef. Quarter, half and whole notes. Timing.</li><li>And much, much more.</li></ul><p>If you want to learn how to play piano and keyboard, <strong>you absolutely need this course</strong>. </p><p><strong>Take this course right now!</strong></p>", 
    "end_date": null, 
    "title": "Piano Lessons For Beginners: Learn Piano Quickly And Easily", 
    "price": "30.00", 
    "instructors": "Mantius Cazaubon", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725906_4ed8_2.jpg", 
    "course_url": "https://www.udemy.com/pianolessons/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T18:19:55Z"
}