{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>My udemy courses have over 4000 students taking my piano courses for adults, and now kids can take them too.</strong></p>  <p><strong>Children learn piano like everything else they do, </strong><strong>quickly!</strong></p>  <ul><li>Is your child a piano prodigy? </li><li>How will you know unless they have the chance to find out? </li><li>You can find out easily.</li></ul>      <p>In this comprehensive video course providing piano lessons for kids, I teach your child from the very basics, to being able to read music, and play piano at an easy level.</p>  <p><strong>Did you know that piano is one of the easiest instruments to learn?</strong></p>  <p>Your child should be able to play simple songs by the end of the course, and be in a position to take further lessons and even exam courses, with the confidence of having a sound background in piano and music behind them.</p>  <p><strong><em>During lessons your child will learn to play 25 tunes.</em></strong></p>  <p><strong><em>Your child will learn to play piano:</em></strong></p>  <ul><li>Using short easy lessons</li><li>Having fun doing it</li><li>Learning to read music</li></ul>        <p>You will be <strong>wowed</strong> as you listen to your child playing piano in double quick time. </p><ul><li>By lesson 3, some music is being read and played</li><li>By lesson 5, the first tune is being played</li><li>By lesson 9, the notes in music and where to find them is known</li><li>By lesson 10, five tunes can be played using both hands.</li><li>By the end of the course 25 tunes have been learned, and can be played at will, while following music and understanding, dynamics and rhythm.</li></ul><p>In 20 weeks +, your child will be wanting more lessons as this course will be complete.</p>  <p>**********************************************</p>  <p>As the course has lifelong access, you can use it for younger children when they grow up.</p>  <p>**********************************************</p>  <p>You don’t need an expensive piano, any piano or keyboard will be fine. Your child will not need to know music,<strong> I teach them that.</strong></p>  <p>You will need some form of piano or keyboard, don’t worry about the size, kids do great on full sized piano’s it is amazing to watch them play.</p>  <p><strong>I use my more than 30 years of piano teaching experience,</strong> (having taught hundreds of youngsters over those years,) to guide your child through the stages of learning piano, using a standard text book from a recognized publisher, whom  I always use for my private lessons. (Available worldwide, from Amazon, or good music shops.)</p>  <p>By using this text book, I ensure your child learns everything properly, and in a recognized manner, using correct names for everything.</p><p><strong>Nothing is left to chance.</strong> I play every single note that your child will play for them first and with them. They always know what they should sound like and how to play every note.</p>  <p>Lessons are fun to take. I advise at the end of every lesson, what students need to practice. Practicing is only five to ten minutes a day, and mum and dad can join in too, I even tell mum and dad, what to do to help.</p><p><strong>Check the lessons available for viewing to see the quality of teaching.</strong></p>  <p>I have never met anyone who regretted learning to play piano; I have met many who regretted, not learning to play piano.</p>  <p><strong><em>As with all my courses:</em></strong></p>  <p><strong><em>you have unlimited lifetime access at no extra costs, ever</em></strong></p>  <p><strong><em>all future additional lectures, etc in this course are always free</em></strong></p>  <p><strong><em>there is an unconditional, never any questions asked full 30 day money-back-in-full guarantee</em></strong></p>  <p><strong><em>my help is always available to you if you get stuck or have a question – I believe my support on udemy cannot be bettered.</em></strong></p>  <p><strong>Start your child on a musical career and enroll them in this course.</strong></p>", 
    "end_date": null, 
    "title": "Piano for Kids: Developing Your Child's Creative Abilities", 
    "price": "25.00", 
    "instructors": "Jackie Clark", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620372_6dea_5.jpg", 
    "course_url": "https://www.udemy.com/piano-for-kids-developing-your-childs-creative-abilities/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T15:19:30Z"
}