{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t <strong style=\"\">Learn the knowledge base of Piano Improvisation and use scales, intervals and chord progressions for your own personal melodies. Discover the fascinating Phrygian Scale. Learn rhythmic techniques to make your melodies more interesting. And learn the meaning of Authentic, Plagal and Andalusian Cadences. Step by step you will discover your musicality!</strong>  </p>  <p>  \t There are many people who would like so much simply to sit down at the piano and begin to play, freely, without sheet notes: but they don&acute;t know how to do it. Even those who already play their instrument at a really fair level with written music feel embarrassed when they are asked to play something!  </p>  <p>  \t Beginning or intensifying piano / keyboard practice may lead to drastic positive change in a person&acute;s life style. A fifteen minutes daily practice time can be enough to clear our mind and to keep fingers and brain moving. But often we need external stimuli to enhance our motivation and to give us the power to continue playing and to cultivate our joy that will evolve when practicing regularly our instrument.  </p>  <p>  \t This Piano Lessons for Beginners course will give you the know-how for improvisation from the very first step on! It will give you the necessary recommendations for a successful learning practice. And it will give you the right material for a motivating onset of the development of your musical expression by improvisation, without sheet-notes.  </p>  <p>  \t All concepts will be shown at the instrument, acting on the maxim that there shouldn&acute;t be any theory without practice.  </p>  <p>  \t Have a look at the piano lessons for beginners&rsquo; course structure, down on the page. Have a closer look to the description of the lectures. You will see that during this Piano Lessons for Beginners course, you will learn concepts and strategies that will open your mind in your piano / keyboard learning even though you already learned piano with your private teacher, even though you assisted to the piano classes of the conservatory of the town center, and even though you already took online lessons.  </p>  <p>  \t This course will give you impact you need to free yourself improvising on your instrument in an expressive personal way.  </p>  <p>  \t Is this piano course from day one for beginners or for an intermediate audience? I am sure that both will benefit from the lessons I am presenting here. And it will be useful to relisten the lessons in different phases of your learning practice.  </p>", 
    "end_date": null, 
    "title": "Piano Improvisation from Day One", 
    "price": "20.00", 
    "instructors": "Peter Janzen", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27681_ccf4_7.jpg", 
    "course_url": "https://www.udemy.com/piano-improvisation-from-day-one/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-24T19:13:08Z"
}