{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">**Updated June 2016** <br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">This Piano Course is in the TOP 3 positions for \"How To Play Piano By Ear\" in Udemy's search engine!</strong><br><br>Do you want to play your favorite songs on the piano by ear almost instantly <strong class=\"redactor-inline-converted\">WITHOUT</strong> always relying on Sheet Music or Synthesia? <br><br>Do you struggle from <em><strong class=\"redactor-inline-converted\">days to months</strong></em> to learn only ONE new song?<br><br>Have you considered learning how to play piano but don't know <em><strong class=\"redactor-inline-converted\">WHERE</strong></em> to start?<br><br>Hi, I am Amos, owner of <strong class=\"redactor-inline-converted\">Amosdoll Music</strong> on YouTube with over 50,000+ subscribers and over 12,000,000 view counts where I have played over 700+ completely new songs by ear within the time frame of a year.<br><br>Nowadays, you can find piano teachers everywhere (I swear there is a least 1 every street here in Australia), but very little amount of teachers can truly teach how to play any song by ear, let alone DO it for themselves.<br><br>However, I am for one that <em><strong class=\"redactor-inline-converted\">\"preach what I teach\"</strong></em> as I can play <strong class=\"redactor-inline-converted\">ANY</strong> completely new song that I haven't heard before by ear in modern day music ranging from video game songs, English/Chinese billboard songs, Kpop, movie soundtracks (and everything that you could think of) simply with my series of methods in LISTENING, and implementing melodic/harmonic/rhythmic improvisational techniques to learn ANY song within 10-20 minutes! <br><br>Wouldn't you love to do that too?<br><br> This <strong class=\"redactor-inline-converted\">\"BEGINNERS\"</strong> course provides ALL my tricks, foundation knowledge and essentials needed to achieve all this awesome mastery.<br><br>For people who are <strong class=\"redactor-inline-converted\"> completely new to music</strong>, this course strongly secures all your foundations.<br>For people who <strong>know a little knowledge already</strong>, this course fills in all the holes and gaps you are missing.<br><br> This course is one of the many more to come in my series of \"Piano from Zero to Pro\" courses not only teaching you every essential knowledge that is needed to play by ear, but ALL my best <strong class=\"redactor-inline-converted\">SHORTCUTS.<br><br></strong>So come and join the other <strong>500 students </strong>from <strong>over 60 </strong>countries and take this musical journey with me!</p>", 
    "end_date": null, 
    "title": "Piano From Zero To Pro - Beginner Essentials To Play By Ear", 
    "price": "50.00", 
    "instructors": "Amosdoll Music", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793234_afc1_5.jpg", 
    "course_url": "https://www.udemy.com/piano-from-zero-to-pro-beginner-essentials-to-play-by-ear-amosdoll/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T04:42:02Z"
}