{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Join over 700 students in learning how to play the piano!<strong></strong></strong></p><p><strong>4.64 Star Rating Average. 6 stellar reviews from real students.</strong></p><p><strong>Here is what one student had to say: </strong>\"This course is great for who have no idea what piano is. He doesn't just show something and jump to another topic. Continuously, you repeat all you've learned throughout the course and using this way you'll have robust understanding of basics. Thank you for helping us to learn how to play piano!\"</p><p><strong>This course will take you from reading simple notes, to playing with both hands, playing with dynamics, and playing in different keys!  Learn to play songs own your own and with more feeling! </strong></p><p>My name is Tim and I have a Bachelors of Music from West Chester University of Pennsylvania. I have taught dozens and dozens of students locally and have been teaching online for about 3 years. I have taken my music knowledge and compiled it into this course for students around the world who are looking for an easy way of learning piano without spending thousands on lessons. Are you one of these students? Enroll today!<br></p><p><strong>You should know how to read music and know where notes are on the piano before taking this course. </strong></p><p><strong>Difficulty Level 1: EASY</strong></p><p><strong>By taking this course, you will learn how to:</strong></p><p><strong></strong>-Play examples with articulations (staccato and legato)</p><p>-Play examples with eighth notes</p><p>-Count more difficult rhythms (with combinations of quarter, half, whole, and eighth notes)</p><p>-Understand key signatures</p><p>-Reading and playing in G Major</p><p><strong>What you can expect to get from taking this course:</strong></p><p>You should be able to play simple two handed songs with varying rhythms and basic key signatures by the end of the course.  This course also reviews many topics introduced in Introduction to Piano and Music such as note reading, dynamics, and basic note durations.  </p>", 
    "end_date": null, 
    "title": "Piano Level 1 - EASY Piano Lessons Course for Beginners", 
    "price": "20.00", 
    "instructors": "Timothy Wurm", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552700_c24b_4.jpg", 
    "course_url": "https://www.udemy.com/learn-to-play-piano-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T19:31:56Z"
}