{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Wielding the piano opens up a whole new world of creative possibilities.</p><p>In this foundational course, I teach you how to play piano as a singer/songwriter. It's a unique method that takes somebody with zero musical experience and transforms them into a piano wielding singer/songwriter.</p><p>This method has been refined over the last 3 years as I've taught more and more artists in New York and Los Angeles.</p><p>Every lecture builds upon the previous lecture.  I walk you through the whole process as efficiently as possible, taking every effort to find ways to cut your learning time in half.</p><p><span></span>Watch the lectures, complete the challenges, and enjoy playing! By the end you should be able to pick a song, adjust the song to most singable key for your voice, and accompany yourself on the piano.</p><p>You should take this course if you think you'd have fun playing the songs you love and exploring how piano wielding singer/songwriters like Carol King, Alicia Keys, and Ben Folds express themselves on the piano.</p><p>This is a foundational course for beginners.  A more intermediate course full of new piano lessons is being developed.  This course is meant to be an alternative to a traditional piano lesson schedule.</p><p>If you love playing, writing and singing songs, this course is for you.</p><p>Hope to see you on the inside!</p><p>- R</p><p>Promo Music provided by Ben Sound at Ben Sound Dot Com</p>", 
    "end_date": null, 
    "title": "Piano for Singer/Songwriters | Write Songs and Perform Live!", 
    "price": "35.00", 
    "instructors": "Rob Writes", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658276_2ba9_3.jpg", 
    "course_url": "https://www.udemy.com/pianoforsingersongwriters/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T22:44:34Z"
}