{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Playing the piano doesn't need to be complicated. All you need is to learn the building blocks.</p>  <p>Get ready to learn the <strong>basic building blocks of all music: chords</strong>. You'll learn to put them together to play popular songs like <em>Counting Stars</em> by OneRepublic, <em>Viva la Vida</em> by Coldplay, <em>Oceans</em> by Hillsong United and many more!</p>  <p>Experienced instructor Nathan Lawrence guides you step by step through the process of learning to play piano by chord. Many online piano methods teach you what you need to know, but in an impersonal way. You might be able to see the piano and what to play, but there’s no human being there to make it feel like you’re learning in a personal lesson setting. That’s why this course has a fundamentally different approach. Every lesson is taught with a simultaneous view of both your teacher and the keyboard, as if you’re looking in a mirror. </p>  <p>Piano Building Blocks uses <strong>one-of-a-kind, shape-based approach</strong> to chord learning. All 24 major and minor chords are taught in intuitive groups by hand position shape, with basic descriptions like “mountain” or “valley” to help you remember how to place your hand. </p>  <p>With each group of chords you’ll learn a popular song that uses those shapes. </p>  <p>This course focuses on right hand, root position chords and covers every major and minor chord. It also gives you tips on what to do to improvise with your left hand. You'll get a small sneak preview of content that you’ll learn in future courses–like chord inversions and more complex chords such as diminished, augmented, or 7<sup>th</sup> chords. </p>  <p>You’ll be able to play simple versions of the <strong>vast majority of popular songs</strong> after learning these 24 building blocks.</p>  <p>The only way to reach your goal is to take the first step.</p>  <p>Sign up today!</p>", 
    "end_date": null, 
    "title": "Piano Building Blocks: Learn the 24 Most Common Chords", 
    "price": "20.00", 
    "instructors": "Nathan Lawrence", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660690_b4b8.jpg", 
    "course_url": "https://www.udemy.com/pianobuildingblocks/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T03:02:57Z"
}