{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Learn Piano with Rosa - Rosa's\nPiano Online School -  Teaching 32 Courses!</strong></p><p><strong>OVER 10,000</strong> Successful students have already taken my piano online\ncourses since July 2014 with <strong>231 - 5 Star Reviews</strong></p><p><strong>Course Updated: </strong>November 15, 2015</p><p>========================================================<br></p><p><strong>Whole Tone Scales - the easiest scale to create beautiful runs for songs introduction</strong><br></p><p>Have you ever wondered <strong>how </strong>musicians produce beautiful professional sound in the beginning of the song to wow the audience?<br></p><p><strong>The Secret: </strong>They make use of the <strong>EASY Whole Tone Scale Runs!</strong></p><p>Whole Tone scales make wonderful unexpected sounds as they are different from the normal major scales. There are no half tones in this whole tone scale! The beauty is that once you learn 2 whole tone scales, you have learned all the whole tone scales for all 12 keys.</p><p>This is good news for all piano players!</p><p>They don't need to spend time to practice and practice.</p><p><strong>The Magic Secret:</strong> In order to play the whole tone scale quickly in a flash to create that beautiful sounds, use 2 HANDS!  When you use 2 hands to cross over, you will be able to play the runs in a beautiful flow with great coordination!<br></p><p>This course will help you play whole tone scale runs without the need to practice, practice, and practice.  </p><p>1.  You don't need to memorize the notes, because memorizing notes will slow you down.</p><p>2.  You need to know how to \"THINK\" in terms of Black and White Keys.</p><p>3.  You are going to find how how efficient both hands move when your mind directs your fingers in the process of creating these beautiful runs.</p><p><strong><br></strong></p><p><strong>In this course, the following music theory will be covered as well:</strong></p><p>1.  Whole Tone Scale Sounds<br></p><p>2. Learn the 6 Tone Scales for all 12 Keys</p><p>3. 2 Hands to play the whole tone scale runs going up and down</p><p>4. Identify the Black &amp; White Keys in one flash.</p><p>5.  Understand how all 12 Keys fit into the C and C# whole tone scales.</p><p>6.  Play 2 whole tone scales in a flowing manner with the correct thinking.</p><p>You will find that within an hour, you will be able to play this whole tone scale runs beautifully, even for a beginner.</p><p><strong>There are 4 Piano Techniques:</strong></p><p>1.  C Whole Tone Scale Run for Song Introduction</p><p>2.  C# Whole Tone Scale Run for Song Introduction</p><p>3.  Whole Tone Scale to Create a Beautiful Harp Sound</p><p>4.  Whole Tone Scales to Create Special Effects</p><p><strong>There are 6 Piano Demos:</strong></p><p>1.  C Whole Tone Scale</p><p>2.  C# Whole Tone Scale</p><p>3.  C Whole Tone Scale Run for Song Introduction</p><p>4.  C# Whole Tone Scale Run for Song Introduction</p><p>5.  Beautiful Harp Sound</p><p>6.  Special Effects</p><p><strong>Requirement for this Course:</strong></p><ul><li>There is no need to have prior knowledge of scales, chords theory.</li><li>Follow the lectures and you will be able to create these beautiful runs and sound like a professional.</li></ul><p><br></p><p>Come on in and we will have a lot of fun together,</p><p>Rosa</p><p>***************************************************************************</p><p><strong>About Rosa's Piano Online Course:</strong></p><ul><li><em>Over <strong>10,000</strong> very happy students already in my classes</em></li><li><em><em><em>See the </em><em><strong>5 Star Reviews</strong> from VERY satisfied students</em></em></em></li><li><em>You get free lifetime access</em></li><li><em>All videos are at your finger tips to watch anytime &amp; anywhere</em></li><li><em>All future extra lectures and upgrades are <strong>always free</strong></em></li><li><em>Unconditional  <strong>30 day money-back guarantee</strong> and that's my personal promise to your success!</em></li><li><em>Join this happy family of students </em></li><li><em><strong>Enroll into this course</strong></em></li></ul>", 
    "end_date": null, 
    "title": "Piano Runs & Fills #1: Play Dreamy Whole Tone Scale Runs ", 
    "price": "20.00", 
    "instructors": "Rosa Suen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656364_9c13_5.jpg", 
    "course_url": "https://www.udemy.com/learn-piano-scales-1-whole-tone-scales-whole-tone-runs/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-31T15:22:08Z"
}