{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course is all about helping you realize your potential as a classical guitarist as you learn to play 3 great pieces from the classical guitar repertoire, <em>Canarios</em>, <em>Gavottes 1 and </em><em>2</em>, and<em> Leyenda</em>. You’ll follow a step-by-step course that shows you the most beneficial way to practice scales, how to use technical exercises, and how to play the 3 pieces at a performance standard.</p><p>What you can expect to get out of the course</p><ul><li>You'll be able to see consistent progress as you follow an organized system</li><li>Practicing will be a pleasure as you improve your guitar skills, have more relaxed finger movements, and develop greater ability of musical expression</li><li>You'll feel the encouraging sense of accomplishment as you play pieces all the way through</li><li>You'll get answers to many of your questions about classical guitar playing</li></ul><p>Your main goal for the course is to play 3\npieces from the classical guitar repertoire, <em>Canarios</em>, <em>Gavottes\n1</em> <em>and 2</em>, and <em>Leyenda.</em> The premise of the\ncourse is that you'll have much more success if you thoughtfully prepare before\njumping into the pieces.<br></p><p>Playing the classical guitar is such a\nmulti-sensory experience, and a video-based course is a great way to learn at\nyour own pace. You know that there are no shortcuts, but by following a logical\ncourse that starts easy and gradually gets more challenging your experience will\nbe much easier and rewarding.<br></p><p>Classical guitar is beautiful and complex, but\nthat complexity can be intimidating, so in this course every musical phrase\nwill be broken into a manageable piece that's easy to work with, and easy to\nput back into the whole of the piece.<br></p><p>The course starts with some brief introductory\nlectures that review the basics of the classical guitar approach, and then\nmoves into scales. You'll customize your scale practice so that you're ready\nfor each piece. It would be good to have some experience playing higher up on the fret-board, but you'll review the notes on the fret-board in the scales section, so you're prepared for everything that follows. Next, you'll start playing technical exercises\nthat are unique to this course to prepare you for the piece that you'll be\nplaying.</p><p>The lectures show the hands from a variety of angles, and in the lecture\ndescriptions you can find the time where each camera angle changes. The\nlectures on the pieces start with a small chunk played up to speed, then a slow\nwalk-through the notes, followed by a more in-depth lesson on each hand. <br></p><p>You'll also get downloadable PDF files of\nevery scale, exercise, and piece, so not only will you receive a  full score of\n\"Leyenda\" and the other pieces that are in the course, but you'll have a clear view of\nhow to play every single note. This course doesn't contain any guitar\ntablature, but remember that you will be able to see and hear every last note\nin the course in the video lectures.<br></p><p>I hope you'll continue your journey with this\ncourse by clicking the button that says \"Start Learning Now\" and\nenrolling in the course and enjoying lifetime access to the lecture videos and\nsheet music files. Thanks for reading and I wish you the best with your guitar\nplaying.<br></p>", 
    "end_date": null, 
    "title": "Play Leyenda, Canarios, and Bach on Classical Guitar", 
    "price": "20.00", 
    "instructors": "Brian Riggs", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615226_1939_3.jpg", 
    "course_url": "https://www.udemy.com/play-leyenda-canarios-and-bach-on-classical-guitar/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T21:02:49Z"
}