{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong style=\"\">MY PERSONAL GUARANTEE - I AM SO CONFIDENT YOU WILL LOVE THIS  COURSE THAT IF YOU DON&#039;T, I WILL REFUND YOU ALL THE MONEY (within 30  days of purchasing) WITH NO QUESTIONS ASKED . THIS IRONCLAD GUARANTEE IS  BACKED UP BY UDEMY.</strong>  </p>  <p>  \tIf you ever wanted to learn the harmonica this brand new course is for you! Please enjoy the course and give it a review.  </p>  <p>  \t          Perhaps you have just had a workshop with Ben, if so this will go through some of the tunes you learn once again.  </p>  <p>  \t  Ben will hold your hand all the way through the videos with his  infectious and humourous style of teaching. You will feel like he&#039;s  right with you in a one to one lesson showing exactly you how to do it,  and encouraging to to become confident and go it alone.  </p>  <p>  \t<br style=\"\">  \t          This course gives you the basics in nice easy lectures.  </p>  <p>  \t          It&#039;s designed to be fun, friendly, easy for anyone to learn - even  non-musical people! It is is designed to help you succeed and lead you  on to the next in the series.  </p>  <p>  \t          There are pdfs and mp3 downloads with many lectures so you can  read the tablature and play along with the audio music written  especially for learning harmonica.  </p>  <p>  \t          Please be sure to visit the Questions area and Forum to interact  with other students. It&#039;s a great way to learn more and helps you apply  what the course gives you.  </p>  <p>  \t          Ben will check messages weekly where possible and will be most  available on fridays (UK office hours) providing he&#039;s not teaching. So  if you want to arrange a call or skype please message him.  </p>  <p>  \t<br style=\"\">  \t          Ben Hewlett is the UK&#039;s most respected harmonica teacher and most  prolific author. He will lead you through the ins and outs of harmonica  playing through a series of short video lessons. His teaching style is  confident, practiced, humorous, skillful, knowledgeable and packed with  information in bite sized chunks.  </p>  <p>  \t<br style=\"\">  \t          Ben is used to teaching all over the world at prestigious  harmonica festivals and is delighted to offer his services to you.  </p>", 
    "end_date": null, 
    "title": "Play music on Harmonica using 8 notes - learn easy tunes!", 
    "price": "20.00", 
    "instructors": "Ben Hewlett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/228268_3331_4.jpg", 
    "course_url": "https://www.udemy.com/benhewlettharmonicatuitionfunkynursery/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-24T14:42:50Z"
}