{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong></strong><strong><strong></strong></strong></p><p><strong><strong>Learn 12 piano major scales in your own time and at your own pace.</strong></strong></p>This is a piano course with 60 lectures and over 3hrs video tutorial content designed to be very interactive. These piano tutorials teach students exactly how to learn, practice and perform scales at the peak by focusing on the 12 major piano scales.<p><br>This piano fundamental course is perfect for beginner and intermediate students. The course highlights both basic piano techniques and the right attitude needed to become exceptional in future music goals.</p><p>Learn with professional pianist that have extensive experience as piano teacher teaching this course.<br>The major teaching strategies of this course is clarity and simplicity.  After being taught in practical baby steps, there would be hardly any doubts or questions left.</p><p><strong></strong><strong>This course is structured into 5 key learning stages</strong> for each major scale designed to make piano learning truly amazing.</p><p><strong>The first step:</strong>  explains how the scale is made, explains also the location of sharps and flats, tone and semitone patterns.</p><p><strong>The second step</strong>:  focuses entirely on the right hand, finger patterns, and practice strategies.</p><p><strong>The third step</strong>: focuses only on the Left hand, involves guidance, in-depth teaching on how to apply the correct fingers, and how to memorize patterns.</p><p><strong>The fourth step</strong>:  focuses on both hands, explaining how to overcome the challenge of coordinating both hands and using correct fingers simultaneously. This step teaches students how to play scale with more security and awareness. It highlights the importance of preparation technique before the performance. It also guides students on how to perform a scale musical with clear direction and phrasing.</p><p><strong>The fifth step</strong>: encourages creativity in students and improvises on the scale learned. Students will be walked through very simple techniques to start improvisation.</p><p>All these 5 key ingredients have been thoughtfully packaged as they are the essential tools to master piano major scales.</p><p><strong>Course Duration and Benefits:</strong></p><p>This 6 months duration course does not teach the students magic shortcuts or short and effortless results. It instead grooms active and responding learners who are willing to spend as much time needed to master one step at a time till they are fluent and absolutely confident in it before moving to the next step.</p><p>We believe that the key to mastery is a sequence of many repetitions that involves making progress with each repetition which has been inculcated at the core of this course.</p><p><br></p>", 
    "end_date": null, 
    "title": "Play all major scales by ear - no notation required!", 
    "price": "20.00", 
    "instructors": "Bernadeta Urbon", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692812_c902.jpg", 
    "course_url": "https://www.udemy.com/piano-major-scales/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T09:17:52Z"
}