{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">MY PERSONAL GUARANTEE - I AM SO CONFIDENT YOU WILL LOVE THIS  COURSE THAT IF YOU DON&#039;T, I WILL REFUND YOU ALL THE MONEY (within 30  days of purchasing) WITH NO QUESTIONS ASKED . THIS IRONCLAD GUARANTEE IS  BACKED UP BY UDEMY.</strong>  </p>  <p style=\"\">  \t  If you ever wanted to learn to play the  harmonica like Sonny Terry this new course is for you! Please enjoy the course and give  it a review.  </p>  <p style=\"\">  \t      This course is all about learning to play in the style of Sonny Terry.  </p>  <p style=\"\">  \t            Many thanks to Wayne T. Helfrich for kind permission to use his pictures of Sonny Terry.  </p>  <p style=\"\">  \t      Each riff is written out for you with standard harmonica tab, onamatapoeic words, and standard western music notation.  </p>  <p style=\"\">  \t      You will find an mp3 included which has each riff played by me at full speed, half speed and medium speed to help you learn how to play it better.  </p>  <p style=\"\">  \t      If you do a couple of riffs a day this course will take a month to complete - or go for bust and do it in a weekend!  </p>  <p style=\"\">  \t    We start with learning 19 riffs that I wrote in Sonny&#039;s style as a preparation for you.  </p>  <p style=\"\">  \t    When you&#039;ve done those follow through the sections and you may notice the challenge increases a little. Take it slowly and you will progress without too much pain!  </p>  <p style=\"\">  \t              This course is based on a book I wrote with Paul Lennon. I was recently teaching the whole book to a student in South Korea and enjoyed revisiting the origininal material we wrote and recorded in 2009 so much that I decided to make a Udemy course from it.  </p>  <p style=\"\">  \t              The whole book (30 pages) and audio (65 mp3 tracks) is included in this groundbreaking course a page at a time. The whole book and CD is also available if you message me.  </p>  <p style=\"\">  \t                                  A lot of people want to play the blues harp so if that&#039;s you come on in, you&#039;re in the right place.  </p>  <p style=\"\">  \tI will hold your hand all the way  through the videos with my &#039;infectious and humourous&#039; (people tell me) style of teaching.  You will feel like I&#039;m right with you in a one to one lesson showing  exactly you how to do it, and encouraging to to become confident and go  it alone.  </p>  <p style=\"\">  \t                                           It&#039;s designed to be fun, friendly,  easy for anyone to learn - even non-musical people! It is is designed to  help you succeed and lead you on to the next in the series.  </p>  <p style=\"\">  \t                                    There are pdfs and mp3 downloads with many  lectures so you can read the tablature and play along with the audio  music written especially for learning harmonica.  </p>  <p style=\"\">  \t                                           Please be sure to visit the Questions  area and Forum to interact with other students. It&#039;s a great way to  learn more and helps you apply what the course gives you.  </p>  <p style=\"\">  \t                                           I check messages most days. If you want to arrange a call or skype  please message me.  </p>  <p style=\"\">  \t<br style=\"\">  \t&#039;Ben Hewlett is the UK&#039;s most  respected harmonica teacher and most prolific author. He will lead you  through the ins and outs of harmonica playing through a series of short  video lessons. His teaching style is confident, practiced, humorous,  skillful, knowledgeable and packed with information in bite sized  chunks.  </p>  <p style=\"\">  \t<br style=\"\">  \t                                           Ben is used to teaching all  over the world at prestigious harmonica festivals and is delighted to  offer his services to you.  </p>  <p style=\"\">  \t                  His most recent gig was as one of the teachers in the  Harmonica Masters  Workshops 2014 where he taught along with Joe  Filisko, David Barrett,  and Steve Baker in Trossingen, the home of  Hohner, it was an 18 hour  workshop spread over a week.&#039;  </p>", 
    "end_date": null, 
    "title": "Play Sonny Terry style on Harmonica and dazzle your friends!", 
    "price": "20.00", 
    "instructors": "Ben Hewlett", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365292_3910_6.jpg", 
    "course_url": "https://www.udemy.com/benhewlettharmonicatuition60sonnyterryriffslevel1/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-07T19:14:38Z"
}