{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Have you ever wanted to play Piano, but didn’t think you have the time or didn’t want to waste YEARS of your life taking private lessons just to play Beethoven and stuff you don’t even listen to?</p><p>What you really need is a way to learn Piano at your own pace that will allow you to begin playing REAL songs that you love almost immediately – with the “Play Piano by Ear Today!” SuperCourse!</p><p>In this course, you’ll learn the key ingredient to any modern song – chords. The real secret to piano is that ALL modern music is made from patterns called chord progressions that you can easily learn to identify. In fact, Most songs only utilize 2 to 5 simple chords and there are only a handful of patterns to choose from.</p><p>This SuperCourse combines a thoughtful mixture of practical music theory and techniques  - with ear training and relative pitch exercises in a Fun, Progressive manner. You’ll learn to </p><li>\tTake Any Chord Sheet and Use it on the spot</li><li>\tLearn fun Bass patterns and harmonic embellishments</li><li>\tPlay in all popular Rhythm signatures</li><li>\tIdentify Common Patterns in Everyday Music so you can play from memory</li><li>\tFigure out chords in unfamiliar keys using simple chord rules</li><p>We even have several Jam Tracks so you can play along as you learn more chords and more interesting techniques! Not only that, with each of our short, info-packed lectures, you’ll learn another essential skill that you can immediately take and use.</p><p>Whether you just want to learn in minutes how you can take a chord sheet and instantly play your favorite songs OR you want to learn the Secrets of musicians who can play by ear, this is the course for you.</p><p>ORDER NOW. . . the “Play Piano by Ear Today!” SuperCourse</p>", 
    "end_date": null, 
    "title": "Play Piano by Ear Today! SuperCourse", 
    "price": "30.00", 
    "instructors": "Daniel Strong", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501412_aed0.jpg", 
    "course_url": "https://www.udemy.com/play-piano-by-ear-today-supercourse/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-13T22:05:48Z"
}