{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>Learning to play piano or keyboard is a wonderful thing to do.</strong> It takes time but every minute spent learning piano is worth it.  </p>  <p><strong>Anyone who has learned the basics will love learning these chords.</strong></p><p><strong>Anyone who knows nothing about piano will love learning these chords. (beginner lessons are included.)</strong></p><p>Being able to play in a wide range of keys is essential if you want to play with a band. Or for that matter to play at home. Imagine playing for someone who cannot sing in the key you know. You can easily change key if you know this many chords.</p><p>You could find a new song in a key you don't know, not if you know this many chords. Or if you don't know the chords for a particular key, have a ready lesson source, to teach you how to play the chords required.</p>  <p>  \tAre you using your fingers properly for the chords you do know? Get it wrong and it will be difficult to move on to the next chord. That’s where Quick and Easy Piano Chords comes in.  </p>  <p>  \t<strong>Quick and Easy Piano chords</strong> is designed by a qualified piano teacher to teach over 80 chords in 17 keys, so that you will only have to learn songs, you already know the chords.  </p>  <p>  \tIdeally the course is suitable for someone who has learned the basics, knows their fingers and their notes and wishes to increase their chord knowledge. Of course anyone even just starting out could take the course. A video on finger numbers and a second one on notes of the piano is included, so it is suitable for even a total beginner.  </p>  <p>  \t<strong>The course consists of:</strong>  </p>  <ul><li><strong>HD Video lessons- so that you can clearly see how you should be playing each chord.<br></strong></li><li><strong>High Quality Sound- so you can here how you should sound when playing your chord.<br></strong></li><li><strong>All Major, Minor, Major 7, Minor 7 &amp; 7<sup>th</sup> chords in 17 keys covered- so one chord course will be all you need.<br></strong></li><li><strong>Teaching is provided by a qualified piano teacher, who will only teach you the correct way to play each chord. Just as she would teach you if you were a private student coming to her school for lessons.<br></strong></li><li><strong>Proper fingering taught for both left and right hands, to ensure you play properly and can reach all of the chords, even the difficult to reach chords.<br></strong></li><li><strong>Can be used as a teaching course to teach you all or some of the chords you wish to learn, or as a video chord book for you to check chords you have forgotten and need refreshing.<br></strong></li><li><strong>Each chord is taught in an individual video to ensure quick and easy access any chord.<br></strong></li><li><strong>In order to take the course, you will need<br></strong></li><li><strong>A piano or keyboard<br></strong></li><li><strong>A means of accessing the internet which can be<br></strong></li><li><strong><em>A computer</em><br></strong></li><li><strong><em>A tablet</em><br></strong></li><li><strong><em>Smartphone</em><br></strong></li><li><strong>In fact anything that can play video<br></strong></li><li><strong>A printer to print the documents but this is not essential as they can be viewed on screen</strong></li></ul>  \t                              <p>  \tBy taking this course you will be able to play a tremendous number of popular songs. Chords that are rarely used in popular music but can be included, will be easy to learn due to the knowledge gained in this course.  </p><p><em><strong>As with all my courses:</strong></em></p><p><em><strong>you have unlimited lifetime access at no extra costs, ever</strong></em></p><p><em><strong>all future additional lectures, etc in this course are always free</strong></em></p><p><em><strong>there is an unconditional, never any questions asked full 30 day money-back-in-full guarantee</strong></em></p><p><em><strong>my help is always available to you if you get stuck or have a question – I believe my support on udemy cannot be bettered.</strong></em></p><p><em><br></em></p><p>Enroll today and become a better pianist. With 30 days in which your money can be refunded if you don't like it, you can't go wrong.</p><p><strong>enroll now.</strong></p>", 
    "end_date": null, 
    "title": "Quick & Easy Piano Chords: Play more songs with more chords", 
    "price": "30.00", 
    "instructors": "Jackie Clark", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260900_6df3_7.jpg", 
    "course_url": "https://www.udemy.com/quick-and-easy-piano-chords/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-14T08:21:20Z"
}