{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t    This course takes you from your first steps as a guitarist to playing the well-known tunes like Malaguena, Santa Lucia, Henry Martin, The Mulberry Bush, The Waltz, and a lot more.  </p>  <p style=\"\">  \t  Many regard playing guitar as great fun, but learning and practicing as necessary drudgery. Fear not, while there’s no mastery without practice, this hands-on course is designed to get you playing the guitar from the word go, through the set of lessons you’ll truly enjoy.  </p>  <p style=\"\">  \t    When you finish with the course, you’ll be able to:  </p>  <ol style=\"\">  \t<li style=\"\">Read and understand the music notation</li>  \t<li style=\"\">Hold the guitar properly, and apply the left-hand and the right-hand techniques to produce the music people love to hear, and</li>  \t<li style=\"\">Play the whole bunch of terrific tunes.</li>  </ol>  <p style=\"\">  \t    In short, you’re about to acquire the foundation you can build on, by adding more tunes<br style=\"\">  \t    and more complex techniques as your guitar-playing gets better and faster. By adding your personal touch, you’ll be developing your own unique playing style from the start.  </p>  <p style=\"\">  \t    In this course you’ll find the tips on how to hold the instrument properly, the original tunes specially designed for fast learning, the instruction on the correct finger arrangements, as well as the variety of compositions, allowing you to choose the ones you like the most.  </p>  <p style=\"\">  \t    The <strong style=\"\">FAME</strong> (<strong style=\"\">F</strong>ast <strong style=\"\">A</strong>coustic-guitar <strong style=\"\">M</strong>astery by <strong style=\"\">E</strong>xample) 4-step method is used throughout so that you get to enjoy the practice, and experience the fruits of your labor in the shortest amount of time:  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">Listen</strong><br style=\"\">  \t       Listen to the video recording and in your mind picture playing it</li>  \t<li style=\"\"><strong style=\"\">Watch</strong><br style=\"\">  \t       Watch the first part of the video while skimming over the sheet music</li>  \t<li style=\"\"><strong style=\"\">Do</strong><br style=\"\">  \t       Watch the step-by-step slow-motion part of the video with the sheet  music in front of you, and learn the whole song, bit by bit, and</li>  \t<li style=\"\"><strong style=\"\">Repeat</strong><br style=\"\">  \t       Practice until it’s perfect!</li>  </ol>  <p style=\"\">  \t    The end result: guitar mastery at your fingertips.  </p>  <p style=\"\">  \t  For many would-be guitar players, mastering the musical notation is rather challenging. In this course you&#039;ll find the mnemonics that we&#039;ve developed specifically to help you learn the music notes literally overnight - and that&#039;s a promise!  </p>  <p style=\"\">  \t  ...and this way, instead of wasting your time on theory, you focus on practice and on learning the tunes that you love, quickly.  </p>", 
    "end_date": null, 
    "title": "Rapidly Learn & Master Acoustic Guitar, Classic Fingerstyle", 
    "price": "20.00", 
    "instructors": "Milan Mitic, Dr Alex Davidovic", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411986_b515.jpg", 
    "course_url": "https://www.udemy.com/learn-acoustic-guitar-beginners-course/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T07:46:44Z"
}