{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>If you want to learn how to read sheet music notes, to play easy songs on the piano, this course is for you. You'll be able to play the piano with your right hand, reading notated sheet music. Within a few hours and with a bit of practice, you'll realize that reading music is as easy as reading words, when you know how!</p><p>The course is broken down into short steps - each lesson is around 3 minutes in length. Learn a new skill in a short time, watch the demos, practice, then move on when you are ready.</p><p>I've included some PDF sheet music, and will of course be adding in more and more for you on a regular basis. Songs you'll learn how to play include \"House of the Rising Sun\", \"Star Spangled Banner\" and \"Scarborough Fair\". Requests for songs accepted!</p><p>Sign up now and start a new hobby - impress your friends!</p><p><strong>What you'll learn:</strong></p><ul><li><strong>How to name and locate the notes on the piano keyboard</strong></li><li><strong>How to name and locate the notes on the treble clef stave</strong></li><li><strong>Pitch, rhythm and accidentals</strong></li><li><strong>Key and and time signatures - the essentials</strong></li><li><strong>How to navigate through a song - understand repeat symbols and other instructions</strong></li><li><strong>The basics of how the left hand works</strong></li></ul><b></b><b>All Udemy courses are backed by a 30-day no questions asked guarantee.</b>", 
    "end_date": null, 
    "title": "Read Music & Play Songs on the Piano from Sheet Music", 
    "price": "20.00", 
    "instructors": "Victoria Williams", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521072_7bf0_2.jpg", 
    "course_url": "https://www.udemy.com/play-songs-on-the-piano-from-sheet-music/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-05T07:01:59Z"
}