{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tRhythm to Rock Drum Lesson 5 is a continuation of Lesson 4.  In this lesson you will learn how to play the Buzz Stroke.  The Buzz Stroke is the stroke used to play drum rolls.  You will also learn to play in three new time signatures and you will learn to play an etude in mixed meter.  </p>  <p>  \tSpecifically students will learn to play Buzz Strokes on a drum. Have you ever heard the expression &quot;Drum roll please!&quot;?  The first step in learning to play the ever so popular drum roll is to learn how to play a Buzz Stroke.  In this lesson I begin to teach how to play the Buzz Stroke. With time and practice students can expect to someday be able to play................ &quot;Drum roll please!&quot;.................................  </p>  <p>  \tThis lesson will teach three new time signatures.  So far you have learned to play music in 2/4, 3/4, and 4/4.  This lesson will explore 5/4, 6/4 and 7/4.  Can you count to 7?  </p>  <p>  \tFinally you will learn what mixed meter is including how to count it and what it looks like in a musical piece as you tackle the most challenging etude in my book, Etude 5!  </p>  <p>  \tOverall this course is a continuation of Lessons 1-4 providing a long term system for learning to play the drums. You can expect to spend 7-10 days working on this course in order to learn the material at the mastery level.  </p>  <p>  \tThis course can serve in many ways:  </p>  <p>  \t-as a supplement to school band lessons.  </p>  <p>  \t-as a supplement to private drum lessons.  </p>  <p>  \t-as a private drum instruction system.  </p>  <p>  \t-as a collegiate music program secondary instrument learning tool.  </p>  <p>  \t-as an introductory drum course for the aspiring late learner (adult).  </p>  <p>  \t-as a tool for teaching note reading to the developed drummer who plays by ear.  </p>  <p>  \tDo you think playing the drums might be fun? Playing the drums is lots of fun. Sign up for the Rhythm to Rock Drum Lesson Series to begin learning how to play the drums.  </p>", 
    "end_date": null, 
    "title": "Rhythm to Rock Drum Lesson 5", 
    "price": "20.00", 
    "instructors": "Thomas Nelson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/269830_24bf_2.jpg", 
    "course_url": "https://www.udemy.com/rhythm-to-rock-drum-lesson-5/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-28T01:45:58Z"
}