{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t  Lesson 4 is a continuation of Lesson 3.  In this lesson students will build on prior learned material adding Accents, Whole Notes, Whole Rests and Multi-Measure rests to their knowledge and skill base.  </p>  <p>  \tSpecifically students will learn to play Accents on a drum.  Have you ever heard the song &quot;Wipeout&quot;?  It is a famous drum solo from the &#039;60&#039;s featuring Accents.  In this lesson I begin to teach how to play accents.  With time and practice students can expect to someday be able to play like the drummer who played the famous &quot;Wipeout&quot; drum solo.  </p>  <p>  \tThis lesson will teach the Whole Note.  You will learn what a whole note looks like, how it is played and how it is counted.  As with all musical notes, the whole note has an equivalent rest, the Whole Rest.  The Whole Rest looks a lot like a Half Rest and in this video you will learn how to tell the two apart from each other.  </p>  <p>  \tFinally you will learn what a Multi-Measure Rest is including how to count it and what it looks like in a musical piece.  </p>  <p>  \tOverall this course is a continuation of Lessons 1-3 providing a long term system for learning to play the drums.  You can expect to spend 7-10 days working on this course in order to learn the material at the mastery level.  </p>  <p>  \tThis course can serve in many ways:  </p>  <p>  \t-as a supplement to school band lessons.  </p>  <p>  \t-as a supplement to private drum lessons.  </p>  <p>  \t-as a private drum instruction system.  </p>  <p>  \t-as a collegiate music program secondary instrument learning tool.  </p>  <p>  \t-as an introductory drum course for the aspiring late learner (adult).  </p>  <p>  \t-as a tool for teaching note reading to the developed drummer who plays by ear.  </p>  <p>  \tDo you think playing the drums might be fun?  Playing the drums is lots of fun.  Sign up for the Rhythm to Rock Drum Lesson Series to begin learning how to play the drums.  </p>", 
    "end_date": null, 
    "title": "Rhythm to Rock Drum Lesson 4", 
    "price": "20.00", 
    "instructors": "Thomas Nelson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266004_6a53_2.jpg", 
    "course_url": "https://www.udemy.com/rhythm-to-rock-drum-lesson-4/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T21:15:40Z"
}