{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>\r\n\t  Hi, my name is Tom Nelson.  I have 20+ years of experience teaching public school instrumental music.  I have taught private lessons for most of my adult life and I am an adjunct professor of percussion for Bucknell University.   I am a performer, dad, coach, community member and all of the things that go with being a school teacher.  In addition I am an author who has authored an instructional book for playing the drums.  I have decided to create video lessons for my book and will be posting them here as I create them.  Would you like to learn drums?  How about for your son or daughter?  Read on!\r\n</p>\r\n<p>\r\n\t  This video is Lesson #1.  It is the first lesson I teach to all of my drum students out of my book.  Lesson #1 is the first of many that will teach the student to play the snare drum over a period of 1-3 years.  This is the equivalent of private lessons at a local music store or lessons from a school band instructor.  This is not a &quot;Drum Set&quot; lesson.  There is a separate video that teaches drum set on this site by me that is actually designed to accompany this video but is optional.  The intent of this video is to begin what can become a weekly private drum lesson online for the purpose of learning to read music and play in an ensemble such as &quot;school band&quot;.\r\n</p>\r\n<p>\r\n\t  Coming from a rural area with limited resources, I hope for this video drum lesson series to provide affordable drum lessons for students who may not have access to a private instructor.\r\n</p>\r\n<p>\r\n\t  This is Lesson #1 for students.  The lesson can be completed in one week after which you may choose to sign up for Lesson #2.  Each lesson is intended to last a week before moving on to a new lesson.  There will be close to 25 in all.\r\n</p>\r\n<p>\r\n\t  Why take this course?\r\n</p>\r\n<ul>\r\n\t<li>To learn the drums!  They are so much FUN!</li>\r\n\t<li>To learn how to play drums for the purpose of performing music in a variety of settings later in life.</li>\r\n\t<li>Because you don&#039;t have access to a private instructor.</li>\r\n\t<li>Because it is affordable.</li>\r\n\t<li>Because you can learn in your own home at your own pace.</li>\r\n\t<li>Because you want to learn the drums.</li>\r\n\t<li>Because you want to reinforce what you are learning at school.</li>\r\n\t<li>Because you can not get lessons at school.</li>\r\n</ul>\r\n<p>\r\n\t  What do you need?\r\n</p>\r\n<p>\r\n\t  Not much.\r\n</p>\r\n<p>\r\n\t  A pair of sticks, a practice pad and a music stand = $30 or a make shift set-up that I will show you for even less and you are ready to go.\r\n</p>\r\n<p>\r\n\t So what do you say?  Want to learn the drums?\r\n</p>\r\n<ul>\r\n</ul>", 
    "end_date": null, 
    "title": "Rhythm to Rock Drum Lessons", 
    "price": "20.00", 
    "instructors": "Thomas Nelson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151120_402b_3.jpg", 
    "course_url": "https://www.udemy.com/drum-lesson-1-quarter-notes/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T02:59:47Z"
}