{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>If you have recently started to play the guitar and you want to play 1950s Rockabilly and Rock 'n' Roll the right way, then this course is perfect for you. We'll start with the basics and at the end of the course you have learned how to play 6 great Rockabilly Solos, that you won't find anywhere else on the internet.</p><p><br>In this course you will also learn:</p><ul><li>How to determine the key of a song</li><li>The basics of the Nashville Number System</li><li>To recognize and to play common chord progressions</li><li>Which chords you should use In Rockabilly</li><li>To master the fretboard layout</li><li>Basic chord and scale theorie in a song context</li><li>How to accompany a song and play behind a singer</li><li>To play 6 simple to medium rockabilly solos note for note</li><li>How to work out your own solo</li></ul><p><br><strong></strong></p><p><strong>Which materials are included in this course?</strong><br></p><p> Over 2 hours of HD video lessons. The Note for Note Sections are filmed in split screen technique so you can catch every detail of both hands.<br>For every song you'll learn, I recorded a jam track at four different tempos that sounds as close as possible to the original. That makes it really fun to practice your solos at your own speed.<br> I also included tabs in PDF and Guitar Pro format as well as various graphics and chord diagrams</p><p><strong>Don't hesitate to ask some questions</strong> in the discussion section throughout this course. I will answer each one of your questions as fast as possible.<br></p><p>Here is what my students and customers say:</p><p><em>\"<strong>Thank</strong> <strong>you so much</strong>,for your help and for creating your website.you have \nprovided such a wealth of knowledge and  skill for the pickers who just \ncannot make that next step by themselves. this letter is from a very \ngrateful brian burke,regards and best wishes.\"<br>Brian Burke<br><em><strong>\"Fantastic!!</strong> Great lesson by one﻿ of the best rockabilly guitar player.Thanks\", Michael Simond</em><br><em><strong>\"It's great</strong> to see a guitar player showing how to play the solos to Dancing Doll\", Art Adams</em><br><em>\" I've retired and your lessons are really tasty. I can play Blues \nand Rock but <strong>your lessons are really opening things up</strong>.\", Craig Wolf</em></em><em> <br>\"<strong>These lessons are really brilliant!!</strong> - Well recorded and clearly \nexplained. Thank you for your efforts and I m in line to order my copy \nof this lesson\", Pete Russ<br></em><br></p>", 
    "end_date": null, 
    "title": "Rockabilly Guitar For Beginners", 
    "price": "30.00", 
    "instructors": "Randy Richter", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755198_17f7_3.jpg", 
    "course_url": "https://www.udemy.com/rockabilly-guitar-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-07T16:38:20Z"
}