{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>COURSE UPDATES:</strong></p>\n\n<ul><li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n<p>  \t<strong>COURSE DESCRIPTION:</strong>  </p>\n\n\n\n<p>  \t    In this lesson, MusicProfessor instructor Noelle Fabian guides you through the entirety of three intermediate saxophone solos \"Winter Rhapsodie,\" \"Hunter's Chorus,\" and \"Minuet.\" Learn the important musical, rhythmic and stylistic elements of each piece in various tempos while also learning how to practice and perform.  </p>\n\n\n\n<p>  \t    If you’re looking to improve your Saxophone skills, MusicProfessor provides the perfect easy, online way to do it!  Private lessons cost anywhere from $30 - $100/hr, and as you improve, unfortunately, so does the cost of lessons.  Each MusicProfessor Saxophone course provides an entire year’s worth of instruction, for a fraction of the cost, and at your own convenience.  Plus, each course is taught by an industry leading instructor!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>COURSE FEATURES:</strong>  </p>\n\n\n\n<ul>  \t<li>39 video lessons</li>  \t<li>Downloadable sheet music for each lesson</li>  \t<li>Master three rewarding, fun Saxophone solos</li>  \t<li>Extend your abilities with multiple warm-up exercises</li>  \t<li>Learn how to troubleshoot difficult fingering passages</li>  \t<li>Learn how to improve tongue speed and accuracy </li>  \t<li>Review multiple complicated rhythms</li>  \t<li>Discuss trouble areas and troubleshooting techniques</li>  \t<li>Learn how to break down each piece into manageable practice sections</li>  \t<li>Play each etude at various tempos, including a final performance tempo</li>  </ul>\n\n\n\n<p>  \t    MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy’s 30-day guarantee.  </p>\n\n\n\n<p>  \t    Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>NOTABLE REVIEWS</strong>  </p>\n\n\n\n<p>  \t<em>“Bringing the know-how to the desire!”</em>  </p>\n\n\n\n<p>  \t    -Lamar JH Band  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR:</strong>  </p>\n\n\n\n<p>  \t    Noelle Fabian is a well established young performer and educator in the Dallas- Fort Worth area. An instrumentalist of both classical and jazz genres, she is an active performer in Dallas / Fort-WorthIn the summer of 2009, she was one of 20 musicians to perform as a part of the well-known Disneyland All-American College Band under the direction of Dr. Ron McCurdy.  </p>\n\n\n\n<p>  \t    As a part of the Disneyland College Band, she performed alongside Wycliffe Gordon, Gordon Goodwin, Sal Lozano, Rick Baptist, John Clayton, and Gregg Fields among others. As a woodwind specialist, Ms. Fabian performed with an array of shows and musicals in the DFW area (including WaterTower Theatre and Garland Summer Musicals) on piccolo, flute, and clarinet/bass clarinet, and bassoon.  </p>\n\n\n\n<p>  \t    Most recently, she was a featured instrumentalist with the Forth Worth Symphony Orchestra performing the tenor sax solo on Ravels Bolero and on Alto/Baritone saxes for the Celebrate America concert series. She has also performed with the Plano Symphony Orchestra,Texas Saxophone Quartet and Greater Dallas Youth Orchestra. She performs frequently with The Dallas Wind Symphony, with whom she performed during the 2006 Midwest Band and Orchestra clinic in Chicago as the featured performing ensemble. Additionally, she recorded with the DWS on their 2008 release of Lincolnshire Posy, Music for band by Percy Grainger.  </p>\n\n\n\n<p>  \t    Fabian is a graduate of Southern Methodist University where she graduated Magna Cum Laude with both a BM in Music Performance and BM in Music Education. In December of 2012, Ms. Fabian completed a Masters of Music degree in Multiple Woodwinds from the University of North Texas where she performed with the UNT Wind Symphony, Kaleidoscope Saxophone Quartet and the Zebras, a Tower of Power lab ensemble.  </p>\n\n\n\n<p>  \t    Ms. Fabian currently holds the chair of Principal Saxophone in the newly formed Dallas Civic Wind Ensemble. She has also participated in a number of music festivals including Tanglewood Music Festival with the Boston University Tanglewood Institute, and Interlochen Arts Academy and Camp.  </p>\n\n\n\n<p>  \t    —  </p>\n\n\n\n<p>  \t<em>This course has been provided by MusicProfessor, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Sax Solos: Learn how to Perform Three Fun and Unique Pieces!", 
    "price": "20.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184088_1bc1_10.jpg", 
    "course_url": "https://www.udemy.com/saxophone-solos/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-17T18:33:24Z"
}