{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Si te gusta bailar sevillanas y quieres ampliar tus recursos  o sabes tocar las castañuelas y quieres aplicarlo al baile, este curso te va a interesar.</p>  <p> Aprenderás a ejecutar el toque de castañuelas durante el baile de las cuatro sevillanas, coordinado con brazos y pies.</p>  <p><strong><u>¿Cuáles son los requisitos?</u></strong></p>  <p>Para realizar este curso se recomienda conocer el baile de las cuatro sevillanas, si aún no las has aprendido, todavía estás a tiempo con el curso BAILE POR SEVILLANAS</p>  <p>Igualmente aconsejamos tener las nociones y destrezas básicas para el toque de las castañuelas, que se puede conseguir con el curso CASTAÑUELAS POR SEVILLANAS</p>  <p>Es necesario tener unas castañuelas propias, si aún no las tienes, puedes preguntarme y te ayudo dónde conseguirlas.</p>  <p><strong><u>¿Qué voy a aprender en este curso?</u></strong></p>  <ul><li>-23 clases con más de 80 minutos de contenido!</li><li>-Aprenderás los toques de las castañuelas sobre el ritmo de las cuatro sevillanas.</li><li>-Podrás practicar la coordinación de las castañuelas durante el movimiento de brazos y pies.</li><li>-Conocerás cómo bailar unas sevillanas manejando este instrumento.</li><li>-Tendrás las herramientas necesarias para entender y practicar las sevillanas con castañuelas.  </li></ul>            <p><strong><u>¿A quién está dirigido?</u></strong></p>  <p>Cualquier persona con ganas de bailar y tocar este instrumento.<strong><u></u></strong></p>", 
    "end_date": null, 
    "title": "Sevillanas con Castañuelas - Baile y toque al mismo tiempo", 
    "price": "40.00", 
    "instructors": "Carmen Iniesta", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/767400_efef_2.jpg", 
    "course_url": "https://www.udemy.com/sevillanas-con-castanuelas/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-19T08:15:57Z"
}