{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>¿Quieres las mejores clases de guitarra en Internet?</strong></p><p>Accede ahora a este curso completo de guitarra rítmica para principiantes con el que aprenderás de forma rápida y entretenida. Un sistema de guitarra probado con el que cientos de estudiantes como tú ya han aprendido a tocar.<br></p><p>Este curso te enseña paso a paso los secretos de la guitarra rítmica. Las clases están grabadas en vídeo HD de alta calidad con doble cámara para que no te pierdas detalle, pero además todas las clases en vídeo vienen acompañadas de material extra que puedes descargar.<br></p><ul><li>pdf</li><li>audio con banda</li><li>audio con banda y guitarra</li></ul><p><br></p><p>En el pdf encontrarás lo que se dice en el vídeo por escrito, para que puedas consultarlo de forma fácil, es un apoyo muy útil.</p><p>Dispones de dos tipo de audio:</p><p>El audio con banda y guitarra te servirá para tocar sobre ella e intentar imitar lo que hace mi guitarra (todo explicado con detalle en la clase en vídeo). Esto hace que practicar sea mucho más eficiente y aceleres el proceso de aprendizaje.</p><p><br>El audio con la banda no tiene la guitarra, en este caso tu serás el guitarrista único de la banda, el resto de instrumentos serán la compañía perfecta para pasarlo en grande.</p><p>Puedes seguir este curso con cualquier tipo de guitarra, acústica, eléctrica, española, criolla..<br></p><p>Si sigues este curso desarrollarás una gran capacidad rítmica y podrás ser capaz de tocar una gran variedad de ritmos y tocar tus canciones favoritas con confianza y de forma fácil.</p><p><strong><em>Este es el curso de guitarra rítmica que estás buscando. ¡¡¡ Te espero en clase !!!</em></strong></p> <p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Sistema Completo De Guitarra Rítmica Para Principiantes", 
    "price": "50.00", 
    "instructors": "Rodolfo Gonzalez Rodriguez", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758216_520c.jpg", 
    "course_url": "https://www.udemy.com/sistema-completo-de-guitarra-ritmica-para-principiantes/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T10:49:19Z"
}