{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Always wanted to learn how to play slap bass, but it was too difficult?</strong></p>\n\n<p><strong>This course is my personal guide to slap bass technique and playing style. You'll learn everything you need to know about slap bass technique, enough to get you started in a matter of weeks. Yes, you CAN SLAP TOO! Believe it or not. I'll show you all the standard slap techniques in details, with close-ups and I'll also share secrets and tricks that bass teachers often skip to tell us! I guarantee that you'll be able to learn how to slap with the help of this course.</strong></p>\n\n<p><strong>Please watch the free preview videos to get a taste for what’s inside.</strong></p>\n\n<p>This course is shot in full HD video, with quality bass playing audio mixed with the backing tracks. The course is split into five chapters, starting with basic technique all the way up to learning a beginner slap song and being able to improvise on your own in a slap bass style.</p>\n\n<p><strong>This course includes:</strong></p>\n\n<ul><li>PDF, Guitar Pro 5 &amp; Guitar Pro 6 tabs for each playing example</li><li>Specially designed slap bass exercises for quick technique development</li><li>Backing track videos for jamming and practice</li><li>English subtitles</li><li>Unlimited forum help and instructor feedback</li><li>Premium beginner slap bass song for you to learn</li></ul><p>I want you to know that I would love if you would <strong>post your questions</strong> as you progress through the course. Please feel free to <strong>send me messages</strong> anytime, I’ll be checking them out and responding quickly. Also, I’d like to encourage you to record audio files or videos (you can post videos on Youtube and share the link) and send them to me for <strong>feedback</strong>.<br></p>\n\n<p><strong>I’m here to help YOU, so please don’t be shy! :)</strong></p>\n\n<p>This course is meant as an introduction to slap bass playing style. We won't go into any complicated techniques or slap bass lines. What you’ll gain are technique foundations for being able to play slap bass and learn famous slap bass songs. After all, the most of us just want to be able to learn how to play our favorite RHCP songs and others that utilize a slap bass technique. This course will help you with that. You'll also get a taste for how slap bass playing feels and sounds like, and you can decide if you want to take your slap bass playing further or not. Every bass players should know how to slap, even for just a little bit.</p>\n\n<p>This course does not rely on music theory or any complicated playing techniques and this means that the course is fully suitable for complete beginners. Trust me, I have started learning slap bass playing style when I was just starting out on the bass, and if I was able to make it - You will to! Slapping is not something only advanced bass players should be able to do - everyone can do it. No talent or any playing experience is needed, you just need the desire to learn how to slap and that's it.</p>\n\n<p>Please send me your feedback about the course. What did you like? What did you not like? How could I improve it? Your feedback means a lot to me and I need to in order to better shape the course content for YOU.</p>\n\n<p><strong>Please Enroll Today!</strong></p>\n\n<p>Cheers,</p>\n\n<p>Bogdan</p>", 
    "end_date": null, 
    "title": "Slap Bass For Beginners", 
    "price": "35.00", 
    "instructors": "Bogdan Radovic", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/846962_9c71.jpg", 
    "course_url": "https://www.udemy.com/slap-bass-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-12T10:01:19Z"
}