{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Setz dich einfach hin und spiel!</strong></p><p>Stell dir vor, du setzt dich ans Klavier und kannst sofort spielen. Völlig frei tauchst du in die Welt der Klänge ein. Und das beste ist: die Musik wird gerade in diesem Moment von dir erschaffen. Du spielst genau das, was du jetzt gerade ausdrücken möchtest.</p><p>Wie wäre das?</p><p>Du denkst, das geht nicht?</p><p>In diesem Klavier-Kurs zeige ich dir gleich zu Beginn, wie du schon mit wenigen Tönen ausdrucksvoll spielen kannst. Es wird dir viel Freude bereiten.</p><p>Schau dir am besten gleich die <strong>Vorschau-Lektionen</strong> an.</p><p>     ---------</p><p>Ich bin Franz Titscher, dein kreativer Klavierkurs-Leiter.<br></p>    <p>Als Klavier- und Musiktheorielehrer kenne ich spannende und sehr effektive Übe-Methoden, die ich gerne an Dich weitergebe. Dadurch lernst du leichter und schneller – mit mehr Freude an der Musik.</p><p><strong>Was macht guten Klavierunterricht aus?</strong></p><p>Es sind 3 Teilbereiche, die möglichst gleichwertig abgedeckt werden sollten:</p><ul><li>die Improvisation, das freie Spielen und Gestalten</li><li>die „Wohlfühl“-Klaviertechnik</li><li>das Spielen nach Noten (Musiktheorie, Akkorde usw.)</li></ul><p><br>Auch wenn Du am liebsten frei spielen möchtest, so sind Noten und die Musiktheorie ein wertvolles Werkzeug. Im Kurs wirst Du sehr schnell die Vorteile erkennen und Dich schnell und spielerisch einarbeiten.</p><p>Der Lehrplan dieses abwechslungsreichen Kurses ist so angelegt, dass du in allen Bereichen gute Fortschritte erzielen wirst. </p><p><strong>Was hast du davon?</strong></p><ul><li>Üben macht einfach mehr Spaß</li><li>Du lernst deine Wunschstücke schneller</li><li>Du behältst das Gelernte länger</li><li>Du spielst ausdrucksvoller</li><li>Du kannst die Musik richtig genießen</li></ul><p><br></p><p>Also, worauf wartest du? Klick oben auf den grünen Button und<strong> belege jetzt diesen Kurs!</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Spielend Klavier lernen – mehr Spaß beim Üben", 
    "price": "50.00", 
    "instructors": "Franz Titscher", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592606_f939_2.jpg", 
    "course_url": "https://www.udemy.com/spielend-klavier-lernen/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T07:54:13Z"
}