{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">MY PERSONAL GUARANTEE - I AM SO CONFIDENT YOU WILL LOVE THIS COURSE THAT IN THE UNLIKELY EVENT THAT YOU DON&#039;T, I WILL REFUND YOU ALL THE MONEY (within 30 days of purchasing) WITH NO QUESTIONS ASKED. THIS IRONCLAD GUARANTEE IS BACKED UP BY UDEMY.</strong></em><br style=\"\">  \t<br style=\"\">  \tIf you ever wanted to learn the harmonica this course is for you!<br style=\"\">  \tI will hold your hand all the way through the videos with my &#039;infectious and humourous&#039; (I&#039;m told) style of teaching. I am right with you talking to you personally in a one to one lesson showing exactly you how to do it, and encouraging you to become confident and go it alone.<br style=\"\">  \tThis course gives you a series of basics in 12 easy lectures. If you take one lecture per week that&#039;s three months, although you can fast track and do it all in a weekend if you like.<br style=\"\">  \tIt&#039;s designed to be fun, friendly, easy for anyone to learn - even non-musical people! It is designed to help you succeed and lead you on to the next in the series.<br style=\"\">  \tThere are pdfs and mp3 downloads with every lecture so you can read the tablature and play along with the audio music written especially for learning harmonica. Look in &#039;View resources&#039; in the top right of your screen. The download tab is second in from the left - the one with the arrow.<br style=\"\">  \tPlease be sure to visit the Questions area and Forum to interact with other students. It&#039;s a great way to learn more and helps you apply what the course gives you.<br style=\"\">  \tI check my messages daily where possible if you want to arrange a call or skype please message me.<br style=\"\">  \t<em style=\"\">&#039;Ben Hewlett is the UK&#039;s most respected harmonica teacher and most prolific author. He will lead you through the ins and outs of harmonica playing through a series of short video lessons. His teaching style is confident, practiced, humorous, skillful, knowledgeable and packed with information in bite sized chunks.<br style=\"\">  \tBen is used to teaching all over the world at prestigious harmonica festivals and is delighted to offer his services to you.&#039;</em><br style=\"\">  \t<strong style=\"\">PLEASE NOTE THE CONTENTS OF THIS SHORT COURSE ARE INCLUDED AS A SMALL PART OF MY ENORMOUS &#039;LEARN HARMONICA, AMAZE YOUR FRIENDS, AND HAVE FUN&#039; COURSE - FORMERLY KNOWN AS &#039;THE ULTIMATE HARMONICA COURSE&#039;. THINK OF THE BIG ONE AS A BOXED SET (DISCOUNTED FOR BULK PURCHASE) AND THIS COURSE AS THE SMALL INDIVIDUAL COMPONENTS.</strong>  </p>", 
    "end_date": null, 
    "title": "Starting to play the blues on your harmonica in easy steps ", 
    "price": "20.00", 
    "instructors": "Ben Hewlett", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/139788_b1cd_3.jpg", 
    "course_url": "https://www.udemy.com/benhewlettharmonicatuitionint1/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-30T20:12:24Z"
}