{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Most guitarists suck at strumming. Yes, they are awful.</strong> </p><p style=\"\">Why? Bad teachers, bad learning habits and bad information. They are not taught the proper ways to strum, they lack technique, they don`t understand rhythm and worst of all they don`t know that this is holding them back. All this all leads to a LOT of wasted years with the guitar and a lack of confidence when they are playing and strumming it. </p><p style=\"\">Using our video lessons, supplementary guide and killer bonuses you can now learn how to strum with complete confidence and gain an insider understands of rhythm and all in a short space of time. </p><p style=\"\">You will be able to play the most common strum patterns in popular music which means along with a few chords you will be able to learn, play and impress others with 10,000`s of classic songs as well as write your own with ease. <span style=\"\"></span></p><p style=\"\"><strong style=\"\">Save hundreds of hours trying to work strum patterns out for yourself</strong></p><p style=\"\">Imagine being able to listen to a song, either find or workout the chords, hear the strum pattern and realize that you already know how to play this strum pattern, and then learn it in minutes just by listening to it. </p><p style=\"\">Well, now you can, because in this course that`s what I take you through.</p><p style=\"\">Most songs use just a select few (8 in fact) strumming patterns, a bunch of simple chords (which you are taught in this course) </p><p style=\"\"><strong style=\"\">Learn why most people&#039;s strumming sound dead (and what to do instead)</strong></p><p style=\"\">Well, I`ll tell you, apart from the lack of technique, dynamics, expression, subtlety and rhythm, which you will master in this course, it`s their inability to play with feel. </p><p style=\"\">One key element every guitarist from George Harrison to Kurt Cobain, from Jimi Hendrix to Ed Sheeran has is a great sense of feel. </p><p style=\"\">Most mere mortals don`t get past level 1 here, but I will teach you a simple little trick that can help add a sophisticated sense of feel and soul into ANY strum pattern you will ever learn. </p><p style=\"\">Time is precious, and the guitar takes many, many years to truly master. Perfect this one fundamental element today – the crucial element of strumming and you can kick start your guitar playing to the next level allowing you to go on and be the guitar guru you desire to be.</p><p style=\"\"><strong style=\"\">&quot;The fretting hand is the brain, the strumming hand is the soul.&quot; </strong></p><p style=\"\">So much of our passion as guitarists come from the strumming hand. </p><p style=\"\">Listen to the like of Damien Rice and Ed Sheeran to hear what I mean. The fretting hand doesn`t do a lot apart from the basic most of the time. </p><p style=\"\">With these guys, the strumming hand takes these competent sounding basics and turbo charges them into a powerhouse of guitar wizardry - the sound of a soulful, heartened guitar player who is bearing is his soul for the world to hear. </p><p style=\"\">You can just feel the passion, sorrow, joy and love oozing out of these guitarists hands.</p><p style=\"\">You will learn how to apply this and so much more.</p><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\"><strong style=\"\">If you were guaranteed to save hundreds of wasted hours searching YouTube, discovering these techniques for yourself or paying $1000`s dollar in lessons, what that be worth to you?</strong></strong></p><p style=\"\">I have vast knowledge of teaching the guitar, and I guarantee once you have mastered these materials, you will have far more confidence performing in front of friends, family members, college parties, at gigs, open mic night and even jam sessions. </p><p style=\"\">You will be able to write songs far more ease, and you will impress yourself and others with your strumming skills!</p><p style=\"\">Each video is short, in-depth and packed full of real, practical information. </p><p style=\"\">Join the course today to get all these benefits, becoming a strumming master and truly fall in love with the guitar.</p>", 
    "end_date": null, 
    "title": "Strumming With Soul: Strum Your Guitar Like A Pro With Ease", 
    "price": "50.00", 
    "instructors": "Dan Thorpe", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521440_3923_2.jpg", 
    "course_url": "https://www.udemy.com/strumming-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-05T17:42:56Z"
}