{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>\r\n\t       Curso PRÁCTICO de guitarra para principiantes paso a paso. Destinado a aquellos que no tienen nociones previas o que ya saben algo de guitarra.\r\n</p>\r\n<p>\r\n\t       Aprende a tocar la guitarra de la mano de un guitarrista y profesor de guitarra especializado con muchos años de experiencia.\r\n</p>\r\n<p>\r\n\t       Probablemente el mejor curso de guitarra para principiantes. Hemos diseñado un programa para que aprender a tocar la guitarra sea divertido. La única forma de aprender es tocando lo que más te gusta y no practicando ejercicios aislados como encontrarás el la mayoría de cursos de guitarra. Este curso está diseñado para aprender tocando la guitarra, y todo lo que veamos lo trasladaremos a la guitarra... TOCAR, TOCAR y TOCAR.\r\n</p>\r\n<p>\r\n\t       Si realmente quieres aprender a tocar la guitarra este curso esta hecho para ti. Al final de curso te sorprenderás de lo que eres capaz de hacer con una guitarra entre las manos.\r\n</p>\r\n<p>\r\n\t       Aprenderás más en unas pocas semanas que la mayoría de la gente que lleva años tocando la guitarra.\r\n</p>\r\n<p>\r\n\t       El curso está estructurado en secciones y verás lo siguiente :\r\n</p>\r\n<ul>\r\n\t<li>Acordes mayores</li>\r\n\t<li>Acordes menores</li>\r\n\t<li>Acordes séptima</li>\r\n\t<li>Acordes menores séptima</li>\r\n\t<li>Acordes sin cejilla y con cejilla</li>\r\n\t<li>Power Chords y Acordes de Quinta</li>\r\n\t<li>Gran cantidad de canciones</li>\r\n\t<li>Diferentes estilos musicales</li>\r\n\t<li>Afinar la guitarra</li>\r\n\t<li>Conceptos básicos</li>\r\n\t<li>Las notas en el mástil de la guitarra</li>\r\n\t<li>Como usar el Metronómo Inteligéntemente</li>\r\n\t<li>División del tiempo</li>\r\n\t<li>Ritmo</li>\r\n\t<li>Técnica</li>\r\n\t<li>La escala pentatónica</li>\r\n\t<li>La escala mayor</li>\r\n\t<li>Arpegios</li>\r\n\t<li>Rutina de Práctica de Éxito</li>\r\n\t<li>Púa alterna y Sweep Picking</li>\r\n\t<li>Hammer On y Pull Off</li>\r\n\t<li>Técnicas como Palm Mute, Stoccato...</li>\r\n\t<li>Y mucho más</li>\r\n</ul>\r\n<p>\r\n\t       No importa que tipo de guitarra te guste tocar, podrás seguir el curso de guitarra con una guitarra eléctrica, acústica, española o criolla.\r\n</p>\r\n<p>\r\n\t <strong>Sistema exclusivo de doble cámara y cámara aérea:</strong>\r\n</p>\r\n<p>\r\n\t       El curso está realizado en vídeo HD de alta calidad con doble cámara, una de ellas es una cámara aérea para que no pierdas detalle de lo que sucede en el mástil.\r\n</p>\r\n<p>\r\n\t <strong>Archivos en pdf:</strong>\r\n</p>\r\n<p>\r\n\t       Dispones de archivos en pdf para que seguir las clases sea aún más sencillo. En estos archivos viene escrito todo lo que vemos en las clases en vídeo.\r\n</p>\r\n<p>\r\n\t <strong>Archivos de audio y backing tracks:</strong>\r\n</p>\r\n<p>\r\n\t       Utiliza los audios y backing tracks para tocar encima de ellos. Será como tocar con una banda de música completa. Hemos creado estas pistas de audio para que aprender a tocar la guitarra sea más divertido y aproveches mejor el tiempo de práctica.\r\n</p>\r\n<p>\r\n\t       Es un curso de guitarra práctico, por lo que pondrás en práctica todo lo que aprendamos en el curso. Empezarás aprendiendo las nociones básicas;  como leer los acordes, como afinar la guitarra, como localizar todas las notas en el mástil de la guitarra sin dificultad, como leer tablatura, división del tiempo...\r\n</p>\r\n<p>\r\n\t       Después pasaremos directos a la acción. Aprenderás acordes, a continuación un ritmo base y después seguiremos con una canción que utilizará los acordes y ritmo que has aprendido. Continuaremos aprendiendo nuevos acordes, nuevos ritmos y de nuevo aprenderemos una nueva canción para ponerlos en practica. ¡ Increíble verdad! <strong>¡ Lo pasaremos en grande !</strong>\r\n</p>\r\n<p>\r\n\t  Utilizaremos las clases de ritmo y las canciones para ir incorporando diferentes estilos musicales y distintas técnicas para llevar tu forma de tocar al siguiente nivel. Sin darte cuenta aprenderás a tocar la guitarra de forma rápida y fácil y acabarás siendo un maestro de la guitarra. <strong>Mis años de experiencia como profesor me permiten ofrecerte clases dinámicas y divertidas para que aprender a tocar la guitarra sea una fiesta.</strong>\r\n</p>\r\n<p>\r\n\t  Después tienes diferentes secciones como las de Técnica, La Escala Pentatónica, La Escala Mayor...\r\n</p>\r\n<p>\r\n\t       Has dado con el mejor curso de guitarra, aprovecha esta oportunidad, te espero dentro del curso. No esperes más. ¡ Inscríbete Ya !\r\n</p>", 
    "end_date": null, 
    "title": "Super-Curso de Guitarra Práctico Para Principiantes", 
    "price": "50.00", 
    "instructors": "Rodolfo Gonzalez Rodriguez", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207440_0654_4.jpg", 
    "course_url": "https://www.udemy.com/super-curso-de-guitarra-practico-para-principiantes/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T19:12:33Z"
}