{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>THE TRUTH</strong><strong> IS most guitar courses teach you a whole bunch of stuff you don't need to know as a beginner - and ignore a whole bunch of stuff you should learn.</strong>  </p><p>  \t<strong>                       Super Beginner Guitar</strong> teaches a new player how to play guitar in the best way possible. Gain more than just the basics when you learn guitar. This course teaches essential techniques that many guitarists don't learn until years later!</p>  <p>  \t<strong>Watch the promo video to learn why you should take this guitar course!</strong>  </p>  <p>Super Beginner Guitar is more than just a bunch of lessons. The instructor gives useful 'real-world' insight by explaining the future potential of many techniques shown. The goal is not to just learn a few skills 'text-book' style but to grasp what you are learning and become dynamic as a guitar player.</p>  <p>  \t                               Topics include:  </p>  <ul>  \t<li>playing individual strings</li>  \t<li>accuracy with both hands</li>  \t<li>learn how to play powerchords</li>  \t<li>learn open chords</li>  \t<li>simple melodies</li>  \t<li>basic music progressions</li>  \t<li>basic music theory</li>  \t<li>and more!</li>  </ul>  <p>  \t        Animated diagrams show the beginner guitar player exactly how to play lessons. Multiple camera angles let the student to see the guitar work from different perspectives. Course emphasis is on building correct guitar playing technique in a positive, creative atmosphere. This is the best online guitar course for a beginner.</p>  <p>Get this course now!  </p>  <p>Support material includes:  </p>  <ul>  \t<li>  \t  \t\t                downloadable PDFs that fully cover each lesson  \t  \t</li>  \t<li>  \t  \t\t                tuning notes for guitar (standard tuning)  \t  \t</li>  \t<li>  \t  \t\t                drum beats to practice along to  \t  \t</li>  \t<li>  \t  \t\t        external links  \t  \t</li>  </ul>  <p>  \t                Super Beginner Guitar is suitable for all styles, left or right handed, and children. It sets students on a path to guitar success through diverse and interesting lessons set in an encouraging, vibrant atmosphere.  </p>  <p>  \t<strong>Take this course now and learn how to play guitar the best way!  </strong>  </p><p>#learnguitar #guitarlessons #guitarplayer</p>", 
    "end_date": null, 
    "title": "Super Beginner Guitar - start right, start awesome", 
    "price": "20.00", 
    "instructors": "Robert Prosser", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301686_31d8_5.jpg", 
    "course_url": "https://www.udemy.com/super-beginner-guitar-start-right-start-awesome/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T00:19:04Z"
}