{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong style=\"\">Play the song &quot;Swing Low&quot; on piano and improvise like the American Hall of Fame pianist of the great era of pop music: Floyd Cramer, who played together with artists like Elvis Presley, Roy Orbison, The Everley Brothers and many more.</strong>  </p>  <p>  \t      In this course you will learn the important basics for a professional piano playing. While I show you how to play Swing Low, from the very beginning, I´ll explain you  </p>  <ul style=\"\">  \t<li>important fingering techniques,</li>  \t<li>the chord structure of the song &quot;Swing Low Sweet Chariot&quot;,</li>  \t<li>simple and more advanced left hand accompaniment techniques,</li>  </ul>  <p>  \t      and of course we´ll focus on the <strong style=\"\">101 Nashville Piano Style </strong>with its three main features:  </p>  <ol style=\"\">  \t<li>the special upper voice</li>  \t<li>the famous slip notes, and</li>  \t<li>the yodle notes</li>  </ol>  <p>  \t      Learn the historic song &quot;Swing Low&quot; which was interpreted in so many different ways, and play it in an exciting new and fresh way.  </p>  <p>  \t      When you go through this course, you will have learned to apply the Nashville Piano Style , which is the bottom line for adaption to your own style, and for improvising in this style.  </p>  <p>  \t  With the subscription of this course you also get the sheet music of all presented examples.  </p>", 
    "end_date": null, 
    "title": "Swing Low - The 101 Authentic Nashville Piano Style Course", 
    "price": "20.00", 
    "instructors": "Peter Janzen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/153230_caaf_5.jpg", 
    "course_url": "https://www.udemy.com/swing-low-nashville-piano-style/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-27T02:08:57Z"
}