{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<ul><strong class=\"redactor-inline-converted\">[Português] </strong>Para ler a versão em português, puxe a página para baixo.<strong class=\"redactor-inline-converted\"><br>[English]</strong><br><li>Do\n\tyou want to improve your double bass drum technique to reach a new\n\tlevel?\n\t</li><li>Do\n\tyou want to be able to perform feet techniques that many thought\n\twould only be possible to achieve with hands?\n\t</li><li>Do\n\tyou want to learn hundreds of double bass drum rhythms and magnify\n\tyour drumming glossary?\n\t</li><li>Do\n\tyou want to learn with a smart sheet system which is going to help\n\tyou reading them?\n\t</li><li>Do\n\tyou want to practice exercises in a fun way with hundreds of guitar\n\triffs to go along with your training?</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Then\nthis course is for you!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\nIn\nthis course we will start by approaching the heel toe technique. A\ntechnique that has been, in my opinion, underappreciated and\nunderused in the drumming world.\n\nFirst, let’s shed some light\non several misconceptions that surround this technique, the ones\ncontributing to having it misinterpreted and, consequently, underused\nand even ignored.\n\nThen, we will learn the technique step by\nstep, details after details and I will present solutions to\npotential problems. \n</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n\n\tAfter\nthat, we are going to step into the preliminary exercises section,\nwhich will allow you to give the first steps with the above-mentioned\ntechnique, whilst learning how to assimilate that in a\nrhythmic-musical context.\n\nIn the following section, you will\nlearn how to blend that technique within a string of exercises based\non sixteenth notes. For each exercise we will learn 4 different\nrhythms/grooves.\n\nThen, we will move on to a section that\nincludes a very similar group of exercises, but whose foundation\nconsists of eighth note triplets.\n\nLast but not least, we will\nhave the section which I believe is the favorite of many of you…\nthe rudiments section! In it you will learn to do those with double\nbass drum and you will assimilate them in 4 rhythms/grooves, like in\nthe previous sections.\n\nAfter all this you will be able to create\nyour own rhythms and even perform a double bass drum solo! You just\nneed to let your imagination and creativity flow!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n<strong class=\"redactor-inline-converted\">These\nare the materials which are included in this course:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>All\n\tthe sheets of all the exercises presented in the course will be\n\tavailable to download;\n\t</li><li>All\n\tthe guitar riffs presented in this course will be available to\n\tdownload.\n</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n<br></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Extra\nnote:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In\nsome of the course’s sections, certain videos will be played in\nslow motion, so that you can see everything with the maximum detail.\nAll the videos were recorded at 120 frames per second, to assure you\nhave a watching experience of the highest degree. \n</p>\n\n<p><br></p>\n\n<p><strong>[Português]</strong></p>\n\n<ul><li>Queres elevar a tua técnica de pedal duplo a um novo patamar?\n</li></ul>\n\n\n\n<ul><li>Queres ser capaz de fazer técnicas com os pés que muitos acham\n\tserem apenas possíveis de realizar com as mãos?\n\t</li><li>Queres aprender centenas de ritmos de pedal duplo e ampliar o teu\n\tvocabulário de bateria?\n\t</li><li>Queres aprender com um sistema de partituras inteligente que te\n\tajuda na leitura das mesmas?\n\t</li><li>Queres praticar os exercícios de forma divertida com centenas de\n\t<em>riffs</em> de guitarra para os acompanhar?\n</li></ul>\n\n\n\n\n\n\n\n\n\n<p>\t<strong>Então\neste curso é para ti!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\tNeste\ncurso vamos começar por abordar a técnica <em>heel toe</em>. Técnica\nque, na minha opinião, tem sido subvalorizada e subaproveitada no\nmundo da bateria.</p>\n\n\n\n\n\n<p>Primeiro,\nvamos desmitificar alguns dos conceitos errados que a envolvem e que\ntêm contribuído para que ela seja mal interpretada e,\nconsequentemente, subutilizada e até mesmo ignorada.</p>\n\n\n\n\n\n<p>Em\nseguida, vamos aprender a técnica passo a passo, detalhe a detalhe e\nmostrarei soluções para possíveis problemas.</p>\n\n\n\n\n\n\n\n\n\n<p>\tPosteriormente,\npassaremos para a secção dos exercícios preliminares que te\npermitirão dar os primeiros passos com a técnica referida\nanteriormente e aprender como a integrar num contexto\nrítmico-musical.</p>\n\n\n\n\n\n<p>Na\nsecção seguinte, aprenderás como integrar a técnica numa série\nde exercícios com base em semicolcheias. Para cada exercício iremos\naprender 4 ritmos/<em>grooves</em> diferentes. \n</p>\n\n\n\n\n\n<p>De\nseguida, passaremos para uma secção com um grupo de exercícios\nmuito semelhante, mas que têm por base tercinas de colcheia.</p>\n\n\n\n\n\n<p>Por\nfim, mas não menos importante, teremos a secção que acredito venha\na ser a favorita de muitos de vocês… a secção dos rudimentos!\nNela aprenderás a fazer os mesmos com o pedal duplo e como os\nintegrar em 4 ritmos/grooves, tal como nas secções anteriores.</p>\n\n\n\n\n\n<p>Após\ntudo isto serás capaz de criar os teus próprios ritmos e até serás\ncapaz de fazer um solo de pedal duplo! Basta deixar a imaginação e\na criatividade fluir!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Os\nmateriais que estão incluídos no curso são:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Todas as partituras de todos os exercícios apresentados no curso\n\testarão disponíveis para <em>download</em>;\n\t</li><li>Todos os <em>riffs</em> de guitarra apresentados no curso estarão\n\tdisponíveis para <em>download</em>.\n</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>Nota\nextra:</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\tEm\nalgumas secções do curso determinados vídeos são reproduzidos em\n<em>slow motion</em>, para que possas ver tudo ao detalhe. Todos os\nvídeos foram filmados a 120 frames por segundo, de forma a\nproporcionar-te uma visualização de altíssima qualidade.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Take your double bass drum technique to the next level", 
    "price": "20.00", 
    "instructors": "Nelson Fernandes", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/808292_e124_2.jpg", 
    "course_url": "https://www.udemy.com/take-your-double-bass-drum-technique-to-the-next-level/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-30T16:03:19Z"
}