{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This is the perfect place to start for beginner trombone players! Take all the guess work out of how and what to practice. This program comes with specially designed practice videos for each lesson.\n\n  </p>\n\n<p><strong>Learn To Play The Trombone Quickly And Easily Using The Music Coach Learning System.</strong>\n\n  </p>\n\n<p>-Learn the basics of how music works with fun easy to understand animated videos.\n\n  </p>\n\n<p>-Use a proven system to take all the guess work out of what to practice.\n\n  </p>\n\n<p>-Gain the confidence to play your trombone with others.\n\n  </p>\n\n<p>-Enjoy learning at a pace that is right for you.\n\n  </p>\n\n<p><strong>Start Playing And Creating Music To Express Your Musical Self</strong>\n\n  </p>\n\n<p>You will learn everything you need to know about the trombone, from how to put it together and make your first sound, to how to play the trombone in a band! This course also focuses on how to express yourself through music by teaching beginner improvisation (soloing). The goal of The Music Coach Trombone Program is for you to fully express who you are through the instrument.\n\n  </p>\n\n<p><strong>Content and Overview</strong>\n\n  </p>\n\n<p>I designed this program to help you begin your musical journey on the trombone in the most efficient and fun way. This program is suitable for anyone who has a desire to play and has a working trombone. There are over 2.5 hours of video lessons and practice videos.\n\n  </p>\n\n<p>The layout of the course uses a simple format:\n\n  </p>\n\n<p>-1 lesson video that explains a new concept/technique,\n\n  </p>\n\n<p>-1 practice video that has voice overs and graphics to help you play along with the teacher on the screen in \"real time\".\n\n  </p>\n\n<p>There are twelve sets of lessons and practice videos that help you learn melody, rhythm, harmony, and improvising. This program also contains a \"Jam Room\" with a virtual band that you can play along with at different speeds. As an added bonus there are also five music theory made easy animated videos that explain the basic building blocks of music.\n\n  </p>\n\n<p>At the end of this course you will have the confidence to play the trombone both on your own and with others in different musical situations.\n\n  </p>\n\n<p><strong><u>Christian Overton – Trombone instructor:</u></strong>\n\n  </p>\n\n<p>If you ask jazz trombonist Christian Overton when his musical destiny unfolded, you’ll get a refreshingly simple story. Don’t wait for swooning tales about obscure jazz records with intricate trombone solos and performances that set him on the unchangeable path to becoming a musician. All that inspiration actually followed after an older brother introduced the trombone to a young Christian one day in the family room. “I thought I would be ahead of my grade six music class,” Christian confesses with charismatic honesty. From precocious schoolboy to Humber music performance graduate, Christian Overton is now one of Toronto’s leading jazz musicians and writers—who also admits “…all the saxophones were taken by the time the teacher got to the letter ‘O’.” Growing up in Sudbury, Ontario, Christian’s childhood was comic books, snow, and music appreciation for fun. His father (one of Northern Ontario’s foremost radio personalities) played all sorts of tunes for the four Overton kids to enjoy. Sessions of classical Beethoven changed to the smooth seventies rock of Chicago and then backtracked to The Beatles. The defining moment, however, of Christian’s fascination with jazz happened with a gift from his uncle—Mellow-Dy by Slide Hampton. “Slide played things on the trombone I never heard before or even dreamed were possible.” After that first trombone lesson in a house filled with music, a life all about jazz was taking shape. Christian’s formal music education became an important experience. He was fortunate to attend schools with highly regarded music programs where his abilities were encouraged and challenged. As a teenager, Christian continued to explore the giants of trombone history, listening endlessly to the sweet melodies of JJ Johnson and carefully noting Curtis Fuller’s technical mastery. “I used to listen to the records and learn the solos too,” says Christian. “I could eventually play along with them note for note.” Surrounded by these influences and dedicated teachers, Christian soon showed great promise as a trombonist, improviser, and bandleader. In fact, when he was nearly finished high school, he was already leading a working jazz trio and had professional experience in every genre from dance bands to symphony orchestras and studio work.\n\n  </p>\n\n<p>Leaving his Sudbury home, Christian accepted a scholarship for jazz performance at Humber College in Toronto where he excelled both in the classroom and on the college performance circuit. He studied with some of the nation’s top jazz musicians including Pat LaBarbera, John Macleod, and Alistair Kay. Christian expanded his instrumental skills into bass trombone doubling and his musical proficiency as a contemporary jazz arranger/composer for combo and big band. On the stage, his dynamic performance abilities were obvious, playing a variety of styles from jazz to Latin to R&amp;B. Christian was also featured on seven college-produced records as a member of the prestigious Humber Studio Jazz ensemble. Now living in Toronto, Christian’s career is gaining such momentum that it’s hard to keep up! He performs in a variety of ensembles regularly including the nine-piece funk band King Sunshine, The Toronto Jazz Orchestra, and most recently, The Art of Jazz Orchestra in addition to various other pit orchestras and jobbing bands. Christian is also the featured composer and musical director for The Composers Collective Big Band, a seventeen-piece ensemble performing high-energy, contemporary works that smash the traditions of the Toronto jazz scene. Christian can also be heard on television, writing material for various productions such as School of Chef and Sun TV’s, King Kaboom.\n\n  </p>\n\n\n\n\n\n", 
    "end_date": null, 
    "title": "The Music Coach Online Trombone Lesson Program", 
    "price": "35.00", 
    "instructors": "Todd Porter, Christian Overton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818838_ebf6_2.jpg", 
    "course_url": "https://www.udemy.com/the-music-coach-online-trombone-lesson-program/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T16:36:07Z"
}