{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t                    There are thousands, maybe even millions, of guitar tutorials and instructional videos out there on the internet. The question is, how can you possibly know where to start, and what direction to go in? Luckily for you, you&#039;ve stumbled upon the answer.  </p>  <p>  \t                    Welcome to <strong style=\"\">The Best Beginner Guitar Course Ever</strong>. It&#039;s exactly what it sounds like! The reason this course is different and better than any other course out there is because I have learned from countless guitar instructors, and I know exactly what <em style=\"\"><strong style=\"\">NOT</strong></em> to do when teaching. When you&#039;re starting out, you not only need to be taught relevant information; you must be entertained and have fun learning it! In this course, you will be taught with only the most pertinent and awesome material, entertained by slick animation, and occasionally amused  by my own ridiculousness. Most guitar lessons are just plain boring. The same old camera angles, with the same old monotone instructors. I guarantee there will be none of that in <strong style=\"\">The Best Beginner Guitar Course Ever</strong>.  </p>  <p>  \t                    I include relevant PDF attachments when necessary, and ensure that there is never a question of what to do next. <strong style=\"\">This course can be completed in under a week if you work for 10 minutes per day</strong>, and you can go back over the playing examples at your leisure to maintain and improve your skills. The course is structured in a way that blends just the right amount of playing and learning so that you&#039;re never overwhelmed.  </p>  <p>  \t                  Most beginners don&#039;t have the time or patience to take a 100 hour super-mega-ultra guitar course. I know I didn&#039;t when I was starting out. This course is tailored to making the absolute best use of your time. Take this course if you want to buy a guitar and learn how to play it. Take this course if you already own a guitar, but when people ask you to play it, you play the same three notes you learned when you got it. Take this course even if you&#039;ve been playing the guitar for a little while, but would like to know if you&#039;re on the right track. Playing the guitar is easier than you think. Take this course because you just found <strong style=\"\">The Best Beginner Guitar Course Ever</strong>.  </p>", 
    "end_date": null, 
    "title": "The Best Beginner Guitar Course Ever", 
    "price": "20.00", 
    "instructors": "Tyler Larson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353224_23a5_3.jpg", 
    "course_url": "https://www.udemy.com/the-best-beginner-guitar-course-ever/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T20:09:32Z"
}