{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t        Where DO scales come from?  </p>  <p style=\"\">  \t        A good question! More importantly, what’s the point of practicing them so much? Easy. It would take decades to build technical proficiency without them. Furthermore, knowing how to construct chords and arpeggios in a specific key would be just shy of impossible.  </p>  <p style=\"\">  \t  Scales provide us with the technical and theoretical know-how to <strong style=\"\">make our ideas musically <em style=\"\">tangible</em> </strong>and are a significant part of the musical language, cut and dry.  </p>  <p style=\"\">  \t  You’re probably here because you want to <strong style=\"\">make yourself a more proficient guitarist and knowledgeable musician</strong>. So, before we get into the creative aspect of scale use, it makes a whole lot of sense to know <em style=\"\">what</em> you’re playing, while you’re playing.  </p>  <p style=\"\">  \t     In this course, you&#039;ll learn, practice and be quizzed on the 7 modes of the major scale, in many positions and keys on the fingerboard. The lectures allow you to learn how the scales are constructed and how you can<strong style=\"\"> apply them to your own compositions and improvisation</strong>.  </p>  <p style=\"\">  \t       There is over an hour of video lectures in this course that you can access over and over again. This information would take weeks, if not months, to consume and memorize in private lessons. <em style=\"\"><strong style=\"\">Learning and Applying Modes to the Guitar</strong> </em>can be used a learning supplement to your private lessons but it&#039;s intended for people who are teaching themselves the guitar.  </p>  <p style=\"\">  \t  For even more information, please visit <a href=\"http://www.thefretbuzz.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">TheFretBuzz</a> or <a href=\"mailto:gregoire@thefretbuzz.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">drop me a line</a>.  </p>", 
    "end_date": null, 
    "title": "The Theory & Practice of Modes on the Guitar", 
    "price": "35.00", 
    "instructors": "Gregoíre Pearce", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/190906_f090_4.jpg", 
    "course_url": "https://www.udemy.com/thefretbuzzmodes/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-29T16:12:18Z"
}