{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>I'm about to reveal an explosive new system that lets you play guitar – music\nyou love, that you've always wanted to play – within just hours from now.</strong><br></p><p>In fact, in the next few minutes you'll see me DESTROY those myths you've\nheard - how hard it is to play guitar, that you need special talent or whatever...\n</p><p>... you'll see me PROVE to you that just about anybody can do it in next to no\ntime... </p><p>And it doesn't matter if right now you don't know one end of the guitar from\nthe other...<br></p><p>... doesn't matter if you can't read music...\n</p><p>... and it doesn't even matter what kind of music you want to play.\n</p><p><strong>By the time we're done here, you could be on the way to being a total rock star</strong>\n– and I PROMISE if you've struggled to play guitar before, what you're about to\nsee will make all the mystery fall away.\n</p><p>You see, there are a lot of people out there who want you to fail spectacularly\n– all those guitar schools, guitar teachers and guitar magazines, the guys\nmaking those tuition DVDs...\n</p><p>... the LAST thing they want is for you to develop any real skill with a guitar –\nbecause that means you won't need to pay them for lessons any more, or buy\ntheir magazines and DVDs. </p><p>And that means revealing my closely guarded secrets like this is going to upset\nsome people, and others will be downright annoyed with me – but let me tell you\nsomething...\n</p><p>I WANT THE BEST FOR YOU.\n</p><p><strong>I care about you learning to play whatever you want to play</strong>. I care about you\nbeing able to impress your friends, about you sitting down at a party and have\neverybody cheering and singing along while you play.\n</p><p>That would feel pretty good, wouldn't it?\n</p><p>That's how it should be. Fun, and frustration-free.\n</p><p>Do you want to know the biggest kept secret about playing guitar?\n</p><p>You do? You sure you're ready?\n</p><p>Well, the truth is, guitar playing is EASY!\n</p><p>It's only hard if you haven't been given all the information or when something\nconfuses you – leaving you unsure of what to do or where to turn.\n</p><p>If you take away that confusion – so you ALWAYS know what to do, where to\nput your fingers, what to play – and you've got something that's easier than\nriding a bike.\n</p><p>Think about that for a second – you probably couldn't ride a bike the first time\nyou tried either, could you?\n</p><p>But you kept at it, and pretty soon you were racing around like a lunatic,\nprobably scaring the crap outta your parents.\n</p><p>And today, you can ride a bike without even thinking about it, can't you?\n</p><p>Learning to play guitar is no different. No matter what you want to play, or\nhow good you want to get.\n</p><p>It's tricky at first – but if you know how it should go, if you're given clear steps\nto follow, you'll have it down in no time.\n</p><p>And that's what I'm here to show you.\n</p><p>What you're looking at here is a proven, easy way to skip the months or years\nof learning and get up to speed in HOURS instead...\n</p><p>... and also get access to a ton of insider's secrets... the things that hotshot pro\nguitar players NEVER usually give away. </p><p><br></p><p><strong>Here's how I know these secrets:</strong><br></p><p>\nI've been a professional guitar player for 15 years. I've toured the world and played in front of thousands of people.</p><p>... and I've personally taught hundreds and hundreds of students these things\non a one to one basis. </p><p>After years of student after student thanking me for unlocking their hidden\nguitar talents with my<strong> S</strong><strong>imple Seven Day System</strong>, I realized I needed to show\nthis to the whole world.\n</p><p>And that's why for the first time ever I'm releasing my Seven Day Guitar\nMethod to the public.\n</p><p>It's called the <strong>Seven Day Guitar Method</strong> because that's exactly what it does –\ntakes just about anybody, regardless of experience, and has them playing real\ngreat guitar within 7 days.\n</p><p>You see, I've broken everything down into the simplest form you can imagine...\n</p><p>... and that's the key, because guitar playing really IS simple – IF you know\nhow to cut all the confusion and get right to the good stuff.\n</p><p>With my help, you'll discover how to play the songs you love and you'll see that\nlearning guitar doesn't have to be complicated and frustrating.\n</p><p>And the fact that the whole course is available as an instant download means\nyou'll get it immediately, today, even if it's 2 o clock in the morning on a\nSunday! </p>", 
    "end_date": null, 
    "title": "The 7 Day Guitar Method", 
    "price": "20.00", 
    "instructors": "Luke Rayner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589900_aeaf_3.jpg", 
    "course_url": "https://www.udemy.com/7-day-guitar-method/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T21:37:43Z"
}