{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong><em>Want the very best guitar lessons on the web?</em></strong></p>\n\n<p><strong>I am an award-winning GIT grad, a 15+ year professional guitarist with 50k+ students, and the founder of Guitargate - the only guitar site sponsored by a major guitar brand, PRS Guitars. </strong><strong></strong></p>\n\n\n\n<p><strong><em>\"This course will teach you how to master your fretboard, understand music theory, and most importantly, how to use these tools to craft your own unique sound.\" </em></strong></p>\n\n\n\n\n\n<p><strong><em>*Watch lecture one (free preview) for a course introduction video</em></strong></p>\n\n\n\n\n\n<p>This course is a four part, interactive, step-by-step, all HD video course which teaches you everything you need to play with complete confidence and control in any genre of music!</p>\n\n\n\n\n\n<p>Professional players don't \"hunt and peck\" or play without a plan. If you're getting paid to do studio work, tour with a working band, or even just play out in you local town, <strong>you need to know your instrument front and back, and know how to sound like you. This course is designed to give you exactly that.</strong></p>\n\n\n\n\n\n<p><strong>Get beyond tabs. Get beyond memorizing note for note. Learn how to improvise and play with ease around the fretboard!</strong></p>\n\n\n\n\n\n<p>No tricks or gimmicks! If you follow the course and work hard, you will feel confident playing in any genre, over any changes, with anyone, anywhere, and be able to put your own personality into the music! It's really not that difficult if you try!</p>\n\n\n\n\n\n<p>For the price of one month of private guitar lessons, you can have unlimited lifetime access to a world class guitar curriculum with <strong>real individual feedback from a professional instructor!</strong></p>\n\n\n\n\n\n<p> Lectures feature all HD videos with multiple camera angles (so you can easily see the neck), downloadable fretboard diagrams, custom jam tracks to play along with, and detailed lesson text. If you post a question or a video link in the discussion forum, I will personally respond with real individual feedback! I try to check it daily.</p>\n\n\n\n\n\n<p>No matter where you are in your playing, this course will fill in the \"gaps\" and break down the neck and music theory in a simple, and most importantly, applicable way. </p>\n\n\n\n\n\n<p>While this course is geared to players with at least 6 months of experience, you will go from the very beginning to playing over complex non-diatonic changes <strong>leaving no stone unturned.  There isn't a more comprehensive course available anywhere.</strong></p>\n\n\n\n\n\n<p>After completing this course, if you wanted, you will have the tools to be a working professional guitarist... Or, you could just be a great guitar player and have a TON of fun.  Either way, I personally GUARANTEE you won't find another course as streamlined, simple, and effective as this one.  I've spent my whole professional life crafting this unique approach to the guitar, and I stand by it 100%. </p>\n\n\n\n\n\n<p><strong>The success I've had with my students has been nothing short of outstanding! Check out these student testimonials:</strong></p>\n\n\n\n\n\n<ul><li>Gerard Bellini - \"I attended Berklee online. Although they hit all the topics, you are the glue that puts it all together. My hat is off to you. Thanks!\"</li><li>Erick Plascencia - Washington, D.C.  - \"I'm amazed at how good your program is. I've learned more in one week than I have ever taught myself in the 10+ years that I've \"played\" the guitar!\"</li><li>Bob Turitz - Eagle, CO  - \"Seriously, I have never learned so much in the past 25 years than I have in the last few months! I love your teaching style!\"</li><li>Graham Baughman - Louisville, KY  - \"Having played for 20+ years, all blues stuff, I am glad to finally learn the neck. Thanks for building a great way to learn! There is no other web site like yours! Thanks!\"</li><li>Jim Ferrie - Shrewsbury, England   - \"I've been playing guitar for 45 years and your lessons and style of teaching is second to none. It is my most important find in my quest to learn guitar! I have never been more motivated to learn!\"</li><li>Chris Reynolds - Hertford, England, UK  - \"I've been self taught for 12 years mostly by tabs and songs. I haven't seen theory explained in a way that makes so much sense, and I've spent many years looking!!\"</li><li>Ryan Endersby - Fredericksburg, VA  - \"I have improved my ability ten fold. I finally feel comfortable on the fretboard and having individual feedback is AMAZING! You will learn your instrument!\"</li><li>JC Senatore - Blacksburg, VA  - \"In 2 months, I've gotten better than I have in the past 2 years. No joke.\"</li><li>Tristan Johnson - Concord, CA  - \"I love the site, and it provides an <strong>excellent</strong> <strong>value</strong>. After a decade of strumming and learning a lick here and there, my playing is blossoming and I'm inspired in a way I don't think I've ever been!\"</li><li>Donnie Eastman - Atlantic City, NJ  - \"I've had lessons for years and never understood theory and modes. In five minutes I felt that “ah-ha\" moment!  Awesome!\"</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Lastly, <strong>I would like this course to be as interactive as possible</strong>, so if you wish to post videos completing lessons, or have a question about any specific lesson, please post the YouTube link or the question in the discussion forum and I will respond to you ASAP.  </p>\n\n\n\n\n\n<p><strong>This is something you won't find on any other course anywhere!</strong> Again, I will try to check the forums daily. I hope to see you inside!</p>\n\n\n\n\n\n<p>And remember, you have a<strong> no questions asked 30 day money back guarantee</strong>. I'm confident you'll see the quality of the course right away, but if you don't love it, that's fine too...just send me a message and tell me how I can improve:)</p>\n\n\n\n\n\n<p>Also, just to make sure you love it, <strong>you can preview the course for 5 minutes without purchasing. So take a look around!  </strong></p>\n\n\n\n\n\n<p><strong>Please Enroll Today!</strong></p>\n\n\n\n\n\n<p><strong>Cheers,</strong></p>\n\n\n\n\n\n<p>Michael Palmisano</p>\n\n\n\n<p><strong>11/15 -- New high-quality downloadable PDF's for ALL LECTURES!</strong><br></p>\n\n\n\n\n\n<p><strong>UPDATE</strong><strong> - 3/20/16 -</strong> <strong>Over 11000 students in just 9 months</strong>!! WOW!  Thank you so much for making this course so popular. I've tried so hard to make a fantastic course, and I'm so glad so many people like it! Please tell your friends!</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The Professional Guitar Masterclass", 
    "price": "50.00", 
    "instructors": "Michael Palmisano", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456284_80ce_9.jpg", 
    "course_url": "https://www.udemy.com/the-professional-guitar-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T23:53:27Z"
}