{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>In this course we'll break down the 20 most critical guitar concepts into 2 sections.</p>\n\n<ul><li>Music Theory</li><li>Guitar Technique</li></ul>\n\n<p>Within these two category's, there are 10 lessons each.<br>We'll call each lesson an \"input.\" The goal is to choose the 20 most important \"inputs\" that give us 80% of our \"output.\" In our case, our output is our direct ability to play guitar and understand music. By focusing on 20 <strong class=\"redactor-inline-converted\">most important </strong>topics, this will allow us to build a solid guitar foundation in the most efficient and effective way possible. Just by joining this course, you will also get access to the discussion forums and additional free video content. So, congratulations to you!<br>You will be able to download my entire 30 Day Practice Schedule, which plans out your practice routine step by step.<br>This course also comes with downloadable Guitar Pro Files, PDF guitar tabs, and .Wav Audio files. It has accessible tools that anyone can use.<br>Here is an example of the topics that will be covered:<br><u>Music Theory</u></p>\n\n<ul><li>Tuning, Metronomes, Correct Practicing Methods</li><li>Musical Alphabet and How it Applies to Guitar</li><li>9 Most Common Chords on Guitar</li><li>Writing Chord Progressions and Using Adjacent frets/Open Strings to Make \"Common\" Chords Not so Common</li><li>Using the 5 Pentatonic Positions to Start Your Way to Guitar Fretboard Mastery</li></ul>\n\n<p><u>Guitar Technique</u></p>\n\n<ul><li>Ergonomics of Guitar</li><li>Strumming Rhythms and How to Create Your Own</li><li>How to Practice Alternate Picking the Right Way</li><li>Bass Note/Alternating Bass Note Strumming</li><li>5th Chords/Power Chords and How to Create Good Sounding Progressions with them</li><ul><br></ul><ul>This is only<strong> half </strong>of the material that will be covered in this course. If you want the best start for your guitar playing journey then join the course, download the materials, and most importantly, have fun!<br></ul></ul>", 
    "end_date": null, 
    "title": "The 80/20 Guitar: Write Music and Play Guitar in 30 Days", 
    "price": 0, 
    "instructors": "Eric Johnson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/807934_b59a_5.jpg", 
    "course_url": "https://www.udemy.com/8020guitar/", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-30T07:16:36Z"
}