{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This is the perfect place to start for beginner trumpet players! Take all the guess work out of how and what to practice. This program comes with specially designed practice videos for each lesson.</p>\n\n<p><strong>Learn To Play The Trumpet Quickly And Easily Using The Music Coach Learning System.</strong></p>\n\n\n\n<p>-Learn the basics of how music works with fun easy to understand animated videos.</p>\n\n\n\n<p>-Use a proven system to take all the guess work out of what to practice.</p>\n\n\n\n<p>-Gain the confidence to play your trumpet with others.</p>\n\n\n\n<p>-Enjoy learning at a pace that is right for you.</p>\n\n\n\n<p><strong>Start Playing And Creating Music To Express Your Musical Self</strong></p>\n\n\n\n<p>You will learn everything you need to know about the trumpet, from how to put it together and make your first sound, to how to play the trumpet in a band! This course also focuses on how to express yourself through music by teaching beginner improvisation (soloing). The goal of The Music Coach Trumpet Program is for you to fully express who you are through the instrument.</p>\n\n\n\n<p><strong>Content and Overview</strong></p>\n\n\n\n<p>I designed this program to help you begin your musical journey on the trumpet in the most efficient and fun way. This program is suitable for anyone who has a desire to play and has a working trumpet. There are over 2.5 hours of video lessons and practice videos.</p>\n\n\n\n<p>The layout of the course uses a simple format:</p>\n\n\n\n<p>-1 lesson video that explains a new concept/technique,</p>\n\n\n\n<p>-1 practice video that has voice overs and graphics to help you play along with the teacher on the screen in \"real time\".</p>\n\n\n\n<p>There are twelve sets of lessons and practice videos that help you learn melody, rhythm, harmony, and improvising. This program also contains a \"Jam Room\" with a virtual band that you can play along with at different speeds. As an added bonus there are also five music theory made easy animated videos that explain the basic building blocks of music.</p>\n\n\n\n<p>At the end of this course you will have the confidence to play the trumpet both on your own and with others in different musical situations.</p><p>The Music Coach Online Trumpet Lesson Program features Steve Dyte as the instructor.  Steve is an amazing trumpet player and educator and is one of the top trumpet players in Toronto. <br></p><p>Steve Dyte hails from the town of Orillia Ontario but has made his home Toronto since 1999 where he came to study jazz trumpet.  After 4yrs at the esteemed Humber College, he came out the other side with a degree in jazz performance and some much needed experience in many different musical situations, from cruise ship show band, to radio and tv appearances and recordings, musicals, casino's and sideman gigs.  Steve has had the pleasure of playing and touring with many great bands and artists such as Toronto's own King Sunshine, Valery Gore, Emma-Lee, KC Roberts, Jully Black, Scott McCord, Down With Webster, Classic Albums Live, Stayin' Alive Bee Gee's Tribute, The Dirty Little Swing Thing and many others.  Steve has also shared the stage with such artists as Jim Cuddy, Glass Tiger, Cowboy Junkies, Steven Page, Keisha Chante and Matt Dusk.<br></p>\n\n<p>    Aside from the trumpet though, Steve plays drums and guitar as well.  He has played regularly since 2007 with The Dirty Little Swing Thing, which is a great party band that covers the 60's to modern day hits from classic rock to swing and soul.  His diversity, musicianship, and work ethic make him one of Toronto’s most in-demand young players today.</p><p><br></p>", 
    "end_date": null, 
    "title": "The Music Coach Online Trumpet Lesson Program", 
    "price": "35.00", 
    "instructors": "Todd Porter, Steve Dyte", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/812610_d479_2.jpg", 
    "course_url": "https://www.udemy.com/the-music-coach-online-trumpet-lesson-program/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-04T17:18:30Z"
}