{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t  Super quick method, with  short videos to learn and practice the keyboard, synthesizer  and contemporary piano.  You will learn the most important techniques that you will need to start  playing in a band, or to play music such as rock, pop, synth-pop, electronica,  etc.  </p>  <p>  \t            In this program you will not have to learn how to read music in order  to be able to play the keyboard well enough to play in a band.  This system is based on chord progressions which progressively teach the ability to improvise in order to play with other musicians or to play and sing at the same time.  </p>  <ul>  \t<li>Teaches you to play keyboards in a modern and contemporary way</li>  \t<li>  \t<p>  \t\t            Focuses on chords progressions and rhythm training  \t</p>  \t</li>  \t<li>  \t<p>  \t\t            Is not overwhelming with millions of unnecessary exercises and concepts  \t</p>  \t</li>  \t<li>  \t<p>  \t\t            Includes short videos with killer exercises that will make you excel in record time  \t</p>  \t</li>  \t<li>  \t<p>  \t\t            No need to learn to read music to play  \t</p>  \t</li>  \t<li>  \t<p>  \t\t            Learn the way you have always wanted! (the cool way!)  \t</p>  \t</li>  \t<li>  \t<p>  \t\t            Innovative shortcut to get you started playing only the stuff that you need  \t</p>  \t</li>  \t<li>  \t<p>  \t\t            Play chords, rhythms and inversions right away  \t</p>  \t</li>  \t<li>  \t<p>  \t\t            Way cheaper than taking private lessons (about the same as 1 private lesson)!  \t</p>  \t</li>  </ul>", 
    "end_date": null, 
    "title": "The Ultimate Method for Learning Modern Piano & Keyboards", 
    "price": "25.00", 
    "instructors": "Jaime Portal, Missy Kennedy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333046_603c_3.jpg", 
    "course_url": "https://www.udemy.com/pianoandsynths/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T22:11:20Z"
}