{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\"><span style=\" color:inherit;\"><strong style=\"\">Do You Find Strumming Your Biggest Frustration?</strong></span></p><p style=\"\">  \t<span style=\" color:inherit;\">Would You Like to <em style=\"\"><strong style=\"\">Eliminate Every Struggle </strong></em>That You Are Faced With When Playing Your Guitar?</span>  </p><p style=\"\">Did You Know 78% of Guitarist&#039;s Say Their Biggest Struggle When Playing The Guitar is <strong style=\"\">Strumming/ Rhythm/ Timing &amp; Chord Transitions</strong>.<br style=\"\"></p><p style=\"\"><span style=\" color:inherit;\">AND... <strong style=\"\">62% of Guitarists</strong> who struggle to reach the next level are unaware that their frustrations simply comes down to one major skill set - Strumming (with Rhythm &amp; Timing).</span></p>  <p style=\"\">  \t  <strong style=\"\">My course is your &quot;<em style=\"\">Life Line</em>&quot; to playing guitar</strong>, and not just mastering the art of strumming but for covering every other skill you need learn in the first TWO years of learning your instrument. </p><p style=\"\">This course is the most <em style=\"\">direct and to the point</em> complete online guitar course for improving all crucial skills while focusing primarily on strumming.  When you learn from each lesson on your strumming skills, starting at Beginner Level, you will<strong style=\"\"> learn other guitar techniques </strong>at the same time in this step-by-step sequence course. And gradually taking you to Intermediate level, and ending the whole course with you at an Advance Level.</p><p style=\"\">To be able to master your strumming, rhythm and timing, and to become Advanced in strumming. You will also need to improve a whole different variety of skills. And this courses teaches you the fundamental skills you need to step up to the Next Level!</p>  <hr style=\"\">When you follow the Videos in the Exact Same Order You Will See a Huge Positive Change in Your Strumming, Chord Transition, and Rhythm &amp; Timing.  <p style=\"\">By a quarter way through you will improve in so many new skills such as <strong style=\"\">chord transitions</strong>.</p><ul style=\"\">  \t<li style=\"\">Over 30 + Lectures/Videos with PDF Attachments</li>  \t<li style=\"\">9 + hours of video guitar tuition</li>  \t<li style=\"\">Keep track of your progress with each lesson.</li>  \t<li style=\"\">The entire course is organised in step-by-step easy to follow layout</li>  \t<li style=\"\">Quizzes to test your NEW knowledge and skills</li><li style=\"\">Jam along lessons where you play along with me &#039;crucial learning skill&#039;</li><li style=\"\">On screen Interactive tablature that moves while you play</li>  </ul>  <p style=\"\">  \t  The more you practice the better you will get. With the <em style=\"\">Right Practice</em> style you will be able to witness fast results and start strumming like a pro in no time!  </p>  <p style=\"\">  \t  <strong style=\"\">Jack&#039;s teaching method</strong> is different than all of the other online teachers. He has made it super easy to be successful at playing guitar. All you have to do is follow the videos in order and put together some good practice habits.  Make sure you attend all the &#039;jam sessions&#039; inside the course and take the lesson quizzes.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">THIS----COURSE-----IS------4-------YOU</strong></p><p style=\"\">You will learn how to become a Strumming Guitar PRO and save hours a week over 44 short videos created by one the most trusted online Guitar teachers today.</p><p style=\"\">If 44 videos sounds like a lot, don&#039;t worry – It whizzes by and when you start seeing the results early on you&#039;ll be itching to take the next lesson every time. And after completing the course you can totally go buffet style to pick and choose exactly what you want.</p><p style=\"\"><strong style=\"\">So this sounds pretty good right?</strong></p><p style=\"\">Then here&#039;s what you need to do to start taking this Strumming course right now:</p><ol style=\"\"> <li style=\"\">Scroll back up to the top and click the “Take This Course&quot; Button</li> <li style=\"\">If you&#039;re already a member of Udemy, this will take you to the payment page - IF YOU&#039;RE NOT, you will be prompted to sign up for Udemy (it&#039;s really good and will never spam you so YOU SHOULD SIGN UP)</li> <li style=\"\">Enter in your credit card or Paypal details and press “Complete Purchase&quot; (then do a little dance because you just made a great decision)</li> <li style=\"\">Udemy will confirm your purchase for $197.00</li> <li style=\"\">You will immediately get access to the course and subsequently learn how to dominate that fret board and gain confidence to play in bands and cool stuff like that.</li> <li style=\"\">Start a band, become famous and don&#039;t forget to mention me in the album sleeve.</li> </ol><p style=\"\">Also.... I will personally respond to any questions you may have as you go through the course so there&#039;s no worry if you&#039;re not sure how to take all of the information, lessons, tab, chords, jam sessions etc and apply it to your guitar skills...</p><p style=\"\">What are you waiting for? Sign up now!</p><p style=\"\">Sincerely,</p><p style=\"\">Jack Long – The &#039;Yoda&#039; To Strumming</p><p style=\"\">P.S. The $197 price is an initial offering to build the students and positive reviews. The content in this course can easily take the average student Two years of 1-on-1 tuition and therefore by taking this course you are saving stacks of time and individual lesson fees. I am planning on raising the price in the near future. If you want to take advantage of the initial price, I&#039;d sign up sooner than later (Like now!)</p>", 
    "end_date": null, 
    "title": "The Complete Guitar Strumming System - Beginner to Advanced", 
    "price": "40.00", 
    "instructors": "Jack Long", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416434_8c3d_4.jpg", 
    "course_url": "https://www.udemy.com/complete-guitar-strummimg-system-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T11:54:19Z"
}