{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Are you beginning the guitar? OR.....</strong></p>\n\n<p><strong>Have you been playing the guitar for a while, but feel that you are \"stuck\"?</strong></p>\n\n\n\n<p><strong>Look no further if you not only want to become a guitar player but also a better musician.</strong></p>\n\n\n\n<p>In my many years of playing guitar and teaching, I have seen beginning guitar players get led astray because of a lack of foundation. People who pick up the guitar sometimes rush toward playing their favorite song or learning a solo with tabs. Although, there is nothing wrong with this, I have often seen that it can lead to discouragement and/or a poor interpretation of music. People end up playing bits and pieces of melodies and can rarely play any song from beginning to end. Or they have a poor sense of rhythm and this makes it hard to play with others. They become <em>closet </em>guitar players because the music only sound right to them. </p>\n\n\n\n<p>Other people learn a bunch of chords to songs and are incapable of playing any melodies. </p>\n\n\n\n<p>This course is here to fix all this. </p>\n\n\n\n<p>Get you off on the right foot by getting a solid foundation in melody. After a short while, you will start to hear the melody within you as you are playing. Just play along with the videos and don't be afraid of starting videos again from the start. </p>\n\n\n\n<p>The lessons are divided by string groups. The first lessons include melodies that can be played using only the first two strings of the guitar! From there, each new section introduces a new string. There are also sections that teach chord strumming, fingerpicking and advanced tuning. </p>\n\n\n\n<p>Here's a breakdown course's sections:</p>\n\n\n\n<ul><li>Download a PDF Tunebook of all the music in the course written in standard and TAB notation. </li><li>Tuning notes</li><li>Melodies using the first two strings of the guitar</li><li>Melodies using the third string</li><li>Melodies using the fourth string</li><li>Melodies with changing positions</li><li>Melodies using the fifth string </li><li>Melodies using the sixth string </li><li>Playing in closed position</li><li>Advanced melodies</li><li>Learn how to strum and play chords </li><li>Scales </li><li>Fingerpicking</li><li>Advanced tuning techniques</li></ul>\n\n\n\n<p>The aim of this course is to get you to play by ear with the help of the video lessons. The format is the same throughout the course. First you will see an example of the melody or exercise you are going to learn. The following video is the lesson that teaches you the melody. This way, once you are learning, you will already have the music in you ears. All you have to do is make your fingers interpret what you are hearing. Then, you can go back to the previous video once your music is up to speed. </p>\n\n\n\n<p>You see, it is possible to have the same mindset of some of the greatest musicians right from the start. All the greatest musicians have one thing in common; they are playing what they are hearing. </p>\n\n\n\n<p>This course will teach you to do exactly that and more! Don't feel that you need tablatures or sheet music in order to play music. Just watch and learn and you will be amazed at what happens in a short period of time. </p>\n\n\n\n<p>See you inside! </p>", 
    "end_date": null, 
    "title": "Total beginner to intermediate guitar - Learn to play by ear", 
    "price": "40.00", 
    "instructors": "Enhance eLearning", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625974_4336.jpg", 
    "course_url": "https://www.udemy.com/beginner-guitar-learn-to-play-by-ear/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T15:42:00Z"
}