{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>COURSE UPDATES:</strong></p>\n\n<ul><li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p><br></p>\n\n\n\n<p><strong>COURSE DESCRIPTION:</strong></p>\n\n\n\n<p>In this lesson, MusicProfessor instructor Kevin Wass guides you through the entirety of three intermediate tuba solos \"Reverie,\" \"Allegro from Concerto Grosso,\" and \"The Jolly Dutchman.\" Learn the important musical, rhythmic and stylistic elements of each piece in various tempos while also learning how to practice and perform. </p>\n\n\n\n<p>If you're looking to improve your tuba skills, MusicProfessor provides the perfect easy, online way to do it! Private lessons cost anywhere from $30 - $100/hr, and as you improve, unfortunately, so does the cost of lessons. Each MusicProfessor Tuba course provides an entire year's worth of instruction, for a fraction of the cost, and at your own convenience. Plus, each course is taught by an industry leading instructor and is backed by Udemy's 30-day, 100% money back guarantee! </p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>COURSE FEATURES:</strong></p>\n\n\n\n<ul><li>20 individual video lessons</li><li>Downloadable sheet music for each lesson</li><li>Master three rewarding, fun Tuba solos</li><li>Extend your abilities with multiple warm-up exercises</li><li>Learn how to troubleshoot difficult fingering passages</li><li>Learn how to improve tongue speed and accuracy </li><li>Review multiple complicated rhythms</li><li>Discuss trouble areas and troubleshooting techniques</li><li>Learn how to break down each piece into manageable practice sections</li><li>Play each etude at various tempos, including a final performance tempo</li></ul>\n\n\n\n<p>MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy's 30-day guarantee. </p>\n\n\n\n<p>Fulfill your musical destiny by enrolling today! </p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>ABOUT THE INSTRUCTOR:</strong></p>\n\n\n\n<p>Kevin Wass, Associate Professor of Tuba and Euphonium at Texas Tech University, holds the Doctor of Musical Arts degree from the University of Michigan, the Bachelor of Science degree (Summa cum laude) in Music Education from Dana College in Blair, Nebraska, and the Master of Music degree and Performers Certificate from Indiana University. </p>\n\n\n\n<p>Dr. Wass has performed with a wide range of ensembles, including the Disneyland All-American College Band, the Music Academy of the West Festival Orchestra, the Omaha, Lincoln, and Honolulu Symphony Orchestras, Santa Fe Pro Musica and various brass chamber groups. Solo appearances have included competitions in the United States, Canada, and the Czech Republic, and recitals and concerto appearances at colleges, universities, and regional and international tuba-euphonium conferences. </p>\n\n\n\n<p>His teaching experience is equally varied, with experience as a band and orchestra director at the elementary and high school levels in addition to private studio and classroom teaching at the college level. In addition to his duties at TexasTech, Dr. Wass has served on the faculty of the Las Vegas Music Festival and currently serves as Principal Tubistof the Lubbock Symphony Orchestra. His principal studies have been with Fritz Kaenzig, Daniel Perantoni, Harvey Phillips, and Craig Fuller. A long-time member of the International Tuba-Euphonium Association (ITEA), Dr. Wass has served on the Board of Directors of the organization as Conferences Coordinator andwas Founding Chair of the ITEA Harvey G. Phillips Awards for Excellence in Composition.<br></p>\n\n\n\n<p>Students of Kevin Wass can be found in teaching and performing positions throughout the United States, including Principal Tuba in the Lyric Opera of Chicago Orchestra and Euphonium in the United States Air Force Band of the Golden West. Graduates from the tuba and euphonium studio at Texas Tech have also been admitted to study at some of the worlds most prestigious institutions, including the Juilliard School, Indiana University, the University of North Texas, and the Royal Northern College of Music (UK). Competition honors for Dr. Wass's students include first place in the ITEC Mock Orchestral Audition and two national finalists in the MTNA Young Artist Brass competition.</p>\n\n\n\n<p>— </p>\n\n\n\n<p><em>This course has been provided by MusicProfessor, an online music education company.</em></p>", 
    "end_date": null, 
    "title": "Tuba Solos: Learn how to Perform Three Fun and Unique Pieces", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/459946_6407_2.jpg", 
    "course_url": "https://www.udemy.com/intermediate-tuba-solos/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-26T18:55:57Z"
}