{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Ukulele 2: Builds on from the Beginning Ukulele. </strong></p><p>In this online ukulele group you will learn to play ukulele so you can feel comfortable when you join a local group or play alone or begin to learn to entertain.  The person taking this course is brave to learn a new instrument or will become brave as they continue to learn. You don't have to sing but play along to music. </p><p>What the course is about. </p><p>Fretboard and Dots, Simple Chord Structure, Simple strum for C chord</p>  <p>Simple songs in Key of C with G7, Strumming examples, Chords of F and Am</p>  <p>Time Signatures, Rhythm, Calypso Strum, Two Chord song list</p>  <p>C G7 and finger placement, Additional chords in the key of C</p>  <p>Stepping patterns for Chord shapes – Make your changing faster. </p>  <p>SkillChecklist, More songs in C, Blues Backing track in C for private use. </p>  <p>Blues structure for Ukulele</p><p>The checklist is so you have something to tick off and know what you have learnt. This is to ensure that when you finish the course you are sure what you have learnt, and feel proud of your achievements. </p><p>The terminology is included as you learn that follows along regular music names such as the Key of a song, chords, notes, lyrics, fretboard, frets, strum names etc. </p><p>The materials included are many pdfs to download which involve songs and chord shapes for your resource folder. </p><p>I wouldn't hurry the course but plod along as you see fit. Don't forget you are learning so 15 minutes a day is easy enough and will ensure your fingers learn well as well as the pathways in your brain. </p><p>The course is structured in video lectures and pdfs attached. There are some websites to look at, these are no cost. The downloads are so you can print them off and keep in a resource folder for you to use when you are not on the internet. These can also be shared for educational purposes. All music is copyrighted to the public domain or the writer. The pdf's are not for sale, they are given for additional educational purposes. If you are looking for a particular song with chords, I can usually source the song, so please ask if you  have a special request. </p><p>Why should you take this course: To learn ukulele and have fun. You will grow in your music literacy. There is a book available on Amazon called Playing the Ukulele by Michelle Daley, if you wish to purchase this in kindle form. This book fits with the first two courses. Good luck and happy playing. Keep on keeping on. </p><p><br></p>", 
    "end_date": null, 
    "title": "Ukulele 2 : Level 1 KEY OF C AND STRUMS", 
    "price": "20.00", 
    "instructors": "Michelle Daley", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532572_8973_2.jpg", 
    "course_url": "https://www.udemy.com/ukulele-2-level-1-key-of-c-and-strums/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-20T00:10:10Z"
}