{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong></strong><strong>Don’t just jump straight into chords and start learning songs</strong><strong>,</strong> if you want really progress on the guitar, then you need to take the same path as the professionals took at a beginner level.</p>  <p>If you are an absolute beginner on guitar then this course is right for you!  Whether you have an <strong>acoustic or electric</strong>, this course covers both instruments.  All you need is a tuned guitar, bags of enthusiasm and get ready to really make a difference in your guitar playing. </p>  <p>We <strong>start with the basics in guitar</strong> like how to hold the guitar, what is the correct posture, I also cover what all the major parts are on the guitar and how to use them (very important). And we look at guitar accessories and how to use them properly too and I cover the basics in music theory which you definitely need to learn at this level.</p>  <p>In the second part of the course you will get started with open chords! You will all the most important basic open chords like E, Em, A, Am, D, Dm, C, G and a bonus chord that you never thought you’d be able to play.... <strong>Very special bonus chord inside this course!</strong></p>  <p>We end the course by focusing on your dexterity, and I take you through a very fun lesson in Music Theory.  I promise you this is NOT boring, and what you will learn in the last part of the course is <strong>guarantee life changing for your overall guitar skills</strong> going forward.</p>  <p>To make a real difference on your guitar, don’t just jump into chords and start playing songs. You’ll soon realise you won’t be improving anytime fast, instead <strong>take the route the professional all took</strong> when they first started out, and I teach you everything you need inside this course that other teachers are not giving away at this level. </p><p><strong>Inside the course:</strong></p><p><strong>Ultimate Beginner Basics:</strong></p><ul><li>Parts of the guitar</li><li>Your posture</li><li>Accessories</li><li>String names</li><li>Notes in the open position</li><li>Tuning by ear</li><li>Four step guitar formula</li></ul><p><strong>Ultimate Chord Lessons:</strong></p><ul><li>E, Em chords</li><li>A, Am chords</li><li>D, Dm chords</li><li>C, G chords</li><li>Special bonus secret chord!</li></ul><p><strong>Ultimate Music Theory</strong></p><ul><li>The best and fun music theory lesson you will ever take</li></ul>", 
    "end_date": null, 
    "title": "Ultimate Beginner Guitar Guide - Both Acoustic & Electric ", 
    "price": "20.00", 
    "instructors": "Jack Long", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/742096_1d4f_3.jpg", 
    "course_url": "https://www.udemy.com/ultimate-beginner-guitar-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T11:49:49Z"
}