{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tWhen most people think of taking piano lessons; teachers, benches, and clunky pianos come to mind. But now that the internet has come of age, your course instructor does not need to be there in person.  Anyone can take piano lessons online whenever they have some free time.  </p>  <p>  \tYou may be thinking &quot;well how can I learn piano on the computer?&quot; The answer is; you can learn to play the piano step by step with this brand new video course that will instruct you in how to play the piano using a computer software program that allows you to follow the keys.  It is a virtual piano experience and anyone from children to adults can learn it.  Follow along at your own pace and you will see that with practice you can learn some nice songs to play your self.  </p>  <p>  \tYou can use a USB piano keyboard  and computer for this course but if you do not have an electric piano keyboard - you can use your computer keyboard. This course is for windows computer users and Mac users as well.  </p>  <p>  \tAre you self-motivated? -  then taking online lessons is a good choice because it puts you in charge of your own schedule. Do you like working at your own pace? If so, you will enjoy learning in a virtual environment. This video course allows you to take your time and learn how you want to learn.  </p>  <p>  \tAll in all, virtual piano lessons are an excellent choice for the adult piano student, and children are so adaptable to learning with computers they will just love these easy and fun lessons..  </p>  <p>  \tWe are offering a discount coupon ..... use the code &quot;summersale&quot; for a discount on the price of this course.  </p>  <p>  \tAlso, If you would like to take your new video course information to the next level.... please message me about taking a live session one on one via webcam.  </p>  <p>  \tI am a independent piano instructor and I can show you how to play the virtual piano live online via webcam in a private session.  <br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Virtual Piano Lessons - A New Way To Learn Piano", 
    "price": "50.00", 
    "instructors": "♥ Minister Kimberly Holmes ♥", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65033_5419_7.jpg", 
    "course_url": "https://www.udemy.com/virtual-piano-lessons-a-new-way-to-learn-piano/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-11T23:41:30Z"
}