{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Always wanted to learn how to play walking bass, but it was too difficult?</strong></p><p><strong>This course is my personal “instant walking bass” recipe. You’ll learn the basic concepts and strategies that will allow you to improvise simple walking bass lines in just a few weeks of practicing. Yes - you will be IMPROVISING on your OWN! Believe it or not. The strategies I’ll be sharing are not that difficult to master and I’m sure you’ll have that eureka moment when you figure them out - just like I had when I was starting. </strong></p><p><strong>Please watch the free preview videos to get a taste for what’s inside.</strong></p><p>This course is shot in full HD video, with quality bass playing audio mixed with the backing tracks. The course is split into five chapters, each adding a new element to our “instant-walking-bass” strategy. This means that each chapter is really doable - you just need a bit of practice. </p><p><strong>This course includes:</strong> </p><ul><li>PDF, Guitar Pro 5 &amp; Guitar Pro 6 tabs for each playing example</li><li>Interactive backing track videos for jamming and practice</li><li>Downloadable backing tracks in mp3 format</li><li>Text transcripts for each lesson</li><li>English subtitles</li><li>Unlimited forum help and instructor feedback</li></ul><p>I want you to know that I would love if you would <strong>post your questions</strong> as you progress through the course. Please feel free to <strong>send me messages</strong> anytime, I’ll be checking them out and responding quickly. Also, I’d like to encourage you to record audio files or videos (you can post videos on Youtube and share the link) and send them to me for <strong>feedback</strong>. </p><p><strong>I’m here to help YOU, so please don’t be shy :)</strong></p><p>This course is meant as an introduction to walking bass. We won’t be going into any complicated theory and walking bass concepts. What you’ll gain are necessary foundations for expanding your knowledge and more importantly - means of cheating your way into walking bass territory. After all, not all of us end up being session musicians or super stars in certain genres. All musicians (even pros), often prefer to take the easy route and learn how to “fake” certain styles. This is what you’ll learn, you’ll learn how to “fake” walking bass type of lines until you are ready for more. I must say, that this can be a lot of fun and a lot of my friends (myself included), never actually feel the need later on to learn specific styles in more depth. </p><p>This course, does not rely on any music theory (at least complicated one). This is a problem of many other walking bass courses as those just dig too deep into music theory that it becomes boring. You’ll just need to have a very basic understanding of how to find certain notes on the fretboard (in basic, most often used positions on the neck). Since walking bass heavly relies on chords, you’ll need to have a basic understanding of chords and root notes, but we cover those topics within the course. </p><p>Please send me your feedback about the course. What did you like? What did you not like? How could I improve it? Your feedback means a lot to me and I need to in order to better shape the course content for YOU. </p><p><strong>Please Enroll Today!</strong> </p><p>Cheers,</p><p>Bogdan</p>", 
    "end_date": null, 
    "title": "Walking Bass - Quick Start Guide", 
    "price": "25.00", 
    "instructors": "Bogdan Radovic", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665278_d865.jpg", 
    "course_url": "https://www.udemy.com/walking-bass-quick-start-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T23:14:46Z"
}