{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Learn the basics of piano before you even go to a teacher.</strong> </p><p style=\"\">       We will teach you good practice habits and easy ways for your kids to do them everyday. In this course we will show that a 4,5, or 6 year old can learn how to do this because a <strong style=\"\">6 year old will be helping to teach it.</strong> </p><p style=\"\"><strong style=\"\">What you learn in this course;</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">Scales</strong> (Scales are the building blocks of almost all our modern songs, in this course we show them their first scale and how to build off of that)</li><li style=\"\"><strong style=\"\">Chords</strong> ( Under every melody we have chords. In this course they will learn to play them and sing along with them.)</li><li style=\"\"><strong style=\"\">Finger Exercises </strong>(We will show them how to do basic exercises that will strengthen their fingers for the upcoming songs)</li><li style=\"\"><strong style=\"\">Simple Songs</strong> ( Everyone plays better with something that they like. We picked four songs that are easy and fun for them to play.)</li></ul><p style=\"\"><strong style=\"\">Who is this course for:</strong></p><p style=\"\">        This course is perfect for anyone who is interested in learning piano. It is ideal for children ages 3-8 but can be beneficial for any age. It can also be a great additional practice for your children even if they are already taking lessons.</p><p style=\"\"><span style=\"\"></span><strong style=\"\">What you will find in this course;</strong></p><p style=\"\">    You will have over one and a half hours of video with instructions and practice sections. We also include downloads of Flash Cards, Songs, and Exercises for you to print out. </p><p style=\"\"><strong style=\"\">Why take this course;</strong></p><p style=\"\">     Everyone learns in different ways and this course covers many different ways to learn. This gives kids the ability to independently practice whenever they want and I have found that they learn much better that way. Most people will pay this much for a single day of classes and this course they can have forever to look over and practice with.</p><p style=\"\">    This will be a great chance for you to save money and your child to get ahead in piano right away. The average cost of a half hour class is $25 so for the cost of just trying out a class you will have the information of 3-9 months.</p>", 
    "end_date": null, 
    "title": "What you can learn before Piano Lessons", 
    "price": "20.00", 
    "instructors": "Micah Blake", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592122_f2d2.jpg", 
    "course_url": "https://www.udemy.com/what-you-can-learn-before-piano-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T18:52:57Z"
}