{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>DecPlay is the World's Fastest Way to Learn Piano, designed for people who want to  experience the joy of playing popular music, without wanting to spend time  learning traditional notation.</p>    <p>The DecPlay range of piano methods are designed for popular  music (although it includes some classical music eg Beethoven), and provide the fastest way to enjoy  the pleasure of playing piano, using a simple 'numbers and colours' system.</p>    <p>DecPlay simplifies complex combinations of notes into  numerical patterns; through the use of our revolutionary song sheets, you will  be able to understand which keys to play within 10 minutes. By combining such  song sheets with video tutorials, learners will be able to play their first  song within one hour - both chords and melody and then as you become more familiar with playing, be able to play the song smoothly by the end of the first day. If you practice a few minutes each day, you should be confident enough to play for your family and friends within 1 week! </p>    <p>The FastPlay course guides you through the 5 skills required to play  your first song on the piano.</p>    <p>You should take this course if you want a fun,  fast and simple way to experience the joy of playing piano. You then have choices to learn more songs from famous artists, or improve your playing style with advanced techniques from the DecPlay range of tuition methods. </p><p>If you wish to learn to read traditional notation, you can directly convert from the DecPlay notation method to traditional notation.</p>    <p>Take this Revolutionary Piano Tutorial  course right now and learn your first song on piano  in 1 hour.</p>", 
    "end_date": null, 
    "title": "World's Fastest Piano Method - The Piano Revolution! ", 
    "price": "50.00", 
    "instructors": "Declan Cosgrove", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40495_fd7a_12.jpg", 
    "course_url": "https://www.udemy.com/decplay-the-fastest-way-to-learn-piano/", 
    "currency": "USD", 
    "subject_name": [
        "Instruments"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-07T13:52:14Z"
}