{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Get the tools you need to analyze, evaluate and recommend specific actions organizations can take to grow their value and avoid common growth pitfalls. Learn to determine how best to build value, whether by scaling existing markets, entering established markets or creating new markets through innovation and acquisitions. Apply these concepts in case studies of industry leaders JetBlue, Starbucks, Intel Corporate Venturing and Tata Motors.\n\n                                            Syllabus\n                        Growth through ScalingStrategic growth is intentional, proactive, and consistent with a company's purpose. Taking advantage of economies of scale--growing a business by doing more of what it's already doing--is a conceptually easy but operationally complex approach to business growth. In this module, you will learn the Scenario Planning tool to identify and evaluate opportunities to scale an organization. With this tool, you'll have an effective means to understand when and where to grow and how to get there. The Starbucks case provides an opportunity for you to practice this tool and apply key concepts.Growth through EntryGrowth through entry--whether by offering new products in existing markets or offering the same products in new markets--doesn't happen in isolation. Multiple firms compete for these markets and so any discussion of growth through entry has to look at the impact of rivalry. In this module, you'll learn how to apply game theory to analyze, assess, and respond to competitors. With the payoff matrices tool, you'll be able to evaluate options and determine an effective position. The JetBlue vs. American Airlines case gives you an opportunity to apply this tool and deepen your understanding of how to identify potential rivals and determine an appropriate response.Growth through AcquisitionMergers and acquisitions (M&amp;A) are common--but rarely successful--ways firms attempt to grow their business. In this module, we'll show you the pros and cons of M&amp;A, suggest valid alternatives, and outline effective M&amp;A strategies. Using the Acquisitions Analysis tool, you'll be able to assess the impact of a potential M&amp;A and avoid common pitfalls of this type of growth. Through an analysis of the Tata Motors case, you'll have a chance to apply this tool to determine an effective growth strategy.Growth through InnovationIntroducing new ideas, processes, and products that disrupt the market is another common growth strategy. In this module, we'll unlock the keys to innovation, from building an innovative capability to appropriating value from innovation to determining an innovation strategy. Using the Real Options Analysis tool, we'll show you how to grow through innovation and good practices for doing so. The Intel Corporate Venturing case provides an opportunity for you to practice this tool and apply course concepts to a real-world scenario.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Business Growth Strategy", 
    "price": 0, 
    "instructors": "Michael Lenox and Jared Harris", 
    "institution_name": [
        "University of Virginia"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/business-growth-strategy", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}