{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Nowadays a distribution strategy is part of the DNA of many companies and a correct channel management is key for the success of your product. Distribution plans need to be prepared for the long run, combining the following main areas:  company profile, portfolio structure and price positioning, go-to-market policy, trade and retail marketing, e-commerce and global retail management. \n\nIn the last decade, there have been two main revolutions that have affected industries, increasing the importance of Distribution Channel Management: \n\n•\tThe IT revolution: considering developments in CRM, supply chain, planning tools, merchandise and reallocation systems, amongst others.\n•\tThe retail focus: a clear retail strategy can be a differentiator for companies and a strong weapon of competitiveness. \n\nStay up-to-date on how companies are adding these aspects to their main strategic guidelines and making them key points in their managerial decision-making process.\n\n                                            Syllabus\n                        Distribution Channel Planning and Management: Why are They so Important?At the end of this module you will know the steps to designing and managing a distribution channel. You will also be able to identify the most important players in distribution channels and their roles.Distribution Channels and Their Evolving LandscapeAt the end of this module you will be able to distinguish the various types of distribution channels and conflicts that arise among them, as well as ways to combat these conflicts. You will also understand the current nature, structure, key players, and future of trade marketing.The Retail Strategy and Marketing MixAt the end of this module you will be able to identify types of retailers, retailing strategies and how these retailers maintain competetive advantages over their competition. You will also be able to see the role the 4 P's of marketing play in these retail strategies.Retailing Without Frontiers: New Trends in RetailingAt the end of this module you will be able to identify various growth opportunities for retailers and determine which entry strategies are best for various circumstances. You will also know the importance of a strategic online presence for retailers and future trends in retailing.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Channel Management and Retailing ", 
    "price": 0, 
    "instructors": "Maria Teresa Aranzabal", 
    "institution_name": [
        "IE Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/channel-management", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}