{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    El objetivo del curso es aprender el proceso para el Desarrollo Rápido de Productos Innovadores para mercados emergentes a través de la aplicación de 3 fases.  Las fases que abordaremos en el curso son:\n\n 1)  Imaginación (Divergencia): a través de esta fase desarrollaremos un pensamiento creativo y crítico por medio de la exploración de una diversidad de opiniones en cuanto a diferentes megatendencias sociales, tecnológicas y de consumo. También utilizaremos una herramienta conocida como “Un día en la vida de …” para identificar áreas de oportunidad para mejorar productos existentes o imaginar como nuevos productos con tecnologías de vanguardia pueden apoyar a la personar en su vida diaria.\n \n2) Conceptualización (Estructuración): esta fase se enfocará en dar disposición y orden a nuestras ideas creativas para el desarrollo de productos innovadores centrados en las necesidades latentes y crecientes del consumidor. Aprenderemos y pondremos en práctica un conjunto de herramientas a continuación mencionadas como: tareas a realizar, expectativas esperadas, matriz de necesidades y satisfactores, perfil del consumidor y etnografía.\n\n3) Diseño (Convergencia): En esta fase trabajaremos en confluir por medio de herramientas tales como la matriz morfológica, el story-board y el desarrollo de prototipos rápidos en una solución, es decir en un nuevo producto y/o servicio innovador, las capacidades de diversas tecnologías para dar vida a aquellas funcionalidades y atributos necesarios y esperados por nuestro consumidor.\n\n Recordemos siempre que la diferencia entre una invención y una innovación no radica del todo en el grado de novedosidad, sino en la aceptación de dicho producto y/o servicio innovador demostrada a través de su adquisición/compra por el consumidor/mercado meta.\n\n                                            Syllabus\n                        Fase 1: Divergencia – Megatendencias SocialesIniciaremos este curso con una fase que hemos denominado Imaginación (Divergencia), a través de la cual desarrollaremos un pensamiento creativo y crítico por medio de la exploración de una diversidad de opiniones en cuanto a diferentes megatendencias sociales, tecnológicas y de consumo. La exploración y análisis de dichas megatendencias nos permitirá identificar potenciales puntos de convergencia de comportamientos humanos individuales y colectivos, así como adelantos tecnológicos, que nos ayuden a identificar necesidades no-servidas o servidas inadecuadamente en el mercado/sociedad que llaman a la innovación incremental de productos y/o servicios existentes o a la creación de nuevos bajo un enfoque de innovación radical. También utilizaremos una herramenta conocida como “Un día en la vida de …” para identificar áreas de oportunidad para mejorar productos existentes o imaginar como nuevos productos con tecnologías de vanguardia pueden apoyar a la personar en su vida diaria.Fase 1: Divergencia - Megatendencias TecnológicasLas megatendencias tecnológicas se relacionan con el llamado technology push, que significa que el conocimiento se traduce en productos y servicios cuyo mercado no se conoce con claridad y que producirá una evolución muy rápida de los productos y servicios originales. Estos productos y servicios paulatinamente cambian el comportamiento humano, fortaleciendo y reforzando la megatendencia tecnológica en cuestión.Fase 1: Divergencia – Un día en la vida\"Un día en la vida de …” es un método de investigación que permite entender mejor la actividades realizadas, los problemas enfrentados y los productos/servicios utilizados por un sujeto en observación.  Revisaremos una técnica específica del método “Un día en la vida de …” para entender mejor los productos/servicios utilizados por una persona durante un día de observación, identificando lo que nos gusta o no nos gusta de un producto o servicio utilizado.  Es importante que se registren la mayor cantidad de información sobre las actividades, problemas y productos/servicios utilizados para  descubrir elementos que pueden mejorarse de un producto. La técnica puede incluir entrevistas dirigidas a los sujetos en observación.  Esta técnica es muy útil para poder realizar estudios de Etnografía.Fase 2: Estructuración - Tareas a realizarse y Expectativas esperadasDurante esta fase analizaremos dos estrategias que te ayudarán a seleccionar y evaluar el producto sobre el cuál propondrás una innovación para tu proyecto. La primera es la metodología de las tareas a realizarse (conocido en inglés como Jobs-To-Be-Done  o JTBD)  con el fin de identificar las oportunidades de innovación en la vida cotidiana. Una tarea por hacer, es un concepto revolucionario que pretende guiar hacia la innovación y ayudar al inventor a ir más allá de simplemente mejorar una solución actual. Dentro de esta metodología conocerás y aplicarás la técnica \"Un día en la vida\". Como segunda estrategia conocerás las expectativas esperadas (conocidas en inglés como Outcome Expectations  u OE), que son una consecuencia directa de los trabajos para innovar de los JTBD, y conducen a eventuales nuevas soluciones que creen más valor y satisfacción para el cliente de los productos o servicios existentes.  Fase 2: Estructuración - Etnografía y Matriz de Necesidades y SatisfactoresDurante este módulo analizaremos la última estrategia que te ayudará a seleccionar y evaluar el producto sobre el cuál propondrás una innovación para tu proyecto. Se trata de la matriz de satisfactores y necesidades. Al conocer esta matriz podemos identificar el tipo de necesidad que un bien determinado ayuda a subsanar, así como, las posibilidades para satisfacer cada necesidad. Además, el material de lectura de este módulo nos ayudará a comprender mejor a su cliente potencial (crear empatía), para así poder diseñar una solución (producto o servicio) más a la medida de las necesidades de su mercado potencial, es decir, lograr un diseño empático.Fase 3: Convergencia - Matriz Morfológica En este módulo utilizaremos la metodología de matriz morfológica para definir las funciones específicas de tu producto con el fin de incorporar la solución tecnológica más adecuada a tu innovación.Fase 3: Convergencia - Storyboards y PrototiposEn este módulo se revisará una técnica que te permitirá visualizar tu producto de una forma diferente e innovadora: el storyboard. Un storyboard o tabla de historia es un conjunto de ilustraciones mostradas en secuencia con el objetivo de servir de guía para entender una historia, pre-visualizar una animación o seguir la estructura de una historia. Además, se revisará otra técnica que te permitirá visualizar tu producto de una forma diferente e innovadora: los prototipos. Los prototipos, por otra parte, te permitirán visualizar y demostrar cómo es el producto y cómo funcionaría en su aplicación real.Entrega FinalEn este módulo finalizaremos el proceso de innovación y podremos visualizar algunos prototipos y votar por los mejores proyectos. Te invitamos a realizar las actividades de la semana para cerrar exitosamente el curso.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Desarrollo rápido de productos innovadores para mercados emergentes", 
    "price": 0, 
    "instructors": "Arturo Molina Gutiérrez, David  Romero Díaz and Pedro Ponce Cruz", 
    "institution_name": [
        "Tecnológico de Monterrey"
    ], 
    "commitment": "5-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/innovacion", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}