{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Dieser Kurs gibt einen Überblick über grundlegende Modelle, Theorien und Prinzipien der Betriebswirtschaftslehre. Er basiert auf einer mehrfach ausgezeichneten Lehrveranstaltung an der RWTH Aachen und wurde bislang von über 10.000 Studenten erfolgreich in Aachen absolviert.\r\nDer Kurs beginnt mit der Frage, warum es Unternehmen gibt und was der Kern unternehmerischer Wertschöpfung ist. Anschließend analysieren wir, welche Alternativen und Theorien es zur Organisation von Unternehmen gibt. Ein Schwerpunkt auf die neue Institutionenökonomie erlaubt dabei einen Einblick in eine der Ansätze, die das moderne Management sehr geprägt haben. Im folgenden Teil gehen wir auf Prinzipien der operativen und der strategischen Planung und Wettbewerbsstrategie ein. Anhand ausgewählter Konzepte lernen wir einige der bekanntesten Ansätze des strategischen Managements kennen.\r\nIn Verbindung mit dem RWTH-MOOC \"Einführung in das Rechnungswesen\" von Prof. Peter Letmathe bietet der Kurs eine ausgezeichnete Einführung in die BWL und gibt Ihnen das notwendige Handlungswissen und Vokabular, um im Studium oder Beruf mitreden zu können – auf Basis eines besseren Verständnisses, was modernes Management ist.\r\nAls besonderes Feature gibt es zu der Veranstaltung ein Planspiel, d.h. Sie können Vorlesungsinhalte in Ihrem Unternehmen spielerisch vertiefen.\r\nWas lerne ich in diesem Kurs?\r\n\r\nSie kennen grundlegende Denkweisen der Betriebswirtschaftslehre.\r\nSie können wesentliche Fachbegriffe ebenso wie grundlegende Konzepte auf aktuelle Fragestellungen übertragen.\r\nSie können einen Bezug zwischen den theoretisch vermittelten Kursinhalten und der unternehmerischen Praxis herzustellen.\r\nSie bekommen eine kritisch-reflektierte Herangehensweise an wirtschaftliche Fragestellungen.\r\nSie bekommen einen Rahmen für weitere vertiefende Vorlesungen im Bereich BWL.\r\n\r\nWelche Vorkenntnisse benötige ich?\r\nDie Teilnahme ist ohne spezielle Vorkenntnisse möglich. Mathematik auf mind. Oberstufenniveau ist für Modul 5 erforderlich, sonst ist die Vorlesung nicht quantitativ.\n\n                                            Syllabus\n                        Modul 1: Grundz¸ge und Funktionen der UnternehmungVideos ab 14. Okt, interaktive Vorlesung am 31. Okt 2014\r\nModul 2: Organisationstheorien: Der Weg zum Taylorismus und dessen ÜberwindungVideos ab 29. Okt, interaktive Vorlesung am 14. Nov 2014\r\nModul 3: Gestaltung der OrganisationsstrukturVideos ab 12. Nov, interaktive Vorlesung am 28. Nov 2014\r\nModul 4: Neue InstitutionenˆkonomikVideos ab 26. Nov, interaktive Vorlesung am 12. Dez 2014\r\nModul 5: Operative PlanungVideos ab 10. Dez, interaktive Vorlesung am 9. Jan 2015\r\nModul 6: Strategische Planung &amp; WettbewerbsstrategieVideos ab 7. Jan, interaktive Vorlesung am 23. Jan 2015\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Einführung in die Betriebswirtschaftslehre", 
    "price": 0, 
    "instructors": "Frank Piller", 
    "institution_name": [
        "RWTH Aachen University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://iversity.org/en/courses/einfuehrung-in-die-betriebswirtschaftslehre-november-2015", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2015-11-14T00:00:00Z"
}