{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso muestra como evaluar proyectos utilizando las metodologías financieras tradicionales de flujos de caja descontados, incorporando en las valorizaciones las consideraciones estratégicas, y haciendo uso de toda la información disponible. Este curso gratuito de cinco semanas está orientado a todos los que hablan español que desean mejorar sus competencias en la toma de decisiones estratégicas en el panorama empresarial, y establecer simultáneamente redes con hispano parlantes alrededor de todo el mundo. Los estudiantes desarrollarán un proyecto trabajando en equipo a distancia y habrá retroalimentación entre los diferentes grupos. Enseña como construir un flujo de caja y como calcular su valor actualizado neto (VAN) y otros indicadores de su rentabilidad. Cubre temas conceptuales como los costos y beneficios pertinentes. También aspectos prácticos como el tratamiento de la depreciación, la estimación del capital de trabajo, y la determinación del horizonte de evaluación y del valor residual. Y cubre asuntos más técnicos como el cálculo de la tasa con la que se deben descontar los flujos o costo del capital. Se explica como incorporar en la evaluación los aspectos estratégicos del proyecto. Enseña como valorizar su ventaja competitiva, y como incorporar las fuerzas que atentan contra la sustentación de las rentabilidades en el tiempo: la imitación, la sustitución y otras. Y explica como valorizar la flexibilidad inherente al proyecto, de ampliarse si se reciben buenas noticias, y de reducirse en caso contrario. El curso muestra también como hacer uso de la información disponible en la industria, en los estados financieros y en los precios de mercado. Respecto a estos precios se explica, por ejemplo, el método de valorización por múltiplos. Este permite definir un rango para el valor del proyecto, directamente a partir de información del mercado financiero, de precios de acciones de empresas comparables, cuando estas empresas existen. El curso resalta las mejores prácticas en la construcción de los flujos de cajas, en la incorporación de la estrategia y en la recolección de la información. Por ejemplo, a la hora de definir un proyecto se recomienda no combinar decisiones separables y no separar proyectos complementarios o competitivos. El curso hace amplio uso de casos para introducir las materias en forma realista y estimulante.\n\n                                    ", 
    "end_date": "2014-05-06T00:00:00Z", 
    "title": "Evaluación de Decisiones Estratégicas", 
    "price": 0, 
    "instructors": "Patricio Del Sol", 
    "institution_name": [
        "Diplomadas Ingenieria Industrial UC"
    ], 
    "commitment": "8 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/decisiones-1-2014", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2014-04-01T00:00:00Z"
}