{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Develop your ability to think strategically, analyze the competitive environment, and recommend firm positioning and value creation. In this course, we will explore the underlying theory and frameworks that provide the foundations of a successful business strategy and provide the tools you need to understand that strategy: SWOT, Competitor, Environmental, Five Forces, and Capabilities Analyses, as well as Strategy Maps. We'll apply these tools in case studies of industry leaders Google, Redhook, Piaggio and Apple.\n\nUVA Darden\n\n                                            Syllabus\n                        Introduction to Strategic AnalysisWelcome to the first module in the Foundations course. In this module, we'll discuss the meaning and importance of business strategy to an organization's competitive positioning. You'll learn about the strategic analysis and the SWOT, competitor, and environmental analysis tools and then apply these tools in the Google case study. Enjoy learning!Analyzing Industry StructureHello and welcome back. In this module, we'll explore how to assess an industry's structure and how the competitive dynamics in an industry affect profitability. We'll go into depth with the five forces tool, a common and highly influential analytical framework. You'll get a chance to apply this tool in the Redhook case study. Enjoy analyzing!Analyzing Firm CapabilitiesWelcome! In this module, we'll examine the tangible and intangible assets that form an organization's strength. We'll show you in depth how to complete a capabilities analysis and how to use this analysis to guide decision making. In the Apple case study you'll get a chance to apply this tool. Happy analyzing!Determining Competitive PositionWelcome to the final module. In these lessons, we'll explore firms' competitive positioning relative to rivals and analyze the advantages and disadvantages of four generic competitive positions firms occupy. We'll use an easy and intuitive tool--strategy maps--to visually communicate information about firm positioning, and discuss which position is best for a particular firm to see maximum value. Then apply what you've learned in the Piaggio case study. Happy analyzing!\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Foundations of Business Strategy", 
    "price": 0, 
    "instructors": "Michael J. Lenox", 
    "institution_name": [
        "University of Virginia"
    ], 
    "commitment": "5-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/foundations-business-strategy", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}