{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*  This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.   Giving With Purpose is offered by the Learning by Giving Foundation with support from Northeastern University.  The goal of this non-credit course is to prepare students to become more purposeful givers and engage more effectively with nonprofit organizations in their communities. Students will learn how to identify high-performing nonprofit organizations and fulfill their personal goals for giving. Six compact classes are comprised of lectures, interactive exercises, group discussions, and interviews with prominent philanthropists Warren Buffett, Doris Buffet, Cal Ripken, Jr., Soledad O’Brien, Ben Cohen and Jerry Greenfield (Ben and Jerry), Tom Werner, and Patrick Dempsey. Students will also be invited to nominate nonprofit organizations in their communities to receive real-dollar grants. A minimum of $100,000 will be distributed to the organizations ranked highest by students using a peer-review selection process based on course concepts.  To receive a certificate of completion, students must complete 1-2 brief exercises per class, participate in discussion sessions, and complete weekly assessments of their peers’ grant nominations. All students are welcome, but not required, to submit grant nominations.  EdX is proud to support to the The Learning by Giving Foundation and to offer the Giving With Purpose course on edx.org. As a not-for-profit, edX is proud to support organizations looking to affect global change.  Note to students: The grant making associated with Giving With Purpose is currently limited to nonprofit organizations in the United States. Throughout the course, the instructor will be referring to charitable giving in the context of the United States’ economy, history, and civil society. However, you will be able to apply many of the principles the course will cover about investing in high performing nonprofit organizations anywhere in the world. Through the course Discussion, you are welcome to share your observations about how charitable giving in your country is different from in the United States.  Before your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\n                                    ", 
    "end_date": "2014-05-21T00:00:00Z", 
    "title": "GWPx: Giving With Purpose: How to get the most out of your charitable giving", 
    "price": 0, 
    "instructors": "Rebecca Riccio", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/giving-purpose-how-get-most-out-lbgx-gwpx", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-04-02T00:00:00Z"
}