{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Las Asociaciones Público Privadas (APPs) se han convertido en un instrumento esencial para el crecimiento productivo, económico y social de los países de América Latina y el Caribe. Al desarrollar e implementar las APPs, se han observado restricciones en las capacidades técnicas en los responsables, particularmente en el sector público.\n\nPara cubrir este vacío, IDBx ha desarrollado este curso, el primer MOOC disponible en español para aprender a planear, diseñar e implementar APPs para proyectos de desarrollo en América Latina y el Caribe.\n\nEste curso busca compartir las experiencias de instituciones internacionales líderes con el fin de ayudar a cerrar brechas de conocimiento en la utilización efectiva de APPs, proporcionando ideas, soluciones y lecciones aprendidas para hacer frente a los retos o restricciones en capacidades técnicas y administrativas en el sector público de la Región. Las lecciones contenidas en el MOOC son aplicables a diferentes sectores como infraestructura, salud, educación, banda ancha, y sector fiscal, y toma en consideración los contextos nacionales de varios países de la región, incluyendo Perú, México, Colombia y Brasil.\n\nPara tal efecto, el curso pone a disposición de los participantes lecturas seleccionadas, videos, casos de análisis y otros recursos de aprendizaje.\n\nEl curso se basa en los contenidos de la Guía de Referencia sobre Asociaciones Público-Privadas (APPs) Versión 2.0., desarrollada y publicada en el 2014 por el BID, el Banco Mundial (WB) y el Banco Asiático de Desarrollo (ADB).\n\nLa preparación de este curso fue financiada por el Programa Especial para el Desarrollo Institucional (SPID) del Banco Interamericano de Desarrollo. Mayor información en la página web del SPID.  \n\nPublic-Private Partnerships (PPPs) have become an essential instrument for productive, economic, and social growth in Latin American countries and the Caribbean. However, when developed and implemented, those responsible for PPPs' implementation have had limited technical capacity, particularly in the public sector.\n\nIn order to address this need, IDB has developed the first MOOC available in Spanish, to learn how to plan, design, and implement PPPs for development projects in Latin America and the Caribbean. \n\nThis course seeks to share the experiences of leading international institutions to contribute to close the knowledge gaps for the effective use of PPPs, providing ideas, solutions, and lessons learned to face the challenges or limitations of technical and administrative capacity in the region's public sector. \n\nThe lessons from this course are applicable to different sectors such as infrastructure, health, education, broad band, fiscal sector, and take into consideration national contexts from various countries in the region, including Perú, México, Colombia and Brasil.\n\nThe course is based on the Public-Private Partnerships (PPPs) Reference Guide Version 2.0, developed and published in 2014 by the IDB, World Bank (WB) and the Asian Development Bank (ADB).\n\nThe preparation of this course was financed by the Special Program for Institutional Development (SPID) of the Inter-American Development Bank. For more information visit the SPID website.  \n\n                                    ", 
    "end_date": "2016-07-19T00:00:00Z", 
    "title": "IDB8x : Asociaciones Público Privadas: Implementando Soluciones en Latinoamérica y el Caribe", 
    "price": 0, 
    "instructors": "Antonio García Zaballos", 
    "institution_name": [
        "IDB ( Inter-American Development Bank )"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/asociaciones-publico-privadas-idbx-idb8x-1", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-14T00:00:00Z"
}