{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    This course focuses on the social, political, economic and institutional environment of countries. This environmental context molds the country’s objectives, defines the country’s strategy, programs and policies for achieving objectives, and significantly impacts companies.\n\nThe context is affected by historical events, and by the country’s leadership. Many stakeholders shape the environment and the institutions, or “rules of the game”, that affect business. Labor, students, farmers, non-governmental organizations (NGOs) and the military play a crucial role, making the analysis of country environments complex and fascinating.\n\nWe will study Japan in some depth, and catch brief glimpses of South Korea, Singapore, Chile, Turkey, India, South Africa and the former Soviet Union, to appreciate the forces that influence diverse country environments, and companies’ strategies.\n\nThe course will review aspects of global institutions, such as the World Trade Organization (WTO), which set global rules that profoundly affect business strategy and human welfare. It will also explore opportunities and challenges at the bottom of the pyramid, the last frontier for value creation by companies and NGOs.\n\n                                    ", 
    "end_date": "2016-03-29T00:00:00Z", 
    "title": "IM110x: International Business Environment and Global Strategy", 
    "price": 0, 
    "instructors": "Dr Sushil Vachani", 
    "institution_name": [
        "Indian Institute of Management Bangalore"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/international-business-environment-iimbx-im110x", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-03-01T00:00:00Z"
}