{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Al finalizar el curso: \n\n•\tExplicarás la aplicación de la norma ISO 9000 y los sistemas de gestión de calidad, su implementación y los beneficios para la compañía y la sociedad.\n•\tDescribirás herramientas prácticas que mejoren la competitividad y eleven la eficiencia de las operaciones de la empresa o idea de negocio teniendo en cuenta las mejores prácticas ambientales.\n\nEn este curso conoceremos la importancia que tiene implementar estándares de calidad y procesos productivos eficientes, para el desarrollo y continuidad de nuestra empresa o idea de negocio y así mantener su máxima capacidad productiva y seguir ofertando productos con los más altos estándares de calidad, para mantenernos siempre en la preferencia del público.\n\nEs importante resaltar también términos como capacidad, ubicación y distribución operativa con la que cuenta nuestra empresa o idea de negocio, porque al identificarlas podemos mejorar la productividad sin hacer a un lado la calidad, a la vez que identificamos las deficiencias la producción para nuestra empresa o idea de negocio.\n\n                                            Syllabus\n                        ProductividadSer más productivos no es ser más eficientes, cuidar los recursos internos de la empresa, maximizar los recursos u minimizar los desperdicios debe ser una prioridad en todo sistema administrativo, lo cual contraerá importantes beneficios económicos y de operación para la empresa, la productividad no puede estar ligada con la calidad en este curso aprenderemos su importancia y como unir estos dos conceptos.CalidadSatisfacer los requerimientos de cliente debe ser una prioridad para cualquier empresa sin embargo desde la óptica de la calidad debemos procurar también que haya una mejora continua en todos los procesos especialmente en aquellos que están relacionados de forma directa con la elaboración del producto o prestación del servicio al cliente.Sistema de Producción Toyota (SPT)Existen varios sistemas de gestión de la calidad, uno de ellos es el Sistema de Producción Toyota (SPT), el cual integra varias herramientas como Kaizen, 5S, Jidoka, Pocayoke, Justo a tiempo, Kanban, etcétera.\n \nPodemos utilizar estas herramientas de forma aislada, pero de manera integral conforman no únicamente un sistema de producción, sino una visión integral de calidad para la organización; el aplicarlas no son la receta mágica para la eficiencia operativa de una empresa pues requieren antes que nada el compromiso de la alta dirección y de todos los trabajadores y todos los niveles. \nNorma ISOEn este módulo aprenderemos qué es la norma ISO y la visión de calidad que emana de la familia de normas ISO 9000. Es importante comprender que este sistema de gestión de la calidad nos ayuda a delimitar los objetivos requerimientos, formas de medición y cursos de acción para asegurar la calidad en los procesos sustantivos y de apoyo en una organización.Administración de operacionesLa ubicación de planta, su distribución interna, la capacidad instalada y el control de inventarios son sólo algunos de los conceptos fundamentales que debemos comprender y aplicar para poder administrar las actividades operativas de la empresa o idea de negocio. \n\nLa operación diaria de la empresa está ligada a estos conceptos. La correcta administración de las operaciones de la empresa es fundamental para la sobrevivencia de la organización; una toma de decisiones respecto a la ubicación de planta, un desajuste en el punto de reorden de inventarios, una mala cuantificación de la capacidad instalada traerán como consecuencia fallas graves en la fabricación o distribución del producto, lo cual resultará en un mal sabor de boca de nuestro clientes.\nResponsabilidad ambientalUn sistema de gestión ambiental no únicamente preserva nuestro entorno, mejora también la productividad de la empresa al minimizar los desperdicios y maximizar los recursos  necesarios para la operación, herramientas como la procuración verde, cero emisiones, 5 R´s, son prácticas que con el pie derecho acerca a tu empresa o idea de negocio con la responsabilidad compartida con el entorno que nos provee, de materias primas e insumos.Business Start-Up: CalidadAhora que hemos terminado el curso de Calidad, debemos aplicar los conocimientos aprendidos en una actividad integradora, en la cuál ubicaremos nuestra empresa o idea de negocio, ponderando los factores más importantes para tomar dicha decisión. También aplicaremos la herramienta de orden y limpieza 5S’s para tener un espacio de trabajo que nos permita ser más eficiente, con mejor clima laboral, libre de riesgos y con un enfoque permanente hacia la calidad. \nPor último, no debemos dejar de lado la responsabilidad ambiental de nuestra empresa o idea de negocio, para lo cual aplicaremos la herramienta 5R’s, que nos generará beneficios no únicamente de tipo ambiental sino también financiero e, incluso, social.\n\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Introducción a la Calidad", 
    "price": 0, 
    "instructors": "Norman Wolf", 
    "institution_name": [
        "Universidad Nacional Autónoma de México"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/gestion-de-productividad", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}