{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Quel est le secret d’une entreprise qui réussit mieux qu’une autre ? Comment faire les bons choix stratégiques ? Ce cours proposera des réponses à ces questions au travers de nombreuses études de cas. Il vous fournira des outils et méthodes d’analyse indispensables pour comprendre les atouts ainsi que l’environnement concurrentiel des entreprises.\n\nIl s’agit d’une approche originale qui s’adresse à chacun, qu’il soit directeur, cadre, entrepreneur, étudiant ou tout simplement désireux de savoir comment prendre des décisions réfléchies et cohérentes tout en poursuivant un objectif à long terme.\n\nCe cours est construit comme un voyage en 6 escales au pays « stratégie ». Tout comme le stratège, le voyageur doit décider, prévoir et planifier son itinéraire en demeurant flexible. Il doit tenir un cap et connaître sa destination, car comme le disait Sénèque : « il n’est pas de vent favorable à qui ne connaît pas son port ».\n\nWhy does one company succeed over another? How do you make the right strategic choices while developing your business? \n\nThis course will provide you with the tools and methods of analysis needed to answer these important questions. Through numerous case studies, you will come to understand both the assets of companies and their competitive environment. This is an original approach, applicable to everyone from students to business executives, but also anyone curious about how to make informed decisions while pursuing well-defined, long-term goals.\n\nThe course takes a multi-faceted approach. As a strategist, you must decide, predict and plan your route while remaining flexible and open to change. You must stay the course and know your destination because, as the philosopher Seneca once said, “If one does not know to which port one is sailing, no wind is favourable.”\n\n                                    ", 
    "end_date": "2017-09-26T00:00:00Z", 
    "title": "Louv10x: Les fondements de la stratégie d’entreprise", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Université catholique de Louvain"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/les-fondements-de-la-strategie-louvainx-louv10x-1", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-09-20T00:00:00Z"
}