{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    When competition from low-cost countries is increasing, many companies choose to invest in services. For companies that are used to only selling physical products this service effort has resulted in a series of challenges. To offer advanced services, a completely different mindset is required than what many companies are accustomed to and to succeed, in many cases, the employees view on how to create value must be changed. The course aims to convey this new mindset, service logic, using a series of practical examples from various industries and sectors and by introducing key theories and concepts.\r\nMaking Sense of Service Logic is an open access graduate course from the Karlstad Business School in conjunction with the Service Research Center – CTF. This course is designed for professionals with an interest in service research and is available to both for-credit (officially admitted students) and non-credit participants (open learners). It features openly available, weekly, interactive video lectures from a variety of CTF researchers, other researchers as well as practitioners.\r\n \r\nThe level of the course content is on advanced university level based on research and delivered by active researchers and centers around open collaborative and networked learning practices. It makes use of freely available social media tools that do not require extensive technical skills to be mastered and implemented.\r\n \r\nWe regard learning as a constructive, collaborative, self-directed and contextual process and believe that using the emerging ideas of networked learning is the way forward for lifelong learning. One major intention in designing the course this way is to develop a community of practice around the course content as well as research at the Service Research Center (CTF).\r\nThe course encourages and nurtures rich interaction through a number of open spaces such as our Twitter hashtag (#mssl151), and our participant blog hub. The open nature of the course and the sharing that it inspires, benefits current and future participants, especially as the goal of the course is to foster and develop long-term, authentic, professional connections.\n\n                                    ", 
    "end_date": "2015-05-18T00:00:00Z", 
    "title": "Making Sense of Service Logic", 
    "price": 0, 
    "instructors": "Maria Åkesson, Nina Löfberg and Jörg Pareigis", 
    "institution_name": [
        "Karlstad University"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://hhk2.kau.se/mssl/", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-03-09T00:00:00Z"
}