{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Useful quantitative models help you to make informed decisions both in situations in which the factors affecting your decision are clear, as well as in situations in which some important factors are not clear at all. In this course, you can learn how to create quantitative models to reflect complex realities, and how to include in your model elements of risk and uncertainty. You’ll also learn the methods for creating predictive models for identifying optimal choices; and how those choices change in response to changes in the model’s assumptions. You’ll also learn the basics of the measurement and management of risk. By the end of this course, you’ll be able to build your own models with your own data, so that you can begin making data-informed decisions. You’ll also be prepared for the next course in the Specialization.\n\n                                            Syllabus\n                        Week 1: Modeling Decisions in Low Uncertainty SettingsThis module is designed to teach you how to analyze settings with low levels of uncertainty, and how to identify the best decisions in these settings. You'll explore the optimization toolkit, learn how to build an algebraic model using an advertising example, convert the algebraic model to a spreadsheet model, work with Solver to discover the best possible decision, and examine an example that introduces a simple representation of risk to the model. By the end of this module, you'll be able to build an optimization model, use Solver to uncover the optimal decision based on your data, and begin to adjust your model to account for simple elements of risk. These skills will give you the power to deal with large models as long as the actual uncertainty in the input values is not too high.Week 2: Risk and Reward: Modeling High Uncertainty SettingsWhat if uncertainty is the key feature of the setting you are trying to model? In this module, you'll learn how to create models for situations with a large number of variables. You'll examine high uncertainty settings, probability distributions, and risk, common scenarios for multiple random variables, how to incorporate risk reduction, how to calculate and interpret correlation values, and how to use scenarios for optimization, including sensitivity analysis and the efficient frontier. By the end of this module, you'll be able to identify and use common models of future uncertainty to build scenarios that help you optimize your business decisions when you have multiple variables and a higher degree of risk. Week 3: Choosing Distributions that Fit Your DataWhen making business decisions, we often look to the past to make predictions for the future. In this module, you'll examine commonly used distributions of random variables to model the future and make predictions. You'll learn how to create meaningful data visualizations in Excel, how to choose the the right distribution for your data, explore the differences between discrete distributions and continuous distributions, and test your choice of model and your hypothesis for goodness of fit. By the end of this module, you'll be able to represent your data using graphs, choose the best distribution model for your data, and test your model and your hypothesis to see if they are the best fit for your data.Week 4: Balancing Risk and Reward Using SimulationThis module is designed to help you use simulations to enabling compare different alternatives when continuous distributions are used to describe uncertainty. Through an in-depth examination of the simulation toolkit, you'll learn how to make decisions in high uncertainty settings where random inputs are described by continuous probability distributions. You'll also learn how to run a simulation model, analyze simulation output, and compare alternative decisions to decide on the most optimal solution.  By the end of this module, you'll be able to make decisions and manage risk using simulation, and more broadly, to make successful business decisions in an increasing complex and rapidly evolving business world.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Modeling Risk and Realities", 
    "price": 0, 
    "instructors": "Senthil Veeraraghavan and Sergei Savin", 
    "institution_name": [
        "University of Pennsylvania", 
        "Wharton School of the University of Pennsylvania"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/wharton-risk-models", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}