{
    "selfpaced": true, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Have you ever wondered about the right methods to improve productivity, configure your supply chain or address the demand on hand?\n\nIn recent years, businesses have strived to improve productivity and quality, reduce costs and delivery times, and embrace flexibility and innovation. These strategies are part of the Operations Management (OM) activities that service and manufacturing organizations engage in. \n\nIntroduction to Operations Management helps you to understand the role of OM in a firm and to develop abilities to structure and solve operations related problems. The course will empower you with skills to address important aspects of business operations including capacity, productivity, quality, and supply chain.\n\nYou will understand how operations in an organization are configured and factors that can potentially drive the complexity of managing such operations. We will also introduce concepts like estimating capacity, identifying bottlenecks, and de-bottlenecking.\n\nThroughout the course, you will join us in discussions on productivity improvement methods, development of quality assurance systems and configuration of supply chains.\n\nThe course will equip you with the right tools, techniques and skills to estimate, compute, analyze and configure key elements of operations management.\n\n                                    ", 
    "end_date": "2015-12-22T00:00:00Z", 
    "title": "OM101.1x: Introduction to Operations Management", 
    "price": 0, 
    "instructors": "B. Mahadevan", 
    "institution_name": [
        "Indian Institute of Management Bangalore"
    ], 
    "commitment": "5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/introduction-operations-management-iimbx-om101-1x-0", 
    "duration": "18 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-08-18T00:00:00Z"
}