{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    In continuing to support the ELD Initiative capacity-building endeavours, a second ELD MOOC is being offered by the Initiative. Building off the 2014 ELD MOOC, which focused on performing cost-benefit analyses to promote sustainable land management, the 2015 ELD MOOC addresses the importance of working with relevant stakeholders to implement sustainable land management choices effectively and sustainably.\r\nThe course introduces approaches to identify options and pathways for action, methods to identify stakeholders, and how to establish a basis for initiating engagement and discussion. At the end of the course, participants will develop their own stakeholder engagement plan. This MOOC will help participants understand how to effectively engage with stakeholders, and address and remove barriers to the successful adoption of sustainable land management. It draws from a range of publications, guidelines, examples, and case studies (inclusive of both successes and failures in order to identify best practices), selected under the guidance of experts of the ELD Initiative.\r\nLearning Goals\r\n\r\nDescribe examples of possible options and pathways for the adoption of sustainable land management;\r\nClarify the objectives of stakeholder engagement;\r\nIdentify the main stakeholders involved in land management;\r\nUndertake a stakeholder analysis;\r\nIdentify most appropriate stakeholder engagement instruments in specific cases;\r\nPrepare material for engagement and discussion with stakeholders;\r\nCritically assess conditions and skills required for successful stakeholder engagement, and;\r\nDevelop a stakeholder engagement plan\r\n\r\nAssignment layout\r\nParticipants are expected to develop a stakeholder engagement plan. The plan should detail which stakeholders will be contacted (who), a timetable for engagement (when), the engagement approach (how), the level of engagement (how much), and also include an analysis of the conditions and skills required for the successful engagement of each stakeholder. The plan should include indicators of successful engagement to facilitate monitoring and evaluation of the plan once implemented. Submitted stakeholder engagement plans will be assessed by a team of teaching professionals and ELD Initiative experts, and is part of the requirement for course certification.\r\nTarget Group\r\nThere are no participant prerequisites beyond interest in the topic. Participants can be located anywhere, work in any sector, and have any background. The previous ELD MOOC brought together decision-makers, managers, supervisors, seniors as well as education and research professionals from international organizations, governments, private sector, NGOs, etc.\n\n                                    ", 
    "end_date": "2015-06-30T00:00:00Z", 
    "title": "Options and pathways for action: Stakeholder Engagement", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://gc21.giz.de/ibt/var/app/wp385P/2389/wp-content/uploads/MOOC1/index.html", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-05-05T00:00:00Z"
}