{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    Gain practical skills for analyzing and improving work processes and for organizing initiatives for continuous improvement of processes. Learn how to plan and execute process improvements with frameworks and techniques from Six Sigma and Lean Management initiatives.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\n                                            Syllabus\n                        Course OverviewIn this module, you will become familiar with the course, your instructor, your classmates, and our learning environment. The orientation also helps you obtain the technical skills required for the course.Module 1: Fundamentals of Continuous ImprovementModule 1 connects process improvement to organizational learning and lays the groundwork for putting together an organizational initiative for continuous improvement. It introduces you to the principles and methodologies of Lean and Six Sigma as two initiatives for continuous improvement of processes. \nModule 2: Managing the Continuous Improvement InitiativeModule 2 presents the organizational infrastructure needed for managing Lean and Six Sigma process improvement initiatives and describes techniques for aligning business strategy with continuous improvement. In this module, you will also learn about value stream maps and project charters as techniques for getting started with process improvement projects.Module 3: Root Cause AnalysisModule 3 focuses on methods to study cause-effect relationships for process improvement. In this module, you will learn about the importance of assessing quality of measurements, followed by ways to synthesize knowledge of team members and methods to analyze numerical data. This module includes an overview of the Standard Normal Distribution, and descriptions of statistical process control, analysis of variance (ANOVA), and multiple linear regression.Module 4: Achieving and Sustaining ImprovementsModule 4 introduces techniques for making and sustaining changes in processes and illustrates the implementation of Lean as a process improvement initiative in a financial services company. As a closing of this course, you will be presented with an overarching theoretical perspective of knowledge creation that explains the continuing cycles of process improvement.Course Conclusion\n                                    ", 
    "end_date": "2016-06-22T00:00:00Z", 
    "title": "Process Improvement", 
    "price": 0, 
    "instructors": "Gopesh Anand", 
    "institution_name": [
        "University of Illinois at Urbana-Champaign"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/process-improvement", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-25T00:00:00Z"
}