{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    How can my company or organization create impact at scale? This is a question increasingly asked by forward-thinking leaders in the social sector. Yet, while there is growing buzz around the need to scale solutions, there are limited frameworks or practical roadmaps to help social enterprises get there. How do you identify your core strengths and build upon them strategically? How do you grow in diverse and hard-to-reach markets? How do you avoid racing forward in an unfocused, and ultimately self-defeating, way? How do you achieve \"good scale\" and steer clear of \"bad scale\"?\r\nEnter the \"Repeatable Model®\". The Repeatable Models® framework has been developed by Bain &amp; Company based on its experience working with high-performing companies across a range of industries and countries for decades. This experience has helped Bain identify what is required for companies to sustain their success over time. In this course, we'll show you how to apply this framework to the social sector to scale your work strategically across villages, regions and countries. Drawing from a report co-authored by Acumen and Bain called \"Growing Prosperity: Developing Repeatable Models® to Scale,\" this course will present practical advice and case studies from the founders and leaders of social ventures like One Acre Fund and Juhudi Kilimo who have successfully implemented Repeatable Models®. By the end of this 2.5 hour course, you'll have completed a diagnostic tool for your own enterprise and developed a plan for how to continuously implement your core services as you expand. You'll walk away with a deep appreciation of the link between simple strategy and sustainable growth.\r\nRepeatable Models and Great Repeatable Models are registered trademarks of Bain &amp; Company, Inc.\n\n                                    ", 
    "end_date": "2015-12-03T00:00:00Z", 
    "title": "Scaling Smart: Developing Repeatable Models® to Grow Your Impact", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "+Acumen", 
        "Bain & Company"
    ], 
    "commitment": "1 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/building-repeatable-models-fall-2015", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2015-11-05T00:00:00Z"
}