{
    "selfpaced": false, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    This course focuses on strategies and techniques for development of sustainable products and manufacturing processes. Using case studies, we will examine strategic decisions and best practices in new product and process development when environmental and resource externalities are accounted for. Environmental sustainability has emerged as the imperative management undertaking for business sustainability in the face of rising global demand for natural resources and environment services and of environmental problems such as climate change. We will examine how regulatory and voluntary requirements for sustainable development affect the ability of a firm to achieve its business and corporate objectives. We will assess how sustainable products and operational practices contribute to the firm’s competitive advantage and operational efficiency and to enabling entrepreneurial opportunities. Students will examine the industrial ecology and life cycle assessment techniques in integrating traditional product and process development requirements with those of the environment and society. The emphasis in this course is on sustainability requirements in management of new product and process development from the perspective of the senior-level executive who is responsible for the firm’s business and operational strategies. Student teams will develop a new sustainable product, or undertake field study projects to gain firsthand experience with sustainability practices in a company.\r\nThe objective of this class is:\r\n\r\nTo develop an awareness of the need for sustainable development and the challenges/opportunities for business sustainability.\r\nTo develop awareness of the evolution of environmental sustainability concepts and associated governmental regulations and business response on a global scale.\r\nTo develop an understanding of the state-of-the-art practices in sustainable product development and manufacturing including industrial ecology, life cycle assessment and modeling techniques.\r\nTo gain an appreciation of the complexities associated with operationalizing sustainability in the framework of traditional business models for assessing return on investment in new products, production and operational initiatives.\r\nTo review the range of general management issues in addressing sustainability and to develop decision-making skills in development of sustainable products for commercial success.\r\n\n\n                                    ", 
    "end_date": "2014-03-17T00:00:00Z", 
    "title": "Sustainable Product Development", 
    "price": 0, 
    "instructors": "Dariush Rafinejad", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/sustainable-product-2014-1", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2014-02-03T00:00:00Z"
}