{
    "selfpaced": true, 
    "topic_name": [
        "Strategic Management"
    ], 
    "description": "\n\n                    \n                    \n                    与之前的“竞争策略”(https://www.coursera.org/learn/competitivestrategyzh)相比，“高阶竞争策略”课程将在讲解新课题和新模块的同时，结合更多实际案例并提供更多与学生互动交流的机会。\n\n在“高阶竞争策略”课程中，我们将研究企业如何通过增加转换成本和推进战略客户锁定来建立和维护客户群。探索企业如何通过寻求适当的价格歧视和产品差异化策略来提高收益。\n\n我们将举例介绍在欧盟竞争政策和美国反垄断政策前提下可接受的行为，并且找到企业通过战略性利用网络效应和规模经济来增加回报的方法。我们会进一步强化新学的有关网络效应的知识，并讨论专门为网络市场定制的策略。\n\n我们还会分析兼并和收购的运作方式，此外，帮助您思考有助于公司有机增长的其他策略。\n\nThis is a Chinese version of Advanced Competitive Strategy. You can find the original course in English from our course catalog.\n【 此版本是Coursera首次尝试推出的中文翻译版。课程视频为英文原版附中文字幕，课程页面和测验已译成中文，帮助中心提供中文支持。此版本仍在测试中，欢迎批评指正。】\n\n                                            Syllabus\n                        维护顾客群 Maintaining your Customer Base本模块中，我们将研究有助于维护客户群的策略。为此，我们将采用分析的方法，以帮助我们了解客户转向竞争对手的点以及竞争对手为获得我们的客户所愿意花费金钱的数量。基于这种了解，我们将得出有助于我们战略性地锁定客户的适用策略。采用该策略时需谨记，客户也可能采取他们自己的策略以避免被锁定，而且我们的竞争对手将寻求使用一些策略来挖走我们的客户。明智地定价 Determine your Prices Wisely我们将价格歧视的好处看作是战略工具，有助于我们分清顾客的购买意愿，并且相应地提高效用。然后，我们会学习将价格歧视策略与成功的产品设计相匹配的不同方法，以及制定价格歧视策略的三种不同方式。保持业务符合竞争规则 Keep Your Business Clean本模块中，我们将介绍如果想要运行一家公司，必须谨记有某些有权利的外部实体（即所谓的竞争委员会）高度重视和保障竞争。如果您的公司是新公司或者相对较小，外部实体会支持您的公司并提供机会，否则，您的公司可能会被更大的在位公司打垮；如果您的公司已经达到一定的规模，您已获得较大的市场势力，他们也可能为您带来危险。 提高收益 Increase your Returns本模块中，我们将讨论两个可以用来提高公司收益的非常重要的新概念：网络效应和企业边界。我们将发现，在制定商业策略时考虑这两个概念有助于我们提高策略效果最终提高收益。 适用于网络市场的策略 Strategies in Network Markets我们将以模块4中的知识为基础，调查网络市场的竞争情况、普及率和临界规模的优势。接下来，我们将学习为何达到临界规模点至关重要。我们还会讨论公司用以提高潜在消费者关注并减少其感知风险的方法。借助合作伙伴实现增长 Achieve Growth with the Help of Partners我们将介绍兼并和收购的趋势、目的和运作流程，区分二者的不同，并调查阻碍该程序的内外部因素。我们还将探索在您已为公司确定了合适的匹配的情况下，促使兼并成功或收购具有价值的突出优势，最后，我们将了解现实世界中并购活动涉及的程序。有机增长 Grow Organically在这个特别附赠的模块中，我们将讨论盈利能力和增长的关系以及小企业面临的限制这两个方面的问题。我们将学习什么是有机增长，公司如何通过保护和建立现有客户群和产品线或者发展新的产品和市场（或者反过来，多样化产品组合）来实现有机增长。我们将说明企业增长面临的内外部限制，最后，我们还将调查企业通过国际化策略来实现增长的可能性。 最终考试 Final Exam \n                                    ", 
    "end_date": "2015-10-27T00:00:00Z", 
    "title": "高阶竞争策略（中文版）", 
    "price": 0, 
    "instructors": "Tobias Kretschmer", 
    "institution_name": [
        "Ludwig-Maximilians-Universität München"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/advanced-competitive-strategy-zh", 
    "duration": "8 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-09-01T00:00:00Z"
}