{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will show you the way... that meditation is a way of life, rather than a course to complete - and then forget about. </p><p>In this 30 day course, we cover Zen and Mindfulness meditation... a practice where you can begin to master your own life on a daily basis through the art of being 100% present in each and every moment. </p><p>It is a practical course where you will be expected to devote time for meditation each day for the next 30 days (most days approximately 30 minutes per day is called for)  - and hopefully beyond. </p><p>Aspects of this course will include practicing being present  and learning to meditate mindfully whilst walking, standing, waiting, eating, sitting and more. It's all about milking each moment out of your life. </p><p>The course also includes guided meditations where you can begin to learn to visualize  during meditation and to connect to your breathing. There will even be a 2 day \"silent retreat\" A digital detox if you will. </p><p>If you are tired of always living a stressed out life and barely existing, then this course is for you.</p><p> Begin to master your life.. You already have the tools you need. They are already within you. I will be there to see that along the way, you will flourish and see and connect to another beautiful, more peaceful centered side of yourself that you may have not seen for a long while.</p><p>Let us begin.</p>", 
    "end_date": null, 
    "title": "30 Day Learn Meditation  Boot-Camp By Jason Stephenson", 
    "price": "25.00", 
    "instructors": "Jason Stephenson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593518_5ab9_3.jpg", 
    "course_url": "https://www.udemy.com/30-day-learn-meditation-boot-camp-by-jason-stephenson/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T00:55:50Z"
}