{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Please check whether my approach suits you. I am taking the examples from Indian ancient scriptures like Veda and Gita and using those parables for better understanding for the who are not only body and mind conscious, but also, \"spirit\" conscious.</p><p>I am non-native speaker and I am from India, please check in my introduction video whether I am able to communicate YOU the way you are expecting.</p><p>I am mentioning the above 2 points, because, this Stress Management should FREE your stress, but, should NOT, ADD additional stress on you.</p><p>Stress Management with 5 Mantras.</p><p>There is no stress ---- BEFORE you and AFTER you, Stress is the parameter for your existence. You are breathing means you have stress in breathing itself. The only difference between ordinary and extra-ordinary people is, how to use the same stress for success. By inculcating 5 changes in your lives, you can make change in your life. Those 5 changes are discussed here as 5 Mantras, and let us see those 5 Mantras for Stress Management.</p><p>Basically, What does \"Mantra\" mean.</p><p>As per Indian ancient language- Sanskrit,</p><p>\"ManTra\" means, It is that which protects.</p><p>I define MANTRA as, it is that with which \"<strong>MAN</strong>\" gets \"<strong>TRA</strong>nsformation\". A word, image, lecture, life experience can also be Mantras, with which Ordinary people transformed themselves as Extra-Ordinary Exemplaries in their lives.</p><p>Is Electrical Power Good or Bad?. The same is applicable for STRESS also.</p><p>We cannot deny the fact that stress has energy, if we need to know how to channelize that power for our success, We have reached from ordinary level to extra-ordinary level.</p>", 
    "end_date": null, 
    "title": "5 Mantras for Stress Management - Indian Vedic Approach", 
    "price": "20.00", 
    "instructors": "Dr Syed Shah", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776166_0f0e.jpg", 
    "course_url": "https://www.udemy.com/5-mantras-for-stress-management-indian-vedic-approach/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T16:35:23Z"
}