{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tWe all know that awful feeling of your chest tightening and your stomach churning, your heart racing as the adrenaline pumps through your body. You’re in a public place and your mind is racing…  </p>  <p>  \tYou’re at a meeting with people you don’t like and you have to participate…  </p>  <p>  \tYou need to remember some crucial information but your thinking is foggy from stress… Or, you’re in an exam and your score will make or break your academic success… You need to perform at your best and you feel crushed by the pressure… Or you have to give a public speaking presentation and your stress and anxiety is rising every second.  </p>  <p>  \t<u>The 7 benefits of the 7 minute classes</u>  </p>  <p>  \t  1. The techniques are EASY &amp; VERY QUICK to learn and beneficial for everyone.  </p>  <p>  \t  2. Classes are only 7 minutes and you can do them anywhere, anytime.  </p>  <p>  \t  3. It’s a new way to physically relax your body, &amp; calm your mind to increase happiness.  </p>  <p>  \t  4. Many of the breaths classes can be done in public – when YOU need them most!  </p>  <p>  \t  5. These NEW techniques gives you the tools to cope with everyday stresses.  </p>  <p>  \t  6. The breaths classes really work – they do what they say, and you will feel instant relief!  </p>  <p>  \t        7. You will feel in control of your body and mind.  </p>  <p>  \t  You will almost instantly feel calm, relaxed and in control of your emotions, and your thinking will become clear and sharp once again. Includes:  </p>  <p>  \t  ● Immediately Fully Guided Video with extra setup tips  </p>  <p>  \t  ● Fully Guided Audio  with extra setup tips  </p>  <p>  \t  ● Guided Audio  that you can put on repeat for a deeper experience  </p>  <p>  \t  ● Printable PDF’s with set up tips and extra information that will help you get the most out  </p>  <p>  \t  of your new skill  </p>  <p>  \tThis technique will very quickly calm your mind and release the physical feelings of anxiety and stress in your body. Using guided visualization and breath based on a square, this is an effective self-soothing method that is very private - no one will be aware you’re doing it!  </p>", 
    "end_date": null, 
    "title": "7 Minute Stress Relief  YOU Can do in PUBLIC & nobody knows", 
    "price": "35.00", 
    "instructors": "Millie Swann", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296832_b6b0_6.jpg", 
    "course_url": "https://www.udemy.com/7-minute-stress-relief-you-can-do-in-public-nobody-knows/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T05:09:33Z"
}