{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Welcome to Anger Management Lessons. This course will help you develop a peaceful and serene disposition.</p><p style=\"\">If you have been searching for online anger management lessons, this course is exactly what you are looking for. Clear practical instructions that will help you get past hurts and frustrations that may be linked with current tendencies towards anger.</p><p style=\"\">This course consists of video lectures and pdf downloads of the transcripts so that you can study the material at your own pace. You can complete all the material in a few hours but it is designed to be studied over the length of a weekend. This material would be ideal for a weekend anger management seminar. </p><p>This online anger management course is divided into seven sections which include: Introduction, understanding the source of anger; the initial steps to defeat anger, eliminating blame, developing a serene mind, action steps and letting go.</p>If you follow these seven simple lectures, you will be on a path towards self-discovery. Anger management is a choice that takes consistent practice. To master any skill, you need to take specific actions and then repeat those actions consistently before you will see results.<p>Anger management lessons do not need to be complicated. Follow the seven lectures in this course and the recommended actions; you will start to see changes in your life towards a more peaceful and less reactionary character. Join those who have already enrolled and are making positive change a reality in their life.</p><br style=\"\">", 
    "end_date": null, 
    "title": "Anger Management Lessons", 
    "price": "20.00", 
    "instructors": "Patrick Doucette", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476110_6d16_2.jpg", 
    "course_url": "https://www.udemy.com/anger-management-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T14:26:33Z"
}