{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>In this course titled</strong> </p><p><strong>Asthma relief and easy breathing ☻ Virtual Hypnotherapy</strong></p><p><strong><em>All Files and videos are downloadable for easier access</em></strong></p><p>Hypnosis can help you to take more control of your asthma and breathing by reducing fear and anxiety attached to having a asthma attack or an expected asthma attack.</p><p><strong><em>Hypnosis does not replace your medication however you may find that you will have less need of your inhaler.</em></strong></p><p>Hypnosis will help to program your mind to relax all of the air passage ways to and in your lungs and by doing this you may find that you will feel more relaxed and be able to breath easier regularly, when you are not in an environment that has substances that usually trigger an asthma attack.</p><p>You may also find that to places and substances that used to trigger an asthma attack may reduce or even disappear. Everyone gains some benefits from using hypnosis in the reduction of asthma attack.</p><p>I have also added in the bonus section lessons in EFT Emotional freedom technique with a section called the breathing exercise again not to be used when you really need your medication but can give mild relief. Again using all these techniques that I will teach you will be subjective as to the benefits you receive.</p><p>I have also include a bonus hypnosis section to help you have a less disturbed sleep as asthma seems to happen more at night time.</p><p><em><strong>What I will teach you in this course</strong></em></p><p><em>1. You will begin by creating an image in your mind of what you want so that you will know where you are going and how you will feel  when you can breath easier and feel more in control of your breathing.</em></p><p><em>2. Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</em></p><p><em>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</em></p><p><em>4. Learn how you naturally resist changes even changes that can be very good for you</em></p><p><em>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</em></p><p><em>6. Learn who can and cannot be hypnotized</em></p><p><em>7. Learn how you can feel amazing any time you want to</em></p><p><em>8. Asthma relief and easy breathing ☻ Virtual Hypnotherapy bonus section</em></p><p><em>Sleep deeply hypnosis </em></p><p><em> How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings that have been stopping you from feeling great and a special exercise called the breathing exercise.</em></p><p><em><strong>All Files and videos are downloadable for easier access</strong></em></p>", 
    "end_date": null, 
    "title": "Asthma relief and easy breathing ☻ Virtual Hypnotherapy", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433968_9446.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-for-asthma-relief/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T11:31:46Z"
}