{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  If you have been suffering from IBS this is the course to help you beat that feeling of helplessness with a easy to learn and apply technique that I will teach and guide you through each exercise so that you will be able to change how you think and feel and become a more relaxed person in all areas of your life. The technique I will be teaching you is called EFT (Emotional Freedom Technique) it is a gentle tapping technique where when you tap on certain points on the body while thinking about a problem you reduce or eliminate the bad feelings attached to that problem. This technique may seem a little silly however the reason you are reading this is because what you have tried before has not worked whether that be medication or therapy. I am so confident you will get results from taking the time to learn and apply this technique that Udemy is offering you a 30 day money back guarantee so there is no risk or cost to you if what I teach you does not work. However as I have been using this technique for so many years with excellent results with my clients that I decided to create this course so I could reach out and help as many people as I can.  </p>  <p>  \t  So what will I teach you  </p>  <ul style=\"\">  \t<li>What is EFT and how to apply it</li>  \t<li>The tapping points and the major organs in your body that you are creating a calming effect on by tapping on these points</li>  \t<li>Proof that the mind and body work together meaning that what you think can create how you feel and feelings can cause thinking in a certain way</li>  \t<li>The breathing exercise to prove to you how you physically feel can be changed by tapping on a few points on the body while focusing on a particular idea</li>  \t<li>Guide you Through a session to beat your anxiety with EFT that can be used as many times as you need</li>  \t<li>Guide you through a mopping up session that will help clear up and stubborn emotional charge on the issue you have been working on</li>  \t<li>Guide you through an advanced tapping technique that tunes both conscious and subconscious mind to work together so that the most stubborn of trapped emotional charge can be released on the issues you have been working on</li>  \t<li>Guide you through a session debriefing so that you can measure all of the results you so much so that you will be shocked to think about the way you used to feel and how easy it was to change all that</li>  \t<li><strong style=\"\">All Videos are downloadable for easier access offline</strong></li>  </ul>", 
    "end_date": null, 
    "title": "Beat IBS and the stress that creates it with tapping therapy", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380266_dc98.jpg", 
    "course_url": "https://www.udemy.com/beat-ibs-and-the-stress-that-creates-it-with-tapping-therapy/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T19:42:41Z"
}