{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      If you have been suffering from anxiety this is the course to help you beat that feeling of helplessness with a easy to learn and apply anxiety management technique that I will teach you.</p><p style=\"\">I will guide  you through each exercise of this anxiety management technique so that you will be able to change how you think and feel and become a more relaxed person eliminating anxiety in all areas of your life. </p><p style=\"\">The technique I will be teaching you is called EFT (Emotional Freedom Technique) it is a gentle tapping technique where when you tap on certain points on the body while thinking about a problem you reduce or eliminate the anxiety  attached to that problem. </p><p style=\"\">This technique may seem a little silly however the reason you are reading this is because what you have tried before has not worked whether that be medication or therapy for management of your anxiety. But  I am so confident you will get results with this anxiety management technique and from taking the time to learn and apply this technique to give you relief from anxiety. </p><p style=\"\">I am happy  that Udemy is offering you a 30 day money back guarantee so there is no risk or cost to you if what I teach you does not help you with your anxiety management.</p>  <p style=\"\">  \t<strong style=\"\">So what will I teach you</strong>  </p>  <ul style=\"\">  \t<li>What is EFT and how to apply it </li>  \t<li>The tapping points and the major organs in your body      that you are creating a calming effect on by tapping on these points</li>  \t<li>Proof that the mind and body work together meaning that      what you think can create how you feel and feelings can cause thinking in      a certain way</li>  \t<li>The breathing exercise to prove to you how you      physically feel can be changed by tapping on a few points on the body while      focusing on a particular idea</li>  \t<li>Guide you Through a session to beat your anxiety with      EFT that can be used as many times as you need</li>  \t<li>Guide you through a mopping up session that will help      clear up and stubborn emotional charge on the issue you have been working      on </li>  \t<li>Guide you through an advanced tapping technique that      tunes both conscious and subconscious mind to work together so that the      most stubborn of trapped emotional charge can be released on the issues      you have been working on </li>  \t<li>Guide you through a session debriefing so that you can      measure all of the results you so much so that you will be shocked to      think about the way you used to feel and how easy it was to change all      that </li>  \t<li><strong style=\"\">All Videos are downloadable for easier access offline</strong></li>  </ul>", 
    "end_date": null, 
    "title": "Beat anxiety with the tapping therapy EFT", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375828_b3c8.jpg", 
    "course_url": "https://www.udemy.com/beat-anxiety-with-the-tapping-therapy-the-healer-within/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T20:50:34Z"
}