{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Join our community of over 1900 students learning to manage stress better!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Umm, I think I  already know how to breathe.</strong>  </p>  <p style=\"\">  \t          Yes, almost certainly. And you also  know that when you are stressed or anxious your breathing changes. These shifts  can feed forward and produce additional symptoms of stress, including  lightheadedness, dizziness, chest pressure, a tendency to increase muscle  tension, and paresthesias (numbness and tingling in the extremities).  </p>  <p style=\"\">  \t          The stress response developed to help  us cope with marauding tigers, but it also switches on when we&#039;re confronted  with an angry boss, screaming kids, or<em style=\"\">that look</em>from our partner. It produces changes  in various parts of our body that we&#039;re not used to controlling directly. It  would be great to have a handle we could use to ramp stress down - something  influenced by stress but over which we also have clear conscious control. That  handle is proper  breathing.  </p>  <p style=\"\">  \t          This course provides instruction in  four-stage breathing, an exercise designed to activate the diaphragm, enhance  awareness of the distinction between diaphragmatic and intercostal breathing,  and provide a strategy you can use to enhance your control over the stress  response. You&#039;ll start out practicing when you&#039;re calm and relaxed, then use it  in gradually more difficult situations, until you can practice in the middle of  that challenging business meeting - and no one will be the wiser.  </p>  <p style=\"\">  \t          You&#039;ll get a series of twelve brief  lectures, plus downloadable PDF text material on diaphragmatic breathing exercises and how to link  your practice to stressful situations.  </p>  <p style=\"\">  \t<strong style=\"\">30 Day Guarantee</strong>: Not sure? You don&#039;t have to be. We have a 30-day complete money back guarantee, no questions asked.  </p>", 
    "end_date": null, 
    "title": "Breathing Made Easy - To Manage Stress and Reduce Anxiety", 
    "price": "20.00", 
    "instructors": "Randy Paterson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23290_f44b_7.jpg", 
    "course_url": "https://www.udemy.com/breathing-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-20T20:05:59Z"
}