{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Learn how to calm anxiety with the power of self hypnosis.</p><p style=\"\">This course will teach you:</p><ul style=\"\"><li style=\"\">What hypnosis is</li><li style=\"\">What self hypnosis is</li><li style=\"\">How you can measure your progress and success</li><li style=\"\">How to prepare for experiencing self hypnosis</li><li style=\"\">Why self hypnosis is useful to help you calm anxiety</li><li style=\"\">How often you should use the self hypnosis track to help you calm anxiety</li><li style=\"\">Powerful, effective non-hypnosis techniques for helping you calm anxiety</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">Included in this course is a brief guided self hypnosis session so that you can find out what entering hypnosis is like for you, it also gives you an opportunity to decide whether Dan Jones approach to hypnosis fits with how you like to be hypnotised.</p><p style=\"\">As well as having a video lecture of the self hypnosis for calming anxiety session, there is also an included downloadable mp3 audio version so that you can listen to the self hypnosis to calm anxiety session more comfortably with headphones on through an mp3 player.</p><p style=\"\">The course is structured to give you an understand of hypnosis and self hypnosis and how you can measure your success and progress before moving on to doing the hypnosis, and giving you additional ideas and techniques you can use to improve help calm anxiety.</p><p style=\"\">The course will take about an hour to complete, but you will be likely to use the self hypnosis mp3 frequently over the coming weeks and months, and you may wish to come back to review and practice the additional techniques regularly until you have mastered them.</p><p style=\"\">This course is for those interested in calming anxiety. It is also useful for newly qualified counsellors, NLP practitioners, stress management consultants and hypnotherapists that want to take additional learning around helping clients with anxiety.</p>", 
    "end_date": null, 
    "title": "Calm Anxiety With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Daniel Jones", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608344_30ae.jpg", 
    "course_url": "https://www.udemy.com/calm-anxiety-with-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T19:25:31Z"
}