{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Why should you do this course?</strong></p><p>How would your relationships evolve if you had the gift of feeling completely relaxed and comfortable when having difficult conversations with other people and making them feel respected and appreciated? Psychology and years of study in Communication have proven that this skill can be learnt!</p><p>How would your life change if you had this skill? What conversations would you start with? With who? This is an opportunity to change every area of your life: personal relationships, family, friends, colleagues, and anyone you interact with each day!</p><p><strong>How does this course work?</strong></p><p>This course will give you the chance to learn a simple 7 steps process that you can use for any difficult conversation, it will also give you chances to practice and give you real life examples.<br></p><p>Through this training, you will be preparing for a difficult discussion you want to have, and you will have the opportunity to put the concepts into practice in your own life.</p><p>All you have to do then is share your learnings and successes, and prepare for the next one!</p><p>What are the 7 steps?<br></p><ol><li>Preparing your problem statement</li><li>Getting into the right state</li><li>Presenting your problem statement</li><li>Asking your critical question</li><li>Listening to the other person</li><li>Agreeing on next steps</li><li>Closing the discussion</li></ol><p>As you can see, this training is not just covering WHAT you need to say, it also covers the HOW: it will help you understand how you can get into the right State in order to deliver the conversations successfully.<br></p><p><strong><br></strong></p><p><strong>WHO should do this training? </strong><br></p><p>In my opinion this should be taught at high school, it is so crucial and so instrumental. Human being are all about connection, and yet so often we don't get to connect because even with the best intent in mind, we don't manage to deliver the right messages.</p><p><br></p><p><strong>Do you have any other question?</strong></p><p>Please let me know and I will be delighted to answer. I have made this training as an act of contribution, this is why the price is so low, I want this course to be affordable so that as many people as possible can benefit from it!</p><p><br></p><p>ENJOY, Greg.</p>", 
    "end_date": null, 
    "title": "Conflict management and crucial communications", 
    "price": "20.00", 
    "instructors": "Greg Henriques", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578332_f018.jpg", 
    "course_url": "https://www.udemy.com/get-comfortable-with-difficult-conversations/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T20:06:12Z"
}