{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t       Claim Your Life will assist you in:  </p>  <ul style=\"\">  \t<li>Developing awareness into your unique list of stressors.</li>  \t<li>Understanding how to you deal with stress now. </li>  \t<li>Recognizing when you are feeling overwhelm, exhaustion, and stress.</li>  \t<li>Building and developing easy-to-use strategies to de-stress your life. </li>  \t<li>Helping you become more mindful for a happier, richer existence.</li>  </ul>  <p style=\"\">  \t  Rejuvenation, relaxation, &quot;you-time&quot; (hobbies), and self-awareness are key components to living a fuller, happier, and richer life.  When we are living in a stressed out and chaotic day running from one activity to another all day, we lose our life energy to be vibrant, creative, happy, and fully engaged in our lives.  We begin to live by a &quot;to-do list&quot; and it takes over our lives, relationships, causes health problems, may cause depression and anxiety, and can even affect your career and family life.  Our emotional resiliency is low and stress takes away our happiness.  We can learn to take care of ourselves, prioritize, and live fully in the present moment.  My program will help align you to your best version of &quot;you&quot; by developing an ongoing practice of mindfulness, serenity, and problem-solving techniques so you are better able to deal effectively with stress when it does arise in your daily life.  You will be better equipped with a De-Stress Toolkit that will help you apply quick solutions to stressful situations and proactively reduce stress in your daily life.  Claim Your Life back and live fully.  </p>", 
    "end_date": null, 
    "title": "De-Stress, Rejuvenate, and Be Happy", 
    "price": "20.00", 
    "instructors": "Anne Vidovich-O'Shea, M.A.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425310_ecfa_4.jpg", 
    "course_url": "https://www.udemy.com/de-stress-rejuvenate-and-be-happy/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T21:04:02Z"
}