{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The course on <strong style=\"\">Developing Effective Work Relations and Time Management</strong> is a composite course requested by students. And, it includes two already successful courses: Getting Results by Building Relationships and Developing Effective Time Management Habits.</p><p><strong style=\"\">Getting Results by Building Relationships</strong></p><p>Have you ever been frustrated by your work relationships? Do you find it hard to integrate in a new job? Do you need to build or maintain a professional credibility? Do you want to be part of a professional family?<br style=\"\"></p><p>Here you will find an answer. Getting Results by Building Relationships is a very focused and extremely practical course, for the use of business and industry professionals.</p><p>In this section, you'll learn how to build good relationships and achieve results by:</p><ol style=\"\"><li>laying a strong and effective collaborative foundation</li><li>building professional credibility, and</li><li>developing ethical reciprocity patterns.</li></ol><p>You are going to learn how to make a good first impression, build an effective and lucrative rapport with your co-workers, win confidence and and deal with conflicts to get results.</p><p>The video lectures and documents that form the course include practical examples and tolls for getting results by building relationships.</p><p>In not more than 2 hours of study you will master 9 techniques that will boost your career and, and maybe more important, make your life easier.</p><p><strong style=\"\">Developing Effective Time Management Habits</strong></p><p>Do you want to work smarter and have more time for yourself? Do you want to consistently achieve good results and reach your objectives? Do you want to spend more time with your family and friends?</p><p><em style=\"\">Stop wasting your time!</em></p><p>Change your work habits! It's easy and you can learn here how. You just need to acquire or develop good habits in three areas: work environment, technology and “time-stealers.\"</p><p>You will learn how to control your work environment, how to use technology to help you be more efficient, how to respond to unreasonable demands of others, how to prevent procrastination and avoid “time-stealers\".</p><p>You will learn how to develop the habits that you need to be in control of your time, and stop reacting inefficiently to demands that are made on you. And, you will learn how to organize your work environment, and how to employ technology so that it is serving you and not waste your time.</p><p>You will also understand \"time stealers\", and develop strategies to prevent the waste of time they represent. Good time management habits don't happen by accident. Learn, practice and be consistent. You will get here the exact techniques to do so.</p><p>You will have video lectures that include real examples, exercises and case studies; quizzes to check your knowledge level and a small optional course project to help you practice your time management skills.</p><p>You have a 30 days money back guarantee, no question asked. And, the discounted access to many other management and personal development courses.</p><p><em style=\"\">Apply now!</em></p><p>Now, go ahead. Apply for the course! Just hit the “Take this course\" button, or if you want to find out more take the free preview and then decide.</p><p><em style=\"\">Thank you! And, see you inside the course!</em></p>", 
    "end_date": null, 
    "title": "Developing Effective Work Relations and Time Management", 
    "price": "40.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607072_2976_4.jpg", 
    "course_url": "https://www.udemy.com/developing-effective-work-relations-and-time-management/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T16:34:02Z"
}