{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tEl estrés y la tensión hoy en día afectan a muchas personas, disminuyendo su calidad de vida. De hecho, dicen que el estrés y sus derivados son la enfermedad que a más personas afecta, y afectará, en el siglo XXI. El estrés deteriora, enferma, reduce la calidad de vida de las personas. Relajarse es una necesidad vital para la mayoría de personas, pero el problema es que no saben cómo hacerlo.  </p>  <p style=\"\">  \tA todo el mundo le gustaría estar más relajado, pero todos asocian la relajación con estar de vacaciones en algún lugar paradisíaco, o con pasarse el fin de semana tumbado en una hamaca bebiendo mojitos. Nos pasamos casi todo el año estresados, tensos y deseando que lleguen esos escasos días de vacaciones anuales, para, irónicamente, volver más estresados que antes.  </p>  <p style=\"\">  \tAprender a relajarse es como aprender un oficio, un deporte o un arte; requiere de técnica, de esfuerzo y de continuidad. Es mejor relajarse unos minutos cada día, que no esperar a relajarnos únicamente el fin de semana o en vacaciones.  </p>  <p style=\"\">  \tEn este curso aprenderemos las técnicas básicas para aprender a relajarnos en nuestra propia casa, de forma sencilla y asequible. Partiendo desde cero, y utilizando técnicas de relajación, de yoga y de otras disciplinas afines, nos iremos introduciendo en el arte de la relajación; arte que poco a poco y con la práctica, iremos desarrollando.  </p>  <p style=\"\">  \t- Lo primero que aprenderemos será a soltar el cuerpo y liberarlo de tensiones, mediante unos sencillos ejercicios físicos.  </p>  <p style=\"\">  \t- Después aprenderemos a respirar correctamente, dando especial importancia a la respiración abdominal.  </p>  <p style=\"\">  \t- Por último aprenderemos técnicas específicas de relajación, tales como la fase de Jacobson, la fase de Schultz, visualizaciones de paisajes relajantes, autosugestión y técnicas de relajación profunda.  </p>  <p style=\"\">  \tUna vez aprendida la técnica sólo nos faltará una cosa: practicar, practicar y practicar.  </p>  <p style=\"\">  \tAnímate y apúntate al curso, tu cuerpo y tu mente te lo agradecerán.  </p>  <p style=\"\">  \t¡Te espero!  </p>", 
    "end_date": null, 
    "title": "El arte de la relajación", 
    "price": 0, 
    "instructors": "Aimar Rollán", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184337_73a6_2.jpg", 
    "course_url": "https://www.udemy.com/el-arte-de-la-relajacion/", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-18T00:26:54Z"
}