{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    This course takes a deeper dive into some of the main concepts presented in my book: “ If I can Just Focus – 5 Keys to Sanity &amp; Success\" Book.<br></p>\n\n<ol><li>Ever wondered how to build stability in your career growth and development through focus?</li><li>How can you match your passions and your current daily schedule if you have a lot going on?</li><li>If you're thinking : \"Hey I feel kind of lost in my growth and development. I feeli I'm losing my fire for what I'm doing right now, but even worse, I don't know how to do a makeover or career switch\", then this course is for you.</li><li>The course will help you deal with issues you may have with focus on the most important things in your relationships and work.<br>If you feel you have too much going on personally, professionally and are really on the edge this course provides clarity and that light at the end of the tunnel for you. People try to do more with less but still find \nprioritizing and better time management not really working.</li><li>My course also provides various media formats for learning including audio downloads you can use while exercising, commuting or on the go.<br><br>The course is built around research, discussions, consulting and training sessions over the past 7 years, know-how that has been applied across a wide range of personal and professional backgrounds with great results.<br>The course structure matches any schedule for application on the go, with the entire course taking about one hour to complete.<br>To provide a richer learning experience and save you time, I have provided hand-outs for the video lectures, and practice modules can be found at the end of some lectures as with 'do it now' audio exercises. So, if you are by nature a driver for action, have a good enough grasp of the principles and are somebody who just likes to get stuff done, just complete the section's do it now audio exercises. You will also find think about it audios explaining the theory and recommendations in more detail. <br><br>END OF COURSE EXERCISE AND WEEKLY GOALS WORKSHEET:<br><strong>Please download and print out the Fixing Your Life Focus Goals Sheet</strong> at the end of this final lecture.\nIt\n will help you to keep weekly track of how well you are doing with \nfocusing on your life goals and important goals!!! You can put it in a \nprominent place you visit a lot like your refrigerator or other place. \nIt will help you stay accountable and measure your progress.<br><br>Please feel free to send in any questions,comments or suggestions. Ubong Ekpo.  </li></ol>", 
    "end_date": null, 
    "title": "Fix Your Focus & Reach Your Life Goals", 
    "price": "20.00", 
    "instructors": "Ubong Ekpo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/283178_1441_5.jpg", 
    "course_url": "https://www.udemy.com/keys-to-fixing-your-life-focus/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-18T16:27:54Z"
}