{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tAprende a gestionar el estrés y la ansiedad es un <strong style=\"\">curso 100% práctico</strong>, que te va a permitir aprender a gestionar el estrés y la ansiedad en el plazo de 4 semanas.  </p>  <p>  \tHola, soy J<strong style=\"\">avier Romero</strong>, psicólogo del equipo de <strong style=\"\">WebPsicólogos</strong>. Desde hace <strong style=\"\">más de 10 años estoy ayudando a muchas personas a superar el estrés y la ansiedad</strong> y he decidido compartir las técnicas que utilizo a través de este curso.  </p>  <p>  \t<strong style=\"\">OBJETIVO:</strong>  </p>  <p>  \tAprender a gestionar el estrés y la ansiedad  </p>  <p>  \t<strong style=\"\">QUE NECESITAS</strong>  </p>  <ul style=\"\">  \t<li><span>Ganas de solucionar tus problemas</span></li>  \t<li><span>Ganas de trabajar y esforzarte, realizar los ejercicios que propongo y entrenar duro</span></li>  </ul>  <p>  \t<strong style=\"\">QUE VAS A APRENDER</strong>  </p>  <p>  \tEl curso se divide en tres módulos:  </p>  <ul style=\"\">  \t<li><span><strong style=\"\">Que es el estrés y la ansiedad</strong></span></li>  </ul>  <p>  \tDonde vamos a aprender que son estos dos conceptos, cómo nos afectan y en que se diferencian.  </p>  <ul style=\"\">  \t<li><strong style=\"\">Herramientas conductuales</strong></li>  </ul>  <p>  \tAqui voy a enseñarte respuestas incompatibles con la ansiedad y que puedes aplicar a tu día a día para conseguir reducri el malestar.  </p>  <ul style=\"\">  \t<li><strong style=\"\">Herramientas cognitivas</strong></li>  </ul>  <p>  \t<span>En el terer módulo voy a ense</span><span>ñarte a analizar tus pensamientos, descubrir los que te hacen daño y estrategias para aprender a &quot;pensar de otra manera&quot; para evitar el malestar que produce el estrés y la ansiedad.</span>  </p>  <p>  \tPara realizar el curso correctamente necesitas por lo menos 5 semanas para prácticar todos los ejercicios y ser disciplinado para aprender una nueva manera de actuar y pensar que te lleve a evitar los problemas generados por el estrés y la ansiedad.  </p>  <p>  \tEste curso <strong style=\"\">no es una varita mágica </strong>ni va a solucionar tus problemas solo porque veas unos cuantos videos. Lo que te ofrezco es u<strong style=\"\">na guia de trabajo personal,</strong> basada en la <strong style=\"\">psicología científica</strong> y que <strong style=\"\">ha ayudado a miles de personas</strong> a superar sus problemas.  </p>", 
    "end_date": null, 
    "title": "herramientas gestión de estrés y ansiedad", 
    "price": "35.00", 
    "instructors": "javier romero", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287458_df31_2.jpg", 
    "course_url": "https://www.udemy.com/gestion-de-estres-y-ansiedad/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-25T15:01:42Z"
}