{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                 Almost all of us work in a business environment that is <strong>constantly changing</strong>, is <strong>intense </strong>and is <strong>unrelenting</strong>.  </p>  <p>  \t                 Your <strong>resilience</strong> refers to your <strong>ability to cope</strong> and <strong>adapt to crises</strong> or stressful situations.  <strong>Emotional resilience </strong>refers to how you <strong>use your emotions</strong> to develop <strong>your capability</strong> to manage your resilience.  </p>  <p>  \t                 More resilient managers are able to <strong>accept life changes</strong> and <strong>adapt to adversity</strong> without lasting difficulties, while less resilient managers have a much harder time with stress and change.  </p>  <p>  \t                 <strong>Emotions</strong> are not about being soft and fluffy, they are vital in help you to make <strong>hard, direct management decisions</strong>.  Emotional resilience can mean <strong>managing the emotions </strong>that you yourself experience or managing the emotions of those around you.  Good <strong>emotional resilience</strong> enables you to <strong>increase productivity</strong>, <strong>improve morale</strong>, <strong>reduce absenteeism</strong>, <strong>retain</strong> your best <strong>people</strong> and <strong>improve team relations</strong>.  </p>  <p>  \t                 In this course, we will explore <strong>the role of emotions in management</strong>, how and why they contain <strong>vital bits of information</strong> that can help you make <strong>better decisions</strong>.  You'll receive all the information you need.  You will be <strong>coached</strong> using <strong>loads of practical hints</strong> that you can use straight away.  </p>  <p>  \t                 The course is made up of a series of lectures and contains a comprehensive workbook. There are a series of interactive exercises that involve some activity with other people and some reflection.  </p>  <p>  \t   The course material makes up a one to two day workshop so is equivalent to 8 -12 hour's training. </p><p>Please note that all programmes are continually refined and updated to ensure they remain current and relevant.</p>", 
    "end_date": null, 
    "title": "How to Develop Emotional Resilience to Manage Stress", 
    "price": "50.00", 
    "instructors": "Robin Hills", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/172336_6e85_5.jpg", 
    "course_url": "https://www.udemy.com/emotional-resilience/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-24T21:13:00Z"
}