{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    Is your mind so FULL of thoughts you find it hard to be MINDFUL, focused and calm?  </p>  <p>  \t    Do you find yourself getting caught up in thoughts of the past, the future, or what-if-ing?  </p>  <p>  \t    Do you find it hard to release stress and anxiety and keep you attention focused on what you are doing?  </p>  <p>  \t    If you said &#039;yes&#039; to any of these questions then you are in the right place.  </p>  <p>  \t    This psychology course is about what to do when you find it difficult to relax for long enough, or deeply enough, for both body and mind to gain any real benefit.  </p>  <p>  \t    Each section has been carefully crafted to help you let go of stress and tension and then connect with a deep level of relaxation, mindful awareness and inner stillness.  </p>  <p>  \t    If you would like some help to relax more deeply, connect more easily with feelings of inner peace, or simply shield yourself from some of the stresses and strains of the day then this course is for you.  </p>  <p>  \t    Each part is designed to flow and follow on from the next, gently guiding you to build on your skills as you work through the materials.  </p>  <p>  \tFor maximum effect I recommend that you download the mp3 guided meditations and listen often.  </p>  <p>  \t    This beautiful course has helped over 900 people just like you to find their inner calm.  Ready to find yours? Join now, and we’ll get started straight away.  </p>  <p>  \t    See you on the course,  </p>  <p>  \t    Anne  </p>", 
    "end_date": null, 
    "title": "How to Calm Your  Mind - The Art of Mindful Relaxation", 
    "price": "20.00", 
    "instructors": "Anne Marshall", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27079_8640_10.jpg", 
    "course_url": "https://www.udemy.com/howtorelax/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-18T10:29:21Z"
}