{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Have you ever felt practically paralyzed by fear, nervousness or anxiety? </strong>Perhaps it wasn&#039;t that extreme but you know that you could have done better in a specific situation if you could only calm your nerves and relax more.</p><p style=\"\"> Nearly everyone has had situations that cause what most people refer to as fear and anxiety. Many people have ongoing experiences with anxiety that prevent them from excelling in what is important to them. Students, first responders, business people, teachers, presenters, sales people, and more all experience anxiety or fear. </p><p style=\"\">If you want to change behaviors like freezing under pressure, being unable to sleep because of anxiety, avoidance or procrastination because you feel like your life is dominated by fear or anxiety, then you really need the changes you will experience in this training. </p><p style=\"\">When you enroll in this course, here is what you will learn and experience: </p><ul style=\"\"><li style=\"\">You&#039;re going to learn how to distinguish the difference between fear and anxiety. </li><li style=\"\">You will understand how the fight-or-flight response works and how to avoid triggering it.</li><li style=\"\">You will learn how to logically break down your beliefs about a specific fear or anxiety and examine it objectively (often just doing this greatly diminishes fearfulness if it doesn&#039;t completely eradicate it!). </li><li style=\"\">You will use practical exercises accompanied by brainwave frequency audio programs designed to help your brain resonate within specific frequency ranges associated with empowering states</li><li style=\"\">You will apply the powerful NLP technique of submodality changes to fear and anxiety management. </li><li style=\"\">You will learn an empowering “Heartbreath&quot; breathing pattern.</li><li style=\"\">You will learn how to enter peripheral vision and use this technique to manage negative self-talk.</li></ul><p style=\"\">This training program will empower you to succeed professionally and personally through its simple, yet profound techniques you can use to master your internal state.</p>", 
    "end_date": null, 
    "title": "How to Manage Fear and Anxiety Using NLP and Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Michael Emery", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490590_faef_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-manage-fear-and-anxiety-using-nlp-and-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T18:14:15Z"
}