{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Is anxiety running you all day long? Is anxiety the only state you know and can be, but always wish to get out? </p><p>However, when there is a chance to to be calm, you pick on something to get stressed?</p><p>Are you addicted to any substances, or craving and missing things?</p><p>Did you have it as you are sick of living in this stress?<br>Are you ready to change this and have a different experience to learn to live with deep inner peace and joy. </p><p>I was one of you on this journey 20+ years ago. And Let me share with you all my knowledge and experience and practice here, which is scientific, yet simple and easy.</p><p>All what you need now is to believe that you deserve to have this change in your life.</p><p>If yes you are ready to begin. </p><p>In this course we will explore together:</p><p>What is stress, and why are we reacting with negative stress?</p>\n\n<p>How to get of reacting with negative stress?\n\n  </p>\n\n<p>How to transform negative stressors to empowerment?\n\n  </p>\n\n<p>How to get stress management automatic into your daily life – meditation as daily practice to rewire the mind\n\n  </p>\n\n<p>How does the long term journey of re-training the mind looks like in daily life.</p><p>You will have exercises to do at the end of each video which is the core of the progress you will gain from this course.</p><p>Let us learn together for your better, happier life which begins right here, right now..</p><p>Welcome you on this wonderful journey... with love and kindness.</p>", 
    "end_date": null, 
    "title": "How to get over stress forever", 
    "price": "45.00", 
    "instructors": "Dr Zsuzsanna Fajcsak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841208_238e.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-over-stress-forever-by-drzsu/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-06T11:19:01Z"
}