{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Anger is a misunderstood emotion!</strong> It is widely assessed to be a destructive emotion with violent tendencies. The invitation in this course is to explore the emotion of anger and notice the energy of it. What possibilities for action exist within the energy of the emotion of anger?</p><p>When you <strong>learn to harness the power of anger</strong>, you can <strong>CHOOSE </strong>how to show up in conversations and <strong>CHOOSE </strong>what actions to take to create outcomes and results that have meaning, value and satisfaction for you!</p><p>Use the generative power of language and learn to <strong>“manage anger” by understanding the story, the body disposition and actions you can take to “step into” and “step out of” anger.</strong></p><ul><li>Understand the foundation of anger as a story with a predisposition to action.</li><li>Learn what it means to “be emotional” versus “having emotions”</li><li>Discover the patterns that set up the path on the “ladder of anger”</li><li>Learn how you can SHIFT your body, your language into ANOTHER emotion</li></ul><p><strong>Discover a 3-Step Framework of working with the emotion of anger and its associated energy.</strong> Connect to the whole human being you are by exploring the connections between Body, Emotions and Language!</p><p>I want to offer you a framework, a new perspective of the holistic and integrated human being that you are! This perspective may help to incorporate several concepts that you have come across in your quest for managing and working with the emotion of anger.</p><p>Anger doesn’t “exist” all by itself. <strong>Anger is created, over time,</strong> through a variety of situations, events and conversations that lead to it!</p><p><strong>Course Contents And Overview</strong></p><p><strong>This course contains 40+ lectures and 2.5+ hours of content</strong>! It is designed for you if you want to learn to manage anger, annoyance, irritability and more… It is designed for you if you want to move past the potentially “destructive” quality of anger and shift into new possibilities for action.</p><p>The material in this course is what I use with my coaching clients so if you are curious about learning to coach yourself from observing your thoughts, ideas and body while exploring anger, this course is for you!</p><p>I strongly believe in 3 key ideas: <strong>#1) Education </strong>- learn about what matters to you; <strong>#2) Coaching</strong> - practice and embody that learning; and <strong>#3) Leadership</strong> - show up \"fully and in presence\" with others.</p><p>Every section in this course is connected and invites you to embody the learning. Each section has some “Action Steps” or “Activity” to help you notice what shows up for you as you to interpret and get to the story of the emotions that you experience.</p><p>The more you can practice and apply what you learn in the sections determines the results you'll get.</p><p><strong>Section #1</strong> – “Welcome To The Course” – Quickly get started in this section with this short introduction to “Anger Management” through a linguistic process via the two foundational models of the O-A-R and the B-E-L. You are the unique observer of your life. And the unique observer you are has a Body, experiences Emotions and interprets those emotions in Language. There is also an invitation to join the private Facebook group called, “Life Coaching And Vedic Counseling”.</p><p><strong>Section #2</strong> – “Not Just \"Anger\" But Annoyance, Irritability, Rage, Fury And More...” – Anger is much more than a single emotion. In fact, a quick browse in the dictionary uncovers 120+ related words to “anger”. The more you increase your vocabulary about anger, the more you are able to work with anger and notice it for yourself. When you notice, then you have the POWER to change.</p><p><strong>Section #3</strong> – “Classifying Anger And The ‘Ladder Of Violence’” – Anger can be destructive but it also has potential to be creative. Learn how anger is classified and discover the “ladder of violence” that causes anger to be built up from small infractions all the way up to violent, destructive expressions.</p><p><strong>Section #4</strong> – “Invite Anger Into Your Life By Stepping Into AND Out Of Anger...” – In this section we learn to work with anger by IDENTIFYING it as an actor would. We “step into” anger and related emotions and notice “Who/What/When/Where/How” it shows up. Then we “step out”. Step in. Step out. Step in. Step out. It’s a constant practise.</p><p><strong>Section #5</strong> – \"[BONUS] Guided Visualizations From ‘3 Steps To Improve Communication Skills’\" – Here you will learn about the 5 body dispositions and how they cause us to experience certain emotions. Once you learn to move your body in an appropriate way to get satisfactory results, then you have a powerful tool to work with your emotions. The activities in this section invite you to practise moving your body into these dispositions.</p><p><strong>Section #6</strong> – “Conclusion To \"Anger Management\" And Your Next Steps” – We wrap up this course with the invitation to practise. Approach anger through the intelligent, intellectual perspective of a narrative of injustice. Practise noticing and continue to practise stepping into and stepping out of anger and its related emotions. Then you can move into the investigative part of understanding the linguistic foundation of anger and the associated body shapes that will allow you to take control of the situations, events and conversations in your life!</p><p><strong>Section #7</strong> – “BONUS Offers And Special Coupon Codes For Students” – I leave you with a special offer to work with me as a leadership life coach. Give me a shout and let’s have a conversation about what creates satisfaction in your life! Also included are coupon codes for my other courses!</p><p><strong>Course Bonuses!</strong></p><p><strong>Bonus #1</strong> – PDF Worksheet \"Getting ‘Ticked Off’\" – A 1-page document to help you identify the “Who/What/When/Where/How” you get “ticked off” on the way to “full-blown” anger. </p><p><strong>Bonus #</strong>2 – PDF Worksheet “Emotions ‘Opposite’ Of Anger” – A 2-page worksheet designed to give you a list of 30 emotions that are “opposite” of anger. When you know that there are other emotions possible, you will have new insight into how these work for you.</p><p><strong>Bonus #3</strong> – PDF Worksheet “Synonyms Of Anger” – An 8-page worksheet designed to give you a list of 120 different AND related emotions to anger. Learn to create the distinctions for the “blob” of emotions that anger consists of.</p><p><strong>Bonus #4</strong> – PDF Worksheet \"Ladder Of Anger\" – Use this 1-page document to map out the range of emotions leading to “anger” for you. Make use of the extended vocabulary worksheet to help you out.</p><p><strong>Bonus #5</strong> – PDF Worksheet “Stepping Out” – Use this 1-page document and learn how to “Step Out” of any emotion, including anger. Shift your body and shift your mood!</p><p><strong>Bonus #6</strong> – MP3 Recordings to practise the 5 Body Dispositions of “Centre, Resolution, Openness, Stability and Flexibility.” Spend time to practise these short 4-8 minute physical activities to embody the body dispositions. You’ll be surprised at what you discover for yourself!</p><p><strong>Take Action &amp; Enroll</strong></p><p><strong>Click \"Take This Course\" now and make the commitment</strong> to jump straight into “How To Intelligently Manage Anger And Take Control” for yourself. I know that working with the emotion of anger created shifts within me and resulted in a <strong>rewarding personal and professional life.</strong></p><p>See you on the inside!</p><p>Wishing you much success in your journeys,<br></p>Thushyanthan", 
    "end_date": null, 
    "title": "Intelligent Anger Management - Take Control, Be Productive", 
    "price": "40.00", 
    "instructors": "Thushyanthan A", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625456_0b23_2.jpg", 
    "course_url": "https://www.udemy.com/manage-anger/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T03:15:39Z"
}