{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tThis course is for you if you are new to mindfulness and curious about its ability to help manage stress in your daily life. We cover the science of what’s happening in the body when you have a stress reaction, what mindfulness really is, and how to incorporate it into your world.  You need not be intimidated by the idea of adding another task to your routine, as we spend time discussing how to be mindful throughout your normal activities.  </p>  <p style=\"\">  \t<strong style=\"\">Learn to Manage Stress in Your Daily Life by Using Mindfulness Based Stress Management Techniques!</strong>  </p>  <p style=\"\">  \tIn this course, you will learn:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t·what’s happening in your brain to process emotion and stress, and why do you care!?  \t</p>  \t<p style=\"\">  \t\t·what is mindfulness?  \t</p>  \t<p style=\"\">  \t\t·how can mindfulness help you to manage stress in your daily life?  \t</p>  \t<p style=\"\">  \t\t·active steps to take to make mindfulness a regular practice, both formally and informally.  \t</p>  \t<p style=\"\">  \t\t·what effects stress hormones have on your body and mind.  \t</p>  \t<p style=\"\">  \t\t·the body’s self-defense mechanisms against stress (fight/flight/freeze, emotional hijacking, etc.)  \t</p>  </ul>  <p style=\"\">  \tMindfulness Based Stress Management techniques have been proven time and time again in research studies to be as effective as cognitive behavioral therapy for depression, stress and anxiety.  This course provides the basics of these techniques to begin work immediately.  Our 8 guided audio meditations can be used over and over to begin real-life application of mindfulness.  </p>  <p style=\"\">  \tWe provide you with 8 chapters worth of learning.  Each chapter includes a discussion style lecture with both instructors, as well as a downloadable audio guided meditation file.  There is also a course Power Point which provides the main points of the course and a framework to take notes.  </p>", 
    "end_date": null, 
    "title": "Integrate Mindfulness: The Basics of Stress Management", 
    "price": "20.00", 
    "instructors": "Jenna Meredith Sanders", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369924_e974_5.jpg", 
    "course_url": "https://www.udemy.com/imstressmanagement/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-14T04:04:55Z"
}