{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t If you&#039;re here, chances are you are looking for a way to get rid of your <em style=\"\">annoying anxiety problem</em>! Sometimes you know the cause, and other times you don&#039;t. Either way, my methods will WORK to lessen your anxiety, drastically.  </p>  <p style=\"\">  \t Hi. I&rsquo;m Kayce, a Psychology Major (Honors B.A.), Teacher, Author, and Life Coach.  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">I also know how anxiety feels. </strong></em>  </p>  <p style=\"\">  \t As a perfectionist and first born, I was extremely anxious as a child. However, when I was that young, I didn&#039;t realize I had an anxiety disorder.  </p>  <p style=\"\">  \t My body was struggling. My nervous system was a wreck. I felt uptight and on guard every waking minute. I couldn&#039;t sleep well at night and often found it hard to breathe... I was constantly sighing. If you sigh a lot... that&#039;s a problem!  </p>  <p style=\"\">  \t Whenever I tried getting massages or relaxing in a hot tub / Jacuzzi, the anxiety was a bit less, but my mind was still racing and I was still constantly worrying or thinking, so the anxiety never left.  </p>  <p style=\"\">  \t I was prescribed an SSRI which helped a lot, but the side effects made me feel like a zombie with no emotions. I was only 21 and didn&#039;t wanna spend the rest of my life as a zombie!  </p>  <p style=\"\">  \t Living with anxiety, panic and /or agoraphobia can be very challenging. Often others, even professionals, really don&#039;t understand how we think or feel and it is helpful to talk to get sound advice from someone who is walking the same walk as you are.  </p>  <p style=\"\">  \t I am offering affordable lessons to anyone who would like to have some assistance in learning to co-exist with their challenge. I can help you to learn to put the anxiety/panic in the background of your life so that you might go through your days as productively as possible.  </p>  <p style=\"\">  \t I have learned many techniques that have helped me enormously to deal with where I was at in my life at any given time. I&#039;d love to share them with you in the hopes that you can live up to your full potential just as you are each and every day.  </p>  <p style=\"\">  \t Often people suffering from anxiety disorders try to self-medicate with drugs or alcohol. I was one of them.  </p>  <p style=\"\">  \t I never told my friends of my anxiety disorder. Mental Illness still carries an embarrassing stigma, even in the year 2014! Also, no one wants to hear you&rsquo;re not coping. It&#039;s hard for people to cope with those who are depressed or have some form of mental illness. Generally, if you show any signs of weakness people step away like you have the plague.  </p>  <p style=\"\">  \t <em style=\"\">From a young age, I decided to do a complete change of my life and get rid of my anxiety.</em>  </p>  <p style=\"\">  \t I knew that if other people lived anxiety-free, so could I!  </p>  <p style=\"\">  \t So while obtaining my B.A. in psychology, I chose to take advantage of all the resources available to learn about how to eliminate anxiety. This was research from educational institutions, clinical psychology professors, and academic research journals. Since I wanted to become a clinical psychologist, I wanted to study how they cure anxiety disorders without the use of anti-depressant drugs. I didn&#039;t want to PAY to go see a psychologist or therapist. I was only a student. I wanted to do the &quot;therapy&quot; myself.  </p>  <p style=\"\">  \t <strong style=\"\">You can have what I have</strong>  </p>  <p style=\"\">  \t There&rsquo;s a little button at the top of this page which gives you access to the best of that knowledge.  </p>  <p style=\"\">  \t What have my clients said about me and my course?  </p>  <p style=\"\">  \t <em style=\"\">&ldquo;Totally apprehensive, gave it a shot - LOVED it. Had tears in my eyes on more than 1 occassion. Kayce was fabulous and I would highly recommend her. I will continue to work with her =).&quot;</em>  </p>  <p style=\"\">  \t <em style=\"\">&ldquo;I loved loved loved my coaching session!! I look forward to working with Kayce in the near future!!&rdquo;</em>  </p>  <p style=\"\">  \t <em style=\"\">&ldquo;Kayce is very passionate about her work. She really get you to thinking. Looking for help in taking steps toward your new life with the right tools. Then this course is for you. Glad I didn&#039;t talk myself out of this course. Thank you Kayce!!!!!&rdquo;</em>  </p>  <p style=\"\">  \t Each section of my course offers some fun activities (I currently work as a high school teacher) to help you deepen your understanding and implement what you&rsquo;ve learnt.  </p>  <p style=\"\">  \t As a live workshop, this material can sell for around $800-1000 per person! I&rsquo;m not going to charge you anywhere near that, AND I will also be here by your side ready to answer your questions as you run through the course. Just shoot me a message!  </p>  <p style=\"\">  \t You don&rsquo;t have to go through a life filled with anxiety any more.  </p>  <p style=\"\">  \t I can tell you from personal experience and from that of my clients, that getting anxiety down to a manageable state is LIFE CHANGING.  </p>  <p style=\"\">  \t Anxiety affects every area of your life.  </p>  <ul style=\"\">  \t<li style=\"\">You will be healthier.</li>  \t<li style=\"\">You will sleep more soundly.</li>  \t<li style=\"\">You will have more energy every day.</li>  \t<li style=\"\">Your mind will be calmer, clearer and more focused.</li>  \t<li style=\"\">The relationships with those you care about will be happier and more successful.</li>  \t<li style=\"\">You will be more present with conversations</li>  \t<li style=\"\">You will have better intuition.</li>  \t<li style=\"\">You will be more in control and able to handle pressure</li>  </ul>  <p style=\"\">  \t I&rsquo;ve helped a lot of people with these skills and I want to help you too so that you can start reducing your anxiety <em style=\"\">TODAY</em>.  </p>  <p style=\"\">  \t This is your chance. Don&rsquo;t lose the moment.  </p>  <p style=\"\">  \t Scroll to the top of the page and click <strong style=\"\">TAKE THIS COURSE</strong>.  </p>  <p style=\"\">  \t I wish you all the happiness and success in the world!  </p>  <p style=\"\">  \t To your success,  </p>  <p style=\"\">  \t Life Coach Kayce Xx  </p>", 
    "end_date": null, 
    "title": "Learn How to Manage Anxiety", 
    "price": "25.00", 
    "instructors": "Kayce Mick", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145654_7023_8.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-manage-anxiety/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-11T21:04:00Z"
}