{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>'Learn to de-stress fast with massage and positive self-talk!' is a course you can take which teaches you how to be more involved in your own health care, by using brief physical and mental strategies you can use in times and places that suit you. </p>\n\n<p>Dr Jakob Bargak has created a series of video clips which show you how to use self massage to bring about reduced tension under various circumstances. Dr Michelle Pain has created a series of videos that is based on principles of Cognitive Behavioural Therapy (that is, paying attention to the things you think and do), with productive thoughts and strategies suggested.</p>\n\n\n\n<p>The topics covered include:<br>Deep Breathing techniques<br>Using positive self talk (including tips to using imagery, and why positive self talk works)<br>What is acupressure, how to perform acupressure, and who benefits from acupressure<br>Some specific demonstrations and treatments are suggested for<br>    Depression<br>    Anxiety, and <br>    Sport and Fitness... <strong>Over 50 videos of content!</strong></p>\n\n\n\n\n\n\n\n<p>This course is suitable for anybody who notices they feel stressed, and want to know more about taking action to reduce their own stress levels, either without taking medication or as an adjunct to to the care offered under medical supervision.</p>\n\n\n\n\n\n\n\n<p>The course is largely video-based. It should take about 2 hours to try out all the material at least once, but then students may wish to re-visit those topics which they found most applicable to their individual circumstances. Eventually, with repeated use, it is expected that students would not need to refer to the course material at all because they know what works for them and how to do it.</p>", 
    "end_date": null, 
    "title": "Learn to De-Stress Fast with Massage & Positive Self-Talk!", 
    "price": "50.00", 
    "instructors": "Dr. Jakob Bargak, Dr Michelle Pain", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/762222_61f5_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-de-stress-fast-with-massage-positive-self-talk/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-14T11:46:59Z"
}