{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t <strong style=\"\">CERTIFICADO: </strong>En este curso práctico usted conocerá desde un visión experta todo lo relativo al concepto, fisiología, utilidad, fases y estrategias para manejar el estrés de una manera efectiva en su vida.  </p>  <p>  \t   Este entrenamiento cuenta con una serie de 21 videos explicando cada elemento dentro de nuestro currículo. También cuenta con un Test para medir su nivel de estrés, donde usted podrá evaluarse y corregirlo a la vez (descargable).  </p>  <p>  \t   El curso tiene una duración de unas 2 horas teóricas, donde se plantean ejercicios puntuales para que usted los realice en el tiempo que usted considere y pueda así lograr los objetivos propuestos.  </p>  <p>  \t   Usted contará con 9 secciones divididas de la siguiente manera:  </p>  <ol style=\"\">  \t<li>Introducción al curso</li>  \t<li>El Estrés en la Actualidad, ¿Cómo lo vemos?</li>  \t<li>Fisiología del Estrés</li>  \t<li>Utilidad del Estrés</li>  \t<li>El problema del Estrés</li>  \t<li>Fases del Estrés</li>  \t<li>¿Cuál es mi nivel de Estrés?</li>  \t<li>Estrategias para el Manejo del Estrés</li>  \t<li>Resumen y cierre del curso</li>  </ol>  <p>  \t   Al tomar este curso usted se sentirá en la capacidad de poder tomar control sobre su vida y los elementos que constantemente le causan estrés. Tendrá las herramientas adecuadas que lograrán mejorar significativamente su calidad de vida. Podrá ayudar a todo el que le rodea a manejar su estrés de la mejor manera posible. Usted proyectará una imagen de persona equilibrada frente a su ambiente laboral, familiar, social. Por último, pero no menos importante, garantizará eliminar ciertas patologías o enfermedades que se producen por el manejo inadecuado del Estrés cotidiano.  </p>  <p>  \t <strong style=\"\">Lo garantizamos!, con este curso, usted tendrá MUCHO QUE GANAR!</strong>  </p>", 
    "end_date": null, 
    "title": "Manejo Efectivo del Estrés", 
    "price": "45.00", 
    "instructors": "SINAPSI CDHE, MA Robert Sasuke", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246046_169c_2.jpg", 
    "course_url": "https://www.udemy.com/manejoee/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-18T20:36:54Z"
}