{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Being fully guided; the programme in this course is designed to accelerate the experience of mindfulness meditation for individuals, as well as laying the foundations for a life time of practise.  All you need to do is set aside time and follow the guidance given in daily exercises.</span>  </p>  <p style=\"\">  \t      Improve your ability to relax, gain more mental clarity, increase awareness and the ability to focus attention and increase your sense of well being.  These benefits come through repeated practise which this 21 Day programme gives you the opportunity to experience.  </p>  <p style=\"\">  \t<strong style=\"\">Experience Mindful Meditation, learning and practising techniques to relax your body and calm your mind</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">Develop      the discipline of mindfulness</li>  \t<li style=\"\">Create      new habits for a calmer more balanced mind and body</li>  \t<li style=\"\">Deepen      your understanding of yourself</li>  \t<li style=\"\">Experience      the benefits that regular mindfulness meditation gives</li>  </ul>  <p style=\"\">  \t      Mindfulness practise has been in the consciousness of Eastern philosophy for over two and a half thousand years and is currently gaining increased popularity in more western cultures.  Although its origins are associated with Buddhism, the practise of mindfulness is in no way a religious or philosophical undertaking.  </p>  <p style=\"\">  \t      Mindfulness is instead a practise and skill, an ability that we all possess and use to lesser or greater degrees and has been the subject of much western analysis since the late 1960&#039;s.  As a personal practise it helps develop a deeper understanding of self, as well as providing the practitioner with a range of physical, mental and emotional benefits.  </p>  <p style=\"\">  \t<strong style=\"\">      The Course</strong>  </p>  <p style=\"\">  \t Divided into 5 sections.  Section 1 introduces you to what Mindfulness is and how Mindfulness meditation is used to calm a busy mind.  Then, sections 2, 3 and 4 contain the 21 day programme, 7 days per section, with each of the 21 days having a ‘Point of Focus’, a key learning objective to be achieved during the guided, morning and evening exercises.  The final section, section 5, gives advice on the next steps as you look to continue your Mindfulness journey.  </p>  <p style=\"\">  \t      By the end of this course you will have completed over 760 minutes of seated mindfulness meditation, gone through 21 days of exercises, each with their own learning objectives.  You will have improved your posture, developed more control over your breathing, learnt how to relax your body and calm your mind and hopefully started to recognise the benefits that mindfulness practise gives you, outside of this course.  </p>", 
    "end_date": null, 
    "title": "Mindfulness Meditation a 21 Day Guided Programme", 
    "price": "35.00", 
    "instructors": "Jeremy Woodall", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/237172_e09b_5.jpg", 
    "course_url": "https://www.udemy.com/mindfulness-in-21-days-a-fully-guided-programme/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-04T14:22:14Z"
}