{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Mit diesem Kurs wollen wir in erster Linie die Herrschaft über uns in stressvollen Momenten übernehmen. Mit Werkzeugen in der Hand kann in prekären Situationen das Ruder übernommen werden.\n\n  </p>\n\n<p><strong>Vom Reagieren zum Agieren</strong>\n\n  </p>\n\n<p>Wir alle geraten in die verschiedensten Stresssituationen. Und wir alle haben unsere individuellen Reizpunkte und Auslöser dafür, und dann fühlen wir uns manchmal machtlos. Das muss nicht so sein!\n\n  </p>\n\n<p>Es hilft einerseits zu erkennen, welche Stresssituationen wir haben und wie diese ausgelöst werden. Dies erfordert unsere Achtsamkeit in den speziellen Situationen. Darüber hinaus brauchen wir einen gewissen Grad an innerer Ruhe und Ausgeglichenheit um dies zu erkennen. \n\n  </p>\n\n<p>Das wollen wir lernen. Mit diesem Kurs wirst du lernen, nicht auf die Stresssituationen zu reagieren – schon gar nicht wenn es zu spät ist! Die Situationen wollen erkannt werden, und dann wollen wir handeln und effektiv agieren.\n\n  </p>\n\n<p><strong>Der große Wert dieses Kurses ist es, dass du effektive Werkzeuge an die Hand bekommst! </strong>\n\n  </p>\n\n<p>Die Frage ist niemals: „Was wäre wenn…“ – das ist eine Frage, die „Reagieren“ impliziert. Die richtige Frage ist: „Was tue ich, wenn…“ Jetzt kommen wir in den richtigen Modus. Das ist der 2. Schritt in diesem Kurs. Wir beginnen zu agieren, und die individuellen Stresssituationen selbstverantwortlich, und eigenmächtig in die Hand zu nehmen.\n\n  </p>\n\n<p>Im 1. Schritt wollen wir gemeinsam deine Ist-Situation und deine Stresssituationen erkennen lernen. Achtsamkeit und Wertschätzung sind hier die Schlagwörter.\n\n  </p>\n\n<p>Weshalb Wertschätzung? Es gibt verschiedene Schritte, die zu einem selbstbestimmten Handeln führen. Im 1. Schritt müssen wir mit Achtsamkeit und Feingefühl erkennen, worum es geht. Im nächsten Schritt brauchen wir die Akzeptanz um die Situationen anzunehmen. Denn die Situationen sind die Lehrmeister selbst. Im 3. Schritt brauchen wir weitere Werkzeuge, um diesen Situationen Herr zu werden. \n\n  </p>\n\n<p>Wertschätzung am Ende dieser Kette lässt dich selbst zum wahren Meister über dich werden. Die Situationen sind unsere Lehrmeister, und mit Wertschätzung den Situationen und den Gegebenheiten gegenüber entsteht wahres inneres Wachstum. Wir reifen in unserer Persönlichkeit.\n\n  </p>\n\n<p>Diese Schritte können nicht gelehrt werden, denn es sind Schritte der individuellen Entwicklung. Kein Lehrmeister der Welt kann dir das erlernen. \n\n  </p>\n\n<p>Was aber gelernt werden kann, ist Achtsamkeit, Akzeptanz und Umgang – also Werkzeuge –für deine individuellen Stressoren. \n\n  </p>\n\n<p><strong>Der Kurs ist wie eine Werkzeugkiste</strong>\n\n  </p>\n\n<p>Ich sehe diesen Kurs wie eine Werkzeugkiste. Ich zeige dir in diesem Kurs, welchen „Hammer“, welchen „Schraubenzieher“, oder welche „Säge“ du \n\n  </p>\n\n<p>-       Wann\n\n  </p>\n\n<p>-       Wie\n\n  </p>\n\n<p>-       Wo\n\n  </p>\n\n<p>verwenden kannst. Zuerst wirst du die Werkzeuge kennen lernen, dann geht es daran, diese Werkzeuge auch einzusetzen und den Umgang mit diesen Tools zu verbessern und zu verfeinern.\n\n  </p>\n\n<p><strong>„Der Weg ans Ziel beginnt mit dem ersten Schritt“</strong>\n\n  </p>\n\n<p>Das Ziel in diesem Kurs ist ganz klar:\n\n  </p>\n\n<ul>  <li>Stressoren      und Stresssituationen erkennen\n\n  </li><li>Annehmen      und Akzeptieren lernen\n\n  </li><li>Werkzeuge      für die Situationen selbst kennen lernen und anwenden lernen\n\n  <ul>   <li>Vor       die Stresssituation aufkommt\n\n   </li><li>In       deinen speziellen Situationen agieren\n\n   </li><li>Weiterer       Umgang nach Stresssituationen\n\n   </li><li>Ein       Notfallschlüssel für jede Situation\n\n  </li></ul> </li></ul>\n\n<p><strong>Es ist ein Prozess – im selben Atemzug ist es auch leicht</strong>\n\n  </p>\n\n<p>Stresssituationen können ganz schön anstrengend sein. Über sie Herr zu werden ist ein Prozess. Oftmals kommen sie ganz plötzlich. Und der Umgang mit diesen oft speziellen Situationen braucht ein wenig Zeit – es ist ein Prozess. \n\n  </p>\n\n<p>Gleichzeitig: wenn du Herr über diese Situationen wirst, mit den notwendigen Werkzeugen, wird es ganz plötzlich auch wieder schlagartig leicht. \n\n  </p>\n\n<p>Im Nachhinein wundern wir uns oftmals, wie es denn nur so schwer sein konnte, diese Situationen durchzustehen. Wieso und warum: das sind Fragen, die in diesem Moment nicht mehr wichtig sind. Wichtig ist, dass du durch deine Stresssituationen so ruhig wie möglich, und so kontrolliert wie möglich durchschreiten kannst.\n\n  </p>\n\n<p>Jetzt – hier und heute – ist es Zeit für dich, mit diesem Udemy Kurs das Ruder zu übernehmen. </p>", 
    "end_date": null, 
    "title": "Notfalltipps zur Stressbewältigung", 
    "price": "50.00", 
    "instructors": "MentalCoach und PersonalTrainer Philipp Nägele", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/826028_5b22_2.jpg", 
    "course_url": "https://www.udemy.com/notfalltipps-zur-stressbewaltigung/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T11:47:56Z"
}