{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>UPDATED FOR MARCH 2016. JOIN OVER 1,000 STUDENTS!</strong></p><p>Do you ever have fear or anxiety?</p><p>Would you like to be free of fear and anxiety to live a happier, more enjoyable life, with more success and achievement?</p><p>Would you like to break free from fear and anxiety today?</p><p>In this special course, instructors David Fonvielle and Dr. Jakob Bargak have joined forces to give you 3 very different, special ways for freeing yourself from fear and anxiety naturally. </p><p>First, David will teach you how you can quickly improve your mind and body to get rid of fear and anxiety faster and easier. </p><p>And then Dr. Bargak will teach you a very different, complementary way of getting rid of fear and anxiety with acupressure points from Traditional Chinese Medicine. </p><p>The overall effect will be that this course will be unlike any other approach you've ever learned for fear and anxiety, since very different but complementary methods are taught to help you become free from fear and anxiety faster than you ever imagined possible. </p><p> <em><strong> Some more information about this course: </strong></em> </p><ul> <li>The <strong>low price will increase shortly</strong></li> <li>You have <strong>unlimited lifetime access at no extra costs, ever</strong></li> <li><strong>All future additional lectures, bonuses, etc. in this course are always free</strong></li> <li>There's an unconditional, never any questions asked <strong>full 30 day money-back-in-full guarantee</strong></li> <li><strong>Help is always available to you</strong> if you have a question</li> </ul><p> With this course and the lessons you'll learn, <strong>you can already reduce any fear or anxiety you feel by the end of today.</strong></p><p>And in a week, as you continue developing the skill of getting rid of fear and anxiety, you can feel amazed by how fear and anxiety isn't a problem for you anymore, now that you know how to handle it, reduce it, and even completely eliminate it!</p><p> So don't waste another second: <strong>start getting rid of fear and anxiety right now and begin enjoying life more than ever. </strong> </p><p> <strong>Enrol now!</strong></p>", 
    "end_date": null, 
    "title": "Overcome Fear & Anxiety Today With 3 Tricks - Be Calm Today!", 
    "price": "30.00", 
    "instructors": "David Fonvielle, Dr. Jakob Bargak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558954_24c1_2.jpg", 
    "course_url": "https://www.udemy.com/overcome-fear-and-anxiety/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-19T22:28:58Z"
}