{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Who Else Would Like to Stop Panic Attacks Fast <em style=\"\">...In Just 5 Minutes or Less a Day?</em></strong></p><p>Dear Friend,</p><p>If you&#039;re suffering from excruciating panic attacks accompanied by a terrifying feeling that you&#039;re about to get a heart attack, die, go crazy, choke or faint, then this is the most important course you&#039;ll ever take.</p><p>And by the way...</p><p><strong style=\"\">Yes! This course really <em style=\"\">is</em> just $9!</strong></p><p>I&#039;m going to share with you why it&#039;s just nine bucks in a second, but first let me explain why this is course is <em style=\"\"><strong style=\"\">dramatically different from any other &quot;stop panic attacks&quot; course or book you&#039;ve read. </strong></em><strong style=\"\"></strong></p><p>What you&#039;re getting is working great for my clients, and unlike most other &quot;Panic Away&quot; courses on the Internet there&#039;s no fluff or fillers. </p><p>It gets straight to the point! </p><p><em style=\"\">It&#039;s more like a self therapy &quot;FIELD GUIDE&quot; than an actual online course. </em></p><p>You&#039;ll discover how to overcome your dreaded panic attacks in just 5 minutes a day, with the use of <em style=\"\"><strong style=\"\">3 &quot;little known&quot; exercises</strong> that I accidentally discovered in my training as a psychotherapist.</em><br style=\"\"></p><p><strong style=\"\">Here&#039;s Exactly What You&#039;re Getting</strong></p><ul style=\"\"><li style=\"\">A <strong style=\"\">simple trick to instantly reduce panic in emergency situations</strong>, when everything else doesn&#039;t seem to work!</li><li style=\"\">A weird guided &quot;energy listening&quot; exercise that <strong style=\"\">consistently cuts your anxiety and panic in HALF every time you use it</strong><em style=\"\"> (it&#039;s the most effective PANIC CURE I&#039;ve ever seen!)</em><em style=\"\">.</em></li><li style=\"\">An easy meditation method to reduce your anxiety and fight panic attacks from the comfort of your home.</li><li style=\"\"><strong style=\"\">FREE BONUS:</strong> As a FREE bonus I&#039;ll also give you the #1 panic cure book on Amazon &quot;Panic Disorder Cure - How to Cure Panic Disorder and Overcome Panic Attacks without Drugs&quot;.</li></ul><p>That&#039;s a lot of proven strategies to help you overcome your panic disorder!</p><p>And as I said, it only takes about 5 minutes a day.</p><p><em style=\"\"><strong style=\"\">Plus, it&#039;s EASY...</strong></em></p><p><strong style=\"\">Why It&#039;s Just $9</strong></p><ul style=\"\"><li style=\"\">Nine bucks puts this <strong style=\"\">POWERFUL PANIC CURE</strong> within reach of the vast majority of the world&#039;s population. It&#039;s not too expensive even for the most humble panic sufferers. </li><li style=\"\">Anyone who isn&#039;t serious enough to put down the price of a fast food dinner to overcome their panic attacks, isn&#039;t going to use the strategies in the course anyway.</li><li style=\"\">Anyone who&#039;s willing to put down the price of a Starbucks latte to live a life free of anxiety and panic attacks has the opportunity to thrive!</li></ul><p>If you&#039;d like to finally live a life free of panic attacks and chronic anxiety, join this course right now while it&#039;s still fresh on your mind. </p><p><em style=\"\">Just skip McDonalds once and it&#039;s already paid for. </em><br style=\"\"></p><p>Plus you&#039;ll see the value of the course as soon as you watch the first video and start instantly reducing your panic.</p><p><strong style=\"\">Here&#039;s What To Do Next</strong></p><p><em style=\"\">If this feels right to you, and you&#039;d like to start overcoming your panic disorder today, click on the blue &quot;Take This Course&quot; button on the top right hand side of this page.</em></p><p>You won&#039;t regret it...</p><p>However, I need you to read this next part carefully...</p><p><strong style=\"\">Time Is Of The Essence</strong></p><p>As much as I&#039;d like to give away this course to everyone and their brother for just $9, I simply can&#039;t do that for a very long time <em style=\"\">without ending up on the streets...</em></p><p>Please understand that this is a genuinely rare opportunity.</p><p>When I feel it&#039;s time for it, I will increase the price to $47, $97 and eventually to its appropriate value of $297. </p><p><strong style=\"\">If this feels right to you, and you&#039;d like to start overcoming your panic disorder today, click on the blue &quot;Take This Course&quot; button on the top right hand side of this page.</strong></p>", 
    "end_date": null, 
    "title": "Panic Attacks: Stop Panic Attacks Fast In 5 Minutes A Day", 
    "price": "20.00", 
    "instructors": "Ines Murias", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604816_2d65_3.jpg", 
    "course_url": "https://www.udemy.com/panic-attacks-stop-panic-attacks-fast-in-5-minutes-a-day/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T13:17:51Z"
}