{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The <strong>Performance Under Pressure - The Right Attitude</strong> course helps you recognize the events and situations that cause you to feel pressure. It explains how you can understand your reaction to pressure, and how excessive stress can impair your performance.<br></p><p>Finally, it covers the principles for managing your attitude so you stay in control and maintain a success-oriented mentality.  Because, meeting high-pressure challenges is an opportunity for you to excel and build your reputation as someone who can be counted on. </p><p>Professionals and all who want to develop their abilities to manage the stress that comes with working under pressure and anyone who wants to develop or refine their skills for performing under pressure.</p><p>After completing this topic, you should be able to:</p><ul><li>identify the factors that in a situation are likely to trigger pressure,</li><li>recognize how your response to pressure can impair your performance,</li><li>conduct a stress profile, and</li><li>manage your attitude in pressurized situations.</li></ul><p>This is just  a first part of a series of courses on <strong>Performance Under Pressure</strong>. Next courses will focus on taking action under pressure and achieving relational performance.</p><p>The course includes video lectures, quizzes, examples and exercises and a small optional course project. All should take you not more than 2 hours to finish.</p><p>The course comes with a 30 days, no question asked, guarantee. Now, go ahead and hit that \"Take the course\" button, and see you on the inside!</p>", 
    "end_date": null, 
    "title": "Performance Under Pressure - The Right Attitude", 
    "price": "20.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630582_c0e7_3.jpg", 
    "course_url": "https://www.udemy.com/performance-under-pressure-the-right-attitude/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T17:35:35Z"
}