{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    This course introduces seven practical strategies to strengthen your resilience, with step-by-step practices that help you deal with and/or recover from setbacks, adversities and challenges. It includes an hour of video content presented in 18 engaging episodes, with downloadable supporting pdf handouts for each strategy. The course is based on research proven methods and the trainer&#039;s three decades of experience teaching resilience skills.  </p>  <p style=\"\">  \t<strong style=\"\">Develop your ability to deal with the dips, knocks and bumps in life. </strong>  </p>  <p style=\"\">  \t  The course  </p>  <ul style=\"\">  \t<li>shows how inspiring examples of resilience in stories and the news can help you identify key elements of resilience</li>  \t<li>draws on a range of sources, including the Penn Resilience Program which has been shown by research to protect against anxiety and depression</li><li>introduces emotional first-aid practices to steady your nerves when you&#039;re feeling on edge.</li>  \t<li>teaches you to use a storyboarding process to design resilient responses in situations you find difficult</li>  </ul>  <p><strong style=\"\">Resilience strategies help you cope with stress, make the best of things and rise to the occasion</strong></p><p>Feedback from past participants includes:</p><p><em style=\"\">&quot;Chris Johnstone has a way of explaining things that makes it crystal clear. His style is professional, authentic and warm.&quot;</em></p><p><em style=\"\">&quot;This trainer has an amazing ability to deliver the psychology of wellbeing in a highly digestible, lucid and relevant way&quot;.</em></p><p>The goal of this course is to help you develop your personal resilience toolkit, offering insights and practices to help you bounce forward when knocked back so that you can get more from life. </p>", 
    "end_date": null, 
    "title": "Personal Resilience in an Hour", 
    "price": "25.00", 
    "instructors": "Dr Chris Johnstone", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385896_3480_3.jpg", 
    "course_url": "https://www.udemy.com/personal-resilience-in-an-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T18:32:28Z"
}