{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>PTSD: Cleaning &amp; Clearing Shock &amp; Trauma</p>\n\n<p><strong>Course Description</strong></p>\n\n\n\n<p>This course is designed for those who work with trauma/shock survivors or those who are trauma/shock victims themselves and who have not yet found a way to collapse and clear any images/memories and resultant fears, anxieties, depression or addictions as a result of ongoing emotional and physical disturbances. </p>\n\n\n\n<p><strong>Learn and Master</strong></p>\n\n\n\n<p>This is about helping others or oneself in FINDING FREEDOM from addictions, obsessions, compulsions, fears, phobias, anxieties and trauma. It is an easy guide to understanding the nature of PTSD and potentially quick and simple solutions to releasing the impacts of same.</p>\n\n\n\n<p><strong>Mastering a skill/technique/tool</strong></p>\n\n\n\n<p>Discover the means by which an understanding of the origins, impact and nature of shock and trauma in people’s lives can be dissipated, cleaned and cleared at a pace and in a manner that is safe and healthy for the sufferer.</p>\n\n\n\n<p><strong>What are the requirements?</strong></p>\n\n\n\n<p>A desire to learn about the nature of shock and trauma and to discover new, practical, and easy-to-apply tools and techniques for collapsing trauma triggers and reactions.</p>\n\n\n\n<p><strong>What am I going to get from this course? </strong></p>\n\n\n\n<p>This course has both academic content and experiential and practical components, with techniques to attain closure. The course contains video and audio lectures as well as resource material, references and links.</p>\n\n\n\n<p><strong>What is the target audience?</strong></p>\n\n\n\n<p><u>Professionals:</u></p>\n\n\n\n<ul><li>Counsellors</li><li>Clinicians</li><li>Therapists</li><li>Critical Incident Stress Debriefers</li><li>Psychologists</li><li>Psychiatrists</li><li>Mental Health Practitioners</li><li>Trauma specialists</li><li>Students of Psychology/Psychiatry/Criminology</li></ul>\n\n\n\n<p><u>Clients and patients</u> of the above including: </p>\n\n\n\n<ul><li>Military veterans</li><li>Victims of crime or abuse</li><li>Victims of terror</li><li>Those who suffer from trauma and shock</li><li>Sufferers who have not sought treatment</li><li>Sufferers who are getting treatment but have not yet been successful in processing their traumatic histories. </li><li>Those who have repeated nightmares or images that haunt them.</li><li>Those who have had emotional, sexual or physical trauma from accidents or deliberate acts of violence or have been witness to same.</li><li>Those who have had vicarious trauma.</li><li>Those who have been ‘uncomfortably spotlighted’ – which could include having been bullied.</li><li>Those with ‘stuck/frozen’ memories/images.</li><li>Loved ones who wish to share new possibilities with victims of shock and trauma</li></ul>", 
    "end_date": null, 
    "title": "PTSD: Cleaning and Clearing Shock and Trauma", 
    "price": "50.00", 
    "instructors": "Stephen (Steve) King", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746550_7cc1_3.jpg", 
    "course_url": "https://www.udemy.com/post-traumatic-stress-disorder/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T05:14:39Z"
}