{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn how to reduce stress with the power of self hypnosis. </p><p>This course will teach you:</p><ul><li>What hypnosis is</li><li>What self hypnosis is</li><li>How you can measure your progress and success</li><li>How to prepare for experiencing self hypnosis</li><li>Why self hypnosis is useful to help you reduce stress</li><li>How often you should use the self hypnosis track to help you reduce stress</li><li>Two powerful non-hypnosis techniques for helping you reduce and manage stress</li></ul><p>Included in this course is a brief guided self hypnosis session to give you a taste of what your experience of entering hypnosis is, and to give you an opportunity to decide whether Dan Jones approach to hypnosis fits with how you like to be hypnotised.</p><p>As well as having a video lecture of the self hypnosis session, there is also an included downloadable audio mp3 version so that you can listen to the self hypnosis to reduce stress session more comfortably and at your own convenience.</p><p>The course is structured to give you an understanding of hypnosis and self hypnosis and how you can measure your success and progress before moving on to doing the hypnosis, and then giving you additional techniques you can use to reduce and manage stress.</p><p>The course will take about an hour to complete, but you will be likely to use the self hypnosis mp3 frequently over the coming weeks and months, and you may wish to come back to review and practice the additional techniques regularly until you have mastered them.</p><p>So this course is for those interested in reducing and managing stress for themselves and also newly qualified counsellors, NLP practitioners, stress management consultants and hypnotherapists that want to take additional learning around helping clients manage stress.</p>", 
    "end_date": null, 
    "title": "Reduce Stress With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Daniel Jones", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603126_3b80.jpg", 
    "course_url": "https://www.udemy.com/reduce-stress-with-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-05T08:25:34Z"
}