{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">This course is meant for an person, who works in an office</strong>, has tension in their upper back or neck, feels tension or pain in the middle back or lumbar area, who gets tired by the evening or has a weak immune system. <strong style=\"\">This course includes techniques for relaxing all the major tension areas</strong>.  </p>  <p style=\"\">  \t    For years I have been massaging people and instructing different yoga groups, I have worked as a physiotherapist and have been a part of many banks and large companies as a relaxation and stress expert. I have taught thousands of people during various training sessions and seminars how to relax different areas of the body themselves. I would like to introduce you to some of those techniques and exercises.  </p>  <p style=\"\">  \t    Many relaxation exercises help activate the energy circulation and through that improve your well-being and quality of life. When you relieve tension and decrease energy and blood blockages, you may discover that many of the imbalances that we call diseases in western society will ease off or disappear completely.  </p>  <p style=\"\">  \t    You can find tension in your body by feeling your muscles and find the painful areas. The more tension there is in your body, the faster you get tired, the weaker your immune system is, and the more imbalances there are in your body, for example headaches.  </p>  <p style=\"\">  \t <strong style=\"\"> From this course you will learn simple exercises and techniques that will help you to release your tension so you can enjoy your activities and your life.</strong>  </p>  <p style=\"\">  \t    These techniques are kind of like tools that you can use whenever you discover tension in any part of your body. The &quot;Relaxation Techniques&quot; course consists of a lot of different exercises, and you don&#039;t have to do all of them. Choose the ones that suit you, choose the techniques that release your tension the best. If you learn how to use these techniques skilfully, you will become a &quot;master of relaxation&quot; with enough energy to make your dreams come true and be a good friend and partner. First and foremost – through these techniques you will learn to really get along with your body.  </p>", 
    "end_date": null, 
    "title": "Relaxation Techniques to Release Office Stress", 
    "price": "20.00", 
    "instructors": "Toomas Õunap", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/250852_6c24_5.jpg", 
    "course_url": "https://www.udemy.com/relaxation-techniques2/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T12:03:37Z"
}