{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t              As someone with a sitting job, you are definitely familiar with the pain caused by muscle tension. Sometimes your back hurts, sometimes your neck feels stiff or there&#039;s discomfort in your arms and legs. Many of us start taking medicine as soon as we feel the pain and cause even more damage to their body.  </p>  <p>  \t              Actually, most muscle tension and <strong>pain caused by a sitting job is easily fixable</strong>. You just need to know the right exercises and techniques. This course will teach you just that.  </p>  <p>  \t              This course will teach you <strong>how to get rid of pain caused by muscle tension</strong> by using simple but effective self-massage techniques.  </p>  <p>  \t              It is probably one of the most complete courses ever given in the field of self-massage. All effective exercises are nicely explained and demonstrated. You just have to watch and repeat the exercises and <strong>you&#039;ll be free from muscle tension and pain</strong>. All the exercises can be done alone and don&#039;t require any assistance.  </p>  <p>  \t             This is an ideal course for you, if you:  </p>  <ul>  \t<li>feel back pain</li>  \t<li>feel stiffness in your neck and upper back</li>  \t<li>experience headaches</li>  \t<li>are tired and need more energy</li>  \t<li>feel tiredness in your arms and legs</li>  </ul>  <p>  \t             As a bonus, this course will also show you a few effective exercises for when you&#039;ve caught a cold and are getting sick.  </p>  <p>  \t<br>  \t              These exercises are feasible for everyone and work almost always.<br>  \t<br>  \t              I believe you will pick up a lot of useful tricks from this course to use in your everyday life, to<strong> improve your quality of life</strong> and to <strong>be a better and healthier person</strong>. I hope you&#039;re ready to change your life, because it will happen very soon. You&#039;re just one click away from feeling better and living a happier life.<br>  \t<br>  \t <strong>         Take this course and be ready to be surprised. Doing self-massage exercises is a truly easy way to get rid of muscle tension and common pains.</strong>  </p>  <ul>  </ul>", 
    "end_date": null, 
    "title": "Relieve Back Pain and Headache with Self Massage Exercises", 
    "price": "20.00", 
    "instructors": "Urmet Seepter, Toomas Õunap", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/229666_c959_6.jpg", 
    "course_url": "https://www.udemy.com/relieve-back-pain-headache-with-self-massage-exercises/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-26T11:02:49Z"
}