{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>\"Good job Joel.</em><em>Would have given it 4.5 stars if possible. Joel knows what he is doing. He hits you hard where it hurts but the result is a better skill set and ways of dealing with anger. He cares about his students and understands their psychological needs. I felt like I was taking a well-rounded course.\" </em><em>-Student</em></p><p><br></p><p>This is a short but in depth course to enable you to understand what you anger (and other strong emotions) are 'fighting' for.</p><p>I draw on 12 years of counselling practice and training to give you a very practical, and well rounded approach to your anger that you will find refreshingly easy to apply to your life.</p><p>Intimate interviews give you glances into peoples lives and create a platform for each lesson.</p><p>The language and pace of the course makes it accessible and useful for anyone looking to have a more peaceful relationship with themselves or another.</p><ol><li>Section 1: De-Shaming anger, feelings, and needs.</li><li>Section 2: Taking stock of the cost of anger.</li><li>Section 3: Getting clear about what anger is and is not.</li><li>Section 4: Practical CBT and Mindfulness approaches.</li></ol><p>The course integrates principles from various credible schools of thought. (CBT, NVC, Narrative Therapies, Living Wisdom) so you are a practitioner looking to expand your knowledge of anger you will also find this useful. </p>", 
    "end_date": null, 
    "title": "Resolve anger and other strong emotions - Anger Management", 
    "price": "25.00", 
    "instructors": "Joel Young", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394340_a14e_12.jpg", 
    "course_url": "https://www.udemy.com/angersmyfuel/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T21:14:07Z"
}