{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tOver ten years ago I started teaching people a breakthrough approach for ending panic attacks and am now one of the most sought after anxiety coaches online.  </p>  <p>  \tMy home study program (Panic Away) has been used by over 70,000+ people. People get referred to me constantly because of the techniques I use and the speed of results that I get.  </p>  <p>  \tUnlike traditional approaches to anxiety management, my work is based on ending the anxiety problem not trying to manage it. Getting a result is all that matters.  </p>  <p>  \tThe coaching is specifically for anyone who suffers from frequent panic attacks. Spontaneous out of the blue panic attacks or situational panic attacks (e.g driving, shopping, flying or anywhere out of your comfort zone).  </p>  <p>  \tThis coaching program is not for people who suffer from social anxiety, PTSD or OCD. Of course people do the coaching who also suffer from these anxiety disorders but you need to be aware that the focus of this program is 100% on ending panic attacks. Often once the panic attacks end the other anxiety issues improve quickly too.  </p>  <p>  \tWHAT MY COACHING PROGRAM GIVES YOU IS THE ABILITY TO STOP FEARING ANOTHER PANIC ATTACK.  </p>  <p>  \tThe really unique part of the program is that there is no need for you to regress into your past and find out why you had your initial panic attack in order to get results. All that is needed is your willingness to breakthrough the panic cycle.  </p>", 
    "end_date": null, 
    "title": "Stop Panic Attacks Fast ", 
    "price": "20.00", 
    "instructors": "Barry McDonagh", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393866_2208_2.jpg", 
    "course_url": "https://www.udemy.com/stop-panic-attacks-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T12:04:48Z"
}