{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Stress is a constant in all our lives. The pressure to meet our work deadlines, deliver a speech, at home, at work, online, at University, and even with friends or family. Stress can be found everywhere!</strong></p>\n\n<p>\n</p>\n\n\n\n\n\n<p>Stress is a huge part of 21st century life, and is one of the major reasons why people take time off work. But while we cannot avoid life's pressures, we can influence the degree to which they affect us, and also how we react. The Stress Factor will show you how.</p>\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n<p><strong>Throughout The Stress Factor, you will learn how to:</strong></p>\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n<ul>\n<li>Develop and Strengthen Your Inner Resilience.</li>\n<li>Pinpoint the Specific Causes of Stress in Your Life.</li>\n<li>Identify and Change Your Habitual Response Patterns.</li>\n<li>Face Future Challenges With Greater Confidence &amp; Ease.</li>\n<li>Understand What Stress Is &amp; Realise Where It Comes From</li>\n<li>Learn How to Deal With Stress Before it Becomes a Health Problem.</li>\n<li>Harness the Tools That Are Essential to Your Well-Being in Times of Pressure.</li>\n<li>Remove Your ‘Head Trash’ &amp; Harness the Tools That Cultivate Your Inner Peace.</li>\n</ul>\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n<p>Dealing with stress is a skill like any other. Even world famous sports stars rely on stress management strategies when their stakes are high. From cultivating a no-limits mindset to unleashing your very best, The Stress Factor will help you to stress-proof your life in a practical way, at work, in study or even at home.</p>\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n<p>In this thought-provoking course, Kain Ramsay reveals the unconventional science of stress management, showing that by embracing stress and changing our thinking, stress can becoming one our most powerful allies.</p>\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n<p>Drawing on a range of actionable principles, The Stress Factor will show you how to manage stress effectively, focus your energies, build stronger relationships and boost your overall confidence. Rethink stress, and watch how your life changes for the better.</p>\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n<p><strong>The Stress Factor comes with a Full Money Back Guarantee, and if you're anything less than fully satisfied, you can get a full refund within 30 days of purchase.</strong></p>", 
    "end_date": null, 
    "title": "Stress Factor: A Complete Guide To Stress-Proofing Your Life", 
    "price": "25.00", 
    "instructors": "Kain Ramsay", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428490_b111_7.jpg", 
    "course_url": "https://www.udemy.com/the-complete-stress-management-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T15:01:20Z"
}