{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Yoga Nidra ist eine effektive Tiefenentspannungstechnik, die es ermöglicht, sich in nur einer halben Stunde auf körperlicher, emotionaler und mentaler Ebene völlig zu entspannen und zu regenerieren.\n\n  </p>\n\n<p>Während Yoga Nidra schläft der Körper, das Bewusstsein bleibt aber wach, so dass sich Verspannungen lösen können.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Yoga Nidra kann von Personen in allen Lebenslagen und jeglichen Alters praktiziert werden. Es bedarf keiner besonderen körperlichen Fitness, da Yoga Nidra im Liegen ausgeführt wird.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Yoga Nidra kann helfen,</p>\n\n\n\n\n\n<ul><li>Stress zu reduzieren,</li><li>Verspannungen abzubauen,</li><li>mehr Gelassenheit zu entwickeln,</li><li>die Intuition zu stärken,</li><li>die Konzentration zu verbessern und</li><li>besser zu schlafen.</li></ul>\n\n\n\n\n\n<p><br>In dem Kurs lernen Sie Yoga Nidra im Detail kennen und üben es. <br>Anhand von Übungen erkunden Sie Ihre eigenen Stressauslöser und Stressverstärker. Ein wichtiges Thema im Yoga Nidra ist das Sankalpa - das eigene Ziel bzw. der eigene Vorsatz. Sie lernen, Ihr Sankapla zu entwickeln. Da nicht immer Zeit für eine komplette Yoga Nidra-Übung ist, erlernen Sie zusätzlich mehrere Kurzübungen für zwischendurch.</p>\n\n\n\n\n\n<p>Das Kursmaterial besteht hauptsächlich aus Videos. Zudem gibt es ein einseitiges Hand-Out mit den wichtigsten Informationen sowie Fragebögen, die Ihnen helfen, Ihrem Stress auf die Spur zu kommen. Außerdem erhalten Sie eine Audio-Datei mit der Yoga Nidra-Übung, so dass Sie sie unabhängig vom Kurs überall hin mitnehmen können.</p>", 
    "end_date": null, 
    "title": "Stressmanagement mit Yoga Nidra", 
    "price": "25.00", 
    "instructors": "Britta Ollrogge", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841976_09be_2.jpg", 
    "course_url": "https://www.udemy.com/stressmanagement-yoga-nidra/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-07T11:01:30Z"
}