{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><em style=\"\">&quot;Important information with a number of tips on how to deal with the stress in your life. More importantly, the course helps you figure out just what it causing the stress in your life and then how to deal with it.&quot;</em><strong style=\"\"> -LaMont Forthun</strong></p><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><em style=\"\">&quot;I gave it a five stars b</em><em style=\"\">ecause it helped me deal with stress a lot better than I was handling it!&quot;</em> <strong style=\"\">-Laura Ivy</strong></p><p style=\"\"><strong style=\"\">Stress Management for Beginners</strong> is for everyone who has recurring frustration, anxiety, worry, and/or fatigue, along with confusion about how to handle it effectively. Life is constant stress and one would think we should have had a course like this required in our education prior to graduation from high school. Now you have a course to get you started in controlling your life ton YOUR terms.</p><p style=\"\">The course includes:</p><p style=\"\"><strong style=\"\">Training in Conscious Connected Breathing</strong> - a technique used throughout the course then anywhere you need it anytime without anyone knowing!</p><p style=\"\"><strong style=\"\">Take the Dallmann-Jones Stress Test</strong> - a scientific survey to accurately reveal where your stress is actually originating. </p><p style=\"\"><strong style=\"\">Develop New Mindsets </strong>that help you all the time.</p><p style=\"\"><strong style=\"\">Learn How to Control Your Stress and Your Life!</strong></p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">10 Stress Reducing Tips You Can Use Right Now!</strong></p><p style=\"\"><strong style=\"\">Stress Management for Beginners </strong>is 60 minutes long but the student is asked to pause several times to write some things down.</p><p style=\"\"><strong style=\"\">Stress Management for Beginners </strong>has over 30 lessons and ends with <em style=\"\">10 High-Powered Suggestions</em> for changing the stress-filled life. The end of the course features not only a quiz to see how well the content was learned but also a <em style=\"\"><strong style=\"\">Certificate of Completion </strong></em>of the course.</p><p style=\"\">Hundreds have paid over $300 to take Dr. Anthony Dallmann-Jones&#039; course and here it is for a very modest fee.</p>", 
    "end_date": null, 
    "title": "Stress Management in Just 60 Minutes!", 
    "price": "20.00", 
    "instructors": "Dr. Anthony Dallmann-Jones", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522494_4536_2.jpg", 
    "course_url": "https://www.udemy.com/stress-management-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-07T12:26:50Z"
}