{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Is stress negatively impacting your life?  Are you looking for a proven stress management program that reduces your stress and anxiety in natural ways?  </strong>You are in the right place because this <strong>online course</strong> by Empowerment Expert Louise Anne Maurice was created for you.</p>\n\n<p><strong>Stress Management Now: Reduce Stress and Anxiety Enjoy Life is for you if: </strong></p>\n\n<ul><li>You are overwhelmed by stress and want natural ways to deal with stress</li><li>You are looking for a proven stress management program that gets to the root cause of stress</li><li>You are overwhelmed with anxiety and want natural ways to relieve anxiety</li><li>You are looking for ways to balance your work and life so you enjoy life more</li></ul>\n\n<p>************************************************************************************************************</p>\n\n<p>Self empowered stress management program shows you how to go from stressed to success so you can love your work and life </p>\n\n<p>Today you will feel more in control of your stress and anxiety.</p>\n\n<p>Tomorrow you will get into action because the course gives you an incentive for applying what you learned.</p>\n\n<p>Next week things start to happen because you have a plan in the right order that guides you step-by-step.</p>\n\n<p>*****************************************************************************************************************</p>\n\n<p><strong>How will </strong><strong>Stress Management Now: Reduce Stress and Anxiety Enjoy Life</strong><strong> Benefit You?</strong></p>\n\n<p>I know you are busy and I have meticulously created this course with your success in mind. This training is no-fluff essential information you need to reduce stress and anxiety easily and quickly.</p>\n\n<p>Let me show you exactly how to manage stress by giving you a stress management plan like no other.</p>\n\n<p>You get insights and step-by-step instruction that show you how to reduce stress and anxiety and enjoy life sooner rather than later.</p>\n\n<p>You get the inside track on what you need to do plus the exact plan to make it happen in the right order.</p>\n\n<p>If that's something you would like to achieve, you have selected the right course to take. If you complete this entire course and implement everything you learn you will have a good solid foundation to build upon.</p>\n\n<p>Remember, it doesn't matter what stage you are at, I can show you how to reduce stress and anxiety and enjoy life.</p>\n\n<p><strong>When Can You Take </strong><strong>Stress Management Now: Reduce Stress and Anxiety Enjoy Life</strong><strong>?</strong></p>\n\n<p>What are you waiting for? If you’re looking for a course to show you how to manage stress now plus reduce stress and anxiety so you can life a fuller richer life, then look no further.</p>\n\n<p>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</p>\n\n<p>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; NO COST TO YOU.</p>\n\n<p>Click on the <strong>\"Start Learning Now\"</strong> button and start learning instantly</p>\n\n<p>****************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "Stress Management Now: Reduce Stress and Anxiety Enjoy Life ", 
    "price": 0, 
    "instructors": "Louise Anne Maurice", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691496_3ce4_2.jpg", 
    "course_url": "https://www.udemy.com/stress-management-now-reduce-stress-and-anxiety-enjoy-life/", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T22:20:11Z"
}