{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you in control of stress or does stress control you?  Do you believe work life balance is an illusion?  Well you are in the right place! <strong>Course updated March 28, 2016.</strong></p>\n\n<p><strong>Stress Management Mastery: Work Life Balance Bliss in 7 Days is for you if:</strong></p>\n\n<ul>  <li>You struggle with competing stress inducing      priorities and you      feel less than good enough at any of them which is impacting you in every      area of your life</li>  <li>You work in a career or business that demands more of      your \"after-work\" time and you fear saying no or setting      boundaries because you need the income</li>  <li>You are living a chaotic stress-filled life just to      stay one step ahead</li>  <li>You can’t remember the last time you enjoyed going to      work and it’s impacting your home life</li>  <li>You started a business to have more freedom but you      have less time and more stress</li>  <li>You secretly just want to escape to an island where no      one can find you</li> </ul>\n\n<p>******************************************************************************************************************</p>\n\n<p><strong>Why Join Stress Management Mastery: Work Life Balance Bliss in 7 Days?</strong></p>\n\n<p>This is why you are here because you want to finally master stress so you can live a successful life and be your best without burning out!     </p>\n\n<p>You want to be a high achiever and experience your full potential in your career or business but not at the cost of losing your children, spouse or health.  </p>\n\n<p>Now keep this in mind. Every piece of advice, strategy and logical approach to stress management mastery and work life balance bliss has been tested; none of this is theory.</p>\n\n<p>In fact, this comprehensive course is step-by-step and gives you 2 stress management plans; one 7 day quick-fix power program and one 30 day advanced program.  </p>\n\n<p>You discover exact stress management strategies that are easy and work so you stop wasting time and money doing the wrong things.</p>\n\n<p><strong>What is covered in Stress Management Mastery: Work Life Balance Bliss in 7 Days?</strong></p>\n\n<ol><li>Develop yourself into your personal and professional best without adding more stress</li><li>Learn a 7 day power program that equips you with simple yet effective daily stress management strategies</li><li>Feel more empowered and less anxious when walking into difficult stressful situations</li><li>Create a work life balance solution for your personal life, relationships, health, career/business, money, finances and life purpose.</li><li>Uncover your unique stress storm and build a work life balance step-by-step empowerment action plan</li><li>Be more respected as a career professional or business owner as you learn to be powerfully poised in stressful situations</li><li>Go from frazzled mind to peace-of-mind regardless of the stress and chaos that surrounds you.</li><li>Be a better parent because you will identify your top stress coping mechanisms and be guided through an eye-opening process that uncovers the underlying cause of your stress.</li><li>Feel less overwhelmed and be more productive because you learn to quickly identify the signs of stress and apply our one-of-a-kind stress reduction techniques so you relieve stress plus regain control in every area of your life</li><li>Experience more fulfilling relationships because you finish the course feeling more confident, more powerful with a greater ability to communicate.</li><li>Improve your self-esteem and confidence.</li><li>Become unstoppable in your personal and professional life with our \"rinse and repeat\" 30 day stress to success plan that is easy to follow and implement.</li></ol>\n\n<p>******************************************************************************************************************</p>\n\n<p><strong>How will Stress Management Mastery: Work Life Balance Bliss in 7 Days Benefit You?</strong></p>\n\n<p>Stress consumed me when I worked as a teacher and a financial professional.  But the feelings got worse when I became self-employed. <strong>I was so stressed-out</strong> feeling torn between so many competing commitments that it was affecting my health, my bank account and my happiness.</p>\n\n<p>I turned stress into success using the same strategies I share in this ground-breaking course<em>.</em></p>\n\n<p>I show you how to balance work and life and actually live with less-stress while becoming your best in every area of your life.</p>\n\n<p>The masculine approach to success doesn't work for women and men and in this course you discover my step-by-step approach I have used with personal coaching clients.</p>\n\n<p>When you finish the course you walk away with a simple 7 Day Work Life Balance Bliss Power Program that is easy to implement and gives you instant stress relief.  </p>\n\n<p>Plus you get my 30 Day Stressed to Success Advance Program. You walk away with a long-term personal and professional development strategy that empowers you to succeed in every area of your life the care-free relaxed way.  Now that is stress management mastery!</p>\n\n<p><strong>When Can You Take Stress Management Mastery: Work Life Balance Bliss in 7 Days?</strong></p>\n\n<p>What are you waiting for? If you’re looking for a course to learn how to balance work and life so you can live more, earn more and be more the stress-less easy way, then look no further.</p>\n\n<p>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</p>\n\n<p>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; NO EXTRA COST TO YOU.</p>\n\n<p>REMEMBER: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</p>\n\n<p>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</p>\n\n<p>Still not convinced? Make sure you watch some of the FREE PREVIEWS available to learn more about the course and more about me your instructor. Here is what a recent reviewer of the new updated course had to say:</p>\n\n<p><strong>Here is what people are saying about Stress Management Mastery: Work Life Balance Bliss in 7 Days created by Louise Anne Maurice of Womanly Wealth Academy: </strong></p>\n\n<p><strong><em>“Fun Stress Management Course - </em></strong><em>Louise has such great energy that you feel good just watching her lectures. The hands-on activities in the 7 day power program were so much fun – I felt instant stress relief and more alive. I plan on coming back many times just to go through the power program. I am working through the 30 day advanced program and look forward to using her “empower formula” so I show up differently in work and life. Excellent personal and professional development program as well!”</em></p>\n\n<p><em>***************************************************************************************************************</em></p>", 
    "end_date": null, 
    "title": "Stress Management Mastery Work Life Balance Bliss in 7Days  ", 
    "price": "20.00", 
    "instructors": "Womanly Wealth Academy, Louise Anne Maurice", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394452_13d8_17.jpg", 
    "course_url": "https://www.udemy.com/work-life-balance-empowerment-solution-for-women-in-business/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T23:21:31Z"
}