{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Wenn Sie Belastungen und Konflikte in Ihrem Berufsleben nicht befriedigend lösen, arbeiten Sie weniger produktiv, werden häufiger krank und wechseln eher Ihren Job. Stress ist damit nicht nur schlecht für Ihre Zufriedenheit und Gesundheit, sondern auch für die Leistungsfähigkeit Ihrer Organisation.</p>\n\n<p><strong class=\"redactor-inline-converted\">Worum geht’s?</strong></p>\n\n\n\n<p>Im Kurs „Stress erfolgreich managen“ finden wir gemeinsam Wege, wie Sie Belastungen im Berufsalltag erfolgreich bewältigen und das Stressmanagement Ihrer Organisation verbessern.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Nach diesem Kurs können Sie</strong></p>\n\n\n\n<ul><li>Belastungen frühzeitig erkennen und optimal bewältigen,</li><li>Ihre KollegInnen bei der Stressbewältigung unterstützen und</li><li>einen sensitiven Umgang mit Stress in Ihrer Organisation etablieren.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Wie funktioniert das?</strong></p>\n\n\n\n<p>Der Kurs besteht aus fünf Abschnitten mit insgesamt 29 Videolektionen, die Sie im Internet-Browser oder über die udemy-App in Ihrem eigenen Tempo absolvieren können. Manche Lektionen enthalten zusätzliches Material zum Herunterladen und Ausdrucken, um das Gelernte direkt anzuwenden.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Ist das was für mich?</strong></p>\n\n\n\n<p>Hier sind Sie richtig, wenn Sie als ArbeitnehmerIn Stress im Berufsalltag in den Griff kriegen wollen. Der Kurs gibt Ihnen hilfreiches Wissen und nützliche Werkzeuge an die Hand, um Belastungen optimal zu bewältigen und das Stressmanagement in Ihrer Organisation zu stärken.</p>\n\n\n\n<p>ArbeitgeberInnen, Personalverantwortlichen und Führungskräften hilft dieser Kurs dabei, konkrete Schritte auf dem Weg in ein stresssensitives und widerstandsfähiges Arbeitsumfeld kennenzulernen.</p>\n\n<p><strong class=\"redactor-inline-converted\">Was kommt alles dran?</strong></p>\n\n\n\n<p>Dieser Kurs ist in fünf Abschnitte aufgeteilt:</p>\n\n<ol><li><strong class=\"redactor-inline-converted\">Einführung:</strong> In diesem Abschnitt erhalten Sie einen Überblick über den Kurs, die Lernziele, den Aufbau und zusätzliche Materialen.</li><li><strong class=\"redactor-inline-converted\">Stress kennenlernen:</strong> In diesem Abschnitt schaffen wir die Grundlagen: Sie lernen Stress kennen, identifizieren Stressauslöser in Ihrem Berufsumfeld und beschäftigen sich mit Stressreaktionen und -folgen.</li><li><strong class=\"redactor-inline-converted\">Belastungen bewältigen:</strong> In diesem Abschnitt lernen Sie drei wichtige Schritte zur Stressbewältigung kennen: den Aufbau von Ressourcen, die Anwendung von Bewältigungsstrategien und die Evaluation der eigenen Stressbewältigung.</li><li><strong class=\"redactor-inline-converted\">Stress erfolgreich managen:</strong> In diesem Abschnitt geht es um den langfristig erfolgreichen Umgang mit Belastungen am Arbeitsplatz. Was können Sie selbst dafür tun – und an welchen Stellschrauben kann im Unternehmen gedreht werden?</li><li><strong>Abschluss:</strong> In diesem Abschnitt wiederholen wir noch einmal die wichtigsten Punkte, um das Gelernte zu festigen. Außerdem lernen Sie weitere Ressourcen und Angebote zum Thema Stressmanagement kennen.</li></ol>\n\n<p>Jeder Kursabschnitt beginnt mit einer Einführung, in der Sie einen Überblick über die Lerninhalte bekommen, und endet mit einer Zusammenfassung.</p>", 
    "end_date": null, 
    "title": "Stress erfolgreich managen", 
    "price": "35.00", 
    "instructors": "Patrik Frauzem", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/860876_966a_2.jpg", 
    "course_url": "https://www.udemy.com/stress-erfolgreich-managen/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-26T20:03:51Z"
}