{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The\nStressed to Success program consists of 27 videos and 3 manuals\n(Information, Tools and Training, Upgrading Your Life, and the\nWorkbook and Journal) plus additional training aids.  The program\nprovides very simple, yet very powerful tools, scientifically proven\nto clear your mind, calm your nerves, relax your body, and stop your\nsuffering quickly and easily no matter how stressful the situation. \nYou learn what stress is, how it affects you, why you react to\nstressful situations the way you do.  You also learn how powerful you\nare to change anything you want.  The tools can be learn in only a\nfew minutes and only require 30-60 seconds to perform.  If you\npractice the prescribed amount of time daily for an extended period\nyou can stop your suffering automatically with a single thought.</p><p>The\nStressed\nto Success program also guides you through simple life-enhancing\nupgrades intended to reduce the amount of stress you experience.</p><p>Videos\nare used to introduce and summarize the material for each lesson. \nYou will be directed in which manual and where to get more\ninformation to deepen your understanding of the concept.  Training of\nall tools and techniques are accomplished through the video and\nthrough descriptions and illustrations in your training manual.  \n</p><p>Because\neach human activity requires a very specific attentional focus that\nmay not be developed while practicing the activity and compromised\nwhen your under duress you are training how to direct your attention\nproperly for the task at hand and how to reactivate it when stress\nrears its ugly head.  No other program offers this kind of training. \nIt will help you be more successful in anything you do no matter how\ndemanding or stressful the activity.</p><p>Finally,\nyou will be directed to exercises in your Workbook and Journal to\nhelp identify what situations cause you stress and how it affects you\nphysically, attentionally,  emotionally, behaviorally, and\nphysiologically.  You will learn how stress affects can destroy your\nhealth, interfere with your ability to preform daily tasks, and\nreduce your quality of life.  You will monitor your progress in the\nJournal provided for your convenience.</p><p>Through\nthe Stressed to Success program you will experience improvements in\nyour health, performance, and quality of life.  You will experience\nless stress and learn to respond to challenging and aversive\nsituations that are beneficial instead of destructive.  Everything\nyou need to know you already have.  Let me show you how to Unleash\nthe Powers of Your Mind to live abundantly and stress-free.</p><p>The\nStressed to Success program is intended for anyone who experiences\nundue stress in their lives, athletes, performance artists, and\nbusiness professionals who want to perform better under duress, and\nstudents who do not perform up to their ability because of test\nanxiety.</p>", 
    "end_date": null, 
    "title": "Stressed to Success for Adults and Teens ", 
    "price": "20.00", 
    "instructors": "Anthony Piparo", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644814_81f0_3.jpg", 
    "course_url": "https://www.udemy.com/stressed-to-success/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T14:57:59Z"
}