{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>As an expert in human behavior, I'm regularly asked to give lectures or workshops on stress. It's increasingly an issue. This course was born out of dozens of interactive workshops that I led, where real people just like you sat down and created a personal action plan to help them deal with pressure and stress. It is packed with very concrete things anyone can do to help manage their stress levels. there are so many of them in this course, actually more than 40, as the title kinda gives away, So that you can find what works for you.<br></p>\n\n<p>In this course, everything is science based. For those of you familiar with my other courses, you will know that everything I bring forward is rooted in scientific studies. I won't suggest things just because I happen to like them, or think they are cool. As the former director of the institute of Neurocognitivism, I kinda pledged an oath to facts and truth...</p>\n\n\n\n<p>But don't worry, this course isn't about cold facts and figures either. I'm not a scientist myself. I'm a communicator. I'm into edutainment. I enjoy bringing complex and sometimes difficult material in a fun and engaging way. So you're supposed to enjoy this...</p>\n\n\n\n<p>So what we're going to see in this course is the following</p>\n\n\n\n<ul><li>First we will analyze stress. where it comes from, what it does, the different types of stress, etc</li><li>After that, we will go over the 4 different types of dealing with stress. I call them 'relief strategies' For each of them I will give 10 concrete examples of what you can do to activate the benefits of that strategy.</li></ul>\n\n\n\n<p>So 10 examples for 4 strategies: that's 40 ways to deal with stress.</p>\n\n\n\n<p>But it doesn't end here. you are highly encouraged to leave your own ideas and examples for each of the strategies, so that this course, just as the workshops I lead, become a co-creation where you help define the final outcome of the course. You will be responsible for the “<em>+</em>\", in the “<em>40+ easy ways to deal with stress</em>\".</p>", 
    "end_date": null, 
    "title": "Stress Management: 40+ easy ways to deal with stress", 
    "price": "20.00", 
    "instructors": "Gregory Caremans", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466736_d5f4_3.jpg", 
    "course_url": "https://www.udemy.com/stress-management-40-easy-ways-to-deal-with-stress/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T16:21:39Z"
}