{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong><em>WARNING: Drugs, Meditation and Exercise will not fix your Stress!</em></strong>  </p>\n\n<p>  \t          You’ve probably tried many different ways to bust your stress. The thing is that drugs, meditation and increased exercise can help you reduce the SYMPTOMS but they don’t deal with the CAUSE of Stress at all so, it just keeps coming back.  </p>\n\n<p><strong><em>I know how it feels</em></strong><br></p>\n\n<p>  \t          As a creative myself, I was the biggest Stress Bunny you’d ever seen.  </p>\n\n<p>  \t          I spent most of my life running from one place to the next on a full and exhausting schedule.  </p>\n\n<p>  \t          My body was struggling. My nervous system was a wreck. I felt uptight and on guard every waking minute. I couldn’t sleep well at night and would frequently end up collapsed into bed for a few days at a time costing me precious time and lost jobs.  </p>\n\n<p>  \t          Then, being the tough nut that I was, I would get back up and do it all again. Just stupid!  </p>\n\n<p>  \t          I had massages, got plenty of exercise, was recommended this pill and that pill from well intentioned health professionals. It might help for a short while but never got to the crux of the matter.  </p>\n\n<p>  \t          I was afraid to admit I was falling apart in case I didn’t look tough enough. No one wants to hear you’re not coping. If you show any signs of weakness people step away like you have the plague. Or they give you less opportunities and side line your efforts.  </p>\n\n<p>  \t          So I felt very isolated and lonely in trying to solve Stress while struggling to build my career. The two seemed to beat against each other making life hard all the time.  </p>\n\n<p>  \t<strong><em>Enough is enough!</em></strong>  </p>\n\n<p>  \t          The day came when I ended up so sick I was told I had to do something fast or I could expect some sort heart failure before my mid-forties.  </p>\n\n<p>  \t          That’s when I decided to do a complete overhaul of my life.  </p>\n\n<p>  \t          I wanted to analyze how I’d lived up till that point in all areas of life and how I wanted to live differently from here on.  </p>\n\n<p>  \t          That’s when I really started looking more deeply at stress as something I no longer had to live with. This was something I could manage a whole lot differently than I was before.  </p>\n\n<p>  \t          So I researched intensely using a wide variety of resources from scientific and medical knowledge through to self development and spirituality, extracting the most powerful tips I could find and then developing them further to create a new collection of knowledge that would make a difference for people unlike anything they’d come across before.  </p>\n\n<p>  \t<strong><em>You can have what I have</em></strong>  </p>\n\n<p>  \t          This Stress Management course gives you access to the best of that knowledge. Some will be a reminder of what you already know. Some will be new to you.</p><p>This is a comprehensive program covering the major aspects that will penetrate the problem, flush out the nasty causes, leave you refreshed and feeling easy breezy about your work and life again.  </p>\n\n<ul>  \t<li>You'll cope better with challenges that put other people under pressure </li><li>Your body automatically becomes healthier, your mood more positive.</li>  \t<li>Your work is more productive.</li>  \t<li>Other people will find you easier to get along with.</li>  \t<li>You'll start to draw in other positive people and great opportunities which makes life even more fun and inspiring.</li>  \t<li>The more you enjoy yourself, the better you do at work.</li>  \t<li>The better you do at work the more customers and management value you.</li>  \t<li>The more you feel valued the more enjoy yourself.</li>  </ul>\n\n<p>  \t          No longer a vicious cycle downwards but a rather delicious cycle upwards instead!  </p>\n\n<p><strong><em>What have my clients said about me and my course?</em></strong><br></p>\n\n<p>  \t          “So far my \"spirits\" have been lifted through out my everyday life because of this course. Thanks for making this course because it is the first thing that has worked for me.”  </p>\n\n<p>  \t         “A ground breaking new way to teach staff about Stress Management... Highly recommended.”  </p>\n\n<p>  \t          “I can recommend that with Annabelle employed on the job, you can relax knowing that you are in safe hands”  </p>\n\n<p>  \t          “...here we are with a greatly expanded flow of work and I'm happier, more focused, balanced and at peace.”  </p>\n\n<p>  \t        “Thank you Annabelle. It was such a delight to listen to your lectures. I loved your sense of humor and your approach to life. I definitely have implemented some of your tips.”  </p>\n\n<p>  \t          “High quality content but a lot of fun too.”  </p>\n\n<p>  \t          “Kitegirl has a great knack of communicating deep learning with a light hearted approach.”  </p>\n\n<p>  \t<strong><em>What are you going to get?</em></strong>  </p>\n\n<p>  \t          This corporate quality course is usually presented live as a 10 hour x 2 day workshop. You can do the whole thing at once if you like. I know you’re busy though, so I’ve condensed it down into lessons of around 60-90 minutes you can do once a week for 5 weeks.  </p>\n\n<p>  \t          Even doing a 30-45 minute piece at a time you’ll learn something powerful from every lesson.  </p>\n\n<p>Aside from my own researched tools and processes I’ve included 5 superb interviews with other industry experts to give you the very latest cutting edge information on improving sleep, fitting exercise into busy days, attacking the never ending To Do List, getting grounded quickly, having your day more organized and reducing Professional Burnout Syndrome in the workplace.<br></p>\n\n<p>  \t          There are bonuses and recommendations for further reading on each topic.  </p>\n\n<p>  \t          Each Section has a downloadable set of workbook sheets where you can write notes and work through your own challenges using my exercises.  </p><p>I AM AVAILABLE to answer your questions on here or on the Facebook page.</p>\n\n<p>  \t          The course will be of little use if you just run through the whole thing and then don’t change what you’re doing. So, each Section offers some “challenges” (I never liked the word “homework”) to do between lessons. This will help you deepen your understanding and implement what you’ve learnt.  </p>\n\n<p>PLUS Udemy provide you with a 30 day Money Back Guarantee if you find the course doesn’t give you what you want.<br></p>\n\n<p>  \t<strong><em>What are you waiting for?</em></strong>  </p>\n\n<p>  \t          Sure you could do the 5 years study I did to find all this information yourself but, be honest with yourself. <strong>How long have you been trying to solve this?</strong>  </p>\n\n<p>  \t          If you’re on this page I figure you haven’t previously found the answers you need and you’re still struggling with the same issues over and over.  </p>\n\n<p>  \t          You don’t have to go through with that any more.  </p>\n\n<p>  \t          I can tell you from personal experience and from that of my clients, that getting stress down to a manageable state is LIFE CHANGING.  </p>\n\n<p>Think about it.<strong> Stress affects every area of your life.</strong><br></p>\n\n<p>  \t          I’ve helped a lot of people with these skills and I want to help you too so you can start reducing your stress from TODAY.  </p>\n\n<p>I’ll see you inside!<br></p>\n\n<p>  \t          Kitegirl Annabelle Drumm  </p>\n\n<p>  \t<em>        PS - This is THE complete training toolkit you can reach into whenever you need in your own time. I’m here as your personal Coach by your side to answer questions all the way.</em>  </p>\n\n<p>  \t<em>        PPS - Don’t leave this page and keep doing what you’re doing! You’ll only get the same result as before. Let’s bust this Stress together!</em>  </p>", 
    "end_date": null, 
    "title": "Stress management", 
    "price": "50.00", 
    "instructors": "Annabelle Drumm", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67822_708d_6.jpg", 
    "course_url": "https://www.udemy.com/stress-management-kitegirl/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-22T03:28:35Z"
}