{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you suffer from stress at home or at work? Do stressful, high-pressure situations seem to always be part of your life? Do you feel that you are not getting enough sleep, proper nutrition and exercise because of stress?</p><p>You are not alone. <br></p><p>  <strong>According to the American Institute of Stress Management in Yonkers, 75%-90% of all visits to primary care physicians are for stress related complaints or disorders. </strong><br></p><p>Learn how to overcome stressful situations in seconds. <em>STOP the stress that leaves you constantly rushed, pressured, frustrated, and frazzled day in and day out.</em> </p>When you skillfully learn to handle your stress your quality of life \"goes up.\"<span></span><p><em><strong><br>Stress Management Secrets: The Unique Stress Relief System That Works For YOU\t</strong></em></p><p><strong></strong><em>Stress Management Secrets </em><strong></strong>is \ndesigned to give you instant, simple, and powerful tools to help you \nnaturally eliminate stressful feelings as they surface. Learn how to manage your personal stress triggers and responses so that you live a stress free life! </p><p>You start from scratch. It's a full, complete and incredibly easy step-by-step system. All you need to do is log-in, watch, implement and see your stress disappear!</p><p><strong>Click the \"Take this course\" button NOW, enroll and start living a stress-free life!</strong><br></p>", 
    "end_date": null, 
    "title": "Stress Management Secrets: The Guide To A Stress Free Life", 
    "price": "30.00", 
    "instructors": "Corina Tudose-Angelova", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630404_94d4_2.jpg", 
    "course_url": "https://www.udemy.com/stress-management-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T14:33:45Z"
}