{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>HI, I&#039;m Laura Dewey and… </p><p><strong style=\"\">I&#039;m a Coach and a reformed stress monster!</strong></p><p>You probably clicked on this course because you&#039;re stressed out and looking for relief. </p><p>Maybe you&#039;re:</p> <ul style=\"\"><li>Worrying day and night</li><li>Overwhelmed with the enormity of your to-do list</li><li>Feeling like your life and thoughts are in a cycle-from-hell</li><li>Having chest pains or other symptoms of stress</li><li>Self-medicating with alcohol, drugs or other destructive behavior</li><li>Gaining weight from eating emotionally</li><li>Exhausted…all the time…with no relief in sight</li></ul> <p><strong style=\"\">I get that. I really do. I lived it--for far too long.</strong></p><p style=\"\">You see, the symptoms listed above were MY symptoms. Maybe you&#039;re here because you&#039;re feeling the same way. </p><p style=\"\">I was first told that I had an issue with stress after an EKG at the ripe old age of 23. I thought...stress? Not me. Upon reflection I realized it was me. Big time.</p><p style=\"\">So what did I do? I drank. It seemed like a good idea at the time. Little did I know that it was actually exacerbating my stress; my &quot;strategy&quot; was making my life even harder to cope with. </p><p style=\"\">I also set out to learn all I could about managing my stress. Everything I found was about mitigating the symptoms of stress once I was already experiencing them.</p><p>It wasn&#039;t until I got my Master&#039;s in Spiritual Psychology over twenty years later that I truly understood the source of stress and how to AVOID inviting it into my life in the first place. These are the life-changing tools I&#039;m here to teach you today. That coursework completely transformed my relationship with stress. And now…</p><p><strong style=\"\">I want to completely transform YOUR relationship with stress!</strong></p><p>Imagine what&#039;s possible for you if you have remarkably less stress in your life…</p> <ul style=\"\"><li>Better relationships with colleagues, friends and family</li><li>The ability to focus and really get things done</li><li>Quality sleep </li><li>Energy. Energy to pursue what you need to, but also what you want to!</li><li>Clear-headed thinking</li><li>The ability to be okay no matter what&#039;s happening around you</li><li>Radiant physical health</li><li>An upbeat, even-keeled mood</li><li>Real joy, from the inside out</li></ul> <p><strong style=\"\">And surprisingly, this is not difficult!</strong></p><p><strong style=\"\">What are you going to get?</strong></p><p>In this course, you&#039;ll learn about stress: what it is and its physical, mental and emotional effects. You&#039;ll also learn how to manage symptoms to gain relief. That&#039;s all fine and good. But for me? That&#039;s not what this course is all about…</p><p>This course is about learning a way to AVOID stress in the first place…</p><p>I&#039;ll walk you through a new way of processing potential stress in a very clear, step-by-step way. THAT&#039;s what this course is really about.</p><p>You will be able to engage in the coursework through a series of interactive quizzes and a downloadable pdf workbook filled with exercises and activities.</p><p>Then you&#039;ll have the opportunity to practice your new skills using a real-life situation that recently stressed you out. Right then and there, you&#039;ll know if this has the power to work for you or not.</p><p>Lastly, I&#039;ll ask you to report back after I send you out into your world to practice among the people, places and things that have stressed you out in the past. You&#039;ll have living proof whether your new skills work for you in the real world. </p><p>And remember, Udemy offers a 30-Day Money Back Guarantee if, for whatever reason, you don&#039;t get what you want from this course. There is absolutely nothing to loose.</p><p><strong style=\"\">What are you waiting for?</strong></p><p>One sitting--two hours--to completely transform your life. Does it sound too good to be true? You be the judge. I can just tell you that I&#039;m living proof that these techniques work. I used to be a stress monster…now I couldn&#039;t be further from it. If I can do it, you can do it.</p><p><strong style=\"\">“Insanity: D</strong><strong style=\"\">oing the same thing over and over again and expecting different results.&quot;</strong>                                                                                                                           –Albert Einstein Stop the insanity. Try something new. </p> Click <strong style=\"\">TAKE THIS COURSE</strong> at the top of this page and <strong style=\"\">ENROLL in STRESS LESS today!</strong>", 
    "end_date": null, 
    "title": "Stress Less", 
    "price": "25.00", 
    "instructors": "Laura Dewey M.A.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437004_f392_3.jpg", 
    "course_url": "https://www.udemy.com/stress-less/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T22:21:31Z"
}