{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*** COURSE FULLY UPDATED FOR JANUARY 2016 ***</strong><span><br></span><br>In this course you will learn how you can reduce stress and anxiety with ease.<br><br>Let me ask you something:</p><ul>\n<li>Have you recently snapped at someone over something small, like not doing the dishes?</li>\n<li>Do you often feel tired, nervous or even anxious? </li>\n<li>Or do you worry a lot and have trouble falling asleep?</li>\n</ul><p><br></p><p>If you answer one or more of these questions with <strong>yes</strong>, then it is likely that you have been under too much stress for too long. Also, chances are that you are not taking adequate measures to reduce this stress. </p><p>Then <strong>this</strong> is the course for you!</p><p>This course is for anyone who wants to get rid of their stress symptoms once and for all, quick and easy.</p><p>What will we cover in this course? You will learn: </p><ul>\n<li>the <strong>purpose</strong> of stress.<strong> </strong></li>\n<li>the nuts and bolts of the <strong>stress response</strong>.</li>\n<li><strong>how doing yoga reliefs stress</strong>, a fact which is backed up by numerous scientific studies. </li>\n<li>And the heart of this course: <strong>ten simple yoga exercises</strong> that <strong>you</strong> can do <strong>today</strong> to reduce the stress symptoms in your life big time!</li>\n</ul><p><br></p><p>The exercises you will learn in this course are easy. You do not need to be flexible and you do not need to have any prior yoga experience: this course is suitable for all levels!</p><p>The focus is on learning how to relax. People that experience a lot of stress are often not able to fully relax their body anymore. Even when they think they are relaxing, they still hold on to tension. </p><p>The purpose of the exercises in this course is to restore the connection between your body and your mind. If you practice these exercises on a <strong>regular</strong> basis, I <strong>promise</strong> you that you will start feeling the beneficial effects <strong>immediately</strong>!</p><p>So don’t wait any longer and join me now in this course. Scroll up and Ccick on the <strong>Take This Course</strong> button on the right. Let’s get started. I will see you inside!</p>", 
    "end_date": null, 
    "title": "Stress and Anxiety Free Now With Yoga: Quick and Easy", 
    "price": "25.00", 
    "instructors": "Peter Cook", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587446_23f2_4.jpg", 
    "course_url": "https://www.udemy.com/quick-and-easy-be-stress-and-anxiety-free-now/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T15:10:16Z"
}