{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Do you wake up in the morning exhausted, in desperate need of coffee? Do little things like missing the train or someone talking too loud on their cell phone annoy the HECK out of you? By the end of the day are you jonesing for a glass of wine to cool you out?</p> <p style=\"\">If you answered yes to any of these questions (or all of them) then you may not be managing your stress optimally. Keep on reading...we&#039;re here to help.</p> <p style=\"\">This hands-on course in managing stress will help you understand the five categories of stress, the difference between good stress and bad stress and how stress impacts overall health. Using principles of mindfulness, a personal Stress Assessment Test to evaluate your levels of stress and a Stress Solutions Worksheet that can be applied to any situation, we give you a framework and the tools for managing and reducing both everyday and long-term stressors to make your life more workable, enjoyable and satisfying.</p><p style=\"\"><strong style=\"\">Why we created this class</strong></p><p style=\"\">How many times have you heard the expression stress will kill you? These days, it seems like everyone&#039;s stressed out! So what&#039;s the answer for how to reduce and/or manage stress? Exercise? Meditation? Unplugging? Prayer? These are all great short-term strategies for coping with stress but none of these practices will work long-term if you don&#039;t address the underlying root causes.</p><p style=\"\">We&#039;re not yogis, monks or zen masters. We&#039;ve dabbled in everything from Crossfit and veganism, to boxing and psychotherapy to deal with life&#039;s curveballs but with each new endeavor, it seemed like there was something else cropping up. That&#039;s because to manage stress, you need to go deeper than the distraction. Let us explain...</p><p style=\"\">If you hate your job, you can exercise all you want but you&#039;re still going to wake up dreading the day ahead. Similarly, if your stomach is upset every morning, you can take antacids to relieve the bloating and diarrhea but if you have an underlying food sensitivity, the problem will never go away with antacids alone.</p>This course helps you take a big picture view at the areas of your life that cause you the most amount of pain, identify with more specificity what those stressors are, use new tools to apply short-term solutions and establish long-term strategies to eliminate and reduce stress to make your life more workable, enjoyable and satisfying. The class is broken down into easy to follow video modules, self-assessment tests, worksheets and includes PDF versions of the slides.<p style=\"\"><strong style=\"\"><em style=\"\"></em></strong></p><p style=\"\"><strong style=\"\"><em style=\"\">Remember that the </em><strong style=\"\"><em style=\"\">statements in this course are not intended to diagnose, treat, cure or prevent any disease. The recommendations herein are not intended to replace an individual relationship with a qualified healthcare professional and should not be construed as medical advice.</em></strong></strong></p><p style=\"\">We will respond to any questions you may have as you go through the course. Sign up now and we&#039;ll see you soon! </p><p style=\"\">Emily &amp; Justin Waiser</p>", 
    "end_date": null, 
    "title": "Stress 180 - Transform Your Stress and Win at Life and Work", 
    "price": "20.00", 
    "instructors": "Emily Waiser, Justin Waiser", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474322_bf04_2.jpg", 
    "course_url": "https://www.udemy.com/stress-180/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T19:37:27Z"
}