{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>What if you woke up each morning energised and recharged?</li></ul><ul><li>What if you went to bed happy, relaxed &amp; satisfied?<span></span></li></ul><ul><li>What if being happy &amp; well was the most important lesson you could teach?</li></ul><ul><li>What if you were a shining example of vibrant health &amp; positivity in your classroom?</li></ul><ul><li><span></span>What if your being well, meant your students would learn with ease?</li></ul><p><br></p><p>Our mission is to help you not just survive teaching but thrive and flourish, so you can create the life you’d love.  <strong>Being a teacher is the best job in the world!</strong>  And it also a highly pressured and (potentially) emotionally draining role.  If you don't manage your stressors, you could easily burn out or worse!</p><p>Student wellbeing and stress management is becoming a more recognised intervention for students - and this is great!  But what about the teachers?  We are passionate about supporting teachers to be their best selves, so students are inspired to mirror you.</p><p>Kathryn says: </p><ul><li><strong>I remind teachers they are AMAZING!  </strong></li><li><strong>I show Teachers how to feel AMAZING!</strong></li><li><strong>I help Teachers sustain their AMAZINGNESS!!!        (forgive the grammar...)</strong></li></ul><p><br></p><p>Kathryn Lovewell, speaker, trainer and best selling author of <em>Every Teacher Matters : Inspiring Wellbeing through Mindfulness, </em>has created this introductory wellbeing programme for you.  Teacher Wellbeing Made Easy has been designed especially for you.</p><p>Kathryn qualified as a secondary school teacher in the 1990s and has been training teachers and students in emotional health and wellbeing tools since 2007.  She experienced physical burn out after just one year of teaching (read page 57 of her book for the full story) and ended up in hospital; missing the long awaited summer holidays and months after rehabilitating.    Whilst this experience was incredibly demanding on her body, which is still not 100%, her spirit and love of teaching remains strong.  This is not the case with many teachers who she has trained over the years. Her hope is that she every teacher is happy and healthy for life.<br></p><p>Join Kathryn today as she guides you through <em><strong>Teacher Wellbeing Made Easy</strong></em>. </p><p>What if prioritising your health and wellbeing was easy? </p><p>Take the first step today and say yes to being the best you, you can be!<br></p><p><span></span></p>", 
    "end_date": null, 
    "title": "Teacher Wellbeing Made Easy", 
    "price": "30.00", 
    "instructors": "The Teacher Sanctuary", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692942_4fc1_2.jpg", 
    "course_url": "https://www.udemy.com/teacher-wellbeing-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T12:29:18Z"
}