{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4><strong class=\"redactor-inline-converted\">Live Your Life Free From Stress, Worry and Anxiety</strong></h4>\n\n<p>The Redirect Anxiety Habit Course is a video series that will help you to get rid of stress, worry and anxiety - so you can enjoy breathing the fresh air of a new chapter in your life.</p>\n\n\n\n<p>I use videos filled with examples, analogies and simple language - so that you can absorb every minute of it.<br></p>\n\n\n\n<p>I've used the habits that I teach in this course myself, and they work. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Don't let anxiety get in the way of enjoying life.</strong></h4>\n\n\n\n<p>You can enjoy a life free from anxiety, but you can't do it through sheer willpower alone. You need to learn how.It can feel like you're all alone. Like you can't breathe, and the world is closing in around you. You ask yourself, why me? Can somebody help me? Am I having a heart attack? is there anything I can do to stop this?</p>\n\n\n\n<p>Living with anxiety isn't easy. Sometimes, it can feel like you are completely losing your mind. And it doesn't help that everybody around you treats you like you are losing you mind. The looks you get, that seem to say:</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>\"Why don't you just calm down? Stop making such a big deal out of everything!\"</em></strong></p>\n\n\n\n<p>If only it were that easy. But it doesn't work. You can try to calm down until you're blue in the face, but it's just going to make it worse. Why doesn't anybody else see that?</p>\n\n\n\n<p>You end up avoiding everything that might cause anxiety, just to avoid any sliver of a chance that your anxiety might kick into full speed again. And if it does, you know there is little to stop it - aside from perhaps another pill. They might help, but you know you don't want to end up taking pills every day. Then you know that you'll really<em class=\"redactor-inline-converted\"> </em>feel crazy!</p>\n\n\n\n\n\n<h4><strong class=\"redactor-inline-converted\">So what can you do?</strong></h4>\n\n\n\n<p>Anxiety affects 18% of the US population, and it is not slowing down. Anxiety destroys relationships, careers and the ability to enjoy life. Anxiety can get better, but it can also get worse.</p>\n\n\n\n<p>Unfortunately, just wanting to get better isn’t enough. Anxiety can’t be cured by sheer willpower alone. Redirecting anxiety is a skill that needs to be learned, like when you learn a language. You can't learn a new language without lessons.</p>\n\n\n\n<p>There’s no need to struggle through life with anxiety, or try to use willpower alone to overcome it.</p>\n\n\n\n<p>Since the onset of Magnetic Resonance Imaging (MRI) machines, our understanding of how the brain works has multiplied exponentially over the past decade. Unfortunately, most of this knowledge hasn’t made it to the general public to be put to good use.</p>\n\n\n\n<p>To live a life free from anxiety and panic attacks, you need a complete, 3-dimensional set of lessons. That's what this course is. By going through this course, you get:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>A guide to the unique SPICE method: A step-by-step method for overcoming anxiety attacks</li><li>A simple psychological trick (the 'C' in the 'SPICE' method) that is far more effective treating panic attacks than simply trying to 'calm down'</li><li>An understanding of what exactly anxiety is, so that, when anxiety isn’t a mystery to you, you can take control of your own mind</li><li>Steps you can take to develop body and mind health, to support both in overcoming anxiety</li><li>A complete, practical guide to habits that you can bring into your daily life to reduce anxiety every day - and eventually eliminate anxiety as a factor in your life completely!</li><li>And, if anxiety ever does return, you'll have the knowledge you need to handle it with confidence</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<h4><strong>By joining this course, you will gain access to:</strong></h4>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>All 26 course videos (A total of over 2 hours), developed exclusively for this course</li><li>All extra course material, exercises and chapter summaries</li><li>The Redirect Anxiety community, where you have a chance to discuss any topic on the course discussion boards</li><li>A trusted support channel, where you can email me any time and expect a considerate and well-thought out reply</li><li>Permanent access to all of these materials, for life. You can revisit this content anytime to keep integrating these habits into your life</li><li>And much more</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I created this course from a passion for helping those who have anxiety. From a young age, I’ve had a insatiable interest for psychology and discovering exactly how the mind works.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This passion translated into following the latest research into neuroscience, at a time when there has been an explosion of research into this field. As I found anxiety in my family, I started to see how this research could help overcome anxiety.</p>\n\n\n\n<p>My wife and I both have experience with anxiety. Through the tools I teach in this course, my wife and I now live a life completely free from anxiety and panic attacks, and, if anxiety does return, we know how to deal with it.</p>\n\n\n\n<p>Anxiety is debilitating, it can keep you from all of this - and will continue to keep you walled off from the life you want to live, unless you learn how to overcome it.</p>\n\n\n\n<p>The habits I teach have been tested, and are proven to work. Time and time again, those who have taken this course have proven that the results I’m talking about are possible.</p>", 
    "end_date": null, 
    "title": "The Redirect Anxiety Boot Camp: Get Rid of Stress and Worry", 
    "price": "25.00", 
    "instructors": "Keith Parker", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/849022_11e8.jpg", 
    "course_url": "https://www.udemy.com/redirectanxiety/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T13:56:01Z"
}