{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>532 students in the first three weeks! .........</p><p>8 five star reviews!<br></p><p>The Joy of less, a step by step guide to simplifying and de-cluttering your life and environment is over three hours of video that explains, details and clarifies how to purge and de-clutter your space. Whats more, this course will give you the ability to simplify your life from the inside out, de-cutter your soul and live with emotional simplicity.</p><p>The course is designed for those that are tired of the stress filled, cluttered existence that most of us have allowed to envelope our lives.</p><p>With 18 videos over 3 modules and a part 2 that delves into the emotional and spiritual side of living simpler, this is a comprehensive study about creating a life of joy, simplicity and abundance. It will give you detailed, down to earth strategies and  instructions on how to purge your living space of all the useless, unwanted, unused \"Stuff\" that accumulates in the corners of our lives and begins to clog the arteries of our reality</p><p>You should take this course if you have even a hunch that your \"Stuff\" is creating stress in your life and tangling your relationships. Or If you'd just like to clear a space for yourself and begin to be able to breathe again.</p><p>Do you really need all that stuff? why not find out the best way to tackle a major purge project and remove it once and for all from your life? you'll be amazed at the clarity, openness and simple joy that will result. <br></p><p><br></p>", 
    "end_date": null, 
    "title": "The Joy of Less - step by step guide to a clutter free life", 
    "price": "20.00", 
    "instructors": "Cary Richards", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676828_840c.jpg", 
    "course_url": "https://www.udemy.com/the-joy-of-less-less-stuff-equals-more-happiness/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T22:16:05Z"
}