{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">¡SE TU MEJOR TÚ! ¡AYUDA A OTROS A SERLO!</strong><br style=\"\">  </p>    <p style=\"\">Completo Curso Multimedia&nbsp; Online con:<br style=\"\">  </p>    <ul style=\"\">  \t<li style=\"\">Más <strong style=\"\">45 Video-Lecciones</strong>&nbsp; <strong style=\"\">y 14,5 horas</strong> <strong style=\"\">de Contenido</strong><br style=\"\"></li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">5 Ebooks en PDF (246 páginas) con Ejercicios</strong>, para todos los módulos del curso</li></ul><ul style=\"\"><li style=\"\">Completo<strong style=\"\"> Plan de Acción de Transformación del Estrés en 21 Días</strong>: Listas de Comprobación (Check-Lists), Recursos y Enlaces Adicionales.<br style=\"\"></li></ul><ul style=\"\">  </ul>  <ul style=\"\"></ul><p style=\"\">Este <strong style=\"\">Curso Online en Técnicas Mente-Cuerpo de Transformación del Estrés</strong>,es una versión abreviada de mi &quot;Curso Online en Gestión y Transformación del Estrés&quot; que puedes ver aquí: <a href=\"http://www.transformaciondelestres.net\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">www.transformaciondelestres.net</a> </p><p style=\"\"> Este curso ha sido cuidadosamente desarrollado y preparado personalmente por mí en&nbsp;<a href=\"http://www.liderazgopositivo.com\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">+Lead-Map (c)</a>&nbsp;&nbsp;durante los tres últimos años y es justo lo que estás buscando si Quieres:</p>    <ul style=\"\">  \t<li style=\"\">Sentirte, fácil y naturalmente, <strong style=\"\">más relajad@ y tranquil@</strong></li>  \t<li style=\"\">Experimentar <strong style=\"\">mayor seguridad y confianza ante tus retos</strong></li>  \t<li style=\"\">Disponer de <strong style=\"\">más energía y auto-motivación para lograr tus metas</strong></li>  \t<li style=\"\">Disfrutar de una <strong style=\"\">mayor capacidad de concentración, aprendizaje y creatividad en tu trabajo o estudios</strong></li>  \t<li style=\"\">Encontrarte mejor y<strong style=\"\"> disfrutar de un mayor bienestar personal y mejores relaciones con los demás</strong></li>  </ul>  <p style=\"\"><span style=\"\"><strong style=\"\">AHORA, TODO ESTO ESTÁ A TU ALCANCE</strong></span></p>    <p style=\"\"><span style=\"\">Mira&nbsp;</span><a href=\"http://www.transformaciondelestres.net/testimonios\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">aquí</a>&nbsp;&nbsp;<span style=\"\">lo que opinan algunos de los miembros del Curso Online en Gestión del Estrés<br style=\"\"></span></p><p style=\"\"><strong style=\"\">&gt;&gt; PREGUNTAS FRECUENTES &lt;&lt;</strong></p><p style=\"\"></p><p style=\"\"><strong style=\"\">P: Cuánto tiempo dura el Programa?</strong></p><p style=\"\"><strong style=\"\">R</strong>:&nbsp;El programa está diseñado para ser estudiado al ritmo individual que cada persona elija tener. Recomendamos dedicar un mínimo de 2-3 horas semanales con regularidad y practicar cada semana. <strong style=\"\">El tiempo ideal de realización del programa con una dedicación regular semanal es de unos 3 meses, aunque realmente puedes organizarte a tu gusto y realizarlo en el tiempo que tú estimes conveniente</strong>. En este sentido, el programa permite una total flexibilidad.</p><p style=\"\"></p><p style=\"\"><strong style=\"\">P: ¿Voy a recibir una formación adecuada con su Programa de Entrenamiento Online?&nbsp;</strong></p><p style=\"\"><strong style=\"\">R</strong>:&nbsp;<strong style=\"\">Absolutamente.</strong>&nbsp;Si bien lo ideal sería que un Profesional de la Gestión del Estrés te entrenara durante un programa de entrenamiento presencial, por desgracia, este lujo no es práctico para muchas personas. Cuando tenemos en cuenta los desplazamientos, hoteles, tiempo fuera del trabajo y la familia, etc., los costos ascienden rápidamente. Por esta razón, muchas instituciones se han dirigido a la formación online como una alternativa viable para satisfacer las necesidades de hoy en día. De hecho, las Universidades de Columbia, Harvard y Cornell tienen multitud de programas de entrenamiento online, así como Penn, Dartmouth y Yale, que también ofrecen cursos en línea. José Luis Yañez, mientras trabajaba en su Master Científico en Comportamiento Organizacional por la Universidad de Londres y en su Certificación como Trainer en PNL por la American University of NLP, ha trabajado y estudiado ampliamente con programas online ofrecidos por estas universidades. A continuación, fue capaz de modelar el programa de entrenamiento en Gestión del Estrés para ofrecer un nivel similar de formación. Además, por supuesto, se te anima a encontrar un compañero de estudio y practicar tus técnicas siempre que puedas con otras personas.</p><p style=\"\"></p><p style=\"\"><strong style=\"\">P: ¿Existe alguna exigencia de licencia para los profesionales de la Gestión del Estrés?</strong></p><p style=\"\"><strong style=\"\">R</strong>:&nbsp;En este momento, <strong style=\"\">hasta donde alcanza nuestro conocimiento, no existen requisitos de licencia oficial para practicantes de la Gestión del Estrés en todo el mundo</strong>.&nbsp;<strong style=\"\">Es tu responsabilidad, si emprendes algún negocio orientado a servicios de Gestión del Estrés, obtener las licencias necesarias para operar tu negocio, así como las licencias oficiales en tu país para la práctica profesional, regulada oficialmente, de la psicología o medicina si quieres ofrecer consejo, diagnóstico o tratamiento médico oficial</strong>.&nbsp;</p><p style=\"\"><strong style=\"\">Este Curso de Técnicas Mente-Cuerpo de Transformación del Estrés no tiene por objeto permitirte dispensar consejo médico, hacer un diagnóstico médico, o proporcionar tratamiento médico.</strong></p><p style=\"\"></p><p style=\"\"><strong style=\"\">P:¿Quién en realidad enseña el programa?</strong></p><p style=\"\"><strong style=\"\">R</strong>:&nbsp;El programa se imparte en línea por <strong style=\"\">José Luis Yañez</strong>, Psicólogo Colegiado, Master of Science in Organizational Behaviour por la Universidad de Londres, NLP Trainer por la AUNLP (r) y Consultor, Formador y Coach especializado en Transformación del Estrés, con más de 20 años de experiencia profesional. Actualmente, Fundador y Presidente de&nbsp;<a href=\"http://www.liderazgopositivo.com\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">+Lead-Map ©</a></p><p style=\"\"></p><p style=\"\"><strong style=\"\">P: ¿Es necesario una titulación universitaria oficial o un master para realizar el curso y ejercer profesionalmente cómo especialista en Gestión del Estrés?</strong></p><p style=\"\"><strong style=\"\">R:</strong>&nbsp;No. En la mayoría de los países, nuestro programa es todo lo que necesitas.</p><p style=\"\"></p><p style=\"\"><strong style=\"\">P: No tengo ningún conocimiento de Gestión del Estrés. ¿Este programa realmente me entrena desde los fundamentos básicos y me enseña todo lo que necesito?</strong></p><p style=\"\"><strong style=\"\">R:</strong>&nbsp;<strong style=\"\">Sí. Este programa es muy completo y te enseñará todo lo que necesitas</strong>&nbsp;para aplicar efectivamente técnicas de Gestión y Transformación del Estrés.</p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Técnicas Mente-Cuerpo de Transformación del Estrés", 
    "price": "50.00", 
    "instructors": "Jose Luis Yanez", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50121_bbd1_11.jpg", 
    "course_url": "https://www.udemy.com/byebyestress/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-16T21:27:05Z"
}