{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Led by a Licensed Marriage &amp; Family Therapist, <em>Women Who Do Too Much</em> is a course designed for women (and men!) who over-give to others yet find it difficult to attend to their own needs and nurturing.  A combination of video instruction and PowerPoint, <em>Women Who Do Too Much</em> is aimed at women whose lives seem like endless to-do lists and obligations.</p>\n\n<p><br></p>\n\n\n\n\n\n<p>In this course, the instructor explores the social and biological reasons why women sacrifice their needs for the needs of others.  We also explore the role that fear, avoidance, guilt and shame play in preventing women from taking adequate care of themselves.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>Students will learn that the widespread tendency for women to over-focus on others has serious psychological and physical consequences.  Depression, anxiety, headaches, and even a loss of interest in sex are all possible consequences when women do not take time for their own pursuits and self-renewal.</p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>In this course, we learn why play -- the language of childhood -- and a sense of efficacy and control are critical to our well-being.  The instructor conveys a 5-step process designed to improve a woman's moods and contentment in life.  Also discussed is the connection between lack of play and focus on oneself and a decrease in sexual satisfaction.</p>\n\n<p><br></p>\n\n<p>By increasing \"play time,\" setting better boundaries with loved ones, incorporating pleasure into our daily life, and letting go of the need to be good and perfect, women can empower themselves to lead more joyful and fulfilling lives.</p>", 
    "end_date": null, 
    "title": "Women Who Do Too Much", 
    "price": "20.00", 
    "instructors": "Amanda Somberg, MFT", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783756_5fde_2.jpg", 
    "course_url": "https://www.udemy.com/women-who-do-too-much/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-06T05:38:21Z"
}