{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong>******************************************************<br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Note this course was just Launched at the end of March and  already has of 1,600  students with great reviews. </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>We are one of the top Udemy Instructors in the Personal Development Field. our courses have been taken by over 21,000 happy students from 159 Countries.</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>We we are actively involved and answer questions within 24h.</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>******************************************************</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Being an entrepreneur and/or working from home sounds like the ultimate freedom…</strong> corporate renegades willing to risk life outside the box in hopes of following our passions and living our dreams! We can choose our own hours, have more time for our family and friends, have no boss lurking over our shoulder, no cubicle cell, and no disruptive co-workers. Whether you’re a business owner, independent contractor, at-home parent or telecommuter, we know you chose your form of self-employment because you wanted 2 things: balance and control. Yet, if you’re like us and so many entrepreneurs we’ve worked with you feel <strong>unbalanced and out of control.</strong> </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The illusion of freedom quickly fades and our personal lives, our businesses, and our family and friends suffer... we get out of balance. We end up feeling stressed out, burnt out and overwhelmed. But there is hope! We have discovered the secrets to bringing balance, fulfillment and success to the lives of the self-employed, which we’ve learned through our own experience in the trenches as well as through years of study and working with thousands of entrepreneurs. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>The course will cover:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>10 Tips for Balance, Burnout and Boundaries</li><li>10 Tips for Time Management and Planning</li><li>10 Tips for Productivity and Efficiency</li><li>10 Tips for Combating Stress</li><li>And 5 Tips for Balance through Deliberate Creation</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course doesn’t just give you a list of ideas that sound great but that you’ll quickly forget and go about your old habits and unproductive ways… <strong>we provide engaging lectures that are very real and to the point with some humor to bring some joy to your day! </strong>Plus, every lecture includes a proven, practical tools in a downloadable worksheet that will help you put on paper what you are going to do to take back control of your life and your freedom.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course we are going to give you everything we have learned and live—and we’re going to do it in a quick-and-easy format so even the most time-crunched business owner or household juggler can commit to themselves and create the balanced and fulfilling business they’ve always wanted!</p>", 
    "end_date": null, 
    "title": "Work Life Balance for Entrepreneurs, The Complete Guide ", 
    "price": "20.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793148_c921_2.jpg", 
    "course_url": "https://www.udemy.com/work-life-balance-for-the-self-employed/", 
    "currency": "USD", 
    "subject_name": [
        "Stress Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T02:39:02Z"
}