{"selfpaced": false, "topic_name": ["Language & Culture"], "description": "\n\n                    \n                    \n                    东南亚在中国之南，且濒临海洋，所以古代把它称为“南海”或“南洋”。“东南亚”这个名称，是第二次世界大战期间才出现的。东南亚地区很早就有人类 活动，并在公元前后形成了原始的文化形态，主要表现在东南亚的岩画、巨石、瓮葬和铜鼓等特色鲜明文化遗迹。从公元3世纪开始，印度文化、中国文化、伊斯兰 文化和西方文化陆续进入东南亚地区，经历了长期的本土化过程，与东南亚的本土文化进行了充分的融合，形成了独特的文化形态和文化特点。\n1967 年，印度尼西亚、泰国、新加坡、菲律宾四国外长和马来西亚副总理在曼谷举行会议，发表了《曼谷宣言》（《东南亚国家联盟成立宣言》），正式宣告东南亚国家 联盟（简称“东盟”）成立。20世纪80年代后，文莱（1984年）、越南（1995年）、老挝（1997年）、缅甸（1997年）和柬埔寨（1999 年）5国先后加入东盟，使这一组织涵盖整个东南亚地区。\n由于中国与东南亚在地理位置上的相邻关系，奠定了东南亚地区在中国对外关系中的 “首要”地位。随着中国与东南亚交流层次的逐步深入，中国扩大了国际影响力，积累了丰富的开展国际交流的经验。但是，由于中国民众对于东南亚文化的了解程 度还有提升的空间，从而也在中国与东南亚的交流中造成了一定的问题。本课程将将系统梳理东南亚文化发展进程的基础上，以兼顾东南亚传统文化与现代文化的特 点，以具体的文化现象为中心，为同学们呈现东南亚文化的多样性与独特性。\n \n\"Southeast Asia\" is the term which appeared during World War II. In Chinese history documents, this region was called “Nan Yang” or “Nan Hai”. From the beginning of the 3rd century AD, Indian culture, Chinese culture, Islamic culture and Western culture have moved into this area. After a long process of localization, external culture and the native culture were fully fused, forming a unique cultural expression and cultural characteristics.\nIn 1967, Indonesia, Thailand, Singapore, the Philippines and Malaysia issued \"Bangkok Declaration\" to declare the establishment of Association of Southeast Asian Nations (ASEAN) was established. After the 1980s, Brunei (1984), Vietnam (1995), Laos (1997), Myanmar (1997) and Cambodia (1999) has joined the ASEAN, so that this organization covering the entire Southeast Asian region.\nAs the geographical neighbor of China, the Southeast Asian region plays \"top\" role in China's foreign relations. With the gradual deepening of exchanges between China and Southeast Asia, misunderstanding of cultures caused some problems. In order to improve the understanding of Chinese people about the neighbor countries, this course will show the development steps of Southeast Asian culture, and explain the traditional and modern culture features of Southeast Asia through the specific cultural phenomenons.\n\n教学参考书有哪些?\n\n吴虚领：《东南亚美术 》，中国人民大学出版社，2004年。 贺圣达：《东南亚文化发展史》，云南人民出版社，2010年。 （新西兰）尼古拉斯•塔林《剑桥东南亚史》，王士录等译，云南人民出版社，2012年。 梁志明等：《东南亚古代史》，北京大学出版社，2013年\n\n授课形式是什么样的？\n\n本课程主要包括由讲课视频、参考教材阅读、作业、在线讨论、期末考试组成。每周的讲课视频有3-5段不等，每一段的时长在10分钟左右。每一周有一次课后作业。 教学团队鼓励修读者互帮互助，主动解答线上提出的问题。\n\n本课程的评分方法？\n\n 本课程的成绩评定主要由以下4个部分组成：\n\n单元测验（占总成绩20%） 每单元都有一次测验，包括10道客观选择题。同学们需要在课程结束1周内完成测验。\n\t单元作业（占总成绩20%） 每单元都有一个讨论题作为书面作业。同学们需要在课程结束1周内容完成。\n\t互评作业（占总成绩20%） 每单元都有一个互评作业，每个同学需要评价至少5份作业。同学们需要在课程结束2周内容完成。\n\t期末考试（占总成绩40%） 由40道客观选择题组成。考试时间2小时。\nReading Materials\n\nWu Xuling, Art of Southeast, Remin University Press, 2004.\n\tHe Shengda, A Cultural History of Southeast Asia, Yunan People’s Publishing House, 2010.\n\tNicholas Tarling, ed., The Cambridge History of Southeast Asia, Wang Shilu, trans., Yunan People’s Publishing House, 2012.\n\tLiang Zhiming, A History of Ancient History, Peking University Press, 2013.\nCourse format\n\nThis course consists lecture videos, reading materials, assignments, discussion and final exams. Each week consists of 3-5 units. Each unit is a 10-minutes lecture video. Each week will have one quiz. Students are encouraged to interact with and help each other through the course online discussion forum.\n\nGrading Policy\n\nHere is how the final grade for the course will be calculated:\n\nWeekly quizzes (Weighting: 20%) Each quiz will contain 10 questions, and you will have 7 days to submit it.\n\tBi-weekly assignments (Weighting: 20%) Every two weeks, you will have 1 problem set containing 3 questions, and 7 days to submit it.\n\tWriting assignment (Weighting: 20%) Your writing will be peer-assessed and assigned a grade by five of your fellow students.\n\tFinal exam (Weighting: 40%) Timed 2 hour exam, 40 questions. Complete in 1 sitting.\n\n\n                                    ", "end_date": "2015-05-03T00:00:00Z", "title": "03530370x: Southeast Asian Culture 东南亚文化", "price": 0, "instructors": "Shi Yang and Wu Jiewei", "institution_name": ["Peking University"], "commitment": "2-4 hours", "subject_name": ["Humanities"], "course_url": "https://www.edx.org/course/southeast-asian-culture-dong-nan-ya-wen-pekingx-03530370x", "duration": "9 weeks", "language_name": ["Chinese"], "provider_name": ["edX"], "start_date": "2015-03-01T00:00:00Z"}