{"selfpaced": false, "topic_name": ["Language & Culture"], "description": "\n\n                    \n                    \n                    ¿Le interesa el idioma español y se preocupa por la corrección, el estilo y las variaciones de la lengua española? \n\n¿Siente curiosidad acerca de las variaciones española y argentina o americana del Español estudiadas en textos cultos de referencia? En este curso se estudian empíricamente algunos aspectos relevantes de esas variedades de la lengua con datos significativos de las versiones hispanas de J. D. Salinger: «El cazador oculto», argentinas; y «El guardián entre el centeno», españolas.\nLas Encuestas de Evaluación de la edición anterior (http://bit.ly/1QYPAJI) permiten hacerse una idea cabal de las consideraciones que ha merecido el curso.\n\nEn este curso, con una consideración policéntrica de la lengua, se pretende activar o potenciar el interés por la corrección de los textos propios y ajenos; por las diferencias de estilo en dos versiones de G. V. Higgins; y por las variedades peninsular y argentina o americana de la lengua española en las diferentes versiones de J.D. Salinger.\n\nLa finalidad del curso es doble. \nAnte un texto ajeno suscitar el interés sobre lo que se dice; y sobre cómo se diría mejor: con más claridad, con más precisión, con más propiedad, con un ‘estilo’ de mayor calidad argumentada lingüísticamente. \nY, ante un texto propio, suscitar la preocupación sobre cómo decir mejor lo que se pretende: con más claridad, de manera unívoca; con más precisión; con gusto más general y sancionado; con ‘estilo’ de mejor consideración. \n\nFinalizar este curso le permitirá: \n1. Primero, identificar, advertir y argumentar las posibles inconvenientes (sin prestigio) de expresión en textos de autores españoles. \n2. Segundo, estudiar y evaluar las alternativas y variaciones (¿de estilo?) entre dos versiones españolas actuales de «Los amigos de Eddie Coyle», de G. V. Higgins (1973 [El Chivato] frete a la versión de 2011), \n3. Tercero, estudiar y evaluar empíricamente algunos aspectos significativos de las alternativas y variaciones del español en España y en Argentina con datos de las cuatro versiones en español de J. D. Salinger («El guardián entre el centeno», versiones españolas de 1978 y de 2007; y «El cazador oculto», versiones argentinas de 1961 y de 1998). \n\nEstos dos últimos objetivos tiene más valor por dos motivos: \n•\tLos textos de observación cumplen, sin duda, una condición esencial en el análisis y evaluación empírica lingüística: la condición de la ‘paráfrasis’: real (con diferencias de estilo, en los textos de Higgins) o alternativa (con variaciones de lengua, argentina y americana, o bien peninsular, en las versiones de Salinger), que dicen, o pretenden decir lo dicho en el texto fuente.\n•\tLas versiones de ‘El guardián…’ / ‘El cazador…’, desde distintos asuntos permiten referirse a las variaciones de lengua según los diferentes momentos de la versión o según la variedad territorial de lengua. \n\nNo es un curso sobre datos. Es un curso que, con algunos datos, opera sobre la competencia en advertir inconvenientes o aciertos expresivos y sobre la valoración y argumentación de diferentes alternativas de expresión y de algunas manifestaciones de la variedad argentina y española de lengua.\n\n                                            Syllabus\n                        Algunas dudas y dificultades de expresiónEn este módulo nos centraremos en problemas encontrados comúnmente en el Españo actual. Problemas de expresión, de fuentes periodísticas y de traducciones de obras de gran difusión. Presentación, análisis y discusión de algunas dudas y dificultades de expresión en español actual: conjunciones, acento, léxico, concordancia, etc. ¿Dónde está la dificultad? ¿Cómo se encuentra la solución más conveniente y mejor aceptada? ¿Con qué instrumentos: diccionarios, libros de estilo, corpus, etc.? Dudas de expresión y variaciones en dos versiones de una obra de género (I)Dudas y dificultades de expresión surgidas por el contraste entre dos versiones en español de una obra de referencia de George V. Higgins: «El chivato» (1973) y «Los amigos de Eddie Coyle» (2011). Identificación y valoración de algunas diferencias destacadas: colocación del verbo, conectores, uso del gerundio, concordancia, etc. Identificación, discusión y argumentación de la propuesta más aceptable.Dudas de expresión y variaciones en dos versiones de una obra de género (II)Identificación y análisis de otras dudas y dificultades de expresión en datos de las dos versiones en español «El chivato» (1973) y «Los amigos de Eddie Coyle» (2011): se analizan y argumentan con los instrumentos más oportunos (diccionarios y corpus y otras herramientas) otros asuntos, como el uso de la conjunción ‘que’, el léxico, las frases hechas y colocaciones, los demostrativos y la negación. Diferencias de estilo y variaciones de lengua en «El guardián entre el centeno» (I)En esta parte se comienza el estudio de algunos aspectos de la lengua suscitados por el contraste entre las dos versiones en español peninsular de una obra de referencia de J. D. Salinger: «El guardián entre el centeno», de Carmen Criado (1978) y la versión revisada por la misma autora (2006): el uso de los tiempos, la concordancia, el léxico, el uso de la negación, las colocaciones y las frases hechas.Diferencias de estilo y variaciones de lengua en «El guardián entre el centeno» (II)Continúa el estudio de otros aspectos de la lengua de las dos versiones en español peninsular de «El guardián entre el centeno», de Carmen Criado, de 1978 y de 2006: el orden de las palabras en la frase, relaciones entre constituyentes del enunciado, el uso del gerundio, los apreciativos y expresiones de ponderación, o el uso de uno/tú con sentido arbitrario.Diferencias de estilo y variaciones de lengua en «El cazador oculto»En esta parte se estudian algunos aspectos de la lengua suscitados por el contraste entre las dos versiones de «El guardián entre el centeno», de Carmen Criado, y las correspondientes versiones argentinas de la misma obra, «El cazador oculto», de Manuel M. de Andés (1961) y de Pedro B. Rey (1998): el uso actual de «uno/tú» con sentido arbitrario, los contrastes de léxico y otros aspectos de solución diferente en las versiones de la variedad argentina y de la variedad peninsular de la lengua española, como manifestación de las variaciones de lengua, perfectamente legítimas.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Corrección, estilo y  variaciones de la lengua española", "price": 0, "instructors": "Santiago Alcoba", "institution_name": ["Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/correccion-estilo-variaciones", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}