{"selfpaced": false, "topic_name": ["Language & Culture"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    latinamericanculture-001\n                                                                    latinamericanculture-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This course\nwill develop students’ abilities to understand Latin American culture at both\nthe national and regional levels. Students will analyze the social, economic,\npolitical, and cultural development of the region by applying modern critical\nthinking to the understood history of the individual Latin American countries.\nAt the same time, students will study the contributions of different cultural\nand ethnic groups that exist within these countries, in order to understand fully\nthe social complexity of what we call “Latin America”. Lastly, students will\nevaluate the developmental needs of Latin American countries and propose\npossible solutions in which individuals can act as a force for change.Throughout the course,\nstudents will develop abilities such as: independent thinking and learning, analytical\nskills, and the ability to synthesize, and evaluate. The final part of the\ncourse will help develop critical thinking and problem solving skills. After\ncompleting this course, students will gain a better awareness of Latin American\nreality and needs.\n\n                                            Syllabus\n                        \n\n\n1. The birth of Latin\nAmerican culture\n\n1.1 An idea of culture\n\n1.2 Encounter, confrontation or unification?2. The political\ndimension.\n\n2.1 Political systems and their development over\ntime.\n\n2.2 The struggle for democracy.\n\n2.3 The leader in Latin America.\n\n2.4 Sudden and dramatic events during the 20th\ncentury.\n\n \n\n3. The characteristics of the\neconomic processes in contemporary Latin America.\n\n3.1 Economic models: from socialism to neoliberalism.\n\na) Globalization;\n\nb) Treaties and economic alliances;\n\nc) The end of the welfare state;\n\nd) The search for successful economic models.\n\n \n\n 4. Development and sustainability in Latin\nAmerica.\n\n4.1 Poverty and the environment: quality of life, environment, violence,\npoverty, gender, drug trafficking, corruption, and religious fanaticism. \n\n4.2 Consequences, implications and possibilities of modernity in Latin\nAmerica.\n\n4.3 Proposals for development. \n\n \n\n5. Art in Latin\nAmerica I\n\n5.1 What makes Latin America Art unique.\n\n5.2 Understanding Latin America through art.\n\n5.3 Literature.\n\n \n\n6. Art in Latin America II\n\n6.1 Visual Arts.\n\n6.2 Music.\n\n\n\n\n\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Latin American Culture", "price": 0, "instructors": "Enrique Tamés", "institution_name": ["Tecnológico de Monterrey"], "commitment": "4-6 hours", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/course/latinamericanculture", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-08-29T00:00:00Z"}