{"selfpaced": false, "topic_name": ["Language & Culture"], "description": "\n\n                    \n                    \n                    Islam is the second largest religion in the world today and dominates much of the current geopolitical discourse. People are increasingly bombarded by dramatic and at times disturbing headlines. Yet general knowledge of Muslims and their faith can be poor. There is consequently a need for a balanced and well-informed understanding of the current debates around this internationally significant topic.\n\nThis course uses Britain as a case study to shed light on wider issues relating to the growth of Islamic communities across the culturally Christian and increasingly secularised Western World. This MOOC reflects the work of the Islam-UK Centre at Cardiff University, and the research that we have conducted over the last decade.  This means that we focus in this course upon the everyday lives of Muslims in Britain, as opposed to the activities of the very small minority of Muslims who engage in terrorist activities.  Later in the course, we will help you to access material on this topic if you are interested\n\nTopics include:\n\nIslamic Practice An outline of Islamic practices and beliefs plus an introduction to the different viewpoints within Islam.\n\nHistory of Islam in Britain An exploration of the longstanding associations between Islam and Britain, including Islamic influences on British society and the well-established connections between Britain and the countries from which many British Muslims originally hailed.\n\nSettlement Patterns The origins and makeup of today’s British Muslim communities.\n\nCultural Diversity Confronting the ‘myth’ of a homogenous Muslim community through an exploration of the various religious and cultural influences that characterise and inform Muslim communities in Britain today.\n\nContemporary Debates An examination of how the above topics feed into the contemporary debates and what the future might hold.\n\nGiven current debates about multiculturalism, integration, and the spectre of fundamentalism, this course will appeal to a wide audience not only in Britain but far beyond.\n\nThe course will also include an exciting opportunity to join us live via web streaming for the IslamUK Centre’s Public Lecture Series each week as a series of leading scholars address key topics in depth.\n\nTo find out more, read Professor Sophie Gilliat-Ray’s post for the FutureLearn blog: “Muslims in Britain: exploring diversity and challenging stereotypes.”\n\n\n                                    ", "end_date": "2016-03-21T00:00:00Z", "title": "Muslims in Britain: Changes and Challenges", "price": 0, "instructors": "Sophie Gilliat-Ray", "institution_name": ["Cardiff University"], "commitment": "", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/muslims-in-britain?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-02-22T00:00:00Z"}