{"selfpaced": false, "topic_name": ["Language & Culture"], "description": "\n\n                    \n                    \n                    New week 6 content has been added in the fourth iteration of this popular course!\n\nJoin the Smithsonian, and comic book industry legend Stan Lee, to explore the history of the comic book and the rise of superheroes.\n\nThe ancient gods of Egyptian, Greek and Roman myths still exist, but today, they have superpowers, human foibles and secret identities. They come from comic books and graphic novels, and have taken over pop culture on the stage, screen, video games, and animation.\n \nFrom Superman® and Spider-Man®, to The Avengers® and The Hulk® and beyond, who are these heroes? And, how have they evolved from folklore and myth, across all cultures and religions?\n \nLearn from Smithsonian and industry experts including:\n\nStan Lee, who was one of the creators of the modern superhero template. His early comics featuring Spider-Man, Iron Man®, The Hulk, Thor®, and The Avengers led Marvel to success. He continues to reinvent himself to create modern global superheroes and appear in cameos in superhero films and TV, such as Avengers: Age of Ultron.\n\tMichael Uslan, executive producer of top grossing, award winning movies, including The Dark Knight series, Lego® Movie, the animated Batman films and Batman® VS Superman. \nIn this course, we explore the following questions:\n\nWhy did superheroes first arise in 1938 and experience what we refer to as their “Golden Age” during World War II?\n\tWhy did the superhero genre ebb and flow in popularity over the decades?\n\tHow have comic books, published weekly since the mid-1930’s, mirrored a changing American society, reflecting our mores, slang, fads, biases and prejudices? \n\tWhy was the comic book industry nearly shut down in the McCarthy Era of the 1950’s? \n\tHow did our superheroes become super-villains in the eyes of the government, clergy, educators, and parents of the mid-20th Century? \n\tWhen and how did comic books become acceptable again, and eventually become valid teaching tools in universities and schools? \n\tWhen and how did comic book artwork become accepted as a true American art form as indigenous to this country as jazz? \n\tFinally, when and how did comic books become “cool” and the basis for blockbuster movies, hit TV series, top-selling video games, and acclaimed animation, while also impacting fashion and style- and even the moral and ethical codes of children- around the globe?\nFor the first time ever, the Smithsonian's National Museum of American History is excited to offer the opportunity to go into the collection and see why superheroes are a dominant cultural force in today’s world.\n\nAs you learn about how cultural myths, world events, and personal experiences shaped the first superheroes, you will apply these frameworks to create your own superhero– or you can choose to do a deeper analysis on existing comic book heroes. This original project is required for certification and anything created by you as part of the course is the intellectual property of you and you alone.  At the end of the course, you will have the opportunity to take your final project work and participate with other current and alumni students in a two week “team track add-on\" to the course. \n\nAt last, fans, students and seekers of knowledge have the opportunity to enroll in the ultimate comic book course.\n\n                                    ", "end_date": "2016-07-05T00:00:00Z", "title": "POPX1.1x: The Rise of Superheroes and Their Impact On Pop Culture", "price": 0, "instructors": "David Uslan, Michael Uslan and Stan Lee", "institution_name": ["Smithsonian Institution"], "commitment": "1-2 hours", "subject_name": ["Humanities"], "course_url": "https://www.edx.org/course/rise-superheroes-impact-pop-culture-smithsonianx-popx1-1x-2", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-05-17T00:00:00Z"}