{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Being able to drive targeted traffic at no cost is an amazing skill for any online entrepreneur, and something 99% of them are horrible at.</p><p>Without traffic, your business isn&#039;t headed anywhere -period.</p><p>What if we told you there was a set of underground traffic generation methods that we&#039;ve personally been using for all our online career, and that keeps giving us amazing results day after day ?</p><p><em style=\"\"><strong style=\"\">Good news - This is the truth!</strong></em></p><p>This course provides the blueprint to rewire the way you approach traffic generation, and to make sure you never fail in that department again ?</p><p>All of the tactics, scripts, and techniques are the product of years of testing on our end. We have failed many times, but along the way we have found gold, and this is what we&#039;ll be sharing in this jam-packed course.</p><p>*Being one click away from thousands of free targeted visitors is a powerful place to be.</p><p><strong style=\"\">Skeptical?</strong></p><p>As of May 18th 2015, over 14,000 students have joined our courses, and are experiencing life-changing results from our teachings.</p><p>We aren&#039;t shady marketers hiding behind a pen name. We teach serious content to serious marketers. We are one Skype call away from helping you personally reach your goals. My Skype handle is HowardEdwardLynch, and you are very welcome to add me and say hi :)</p><p>A few of the things you&#039;ll learn in this course:</p><ol style=\"\"><li>How to leverage the power of social exchanges to drive <em style=\"\">thousands </em>of clicks to any link you desire.</li><li>10 Proven methods to drive highly targeted traffic starting TODAY.</li><li>The proper copywriting skills that will ensure people click your links, and follow through.</li><li>How to automate the whole process, allowing you to sit back as traffic flows in.</li></ol><p>And much, much more..</p><p>No matter who you are, I guarantee you&#039;ll learn at least one thing from this class (see the testimonials above for proof).</p><p><strong style=\"\">We will personally answer any question you may have, so you can feel confident your money will be well spent.</strong></p><p>Oh, and we also offer a full no questions asked money back guarantee! Not seeing results from our teachings ? You&#039;re one click away from a full refund.</p><p>So enroll now and let&#039;s get started already !</p><p>Talk soon,</p><p>Howard Lynch &amp; Antoine Lelievre</p>", 
    "end_date": null, 
    "title": "11 Free & Fast Ways To Get Visitors To Your Website in 2016", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483024_2601_6.jpg", 
    "course_url": "https://www.udemy.com/fast-traffic-flood/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T08:59:21Z"
}