{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">OBS: 100% DE GARANTIA. Se você não gostar do curso, é só pedir seu dinheiro de volta! Aprovado por mais de 500 alunos!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">E se você descobrisse que é possível bater suas metas e aumentar as suas vendas de maneira considerável? Sim, isso é possível e é por isso que você veio parar aqui.</strong>  </p>  <p style=\"\">  \t    Você pode atingir resultados incríveis utilizando apenas algumas técnicas que eu posso te ensinar de maneira rápida e fácil através deste curso!  </p>  <p style=\"\">  \t    Aqui nós vamos te ensinar a <strong style=\"\">como ser um grande influenciador</strong>. Como influenciar as pessoas de maneira correta e assim conseguir atingir os objetivos que você deseja.  </p>  <p style=\"\">  \t<strong style=\"\">Mas cuidado, nós recomendamos que você utilize estas técnicas de maneira sábia, apenas para o bem e não para apenas tirar vantagem dos outros.</strong>  </p>  <p style=\"\">  \t<em style=\"\">Aproveite esta oportunidade, pois este preço é promocional!</em>  </p>  <p style=\"\">  \t    Sabe aquele vendedor que sempre acaba batendo as metas no final do mês? Aquele seu colega de trabalho ou parceiro que no final das contas sempre sai vendendo mais do que você?  </p>  <p style=\"\">  \t    Então, <strong style=\"\">este curso foi criado para que você aprenda as técnicas que grandes vendedores utilizam.</strong> Essa técnicas já foram testas e comprovadas, ou seja, você vai ter acesso aqui a um material de excelente qualidade.  </p>  <p style=\"\">  \t<strong style=\"\">E tem mais, se você assistir este curso e mesmo assim não gostar, devolvemos o seu dinheiro em até 30 dias! </strong>  </p>  <p style=\"\">  \t    Faça o curso hoje mesmo, é um curso rápido e recomendado para você que precisa bater as metas.  </p>  <p style=\"\">  \t<em style=\"\">Por ser um curso muito bom, este preço é apenas promocional! Não vou poder segurar por muito tempo. Aproveite!</em>  </p>", 
    "end_date": null, 
    "title": "12 Verdades sobre Vendas que Nunca te Contaram", 
    "price": "20.00", 
    "instructors": "Marcel Souza", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/146500_9bf8_5.jpg", 
    "course_url": "https://www.udemy.com/12-verdades-sobre-vendas-que-nunca-te-contaram/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-13T22:22:52Z"
}