{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Description:</strong></p><p>Every day LinkedIn gets millions of members visiting to their website. The vast majority of these members don't know how to use LinkedIn to the fullest to find potential sales prospects and sales leads.</p><p>20 LinkedIn Sales Prospecting Tips and Tricks is about using different features and functions in LinkedIn so that Sales People, Business Owners and Entrepreneurs find more qualified sales prospects faster, book more meetings and close more business.</p><p><strong>Learn </strong><strong>20 LinkedIn Sales Prospecting Tips and Tricks:</strong></p><ul>\n<li>Advanced LinkedIn search tactics</li>\n<li>Referral techniques that will help you book more meetings</li>\n<li>Tactics to get in front of your sales prospects and become top of mind</li>\n<li>Different ways to grow your LinkedIn network</li>\n</ul><p><strong>Contents and Overview:</strong><br></p><p>LinkedIn is the best way to network with business people online yet a lot of people do not understand the power of LinkedIn and how it can provide opportunities for sales.</p><p>In just a little over 1 hour of content with 20 modules on LinkedIn Sales Prospecting Tips and Tricks, this course will help provide you with the knowledge you need to find better qualified sales prospects and also different ways to book more meetings.</p><p>20 LinkedIn Sales Prospecting Tips and Tricks will show you how to increase the amount of meeting that you book in less time.</p><p><strong>What are the requirements?</strong></p><p>People who take this course must have:</p><ul>\n<li>A LinkedIn account</li>\n<li>A basic understanding of how LinkedIn works</li>\n</ul><p><strong>What am I going to get from this course?</strong></p><ul>\n<li>An understanding of how to use LinkedIn to identify better sales prospects</li>\n<li>A way to increase the probability of getting meetings with qualified prospects</li>\n<li>Multiple ways to use LinkedIn to find sales prospects and sales leads</li>\n<li>20+ quick and easy processes to find more prospects and book more meetings</li>\n<li>Easy to follow steps on prospecting on LinkedIn</li>\n<li>Example introduction letters or email templates you can use</li>\n</ul><p><strong>What is the target audience?</strong></p><ul>\n<li>Sales Professionals who want to book more meetings with qualified prospects</li>\n<li>Business Owners who need to generate sales for their company</li>\n<li>Entrepreneurs who want to generate more sales</li>\n<li>Anyone who struggles to get client facing meetings</li><li>Anyone who wants to add more sales opportunities to their pipeline</li></ul>", 
    "end_date": null, 
    "title": "20 LinkedIn Sales Prospecting Tips and Tricks", 
    "price": "20.00", 
    "instructors": "Chris Hamilton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677318_ce58.jpg", 
    "course_url": "https://www.udemy.com/20-linkedin-sales-prospecting-tips-and-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-22T15:12:20Z"
}