{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tIn this course, be prepared to learn how to <strong style=\"\">increase sales</strong> and <strong style=\"\">gain huge results</strong> by using these powerful and proven strategies. I will reveal the exact step-by-step strategy I have used to help thousands while generating millions.  </p>  <p>  \t                      First, we will uncover nearly a <em style=\"\">dozen</em> words that even some of the best sales professionals still use, which deter consumers from buying, and create unnecessary resistance. We will also convey <em style=\"\"><strong style=\"\">key words to adopt in to your sales presentation</strong></em> to lower resistance and result in an immediate increase.  </p>  <p>  \t                  Further, we will show you the <em style=\"\">single biggest phrase </em>you need to include before discussing price, so you can be persistent <strong style=\"\">without </strong>your customers feeling like you&#039;re pressuring them<em style=\"\">.</em> I will also provide you with some key phrases that have taken me years to perfect, allowing you to adopt and implement in just minutes.  </p>  <p>  \t                  You will also learn the <strong style=\"\">real truth&#039;s</strong> about sales, and what separates a professional <em style=\"\">salesman</em> from a professional <em style=\"\">conversationalist</em>.  </p>  <p>  \t                  Whether you&#039;re selling in person, business-to-business, or online, this is the course for you. Don&#039;t let any more sales get away, get started now!  </p>", 
    "end_date": null, 
    "title": "5 New Techniques to Boost Your Sales!", 
    "price": "30.00", 
    "instructors": "Dan Vega", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307780_ea60_4.jpg", 
    "course_url": "https://www.udemy.com/5-new-techniques-to-boost-sales-immediately/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-25T17:37:38Z"
}