{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to <strong>The art of selling to intelligent people</strong>, an advanced training course for sales professionals and anyone who needs to sell ideas, concepts or products. <br></p><p>Do you want to SUCCEED at sales?</p><p>Do you need to IMPROVE your reputation?</p><p>Do you need HIGHER conversion rates?</p><p><strong>It all starts here:</strong> Resistance to persuasion is common among intelligent beings, Yet many sales professionals still try to manipulate clients through mental strategies, which is precisely why they fail to close straight forward deals that should have been closed easily. You are about to learn from two well known coaches: a psychologist and a trusted business adviser how to turn these challenges into sales opportunities. </p><p>Sales managers are still on the <strong>top 10 earners list</strong> in the world - hence mastery of the subject can have a profound impact on your lifestyle and earnings.<br></p><p>There are three groups of people who will benefit tremendously from this sales course:<br></p><p>If you <strong><em>already work</em></strong> in sales and perform well, but somehow find that over time your reputation suffers in the process. </p><p>If you are <strong><em>totally NEW to sales</em></strong> and would like to\ndo it right from the start, you should master sales psychology so that you do\nnot seem desperate in this profession. <br></p><p>If you work in sales, have a good reputation, but\nyou need to increase your conversion rate to enjoy a better lifestyle. <br></p><p><strong><em>So is the art of selling for you?</em></strong> That depends if you’re\ninterested to engage more intelligently with people in both a <strong>B2B and B2C</strong>\nenvironment. If the answer is <strong>YES</strong>, it is probably for you. Our philosophy is to pursue smarter sales, not harder sales. The success of your deal does not depend on YOUR desire to sell. It is not about working 10X, 20X or even 100X harder on methods that don’t work. Sales success depends on your ability to understand the <strong>psychology of sales</strong> and to be a smart sales person, who can act confident, relaxed and stick to a set of winning rules.</p><p>Join this course when you are ready to take your sales skills to the point of mastery. </p><p><strong>*Free E-book included*</strong></p><p>NOTICE:</p><p><strong>The art\nof selling to intelligent people</strong>, is best used when selling the right\nproduct to the right prospect in order to safeguard the deal against any\nmisunderstanding, misperceptions or mental obstacles so that the sale can be\nsuccessful. It should not be used to manipulate buyers into spending their\nmoney on inferior products they will regret buying. <br></p>", 
    "end_date": null, 
    "title": "Advanced Sales Training: Neuroscience & psychology series", 
    "price": "40.00", 
    "instructors": "Adriaan Brits, BA, MA, MRes Francesca Stregapede", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658798_d830_6.jpg", 
    "course_url": "https://www.udemy.com/sales-training-the-art-of-selling-to-intelligent-people/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T10:46:58Z"
}