{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong></p><p>Whether you are currently in a high-end, direct business-to-business sales role or have an aspiration to be, this course will reset or establish your foundation for action and help you create the habits that generate success!</p><p><strong>WARNING:</strong> This is not a course about sales philosophy or contrived sales methodology. The approaches and techniques offered can be implemented immediately, as you learn them.</p><p><strong>By packaging systematic discipline with new and improved intuitive and mechanical selling skills, you are poised for explosive success in your high-end sales career!</strong></p><ul><li>Set, or reset, your mindset and style foundation as a true sales PROFESSIONAL</li><li>Gain insight as a \"sales entrepreneur\" to ignite your success</li><li>Understand the difference between intuitive and mechanical sales skills and why it matters</li><li>Mirror the habits of top earning sales pros and make them your own</li><li>Set your objectives with the right priorities to maximize your personal income and fully leverage your compensation plan </li><li>Prospect with dignity, professionalism, credibility and success - consistently find new business by utilizing the 4 1/2 Rules of Smart Prospecting</li><li> Accept the 7 Week Promise challenge to learn to love \"the grind\"</li><li>Learn how to increase your personal credibility without relying on the organization you represent</li><li> Use the \"Top Seller Ritual\" to set distinguish yourself among the best at what you do</li><li>Make yourself a dream to manage and unanimously promotable to higher levels within your organization </li></ul><p>You may be in a great, potentially high-earning sales role right now, but times are challenging, your results are falling short and your manager is putting a lot of pressure on you to deliver. You need the right, straightforward, tactical weapons to break your slump and become successful NOW.</p><p>You need close business, you need to demonstrate results and that drives your income higher. This course offers you a complete systematic approach to high-end, relational direct selling, including practical and proven methods for finding, connecting and qualifying new clients and opportunities.</p><p>Great sales managers, those that coach and encourage effectively are few and far between. If you have a good sales manager, one that adds true value to your efforts and fully enables you, consider yourself fortunate. The direction and practical advice you receive from our “virtual coaching session\" will enable you to affect positive change, get results and manage your own success.</p><p>All it takes is your investment of the 3 hours it takes to go through this course and you can restart with the right habits, mindset and sales tactics for success TODAY.</p>", 
    "end_date": null, 
    "title": "All Levels Course on How to Become a Direct Sales Superstar", 
    "price": "25.00", 
    "instructors": "Steve Latos", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514100_9e7e_2.jpg", 
    "course_url": "https://www.udemy.com/earn-250k-or-more-as-a-direct-sales-superstar/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T22:20:02Z"
}