{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\tHagamos un ejercicio, corre por una de tus fotos en donde salgas de frente.\r\n</p>\r\n<p>\r\n\tD&oacute;blala a la mitad... &iquest;Notas algo? <strong>&iexcl;No son exactamente iguales los 2 lados de tu cara! </strong>\r\n</p>\r\n<p>\r\n\t&iexcl;Claro! Y no es que sea malo que seamos asim&eacute;tricos, sino que <strong>nuestro rostro va cambiando seg&uacute;n las situaciones por las que estemos pasando</strong> o el medio en el que nos desenvolvemos en ciertos momentos de nuestra vida. <strong>Por ejemplo, si est&aacute;s pasando por una situaci&oacute;n dif&iacute;cil en casa, o la enfermedad de alg&uacute;n familiar, se ver&aacute; reflejado en tu ojo izquierdo, cerr&aacute;ndose un poco en comparaci&oacute;n con el derecho. </strong>\r\n</p>\r\n<p>\r\n\tLa lectura de rostro te ayuda a conocer a los dem&aacute;s m&aacute;s all&aacute; de lo que vemos fisicamente, adem&aacute;s de ayudarte a valorar y querer cada una de tus facciones por la carga tan grande de significado que tienen.\r\n</p>\r\n<p>\r\n\t-El curso se trata de una ciencia que actualmente sirve como herramienta para alcanzar muchos objetivos y estar un paso adelante de los dem&aacute;s.\r\n</p>\r\n<p>\r\n\t Es un curso que se imparte en Estado Unidos y en Europa que es dif&iacute;cil de encontrar, es por eso que decidimos llevarlo a todas las personas por este medio, de forma f&aacute;cil y pr&aacute;ctica.\r\n</p>\r\n<p>\r\n\t El curso puede completarlo en el tiempo que &iexcl;t&uacute; quieras! Ya que es sencillo de digerir y las sesiones son de 7 a 10 minutos, por lo que en cualquier momento libre puedes tomar una clase e ir aprendiendo a tu ritmo.\r\n</p>\r\n<p>\r\n\t Las clases constan, adem&aacute;s, de material extra como lo son videos y lecturas que complementan el conocimiento que se imparte en clase.\r\n</p>\r\n<p>\r\n\t -Puedes tardar entre una semana y un mes en terminar de tomarlo, dependiendo de cada cuando tomes clase. Te va a encantar, as&iacute; que seguro lo terminas muy r&aacute;pido y con mucho aprendizaje.\r\n</p>\r\n<p>\r\n\t <strong>El curso est&aacute; estructurado en secciones: </strong>\r\n</p>\r\n<p>\r\n\t <strong>-Introducci&oacute;n:</strong> en donde vemos qu&eacute; es la lectura de rostro y algunos temas que son la base y cimientos para poder entender esta ciencia.\r\n</p>\r\n<p>\r\n\t -La divisi&oacute;n del rostro a lo largo y a lo ancho y su significado. (Racional, pr&aacute;ctico, emocional, p&uacute;blico y privado)\r\n</p>\r\n<p>\r\n\t -Leer las cejas\r\n</p>\r\n<p>\r\n\t -Leer los ojos\r\n</p>\r\n<p>\r\n\t -Leer la boca\r\n</p>\r\n<p>\r\n\t -Leer las orejas\r\n</p>\r\n<p>\r\n\t -Leer la nariz\r\n</p>\r\n<p>\r\n\t -Incrementa las ventas y persuade a tus clientes por medio de la lectura de rostro\r\n</p>\r\n<p>\r\n\t -Mejora tus relaciones con tu pareja, amigos o familiares\r\n</p>\r\n<p>\r\n\t -Manipula las situaciones\r\n</p>\r\n<p>\r\n\t -Reglas de la lectura de rostro\r\n</p>\r\n<p>\r\n\t &gt;Aprender lectura de rostro no s&oacute;lo sirve como herramienta para conocer a los dem&aacute;s mejor, sino para detectar caracter&iacute;sticas espec&iacute;ficas en tus clientes, tu familia, tu pareja o incluso tu jefe.\r\n</p>\r\n<p>\r\n\t Es una herramienta que actualmente se puede utilizar para la selecci&oacute;n de personal de una empresa (por lo que puedes adelantarte y lograr que te elijan a ti o bien, hacer la mejor elecci&oacute;n de tu personal) o detectar si una persona miente o no en asuntos legales.\r\n</p>\r\n<p>\r\n\t&iexcl;Haz la prueba y ver&aacute;s que no miento!\r\n</p>\r\n<p>\r\n\tLa lectura no es cuesti&oacute;n de magia sino de fisonom&iacute;a y morfopsicolog&iacute;a, es cuesti&oacute;n de entender el comportamiento de los dem&aacute;s y anticiparse ante las respuestas, s&oacute;lo es cuesti&oacute;n de poner atenci&oacute;n y observar a tu alrededor.\r\n</p>", 
    "end_date": null, 
    "title": "Aprende a leer el rostro: alcanza tus objetivos y vende más", 
    "price": "20.00", 
    "instructors": "Paola Padilla", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134982_ddb6_7.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-leer-el-rostro-alcanza-tus-objetivos-y-vende-mas/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-17T22:43:31Z"
}