{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tEs un mini curso de aproximadamente 1 hora donde <strong style=\"\">aprenderás a crear tu propia tienda online</strong>. El curso está indicado para personas que no tienen apenas conocimientos ni medios para poder desarrollar su negocio en internet. Si tienes un comercio local abierto al publico y quieres aumentar tus ventas este es tu curso.  </p>  <p>  \tEsta dividido en 7 temas de aproximadamente 10 minutos cada uno. Diseñado en un lenguaje claro y cercano.  </p>  <p>  \tLo bueno de este curso es que en breve tiempo serás capaz de crear tu tienda online sin excesivos conocimientos.  </p>  <p>  \tMuchas veces el gran problema que se enfrentan mucho pequeños empresarios con sus tiendas locales es a enormes presupuestos de empresas para diseñar sus tiendas, teniendo que aprender sistemas complicados de gestión.  </p>  <p>  \tEste mini curso te enseñará una plataforma donde reúne todos los requisitos necesarios para hacer de tu gestión mucho más fácil.  </p>  <p>  \t<strong style=\"\">En la primera clase</strong> me presentaré y conocerás el acceso a tu tienda y los primeros pasos de configuración.  </p>  <p>  \t<strong style=\"\">En la segunda clase</strong> aprenderás a personalizar la estética de tu tienda, existe numerosos diseños para elegir. Además comenzarás a insertar tus primeros productos.  </p>  <p>  \t<strong style=\"\">En la tercera definirás</strong> los costes de envío y podrás elegir entre numerosos empresas de transportes para entregar tus productos. Aquí ademas conocerás algunos ajustes de tu tienda.  </p>  <p>  \t<strong style=\"\">En la cuarta clase</strong> te revelaré los costos que tendrás en tu tienda, te sorprenderán.  </p>  <p>  \t<strong style=\"\">A partir de la quinta clase y hasta la séptima</strong> aprenderás a gestionar todos los menús de la tienda. Desde la creación de categorías de productos hasta la creación de tu blog, algo muy importante que también puedes tener.  </p>  <p>  \tLo bueno de este curso es que con pocos conocimientos e inversión puedes empezar a generar ventas en internet e incluso en facebook, seguramente una salvación para muchos comercios que estén pasando por apuros.  </p>", 
    "end_date": null, 
    "title": "Aprende a Crear tu propia Tienda Online Sin Conocimientos", 
    "price": 0, 
    "instructors": "Rubén Molinero", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357322_0725_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-crear-tu-tienda-online/", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T21:00:12Z"
}