{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">NEW COURSE - INTRODUCTORY PRICING UNTIL APRIL 30 2016</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Are you a B2B sales professional?</strong> More specifically, are you a <strong class=\"redactor-inline-converted\">sales hunter</strong>? Are you someone who likes to control your own destiny and not sit back and wait for opportunity to come to you? If so, then this course is for you!</p>\n\n<p>This course is for salespeople or sales development reps who are interested in learning how to find new sales opportunities and get the jump on your competition by leveraging LinkedIn along with its information and deep insights on its 400+ Million members. Recognizing that <strong class=\"redactor-inline-converted\">75% of B2B buyers</strong> are now using social media to make purchasing decisions, and that <strong class=\"redactor-inline-converted\">80% of B2B social media leads</strong> come from LinkedIn...learning how to effectively tap into this system has the potential to pay huge sales dividends.</p>\n\n\n\n\n\n<p>In this course, you will learn a social selling process along with social engagement best practices. You will also learn how to recognize where a prospect is within their B2B buying journey. Combining these insights will empower you to position yourself in the right place, at the right time, and with the right information. </p>\n\n\n\n\n\n<p>Although you are most likely already familiar with LinkedIn and how to use it for sales prospecting, opportunity development, and customer retention...there are some sales focused hacks and tactics that are often overlooked, unknown, or even under utilized. In this course you will learn how to improve your prospecting skills and uncover new sales opportunities by leveraging these hidden sales gems.<br></p>\n\n\n\n\n\n\n\n\n\n<p>You will learn how to build a solid LinkedIn presence that speaks directly to your prospects and clearly articulates the value that you have to offer. This will be the first thing that your potential customers see when they click on your profile which ranks higher than your competitors within search results.</p>\n\n\n\n\n\n<p>You will learn how to identify and engage with the right groups and stakeholders on LinkedIn. Along with knowing how to cut through the \"noise\" to engage in conversations with these prospects, you will also learn proven methods on how to convert these interactions into new connections and offline sales conversations. </p>\n\n\n\n\n\n<p>You will also learn a number of tactics that you can use to tap into the opportunity that comes from your LinkedIn connections as well as a number of secrets on how to also tap into your competitors connections and activities.</p>\n\n\n\n\n\n\n\n\n\n<p>There are a number of downloadable materials that will help you to get the most from this course and assist you to take your social selling capabilities to the next level.</p>\n\n\n\n\n\n<p>As a 25+ year B2B sales veteran and an active LinkedIn user since January 2004...I have learned a number of sales specific tips and tricks that I now want to pass along to you. According to my LinkedIn Social Selling Index, I am ranked within the <strong>top 1% of sales professionals</strong> within the computer software industry. I have created this course to help you to get the most out of LinkedIn, and to empower you to know how to turn LinkedIn into your competitive sales advantage.</p>", 
    "end_date": null, 
    "title": "B2B Social Selling - LinkedIn Sales Hacks", 
    "price": "30.00", 
    "instructors": "Randy Whitcroft", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814112_73e9_2.jpg", 
    "course_url": "https://www.udemy.com/b2b-social-selling-linkedin-sales-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T03:47:11Z"
}