{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Today you will have a business fully functional app ready to submit to the Apple app store.</strong>  </p>  <p>  \t  \t            Have you ever wanted  an app to promote your business or sell your knowledge using youtube videos through a mobile app?  </p>  <p>  \t  \t            Maybe you did not have time, money or expertise to pursue it? No worries. With my source code you don´t need to program anything. (The course do not provide the source code. You must buy it for $99)</p>  <p>  \t  \t            You will follow step by step, how to change images, URLs of videos,  IDs and to create certificates easily.  </p>  <p>  \t  \t            Today you will have a fully functional app ready to submit to the app store for<strong> Iphone and Ipad</strong>. You will be provided the source code and the instructions on how to customize it. You will also get the essential tools for editing code and submitting to the Apple App Store.  </p>  <p>  \t      The original app is published on the App Store under the name:  </p>  <p>  \t      \"Marketing para Aplicaciones - Curso en video para tus apps para móvil\". (You can check it)  </p>  <p>  \t  \t            The code provided with the course cost me $1200 to develop. It has been used as my own tool of promotion and for selling my own videos hosted in youtube for free (not shared mode). Please, see video introduction to check the app.  </p>  <p>  \t<strong>I want you to be successful</strong>:  </p>  <p>  \t  Yes, I have worked more on this course to show you the fundamentals of ASO (APP Store optimization). So, you get the idea about how to get more traffic for your app.  </p>  <p>  \t<strong>App Features</strong>:  </p>  <p>  \t<strong>It has the option to display: </strong>  </p>  <ol>  \t<li>Your free videos on Youtube.</li>  \t<li>Your videos hosted on Youtube on hide mode. They must pay to watch them.</li>  </ol>  <p>  \t<strong>It has four options to monetize:  </strong>  </p>  <ol>  \t<li>Selling all the videos at the same time (you can offer a discount, for me the offer to unlock all paid videos for 50% OFF works very well).</li>  \t<li>Selling the videos individually.</li>  \t<li>Selling the option to remove ads.</li>  \t<li>Monetize with ads if the ads are not removed buying the option to remove them.</li>  </ol>  <p>  \t<strong>Three tabs: </strong>  </p>  <ol>  \t<li>Videos</li>  \t<li>Opt-in page. You can display them your webpage and ask them their email.</li>  \t<li>More apps tab. You can show them your other apps to download.</li>  </ol>  <p>  \t<strong>Review option:</strong>  </p>  <p>  \t        When the users play with the app, a pop up window is displayed, asking them for a review of the app. (Reviews are very important to increase visibility).  </p>  <p>  \t        Facebook.  </p>  <p>  \t        When the users play with the app, a pop up window is displayed, asking them for a comment on Facebook, to publish that the user is using the app.  </p>  <p>  \t  </p>  <p>  \t<strong>What will you do with the code?</strong>  </p>  <p>  \t        You can use it for:  \t            -   Display free videos to promote your business.  \t            -   Make the user pay for videos that shows something.  \t            -   Generate more traffic to your website coming from the app.  \t            -   Generate more leads to increase your list.  \t            -   Earn money with ads if you wish.  \t            -   Earn credibility for your users.  </p>  <p>  \t  \t            All without changing a line of code, only changing the specific values I explain on the lectures.  </p>  <p>  \t  \t            I recommend to let the app for free in the App Store to maximize the downloads. Inside the app, you can offer paid videos.  </p>  <p>  \tThis course has more than 1.5 h to show you all you need to know about reskin the app.  </p>  <p>  \tGet the code, the course and Have fun. Let me know if you have any questions.  </p>", 
    "end_date": null, 
    "title": "Be Mobile and Increase Sales", 
    "price": "50.00", 
    "instructors": "Jordi Martin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338662_0a0b_4.jpg", 
    "course_url": "https://www.udemy.com/be-mobile-and-increase-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T18:24:41Z"
}