{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>A big \"Thank You\" to my students for all of the 5* reviews. I have your interests at heart, and I wlll continue to improve the course based on your suggestions.</strong></p><p>Last updated 1/23/2016: Revising name on 1/23/2016 to include job seeking skills. When you think about it getting a job is a business-to-business sales skill.  Stay tuned for additional lectures.</p><p>Updated: 01/02/2016.</p><p>Added a new <strong>Bonus Responses </strong>section and  responded to a review by Fred Darley about the value of cold calling. I plan to use this section to respond to students thoughts when they bring up a topic that I feel will interest all students.</p><p>The name of the course has been changed as I decided to incorporate it in a series of courses that focus on telemarketing as well as in-personselling in 2016. I'm taking a modular approach that my students tell me they prefer.  Also, I'm upgrading the content.  (The course image will be soon be improved to show the course's level.</p><p> It now includes a lecture that explains how to use the tools in the course to get referrals, and reference material and free goodies in the new Bonus Material section.</p><p>Coming soon: 90 second tutorial videos on sales techniques.</p><p><strong><em>ABOUT THIS COURSE</em></strong></p><p><strong>Increase Sales to Prospects, Clients and Customers</strong></p><p>DO YOU WANT MORE REFERRALS, MORE NEW SALES, MORE SALES PER CUSTOMER? You can do that by using the telemarketing and telesales techniques in this course to strengthen relationships with prospects and customers.  </p><p>Let's take a couple of examples. </p><p>Example #1:  You've been trying to convert a prospect to a customer, but are not having success. You try calling the prospect and talking to them about a poem that you recently read. You ask them if you can e-mail them the poem and get their opinion. They agree. You e-mail them the poem, and then call them back to discuss it. </p><p>The poem focuses their attention on the importance of communication. Your prospect spends five minutes explaining how important communication is to him.  She then realizes that she want to buy from you and places an order. </p><p>More referrals and more sales to existing and new customers are not only possible, they are within easy reach when you use some of the simple techniques in this course to motivate prospects, customers and clients to want to buy from you.</p><p>Example #2: Try as you can, you are in a slump. It doesn't seem to matter what you do, Every phone call you make results in a customer or prospect putting off the decision to buy. You watch the video in Lesson 13 and then you send this e-mail to one of your customers: The email does not ask them to buy anything. Instead, it asks their opinion about a one-page document. Your customer is flattered because you have shared this personal item with them. When you call them to follow up on the e-mail, they enter into a personal discussion with you about your values. After a minute or two, the customer says, \"Jerri, I don't need anything this week, but why don't you touch base with ...\" She provides you with two referrals. You call the referrals and close a sale. You're out of your slump.<br></p><p>The techniques in this course are simple, and effective. They work because they empower you to establish and build rapport, something that is often difficult for inside (telesales) salespeople to do. The best part is that you can put them to use in one hour.</p><p>You have no risk.  Click the \"Take this Course\" button now,and start to realize higher sales.<br></p>", 
    "end_date": null, 
    "title": "Be the Winner-Telesales & Job Seeking Skills L 2 (Tools)", 
    "price": "20.00", 
    "instructors": "Alan H. Jordan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634008_beaf_8.jpg", 
    "course_url": "https://www.udemy.com/increase-sales-sell-more-to-prospects-and-clients/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T20:02:09Z"
}