{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><strong>A big \"Thank You\" to my students for all of the 5* reviews. I have your interests at heart, and I wlll continue to improve the course based on your suggestions.</strong></strong></p><p><strong>Last Updated: 01/23/2016</strong></p><p><strong>This course is being expanded as of 1/23/16. It will soon include information for job seekers.  If you stop to think about it, getting a job is a business-to-business sales process.<span> I also feel this information is valuable because almost everyone needs to change jobs occasionally. Stay tuned for additional lectures.</span><br></strong></p><ul><li>Added the new <strong>Bonus Response </strong>section where I respond to statements and questions posed by students when I feel that their answers will be useful to many students.</li><li>The lecture (4) on the secret of telemarketing, renewing a prospect's attention every 18 seconds, was replaced with a video with higher quality audio. I'm still working on this lecture, and plan to upgrade it again soon.  (I've had my share of technical issues with audio, and I've invested in new equipment. I'll be upgrading the lessons over the next four weeks with my new equipment.)</li><li>An additional lecture (lecture 5 which explains how the <strong>Law of Attraction </strong>dramatically affects cold calling has been added.</li></ul><p><br></p><p><strong>About this Course:</strong></p><p>This module focuses on integrity-based Business-to-Business telephone canvassing. (Much of the information in it also works for in-person sales as well as telemarketing.) <strong>Y</strong><strong>ou'll be more productive within two weeks.</strong><br></p><p>Truly understanding your product or service, from each customer's point-of-view is the key to everything from preparing every sales presentation an effective cold telemarketing call to an \"elevator\" pitch that you deliver face-to-face.</p><p>This module empowers you to answer a series of questions that will help you to identify these<strong> magic sales words for each of your products. </strong>At first, you'll find this difficult to do. However, you'll probably be surprised at how easy it is, once you set up the right environment.</p><p>Perhaps the second most valuable thing that you'll get from this course is a full understanding of a why it's necessary to renew your prospect's interest every 18-seconds. Once you understand this, you'll be much more productive. </p>The course includes:<p><br></p><ul><li>Videos that provide step-by-step processes for developing succinct sales phrases that set you aside from other salespeople;</li><li>Audio lectures that help you to focus on developing your magic sales words;</li><li>Integrity-based telephone sales presentations; and</li><li>Supplementary written materials</li></ul><p>If you are highly motivated, you can do this course in one day, but it's probably best to digest each lecture and budget a week to finish. </p>Purchase this course if you:<p>Are an inside or outside salesperson who wants to close more sales;</p><ul><li>Manage salespeople and want a resource to motivate them to do their best; or</li><li>Want to support a salesperson or sales manager;</li><li>Are not involved in sales but want to persuade people to adopt your ideas.</li></ul>", 
    "end_date": null, 
    "title": "Be the Winner-Telesales & Job Seeking Skills L1 (Techniques)", 
    "price": "20.00", 
    "instructors": "Alan H. Jordan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596014_d6ab_5.jpg", 
    "course_url": "https://www.udemy.com/self-interviews-to-craft-succinct-sales-phrases-sell-more/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T16:16:05Z"
}