{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>John Sweeney is the owner of the Brave New Workshop, the oldest satirical and improvisation comedy theater in the US. Even before buying the theater and becoming an improviser, John was a successful sales professional, but he wishes he knew then what he does now, as the skills required for improvisation can be directly correlated to successful selling techniques. With the help of a few simple improvisational behaviors John was able to grow his business from four employees and $260,000 in annual revenue to eighty-five employees and over $3 million in annual revenue. He remains the Chief Sales Officer of his company and he attributes his success to his ability to be curious and truly listen to his clients, be diligent about building solutions for their specific needs, be nimble and persist when he encounters objections, and remain confident in the value he brings.</p><p>John's methods have been honed and perfected as a result of over 15 years of collaboration with Fortune 500 companies such as Microsoft, PwC, General Mills and UnitedHealth Group. </p><p>He has found that improvisation is the perfect vehicle to work on one's selling mindset and behaviors, because it breaks down complex social interactions, people dynamics and cultural norms to the very basics of humanness and how we collaborate, communicate and create.</p><p>This course is set up as a 30-day challenge. Each day, John will give you a new sales thought or concept to work on for the day, as well as a challenge activity to help make the integration real so you can start seeing tangible sales results. </p><p>And… because it comes from John Sweeney and the Brave New Workshop team, you can count on this <em>not </em>being your typical sales training. Over the course of the next month, expect to laugh and grow a little each day, while painlessly gaining an entire arsenal of new selling techniques. </p>", 
    "end_date": null, 
    "title": "Become a Sales Master: The 30-Day Sales Boost Challenge", 
    "price": "20.00", 
    "instructors": "John Sweeney", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554828_74ab_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-sales-master-the-30-day-sales-boost-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T21:39:12Z"
}