{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t      Learn the concepts of the full 360 recruitment cycle, picking up skills, tips, tricks and hints, as well as theoretical and practical knowledge, to allow you to develop a successful career as a top biller. Become a revenue generating superstar!  </p>  <p style=\"\">  \t<strong style=\"\">Build your portfolio as a super biller by following the simple steps in this course to enhance your understanding of recruitment, whatever level of ability you currently possess.</strong>  </p>  <ul style=\"\">  \t<li>Generate leads and new business</li>  \t<li>Taking a job specification</li>  \t<li>Use assertive sales techniques</li>  \t<li>Become effective at closing</li>  \t<li>Maximise revenue through continued business development</li>  \t<li>Perform in depth, control based candidate qualification</li>  \t<li>Build strong questioning and listening skills</li>  \t<li>Understand continual pipeline building</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Powerful ideas you can apply today to build your brand and monetize your skills</strong>  </p>  <p style=\"\">  \t      Recruiting is big business, but with changing job markets, increasingly competitive resourcing capability, and higher candidate awareness, you need to develop the skills that will set you apart from the rest as one of the best. Pick up essential ideas around how to become a top biller, building ideas to develop a consistent business model and maintain healthy relationships.  </p>  <p style=\"\">  \t      You don’t want to be a flashy salesman; use this course to develop subtle ideas around how best to enhance your skillset without damaging your reputation. Earn respect, trust, and build authenticity to get the best results for you, your candidates, and your clients.  </p>  <p style=\"\">  \t      If you are looking to get a start in a career in recruitment, have hit some stumbling blocks, or want ideas on how to adequately build your profile, this course is for you.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t      You will look at the entire scope of the 360° recruitment cycle, using the key principles of this process and the sales environment to develop an understanding and appreciation of the whole process to build your own brand and business.  </p>  <p style=\"\">  \t      We start off looking into simple, but effective, ideas around generating leads and winning new business, as well as how to properly take a job specification, not just a few lines jotted down we forget about. You will understand how to effectively prioritize the roles you have on offer, avoiding wasting time on opportunities that have limited success ratios, whilst building those where we can get the biggest wins.  </p>  <p style=\"\">  \t      You will spend time looking at relationship building and candidate control, using thorough qualification methods to ensure we are working with the highest calibre individuals. As we develop, you will learn how to sell roles to candidates, candidates to clients, and sell yourself as a trusted partner.  </p>  <p style=\"\">  \t      An insight into the ideas around fact finding and analysing needs combined with selling back to these will arm you with the tools you need to produce useful, powerful, targeted pitches. Management also plays a critical role for any recruiter; managing the interview process and the people involved, steering your relationships the way you want them to develop.  </p>  <p style=\"\">  \t      We will end by showing you how to effectively close throughout the entire cycle, ensuring you never have issues around turn-downs and people accepting counteroffers. Dealing with objections helps you close, and we’ll show you a simple, yet highly effective objection handling model, ensuring you develop the best ability to close, and giving you the highest conversion rate.  </p>", 
    "end_date": null, 
    "title": "Become an Expert Recruiter and Top Biller - 360° Essentials", 
    "price": "20.00", 
    "instructors": "Piran Consulting", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403286_14ba_3.jpg", 
    "course_url": "https://www.udemy.com/360-recruitment-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T01:00:19Z"
}