{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you losing sales because you&#039;re <strong style=\"\">not &quot;good&quot; at follow-up</strong>?<strong style=\"\"></strong></p><p>Does your <strong style=\"\">current sales pipeline software take a Masters Degree to use</strong>? </p><p>Do you <strong style=\"\">wish that your website, email and sales management system would speak to each other</strong>? </p><p>You may have looked around at highly-priced options that involve training, IT department approval or complex set-ups.</p><p><em style=\"\">There must be an easier way?</em></p><p><strong style=\"\">---</strong></p><p>If you are looking for a sales pipeline system that is simple to use (and want to forgo the 10x cost and 10x time commitment of complicated solutions!) then you&#039;ve found the right course to take you from setting up to settling in.</p><p>This course will lead you step-by-step through the process of:</p><ul style=\"\"><li>Building a website form that clients will want to fill in</li><li>Connecting your form to your website</li><li>Handling leads from your website, via email and over the phone</li><li>Providing reporting for yourself, your manager or your investors</li></ul><p>Even though this is a simple course, it provides the most comprehensive look at how you can set up your sales pipeline in a few short hours. I welcome your feedback and look forward to helping you get your sales pipeline set up for success (aka no more sales falling through the cracks)!</p><p><strong style=\"\">---</strong></p><p>Have I missed a topic you would like covered?</p><p>Have a question relating to the course?</p><p>Message me here on Udemy!</p><p>Please don&#039;t forget to leave me a comment and a rating, every little bit of love helps :)</p>", 
    "end_date": null, 
    "title": "Build A Sales Pipeline & Never Lose Track Of Leads Again", 
    "price": "20.00", 
    "instructors": "Rich Peterson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502580_a485_4.jpg", 
    "course_url": "https://www.udemy.com/creating-a-pipeline-lead-management-system-to-track-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T04:33:46Z"
}