{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do you want to grow your business faster and more meaningfully? <em>Business Transforming Sales Prospecting for Entrepreneurs </em>is a blueprint for sales growth, created by an entrepreneur, for entrepreneurs. </strong></p><ul><li>Are you serving clients that suck your time and don't provide much profit or enjoyment?</li><li>Are you tired of wasting your time with sales efforts and networking that doesn't work?</li><li>Do you feel like everybody else knows the secret about sales that you don't?</li></ul><p><br></p><p>I have been there. </p><p>Created by a serial entrepreneur with years of experience and current founder of a fast growing company, <em>\"Business Transforming Sales Prospecting for Entrepreneurs\"</em> is the result of years of refining through trial and error, a basic formula and blueprint that will make a huge difference and can be easily adapted and modified to suit your needs! </p><p>By the time you complete this course, you will be able to</p><ol><li>Effectively target the right type of clients.</li><li>Know how to recognize and define the best customers for you to reach out to.</li><li>Build prospecting lists of ideal prospects for you.</li><li>Be armed with the right tools to help scale your efforts, do more with less. </li><li>Feel confident knowing exactly how to reach out and prospect (without being too salesy).</li><li>Know exactly how to follow-up (without being annoying, or driving yourself crazy).</li><li>Be armed with the right mindset to keep you on track, and make you more powerful.</li><li>Be equipped with tips and tricks for your back pocket to help you get through the hard parts and awkward moments of sales with ease and grace.</li><li>Know how to do all this on your own, or with a very small team.</li><li>Know how and where to modify the baseline process to work for you and your  business.<strong></strong></li><li>Overcome the fears and doubts that many entrepreneurs (women in particular) have when it comes to sales and growth.</li></ol><p>My Story:</p><p>This is the same practice that instructor Genevieve LeMarchal began implementing over a year ago in her business and immediately grew from $0 in pipeline to $750k in qualified pipeline opportunities within 3 months. </p><p>There is no big secret, complicated process, or magical beans. It's really simple. Genevieve herself does exactly what she teaches in this course, every single day. And it works. In fact, this year, in the first two months of the year her business booked as much revenue as the entire year prior.</p><p>After spending a few months teaching this to entrepreneurs gathered in her kitchen, this course is specifically designed for entrepreneurs  who are growing and scaling, this course is all about targeted prospecting, and filling your pipeline with customers hand selected by you.</p><p><strong><br></strong></p><p><strong>Learn to leverage a powerhouse sales prospecting strategy into a sustainable and growing sales pipeline!</strong><br></p><p>If you want to learn how to get more of the right types of clients that your business needs to grow, this course will teach you exactly what to do to get started. Most of the time this process is implemented over 4-6 weeks and in many cases, you'll start seeing immediate results. </p><p><strong>In addition to a blueprint for sales prospecting, I also teach the critical other side of the equation for success and growth in your business. </strong></p><p>The everyday hustle is only half of the work. Once you began to incorporate techniques of mindfulness, visualization, and other practices, your sales productivity and success will grow even more.<br></p><p>This course will equip you with the tools you will need to do the following:</p><ul><li>Recognize what is important and what is not in terms of achieving real, meaningful growth.</li><li>Learn to recognize and spot things that will deter you from success.</li><li>A daily practice to help hone your mind into a powerhouse for success.</li><li>A daily practice to help add more power to basic meditation and mindfulness practices, used by some of the most successful entrepreneurs.</li><li>Frameworks and structures to help you get clear on where you are at and what you need to do.</li></ul><p><strong>Udemy students also get access an exclusive section of my website chock full of resources, tools, PDFs and links to help you.</strong><br></p><p><br></p><p><strong>What people are saying about <em>Business Transforming Sales Prospecting for Entrepreneurs:</em></strong></p><p><em>\"There is an elephant in the room when it comes to starting any business -- bootstrapped or venture funded. That elephant is called sales. At the end of the day, the single most critical skill that any entrepreneur must develop is the ability to sell their product to customers, retain those customers, and obtain referrals. That process is, oddly, where entrepreneurs spend the least amount of their time. Genevieve is an outstanding sales coach, offering practical, results-driven, real world coaching that will take your business from zero to sixty. We saw results within the first week of implementing.\"  - Mara Zepeda, Founder and CEO | Switchboard <br></em></p><p><br></p><p><em>\"Genevieve taught me how to develop my sales process and it's making a huge difference for us.</em><em> We had the biggest quarter that we have ever had, we could barely keep up. The business has taken off in incredible ways and it's all because of what we learned with this process. Highly recommend!\" - Paige Hendrix Buckner, Founder and CEO | ClientJoy </em><br></p><p><br></p><p><em>\"This course gives clear explanations of processes that we may use to create or modify a b2b prospecting system. This is just the right blend of theory, practical application, and recommended resources to make this course a real value. Well worth the time invested.\" - S.Hendricks</em></p><p><em><br></em></p><p><em>\"Precise actionable insights rooted in the real world, very much applicable to solopreneur or small business. Highly recommend.\" - M. Aggarwal</em></p><p><br></p>", 
    "end_date": null, 
    "title": "Business Transforming Sales Prospecting for Entrepreneurs ", 
    "price": "50.00", 
    "instructors": "Genevieve LeMarchal", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670708_76a7_3.jpg", 
    "course_url": "https://www.udemy.com/sales-prospecting-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T23:44:11Z"
}