{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>**UPDATED MAY<strong> 2016</strong>**</strong> Called <em><strong>\"the best course on Startup Business Development on the internet. A total shortcut for anyone looking to hone their skills\"</strong></em></p>\n\n<p>  \t   Companies explode when they crack the code to business development.  </p>\n\n\n\n\n\n\n\n<p>  \t   I know first hand after the last company I was doing business development for sold for 100 million in less than 3 years after it started.  </p>\n\n\n\n\n\n\n\n<p>  \t   The challenge is only a very small percentage of people actually know what they're doing when it comes to <em>achieving massive, scalable growth</em>through the business development.  </p>\n\n\n\n\n\n\n\n<p>  \t   Even worse, there's practically no comprehensive training material on it. In fact, mentorship and training is only available through years of working alongside the best or high-end consultants that costs hundreds of dollars an hour.  </p>\n\n\n\n\n\n\n\n<p>  \t   This disconnect is why so many companies are missing out on unlocking incredible growth and most \"business developers\" can't deliver on the results they promise.  </p>\n\n\n\n\n\n\n\n<p>  \t   This course was created to change that and <em>has only been available amongst a private, group of elite Business Development professionals until now</em>...  </p>\n\n\n\n\n\n\n\n<p>  \t   This isn't one of those training programs that gives you some basic theory and sends you out into the trenches only slightly better off then when you started...  </p>\n\n\n\n\n\n\n\n<p>  \t   By the end of this training you will be armed with breakout business development cunning and an arsenal of proven tactics for every situation you'll face.  </p>\n\n\n\n\n\n\n\n<p>  \t   Need to nail biz dev strategy and don't know where to start? - you're covered  </p>\n\n\n\n\n\n\n\n<p>  \t   Can't get meetings with high leverage prospects? - you're covered  </p>\n\n\n\n\n\n\n\n<p>  \t   Prospects not receptive or getting back to you? - you're covered  </p>\n\n\n\n\n\n\n\n<p>  \t   Can't get a stalled deal to close? - boom, you'll learn how to disarm that too  </p>\n\n\n\n\n\n\n\n<p>  \t   This training covers the whole business devleopment stack from providing frameworks to establish your strategy to rogue cold emailing &amp; calling strategies you can use to get meetings with anyone. You'll also learn how to pitch like powerhouse and push deals through the finish line with clockwork consistency.  </p>\n\n\n\n\n\n\n\n<p>  \t   This premium training is perfect and has already delivered results for:  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Companies who want to unlock the next-level growth available by creating Business Development partnerships and growth relationships</li>  \t<li>Senior business development professionals looking to sharpen their spear with unconventional, proven tactics</li>  \t<li>Managers who want to save time and provide their teams with the absolute best business development training available</li>  \t<li>People who are new to business development or want to work in this role and are trying to get a leg up on everyone else</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t   When you're done this course, new levels of excellence will be in reach...as well as the big time personal rewards that comes comes with that.  </p>\n\n\n\n\n\n\n\n<p>  \t  \\  </p>\n\n\n\n\n\n\n\n<p>  \t   Below you can find out exactly how the training is laid out, but real quick here are the sections:  </p>\n\n\n\n\n\n\n\n<ol>  \t<li>Introduction and Developing An Offensive Mindset - Understand the function of Biz Dev and develop mindsets for success</li>  \t<li>Strategy - Performing Leverage Audits, Strategy Options, Choosing Your Strategy, First Deal Tactic Selection</li>  \t<li>Outreach - Isolating Key Stakeholders, Cold Emailing, Cold Calling, and Mastering Turning Rebuttals into Meetings</li>  \t<li>Powerhouse Pitching - First Meetings, Positioning, Pitch Deck Construction, Pitch Execution, Pre-sales Tactics (<em>advanced</em>)</li>  \t<li>Winning In The Deal Funnel - Objections, Dialogue Continuity, Relationship Building, Getting Buy-In, Deal Terms, Negotiation, and Closing Tactics</li>  \t<li>Implementation and Inbound Opportunities - Implement and Expand Inked Deals; Strategies for Creating Inbound Opportunities</li>  </ol>\n\n\n\n\n\n\n\n<p>  \t   Trust me, this is just a small sample of what you'll learn and by the end of this course you'll have every tool you need in order to tap into your full business development potential.  </p>\n\n\n\n\n\n\n\n<p>  \t   I will personally respond to any questions you may have as you go through the material so there's no worry if you're not sure how to take all of the information and apply it to your business.  </p>\n\n\n\n\n\n\n\n<p>  \t   AND you'll have access to all of this material as well as the newest stuff I share with everyone on the inside of the course for life!  </p>\n\n\n\n\n\n\n\n<p>  \t   REMINDER: <em>this is a risk free purchase </em>with Udemy's 30 day money back guarantee. Nothing to lose, everything to gain.  </p>\n\n\n\n\n\n\n\n<p>  \t   Hope to see you on the inside,  </p>\n\n\n\n\n\n\n\n<p>  \t   -Scott Britton  </p>\n\n\n\n\n\n\n\n<p>  \t<em>BTW - This training is something I've kept off of everything but my own private community site for a long time due to weariness of exposing too many trade secrets. After finally getting convinced by some students that more people needed to see it, I decided to put it up here on Udemy. I can't guarantee I will keep making it available to purchase forever considering my initial concerns, so I'd grab it while you still can.</em>  </p>", 
    "end_date": null, 
    "title": "Business Development For Startups and Tech Companies", 
    "price": "50.00", 
    "instructors": "Scott Britton", 
    "commitment": "30.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/200994_5de4_2.jpg", 
    "course_url": "https://www.udemy.com/business-development-strategy-startups/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-18T01:46:28Z"
}