{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Course Update: Added more tips and tricks in May 2016.</em></p><p><strong class=\"redactor-inline-converted\">The information in this course will enable you to make business networking easier and more comfortable... so you will connect with more people faster.</strong></p>\n\n<p>Business is all about connecting with people. The good news is we can all learn to network. Human beings are social creatures. Even if you are shy or introverted you have an innate, genetic ability to form relationships with other people. We are all networking all the time.</p>\n\n\n\n\n\n\n\n\n\n<p>The trick is to understand how networking actually works... how we meet someone, get to know them, and decide if we want to create a relationship. The old rules of networking don't work in the 21st century. The old networking process where you create an elevator speech, hand out a bunch of business cards and try to connect with them after the event. Even if you do meet someone at a networking event when you reach out later they don't take your call or return your emails. That may have worked in the past, but it doesn't create connections any more.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">There's more to networking than just an elevator speech.</strong>\n</p>\n\n\n\n\n\n\n\n\n\n<p>Many people make the mistake of focusing too much on their networking introduction to carry the weight. An elevator speech isn't enough to truly connect with someone. If you only focus on your introduction you can miss out on the rest of the conversation.The conversation is where the connections happen. You need a way to engage people in conversations that doesn't limit you but is comfortable and natural.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn to drop the elevator speeches and engage people in real conversations.</strong></p>\n\n\n\n\n\n\n\n<p>Relationships are two-way interactions. That's why networking conversations and connections are so important to building profitable relationships when you go to professional events or conferences.  People respond to networking authentically... just being yourself can go a long way. But it's not enough by itself.<br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here's what one student had to say about this course...</strong></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"I never wanted to network again... I had terrible experiences networking early in my career. It put me off to even going to work events. The stress just wasn't worth it. After working with Eric the doors opened. The techniques I learned have enabled me to meet clients as easily as chatting over a cup of coffee with a friend. The emphasis on story and being conversational were particularly useful to me. Pitch for Success made it easy to network.\" </em></p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">KIMBERLY LAFAVE Certified Mediator &amp; Paralegal</em></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Secret Lies in the 5-Stage Networking Process.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>When you meet people you are following a process... whether you realize it or not. I've just identified what it is and I can teach you to use it to your advantage. I've spent 30 years in business as a sales person, entrepreneur, trainer and business coach. In that time I've learned that networking can make a huge difference in everything you do, if you do it well.<br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">My network helped me get a job offer in 1 1/2 hours.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>In 2009 I lost my job. I activated my network and in no time had multiple job offers. The people I was connected to spread the word for me and the job offers flooded in.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">My network helped me start a successful business.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Instead of taking any of those jobs I used a connection my network brought me to start a successful IT training business. I worked for companies like Cisco, SAIC, Polycom and organizations like Freddie Mac, NATO and Virginia Polytechnic Institute... all because of how I meet people and built connections with them.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Now I teach you how to have the same success whether you're trying to start a business, grow a company, get a promotion or a new job.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>When you know what process to follow you know exactly what to do when you're networking. When you can do the right thing at the right time you improve your chances of connecting with people who matter to your success. Those connections have a higher probability of turning into real, meaningful, profitable relationships for you, and for them.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Follow the process and you WILL meet more people... and get more follow up meetings. That will make networking work for you too.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>That's what this course is all about... empowering you to create profitable business relationships. This program is designed to teach you the skills you need to excel at business networking in the 21st century. And to make it easier and more natural too.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">You need to connect to build relationships... this course can help.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Whether you're brand new to business networking or you have been networking for years our courses and programs help you improve your skills, increase your confidence and boost your ability to build a network naturally and comfortably. Everything we do is based on building Relationships, being Authentic and effective Storytelling.</p>\n\n\n\n\n\n\n\n\n\n<p>  \t    <strong class=\"redactor-inline-converted\">Networking is a Process... Know the Process and You'll Know What to Do Every Time</strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t    Many people don't realize that there are <strong class=\"redactor-inline-converted\">5 Stages in Networking</strong>. Whenever you meet people you are moving through these stages. If you don't know how the process works then how are you supposed to know what to do at each stage? </p>\n\n\n\n\n\n\n\n\n\n<p>The answer is to understand the process of business networking so you know exactly what to do and exactly when to do it... anywhere, any time. Without taking years or months to fumble around and figure it out by yourself.</p>\n\n\n\n\n\n\n\n\n\n<p>  \t    <strong class=\"redactor-inline-converted\">\"But I already know how to network...\"</strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t    Maybe you've got the basics down, you just need some help refining your approach. It's possible you're just struggling with a particular area of the process. Focusing attention on improving just one thing could make all the difference between a nice chat and scheduling that important follow up appointment with a new client.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t    <strong class=\"redactor-inline-converted\">Meeting more people isn't the key... it's meeting more of the RIGHT people.</strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t    The question is, are you making the most of opportunities to meet the people you can connect with? Are you getting in front of the people who you can build profitable relationships with? </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Stop Winging It and Start Bringing It</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>  \t    <strong class=\"redactor-inline-converted\">Enroll in the course today</strong> and start on your own journey to meeting people, making connections and building a strong network of relationships.  </p>", 
    "end_date": null, 
    "title": "Business Networking Made Easy", 
    "price": "40.00", 
    "instructors": "Eric Byrd", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226664_b5aa_4.jpg", 
    "course_url": "https://www.udemy.com/network-with-ease/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T20:55:01Z"
}