{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      B2B Selling Skills is for two types of Salespeople - ones that are just starting their sales career and want to <strong style=\"\">fast track their skill levels to a higher grade</strong>, and also for experienced sales professionals that want to <strong style=\"\">further advance and improve their skills </strong>to operate at a more productive and profitable level.  </p>  <p>  \t      This course is specifically for <strong style=\"\">Customer Facing Salespeople</strong> who are selling a product or a service that is a <strong style=\"\">Considered Purchase</strong> i.e. the customer has a number of choices in the market place based on solution, price, delivery, quality, guarantee or function  (they don&#039;t just rock up and buy the product without the salesperson being involved).  </p>  <p>  \t      The course will take about <strong style=\"\">3 hours to complete</strong> and includes <strong style=\"\">15 video presentations</strong> by Ken Fowler (in person, not talking over a PowerPoint presentation), accompanied by supporting documentation and worksheets.  </p>  <p>  \t      As you progress through the training you will complete five worksheets which will be used at the completion of the course to <u style=\"\"><strong style=\"\">produce your personal B2B Selling Skills Sales Strategy</strong></u>.  This is the &#039;Holy Grail&#039; of selling tools and once you have done yours, you will wonder how you ever survived without it and <strong style=\"\"><u style=\"\">YOU WILL USE IT FOR EVER</u></strong>.  </p>  <p>  \t      Plus, I&#039;d like you to <strong style=\"\"><u style=\"\">send it to me</u></strong> so I can review it and make sure you have squeezed the most out of the course to maximise the benefit from your investment.  </p>  <p>  \t      Let me say right from the outset that there is <strong style=\"\">no trickery or gimmick or &#039;secret formula&#039;</strong> to B2B Selling Skills.  It is good fundamental common sense logic that is used all around the world and the foundation of sales success in every industry.  </p>  <p>  \t      Go on, get into it and see what you will learn.  I bet you are dying to find out what <strong style=\"\">THE KILLER QUESTION</strong> is. When you start using it you will suddenly find out why your customers are going to buy (or not going to buy) and <strong style=\"\">this information will shock you</strong>!  </p>  <p>  \t      It is my wish to improve the selling skills of all salespeople with this course so that you can really enjoy your career in sales, take pride in being able to identify and satisfy your customers needs, and be able to make to make a profit out of it.  </p>  <p>  \t      Profit - It&#039;s not a dirty word.  </p>  <p>  \t<u style=\"\">If you don&#039;t make a profit out of your sales then everyone loses because </u><strong style=\"\"><u style=\"\">nothing happens until somebody sells something!</u></strong>  </p>  <p>  \t      Think about this for a moment - it will give you an insight into <strong style=\"\">my PASSION for sales</strong>.  </p>  <p>  \t       No one designs anything, no one manufacturer&#039;s anything, no one ships anything, no one receipts anything, no one warehouses anything, no one counts anything, no one invoices anything, or analysis it, credits it, guarantees it or delivers it or gets paid for anything <strong style=\"\"><u style=\"\">until somebody sells it.</u></strong>  </p>  <p>  \t<strong style=\"\"><u style=\"\">EVERYONE ELSE&#039;S JOBS DEPEND ON YOU SELLING SOMETHING!</u></strong>  </p>  <p>  \t      It all starts with you.  </p>  <p>  \t      So I think that&#039;s a pretty good reason for you to do this course.  </p>  <p>  \t      (plus it&#039;s fun).  </p>  <p>  \t      What do you think?  </p>", 
    "end_date": null, 
    "title": "Business to Business Selling Skills", 
    "price": "40.00", 
    "instructors": "Ken Fowler", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428642_3526_5.jpg", 
    "course_url": "https://www.udemy.com/b2bsellingskills/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T19:05:29Z"
}