{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4>Learn How To Research, Locate, and Negotiate For Your Next Vehicle From a Genuine Car Salesman</h4>\n\n\n\n\n\n<p>Buying a new car can be a chore. There's research you have to do, spreadsheets to make, assessing the value on your current vehicle, test drives you need to go on, trying to figure out if you should buy or lease... The list goes on and on.</p>\n\n\n\n\n\n\n\n<p>I see it all the time when I'm at work. I can't tell you how many people that have come into my dealership not having a single clue about what they're looking for. I've had so many people scared about being taken advantage of. Look, I get it. Car salesmen have the reputation of being one of the least trusted people out there! The best thing to combat that feeling is to be informed.</p>\n\n\n\n\n\n\n\n<h4>I Want You To Be Informed!</h4>\n\n\n\n\n\n<p>Being informed is one of the best ways in order to get the best deal on a car. A well-informed customer is an easy customer to deal with. Therefore, that's why I created the Car Deal Dominator! I've spent years researching and found the absolute best information to easily research, locate, and negotiate for your next vehicle. I want you to save potentially thousands of dollars on your next vehicle!</p>\n\n\n\n\n\n\n\n<h4>Can't Figure Out What Vehicle You Want?</h4>\n\n\n\n\n\n<p>You're in luck! This is one of the biggest challenges I see people having when deciding to buy a new car. There's tons of options, colors, reviews, and opinions out there. But, it's all fluff! I show you how to cut through all of that and show you how to pick the best vehicle for your needs. And all within your budget! I've pin-pointed six different aspects of a vehicle that will help you figure out why you need a particular model and what you should look for.</p>\n\n\n\n\n\n\n\n<h4>How Do I Find Out the Best Price?</h4>\n\n\n\n\n\n<p>There's lots of different websites out there that claim they have the best price for a car. Only a seasoned car salesman will know which one really has the best price... and that's what I show you! I'll show you what websites have the best pricing information on any vehicle you're researching. I'll also go in depth about why a particular price is the best price out there.</p>\n\n\n\n\n\n\n\n<h4>Don't E-mail Every Dealership Asking For Their Best Deal!</h4>\n\n\n\n\n\n<p>E-mailing a whole bunch of dealerships asking them what their best price is the <strong class=\"redactor-inline-converted\">WORST</strong> idea in order to get the best deal! Why? Here's why:</p>\n\n\n\n\n\n<ul><li>You now have all of those dealerships knowing that you want to buy a car right now.</li><li>They all want you to buy a car from each of them.</li><li>They're all going to call and e-mail you almost <strong class=\"redactor-inline-converted\">EVERYDAY</strong> for a long time <em>UNTIL</em> you buy.</li><li>Their e-mailed price isn't their best price.</li></ul>\n\n\n\n\n\n<p>Why would they e-mail out their absolute rock bottom price when they know you're going to shop that around? I show you how to respond to all of those e-mails and what to do instead of e-mailing everyone for the best deal. You'll learn how to <strong class=\"redactor-inline-converted\">REALLY</strong> get the best deal!</p>\n\n\n\n\n\n\n\n<h4>Locate the Vehicle You Want!</h4>\n\n\n\n\n\n<p>Instead of doing a shotgun approach to buying a vehicle, I show you how to find the actual vehicle you want! I've gone though and found specific places online where you can see what dealerships have the exact vehicle you want!</p>\n\n\n\n\n\n\n\n<h4>How to Deal with Car Salespeople</h4>\n\n\n\n\n\n<p>It takes one to know one! Dealing with seasoned salespeople working on commission can be hectic. I'll show you how they tick, what to say, how to act, and how to use their own words against them!</p>\n\n\n\n\n\n\n\n<h4>How to Negotiate For the Best Deal</h4>\n\n\n\n\n\n<p>Negotiating the best deal takes knowledge, confidence, patience, tact, skill, and persistence. I show you how to set the stage for a successful negotiation. You'll learn how to counter their objections, what to say, and how to act. I'll show you how to deal with anyone you encounter:</p>\n\n\n\n\n\n<ul><li>Your car salesman</li><li>The dealership's closer</li><li>The sales manager</li><li>The finance manager</li></ul>\n\n\n\n\n\n<p>You'll also learn what to do after the sale is closed and what to do before you drive your shiny new vehicle off of the lot.</p>", 
    "end_date": null, 
    "title": "Car Deal Dominator", 
    "price": "20.00", 
    "instructors": "Mr. X", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/865924_2e91.jpg", 
    "course_url": "https://www.udemy.com/car-deal-dominator/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T16:32:38Z"
}