{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Let&#039;s Change The Game…Start Stacking The Odds In Our Favor!</strong></p><p style=\"\">**  Includes -<strong style=\"\"> 5 </strong> - Additional Bonus Coaching Sessions!!!  **</p><p style=\"\">Start Closing Sales - Without Selling!</p><p style=\"\">Build Rapport Faster…</p><p style=\"\">Blow Past Resistance!</p><p style=\"\"><strong style=\"\">Are you Sick and Tired… of not being in control of what happens next?</strong></p><p style=\"\"><strong style=\"\">Ever feel like you&#039;re giving away All Your Expertise for Free </strong></p><p style=\"\"><strong style=\"\">Working Hard to Solve Problems but They Still Don&#039;t Buy !!!</strong></p><p style=\"\">Learn a Selling System that Puts You in Control…</p><p style=\"\"> <strong style=\"\">Take All The Pressure Out of Selling and Start Building Your Business by Design.</strong></p><p style=\"\">Walk through a complete system for selling.</p><p style=\"\">Better Sales Results Start with Better Sales Ideas focuses in on what works and why traditional sales techniques simply don&#039;t work anymore.</p><p style=\"\"><strong style=\"\">If we want something different – We have to do something different.</strong></p><p style=\"\">When we sound like everyone else in sales, then we get treated like every other salesperson.</p><p style=\"\"><strong style=\"\">Good salespeople have good answers, great sales salespeople have great questions.</strong></p><p style=\"\">Sales, prospecting, generating leads, growth hacking all becomes easier once you know how.</p><p style=\"\">Learning to focus on the process and letting go of the outcome is one of the best ways to deal with rejection and staying in control over what happens next. – focus on the next step and let the armature&#039;s concentrate on the last step.</p><p style=\"\">The single biggest thing that separates amateur sales people from professional sales people is their willingness to look at ideas maybe in a new way and then the ability to take action! – What we will be coaching to is a selling system you can drop into your business to start getting specific results on purpose.</p><p style=\"\">Learn the why traditional sales methods just don&#039;t work. How to separate yourself from the competition on such a way that builds credibility and identifies you as the professional they need to work with.</p><p style=\"\"><strong style=\"\">Get the inside stuff no one else gets. Learn new ways to get your call returned and stay in control of what happens next.</strong></p><p style=\"\">If you&#039;ve ever felt uncomfortable with the process of selling and are looking for a different way this course will open the door to opportunity.</p><p style=\"\">There are no magic words, this course is filled with strategies and ideas for the professional seeking a better way to communicate.</p><p style=\"\">Identify the 6 key steps that allow you to focus in the next step – not the last step.</p><p style=\"\">The only requirement is a willingness to look at ideas and the ability to take action.</p>", 
    "end_date": null, 
    "title": "Closing Sales - Business by Design", 
    "price": "45.00", 
    "instructors": "Bob Marx", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545206_4c34.jpg", 
    "course_url": "https://www.udemy.com/closing-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T04:34:43Z"
}