{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>How To Boost Your Confidence, Drastically Increase Your Social Media Connections &amp; Learn Simple Steps To INSTANTLY Double Your Sales Every Week Like A Boss. INSIDE you'll have access to our Virtual Seminar Series, containing 9 Video Modules with over 5 hours of intimate sales training for the average person looking to get out of average and into professional. </p><p><em class=\"redactor-inline-converted\"><strong>Tom P-</strong><br>\"After watching module 7 just a few days ago...my appointment setting was better, my presentation was brief but I tried to follow your \"presentation pointers\"..and now this afternoon my prospect is ready to sign up. Closed Bro.  This training is awesome!!! I will be watching module 8 next and look forward to learning more.\"<strong>  </strong></em><br></p><p><em><strong class=\"redactor-inline-converted\">Helen N-</strong><br>\"Tons of good info in module 5, useful for building my network marketing sales business.  Lots of common sense info - how I can be better prepared, believe, and share the facts. Thanks!\"</em></p>\n\n<p>This course is all about how to do master the main \"Result Producing Activities\" that will lead to more sales that you probably aren't following. I've packed this up into an easy to follow curriculum along with downloadable worksheets to follow along with. I've been making a living as a sales person within many different industries for over a decade and honestly, I've never been that special or above average at anything. I just learned how to network well, use social media with a purpose, set appointments quickly, master my presentations, follow up faster than my competition, give my customers their dream buying experience every time they are with me and most importantly I learned how to always ask for the close! You're going to learn all of these things and more in this course.<br></p>\n\n<p>Over the next few minutes we are going to breakdown what you get inside the Close Prospects Community and how it will benefit you.  You're going to get proven strategies, real techniques and a real game plan to follow.  </p>\n\n\n\n<p>Learn What Simple Changes You Can Make That Resulted In Setting More Appointments &amp; Making More Sales. (Below are the 9 Modules You'll Get During This Course...</p>\n\n<p><br><strong class=\"redactor-inline-converted\">How do we know?  Because we are just like you...</strong><br><img src=\"https://images.clickfunnels.com/46/63c140e0a011e5a85677407d25ef02/Screen-Shot-2016-02-10-at-9.32.31-AM.png\"><br>Trust me, we've been through all your typical sales programs &amp; seminars.  Not only have we've bought those programs before and done those trainings, but we also get paid to speak and hold seminars of our own.<br><br>This course is about real everyday situations that you can apply right now to help fill your pipeline and help you make 2-3 more sales this week and this month. We know that real success comes from picking up momentum from a few good sales, and a few more, and a few more. Those add up to set new records for you.  As much as we'd like to think so, you don't just wake up in a pile of money. </p>\n\n\n\n<ul><li>It had to waste no time getting right into the content, no stories, no motivation, STRAIGHT UP STRATEGIES.</li><li>It had to be easy to follow for any sales profession in any industry.</li><li>It had to teach people more than just closing, it had to go from start to finish of what we do everyday and what we keep in CHECK on a daily basis.</li><li>It had to be SUPER affordable and easy to access over and over again.</li></ul>\n\n\n\n\n\n<p>Every single module in this program comes with a worksheet for you to follow along with and take notes on.  There are also some extra comments and ideas on each sheet to get you thinking and helping you work on your sales process.  When you are done with the program you should have a workbook of all your notes and strategies to take with you where you go and have on hand at all times!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How does the Close Prospects Sales System Work?</strong><br>Close Prospects is a bona-fide proven sales system for sales professionals of all levels. It's not a marketing system that requires additional expenses, cost, time or effort. This system is developed to take your existing leads and prospects and convert them into loyal paying customers or business partners or find new leads and prospects to convert into paying customers or business partners!<br><br><u>Here's how it works...<br></u><br>Let's assume that today you meet 20 new people a month, schedule appointments with 15 of them, sit across the table from 10 of them. And let's assume that you close 60% of those prospects on an average. Thats 6 sales a month.<br><br>Now let's apply the Close Prospects sales system and strategies to this exact scenario, assuming again that you sit across from 10 prospects each month - you can expect to close 80-90% of all appointments. Thats 2-3 more sales per month. <br><img src=\"https://images.clickfunnels.com/27/7fb4b0cddf11e5ab457fc70f4db0b9/Screen-Shot-2016-02-07-at-4.08.22-PM.png\"><br>What is your average sale worth to your income? $200? $1000? $5000?<br>Would that extra income change the way you live your life? Would that change the relationship you have with your Spouse? Kids? Friends? I know it will...how?  Because it did for us.  We created our personal empires $100 at a time.  1 prospect at a time.  1 follow up at a time.  1 sale at a time.</p>\n\n\n\n\n\n<p>Look, right now you are just one click away from getting your hands on the most tried and true sales training sales system ever created for the average joe or jane!<br>You get it all... the video's, the worksheets, plus the sales and lead tracker.<br>Best of all this system has a proven track record of over ten years and plenty of raving fans to prove it.  It's been no secret that the fundamentals of sales have been the same for decades but some keep trying to reinvent the wheel.  Bruce Lee said, \"Fear the man who practiced one kick 1000 times not the man who practiced 1000 kicks one time.\"  The same goes in sales, be the professional that masters the MAJOR KEY result producing activities in your sales process and watch your numbers sky rocket!<br><br>Plain and simple – Close Prospects works.<br><br>Stop wasting your time and effort trying to \"wing it\". Order the Close Prospects System now before you lose another sale to your competitor.</p>\n\n\n\n\n\n<p>Can't wait to watch your sales pour in!<br></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br><br><br><br><br></p>", 
    "end_date": null, 
    "title": "Close Prospects | Sales Strategies For The Average Joe!", 
    "price": "45.00", 
    "instructors": "Josh Delaney", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758418_cfd7.jpg", 
    "course_url": "https://www.udemy.com/close-prospects-sales-strategies-for-the-average-joe/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T14:05:14Z"
}