{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Learn the Top Secret Techniques Used by Professional Phone Closers</strong> <strong style=\"\">to Pitch and Close Huge Deals Over the Phone!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;</em><em style=\"\">Linda is an amazing advisor who shared her knowledge regarding phone sales training. Cold calling is a daunting task for most people, but Linda is an effective teacher, able to break down the phone selling into a process with manageable components. She will help you overcome your psychological barriers. More importantly, she emphasizes the importance of building relationships with the prospect, instead of outright selling. This is an eye-opening concept that is critical in today&#039;s world of hyper-active marketing. I would not hesitate to work with Linda with respect to telemarketing&quot;</em>  </p>  <p style=\"\">  \t      Denis Isip  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t            Instant Cold Calling  Authority is a guide to the crucial ingredients that you need to include in your pitch that will communicate strong positioning to your prospect. This will help to make sure that you are listened to with respect and attention when calling your prospects. <br style=\"\">  \t<br style=\"\">  \t            If you are a business owner who wants to use the phone to build your business then this course will help. The reason so many entrepreneurs fail at cold calling is that they have not made the correct preparation to ensure their target audience will want to listen to what they have to say. In this course you will find out the secret techniques used by the super star sales people who routinely sell big deals over the phone.  </p>  <p style=\"\">  \t            The course is simple to understand for newbies and experienced sales people will also find it valuable to be able to check their pitches to see if they have these same  ingredients used by sellers of huge deals.  </p>  <p style=\"\">  \t            The techniques apply to any industry that closes deals over the phone but if you use the phone to get appointments then incorporating these techniques will put your appointment setting on steroids!  </p>", 
    "end_date": null, 
    "title": "Cold Calling: Instant Cold Calling  Authority", 
    "price": "20.00", 
    "instructors": "LR Thomas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309982_8e66_3.jpg", 
    "course_url": "https://www.udemy.com/salesauthority/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-29T11:57:34Z"
}