{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul>  \t<p>  \t\t<strong><strong>**This course is completely updated and tailored to help you achieve great results in 2016! Let's make this year a great one guys**</strong></strong></p>  \t<p>  \t\t                                                            I will offer Skype support to every student who asks for it. If you have a problem/question, send me a private message and we will set a time for the call.  \t</p>  \t<p>  \t\t<em><em><strong>-------------------------------------------------------------------------------------------------------------</strong></em></em>  \t</p>  \t<p>  \t\t<strong><strong>Would you like to learn how to create an instantly profitable information-selling business in only 5 days, WITHOUT having to worry about creating a product ?</strong></strong>  \t</p>  \t<p>  \t\t                                                                       Would you like to finally get involved with the world of internet marketers?  \t</p>  \t<p>  \t\t                                                                       Can you follow the easy instructions I will lay down for you in order to setup your very own fonctional business that will pay for years to come and finally allow you to make money online ?  \t</p>  \t<p>  \t\t                                                                       If you answered « yes » to any of the questions above, congratulations. You are already on your way to financial freedom.  \t</p>  \t<ul>  \t\t<p>  \t\t\t<strong><strong>Let me help you !</strong></strong>  \t\t</p>  \t\t<p>  \t\t\t                                                                       In this course,<strong></strong><strong><strong>I will teach and DEMONSTRATE every step of the process from uploading your sales page in less than five minutes, to witnessing your first PayPal deposit.</strong></strong>  \t\t</p>  \t\t<p>  \t\t\t                                                                       The internet doesn't care who you are: If it worked for me, it will work for you, regardless of where you live.  \t\t</p>  \t\t<p>  \t\t\t                                                                       Better yet, along with my videos and my ebook, <strong><strong>I will provide you with three top quality products that have been proven to sell VERY well.</strong></strong> Those products come with complete sales pages ready for you to upload to the web!  \t\t</p>  \t\t<p>  \t\t\t                                                                       I will also teach you the art of driving converting traffic to these sales page in no time at all, so you can start profiting within days.  \t\t</p>  \t\t<p>  \t\t\t                                                                       I will take you by the hand and show you how to get started, right this moment!  \t\t</p>  \t\t<li> Do you need/want more money?</li>  \t\t<li> Do you want to quit your job ?</li>  \t\t<li> Do you need money to catch up on your bills ?</li>  \t\t<li> Do you have a family that relies on you ?</li>  \t\t</ul></ul><p>Do you want to own a business that you can be proud of? </p><p>If you answered « yes » to <em>these </em>questions, <strong>then consider this course to be your blueprint to success.</strong>  \t\t  \t\t  \t\t\t                                                                       Upon enrolling, you will get my personal help. I will answer any question that you may have in the member's area, and I also offer Skype support if needed. <br></p><p> <strong>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, don't start making money online just ask for your refund. </strong><strong><strong>You take absolutely no risk !</strong></strong> <br></p><p><span></span>You can get started right after you have taken my course -That means <em><strong>TODAY!</strong></em> </p><p> \t\t  \t\t  \t\t\t                                                                       This is opportunity knocking on your door. Many have succeeded before, and I have too. With the information contained in this course, you could quit your job in a couple months, if you so desire. </p><p>I have personally taught over 12,000 students the ropes of clever internet marketing, and I have more positive testimonials that I know what to do with. I am available to help you one-on-one.</p><p> \t\t  \t\t  \t\t\t                                                                       Click the \"Take This Course\" button now. That's your first step to building a solid online income. Every minute that goes by without action is <strong><strong>one less paycheck</strong></strong>. </p><p> \t\t  \t\t  \t\t\t                                                                       Cheers! </p><p> \t\t  \t\t  \t\t\t                                                                       Howard</p>", 
    "end_date": null, 
    "title": "Complete Blueprint to Run an Online Business Without a Site", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/323152_7f41_6.jpg", 
    "course_url": "https://www.udemy.com/complete-blueprint-to-run-an-online-business-without-a-site/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-20T13:38:07Z"
}