{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    This course is all about saving money and getting great deals on Craigslist (although it will work anywhere not just on Craigslist transactions). If you could save $100 or more, would you be interested?  </p>  <p style=\"\">  \t<strong style=\"\">I am glad I got your attention!</strong>  </p>  <p style=\"\">  \t<em style=\"\">We all work really hard for our money, so why not get the most out of your money?</em>  </p>  <p style=\"\">  \t    As a successful Craigslist seller and buyer for over 10 years, I have developed, discovered, and used all sorts of techniques. Some worked, some did not. Now, you can get those proven techniques that DO WORK!  </p>  <p style=\"\">  \t    This course is based around negotiating Craigslist deals (anything really - cars, furniture, electronics).  </p>  <p style=\"\">  \t    We start off by learning WHAT NOT TO DO.  </p>  <p style=\"\">  \t    Then we talk about how to find those great deals online.  </p>  <p style=\"\">  \t    After we found the deal or deals we want. We develop a plan and get as much information as we possibly can.  </p>  <p style=\"\">  \t    After we have a plan I show you the different channels of communication (E-mail, phone, text, and in-person)  </p>  <p style=\"\">  \t    Finally I show you over 8 ways you can negotiate a better deal.  </p>  <p style=\"\">  \t    Lastly, you go out and start saving hundreds of dollars for you, your friends, and your family!  </p>  <p style=\"\">  \t    If you have a question that I do not cover, shoot me an e-mail or text and I will answer it!  </p>  <p style=\"\">  \t<em style=\"\">This course is fully guaranteed, so enroll today!</em>  </p>", 
    "end_date": null, 
    "title": "Craigslist Buyer Negotiation Strategies -Proven to Get Deals", 
    "price": "20.00", 
    "instructors": "Drew Patterson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355738_a05d_4.jpg", 
    "course_url": "https://www.udemy.com/craigslistbuying/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T23:51:14Z"
}