{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">What is this course about?</strong></p><p>In this course, you will learn how to turn your sales experience into a full-blown consulting practice. However, this will not be some boring and old-fashioned practice. You will learn how to create a practice in the hot new area of fractional (part-time) sales management. Fractional sales managers can charge up to $3000/per client/month for 1/2 day's work. The work is consistent and rewarding too.</p><p>Learn the insider secrets to creating, growing, and operating a part-time sales management practice. Companies with 2-10 salespeople desperately need help managing their sales teams in a cost-effective manner. </p>\n\n<p>Your part-time sales management practice can fill this new niche in <br>the marketplace. Be the first in your market to tap this growing niche <br>by subscribing to this step-by-step course.</p><p><br></p><p><strong class=\"redactor-inline-converted\">What materials are included?</strong></p><p>We have included a few examples and templates, but this course is primarily designed to assess your fit for the job and then to teach you the necessary steps to get started.<br></p><p><strong class=\"redactor-inline-converted\">How is the course structured?</strong></p><p>We begin the course by describing the profile of successful consultants so you can match your skills to those known to succeed. Then we move into marketing, client acquisition, and service delivery.</p><p>By the end of the course, you will know how to begin your practice, identify prospects, and move them into your sales funnel.<br></p><p><br></p><p><strong>Why take this course?</strong><br></p><p>There are many reasons to complete this course:</p><ul><li>Fit: do you have what it takes to be a part-time sales manager?</li><li>Learning curve: our company has been in this business for over a dozen years, we know every angle, trick, and pitfall. Do you want to re-invent the wheel or have us tell you the shortcuts?</li><li>Innovative thinking: even if you are not looking to become a part-time sales manager, this industry is cutting-edge and making gains in the marketplace. Every business owner, consultant, and service provider should become familiar with this service.</li></ul>", 
    "end_date": null, 
    "title": "Creating a Part-Time Sales Management Consulting Practice", 
    "price": "50.00", 
    "instructors": "Jim Muehlhausen CPA, JD", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/811024_7d12_5.jpg", 
    "course_url": "https://www.udemy.com/creating-a-part-time-sales-management-consulting-practice/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-02T20:17:00Z"
}