{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">Discover what the best authors on Start Ups have to say before deciding to invest time and money buying and reading their text books.</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">The Chasm</em> was identified by start up guru, Geoffrey Moore in his classic &quot;Crossing the Chasm.&quot;</strong>  </p>  <p>  \t                    It&#039;s the slump in revenues between the initial burst of sales after launch and long term sustainable growth in mainstream market. It&#039;s the killer for most start ups and we tell you how to avoid languishing in it before you run out of cash.<br style=\"\">  \t<br style=\"\">  \t                    All start ups have to Cross the Chasm. In this course we describe the two ways to do it as outlined by Moore in his world renowned books. They are mandatory reading before going into business. You get the summary in this course so you can get off to a good start before reading the books in full.  </p>  <p>  \t                    We also highlight the single most important maxim in business growth from <strong style=\"\">Fred Reichheld</strong> in <strong style=\"\">&quot;The Ultimate Question.&quot;</strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">&quot;The only way to grow a business is to bring your customers back for more and get them to tell their friends.&quot;</strong><br style=\"\">  \t</em><br style=\"\">  \t<strong style=\"\">Take this course and learn how to do it.  </strong>  </p>  <p>  \t                                            Also learn about <strong style=\"\">Ansoff&#039;s Matrix</strong> and the 4 selling situations in which you will be required to turn customers into unprompted advocates. Each situation requires a different approach and we will teach you what  to do in each case when you take this course.<br style=\"\">  </p>  <p>  \t                    The business genius, Ansoff, identified the four situations you will logically encounter as a start up.<br style=\"\">  \t                    You will be either selling <br style=\"\">  \t                    Existing Products to Existing Customers,<br style=\"\">  \t                                                                New Products to Existing Customers,<br style=\"\">  \t                                                                Existing Products to New Customers,<br style=\"\">  \t                    or the most difficult New Products to New Customers<br style=\"\">  \t<br style=\"\">  \t                    In each situation, the way you win new customers and turn them into your best marketing assets will change and we tell you what to do in each scenario.  </p>  <p>  \t          Understand what customers are most concerned about.<br style=\"\">  \t                                                                Address their fears and get them to tell their friends that you got it right.  </p>  <p>  \t<strong style=\"\">                                                        Learn about the six points where customers will judge you.</strong><br style=\"\">  \t                                            Knowing about the 6 customer touch points will focus you on the right places to invest time and money.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Understand and meet customer needs consistently to the point that they recommend and become your sales and marketing engine.</strong>  </p>  <p>  \t                                                                   This proven approach will save you time, money and build your confidence.<br style=\"\">  \t<br style=\"\">  \t    This is the fastest way to familiarise yourself with the work of the best thinkers in the field of business start ups.  </p>  <p>  \t  We look forward to working with you as you <strong style=\"\">take this course.</strong>  </p>  <p>  \t<br style=\"\">  \t<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Cross the Chasm to Sales Growth in Your Start Up", 
    "price": "20.00", 
    "instructors": "Peter Urey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/123890_7be0_8.jpg", 
    "course_url": "https://www.udemy.com/sales-strategy-for-start-ups-the-beginners-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-22T11:32:57Z"
}