{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Destaques</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">100% de garantia!</strong> Devolução do dinheiro em até 30 dias caso não fique satisfeito!</li>  \t<li style=\"\"><strong style=\"\"></strong>  \t<p style=\"\">  \t\t<strong style=\"\">   Qualidade comprovada!</strong> Professor com quase <strong style=\"\">2.000 alunos</strong> na Udemy!  \t</p>  \t</li>  \t<li style=\"\">Destaque no jornal <strong style=\"\">Folha de São Paulo</strong>:<em style=\"\"> &quot;Professores usam sites para vender aulas em vídeo&quot;</em></li>  \t<li style=\"\"><strong style=\"\">Certificado</strong> de conclusão do curso</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Como ser bem sucedido em vendas?</strong>  </p>  <p style=\"\">  \t     O que os vendedores e negociadores de sucesso possuem são ferramentas e técnicas de vendas que os ajudam a fechar mais negócios. Em cada etapa da negociação existem <strong style=\"\">boas práticas e técnicas</strong> que devem ser seguidas para você aproveitar ao máximo de cada oportunidade de fechar um negócio.  </p>  <p style=\"\">  \t<strong style=\"\">O que você aprenderá no curso?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Como vender suas idéias, produtos ou serviços</li>  \t<li style=\"\">Como prospectar e abordar do jeito certo clientes potenciais</li>  \t<li style=\"\">Como entrar em contato com clientes por e-mail</li>  \t<li style=\"\">Como vender de maneira efetiva pelo telefone</li>  \t<li style=\"\">Como aplicar técnicas avançadas de fechamento e negociação</li>  \t<li style=\"\">Como aumentar sua produtividade diária em vendas</li>  </ul>  <p style=\"\">  \t  ************Veja abaixo a ementa completa com as 71 aulas!  </p>  <p style=\"\">  \t<strong style=\"\">Quem é o professor?</strong>  </p>  <p style=\"\">  \t     Meu nome é Alessio Alionço e comecei minha carreira em vendas captando patrocínio e negociando com empresas como TIM, Fundação Getúlio Vargas, Petrobrás, Correios, Brasil Telecom, HSBC, Unilever, Coca-Cola, Ambev e muitas outras.  </p>  <p style=\"\">  \t     Depois disso fui consultor em fusões, aquisições e revitalizações de empresas, restruturando a área comercial de negócios com faturamento entre 50 e 200 milhões por ano nos setores da indústria, varejo e serviços. Nesses processos de restruturação, minha principal função era formar equipes comerciais agressivas e de alta performance, responsáveis por tirar empresas do prejuízo e levá-las para uma nova fase de crescimento, aquisição de novos clientes e saúde financeira.  </p>  <p style=\"\">  \t     Essas equipes foram tão bem sucedidas que acabei sendo mentor e conselheiro de outras empresas e startups e participei como palestrante e jurado em eventos como Feira do Empreendedor do Sebrae, Startup Meetup, Startup Pirates, Desafio Brasil, Startup Brasil, E-talks da Endeavor, HUB Fellowship e outros, sempre contribuindo quando o assunto se refere a marketing, vendas e negociação.  </p>  <p style=\"\">  \t<strong style=\"\">Como vender 2x, 3x mais? Pode-se aprender como ser um bom negociador?</strong>  </p>  <p style=\"\">  \t     Eventualmente uma pessoa pode ser mais extrovertida e ter uma facilidade natural para se relacionar, mas isso não significa que ela terá as competências e habilidades necessárias e presentes em todos os grandes vendedores. Com o tempo aprendi que vender não é um dom que nasce de berço - os melhores na verdade tem muito conhecimento, habilidades, ferramentas e técnica, muita técnica. Em minha opinião todos, se tiverem vontade verdadeira de aprender, podem se tornar vendedores excepcionais.  </p>  <p style=\"\">  \t     Por causa desse aprendizado que resolvi ensinar e transmitir de forma fácil, didática e organizada tudo o que aprendi em todos esses anos de prática como vendedor e formando vendedores. O curso é muito completo, são 13 horas de conteúdo separados em 71 aulas ensinando desde os passos mais básicos como o passo a passo para montar um script de vendas à técnicas avançadas de fechamento e negociação.  </p>  <p style=\"\">  \t     Desejo de coração que você tenha muito sucesso após aplicar esses ensinamentos, assim como eles me ajudaram todos esses anos como vendedor, coach de vendedores e empreendedor. Bem vindo ao clube, já são quase 2.000 pessoas em todos os meus cursos online.  </p>  <p style=\"\">  \t<strong style=\"\">TÓPICOS</strong>  </p>  <p style=\"\">  \t<strong style=\"\">    1.0 Como posicionar seu produto ou serviço</strong>  </p>  <p style=\"\">  \t            Domine o processo de como analisar o mercado, como mapear o perfil dos seus clientes potenciais, entender as relações de poder na negociação, como definir o posicionamento da sua empresa e saiba como realizar uma análise de valor agregado para realizar propostas mais efetivas.  </p>  <p style=\"\">  \t<strong style=\"\">    2.0 Como montar seu discurso de vendas</strong>  </p>  <p style=\"\">  \t            A forma como você explica o que vende é fundamental para o cliente decidir se precisa ou não comprar de você. Nesta etapa, você aprenderá a como montar um discurso de vendas perfeito, como mantê-lo resumido, o que dizer primeiro, como explicar em loops para facilitar a interpretação e outros.  </p>  <p style=\"\">  \t<strong style=\"\">3.0 Ferramentas e técnicas para aumento de produtividade</strong>  </p>  <p style=\"\">  \t            Como se organizar e controlar seus prospects de forma a conseguir fazer mais negócios? Descubra quais são as ferramentas, boas práticas e planilhas mais utilizadas em equipes comerciais de alta performance e aplique os mesmos modelos no seu dia-a-dia.  </p>  <p style=\"\">  \t<strong style=\"\"> 4.0 Como prospectar corretamente clientes potenciais</strong>  </p>  <p style=\"\">  \t            Como abordar de forma eficiente clientes por telefone, e-mail e prensencialmente através de reuniões. Além disso, dicas pontuais para aumentar sua produtividade em eventos comerciais. Boas práticas, dicas de como usar (ou não usar) materiais visuais como portfólios, gráficos e pastas.  </p>  <p style=\"\">  \t<strong style=\"\">    5.0 Linguagem corporal e Programação Neuro Linguística (PNL)</strong>  </p>  <p style=\"\">  \t            Aprenda como ler através de comunicação corporal e facial o que o cliente está pensando. Use técnicas de Rapport para criar empatia com o cliente e para deixá-lo inclunado a falar o que precisa e comprar o seu produto ou serviço. Aprenda sobre as chamadas pistas de acesso ocular e saiba como usá-las para detectar mentiras dos clientes.  </p>  <p style=\"\">  \t<strong style=\"\">6.0 Como descobrir as necessidades do cliente</strong>  </p>  <p style=\"\">  \t            Aprenda como fazer uma das etapas mais importantes da venda, a coleta de dados. Aprenda quais são as perguntas mais adequadas para descobrir o quanto o cliente está disposto a pagar por seu produto ou serviço, o que ele valoriza e quais são as perguntas ideais para se conduzir uma venda.  </p>  <p style=\"\">  \t<strong style=\"\">7.0 Objeções – A venda começa com o primeiro “não”</strong>  </p>  <p style=\"\">  \t            Quem nunca ouviu no telefone um “por favor, pode me enviar tudo por e-mail que te respondo?” quando estava prospectando um cliente ou na etapa de fechamento de negócio objeções como “não tenho dinheiro” ou “preciso pensar” ou desculpas similares? Aprenda como contornar as objeções mais comuns e como evitá-las.  </p>  <p style=\"\">  \t<strong style=\"\">    8.0 Paráfrases – Conduzindo o cliente para comprar</strong>  </p>  <p style=\"\">  \t            Uma das etapas mais importantes da venda, mas dominada por poucos vendedores. O cliente só vai comprar quando ele perceber que precisa do seu produto ou serviço. Aprenda a conduzir o cliente a criar essa necessidade fazendo paráfrases que induzirão o cliente a comprar.  </p>  <p style=\"\">  \t<strong style=\"\">    9.0 Técnicas de fechamento de negócios</strong>  </p>  <p style=\"\">  \t            Um excepcional vendedor não é quem apresenta bem, é quem fecha mais negócios. Aprenda detalhadamente como funciona um ciclo de fechamento de negócio, como identificar oportunidades de fechamento e quais são as técnicas mais adequadas para cada situação específica.  </p>  <p style=\"\">  \t<strong style=\"\">Dúvidas mais frequentes:</strong>  </p>  <p style=\"\">  \t       1. Qual é o prazo para concluir o curso?  </p>  <p style=\"\">  \t       O tempo para acessar é ilimitado! Você poderá fazer tudo no ritmo que achar ideal.  </p>  <p style=\"\">  \t       2. O curso tem horário fixo?  </p>  <p style=\"\">  \t       Não, você pode fazer o curso quando e onde achar mais confortável. Do trabalho, de casa, nos fins de semana. Você só precisa de um computador com acesso a internet!  </p>  <p style=\"\">  \t       3. Por quê o valor do curso está em dólares?  </p>  <p style=\"\">  \t       A plataforma na qual o curso é realizado (Udemy) é americana, então os valores são definidos em dólar. De qualquer forma, ao realizar o pagamento usando o Paypal você pode escolher a opção de pagar o valor em reais.  </p>  <p style=\"\">  \t       4. Mas qual é o valor do curso em reais?  </p>  <p style=\"\">  \t       O valor do curso em reais pode variar de acordo com a taxa de câmbio do dólar de sua operadora de cartão de crédito. Veja quanto um dólar vale hoje, e multiplique esse valor pelo preço em dólares do curso.  </p>  <p style=\"\">  \t       5. Quais são as formas de pagamento?  </p>  <p style=\"\">  \t       Você pode pagar com os principais cartões de crédito pela plataforma do Udemy ou pelo Paypal.  </p>", 
    "end_date": null, 
    "title": "Curso de Vendas Completo - 71 aulas", 
    "price": "50.00", 
    "instructors": "Alessio Alionço", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65315_757d_7.jpg", 
    "course_url": "https://www.udemy.com/curso-de-vendas/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-13T19:53:35Z"
}