{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   We live in an age when it’s become impossible to doubt how important each customer is for a business.  </p>  <p style=\"\">  \t   This course isn’t about understanding how important customers are for your business, because I’m sure you already know that. It’s about a more delicate subject, namely how to handle those situations when it becomes really hard to put theory into practice, to believe that the customer is always right and to treat them by the book.  </p>  <p style=\"\">  \t   Dealing with angry customers is the most unpleasant part of customer service. It takes the all the joy out of the job for most people. It makes them forget all they know about how important customers are for their business and it becomes a cause of ongoing frustration.  </p>  <p style=\"\">  \t   The trouble is that angry customers don’t really care about the customer service representative’s feelings. They only want to resolve what got them angry as quickly as possible and their dissatisfaction to be acknowledged by the company.  </p>  <p style=\"\">  \t   So, we need to talk about how to handle angry customers for two very important reasons:  </p>  <p style=\"\">  \t   The first is to make interactions with customers more pleasurable and build rewarding, healthy relationships with them, that can eventually help us get our smile for the pleasure of helping others back.  </p>  <p style=\"\">  \t   The second is to prevent angry customers from becoming completely dissatisfied and eventually leaving us for the competition.  </p>  <p style=\"\">  \t   We’ve focused this course on telephone interactions, as over 80% of customers prefer the telephone over other communication channels. However, most of the techniques outlined here also apply for face to face or live chat interactions.<u style=\"\"></u>  </p>  <p style=\"\">  \t   I’d also like to tell you a few words about me and about what made me want to share this knowledge. I’ve worked in customer service for close to ten years, six of which I’ve spent training telemarketing and customer service representatives and supervisors. I have taught some 2000 people, working for over 50 companies operating in seven different countries how to handle customer interactions.  </p>  <p style=\"\">  \t   People who attended my training sessions always asked for real, tangible techniques they can actually use in their daily jobs, so I strived to provide just that.  </p>  <p style=\"\">  \t   The current structure of this course is the result of over three years of careful analysis of hundreds of phone calls and discussions with dozens of customer service representatives, supervisors and quality checkers.  </p>  <p style=\"\">  \t   Some might argue that the best way to avoid customer dissatisfaction is to involve everyone in the company in the provision of spectacular services that customers have no reason to get angry about. In a perfect world, that could be true. But the fact is that things can go wrong for various reasons, and the purpose of this course is to prepare you for when they do.  </p>  <p style=\"\">  \t   How can you minimize the negative impact these types of interactions have on both you and your customers?  </p>  <p style=\"\">  \t   This course offers you some very specific suggestions on how you can achieve that. It’s based on the assumption that customer service provision can be viewed as the effective use of a set of tools: just like a carpenter uses the hammer, the drill or the saw for working wood, in the same way a customer service representative uses a set of communication techniques to influence the behavior of customers and the outcome of calls. You will learn 5 communication skills and 16 techniques that you can use to handle specific situations when customers get angry.  </p>", 
    "end_date": null, 
    "title": "Dealing With Angry Customers", 
    "price": "20.00", 
    "instructors": "Dragos Iliescu", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176742_6db2_3.jpg", 
    "course_url": "https://www.udemy.com/dealing-with-angry-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T17:03:20Z"
}