{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "  <p>  \t<span>Estimado amigo(a),</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Cuando tenía seis años de edad me pasó algo que aún me persigue hasta el día de hoy.</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Yo estaba en el patio de la casa jugando con unos amigos alrededor de la barbacoa de mis padres, cuando llegué a la brillante idea de sentarme en ella ya que vi todo apagado. (<strong>así es el fuego estaba apagado pero las brasas habían mantenido caliente el metal de la barbacoa)</strong> .</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Como te podrás imaginar, <strong>eso no era una buena idea</strong> . Las varas metálicas quedaron marcadas en mis piernitas, y me lastime severamente . Caí al suelo,<span class=\"Apple-converted-space\"></span>y de inmediato salte y <strong>corrí gritando</strong> hacia la casa.</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Mi mamá estaba mirando desde la ventana de la cocina mientras ella estaba lavando los platos. ¿Le gustaría saber su respuesta? </span>  </p>  <p class=\"p2\">  \t<span class=\"s1\"><strong><em>Ella siguió lavando los platos. </em></strong></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Ella no parecía tan preocupada por lo que me había pasado, incluso viendo que la sangre<span class=\"Apple-converted-space\"></span>goteaba de mi boca y de las lágrimas de mis ojos.</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Cuando entré en la casa y me pare frente a ella, simplemente dijo: “<em>dame un paño de cocina, cariño”</em>. Entonces ella volvió la cabeza hacia la sala de estar donde mi padre estaba viendo la televisión. “<em> Nestor. se quemo las piernas con la barbacoa. Está severamente quemado. Probablemente deberíamos hacer algo al respecto”.</em></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Mi padre, que es mucho más sensible que mi mamá, le gritó: “<em>Lo haremos, tan pronto como termine escuchar mi pieza favorita . Es uno de mis canciones favoritas!”</em></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Mi hermano pequeño <strong>estaba realmente entusiasmado con el próximo viaje al hospital</strong> . “Sorpresas, sorpresas!”, Dijo. &quot;<em>Podemos parar por un helado camino al hospital?</em><span class=\"Apple-converted-space\"> </span></span>  </p>  <p class=\"p2\">  \t<span class=\"s1\"><strong><em>¿No sería te parece absurdo que jugara de esa manera?</em></strong></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Lo que en realidad sucedió fue lo siguiente ...</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Mi mamá <strong>al instante</strong> salió corriendo de la casa para agarrarme con pánico en sus ojos. Ella gritó por mi papá que <strong>de inmediato</strong> nos metió en el coche. Mi hermana se quedó muda de espanto. Nos fuimos directo al hospital, y llegamos a la sala de emergencia en <strong>cuestión de segundos</strong> .</span>  </p>  <p class=\"p2\">  \t<span class=\"s1\"><strong><em>¡Había una Respuesta Urgente Por Lo Ocurrido!</em></strong></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Afortunadamente, después de pasar algún tiempo en la sala de emergencias vendado, me dijeron que estaría bien. Aprendí una valiosa lección: nunca sentarme en una fogón caliente!</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">En realidad, aprendí otra lección ese día: <em>hay cosas que desencadenan una respuesta inmediata</em> .</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Soy un vendedor del Internet a tiempo completo<span class=\"Apple-converted-space\"></span>y esta lección me ha funcionado con mis ofertas y las ofertas de los demás una y otra vez. <strong><em>Hay cosas que puedes hacer con el fin de aumentar tu tasa de Ventas.</em></strong></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\"><strong>No estoy hablando sobre</strong> trucos de falsificación o técnicas no éticas. Estoy hablando de la elaboración de tu oferta de una manera que<span class=\"Apple-converted-space\"></span>puedas crear &quot;<em>urgencia</em>&quot; sin sacrificar tu&quot; <em>integridad</em> &quot;.</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Como he dicho: hay cosas que tu puedes hacer para aumentar la tasa de compra de tus ofertas.</span>  </p>  <p class=\"p2\">  \t<span class=\"s1\"><strong><em>¿Te gustaría conocerlas?</em></strong></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Estás de suerte, porque he puesto más de dos docenas de estas ideas en un nuevo informe especial ...</span>  </p>  <p class=\"p4\">  \t<span class=\"s2\"><strong>30 Formas De Crear Urgencia En Tus Ventas Hoy!</strong></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Hay dos preguntas que necesitas hacerte : ¿Por qué la gente se va sin comprar? ¿Cómo se puede convencer (al menos algunos) de los que se van para que compren?</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">La primera pregunta tiene una respuesta fácil - el hecho <em>que no haga clic en el botón de compra, y entren sus datos bancarios para finalizar la transacción</em> tiene sus razones. Tal vez ellos no necesitaban la oferta. Tal vez no les gustó la oferta. Tal vez ellos no podían permitirse la oferta. Tal vez tenían la intención de volver más tarde. Hay docenas de variables. Algunos simplemente NUNCA compran.</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Pero ...</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Algunos si están en el borde de tomar una decisión. Algunos tienen un fuerte &quot;<em>tal vez</em> si&quot;. Algunos han levantado la mano para decir: &quot;<em>Estoy interesado ... dime qué debo comprar</em> &quot;? Es por estas personas que tu necesitas saber la respuesta a la segunda pregunta. <strong><em>TurboVentas </em></strong>te dará 30 maneras de convencer (al menos algunos) de los que no estaban seguros de hacerlo.</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Ninguna de estas estrategias son un secreto, ni mucho menos mágicas. Ellas son simplemente verdaderas estrategias de marketing que han sido probadas durante años en los procesos de venta, para lograr persuadir la gente a comprar de inmediato.</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Tal vez ya conozcas algunos de estos ... pero es probable que haya un montón que<span class=\"Apple-converted-space\"></span>no conozcas! ¿De verdad quieres ignorar esta oferta y siempre preguntarte, <em>&quot;¿Qué había en el informe? ¿Qué pasaría si encuentro solo UNA nueva idea que me consiguiera más gente que me compre? ¿Cuánto dinero más me haría cada mes?</em> &quot;</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\"><strong>PRUEBA esto por ti mismo :</strong> Esto es lo que quiero que hagas. Compra una copia de <strong><em>TurboVentas</em></strong> aquí abajo e implementa inmediatamente la estrategia # 17. Te funciono en el día de hoy, ¿no? Quiero decir, esto es exactamente lo que estoy haciendo ahora mismo. Estoy usando la estrategia # 17 contigo.</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Te voy a dar un &quot;<em>bono de</em> estrategia&quot; en este momento, sin costo alguno.</span>  </p>  <p class=\"p2\">  \t<span class=\"s1\"><strong><em>El uso de la &quot;curiosidad&quot; es una excelente manera de llegar </em></strong></span><span class=\"s3\"><strong><br>  \t </strong></span><span class=\"s1\"><strong><em>a la gente a tomar una decisión de compra.</em></strong></span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">En serio, ¿no quieres saber lo que dice la estrategia # 17? ¿No te gustaría saber cómo la estoy usando en este momento y la forma en que cada vez un mayor número de gente “comprará” por yo haberla utilizado?</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Piense en ello de esta manera: ¿Qué significaría para tu negocio en los próximos 12 meses si pudieras implementar las estrategias de<strong><em> TurboVentas<span class=\"Apple-converted-space\"> </span></em></strong> y obtener más compras de tus visitantes a tus sitios web? El promedio es alrededor del 2%, es decir, 98 de cada 100 personas que ven tu oferta no va a comprar. ¿Qué pasaría si tu pudieras conseguir que sólo algunas de estas personas<span class=\"Apple-converted-space\"></span>que te visitan te compraran antes de irse? Eso sería enorme, ¿no?!</span>  </p>  <p class=\"p1\">  \t<span class=\"s1\">Ahora Descarga <strong><em>tu curso</em></strong> e implementa estas ideas inmediatamente.</span>  </p>", 
    "end_date": null, 
    "title": "Descubre 30 Estrategias Poderosas Para Persuadir Tus Ventas", 
    "price": "20.00", 
    "instructors": "Nestor Vallester, Nubia Vallester", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364894_2160_4.jpg", 
    "course_url": "https://www.udemy.com/estrategias-de-persuadir-vender-tus-productos-servicios-en-tu-negocio/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-07T00:11:47Z"
}