{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Making More Sales, Making More Money, Make More Time for You.</strong><br></p><p>\"Clear ,very structured and very useful tips\"</p><p>\"I liked your personal story on how you beat your fears of selling. Very clever \"</p><p><br></p><p>If you want to makes more sales and make more money this course is for you. It is about techniques refined and learned from over 20 years selling.</p><p>You can become a very sought after person if you have the ability to sell. Many top business people never had an education yet they were hugely successful because they learned how to sell.</p><p>If you are good at selling you will go far in life. It is a hugely underestimated skill to have. This course outlines to you a simple process, nothing complicated to learn. No high powered sales language . Just the basics taught well.</p><p>That is what it is about. It will help you close deals more quickly and effectively. Spot early if you are on to a sale and close quicker. Whether its a small deal or a larger deal the principles apply to getting a successful sale.</p><p>-----------------------------------------------------------------------------------------------------------------</p><p>The course is narrated focused lectures. No waffle . Straight to the point.It is for people who have 60 minutes and want quick,quality, focused learning.</p><p>This simple process I have followed and honed with my own layer of selling lessons into my own businesses, in a successful way,  and giving my family a comfortable lifestyle.</p><p>I learned from the bottom up . No initial sales training despite being brought up in business. I learned the hard way. Plenty of rejection along the way, which I believe helped my success more quickly.</p><p>Knowing the process and doing these techniques will give you confidence. You will make the training more powerful of course, by practice.</p><p>Take this course and boost your sales income today. I'm here if you need me.<br></p><p>------------------------------------------------------------------------------------------------------------------</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Discover How to Boost Your Sales Income Now!", 
    "price": "20.00", 
    "instructors": "Kieran McSherry", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747922_c8bf_3.jpg", 
    "course_url": "https://www.udemy.com/discover-how-to-boost-your-sales-income-in-60-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-31T15:54:10Z"
}