{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is another Stan Hustad What It Takes short course for busy leaders and entrepreneurs who want to learn a lot of practical ales, business, and marketing ideas in under one hour.</p><p><strong>S</strong><strong>tan takes his over 30 years of world wide broadcasting experience</strong> and teaches you all the secrets and basics you need to know to do:</p><p>- <strong>A great one minute commercial, presentation, for your website YouTube Channel</strong>, and all the other social media platforms where people say \"wow\" that was good, that was cool.</p><p>- Your <strong>one minute show for your business networking group</strong> will be so good that people remember it.</p><p>-<strong> Forget the elevator speech</strong> stuff, the Super Bowl formula is far more powerful.</p><p> <strong>You will learn the open secrets and strategies for starting to be a great media marketer by knowing:</strong></p><p>-That they<strong> don't care</strong> and what you can do about it.</p><p>- The power of the <strong>secret sign</strong> that everybody wears and you better know what it says</p><p>- If you do not know the <strong>AIDDA </strong>formula that you are not ready to business and be a leader in the 21st century.</p><p>- You will learn that there is only one way to effect people's behavior to do good things and you better know what it is.</p><p>You will have a far better understanding of what is really going on with media and online advertising and marking and how to take advantage of it.</p><p>Stan will be available to answer your questions and be a teacher mentor throughout your taking the course.</p><p><br></p>", 
    "end_date": null, 
    "title": "Do A Great One Minute Commercial To Promote Your BusineSS", 
    "price": "20.00", 
    "instructors": "Stan Hustad", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631674_7986_3.jpg", 
    "course_url": "https://www.udemy.com/do-a-great-super-bowl-commercial-to-promote-your-busine/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T20:01:10Z"
}