{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn how to leverage the power of the internet using social communication and engagement techniques to <strong>double your net income</strong> , having more spare times and enjoying  the lowest cost marketing techniques ever designed.</p><ul><li>Video training explains the theory <strong><em>and</em></strong> the <strong>HOW TO IMPLEMENT</strong> in great detail. </li><li>There are over 2 hours of training plus free access to custom software that is used to implement the entire system.</li><li>Additional training for installing, configuring and using this exclusive software is provide as well.</li><li>This course is perfect for <strong><em>all types and sizes of businesses</em></strong> including local companies, national and regional companies as well as online entrepreneurs. </li><li>Anyone that take this course and implements our step-step-system will easily double there business earnings through two vectors: Existing customer loyalty and low cost client acquisition</li><li>More then a course on what to do. we take you through actual implementation and provide the primary tools you need to complete and build the system.</li><li>Everything you need to engage in the most important marketing and reputation management system for your business is included</li></ul><p>Start today and see how using simple techniques can dramatically improve your businesses profits, make running the business more enjoyable, and free up your time to enjoy more of you success.</p>", 
    "end_date": null, 
    "title": "Double Business Profits - With Simple Online Marketing ", 
    "price": "20.00", 
    "instructors": "Bill McRea", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534898_20b4_3.jpg", 
    "course_url": "https://www.udemy.com/double-business-profits-with-simple-online-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T07:49:12Z"
}