{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>*** This course was updated on Tuesday, November 17, 2015 ***</strong></p><p>Local businesses need local customers and, every day, people are online looking for florists, plumbers, dentists, lawyers and more. </p><p>Can your business be found? </p><p>In this course – “Earn More Sales By Increasing Local Traffic To Your Website\" – we'll introduce several (and simple) techniques and strategies to help your local business gain more traffic to your website. </p><p>This course covers:</p><ul><li>How to increase LOCAL search engine rankings in Google and other search engines.</li><li>How to claim, confirm and optimize business listings in Yelp, Google+ and other review and mapping websites. We'll even supply worksheets to help you complete this task!</li><li>How writing blog posts that will impact search engines and help increase traffic to your website.</li><li>Reveal a great local SEO tip that almost guarantees a No. 1 ranking in Google on local keywords (top secret tip!).</li><li>How to develop a great team of local writers and photographers for your website, blog and social media campaigns.</li><li>How to create and publish simple videos for your business.</li><li>Learn how attending conferences and trade shows will increase business.</li></ul>Don't rely on your stale, old website to do the trick. Higher rankings on local keywords against your competitor can be a tough chore, However, we'll reveal the best techniques we used in over 15 years of providing online consulting and search engine optimization for local customers. This course currently contains over 40 lectures and three cheat sheets and worksheets to help you along the way.", 
    "end_date": null, 
    "title": "Earn More Sales By Increasing Local Traffic To Your Website", 
    "price": "20.00", 
    "instructors": "Steve Phillips", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559420_009b.jpg", 
    "course_url": "https://www.udemy.com/earn-more-sales-by-increasing-local-traffic-to-your-website/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T13:54:23Z"
}