{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em class=\"redactor-inline-converted\">Are you in need of extra income? You've come to the right place... </em></strong></p>\n\n<p>  \t                This is an intro class for newbies that will teach you basics about how to sell items on eBay. This course will cover some basics that will give you an extra edge. You will learn how to raise limits, watch out for common scams, how to manage returns, how to pick right listing formats, fixed pricing vs auction, how to ship items like a professional, what camera to get for creating great photos, and many additional basics that will help get you started. If you are new to selling online, this course is the right one to teach you the basics you need to get started.</p>\n\n\n\n<p>  \t  After you are done with this course, you should be ready to take your selling to the next level, and then to proceed to the more advanced eBay  bootcamp or dropshipping course that will feature 10x more content. Enrolling in this course gets you access to any of my future discounts and offers for my courses. </p>\n\n<p>To your success see you in class.</p>\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\"><strong>Features</strong></em>  </p>\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\"></em>Tips how to get started  </p>\n\n\n\n<p>Tips and suggestions</p>\n\n\n\n<p>  \t        Protection from scams  </p>\n\n\n\n<p>  \t        Bonus discount offers</p>", 
    "end_date": null, 
    "title": "eBay for newbies: learn the basics to start selling on eBay", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421540_9579_7.jpg", 
    "course_url": "https://www.udemy.com/ebaytips/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T01:13:52Z"
}