{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>&lt;&gt; eBay Guide: Sell Gift Cards Online: Simple Way To Make Money &lt;&gt;</strong><br></p><strong></strong><p>Did you know that selling gift cards on eBay, even empty ones without any money on them, can be an easily accessible, legal and quick way to pocket some extra cash? We will also teach you how to profit on selling discounted giftcards where to get them at huge discount and how to sell them on eBay to make a nice profit using the concept of online arbitrage.</p><p>Might sound too good to be true, but we've made over $2000 in profits doing just that.</p><p>This is a simple concept to earn extra money online using little to no financial investment. No experience required. </p><p>In this course, we will teach you the exact steps to sell gift cards on eBay and potentially return 100%+ in profits. </p><p><strong>Here are some things you will learn:</strong></p><ul><li><em><strong>How you can earn 1000%+ return with collectible gift cards</strong></em></li><li><em><strong>How to flip existing eBay gift card listings for profit</strong></em></li><li><strong><em>What kinds of gift cards to sell on eBay</em><br></strong></li><li><strong><em>Where to find these gift cards</em><br></strong></li><li><em><strong>How to sell gift cards for cash</strong></em></li><li><em><strong>Basics of online arbitrage</strong></em></li></ul><p>Enroll now, watch the lectures and implement the steps to start earning extra money, at no risk to you. If you choose to enroll in this course, you will get instant access to instructor and community support, including lifetime access to the additional lessons and updates that will continuously be added to this course.</p><p>If you are still unsure whether this course if for you, please click on the free lectures that we've made available to you.<br></p><p>**LIMITED-TIME ENROLLMENT BONUS**</p><p>If you enroll in our course right now, after finishing the courses you will get our exclusive student discount (50%+95%) to any of our existing and future courses.</p><p>You have nothing to lose and only potential to gain so click on that enroll button and we'll be waiting for you inside.</p><p><em>Please Note: </em><em>we are teaching you the simple strategy we followed to make profits selling gift cards on eBay. We cannot guarantee you'll get the same results, as individual results depend on your mindset while learning this material and the actions you take to implement what you've learned. </em></p><p>We offer a 30-day 100% money back guarantee if you are not happy for any reason. If you choose to enroll in this course, you will get instant access to instructor and community support, including lifetime access to the additional lessons and updates that will continuously be added to this course.  </p><p>If you are still unsure whether this course if for you, please click on the free lectures that we've made available to you.</p><p>You have nothing to lose and only potential to gain so click on that enroll button and we'll be waiting for you inside.</p><p>See you in class!</p><p>Your instructors,<br></p><p><em>Sergey &amp; Jewel </em></p>", 
    "end_date": null, 
    "title": "eBay Giftcards : Buy, Sell & Trade Ultimate Gift Card Guide", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov, Jewel Tolentino & Auret Esselen", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616778_58d1_4.jpg", 
    "course_url": "https://www.udemy.com/buy-sell-trade-gift-cards-ebay/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T19:19:24Z"
}