{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>LATEST: Course Updated on 25th of March 2016</em></p><p><strong>Have you ever wondered how top sales people close so many deals?</strong></p><p>Have you ever thought to yourself, \"Why does selling come so naturally to some, but seem almost impossible for others?\"</p><p>What are their secrets? Can you convert your prospects to clients, too, if you do as they do?<br></p><p>Well - you merely have to follow a few simple rules.</p><p>Look, the truth is: the lack of success that most encounter with selling has nothing to do with being an introvert or an extrovert, but instead is simply the absence of learning a few basic principles. Contrary to what some say, people are not “born\" salespeople. Selling is a skill that can be learned, developed, and mastered. <br></p><p>And now they are all revealed in this easy to follow course!</p><p><strong>Do what most don't to get the results others can't.- Start closing more sales now.</strong><br></p><p><em>Give yourself a fresh start by enrolling in this life-changing course now.</em></p><p><em></em><em>Every moment you delay, you lose out. Simple as that.</em></p><p><em></em>All the ongoing updates to this course are free, always, for ever.<br></p><p><strong><em>And there's a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really cannot lose!</em></strong></p>", 
    "end_date": null, 
    "title": "Effective Sales Questions - Close Deals Faster Than Before", 
    "price": 0, 
    "instructors": "Aamir Abbas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/798342_b856_2.jpg", 
    "course_url": "https://www.udemy.com/effective-sales-questions/", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-19T22:50:08Z"
}