{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Sick of calling customers but not getting through? Making sales calls and being told no? Customers trying to drive the price right down? Or prospects putting off making a decision? And then never getting back to you?</em>  </p>  <h5 style=\"\">                Sales has changed </h5>  <p style=\"\">  \t          Sadly that’s the day-to-day reality for the majority of salespeople today. Why is it? Simple – they’re using sales techniques that used to work, but just don’t get results any longer.  Without realising the world has changed, they have accidentally become sales dinosaurs.  </p>  <p style=\"\">  \t                         Customers have become both more knowledgeable and more demanding.  Today’s buyers are savvy, hard-nosed people who know exactly what they want and negotiate hard to get the best possible deal. Or alternatively, they’re super-cautious about taking any sort of risk in today’s world.  </p>  <h5 style=\"\"> Eight secrets of a new approach that works today </h5>  <p style=\"\">  \t         It doesn’t have to be that way. When you update your sales skills to deal with today’s realities, the results can be very different.  </p>  <p style=\"\">  \t        That demands a whole new sales approach to get prospects to want to listen, to talk openly about their needs, and to agree to a sensible, profitable deal. These eight secrets will enable you to achieve exactly that.  </p>  <h5 style=\"\"> Easy to follow and learn </h5>  <p style=\"\">  \t                                   This course uses short, easy-to-follow videos that teach the very latest sales principles to help you succeed with today&#039;s customers.  </p>  <p style=\"\">  \t                                   The material is broken down into eight sales success secrets that really will help you sell more today.  Each secret is explained with clear examples to help you put the new knowledge into action immediately.  </p>  <h5 style=\"\">    You’ll learn how to: </h5>  <ul style=\"\">  \t<li style=\"\">        Have the right mindset and intent to help customers buy</li>  \t<li style=\"\">Build trust with your customers as you become their ‘go-to-expert’</li>  \t<li style=\"\">Help your customers see why they need your solution now</li>  \t<li style=\"\">Make more sales without using the pushy, aggressive tactics that everybody hates</li>  </ul>  <p style=\"\">  \t               Don&#039;t be a sales dinosaur wondering why customers don&#039;t buy from you any more.  Learn new principles and skills that really work today and go out and help your customers succeed as they buy from you.  </p>  <h5 style=\"\">        Feedback </h5>  <ul style=\"\">  \t<li style=\"\"> <em style=\"\">&quot;It was the best training that I’ve ever had for sales”</em></li>  \t<li style=\"\"><em style=\"\">“Value vs price argument gave me something to work on”</em></li>  \t<li style=\"\"><em style=\"\">“I had the chance to recognise what I was doing wrong so far and which points I should stress more in my sales strategy”</em></li>  \t<li style=\"\"><em style=\"\">&quot;The material was absolutely relevant and examples used were memorable”</em></li>  \t<li style=\"\"><em style=\"\">“Very useful in gaining a structured approach to business development. Informative and enjoyable”</em></li>  \t<li style=\"\"><em style=\"\">“Everything was so clear, elaborated and easy to understand”</em></li>  </ul>", 
    "end_date": null, 
    "title": "Eight Keys to Sales Success", 
    "price": "35.00", 
    "instructors": "Mike McCormac", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/81112_2341_6.jpg", 
    "course_url": "https://www.udemy.com/eight-sales-success-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-20T07:49:01Z"
}