{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is the course you will need to understand how to effectively price your product to increase brand value and sales. This course \"Fashion Brand Launch: Pricing Your Products\" gives insight on what an entrepreneur needs to know about the impact of effective pricing.</p>\n\n<p>The 45 minute video course includes a formal presentation of strategies taught by Shawn Ward. The course will cover the following subjects:</p>\n\n\n\n<ul><li>Key Definitions</li><li>Painting The Picture</li><li>Calculating Landed, Wholesale, Retail, and Distributor Pricing</li><li>Pricing Example</li><li>Determining Product Pricing for Products</li></ul>\n\n\n\n\n\n<p>The course will allow every entrepreneur a chance to step back and make sure that your idea is one that can penetrate the marketplace. Rather your idea has been honed or is in the beginning stages, this 45 minutes will give every participant a clear starting point to make sure you carve out a niche in the market and have a reason to draw consumers to your brand.</p>\n\n\n\n<p>The course videos last a total of 45 minutes.</p>\n\n\n\n<p>The course is structured into 7 lectures.</p>\n\n\n\n<p>If you have any questions relating to the course, please feel free to contact me here on Udemy!</p>\n\n\n\n<p>Please don't forget to leave me a comment and a rating if you think it is appropriate to do so. :)</p>\n\n\n\n<p>If you enjoyed this Course you may like to consider my other Courses here on Udemy: Fashion Brand Launch: Corporate Filings &amp; Trademarks</p>\n\n\n\n<p>Testimonials:</p>\n\n\n\n<p>~ Very informative. A great detailed overview of the necessities needed for launching a brand. Great amount of knowledge and insight presented. From practical to inspirational - Stevyn</p>\n\n\n\n<p>~ It was jam packed full of info I was really looking for! - Cassy</p>\n\n\n\n<p>~ Great visual aids &amp; amazing webinar overall; extremely appreciative of the wealth of knowledge shared - Shayna</p>\n\n\n\n<p>~ Great, easy to understand and follow. - Joseph</p>\n\n\n\n<p>~ A lot of people start a business and don't know the first thing about starting a business, so this was helpful. - Crystal</p>\n\n\n\n<p>~ I really enjoyed this. I don't know much about business but have an Idea and dream so this is very helpful and I can follow. This will give me a guideline. Thank you - Mona</p>\n\n\n\n<p>~ Great, easy to understand and follow. - Joseph</p>\n\n\n\n<p>~ I LOVE WARD &amp; FIFTH!! - TG</p>", 
    "end_date": null, 
    "title": "Fashion Brand Launch: Pricing Your Products", 
    "price": "20.00", 
    "instructors": "Ward & Fifth Consulting", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/825728_0010_2.jpg", 
    "course_url": "https://www.udemy.com/fashion-brand-launch-pricing-your-products/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T05:37:45Z"
}