{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tWhat if I told you that you can pick the clients that you work with? Does that seem way out there? Let me show you how to choose more clients like the ones you work with currently that you enjoy and/or bring in the most Profit. This course will teach you how by using a FREE database service located at your public library you can obtain hundreds or thousands of new clients to market to.  </p>  <p>  \tYou will learn how to use the ReferenceUSA database service to select your ideal clients from millions in the ReferenceUSA database.  </p>  <p>  \t<strong style=\"\">Learn and Master This Ultra Powerful Business Development Strategy That Lets You Mint New Clients. </strong>  </p>  <ul style=\"\">  \t<p>  \t\t* You will get laser focused on your ideal/target client and/or market.  \t</p>  \t<p>  \t\t* Show you how to get real-time access to over 20 Million businesses, 262 Million Consumers and 855,000 Healthcare professionals contact information so you can market to them.  \t</p>  \t<p>  \t\t* Obtain access to data that powers the Top 5 Search Engines.  \t</p>  \t<p>  \t\t* You will get at least 50 more clients to market to by the end of this course.  \t</p>  </ul>  <p>  \t<strong style=\"\">A Powerful Skill That Will Empower Your Business Growth</strong>  </p>  <p>  \tLearning these 6 steps and the fundamentals of ReferenceUSA puts a very powerful and useful tool at your fingertips. ReferenceUSA is free, easy to learn if you follow the steps laid out for you in this course and will give you a powerful business development skill set.  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \tSuitable for those just starting, or thinking of starting a business to seasoned veterans, with 11 lectures and over 1.5 hours of content, you’ll learn all the fundamentals of using ReferenceUSA and establish a strong understanding of the capabilities of this tool in the business development arena. Each section closes with an assessment, putting your new learned skills into practical use immediately.  </p>  <p>  \tStarting with helping you to identify your ideal clients, to developing your Buyer’s persona, to the creation your ideal client list.  </p>  <p>  \tWith these basics mastered, the course will take you through finding a participation library, logging into their system, search capabilities, the different search  </p>", 
    "end_date": null, 
    "title": "Find Your Perfect Clients in 6 Steps", 
    "price": "45.00", 
    "instructors": "Pat Gage", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385904_23f1_4.jpg", 
    "course_url": "https://www.udemy.com/finding-your-perfect-clients-now/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T18:44:02Z"
}