{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Fiverr Masterclass: Increase your sales, make money and how to promote your gigs</strong></p>\n\n<p>Fiverr Masterclass: Increase your sales, make money &amp; promote your gigs like a pro. Are you on Fiverr? If not you are missing out on one of the best ways to make money online delivering digital goods. Fiverr started as a way to make $5 per completed job, but it has now evolved into a marketplace where you can charge just about any amount per gig ordered because you can make more money up-selling gig extras to your buyers. </p>\n\n<p>Months in the making! To create this course I studied some of the best Fiverr sellers learned what they did then started trial and error process of creating gigs and replacing them with better once. I quickly started to be successful on Fiverr doing it only part time I was able to generate a Level 2 top rating and my income pick up substantially in this course I will share everything I did so you can be just as successful on Fiverr.</p>\n\n<p>In this course you will learn why I got started on Fiverr, how much I made, and you will get my suggestions and tips for how you can make your gigs even better, and how to increase your sales on Fiverr. My many tips and tricks that you will get in this course will take your sales to the next level.</p>\n\n\n\n\n\n\n\n<p><strong>Features</strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>Latest info covering gig packages and self promotions</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>SEO Fiverr info figured out so you can get more Fiverr sales</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>Extensive collection of research that will maximize your Fiverr sales </em></p>\n\n\n\n\n\n\n\n\n\n<p><em>Over two years of experience buying and selling gigs on Fiverr</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>15 Researched gigs that guaranteed to make money on Fiverr</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>Motivation &amp; self hypnotic goodies section exclusive to this course</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>Much much more inside nothing hold back complete course</em></p>", 
    "end_date": null, 
    "title": "Fiverr Masterclass: Ultimate Fiverr seller mastery course", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/840772_0930.jpg", 
    "course_url": "https://www.udemy.com/fiverrmaster/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-05T21:02:06Z"
}