{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    If you are a telemarketer, or need training for your staff, then my workshop series is what you need.  </p>  <p>  \t    My experience spans over 20 years in all aspects of telemarketing, from being a TSR agent, to script writer, to manager to business owner. Over my 20 year career I have consulted businesses in the US, Canada, UK, Europe and Australasia.  </p>  <p>  \t    Now, I am offering my life skills and experiences. So you learn first hand intel from a fellow who has &quot;been there, done that and wrote two books on the subject&quot;.  </p>  <p>  \t    Each module gives the basis of what you need in order to run a successful campaign, and you will learn from valuable knowledge along the way.  </p>  <p>  \t    Modules:  </p>  <p>  \t    1 - What is telemarketing? This goes into the history of what TM is. When did it first begin and why? When did the revolution start in the 50&#039;s and why?  </p>  <p>  \t    2 - Types of Telemarketing - This delves into the different types of Telemarketing. B2B/B2C and what they mean  </p>  <p>  \t    3 - Telemarketing for beginners - this module goes into discussion about why do companies select to use telemarketing as opposed to traditional Direct Marketing? What are the stats on DM campaign to TM?  </p>  <p>  \t    Part 2 - Scripts - How to sound natural and not scripted (Also includes roleplaying)  </p>  <p>  \t    Part 3 - Script Writing - The basics and the 4 points that the end user wants to hear.  </p>  <p>  \t    Part 4 - The Process.  </p>  <p>  \t    * Getting past The Gatekeeper  </p>  <p>  \t    * That first call. How to talk to the Gatekeeper  </p>  <li> Using your tone to get what you want to know</li>  <li> What to say when the Gatekeeper says “NO”</li>  <li> Examples of “How to effectively sell over the phone”</li>  <p>  \t    Part 5 - When they say NO  </p>  <p>  \t    Working with Objections  </p>  <li> Reasons for objection and the general rules of communication manager in the process of objection</li>  <li> Types and forms of objections</li>  <p>  \t    Part 6 - Ending The Call.  </p>  <li> Phrases in parting with the Client</li>  <li> Positive Client Programming</li>  <li> Methods of remembering the Client</li>  <p>  \t    This comprehensive training videos will provide your sales team with everything they need to be successful.  </p>", 
    "end_date": null, 
    "title": "Fundamentals Of Telemarketing Workshop", 
    "price": "50.00", 
    "instructors": "Chris Jackson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320628_226c_3.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-telemarketing-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T05:01:46Z"
}