{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">BONUS Chapter added - enjoy!</em></strong>  </p>  <p>  \t<strong style=\"\">FULL Udemy MONEY BACK GUARANTEE in effect!</strong>  </p>  <p>  \t<strong style=\"\">How to get Customers and Investors Excited to Throw Money Your Way!</strong>  </p>  <p>  \t                         Why do we remember “Little Red Riding Hood&quot; after so many years? Does the name “Mr. Spock&quot; ring a bell? On the other hand, why do our prospects forget our presentations 10 minutes after we leave their office?  </p>  <p>  \t                         Wouldn&#039;t it be great to have the answers to these questions? It certainly would be if you wanted to sell something. Oh, you&#039;re not in sales you say? Are you sure?  </p>  <p>  \t                         When was the last time you wanted to persuade your co-worker to follow your lead? Or the last time you wanted your spouse to go along with your ideas? Or the last time you wanted to convince your boss to give into the crazy idea of giving you a raise? Here&#039;s the simple truth: These are all sales opportunities. Plain and simple! You want to close the sale, don&#039;t you?  </p>  <p>  \t                         Well, now you can.  </p>  <p>  \t<strong style=\"\">This course will teach you how to build bestselling stories and sell anything to anybody at anytime.</strong> No rocket science, just simple easy methods for everybody.  </p>  <p>  \t<strong style=\"\">You will get step by step instructions.</strong>  </p>  <p>  \t<strong style=\"\">You will get secrets elicited from the world&#039;s best:</strong> Steve Jobs, Stephen Spielberg, and many others.  </p>  <p>  \t<strong style=\"\">You will see best practice cases</strong>. Real cases from my successful customers.  </p>  <p>  \t                       You can learn how to become a StorySculptor yourself and help others to craft bestselling stories.  </p>  <p>  \t                         You will get access to a vast reservoir of different resources and ONE EXITING BOOK (maybe two) :-)  </p>  <p>  \t                         It&#039;s Easy, Convenient and Simple to learn. And it has a lot to do with “Little Red Riding Hood,&quot; “Snow White,&quot; the legendary “Mr. Spock,&quot; and many other stories that we remember. Good stories stick, while our sales pitch almost never does. Good stories are remembered, while our sales pitch goes in one ear and out the other. Good stories sell! While our sales pitch doesn&#039;t (most of the time).  </p>  <p>  \t                         So how do we change our sales pitch to convince our prospects and turn them not only into happy customers, but into raving fans?  </p>  <p>  \t                         Well, in short, we need to tell a story!  </p>  <p>  \t                         That&#039;s it! A story will do it!  </p>  <p>  \t                         In this course you will find the strategies you need to build an awesome story which excites, will be remembered, and which will be retold many times over.  </p>  <p>  \t                         Come on and join! You won&#039;t regret it!  </p>  <p>  \t<strong style=\"\">FULL Udemy MONEY BACK GUARANTEE in effect!</strong>  </p>", 
    "end_date": null, 
    "title": "Get Customers Excited And Sell More Right NOW!", 
    "price": "50.00", 
    "instructors": "Joachim Guenster (J.T. Story)", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356302_5b6c_7.jpg", 
    "course_url": "https://www.udemy.com/storysculptor/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T16:58:47Z"
}