{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Bonus Lecture Added on April 6 2016</strong><br></p><p>Are you frustrated that people don't listen to you, reject your ideas or your offer? Are you sick and tired of being rejected by potential clients, even so your product and service is real great?</p>\n\n<p>Do you want to become a real master in busting any objection that people put forward?</p>\n\n\n\n<p>Than this course is for you.</p>\n\n\n\n<p>It is for:</p>\n\n\n\n<ul><li>The sales person who wants to close more deals</li><li>The entrepreneur and negotiator who needs to be successful in high-stake deals</li></ul>\n\n\n\n<p>It is my intention for you to become a masterful persuader in the sales situation. This happens, when you finish the course and apply the learning. </p>\n\n\n\n<p><strong>But you must finish it, otherwise, you won't realise the impact and won't get the results!</strong><br></p>\n\n\n\n<p>Because this course provides you with 14 patterns that you can use in any sales situation. Additionally, it gives you the words and language patterns that makes you an outstanding connector. </p>\n\n\n\n<p>And it is only <strong>slightly more than 35 minutes in contents, which means, the learning is compact, without waffling.</strong> Straight to the point, and easy to understand. Together with your own personal WorkShop Manual, that is a bargain!<br></p>\n\n\n\n<p>All of this has been derived from NLP, or Neuro Linguistic Programming. The methodology is called Sleight of Mouth, and it is a tool that allows you to shift people's mindset easily!</p>\n\n\n\n<p><strong>And only after you went through it all, can you realise its beauty!</strong></p>\n\n\n\n<p>You will see at the example \"You are too expensive, we cannot afford it\", how easy it is to shift beliefs and mindsets.</p>\n\n\n\n<p><strong>But the course doesn't stop there.</strong></p>\n\n\n\n<p>In the end of the course, you <strong>get a clear summary on how to apply all of the learning</strong> to your real life through more examples and a practical formula.<br></p>\n\n\n\n<p>Furthermore, you receive <strong>your own WorkShop Book</strong> that gives you the overview and detailed explanation of the process to ease you into your learning and its applications. </p>\n\n\n\n<p><strong>When you complete the course</strong>, you will be someone, who takes on any objection or rejection with ease, and is able to break through any resistance, and obstacle while deepening rapport. </p>\n\n\n\n<p>If you are interested in increasing your influence, and your persuasive skill and add on to your current success, you must take this course now.<br></p>\n\n<p>And, as sad as it is - should you feel that the course is not for you, it is backed by Udemy's 30 day money back guarantee. I would cry and wonder why, but I would have to let you go! </p>", 
    "end_date": null, 
    "title": "Get to Yes - Use NLP To Overcome Rejections In Sales", 
    "price": "20.00", 
    "instructors": "Andreas Dorn", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577112_9167_2.jpg", 
    "course_url": "https://www.udemy.com/get-to-yes-use-nlp-to-overcome-rejections-in-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T04:36:42Z"
}