{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Give Me One Week - And I&#039;ll Give You the Secret to Acquiring More Customers &amp; Clients Than You Can Handle</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">Why almost everything you&#039;ve ever heard about customer acquisition is wrong.</em></li>  \t<li style=\"\"><em style=\"\">How to quickly &amp; inexpensively attract qualified prospects that convert into your top clients.</em></li>  \t<li style=\"\"><em style=\"\">The simple, easy to implement system for you to stand out and command attention.</em></li>  </ul>  <p style=\"\">  \t          Dear fellow business owner,  </p>  <p style=\"\">  \t                         My name is Archer Atlas and I’m a best-selling author, speaker and consultant. Above all, I am someone who knows how to get you more customers and clients.  </p>  <p style=\"\">  \t                         You see, over the years I&#039;ve been able to raise tens of millions of dollars, and land thousands of clients… using nothing other than the telephone and the system I’ll share with you in this course.  </p>  <p style=\"\">  \t                         Now before you go running for the hills, thinking this system might be inapplicable to your business, let me tell you this:  </p>  <p style=\"\">  \t<strong style=\"\">  I have never come across any business that could not benefit from this system—<u style=\"\">not a one</u>.</strong>  </p>  <p style=\"\">  \t                         To clear the air, this system is far different than anything you&#039;ve ever seen before:  </p>  <ul style=\"\">  \t<li style=\"\">It’s not cold-calling</li>  \t<li style=\"\">It’s not telemarketing</li>  \t<li style=\"\">And it’s not even “selling” at all</li>  </ul>  <p style=\"\">  \t                         In fact, as you’ll discover in this course, this system is the <em style=\"\">antithesis of selling</em>. Not only that, but right now, it is working better than ever.  </p>  <p style=\"\">  \t                      I&#039;d like to share with you this system that almost nobody knows about and certainly nobody else teaches. It&#039;s the exact system I&#039;ve used--and my clients have used--to make <strong style=\"\">millions of dollars</strong>.  </p>  <p style=\"\">  \t                      And this system is really the easiest way in the world to get more high-quality prospects to raise their hands for you and take notice... in a method that has never before been revealed.  </p>  <p style=\"\">  \t<strong style=\"\">You Take Zero Risk</strong>  </p>  <p style=\"\">  \t                      In fact, I&#039;m so confident this method will bring you more prospects, customers and clients--and work far better than anything you&#039;ve ever tried before--that I will give you the following <strong style=\"\">guarantee</strong>:  </p>  <p style=\"\">  \t                      Go through the first section, then the second. If for any reason, the material doesn&#039;t completely blow you away, or you&#039;re somehow unconvinced this system won&#039;t bring you more customers and clients, more sales and revenue, and more bottom line profits...simply ask for a refund. You&#039;ll get it with no problem and no questions asked.  </p>  <p style=\"\">  \t                      What could be more fair than that? Especially when you consider how much people pay me to work with them one-on-one.  </p>  <p style=\"\">  \t                      Even an hour of my time is worth over $1,000 and I&#039;ll be raising my rates in the Fall.  </p>  <p style=\"\">  \t<strong style=\"\">Why Right Now is Your Time...</strong>  </p>  <p style=\"\">  \t                    Over the last few years, my clients have had tremendous success with growing their businesses—growing their amount of clients, their sales, and their overall bottom line profits.  </p>  <p style=\"\">  \t                    And in exchange for helping them, I&#039;ve made a pretty good living via my consulting fees which start off in the low six-figure per year level. Now I understand that most people reading this aren&#039;t going to write a check for that on the spot, sight unseen.  </p>  <p style=\"\">  \t                    And that’s why I created &quot;<strong style=\"\">Get More Customers &amp; Clients NOW</strong>.&quot; I&#039;ve taken all the lead generation and client acquisition strategies and tactics I&#039;ve used to help my clients… and I&#039;ve distilled them into this content packed course, so you don’t have to spend six figures to find out how to <em style=\"\">REALLY </em>get more customers and clients in <em style=\"\">YOUR </em>business.  </p>  <p style=\"\">  \t                    Now, if you’re like most business people out there, the last few years have presented you with a lot of threats to your business… whether that’s increased competition, shrinking profit margins caused by higher client acquisition costs &amp; decreased sales effectiveness, or decreased client loyalty.  </p>  <p style=\"\">  \t                    This course is all about helping you solve these problems and take advantage of this golden opportunity you have in front of you right now by showing you exactly, step-by-step how to get a flood of new prospects raising their hands for you, qualifying themselves for you, and becoming your customers and clients.  </p>  <p style=\"\">  \t                     Anyway, I&#039;m not here to brag or tell you I&#039;m the greatest thing since sliced bread. I want this course to do the talking for me. I know it will.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\"> Try it.</em></strong> If it&#039;s not the best material on lead generation or client acquisition strategies you&#039;ve ever seen, <em style=\"\">you&#039;ve lost nothing but the 19 minutes it&#039;ll take you to go through the first two sections.</em>  </p>  <p style=\"\">  \t                    On the other hand, when you see that this material is as good as I say it is--and then some--and you see that this easy to implement system has the power to transform your business... then you&#039;ll know I was right all along.  </p>  <p style=\"\">  \t                    More importantly, you&#039;ll have a system you can use tomorrow, the day after, and for y<em style=\"\">ears to come</em> to grow your business, regardless of the industry you&#039;re in.  </p>  <p style=\"\">  \t<strong style=\"\">   Here&#039;s why I&#039;m so confident that&#039;s the case here...</strong>  </p>  <p style=\"\">  \t                    Once you&#039;ve tried this system, you&#039;ll either like it or you won&#039;t (I suspect you will).  </p>  <p style=\"\">  \t                    If you like it, and it resonates with you, you&#039;ll have a <em style=\"\">deluge </em>of new customers and clients pouring in over the next 30 days, and you&#039;ll find yourself agreeing that you&#039;ve never seen <strong style=\"\">anything</strong> like this in your life!  </p>  <p style=\"\">  \t                    You&#039;ll realize you can&#039;t get anything even <strong style=\"\">remotely</strong> like this. And if you&#039;re looking to really grow your business and have a flood of new customers and clients coming your way, then this is for you!  </p>  <p style=\"\">  \t                    If you&#039;re not sure you should jump on this opportunity right now, I can remember when I used to be more hesitant and didn&#039;t come to decisions as quickly as I do today.  </p>  <p style=\"\">  \t<strong style=\"\">But this is a limited opportunity. </strong>I&#039;m not going to share this information with too many people for too long--and at this price--or else it would lose some of its effectiveness.  </p>  <p style=\"\">  \t                    So act now, before I change my mind.  </p>  <p style=\"\">  \t                    Sincerely,  </p>  <p style=\"\">  \t<strong style=\"\">Archer Atlas</strong>  </p>  <p style=\"\">  \t<strong style=\"\">P.S. </strong>The fastest and easiest way to double your sales is to double the amount of prospects that come to you, raising their hands, and qualifying themselves for you. I have 7 proven techniques that can easily do this for you and your business.  </p>  <p style=\"\">  \t                    So there really is only one question remaining:  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">Will you take the next step and give my proven, real world system a try?</u></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">.</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\">  What kind of materials are included?</strong>  </p>  <p style=\"\">  \t                         31 detailed, yet concise lectures spanning 10 sections and ~3 hours.  </p>  <p style=\"\">  \t                         PDF presentations slides for all lectures.  </p>  <p style=\"\">  \t                         A workbook that condenses the main points of each section and contains thought-proving questions to better help you actually use the material of the course in your business.  </p>  <p style=\"\">  \t<strong style=\"\">  How long will this course take to complete?</strong>  </p>  <p style=\"\">  \t                         The lectures themselves run a little under 3 hours in length, yet the evergreen material within can be used now, later, or for the rest of your life to serve you in growing your business, getting more customers &amp; clients, more sales, and more bottom line profits.  </p>  <p style=\"\">  \t<strong style=\"\">  How is this course structured?</strong>  </p>  <p style=\"\">  \t                         There are 31 lectures, each with a PDF containing its presentation slides. There&#039;s also a workbook with thought-provoking questions to help you apply the material to help grow your business, in real life.  </p>  <p style=\"\">  \t<strong style=\"\">  Why take this course?</strong>  </p>  <p style=\"\">  \t                         Simply, because your time has come. Your time to start really growing your business and getting more customers, more clients, higher sales and revenue, more bottom line profits and cash injected into your business and bank account has come. Isn&#039;t time you really start growing your business and enjoying all that comes with it? The path to truly enjoying the fruits of your labor is just a click away. That&#039;s why you should absolutely take this course.  </p>", 
    "end_date": null, 
    "title": "Get More Customers & Clients NOW", 
    "price": "20.00", 
    "instructors": "Archer Atlas", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/268586_f58f_6.jpg", 
    "course_url": "https://www.udemy.com/get-more-clients-now/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-25T11:53:52Z"
}