{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This program contains material which was presented on-stage at the Richard Branson Financial Summit in 2012, which was a top seller and received raving reviews.</strong></p>  <p>  \t <strong>      Most businesses fail within the first 5 years. Why is this?</strong>  </p>  <p>  \t                         1. The owner becomes the business, trying to do it all by themselves.  </p>  <p>  \t                         2. Continuously looking for new business. No continual sales pipeline on autopilot.  </p>  <p>  \t                         3. Signing up to risky and expensive advertising that did not generate a return.  </p>  <p>  \t                        4. Leading to long hours and stress overload.  </p>  <p>  \t                         By following our program you can avoid all these pitfalls and build a successful business built on the foundation of strong joint ventures.  </p>  <p>  \t <strong>            The key is to find multiple businesses that pass you regular business.</strong>  </p>  <p>  \t           Here is only a few of the 1000's of business owners and students who I have show how to build and grow any business quickly using the power of joint ventures.  </p>      <p>  \t                         This program will show you how to build successful joint ventures which can rapidly grow any type of business.  </p>  <p>  \t                             You will ALSO acquire the skill set to work as a joint venture agent, showing you step by step how easy it is to bring in passive income and secure your financial future.  </p>  <p>  \t<strong>                         It is a comprehensive program with 12 modules and a total of 87 easy to follow videos with optional workbooks which you can follow along with.</strong>  </p>  <p>  \t             The material in this course has been structured as home based learning course.  </p>  <p>  \t                        This course is for anyone who is thinking of running a business ( or already has one ) or would simply like to learn the skills of helping other people build strong profitable businesses.  </p>  <p>  \t<strong>                       Here is just some of the topics this program will cover:</strong>  </p>  <p>  \t                                  1. How to find and form powerful joint venture business relationships  </p>  <p>  \t                                  2. How to make money being a joint venture agent.  </p>  <p>  \t                                  3. Analysing and finding red hot niches.  </p>  <p>  \t                                  4. How to write a winning joint venture contract.  </p>  <p>  \t                                  5. Using gift certificates to boost your sales  </p>  <p>  \t                                  6. How do you Create Successful Joint Ventures Using Unconverted Leads!  </p>  <p>  \t                                  7. How to Generate Cash Using Trade &amp; Barter!  </p>  <p>  \t                                  8. Secrets to Getting businesses to want to joint venture with you!  </p>  <p>  \t                                  9. Setting Your Referral System Up: Step by Step!  </p>  <p>  \t                                  10. Why Do Clients Leave and How Can You Cash In On This Opportunity!  </p>  <p>  \t                                  11. Your Step by Step Guide to Becoming An Agent!  </p>  <p>  \t                                  Luke is a joint venture specialist. He has many years experience running seminars and courses and has helped 1000's of people structure their business for rapid growth and success using the powerful joint venture program shown in these videos.  </p>  <p>  \t<strong>  These people paid over $3000 to attend this joint venture seminar.</strong>  </p>  <p>  \t<strong>  You are getting the same high quality program at a fraction of the cost!</strong>  </p>  <p>  \t<strong>Sign up today to take advantage of this limited time special price for udemy members.</strong>  </p>", 
    "end_date": null, 
    "title": "Grow any business super fast using joint ventures", 
    "price": "50.00", 
    "instructors": "Luke Fatooros", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/157546_2fa1_13.jpg", 
    "course_url": "https://www.udemy.com/building-a-business-that-sets-you-up-for-life-using-joint-ventures/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-04T01:47:26Z"
}