{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>En tu curso aprenderás qué es negociar (y qué no es), los tipos de negociación, las fases de preparación, desarrollo y cierre; desarrollarás la habilidad para determinar tus objetivos de la negociación con atributos de calidad, cantidad, oportunidad y costos, los cuales te permitirán tener en claro tus metas y contar con una base para evaluar tu desempeño como negociador; además podrás elegir el lugar adecuado para tu reunión, saber qué información recabar de tu contraparte, qué información recabar de tu producto y servicios (seas el vendedor o el comprador) así como poner a tu favor el entorno de la negociación. De igual forma podrás determinar tus posibles concesiones así como las posibles objeciones de tu contraparte y los argumentos para rebatirlas, con lo que podrás evitar que te tomen desprevenido.</p><p>Tu curso incluye guías prácticas y sencillas para que documentes tu negociación, desarrolles tu habilidad, asegures cerrar tratos exitosos y que te llevarán de la mano para facilitar tu experiencia de aprendizaje.</p><p>Encontrarás evaluaciones del conocimiento para que te tengas la oportunidad de evaluar tu aprovechamiento del curso y repasar los temas con áreas de oportunidad</p><p>El curso está elaborado a través de 17 clases en video las cuales podrás revisarlas a tu propio ritmo de avance.</p><p>Contarás con apoyo en caso de tener dudas, sólo envíame un mensaje y lo contestaré a la brevedad posible.</p><p>No lo dudes más, si requieres generar tratos exitosos que incrementen tus ganancias éste es el curso ideal.</p>", 
    "end_date": null, 
    "title": "Habilidades de negociación. Cierra tratos de forma exitosa.", 
    "price": "20.00", 
    "instructors": "Raymundo J. Rodríguez.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544408_1e2b_2.jpg", 
    "course_url": "https://www.udemy.com/habilidades-de-negociacion/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T21:50:29Z"
}