{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>While using the 80/20 rule, did you know that 20% of your buyers are responsible for 80% your sales? That&#039;s not to say that all your buyers are not important. But, that 20% of  buyers are what we call your serious premium buyers. Folks who are action-takers and want to buy almost everything in your funnel (assuming all your one-time offers and upsells help them achieve their end desire).<br style=\"\"><br style=\"\">Did you know that most sales funnels are setup to combine your premium buyers and non-premium buyers together?<br style=\"\"><br style=\"\">…and by doing this, you impact your long-term growth because you have a list of customers but are not providing them exactly what they want?<br style=\"\"><br style=\"\">If you think about the impact of this common mistake, the results show themselves in low engagement and a low retention rate of buyers.<br style=\"\"><br style=\"\">So if you&#039;d like to know how to setup your sales funnel to achieve this goal in finding the “diamond in the rough&quot; buyers come join us in this course where I show you how to set up smart sales funnels to sift serious buyers from non-serious buyers.</p><p><strong style=\"\">Enroll now to receive a Smart Sales Funnel Blueprint that allows you to dramatically increase sales and scale your business!</strong></p>", 
    "end_date": null, 
    "title": "How to Build Smart Sales Funnels for Quadrupling Your Profit", 
    "price": "25.00", 
    "instructors": "MindMekka ®", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455656_741c.jpg", 
    "course_url": "https://www.udemy.com/smart-sales-funnels-that-quadruple-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T11:48:07Z"
}