{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course will consist of the five key areas that are essential for anyone to move from selling to becoming a business consultant:</p><ol style=\"\"><li style=\"\"><strong style=\"\">Core competencies to build rapport </strong>How to establish credibility is essential in any business. Kouzes and Posner researched why leaders gain and lose credibility. We will see the four building blocks of credibility that is essential for building trust – be it with customers or your team. In a nutshell, we will see how to be sincere, show competence, inspire others and develop empathy.</li><li style=\"\"><strong style=\"\">Core competencies to explore clients´ needs </strong>We will learn how to identify the \"gap\" between the current situation and the desired results. This process is vital not only for a salesperson, but also for any consultant. Needs assessment analysis is a key step in determining what the client has and what he expects.</li><li style=\"\"><strong style=\"\">Core competencies for advocating solutions </strong>In this step, participants will learn how to advocate, present and close the deal. Our purpose in this module is to recommend products or services that meet a compelling need of our client. Any time you are unable to meet a real need of your prospect, you run the risk of handing him a blank check.</li><li style=\"\"><strong style=\"\">Core competencies in dealing with objections </strong>We will understand what an objection is and why customers ended up making objections. We will understand if the objection is valid or invalid and we will see how to address any objection.</li><li style=\"\"><strong style=\"\">Core competencies for doing what needs to be done </strong>Many companies lose clients at this stage. They ignore the client after they close the deal. Giving support to clients´ buying decision is the pillar of long-term relationship. You just don´t want to sell once and never again. Thus, we will understand that the client is eager to know four things, namely: </li></ol><ul style=\"\"><ul style=\"\"><li style=\"\">How can I be sure you will do what you promised me?</li><li style=\"\">How do I know your product or service will do for me what you say they will do?</li><li style=\"\">How do I know your company is the best company for me? And</li><li style=\"\">How do I know your solution will continue to be the best one down the road given the rapid pace of change in the market?</li></ul></ul>", 
    "end_date": null, 
    "title": "How to be Effective at Selling", 
    "price": "20.00", 
    "instructors": "Robert Silva", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589938_9a4f_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-effective-selling-course/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T22:18:22Z"
}