{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>COURSE UPDATED on the 24th of DECEMBER 2015. NEW LESSONS ADDED.</strong></p><p>The goal of this course is teaching to people <strong>how to develop an effective and efficient sales strategy in order to MAXIMIZE SALES</strong>. The secrects explained are related to many different aspects, from ecommerce to direct sales, from online selling to \"face-to-face\" negotiation. The variety and the depth of the topic make it affordable BY EVERY person, skilled salesmen, newbies of the subjects or simple shop owner that would like to boost their direct sales.</p><p>The language is quite easy and can be understood also from people who are not english/american mother tongue. </p><p>The structure of the course is divided into the dualism between VIDEO lessons and BONUS textual lessons. The bonus lessons enhance the level of the general knowledge deeping the topics into their most inner secrets.</p><p>I<strong>n conclusion, following this course, students will be able to understand a very important piece of the SELLING overall world, and, at the end, they will be able to set the correct strategyand MAXIMIZE sales for every specific situation or circumstance.</strong></p><p><strong>ABOUT NICK, the instructor</strong>: Nick is an audiobook narrator and producer with super rates and service provision (85 + fully edited and produced audio hours of experience with voiceover). Nick has a lot of experience also in the field of recording ONLINE LESSONS, and he has taught different topics on many different platforms. This radio presenter / producer,  actor, and voice over artist has many satisfied clients divided and shared among all the continents.</p>", 
    "end_date": null, 
    "title": "How to maximize SALES: ecommerce, direct sales and marketing", 
    "price": "25.00", 
    "instructors": "Dr. Edoardo Mazzoli", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444008_02d4_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-maximize-ecommerce-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T18:20:57Z"
}