{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you sell over the Phone?</p><p>Are you a virtual sales rep?</p><p>Do you work in a call center?</p><p>Do you set appointments over the phone?</p><p>Do you give presentations online?</p><p>If you answered yes to any of the above, then you need to take this training NOW!</p><p><strong style=\"\">Section 1 What to say</strong></p><p><strong style=\"\">No Soup For YOU! - The Take Away Sale</strong></p><p><em style=\"\">In this session we are going deep on how to get the prospect to tell you everything you need to know to close them. You will learn the things to say and the things that you don&#039;t say -- so that the prospect feels like they are winning. People do not like to be sold - but they love to buy. Get your prospects BUYING from you now with confidence.</em></p><p><strong style=\"\">HOT WORDS - Super Secret Sentences that Sell Every Time</strong></p><p><em style=\"\">In our HOT WORDS training - you will get our BEST “sure fire&quot; things you can say to get the process moving forward and/or tied down. You don&#039;t need an endless list of these - so we are going to give you our top 10. When you start using HOT WORDS - you will find your closing ratio and sales commissions start climbing.</em></p><p><strong style=\"\">CLOSE - Better Faster Smarter with this Simple Method</strong></p><p><em style=\"\">Stumped on what to ask the prospect next? This simple process works EVERY TIME. Top Procedures who master this simple method consistently outpace everyone on their team. We will take you through the method and give you real world practice on using it NOW.</em></p><p><strong style=\"\">HACKED - The Close Better Faster Smarter Method</strong></p><p><em style=\"\">Going deeper on the BEST method for closing more sales NOW. We will deconstruct the method from the inside out so that you have confidence to use this with ease. Sales Pros have paid thousands to learn and perfect this one method - YOU have it in this training from the perspective of those who have seen consistent success with it.</em><span></span></p><p><strong style=\"\">Second 2 When to say it</strong></p><p><strong style=\"\">Authentic connection in SECONDS = Rapport made easy</strong></p><p><em style=\"\">Use these hidden tools to gain the trust and respect of anyone in moments. Know exactly what to do in any situation to build the deep bonds that lead to significantly higher closing ratios. People buy more and often when they like you - get that edge NOW.</em></p><p><strong style=\"\">LEVERAGE the Sale with DEEP Customer Insights</strong></p><p><em style=\"\">Step into a new world with the science that leads people consistently to the close. Know this and have maximum power over the prospect. This is a valuable training with an expert in the field of Psychometrics and Psychology, Robbie Grayson.</em></p><p><em style=\"\">You learn how to understand your customer from the perspective of how they think, what they like, how they would respond to. This information is highly valuable so that you can move the sales process along quicker.</em></p><p><em style=\"\">As part of your paid course you will receive one TraitMarker Assessment worth $29.99. </em></p><p><em style=\"\">Make sure you take the assessment before you take the 3rd part of this series: Understand THEM to Sell More</em></p><p><strong style=\"\">TOP LEVEL TOOLS to find the Real Need</strong></p><p><em style=\"\">In our 2nd Session with Robbie Grayson - We will give you step by step processes to drill down and find what the prospect really needs. Once you are there - you are ready to close.</em></p><p><strong style=\"\">Understand THEM to Sell MORE</strong></p><p><em style=\"\">Part 3 with Robbie Grayon: Know the type of person you are talking to - get ahead of the words and go deep on personality type to know how to win the sale. Learn how to interpret personality types so that your sales success sores!</em></p><p><em style=\"\">NOTE: As part of your paid course you will receive one TraitMarker Assessment worth $29.99. </em></p><p><em style=\"\">Make sure you take the assessment before you take this 3rd part of this series: Understand THEM to Sell More</em></p><p><strong style=\"\">Section 3 How to say it</strong></p><p><strong style=\"\">Improve your tone - INCREASE Your Sales</strong></p><p><em style=\"\">BIG NEWS - how you say it has more POWER than what you say. DO these simple things to start selling more TODAY. Practical tips and techniques that really work with voice expert - Camille Conte.</em></p><p><strong style=\"\">Emails that WORK!</strong></p><p><em style=\"\">USE the most overlooked and misused tools out there to get your prospect on the phone more often. Know for sure when to send, the message to use and the frequency that WORKS with email to get an appointment.</em></p><p><em style=\"\">In our roundtable interview with Jake Atwood we talk about the importance of sending an effective email. The point of sending email is to get an appointment or call. Not just to be sending an email.</em></p><p><em style=\"\">Learn how to increase your email open rate.</em></p><p><em style=\"\">Learn about LinkedIn campaigns and get results.</em></p><p><em style=\"\">As Part of your paid course you will get a free trial of BuzzBuilder, plus a consultation on how to use it properly.</em></p><p><strong style=\"\">Higher Level Communication NOW!</strong></p><p><em style=\"\">Learn proven peak performance techniques from rock star - Jesse Korby. Don&#039;t just get to first base - hit a home run! Know what words and actions lead to the end result most often. Train your mind to think differently - Win before you start playing the game.</em></p><p><strong style=\"\">HACKED - Higher Level Communication</strong></p><p><em style=\"\">Step by step deconstruct on this proven method of moving the sales process to the finish line.</em></p><p><strong style=\"\">Section 4 Why to say it</strong></p><p><strong style=\"\">The SECRETS of Super Sales Success I learn from Chet Holmes</strong></p><p><em style=\"\">Each generation turns out its own giants -</em></p><p><em style=\"\">In the world of sales and business growth, one of those giants was Chet Holmes. He created the Ultimate Sales Machine. Chet&#039;s actions and results prove he was the real deal. From a master of martial arts to the highest levels of business/sales, Chet did it all - eventually partnering with Tony Robbins to create Business Breakthroughs International.</em></p><p><em style=\"\">Many have benefited from Chet&#039;s trainings - but I had the rare opportunity to be trained directly by Chet - what some would pay thousands for, I received on a consistent weekly basis being one of his prized TOP PRODUCERS.</em></p><p><em style=\"\">In this training - you will learn what Chet considered the key elements to top level sales. This is what he used internally with his own sales team - this is what his TOP PRODUCERS used every day.</em></p><p><em style=\"\">Get ready to up your game and your commissions with this highly sought after training.</em></p><p><em style=\"\">This training is priceless and not available anywhere else! You are getting it straight from someone who learned it, used it and had it perfected by the master himself - Chet Holmes..</em></p><p><strong style=\"\">How to Sow Seeds for REPEAT Sales</strong></p><p><em style=\"\">Jake Tikan trains us on doing the right thing - ALWAYS keeping the prospects best interest at the front of your words and actions will ultimately lead to the Best Sales Situation - a client who is happy today, tomorrow and forever. They not only buy more and come back to buy more often - but they become your raving fan who promotes YOU to their networks of influence. WIN big with ethical selling.</em></p><p>==================================================</p><p>Learn from consistent TOP PRODUCERS who have worked for and learned from legends:</p><p>Tony Robbins</p><p>Jay Abraham</p><p>Chet Holmes</p><p>Eben Pagan</p><p>Are you making all the $ you want?</p><p>Put yourself ahead of the rest with Top Producing Sales Skills.</p><p>Close more sales TODAY - <strong style=\"\">Better, Faster, Smarter:</strong></p><p>This is the only training you will need this year to close deals Better, Faster and Smarter.</p><p>Our team has created 14 lessons of highly focused training (182 minutes total) - each giving you specific proven sales skills that top performers use to make maximum comissions.</p><p>Starting with the What to Say, then moving through When to Say it, How to Say it, and Why to Say it - you will learn commission raising strategies like:</p><p>Developing high level trust and respect FAST!</p><p>The secrets to understand your customers so they buy more and more often</p><p>Using your voice properly to gain leverage in the sale</p><p>How to use email effectively - the do&#039;s and don&#039;ts</p>", 
    "end_date": null, 
    "title": "How To Close Deals Over The Phone", 
    "price": "50.00", 
    "instructors": "Sell Better  Faster Smarter", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381892_fe9c_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-close-deals-over-the-phone/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T00:23:34Z"
}