{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">In this course you&#039;ll discover, learn, and memorize:</strong></p><ul style=\"\"><li style=\"\">How to sell using a proven sales model.</li><li style=\"\">How to hypnotize yourself so you improve yourself to where you need to be.</li><li style=\"\">How to communicate hypnotically so you can impress the people you&#039;re speaking with.</li><li style=\"\">How to reduce resistance in every sales call situation you find yourself in.</li><li style=\"\">How to suspend doubt and disbelief instantly so you immediately gain the trust and faith of your potential customer.</li><li style=\"\">How to use perceptual predicates to paint picture stories that sell ideas to your potential customer.</li><li style=\"\">How to tell hypnotic stories that captivate your potential customer while helping them draw insights on their own and associate positive feelings around your product, service, and yourself.</li><li style=\"\">How to inspire interest which transfers quickly into a desire for your product, which then short-cuts to your potential customer taking automatic action to get your product.</li><li style=\"\">How to close sales naturally without offending or making anyone to feel uncomfortable.</li><li style=\"\">How to apply The Hypnotic Memory Method so you can quickly commit anything to memory whilst at the same time committing it indirectly to memory for your potential customer as well; making you and your product unforgettable.</li><li style=\"\">How to sell any idea with four magic words, only.</li><li style=\"\">How to always know what to say and when to say it and never be at a loss for words during a sales call ever again.</li><li style=\"\">How to model one of the greatest hypnotists of all times so you can communicate as hypnotically as he did.</li><li style=\"\">How to build solid relationships with your customers and ensure that you maximize the customer lifetime value (CLV) so you profit more.</li></ul><p style=\"\">And much much much much more!</p><p style=\"\"><strong style=\"\">Materials Provided:</strong></p><p style=\"\">9+ Hours of Video Lecture</p><p style=\"\">Hours of Audio Lecture</p><p style=\"\">Article Lessons</p><p style=\"\">Access to an exhaustive online textbook you can access anytime.</p><p style=\"\">54 hypnotic language patterns</p><p style=\"\">A Milton Model cheat-sheet</p><p style=\"\">Ongoing instructor support</p><p style=\"\">Ongoing future resources</p><p style=\"\"><strong style=\"\">Who this course is for:</strong></p><p style=\"\">This course if for the sales professional or anyone wanting to enter into the professional world of selling with the intention of being successful. Success is defined in this course as someone wanting to be in the elite 1%ER category of top sales professionals on a sales force. </p><p style=\"\"><strong style=\"\">Who this course is <em style=\"\">not </em>for:</strong></p><p style=\"\">People in other outside professions who have no intention of selling or negotiating or being better communicators in general.</p><p style=\"\"><strong style=\"\">Why take this course:</strong></p><p style=\"\">Take this course if you want to <strong style=\"\">be number one</strong> on your sales force, want to <strong style=\"\">love selling </strong>products and services to others, and want to <strong style=\"\">communicate hypnotically</strong> whilst you <strong style=\"\">experience self-hypnosis </strong>intentionally so you can <strong style=\"\">achieve excellence</strong> in your life.</p>", 
    "end_date": null, 
    "title": "How I Make Sales Using Hypnosis", 
    "price": "50.00", 
    "instructors": "Bryan Westra", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508520_9106_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-make-sales-using-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T23:31:03Z"
}