{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is for anyone involved in or fascinated by the world of retail. </p><p style=\"\">It will be of particular practical use for boutique and independent retailers and their managers as it provides insights into simple techniques used by some of the world&#039;s leading retailers to improve the shopper experience. </p><p style=\"\">The course specifically covers four key techniques to attract shoppers into a store and help them get into a mindset to linger longer, buy more and tell their friends about the good experience they had in that store. </p><p style=\"\">In each section, shopper experience expert, Kevin Moore, shows examples and shares his observations from a wide variety of stores, large and small, he&#039;s visited during his shopper experience tours in the Americas, Asia, Europe and Australasia. His real-world insights and examples will help you understand the concepts and inspire you to come up with your own variations.</p><p style=\"\">The four main concepts covered in this course to improve the shopper experience are:</p><ul style=\"\"><li style=\"\">Effective side-walk interrupters to help shoppers notice your store and not just wander by</li><li style=\"\">Techniques for attracting shoppers into your store - from window to walk-in</li><li style=\"\">The decompression zone - a vital area to understand so as to help you slow the shopper down ready to purchase</li><li style=\"\">The importance of sight-lines and airspace and how to, and not to, use it!</li></ul><p style=\"\">Each section contains a short video where Kevin explains the concept. He then takes you through an extensive collection of photos he&#039;s gathered during his trips to illustrate and reinforce the concepts.</p><p style=\"\">The four elements in this course are a taster taken from Kevin Moore&#039;s much more in-depth shopper experience course - <strong style=\"\">The Retail Trifecta</strong> - also available on Udemy. The full course goes into great depth on Kevin&#039;s concept of <strong style=\"\">T</strong><strong style=\"\">he Retail Trifecta </strong>- the three essential retail ingredients that, when successfully combined together, create a multiplying effect to the success of the business and the experience of its shoppers. The full course covers the twenty steps that retailers need to get right in order to achieve their own <strong style=\"\">Retail Trifecta.</strong></p><p style=\"\">So, if you want to quickly dip your toe into the world of the &quot;shopper experience&quot; and understand some easy concepts that improve it, then this course is for you!</p>", 
    "end_date": null, 
    "title": "How to bring more shoppers into your retail store.", 
    "price": "20.00", 
    "instructors": "Kevin Moore", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502464_831f_2.jpg", 
    "course_url": "https://www.udemy.com/more-shoppers/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T01:20:25Z"
}