{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">    Want to sell your product on Amazon?  </strong>  </p>  <p>  \t    This course walks you through the process of setting up an Amazon Seller Account, adding your products to the Amazon database and managing orders.  </p>  <p>  \t    This is a great course for those who want to start selling their products online through Amazon.  </p>  <p>  \t    Do you have a product you want people to be able to purchase through Amazon? Amazon offers a couple of different ways that you can become a seller and make your products available through their large network. In this course, we discuss everything from setting up an Amazon account to preparing your product for sale on Amazon.  </p>  <p>  \t<strong style=\"\">What do you need to sell on Amazon?</strong>  </p>  <ul style=\"\">  \t<li>You need an Amazon Seller Account</li>  \t<li>A product with appropriate packaging and labeling</li>  \t<li>Good product photography</li>  \t<li>A marketing plan to market your product</li>  </ul>  <p>  \t<strong style=\"\">How long does it take to start selling on Amazon?</strong>  </p>  <p>  \t  You can start selling almost immediately on Amazon. After setting up your account, you can instantly add products to the Amazon database or start selling products that are already listed on Amazon.  </p>  <p>  \t<strong style=\"\">Does it cost money to sell on Amazon?</strong>  </p>  <p>  \t  There are several options when it comes to selling on Amazon. Opening a Seller Account is free. There are seller accounts that cost a monthly fee. Amazon takes a fee from the sale of your product. This will vary depending on the product and the cost of the product being sold.  </p>", 
    "end_date": null, 
    "title": "How to Sell Products on Amazon", 
    "price": 0, 
    "instructors": "Erik Quisling", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378142_5f1f.jpg", 
    "course_url": "https://www.udemy.com/how-to-sell-products-on-amazon/", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-26T19:17:57Z"
}