{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><span style=\"\"></span></p><p style=\"\">With the HYPNOWORDS training, you  will unknowingly become the clients friend. Clients will become more open to you, have fewer objections, and be more likely to accept what you have to say.  All the while being made to feel comfortable, confident and safe in knowing that they are in good hands and that you are much more than a salesperson, but someone that can be relied upon and trusted.</p><p style=\"\">Anyone that have taken the HYPNOWORDS training have a far greater percentage of closings than other salespeople  that have completed other sale training courses.</p><p style=\"\"> In the informative and exciting 2 hour HYPNOWORDS  course, You will  learn step-by-step hypnotic techniques that will help the client make up their minds.   As you learn the techniques of HYPNOWORDS, watch as your self-confidence, motivation, attitude, and belief in success just soar through the roof as you see the exciting effect that HYPNOWORDS will have on the clients.  Nothing will be able to stop you from achieving your dreams and goals once you learn the secret techniques of HYPNOWORDS. </p><p style=\"\">The HYPNOWORDS training is jam packed with jealously guarded secrets that top producers don&#039;t want you to know about, and some, don&#039;t even know that they are doing.  HYPNOWORDS is unlike anything you&#039;ve ever been exposed to.  You won&#039;t find this information reading trade journals, attending industry shows, or from any course you&#039;ll ever taken.</p>", 
    "end_date": null, 
    "title": "Hypnowords Power Selling Techniques", 
    "price": "20.00", 
    "instructors": "Alex Szwed", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494252_9d85_3.jpg", 
    "course_url": "https://www.udemy.com/hypnowords-power-selling-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T14:54:03Z"
}