{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>    Conoce y aplica las reglas de comercio internacional</strong> que permitirán que obtengas mejores ganancias, mayor seguridad y garantías en tus negocios internacionales.  </p>  <p>  \t    La <strong>logística internacional</strong> involucrada en tus <strong>importaciones y exportaciones</strong> es de vital importancia, por eso, organismos de nivel internacional han dedicado décadas a diseñar las reglas que permiten a <strong>Compradores</strong> y <strong>Vendedores</strong>, negociar sus operaciones en los mismos términos, con claridad, tranquilidad y seguridad.  </p>  <p>  \t    Explicaremos todo el contexto detrás de estas reglas, lo que son y lo que no son, cómo usarlas y aplicarlas, y además profundizaremos en los riesgos que existen y las precauciones necesarias para que realices tus <strong>operaciones internacionales de supply chain de la <em>manera más segura, más sencilla y sobre todo más rentable</em></strong>.  </p><p>El curso estará dividido en dos partes principales. La primera parte se enfocará en comprender el contexto internacional, comercial y operacional en el que las reglas Inconterms® 2010 se desenvuelven.</p><p>Se revisarán los siguientes temas en la primera parte del curso:</p><ul><li>Contexto internacional.</li><li>Qué son las reglas y cómo usarlas adecuadamente</li><li>Particularidades de la versión actual y vigente de las reglas Incoterms®</li><li>Implicaciones comerciales, legales, y responsabilidades de compradores y vendedores.</li><li>Riesgos y posibilidades</li><li>Recomendaciones para negociación internacional y éxito en ferias comerciales.</li></ul><p>A su vez, la segunda parte del curso abordará lo siguiente:</p><ul><li>Cada una de las reglas del conjunto de reglas vigentes.</li><li>Responsabilidades y obligaciones específicas e vendedores y compradores en cada una de las reglas Incoterms® vigentes.</li><li>Riesgos y posibilidades de mitigación de riesgos en cada una de las reglas Incoterms® vigentes.<span></span></li></ul><p><strong>¡ Bienvenidos !</strong></p>", 
    "end_date": null, 
    "title": "Importación y Exportación bajo las nuevas Reglas Incoterms®", 
    "price": "20.00", 
    "instructors": "Jorge Luis Botero Bernal.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361898_a742_3.jpg", 
    "course_url": "https://www.udemy.com/reglas-incoterms-2010/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T01:35:49Z"
}