{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Online Sales Funnel for Beginners</strong>  </p>  <p>  \t    Even  if you have an innovative, groundbreaking marketing campaign, it won't  be worth the time or effort if it does not translate into leads/sales. <strong>I think you would agree with me on this, right?</strong>  </p>  <p>  \t           You need to know how many leads/sales you will need in order for your  campaign to see an <em>ROI (Return on Investment)</em> and to meet your overall business goals. The best  way to do this is by tracking your sales funnel.  </p>  <p>  \t           Your sales funnel contains information about qualified prospects with which you've had some interaction previously. So, qualified prospects are the ones that aware of your product by means of social media or content marketing.  </p>  <p>  \t           <em>TIPS HERE:</em></p><ul><li>It is crucial for your product or service to be in front of your prospect at the right time, if it's not the right time, you won't make the  sale. </li><li>Generally you can't control the prospect's timing.  But, you can  control the extent to which he/she is aware of your product or service. </li><li>That's why managing your sales funnel is important.  </li></ul>  <p>  \t<strong></strong></p><p><strong>With this course you'll learn how to build your sales funnel, basics of buyer behaviour and selling processes.</strong> The course provides many useful insights which can be put into practice  immediately. The course also helps you to pinpoint problems in your  organizations's selling processes and will help you formulate actions to deal with  them.  </p>  <p>  \t<strong>Remember! People don't like to be sold – they do like to buy. So, learn with us the following:</strong>  </p>  <ul>  \t<li>  Understanding Buyer Behaviour  </li>  </ul>  <ul>  \t<li>  Creating Need for Your Product</li>  </ul>  <ul>  \t<li>  Designing Effective Landing Pages</li>  </ul>  <ul>  \t<li>  Turning Browsers into Buyers</li>  </ul>  <ul>  \t<li>  Managing Web Traffic on a Small Budget</li>  </ul>  <p>  \t  \t<strong></strong>  </p>  <p>  \t           The course is easy to chew, as its structured in 8 video lessons. Each  will take around 5-10  minutes. The entire course clocks in around 1  hour.  </p>  <p>  \t                     So, join us today at the Online Sales Funnel 101 course, <strong>and take your business to the next level!</strong>  </p>  ", 
    "end_date": null, 
    "title": "Improve Your Online Sales", 
    "price": "20.00", 
    "instructors": "iMarketer Training", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/172778_dd2b_3.jpg", 
    "course_url": "https://www.udemy.com/online-sales-funnel/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-25T14:26:35Z"
}