{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This is a great course to help students understand the sale process and more importantly the sales funnel within any business environment. The course is built in four clear sections, we have included an introductory section that explains the concepts of Unlock Success and where this course fits into the that program. During the later sections of the course we will share how you can potentially double the potential of the sales funnel by turning it on its side. This course will take between 45 minutes to one hour to complete, we have included many examples to use and follow and provided three handouts for completion and reference. In summary you will learn the following...</p><p style=\"\">1. An understanding of the value of the three keys to unlocking success in any business</p><p style=\"\">2. An understanding of what a formal sales process looks like and how it can benefit your business</p><p style=\"\">3. 10 great reasons why you should have a formal sales process in your business</p><p style=\"\">4. The definition of a traditional sales funnel</p><p style=\"\">5. How turning the traditional sales funnel on its side can potentially double its potential</p><p style=\"\">6. 10 things you can do PRE Sales that will help your business to grow</p><p style=\"\">7. 10 things you can do POST Sales that will help you retain your existing customers</p><p style=\"\">The course is perfect for any business owner, people involved in sales or business growth and development. If you want to improve your sales, get more sales for less effort, if you want to build a referral based business, then this is the course for you.</p>", 
    "end_date": null, 
    "title": "Improve your sales by 82% - Reinventing the Sales Funnel", 
    "price": "20.00", 
    "instructors": "Ian Dickson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519226_64e9_3.jpg", 
    "course_url": "https://www.udemy.com/improve-your-sales-by-82-percent-reinventing-the-sales-funnel/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T16:06:01Z"
}