{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Take Control of Your Selling Day! </strong>  </p>  <p style=\"\">  \t<strong style=\"\">- Make More Money &amp; Get More Done in Less Time</strong>  </p>  <p style=\"\">  \t      Start closing more sales, building a strong list of prospects with these business building strategies and techniques designed to put you in front of the right people at the right time.  </p>  <p style=\"\">  \t<strong style=\"\">Let’s face it traditional time management techniques were never designed for people in sales...</strong>  </p>  <p style=\"\">  \t      The profession of selling is like no other position within any company.  </p>  <p style=\"\">  \t      Successful business owners, entrepreneurs and top performers from every industry have had to learn this the hard way.  </p>  <p style=\"\">  \t      Grow the day to day business intelligence needed to develop more selling opportunities, control your day and make more money.  </p>  <p style=\"\">  \t      As sales professionals our job is more demanding than ever – this requires a specific set of skills to stay on track and keep moving forward.  </p>  <p style=\"\">  \t      Learn the secrets that separate the amateur’s in sales from the top producing professionals.  </p>  <p style=\"\">  \t<strong style=\"\">Close more sales by staying focused on what’s important.  </strong>  </p>  <p style=\"\">  \t      Learn the business intelligence secrets to avoid phone tag, get out of voice mail jail and having people expecting your call.  </p>  <p style=\"\">  \t<strong style=\"\">Build your business by design with these specific tools created by sales people specifically for people in sales.</strong>  </p>  <p style=\"\">  \t      INTENTION – Selling Strategies &amp; Business Intelligence Techniques is dedicated to the business to business professional as well as selling consumer direct.  </p>  <p style=\"\">  \t      We’ve packed this course with the mindset – strategy- and techniques that have been real world tested to help you leverage the time you’re selling day…  </p>  <p style=\"\">  \t<strong style=\"\">Creating more selling opportunities, generating quality leads and closing more sales.</strong>  </p>  <p style=\"\">  \t      Ensuring you’re making the right sales moves at the right time backed by proven business intelligence techniques to deliver you high impact results.  </p>  <p style=\"\">  \t<strong style=\"\">This sales Training and Coaching program will guide you through the 5 steps to controlling your day and making most of your time. </strong>  </p>  <p style=\"\">  \t<strong style=\"\"> Start getting more of what you’re going after – ON PURPOSE!</strong>  </p>  <p style=\"\">  \t      The only thing required to learn these selling strategies and business intelligence time hacks is a willingness to learn a business and sales communication model along with the how to become a complete sales professional with this step by step system used by both entrepreneurs, business professionals as well as top producing sales people.  </p>", 
    "end_date": null, 
    "title": "INTENTION – Sales Skills", 
    "price": "20.00", 
    "instructors": "Bob Marx", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/388038_ec79_5.jpg", 
    "course_url": "https://www.udemy.com/intention-selling-strategies-business-intelligence/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T22:35:06Z"
}