{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t           This is a course which includes <strong style=\"\">22 baby step by baby step videos</strong>  in which you will learn exactly how to gain joint venture partners to drive high quality traffic to your  product in order to make money a lot of money online  </p>  <p>  \t             The class is <strong style=\"\">most suited</strong> for total beginners who are  new to gaining joint venture partners  </p>  <p>  \t             Your class project will be to gain a big joint venture partner who will promote your product  </p>  <p>  \t             Because I am fully aware that one of the biggest problems that  beginners encounter when they try to make money online is &quot;Information  Overload&quot; I have kept each video only a few minutes long, so you will  not be overwhelmed by information.  </p>  <p>  \t             In this training you will discover exactly how to:  </p>  <p>  \t             1.The number one reason why so many people FAIL to gain JV partners.<br style=\"\">  \t          2. Why you should NOT contact every successful guru in your niche for a JV.<br style=\"\">  \t         3. What are the TOP places that I go to find JV partners.<br style=\"\">  \t        4. Why joint venture traffic is the BEST kind of traffic there is.<br style=\"\">  \t       5.How to create an AMAZING relationship with the gurus in your niche.<br style=\"\">  \t     6. The WRONG way to contact a guru for the first time.<br style=\"\">  \t     7.The 4 RIGHT ways to contact a guru for the first time.<br style=\"\">  \t    8. How to literally FORCE the big gurus in your niche to contact you.<br style=\"\">  \t   9. My &#039;COPY &amp; PASTE&#039; emails that you can send to your potential JV partners.<br style=\"\">  \t   10. Real life cast studies of successful JV partnerships that I have created in the past, and that you can learn from to create your own successful JV partnerships TODAY.  </p>", 
    "end_date": null, 
    "title": "JV Secrets - The Absolute Fastest Way To Make Passive Income", 
    "price": "50.00", 
    "instructors": "Amir Rimer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/105594_c4ee_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-gain-joint-venture-partners/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-14T08:30:16Z"
}