{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you a small business owner? An entrepreneur? or even an independent services provider?</strong></p><p>Although you may not be a \"salesperson\", are you the person who is ultimately responsible for finding new sales opportunities for your products and services? </p><p>If so….<strong>What if you could spend less time and effort trying prospect for new sales and you were able to spend more of your time each day working with actual paying customers?</strong></p><p>Think about what your business would look like if more people knew about you, liked what you had to offer, and either through word of mouth referrals or other social channels proactively started to seek you out in order to do business with you? </p><p><strong>What would that mean to you? </strong></p><p><strong>What would that do for your business</strong>?</p><p>This is why I have created this program. This course is designed to help you to uncover more sales opportunities, to be more recognized by your target audience, and as a trusted resource to grow your business through referrals and repeat customer sales.</p><p>The course is broken into 3 main sections that follow the natural evolution of business relationships. </p><p><strong>Know</strong> - Before anything will ever happen in your business, people need to get to know you, and the value that you have to offer. Simply put…customers cannot buy from you until then know about you! </p><p><strong>Like</strong> - Let's face it…people buy from people…so in this section we focus on discussing a number of best practices and tips that you can use to build a solid reputation and following within communities where your ideal customers spend their time <strong>AND</strong> money. </p><p><strong>Trust</strong> - This is where the true velocity kicks in for both you and your business. As someone who is viewed as a trusted advisor to your customers and your audience you not only get more repeat business, you also begin to have people coming to you in order to experience your products, services, and the full value of what you have to offer.</p><p>Throughout this course, we will:</p><ul><li>Discuss the key sales and marketing fundamentals that are absolutely necessary in order to successfully sell your products and services in today's' competitive environment</li><li><span></span>Walk through the process on how to save yourself significant time, effort, and frustration simply by getting 100% clear on what your ideal customer looks like</li><li><span></span>Using the included worksheet we work together to help you to create your own personal UVP or Unique Value Proposition statement. This statement not only clearly articulates the value that you have to offer, but more importantly it helps to create more opportunity for you by separating you from your competition by communicating why potential customers should be working with you!</li><li><span></span>Do a deep dive into each of the 5 main communication channels that you can use to create awareness for your business and to begin uncovering new sales opportunities for the products and services that you offer.</li><li><span></span>Show how to leverage the main social media channels not only as research tools, but also to begin creating conversations and ultimately new opportunities with your ideal customer audience. In the bonus section of the course there are guided tours of these tools including demonstrations on how to get the most from using them</li><li><span></span>Lay out the 4R's of building likability and give you a number of best practices and tips on how to apply these in order to begin building your audience and sales pipeline</li><li><span></span>Illustrate the best practices for building trust with your customers and give insights on the main destroyers of trust so that you can recognize and avoid them</li></ul><p>The goal of this course is not only to give you the key sales and marketing insights that will help you to ultimately make more sales, it is also to give you the road map on how to build a more profitable and repeatable business by tapping into the ability to get more referrals and repeat business. It gives you the foundation that you need to break free from the selling vs. delivery trap!</p><p>Included in the course are a number of downloadable materials including a set of follow along guides that you can use to take notes and reference whenever you want. With the Udemy course you can also download the full course on your tablet or phone so that you can access the full course anytime from anywhere even if you do not have access to the internet. </p><p>So, if you are ready to stop chasing business...want your business to be more predictable...and to begin spending more of your time delighting and delivering value to more paying customers, then open up the opportunity to build your business around incoming referrals and repeat business from customers who know you, like you, and trust you.</p>", 
    "end_date": null, 
    "title": "Know, Like, Trust - Increase your referrals and repeat sales", 
    "price": "20.00", 
    "instructors": "Randy Whitcroft", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523604_7714_2.jpg", 
    "course_url": "https://www.udemy.com/know-like-trust/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T20:28:28Z"
}