{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Need To Close More Sales? ?</p><p style=\"\">Frustrated With Results?</p><p style=\"\">Ready to Try Something New?</p><p style=\"\"><strong style=\"\">If You Want Something Different - We Have to DO </strong><strong style=\"\">Something Different!</strong></p><p style=\"\">What we&#039;re going to be coaching to is a collection of very specific ideas to help you get more of what you&#039;re going after on purpose. </p><p style=\"\"><strong style=\"\">The professionals who make big things happen all have 2 things in common:</strong></p><p style=\"\"><strong style=\"\">A willingness to look at ideas – maybe in a different way</strong></p><p style=\"\"><strong style=\"\">And the ability to take action!</strong></p><p style=\"\">When we sound like everyone else… We get treated like everyone else.</p><p style=\"\">Then we are forces to sell on price.</p><p style=\"\">Get The Edge – Take All The Pressure Off!</p><p style=\"\"><strong style=\"\">Learn the Mindset – Strategy – Technique and make it happen on purpose.</strong></p><p style=\"\">Take Control of what happens next.</p><p style=\"\"><strong style=\"\">What we are aware of we control – What were un-aware of controls us.</strong></p><p style=\"\">All too often we find ourselves in a no-win situation. We end up working very hard hoping the actions we take and the moves we are making are getting us one step closer to the sale.</p><p style=\"\">Only to discover in the end we have been working very hard for free. That the person we believed to be a good-fit prospects was nothing more than a suspect…</p><p style=\"\">We will be coaching to the Mindset – Strategy- Technique that will allow us to separate the who from the what.</p><p style=\"\">After all what good does it do to deliver excellent customer service to someone who has no intention of buying?</p><p style=\"\"> A lot of times people will ask me what is sales coaching. Let&#039;s jog through a couple of ideas so you know what to expect. Here&#039;s what sales coaching, a course just like this.</p><p style=\"\"> Here&#039;s what it does.  It helps to bring some structure to our process of thinking, planning, and doing, but more importantly it starts to hone us in on that idea of creating awareness to opportunities that we might be missing, we might be taking for granted. </p><p style=\"\">Lastly, it starts to give us some more options. Here&#039;s why. Because we&#039;re going to be becoming aware of the choices we have in the moment we have them. Usually, we only see the results of what we&#039;re doing and not the process. That&#039;s where we&#039;re going to be keying in on; </p><p style=\"\"><strong style=\"\">Make it easy for people to get out of their own way, open up to you about what&#039;s really going on and see you as the professionals they need to be working with.</strong></p>", 
    "end_date": null, 
    "title": "Launch Sales -  Break the Rules and Close More Sales ", 
    "price": "35.00", 
    "instructors": "Bob Marx", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543314_a238_2.jpg", 
    "course_url": "https://www.udemy.com/close-more-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T17:17:27Z"
}