{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>\"I loved how this got me thinking, great place to start to change my sales thinking pattern.\"</em></p><p><em>\"Broke down the material in digestible, intelligible pieces. Step-by-step and straight forward. Good stuff. Thank you.\"</em></p><p><em><span>\"I liked the approach and the method. Integration with real life case \nstudy would turn this experience outstanding for a higher learning \ncurve.\"</span></em></p><p><em><span>\"Well structured , informative, enjoyable, comprehensive , clear with student friendly approach.<span>\"</span></span><br></em></p><p><em><strong><em>------------------------------------------------------------------------------------</em></strong><br><strong></strong></em></p><p><em><strong>Do you want to get more sales and make more money?</strong></em><strong>  </strong></p><p><strong><em>Do you want to learn a highly sought after and transferable sales skill?</em></strong></p><strong>  </strong><p><em><strong>Are you ready to become a master at the art of Closing Massive Deals?</strong></em><strong><em></em></strong></p>  <p><strong><em><br></em></strong></p><p>You will save time and wasted effort by learning how to close deals the right way with this simple approach to a killer sales process with this new highly sought after skill set!<strong><br> <br> </strong></p>  <p>This course is a complete step by step method of taking your customer through each and every step of the sales process. You will be able to know exactly where you are in the sales process at all times and can accurately forecast what your revenue will be at any given time. It gives you the confidence and ability to be able to go after those truly massive deals and simplify the steps involved to bring it to a closed deal. </p>    <p>This is the complete course that you can use to create a sales process and execution method that will vastly improve your closing rate and ultimately make you a lot more money. I have made this all-inclusive so nothing is left out… and I will be updating this course all the time with even more value. </p>  <p><br> <br> </p>  <p><strong>Yes</strong>,<strong> </strong>you can start on the road to winning massive deals by<strong> taking this course today.</strong></p>  <ul><li>Generate a lot more pipeline.</li><li>Generate more accurate pipeline.</li><li>Grow your deals in size.</li><li>Gain confidence from your customers.</li><li>Gain confidence in yourself!</li></ul>    <p>Anyone can close a small deal. However, the truly massive deals need a lot more care and attention in order for them to close. No matter what type of salesperson you are, having a sales process is going to be an important part of it. This Udemy course<strong><em> </em></strong>is designed to enable you to take the fear out of selling massive deals so you can become that “rainmaker” that you know you can be.<strong> If you don’t have a dedicated sales process you are leaving money on the table! </strong></p>  <p>Conquer your fear and become a well-oiled selling machine by learning the skill from this course!</p>    <p>This sales process and execution method has enabled me to become:</p>  <ul><li>Fastest time to senior level sales revenue in Company      history.</li><li>3rd highest profitable sales rep in North America for      my company.</li><li>Only sales person to achieve every single sales bonus      at my company.</li><li>Consistently one of the top sales reps in the country      for my company.</li><li>Most key reference customers created in the country      within my company.</li><li>3<sup>rd</sup> highest revenue in the division of a      multinational SaaS corporation.</li><li>Maintained consistent YOY growth over a 6 year period.</li><li>66% YOY growth as a salesperson.</li></ul>    <p>This course will <strong>teach you the exact recipe</strong> for effectively selling that I have used for the past fifteen years. I will teach you everything that I do in order to set myself up for a great sales process outcome.</p>    <p>I will be available to you on a weekly basis with my live open office hours. If you are having trouble or have any questions you can some talk to me and get the extra help that you need. <strong>I want you to be successful and am willing to go the extra mile to see that you are!</strong></p>  <p><br> <br> </p>  <p>Start your path to Selling Massive Deals and click the “<strong>Take This Course</strong>” button today!</p><p><br></p><p>Updates:</p><p><strong>Feb. 01, 2016</strong><br></p><p>I have now added downloadable MP3 files so that you can learn while on the go.</p><p><br></p><p><br></p><p><strong><em></em></strong></p>", 
    "end_date": null, 
    "title": "Learn this Killer Sales Process and Close Massive Deals Now!", 
    "price": "20.00", 
    "instructors": "Jeremiah Walsh", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/712038_9af1_3.jpg", 
    "course_url": "https://www.udemy.com/learn-this-killer-sales-process-and-close-massive-deals-now/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T18:24:03Z"
}