{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course was last updated on </p>\n\n<p>Looking to make some extra money selling your artwork? Or maybe you would like to be selling your artwork full time! In any case you've come to the right place.</p>\n\n\n\n<p>The eBay Art Selling Course will show you how to start selling your artwork and build your eBay art business. The techniques taught in this course can also be translated into selling other products on eBay. This course will equip you with the knowledge needed to become profitable selling your art on eBay - or your money back!</p>\n\n\n\n\n\n<p>The course is your track to building an amazing art business and ultimately - make you money!</p>\n\n\n\n\n\n\n\n<p>This course will take you from a complete beginner in internet art sales to an expert with years of knowledge and experience in as little as 1 week! You will have an eBay seller account up an going in just the first day of the course.</p>\n\n\n\n\n\n\n\n<p>So what else is in it for you?</p>\n\n\n\n\n\n\n\n<p>You’ll gain instant access to all three sections of the course including the bonus section where I show you how to sell reproductions of your artwork online as pillows, mugs, prints, and much much more! You’ll also gain access to my excel art tracking spread sheet as well as my package messages that I mail with every piece of art work.</p>\n\n\n\n\n\n\n\n<p>The course is setup to quickly take you through step by step, the process of listing your artwork on eBay, shipping, and running your eBay business. Once you finish the course you will be equip with the knowledge to start being profitable selling your artwork online.</p>\n\n\n\n\n\n\n\n<p><strong>Don’t believe me? I offer you a full money back guarantee within the first 30 days of purchasing the course.</strong></p>\n\n\n\n\n\n\n\n<p>Here’s what you get with the course:</p>\n\n\n\n\n\n\n\n<p>You’ll get access to the three sections of the course that will show you how I've successfully sold $1,000's of dollars of art on eBay. The course also teaches you how you can get commissioned work from selling your artwork online. The course is supported with over 2 hours of clear video content that I walk you through each step of the way.</p>\n\n\n\n\n\n\n\n<p>All at your fingers tips instantly.</p>\n\n\n\n\n\n\n\n<ul><ul><li>The course starts with the basics. For those of you that have never used eBay I’ll walk you through the tools we'll be using to sell on eBay.</li><li>Next I’ll show you how to create an eBay account and link it with Paypal.</li><li>Once you’ve done that you'll learn how to research art markets on eBay.</li><li>After you research your markets I will show you how you can find your selling niche. </li><li>At this point you're ready to create your first listing and learn the 7 steps to selling your artwork online!</li><li>Then you'll learn all about my efficient shipping system that makes shipping cheap and easy! </li></ul></ul>\n\n\n\n\n\n\n\n<p>Over the 3 chapters you will learn:</p>\n\n\n\n\n\n<ul><ul><li>How to research markets </li><li>Photograph your artwork</li><li>Touche up photos to match the physical piece </li><li>Write a winning description</li><li>Ship your artwork</li><li>And run your eBay art business </li></ul></ul>\n\n\n\n\n\n\n\n<p>What else will you get?</p>\n\n\n\n\n\n\n\n<p>- Personal contact with me, the course tutor</p>\n\n\n\n\n\n<p>- Lifetime access to course materials</p>\n\n\n\n\n\n<p>- Understanding of how selling on eBay works and all of it's may benefits </p>\n\n\n\n\n\n<p>- My buyer message slips</p>\n\n<p>- Excel art tracking spread sheet</p>\n\n\n\n\n\n\n\n<p>This all comes under one convenient easy to use platform. Plus you will get fast, friendly, responsive support on the Q&amp;A section of this course.</p>\n\n\n\n\n\n\n\n<p>I will be here for you every step of the way!</p>\n\n\n\n\n\n\n\n<p><strong>So what are you waiting for? Sign up now and start selling today!</strong></p>", 
    "end_date": null, 
    "title": "Learn How I Make Extra Income Online Selling My Art on eBay", 
    "price": "20.00", 
    "instructors": "Jaysen Batchelor", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848328_79c1_4.jpg", 
    "course_url": "https://www.udemy.com/learn-how-i-make-extra-income-online-selling-my-art-on-ebay/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T18:16:06Z"
}