{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Do you want to close more deals and make more money?</em></strong><strong> </strong></p>  <p><strong><em>Do you want to learn a highly sought after and transferable sales skill?</em></strong></p>  <p><strong><em>Are you ready to become a master at the art of the Sales Close?</em></strong></p>  <p><strong><em>------------------------------------------------------------------------------------</em></strong></p>  <p>You will save time and wasted effort by learning how to close deals the right way with these highly effective and time tested sales closes!</p>  <p>This course will equip you with over 40 of the best sales closes that I have used throughout my entire sales career. You will be able to have a complete arsenal of sales closes that you can utilize at a moment’s notice in order to seal the deal. It gives you the confidence and ability to be able to go after those elusive and tricky deals and bring that commission check home. </p>  <p>I have made this all-inclusive so nothing is left out… and I will be updating this course all the time with even more valuable sales closes as I try them out and feel that they are good enough for you to succeed. </p>    <p><strong>Yes</strong>,<strong> </strong>you can start on the road to closing more deals by<strong> taking this course today.</strong></p>  <ul><li>Close a lot more deals.</li><li>Understand why you have been losing deals.</li><li>Have your customer ask to spend money with you.</li><li>Gain confidence from your customers.</li><li>Gain confidence in yourself!</li></ul>  <p>Anyone can be an order taker. However, only the most talented salespeople with the best sales closes can truly be a sales master. No matter what type of salesperson you are, having a “go to” list of sales closes is going to be an important part of it. This Udemy course<strong><em> </em></strong>is designed to enable you to take the fear out of closing deals so you can become that “rainmaker” that you know you can be.<strong> If you don’t have an arsenal of sales closes you are leaving money on the table! </strong></p>  <p>Conquer your fear and become a well-oiled selling machine by learning the skill from this course!</p>  <p>This sales process and execution method has enabled me to become:</p>  <ul><li>Fastest time to senior level sales revenue in Company      history.</li><li>3rd highest profitable sales rep in North America for      my company.</li><li>Only sales person to achieve every single sales bonus      at my company.</li><li>Consistently one of the top sales reps in the country      for my company.</li><li>Most key reference customers created in the country      within my company.</li><li>3<sup>rd</sup> highest revenue in the division of a      multinational SaaS corporation.</li><li>Maintained consistent YOY growth over a 6 year period.</li><li>66% YOY growth as a salesperson.</li></ul>  <p>This course will <strong>teach you the exact recipe</strong> for closing deals that I have used for the past fifteen years. I will teach you everything that I do in order to set myself up for a great outcome.</p>  <p><strong>I want you to be successful and am willing to go the extra mile to see that you are!</strong></p>    <p>Start your path to Closing More Deals and click the “<strong>Take This Course</strong>” button today!</p>", 
    "end_date": null, 
    "title": "Learn These Must Have Sales Closes and Win More Deals Today!", 
    "price": "20.00", 
    "instructors": "Jeremiah Walsh", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676630_b4cf_3.jpg", 
    "course_url": "https://www.udemy.com/learn-these-must-have-sales-closes-and-win-more-deals-today/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T17:57:47Z"
}