{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Liderazgo en Ventas con Calidad Humana</strong> es un curso \nteórico práctico para hacer una introspección en tus pensamientos, procesos de comunicación humana para hacer presentaciones poderosas más allá de frases de manual. <span></span></p><p>Aprender a escuchar poderosamente las emociones, anhelos y necesidades de tus clientes para satisfacerlas y lograr el éxito.</p>  <p>  \t<strong>¡Aprende a detectar lo que realmente desea tu cliente y más que venderle, ayúdale a comprar!</strong>  </p>  <p>Todas las personas desean adquirir más que objetos: Sensaciones, cubrir necesidades, emociones satisfactorias, valores como confianza y credibilidad, etc. <br><strong>Aprende a compartir esto con tus prospectos y tus clientes.</strong></p>  <p>  \t¿Sabías que el <strong>éxito</strong> de las negociaciones y cierres de venta son más emocionales que económicas?  </p>  <p>\n  \tSí, cuando tu cliente desea lo que le ofreces y tiene el dinero para adquirirlo sólo hay que ayudarle a que lo obtenga. Lo más importante es que aprendas a despertar su deseo de adquirir lo que tú le ofreces.  </p>  <p>  \tEmpodérate hacia una vida con mejores resultados y éxito desarrollando tus <strong>habilidades de negociación y ventas</strong>. </p>  <p>  \t    En este curso:  </p>  <ul>  \t<li>Comprenderás la importancia de los procesos de una adecuada comunicación humana para conectar con tu cliente y obtener negociaciones exitosas.</li>  \t<li>Aprenderás a escuchar tus creencias limitantes y cómo convertirlas en <strong>creencias constructivas</strong>.</li>  \t<li>Comprenderás\n la importancia de tus acciones y cómo tomar un mejor camino hacer preguntas constructivas que lleven a tu cliente a una reflexión e interés por lo que tú le presentas.</li>  \t<li>Aprenderás a construir <strong>metas posibles y alcanzables </strong>dentro de tus capacidades y creencias. </li>  \t<li>Te conocerás más a ti mismo.</li>  \t<li>Podrás diseñar una reflexión de mejora y un plan de acción para alcanzar mucho mejores resultados en tus proyectos y presentaciones. </li>  \t<li>En pocas palabras: <strong><em>Tendrás las herramientas para construirte una vida mucho mejor de la que vives el día de hoy con resultados más exitosos en tus presentaciones y ventas.</em></strong></li></ul>  <p>  \t    Asume tu <strong>liderazgo personal</strong> y <strong>toma las riendas de tus negociaciones para lograr más cierres exitosos y en consecuencia una vida financiera más productiva</strong>.  </p>  <p>  \t    El curso incluye el libro electrónico de <strong>Liderazgo en Ventas con Calidad Humana</strong>. del cual se han vendido más de 10,000 ejemplares impresos en el mundo de habla hispana.  </p>  <p>  \t<strong>Liderazgo en Ventas con Calidad Humana</strong>,\n un curso con herramientas prácticas que ha sido dictado para miles de \npersonas en diversos países del Continente Americano, ahora está a tu \nalcance en cualquier país del mundo  </p>", 
    "end_date": null, 
    "title": "Liderazgo en Ventas con Calidad Humana", 
    "price": "40.00", 
    "instructors": "Guido Rosas", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421198_ca07.jpg", 
    "course_url": "https://www.udemy.com/liderazgo-en-ventas-con-calidad-humana/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T17:26:30Z"
}