{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever wondered</p><ul><li>What the top salespeople using LinkedIn are doing differently than you?</li><li>How to generate more leads and close more sales with LinkedIn?  </li><li>How to find and connect with your target prospects on LinkedIn </li></ul><p>I started out with those same questions because I was sick of spending lots of time on Linkedin with little to no return.</p><p>So I started learning and testing every sales strategy on LinkedIn to figure out what really worked and what was just hype. </p><p>I started finding sales strategies that worked in my business and can now trace tens of thousands of dollars in sales,  speaking engagements, great business relationships and countless opportunities directly back to LinkedIn.</p><p>In the years following, I’ve personally taught LinkedIn to sales teams and companies in a wide range of industries to do the same thing with great success as well!</p><p><strong>In this course, I’m going to teach you:</strong></p><ol><li>How to build a great foundation for your personal brand online starting with your profile</li><li>How To grow your authority &amp; generate leads with Linkedin Publisher</li><li>Find and connect with Your Target Prospects on Linkedin</li><li>How to build your network faster with the right people</li><li>And how to tie everything together with an action plan so that each strategy you’re executing is intentional and strategic.</li></ol><p><strong>This course is for you if...</strong></p><ul><li>Any of your current clients or prospects are on LinkedIn </li><li>You’re in B2B (Business to Business) sales</li><li>You work in a sales or growth position</li><li>You've used LinkedIn casually but are ready to take it up a notch</li><li>You’re sick of going to ineffective networking events that never result in new clients</li></ul><p><strong>What would it mean for you</strong> if you could make just one more sale a month with something you learned in this course?  What about 2 or 3 more sales a month? That's my goal for you taking this course. </p><p>Remember there's a 30-day money back guarantee so give it a try and I guarantee between the step-by-step strategies, the workbook, that templates and the community of sales professionals it’ll be worth it. </p><p>Just click take this course and I'll see you inside! <br></p><p>- Joel </p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Linkedin Sales Success: The Ultimate LinkedIn Sales Guide", 
    "price": "30.00", 
    "instructors": "Joel Widmer, Mark Laos", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657298_0954_2.jpg", 
    "course_url": "https://www.udemy.com/linkedin-salespeople-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T22:48:42Z"
}