{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you a business owner or professional who is?</p><ul><li><strong>Struggling</strong> to get leads <strong>through cold calling?</strong></li><li><strong>Lacking a strong network</strong> which can bring you new business?</li><li>Wondering how <strong>LinkedIn</strong> can be used as a<strong> sales tool?</strong></li><li><strong>Confused</strong> <strong>about</strong> how <strong>LinkedIn</strong> works?</li><li><strong>Unfamiliar</strong> with online technology and how it can work for you?</li></ul><p>My complete LinkedIn Online Training course is for you!</p><p><strong>Now more than ever, generating new business is tough.</strong> Maybe you’ve spent weeks going to networking meetings. Maybe you’ve been cold calling for months. Maybe you’ve been religiously posting on social media and sending out email marketing content. If you’ve not made any progress then my LinkedIn Online Training programme is for you!</p><p><span><strong>LinkedIn is one of those online tools that people have, but don’t use properly</strong>. Most people sign up, create a basic profile, connect to a few people and then leave it for months. <strong>This is a waste of an AMAZING tool</strong> for finding new clients, new business and making sales!</span></p><p><span>In my LinkedIn Online Training course, you will learn how to correctly build your LinkedIn profile, grow your LinkedIn network, engage with the right people and market your business.</span></p>", 
    "end_date": null, 
    "title": "LinkedIn for Business - The Complete Program ", 
    "price": "20.00", 
    "instructors": "Adam Petford", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783958_5ccc_2.jpg", 
    "course_url": "https://www.udemy.com/linkedin-for-business-the-complete-programme/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-06T12:03:11Z"
}