{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">  LinkedIn</strong> is the most powerful tool for lead generation in 2015. Is taking a <strong style=\"\">LinkedIn masterclass</strong> one of your business new year resolutions?  </p>  <p>  \t            The Social Media Academy has developed this &quot;<strong style=\"\">LinkedIn 2015: Grow your business with LinkedIn</strong>&quot; course to help your business leverage the online space for this platform.  </p>  <p>  \t            The course is designed to deliver success and enhance the opportunities for your business. Using live examples, this online training is designed to ensure that your business is provided with unsurpassed opportunities . You will have the power to market yourself, your company and your services thus developing new business prospects as well as connecting and developing  promising relationships with current clients.  </p>  <p>  \t            Delivered by the No1 LinkedIn Trainer and Strategist - <strong style=\"\">Mark Hamilton-Taylor  </strong>  </p>  <p>  \t            Mark is the only provider of this unique training in the UK. He has created a proven formula that has helped businesses to flourish. The growth  is in businesses of all sizes, from small to global, Mark has, by invitation, discussed and presented his successful trade secrets in the House of Commons in Westminster.  </p>  <p>  \t<strong style=\"\">Why to take this course?</strong>  </p>  <ul style=\"\">  \t<li>Cold calling is dead.      LinkedIn can help you bypass gatekeepers and connect faster with decision      makers.</li>  \t<li>Giving is receiving. We&#039;ll      show you the benefits of sharing content, commenting and liking posts and      how using LinkedIn for five minutes a day, three times a day can help your      business grow.</li>  \t<li>Looking good. We&#039;ll explain      the must do&#039;s and don&#039;ts that will ensure your LinkedIn profile catches      the eye of the people you want to work with</li>  \t<li>Hit your top ten clients, exceed      your goals. By adopting a farmer, not hunter approach, by enabling your      current contacts to become your ambassadors and advocates you can start to      work with the companies you&#039;ve always wanted to and accelerate growth      beyond your business plan.</li>  </ul>", 
    "end_date": null, 
    "title": "LinkedIn 2016 Strategy Masterclass  Create Endless business ", 
    "price": "20.00", 
    "instructors": "The Social Media Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367330_bad1_4.jpg", 
    "course_url": "https://www.udemy.com/linkedin-course-grow-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T13:54:47Z"
}