{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t      The Mastering Sales Through the Body of Selling course was created for those new to selling.  </p>  <p style=\"\">  \t  To many of the other sales courses focuses on a rigid step based approach to selling, where true understanding of your sales environment can in fact turn you into a much better sales person.  </p>  <p style=\"\">  \t  Understanding your customers, competitors, products, and your resources will allow you to excel at selling; and create a more flexible approach to sales tailored to your unique market and personality.  </p>  <p style=\"\">  \t  This is why course is structured to introduce students to a philosophy of selling that focuses on thinking in terms of the entire sales spectrum. New business owners, or those starting out in sales will benefit greatly from understanding how, when, and where sales start.  </p>  <ul style=\"\">  \t<li>  The course teaches sales skills through 17 video lectures, and includes workbooks to complete exercises.  </li>  \t<li>  Following the exercises in the course will give students an immediate understanding of their customers, competitors, and products.  </li>  \t<li>  The course is self-paced to suit busy individuals, and will be available via lifetime access to reference at any time.  </li>  </ul>  <p>  \tSo if you want to gain a greater understanding of the sales environment, as well as have your questions answered by an experienced professional, join us today for a course that could see your sales increase drastically.  </p>  <p>  \tI&#039;m confident that the course will provide immense value to you, but if for any reason you feel the course has not met your expectations we have a clear, no questions asked 30-day money back guarantee for your peace of mind.  </p>  <p>  \tSee you soon!  </p>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "Master Selling with the Body of Sales Course", 
    "price": "25.00", 
    "instructors": "Bernie Thorpe", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400002_8341_2.jpg", 
    "course_url": "https://www.udemy.com/the-body-of-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T11:08:40Z"
}