{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    If you work in the world of retail, then this course is for you. It explains in depth the <strong style=\"\">Retail Trifecta</strong> - the three elements that are integral to success, and increased profits, in retail.  </p>  <p>  \t    Presented by retail marketing guru, <strong style=\"\">Kevin Moore </strong>- a man who walks thousands of stores around the world each year - the course brings to life, with real-world examples, the steps needed to be successful in retail. Whether you own your own store/s, work as an associate in retail or manufacture and distribute through stores, this course contains essential knowledge that will help you in your business.  </p>  <p>  \t    The course features videos of Kevin explaining all the steps needed to achieve the Retail Trifecta and <strong style=\"\"><em style=\"\">photographic and video examples </em></strong>from stores he&#039;s visited around the world. It also includes <em style=\"\"><strong style=\"\">interviews with some retail entrepreneurs who share their experiences and successes</strong></em>.  </p>  <p>  \t    The first part of the course provides an overview of the Retail Trifecta and then the following sections go into detail on the <strong style=\"\">twenty steps</strong> that will help you to ensure you achieve the shopper experience to build your business.  </p>  <p>  \t    So if you want to understand your shoppers in more depth, build a store format and system that encourages them to <strong style=\"\"><em style=\"\">linger longer, spend more and tell their friends about your business or product,</em></strong> then this is the course for you.  </p>", 
    "end_date": null, 
    "title": "Master the Shopper Experience to build your retail business.", 
    "price": "35.00", 
    "instructors": "Kevin Moore", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/250570_a6ca_2.jpg", 
    "course_url": "https://www.udemy.com/the-retail-trifecta/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T04:00:10Z"
}