{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course was created to change the way most companies sell, and enable them to add value during the sales process. The challenge is this training is not available to the general public, and is coveted amongst certain circles and experts until now...</p><p style=\"\">There is a moment of truth in sales when a sales or marketing professional does such a great job educating their prospective client that they are viewed as a trusted advisor. This moment of truth is the exact second when the customer is no longer being sold to but is rather being empowered to buy. </p><p style=\"\">The new role of sales professionals is to educate their prospects on relevant industry issues, facilitate their decision-making process, and provide compelling evidence that makes it easy for their prospects to say yes.</p><p style=\"\">This course was designed to empower you and your company to close deals faster and more often.  The challenge is most companies and sales professionals try to lead in with their features and benefits and very few understand the important of using education to build trust and close deals.</p><p style=\"\">Companies in today&#039;s information rich world don&#039;t need corporate parrots who simply &quot;show up and throw up.&quot;   They need industry experts who can help their customers assess all their options and succeed in making the right choice.  By doing this you&#039;ll notice your interaction with customers will become frictionless. They will magically let their guard down and give you the &quot;keys to the kingdom.&quot; They will share their intimate fears and needs with you which in turn will allow you to help them find an appropriate solution.  </p><p style=\"\">This isn&#039;t one of those training programs that gives you some basic theory and sends you out to figure it out on your own.  This is an action oriented course with high level strategy and hands on action steps that you can take along the way.  The course comes with both video and audio learning objectives along with industry samples and productivity sheets. </p><p style=\"\">By the end of this training you will have industry leading training that will empower you to be a more effective communicator and sales person.  Here&#039;s what you are about to learn:</p><p style=\"\">1. The Big Picture: Education Based Marketing principles and industry applications. </p><p style=\"\">2. Your Message Foundation.  You want a message that is sticky, this workshop is all about digging deep and finding out what big problem you intend to solve.  </p><p style=\"\">3. Build Your Message.  The power of hot buttons and secrets to magnify the motivation of a prospective client.  The problem - solution - call to action formula. </p><p style=\"\">4. Sales Enablement.  How to take your message to market, empower your sales team and generate continuous feedback. </p><p style=\"\">5. The Messaging Matrix.  A messaging framework designed to train your team so they can respond to any customer situation and have engaging questions they can ask, relevant features and benefits, and stories that are specific to each customers motivators (aka hot buttons). </p><p style=\"\">6. Seal the Deal.  Strategies to close the deal faster and more often without discounting!</p><p style=\"\">If your job on income depends on how well you communicate, then this course is a must. Even if you haven&#039;t been a great communicator in the past, this will help you improve.  If you are a top selling sales person, this course will enable you to take your game to the next level. </p><p style=\"\">I guarantee this course will empower you to communicate more effectively and close deals faster and more often. This is a risk free purchase with Udemy&#039;s 30 day money back guarantee.  Nothing to lose and everything to gain. </p><p style=\"\">Enroll today, and I look forward to seeing you on the inside. </p><p style=\"\">Gabriel Padva</p><p style=\"\">P.S. This training is something I&#039;ve kept private except for exclusive client workshops I&#039;ve held for high profile companies who pain thousands of dollars for this training. After finally being convinced by a few of my clients to share this information publicly, I decided to build a course on Udemy.  I can&#039;t guarantee this will be available for purchase forever so I would take this course now while you still can. </p>", 
    "end_date": null, 
    "title": "Messaging Mastery for Revenue Acceleration", 
    "price": "20.00", 
    "instructors": "Gabriel Padva", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414732_0c34_2.jpg", 
    "course_url": "https://www.udemy.com/messagingmastery/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T04:11:56Z"
}