{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    Email consumes about 25% of your work time every day. You receive an average of 100 emails per day and typically process about a third of them, leaving you to start the next day with 66 unprocessed emails in your inbox. Lather, rinse, repeat.... anyone remember the Breck ads?? (and so on... and so on... and so on...) You could end up with over 1200 unread emails in just one month! And the more cluttered your inbox is, the more potential you have to miss important information.  </p>  <p style=\"\">  \t    How do YOU break this cycle? We&#039;ve found that most people have at least one of these four problems when processing email:  </p>  <p style=\"\">  \t    1. Switching back and forth between tasks  </p>  <p style=\"\">  \t    2. Using too much time processing email.  </p>  <p style=\"\">  \t    3. Trouble finding stored emails when you need them  </p>  <p style=\"\">  \t    4. Problems remembering and completing email requests.  </p>  <p style=\"\">  \t    ... and many people have all four. Yikes!!  </p>  <p style=\"\">  \t<br style=\"\">  </p>  <p style=\"\">  \t    Deal with these four problems by setting up times to manage your email &amp; helping it manage itself, utilizing the tools that allow you to process email in record time, storing emails efficiently &amp; searching quickly and effectively, and easily reminding yourself what to follow up on and when.  </p>  <p style=\"\">  \t          Learn how to use Outlook&#039;s tools like your own personal assistant. It can automatically copy, file, move &amp; delete emails for you, it can alert you to important emails &amp; reminders, and store emails and other materials in meetings you have set up and share them with other participants.  </p>  <p style=\"\">  \t    It&#039;s counterintuitive to spend lots of time learning how to have more time. Effective Email Management only takes about an hour to complete. It contains:  </p>  <ul style=\"\">  \t<li style=\"\">5 major lectures</li>  \t<li style=\"\">9 valuable tools and tips</li>  \t<li style=\"\">downloadable support materials that can walk you through each step in print format.</li>  </ul>  <p style=\"\">  \t<span style=\" color:inherit;\">Reclaim 1-2 hours per day by making these email practices part of your routine. Reduce wasted time, minimize stress and increase your time to sell!</span>  </p>", 
    "end_date": null, 
    "title": "More Time More Sales: Effective Email Management", 
    "price": "40.00", 
    "instructors": "Ray Hollinger", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402262_707f_2.jpg", 
    "course_url": "https://www.udemy.com/more-time-more-sales-effective-email-management/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T15:47:53Z"
}