{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you a B2B salesperson? Do you sell products and services to companies, and other types of organizations? Is your income and livelihood directly linked to how much you sell?<br></p>\n\n<p>If you answered yes to these questions then this course is for you. Throughout my career I have generated over <strong>$87.6M US</strong> in revenues selling B2B technology solutions to companies all over the world (several of the Fortune 500 companies and government agencies within North America - Check out the full list of clients within my instructor profile) </p>\n\n\n\n<p>Did you know that on average, only <strong>13%</strong> of B2B sales leads convert to become actual sales opportunities. What if you had the ability to increase your conversion rate by <strong>2%</strong>, <strong>5%</strong> or <strong>even more</strong>? What if you could turn more of your face to face and phone meetings with potential customers into actual sales opportunities? </p>\n\n\n\n<p>In this course - \"<strong>Nailed It! - Turn your B2B Sales Meetings into Opportunities</strong>\", you will learn the elements that make up the B2B buying process and show you how to map your sales process to be in sync with the key decision makers and their approach to making a purchasing decision. Using an easy to follow process you will learn how to build questions that you are able to use in your next B2B sales meetings to build trust with the client, uncover crucial information, and effectively articulate the value of the products and services that you offer. This course will ultimately show you how to move your clients to take action and how to transform more of your client meetings into actual sales opportunities.</p>\n\n\n\n<p>The course consists of <strong>21</strong> lectures including a number of downloadable materials. Using <strong>one main planning document</strong> as the foundation for the course we walk through the process on how to prepare, and execute a successful B2B sales meeting. This one document and the process taught in this course can be applied to <strong>BOTH</strong> initial client meetings as well as meetings where there is already an established opportunity and you are looking to advance closer to a sale.</p>\n\n\n\n<p>By enrolling in this course you get:</p>\n\n\n\n<ul><li>Access to all 21 easy to follow lectures (20 Video &amp; 1 Text) which you can complete at your own pace</li><li>Downloadable materials including the Sales Meeting Planning Worksheet</li><li>Lifetime access to all of the course materials</li><li>30 day Udemy Satisfaction Guarantee</li><li>The full course is downloadable for offline viewing on your phone or tablet. Access 24 hours a day anytime, and from anywhere. </li><li>Full 24 hour access to the course discussion board</li></ul>\n\n\n\n<p>If you are ready to learn some new skills along with an easy to follow repeatable process that you can use to convert more of your sales leads and meetings into opportunities, then I am looking forward to working with you to help you to accomplish this.</p>\n\n\n\n<p>Lets get started....!</p>", 
    "end_date": null, 
    "title": "Nailed It! Turn your B2B Sales Meetings into Opportunities", 
    "price": "30.00", 
    "instructors": "Randy Whitcroft", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572592_1972.jpg", 
    "course_url": "https://www.udemy.com/convert-b2b-meetings-into-opportunities/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T17:52:34Z"
}