{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 12/23/15: Over 60 Students Enrolled! </strong></p><p>In this course, you'll learn the hidden secrets used by a Master Hypnotist to become an elite-level Door-To-Door canvasser, fundraiser and salesman. This is NOT the kind of stuff your company or boss will teach you...because they don't know ANY of it. In fact, only a very small number of people on Earth are familiar with the concepts you'll learn when you take this course.</p><p>This course teaches driven, ambitious salespeople and marketers how to use the tools of NLP and covert influence to improve sales results, communicate more powerfully and effectively, and add hypnotic constructs to their pitches and copy. It is taught in 5 sections, with a bonus hypnosis track to accelerate your learning. Whether you are new to NLP or have taken courses before, I promise that you will find concepts and tools in my course that you have never seen before. If you follow along and do the homework, you will never think of the English language quite the same way...ever again...and have a hidden edge over all of your competition.</p><p>I'm bringing you ALL the best tips and tricks that I learned not only from the Hypnosis Motivation Institute, where I graduated as a Certified Master Hypnotist, but also from the geniuses who I studied on the side--guys like Ross Jeffries, Mark Cunningham and David Snyder.</p><p>I am so confident in my material that I want you to know there is a 30-Day money back guarantee. If for whatever reason you aren't 100% satisfied when you take this course, I will return your money with NO questions asked. ALL the risk is on me to perform the techniques and explain them well...you've got literally nothing to lose, so <strong>bet on yourself</strong> and <strong>take this course today!</strong></p>", 
    "end_date": null, 
    "title": "NLP For Sales And Persuasion", 
    "price": "50.00", 
    "instructors": "Drexel Scott", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475232_69c5_5.jpg", 
    "course_url": "https://www.udemy.com/nlp-for-sales-and-persuasion/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T18:52:18Z"
}