{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\">  \t<p>  \t\t\t</p>  \t<p>  \t\t<em style=\"\"><strong style=\"\">No Pressure Prospecting</strong></em> is a COMPLETE - step by step sales and business development process.  It gives you the inside Mindset, Selling Strategy and Technique - to be able to identify 36 &quot;Good Fit&quot; prospects and sales leads for your business in 3 weeks WITHOUT the pressure of making cold sales calls.  \t</p>  \t<p>  \t\t<strong style=\"\">This is a complete lead generation sales process you can use - Nothing is left out of this sales coaching program! - deliver the business building leads to increase closed sales and generate leads using email, internet marketing while increasing your selling communication.</strong>  \t</p>  \t<p>  \t\t<strong style=\"\">Start closing more sales now.</strong>  \t</p>  \t<ol style=\"\">  \t\t<li style=\"\">Blow past all the BS that your prospects tell every other salesperson...</li>  \t\t<li style=\"\">Easily identify the people who are open to having a conversation...</li>  \t\t<li style=\"\">Get them to call you and suggest getting together...</li>  \t</ol>  \t<p>  \t\t<em style=\"\">    Selling is 2 Parts: Finding people to sell &amp; Selling people you find. </em>  \t</p>  \t<p>  \t\t                    At the end of the day - it just doesn&#039;t matter how good of a sales person you are, if you don’t have enough people to sell to.  \t</p>  \t<p>  \t\t<strong style=\"\"><em style=\"\">No Pressure Prospecting</em> is designed to help you find and identify those ideal &quot;good fit&quot; sales prospects in a way that takes all the pressure off of you - the salesperson. </strong>  \t</p>  \t<p>  \t\t<strong style=\"\"> Crack the cold email code and stop cold calling for business.</strong>  \t</p>  \t<p>  \t\t<strong style=\"\">Learn these sales growth, business building secrets.  Increase your selling opportunity with these sales coaching ideas.</strong>  \t</p>  \t<p>  \t\t                    This sales training and coaching program has been built with a specific person in mind.  \t</p>  \t<p>  \t\t                    Here’s what others have said:  \t</p>  \t<p>  \t\t<strong style=\"\">Blake from Illinois says...</strong>  \t</p>  \t<p>  \t\t<em style=\"\">“Thank you! Thank You! Thank You!</em>  \t</p>  \t<p>  \t\t<em style=\"\"> I was thinking of getting out of sales all together, because I just didn&#039;t feel like I could do what it was I thought I had to do to find prospects. </em>  \t</p>  \t<p>  \t\t<em style=\"\"> This process makes sense and has taken all the pressure out of prospecting.”  </em>  \t</p>  \t<p>  \t\t<em style=\"\"><br style=\"\">  \t\t</em>  \t</p>  \t<p>  \t\t<strong style=\"\">Vicki from Arizona says...</strong>  \t</p>  \t<p>  \t\t<em style=\"\">“This is awesome!  I&#039;ve been using no pressure prospecting and suddenly people are calling me to ask for pricing.  It feels amazing to be spending my days working with people who want my help”</em>  \t</p>  \t<p>  \t\t<em style=\"\"><br style=\"\">  \t\t</em>  \t</p>  \t<p>  \t\t<strong style=\"\">David from Boston says...</strong>  \t</p>  \t<p>  \t\t<em style=\"\">“There is a large security firm I&#039;ve been targeting for moths; the president of the company wouldn&#039;t talk to me no matter what I tried…</em>  \t</p>  \t<p>  \t\t<em style=\"\">I used the relate vs admit technique and were scheduled for our first meeting… they even sent me an email to confirm.  – thank you Bob</em>  \t</p>  </ul>", 
    "end_date": null, 
    "title": "No Pressure Prospecting - Close More Sales", 
    "price": "20.00", 
    "instructors": "Bob Marx", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189940_e0e1_8.jpg", 
    "course_url": "https://www.udemy.com/no-pressure-prospecting/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-27T21:38:13Z"
}