{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4 style=\"\"></h4>  <p id=\"header\" style=\"\">  </p>  <h4 style=\"\"></h4>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">Build Rapport – Gain Influence with These Hidden Methods!</strong>  </p>  <p>  \t  </p>  <p>  \t                         By modifying our behavioral style to match the other person’s style will improve communication and make the other person more comfortable.  </p>  <p>  \t                        Not every customer responds well to the same sales approach. Salespeople who learn to adapt their behavior are better able to meet their customers&#039; needs and improve sales results.  </p>  <p>  \t<strong style=\"\">Ever have a time when you were sure you were being totally clear, but the other person heard something else?</strong>  </p>  <p>  \t                        There are no resistant prospects, only inflexible salespeople.  </p>  <p>  \t<strong style=\"\">Get the Edge and Close More Sales. </strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">Start Connecting</strong></li>  \t<li><strong style=\"\">Build Rapport </strong></li>  \t<li><strong style=\"\">Create Influence</strong></li>  </ul>  <p>  \t<strong style=\"\"> This is a complete sales coaching program – Nothing is Left Out!</strong>  </p>  <p>  \t                        It doesn’t matter what you meant to say, the meaning comes from how the listener hears and responds to it. Which also means that your intentions, good or not, are beside the point.  </p>  <p>  \t                        Develop stronger sales skills by identifying and responding to customer styles.  </p>  <p>  \t<strong style=\"\"><em style=\"\">“This is the secret key to open the door to Rapport &amp; Influence.” </em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">– Terry Ellis, Sacramento CA</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>  <p>  \t                        Each person has a unique personality and communication style which plays a very basic role in their Personal Perspective, and all personalities are combinations of four basic personality types.  </p>  <p>  \t                        One of the best ways to quickly improve the effectiveness of your communication is to adapt your communication style to match theirs.  </p>  <p>  \t<strong style=\"\">Blow past resistance… - People like people who are like themselves.</strong>  </p>  <p>  \t                        Remember, our natural tendency in communicating is to use our own style because it is what comes naturally and automatically to us. But if we want to be effective communicators, we need to adapt our style to that of the other person.  </p>  <p>  \t                        Since each person has a preferred style of communication, once you think about it and determine their style, you can communicate effectively by adapting your style to meet the needs of their style.  </p>", 
    "end_date": null, 
    "title": "NOW - Rapport & Influence for Sales", 
    "price": "20.00", 
    "instructors": "Bob Marx", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410274_9e1b_2.jpg", 
    "course_url": "https://www.udemy.com/now-rapport-influence-for-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T22:19:56Z"
}