{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                     All too often, especially in today&#039;s technology age, the art of the deal is <em style=\"\">forgotten</em> about. Looking at any of today&#039;s billionaires like Donald Trump or Tom Perkins, all of them have been <em style=\"\">experts</em> in the art of selling, negotiating, and the deal. As a salesman, I only wanted to be the best in my profession.  </p>  <p>  \t      After getting plenty of real experience, reading countless books, and watching hundreds of web seminars, I have discovered the <strong style=\"\">secrets</strong> to mastering the art of the deal and putting substantially <strong style=\"\">more money</strong> in my pocket as one of the most successful young sales instructors on the internet today.  </p>  <p>  \t                     In this course, I&#039;ll be discussing how I used these <strong style=\"\">simple skills </strong>to double my own income and how <em style=\"\">you</em> can do the same with almost no effort besides clicking, watching, and listening. No prior materials or knowledge of this art form is required, only your eyes and ears.  </p>  <p>  \t                    Here, we&#039;ll mainly be discussing:  </p>  <ul style=\"\">  \t<li>How to sell and close negotiations correctly and<em style=\"\"> lucratively</em> </li>  \t<li>How to use proper communication etiquette</li>  \t<li>How to pitch an idea</li>  \t<li>How to <em style=\"\">effectively</em> and concisely communicate your ideas to others</li>  \t<li>How to use these tips to actually <strong style=\"\">double your income</strong></li>  </ul>  <p>  \t     These <strong style=\"\">simple skills</strong> have been broken down into an <strong style=\"\">easy step by step process</strong> with over <strong style=\"\">1.5 hours</strong> of combined content and <strong style=\"\">notes on every lecture </strong>to follow along.  </p>  <p>  \t      Mastering the art of negotiating and the art of the deal will and has paid off dividends for myself and anyone who chooses to master them with this course. Bottom line, the secrets learned in this course will undoubtedly give you the skills to <strong style=\"\">succeed</strong> and ultimately <strong style=\"\">double</strong> your income in no time.  </p>", 
    "end_date": null, 
    "title": "Open, Pitch, Close - The Ultimate Sales Success Guide", 
    "price": "20.00", 
    "instructors": "Sean O'Connor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329844_fc1e_16.jpg", 
    "course_url": "https://www.udemy.com/how-to-double-your-income-through-negotiation-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T21:09:36Z"
}