{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tAre you a business owner that is too busy running your business to find any time to grow your business?  I have spent over 10 years as a sales person in many different industries implementing many different strategies; from door to door sales to integrated multinational campaigns employing staff in many time zones.  </p>  <p style=\"\">  \tIn this course I will teach you to use the same tools I use for my clients to move business processes offshore quickly and reliably. By learning to leverage global labour markets you will be able to grow your business faster than you ever thought possible.  </p>  <p style=\"\">  \t      All you need are the <strong style=\"\">RIGHT TOOLS</strong> and the <strong style=\"\">RIGHT PEOPLE</strong>  </p>  <hr style=\"\">  <p style=\"\">  \t       The truth is:  </p>  <ul style=\"\">  \t<li style=\"\">You <strong style=\"\">DON&#039;T </strong>have to be a big company to do this - even a single-person business can do this</li>  \t<li style=\"\">You <strong style=\"\">DON&#039;T </strong>need a big office or a bunch of phones, computers, and desks</li>  \t<li style=\"\">You <strong style=\"\">DON&#039;T </strong>need to know anything special before starting this course - this is start-to-finish EVERYTHING you need</li>  </ul>  <hr style=\"\">  <p style=\"\">  \t      Whether you&#039;re in a real-world service business, an online company, or you&#039;re selling products, this strategy can work for you.  </p>  <p style=\"\">  \t      Do what the big boys do: build a sales team to do your sales for you. Even if it&#039;s just you right now, you can use this system and:  </p>  <ul style=\"\">  \t<li style=\"\">Use an easy-to-manage <strong style=\"\">CRM system </strong>to track leads and salespeople from all over the world</li>  \t<li style=\"\">Hire low-cost <strong style=\"\">overseas labor</strong> from a massive pool of hungry and ambitious  freelancers</li>  \t<li style=\"\">Set up a <strong style=\"\">virtual phone system</strong> so your salespeople can call from anywhere around the globe and look like they&#039;re sitting beside you in your office</li>  \t<li style=\"\">Use <strong style=\"\">cloud file storage</strong> to keep your team up-to-date and easily retrieve important files</li>  \t<li style=\"\">Build cheap <strong style=\"\">lead lists</strong> of the right prospects, so your callers can get on the phone as soon as possible</li>  \t<li style=\"\">Create effective <strong style=\"\">training material</strong> to easily add new people to your team and quickly get them up to speed</li>  \t<li style=\"\"><strong style=\"\">Scale</strong> endlessly - it&#039;s SO easy to add more people to your team</li>  \t<li style=\"\"><strong style=\"\">Avoid hassles</strong> and auxiliary costs of domestic employees</li>  </ul>  <hr style=\"\">  <p style=\"\">  \t      The tools are easy to use. Take this easy-to-follow course now - and build a sales team for your business now!  </p>", 
    "end_date": null, 
    "title": "Outsource your Sales", 
    "price": "30.00", 
    "instructors": "Evan Wainberg", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394990_1cb3_2.jpg", 
    "course_url": "https://www.udemy.com/outsource-your-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-15T16:43:25Z"
}