{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Does spending a little money and a couple of hours of your time today, in order to earn thousands more from sales every year, sound like a great deal to you!?</strong></p><p>Join over 900+ current and aspiring sales professionals who are learning and applying these powerful sales strategies to double their sales results!</p><p><strong style=\"\">Here is what International Sales Trainer Bruce King will teach you about the selling process...</strong></p><ul style=\"\"><li>How the human brain works, how to set sales goals and how you can train your brain to achieve amazing success in sales PLUS you will witness an amazing demonstration of the extraordinary power of the human brain.</li><li>Why you have to step out of your comfort zone to generate more sales.</li><li>The upsides and the downsides of Consultative Selling</li><li>How to prospect for new business using Bruce King&#039;s Referral Script. You&#039;ll learn the precise words you need to say to generate an ongoing stream of sales referrals so you never have to make another cold sales call, ever again.</li><li>Why people buy and how to sell to make sure they do. The use of pain versus pleasure in the sales process.</li><li>Replacing non-positive words and phrases with positive words and phrases that generate sales interest.</li><li>A sales process that puts you in control</li><li>How to eliminate the prospect from saying &#039;I want to think it over&#039; when selling.</li><li>The rules for handling objections during the sales process.</li><li>The simplest and most effective sales close, ever!</li></ul><p><em style=\"\">&quot;This is the second time we have booked Bruce King for our Best Speaker conferences, this time in both Gothenburg and Stockholm. The audiences just love him!&quot;</em> - Nicklas Östling, President at Bestseller PR, Events Sweden</p><p><strong style=\"\"><em style=\"\">&quot;I know what having access to these powerful sales strategies can do for you - I look forward to sharing them and helping you get to the top as well!&quot; - Bruce King</em></strong></p>", 
    "end_date": null, 
    "title": "Powerful Sales Strategies To Enable You To Double Your Sales", 
    "price": "25.00", 
    "instructors": "Bruce King", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540662_dba6_4.jpg", 
    "course_url": "https://www.udemy.com/powerful-sales-strategies-double-your-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T21:52:11Z"
}