{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tIn order to create messages (for business-to-business sales) that compel the prospect to take action, you need to first understand the compelling business priorities for your prospects, and then align your messages and conversations to those priorities.  </p>  <p style=\"\">  \tPerformance Metrics and Key Performance Indicators or KPIs can be a great way to learn about your prospects business priorities, the issues they really care about, and the targets that keep them awake at night.  </p>  <p style=\"\">  \tIn the first part of the course, you will learn the two main categories of Metrics and KPIs, used within most organisations, and a few quick and easy ways to learn the ones that will be relevant to your target prospects. Then, you will learn a simple three step exercise that can help to identify the specific metrics and KPIs that can be connected to the value of your solutions.  </p>  <p style=\"\">  \tOnce these metrics and KPIs are identified, you will have one of the two components needed for a compelling sales message. For the second component, you will need some information from your existing customers. So, you will learn a very specific conversation framework, to capture that second component.  </p>  <p style=\"\">  \tIn the final part of course, you will learn how to package all of the newly discovered information and use it effectively at every stage of the sales process:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">How to use this information during prospecting… in a way that it leaves the prospect wanting to find out more.</span></li>  \t<li style=\"\"><span style=\"\">Then, at the initial meeting, how to use this information to systematically quantify the impact of the prospects current situation.</span></li>  \t<li style=\"\"><span style=\"\">When it comes to presentations, how to use this information tactfully in order to lower the prospects reluctance to change.</span></li>  \t<li style=\"\"><span style=\"\">And finally, how this information can be used to create a strong and credible business case that makes your solution… a ‘no-brainer’.</span></li>  </ul>  <p style=\"\">  \tIn short… by the end of this course, you will have learnt... how top sales professionals are able to open more doors and close more sales.  </p>  <p style=\"\">  \tSo… let&#039;s get started!  </p>", 
    "end_date": null, 
    "title": "Professional Sales Training - Compelling Conversations", 
    "price": "50.00", 
    "instructors": "Imran Ali", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387514_9dd2_4.jpg", 
    "course_url": "https://www.udemy.com/compelling-sales-conversations/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T09:40:04Z"
}