{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">The most comprehensive online sales training course backed by proven methods and extensive research</strong>  </p>  <p style=\"\">  \t    Develop skills including sales prospecting, understanding buyer behavior, and account management, and earn a formal certificate in Professional Sales from Florida State University – the leading academic institution in the field of sales education.  </p>  <p style=\"\">  \t    Sales scripts, tricks, and shortcuts are a thing of the past. Superficial sales gimmicks no longer work with today&#039;s informed buyer. If you want to see a real improvement in your sales results, you must build lasting skills and knowledge that form the basis of long-term sales performance.  </p>  <p style=\"\">  \t    This course will provide you with just that. You will build timeless sales skills like the ability to pain-point buyer problems (consultative selling) as well as learn new age sales concepts including social selling - using social media to generate sales leads and win more business.  </p>  <p style=\"\">  \t    The concepts you will learn in this course are tested and proven. We&#039;ve developed the material in partnership with top sales professors and experienced sales executives from different industries.  </p>  <p style=\"\">  \t    Here is an overview of the course experience:  </p>  <ul style=\"\">  \t<li style=\"\">Short 3-5 minute videos cover the big ideas and feature our experts (top professors, executives, and consultants). There are over 100 videos. See the complete list below.</li>  \t<li style=\"\">Printable tip sheets are included with most videos and can be used as reminders of the key concepts</li>  \t<li style=\"\">Tools are practical worksheets and guides that let you put the ideas into immediate action in the real world</li>  \t<li style=\"\">Short review quizzes help you check your progress as you advance through the program</li>  </ul>  <p style=\"\">  \t    Our sales training programs have helped thousands of sales professionals hone their sales skills – from the Fortune 500 to fast growing start-ups.  </p>  <p style=\"\">  \t    All users completing the course will have the opportunity to earn a certificate in Professional Sales from the Sales Institute at Florida State University  </p>", 
    "end_date": null, 
    "title": "Professional Selling Certificate by Florida State University", 
    "price": "50.00", 
    "instructors": "The Sales Institute  at Florida State University", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376300_e37f_3.jpg", 
    "course_url": "https://www.udemy.com/professional-selling-certificate-by-florida-state-university/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-23T14:04:03Z"
}