{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Are you ready to learn the secrets to psychologically persuade and influence subscribers, referrals and prospects ethically? Do you want to learn the techniques and strategies, once mastered, that will completely transform your sales and marketing efforts.</p><p>You will learn the techniques to get people to do what you want. But please use these techniques and strategies for good, and no deliberate manipulation of anyone.</p><p>You will discover the triggers to give value first and how to get tremendous value back. You will also learn how the top tabloid magazines use psychological triggers to influence people to buy their magazines - you will be able to use similar techniques, once you learn how these techniques are used.</p><p>You will be shown the trigger techniques of how to use specifics in your marketing and also how to handle any type of objections you may receive.</p><p>You will be shown strategies that the best infomercials use to get people to call up and order - once you understand this, you won't dare use any marketing or sales approaches without these Triggers!</p><p>Take this course today, you are covered by a 30 day money back guarantee. Master these Psychological Triggers today!</p>", 
    "end_date": null, 
    "title": "Psychological Triggers - Triggers That Will Explode Sales", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/652048_4e9e_2.jpg", 
    "course_url": "https://www.udemy.com/persuasive-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T04:51:48Z"
}