{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will teach you questions to ask your customer that will lead to more sales. Getting rejected constantly and getting half-baked answers to your questions is frustrating and you know deep down there is a better way. This course will give a step-by-step blueprint of the questions you should be asking and why.</p><p>This course will help you master engaging conversations with customers. </p><ul><li>Learn how to get a customer to agree to speak with you.</li><li>Take the sting out of setting next steps.</li><li>Learn how to unlock the customer's motivation to buy</li><li>Learn about easy ways to find out what a customer is thinking and feeling so you know how to proceed.</li><li>Learn exactly which questions will help your customer to visualize himself/herself using your product or service.</li><li>Close more sales.</li></ul><p>I created this course because I noticed that most of the sales reps I had been coaching were getting stuck and were asking poor questions. They were getting burnt out and unconfident in their own abilities to get good results and help their customers meet their needs. I noticed how simple changes to the questions made them feel excited and invigorated to speak with more people, because they knew how to succeed without feeling they had to convince someone to do something they didn't want to do. These are questions I have learned over the past 15 years and this is the first time I have put them all in one place.</p><p>This course is broken up into short video modules, each with one specific thing for you to implement. In total, there is over an hour of material, but I use easy to understand examples that we all might have experience with so you can see how simple implementation will be. I am confident you will have several \"aha\" moments and see results with your very first sales conversation after each module. </p><p>Once you are complete with this course you will be confident and see an immediate rise in customers choosing to move forward. Cheers to that!</p>", 
    "end_date": null, 
    "title": "Questions to Motivate Your Customer to Move Forward", 
    "price": "20.00", 
    "instructors": "Tasha Smith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616210_6859_3.jpg", 
    "course_url": "https://www.udemy.com/questions-that-convert/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T22:28:02Z"
}