{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>A New Training All About the Complimentary Call:</strong></p><p><span>The Complimentary Coaching call is vital. It's where people move from being “interested” in you as a coach to paying you what you're worth as a coach! The Complimentary Call is so important that I wanted to offer some specific training focused on it… so you could start applying these strategies to gain “great fit” clients who pay you well… right away!</span></p><p><span>This NEW training will give you a step-by-step process for how to handle every minute of the complimentary call!</span></p><p><strong>You Will Learn:</strong></p><ul><li>How to spend each and every minute of the complimentary call!</li><li>How to use the specific questions I ask in my complimentary calls!</li><li>How to position specific questions so the potential client will sell themselves on working with you!</li><li>How to close complimentary calls via step by step instructions without feeling sales-ey!</li></ul><p><strong>Listen to REAL WORLD calls!</strong></p><p>Have you ever heard about some coaches “closing theory” and wondered if it would actually work? . . . or if it was actually scripted? Would it be helpful to hear actual, real world strategies as they play out, LIVE on the phone?</p><ul><li>Listen in to 5 separate complimentary calls with Mitch Matthews</li><li>Be a fly on the wall as he uses “Confidence to Close” strategies</li><li>Experience the closing of over $16,000 in coaching services</li><li>Hear how you can do it to! These strategies are for anyone!</li></ul><p><strong>Confidence to Close Training Will Give You:</strong></p><ul><li>The Confidence to Collect Payment UP FRONT!</li><li>The Confidence to set prices &amp; get paid what you are WORTH!</li><li>The Confidence to only take those clients who are a GOOD FIT for you!</li><li>The Confidence to actually ENJOY complimentary calls!</li><li>The Confidence to CLOSE as many clients as you want!</li></ul>", 
    "end_date": null, 
    "title": "Sales Training for Life Coaches: Confidence to Close", 
    "price": "45.00", 
    "instructors": "Mitch Matthews", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587378_668a_4.jpg", 
    "course_url": "https://www.udemy.com/confidence-to-close/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T14:12:00Z"
}