{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Today, the world is unimaginable without the internet. We buy products, file our taxes, pay bills, apply for jobs, conduct research, stream entertainment, and communicate with people around the world over it. <br></p><p>But this isn’t always how things were. Imagine for a moment what it was like to buy a product before the internet existed. Buyers actually needed salespeople in order to make a decision -- salespeople who held all the cards. <br></p><p>Why? Because they were the only ones with answers to buyers’ key questions. <br></p><p>Questions like: <br></p>\n\n\n\n\n\n\n\n<ul><li>What is included in your offering? </li><li>What does it cost? </li><li>How does it compare to your competitors? </li><li>Who else is using your offering? Do they like it? </li></ul>\n\n<h4></h4>\n\n<p>The internet changed everything. And it turned the buyer-seller relationship completely upside down. Today, the information that buyers need to make a purchase decision is just a click away. The power in the buying and selling process has shifted from the seller to the buyer. The buying process is transformed. <br></p><p>And that means to keep up with today’s empowered buyer, the sales process needs to transform too. Whether your sales process relies on inbound leads or targeted outreach, whether you’re a big company or small, whether your sale is complex or simple; inbound sales is relevant. That’s because inbound sales transforms selling to match today’s empowered buyer -- so sales reps can sell the way people buy.<br></p>\n\n\n\n<h4>What is the Inbound Sales Certification course?</h4>\n\n<p>HubSpot Academy's free Inbound Sales Certification course features five classes that introduce you to the Inbound Sales Methodology. From identifying potential buyers, to developing outreach strategies, to building personalized presentations, this free certification course covers the basics of what inbound sales is all about.</p>\n\n\n\n\n\n<h4>Why get certified?</h4>\n\n\n\n\n\n<p>Whether you're leading a sales team, just getting started or you're a seasoned professional, the Inbound Sales Certification will prepare you to better identify, connect, explore, and advise today’s empowered buyer.</p>", 
    "end_date": null, 
    "title": "Sales Training Course + Official Certification", 
    "price": 0, 
    "instructors": "Eric Peters, Pete Caputa, Mark Roberge, Dan Tyre, Jill Fratianne, Andrew Quinn, Michael Pici", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/851362_4434.jpg", 
    "course_url": "https://www.udemy.com/sales-training-course/", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-17T00:10:58Z"
}