{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is all about selling goods and services. You will learn different selling techniques, explore how relationships influence the selling process, and how variables can help you close the sale. We will have a close look at various ways of approaching the customer, and the most relevant techniques for asking the right questions. Furthermore, you will find out why people choose not to buy from you, and learn about the established model that will help you close a sale.</p>  <p>“Everyone sells” is designed for anyone involved in the sales process, from the front line to the more strategic levels. The course will not only introduce sales techniques to new sales personnel, but also provide seasoned professionals with a valuable opportunity to practice and assess their skills.</p>  <p>Upon completion of the course, you will have gained comprehensive understanding about:</p>  <ul><li>Components      of a sale</li><li>Strategy      of the sales process</li><li>Selling      tactics and techniques</li><li>Closing      the sale and upselling</li></ul>    <p>Mr. Hunt’s style is often described as ‘inspirational’. His goal is to always create positive change in people with whom he works. He has significant experience in successfully operating at all organizational levels—from the induction phase, through first line management, and right up to board level. Additionally, he is able to strike the appropriate level of debate on every occasion.</p>  <p>Mr. Hunt is the MD and principal facilitator of UK Seminars. His work is well known in many countries, e. g., in Europe, in the USA, in the Middle East, and in India. His delegate evaluations are excellent, averaging 9.0 on a 10 point scale.</p>", 
    "end_date": null, 
    "title": "Sales Training – Everyone sells!", 
    "price": "50.00", 
    "instructors": "Lecturio GmbH", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/671150_fb1e_4.jpg", 
    "course_url": "https://www.udemy.com/sales-training-lecturio/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-16T14:11:17Z"
}