{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  There are a lot of <strong style=\"\">sales trainings</strong> to show you how to flatter the prospects to unconsciousness till you get the deal. But what they don’t tell you is how to defend your business from bad deals and clients just losing your money and time.  </p>  <p style=\"\">  \t  Exactly this knowledge gives you <strong style=\"\">“The Power of NO defense sales system”</strong> course. You will learn how to behave in sales negotiations and close the deal with confidence.  </p>  <p style=\"\">  \t  I will show you the main points to look out for during sales preparation and in the <strong style=\"\">selling process</strong> itself. In this sales training you will learn how to act with different client types and master one really successful defense sales system.  </p>  <p style=\"\">  \t  As a bonus at the end there is a special <strong style=\"\">role play video</strong> to show you the technique in real deal conditions. You can also test the sales skills accumulated during the training in the <strong style=\"\">special quiz </strong>in the last section.  </p>  <p style=\"\">  \t  In the game of chess the grandmasters perfection both the attack and defense. <strong style=\"\">Can you defense your business in sales negotiations?</strong> Master the power of No in selling process and secure your business!  </p>", 
    "end_date": null, 
    "title": "Sales training- The Power of NO defense sales system", 
    "price": "25.00", 
    "instructors": "Grigor Yovov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/250754_4fe3_5.jpg", 
    "course_url": "https://www.udemy.com/sales-training-the-power-of-no/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T10:49:09Z"
}