{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Sales doesn&#039;t have to be complicated. By following the simple steps outlined in this course, you can dramatically increase your sales. Whether you&#039;re completely new to the world of sales or have some experience under your belt, following this system is sure to bring you a greater level of both success and enjoyment in your sales.</strong>  </p>  <p>  \t        This course offers a simple system that you can follow step-by-step in order to build better relationships with your clients and show your value more effectively than your competition. This course is free of jargon and free of complicated &quot;advanced sales techniques&quot;. It just has an easy to follow system that will help you close more deals regardless of  your experience level.  </p>  <p>  \t        The truth is, sales isn&#039;t as complicated as it&#039;s often made out to be. This course will teach you what you truly need to know in order to sell more effectively and enjoy doing it!  </p>  <p>  \t        This course is structured just like your next sales meeting; walking you through every step of the sales process, right from setting up the meeting to closing the deal.  </p>  <p>  \t        This course is for anyone who wants to be able to sell more effectively, or even just be more persuasive, gain confidence, and do a better job of showing clients the value that you bring to the table.  </p>  <p>  \t        Regardless of what you&#039;re selling, following the system taught in this course is the best way to master your sales meetings and truly enjoy the process!  </p>", 
    "end_date": null, 
    "title": "Sales Meetings for Beginners", 
    "price": "20.00", 
    "instructors": "James Svetec", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355716_3ffa_2.jpg", 
    "course_url": "https://www.udemy.com/sales-meetings-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T23:13:06Z"
}