{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    If you are a good sales person who wants to become great, if you are at the top of your game but know you can do better or if you have a pipeline full of deals that simply won’t close then this course is for you. You will understand concepts and learn techniques to hone your skills across all aspects of B2B selling to make you  </p>  <ul>  \t<li>more effective in what you actually do, working on the right things </li>  \t<li>more efficient with your time and your teams as it is a finite resource </li>  </ul>  <p>  \t    and to help you  </p>  <ul>  \t<li>improve your close ratios, more success, less defeats </li>  \t<li>increase your deal size, hit your numbers faster</li>  \t<li>enhance your credibility with customers, prospects and your team </li>  </ul>  <p>  \t<strong>to make you more successful.</strong>  </p>  <p>  \t    Each section, broken down into bite size lessons, deals with a specific part of selling and the selling cycle. The lessons are voice over slides. A quiz at the end of each section is intended to validate that you have understood the concepts before moving onto the next section.  </p>  <p>  \t    The course is structured around a classic B2B sales cycle. My recommendation is to follow it as designed as later lessons build on what you have learnt previously. Listen all the way through then come back to specific lessons and revise it again taking note of the concepts and techniques discussed. When you work through a specific lesson with a technique or techniques you need to apply, do it, and start putting the techniques discussed into practice.  </p>  <p>  \t    I suggest that the course be completed within 2-4 weeks depending on how you manage your practice. Don’t create excuses now as to why you cannot practice or embrace the ideas in this series. I can be your guide but it is you that has to climb the mountain. If you don’t give it a real go then we will both have failed!  </p>", 
    "end_date": null, 
    "title": "Sales Performance Tune-up Part 1", 
    "price": "20.00", 
    "instructors": "Mr Chris Rodowicz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191200_d17c_2.jpg", 
    "course_url": "https://www.udemy.com/sales_performance_tune-up_part_1/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-30T09:39:44Z"
}