{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t           When you're a solo-based professionals, leading a potential client through a successful sales conversation is an essential component of your business. Unfortunately, too often self-sabotaging behaviors and thoughts keep you from enjoying the success - and income - you deserve from this all-important meeting.</p><p><strong>Double Your Income Or More With This Proven Formula</strong></p>  <ul>  \t<li><strong></strong>Uncover what makes YOU unique and how to communicate the benefit of your secrets sauce to your potential client</li>  \t<li>Scrutinize everything you do for the client to understand the impact or cost</li>  \t<li> Reveal your true value in a way that helps the client justify investing in your services</li>  \t<li>Create your own Signature System to help you clearly communicate your solution and why it's the best choice for your client</li>  \t<li>Step up to lead the sales conversation as the CEO of your 1-person firm</li>  \t<li>Recognize red-flag clues that indicate a client or project is not worth your trouble</li><li>Most importantly, eliminate that sleazy, hype-filled talk that turns your client off</li>  </ul>  <p>  \t<strong>Powerfully guiding the conversation as the CEO of your firm earns their confidence and sets you apart as a credible business professional worth top-dollar fees.</strong>  </p>  <p>  \t  After working with solo-based professionals for nearly 20 years, I realized that many times they sabotage themselves during sales conversations with potential clients. They present themselves more as a job seeker asking for work than as a competent expert delivering a solution. When you're unable to clearly communicate the benefit of hiring you, you lose your chance. When you step up and approach the conversation as a CEO on equal footing with the client, you have more power and are taken seriously. </p><p>In this course, you'll find a few simple preparatory tasks and you'll learn the specific format to follow as you take the lead in the conversation. You'll close deals for far more money then you have previously.  </p>  <p>  \t<strong>Content and Overview:</strong>  </p>  <p>  \t  I designed this course for service business professionals. You're good at what you do but you're not effective at communicating the value to potential clients. You tend to let them tell you what to do and how much they'll pay. No more of that!</p>  <p>  \t  We'll start off the course learning the difference between being perceived as a job seeker and as the CEO of your own 1-person firm. This is one place where most solo professionals sabotage themselves without even know it.  </p>  <p>  \t  I'll give you some tips on how to lead as a CEO. You'll learn to overcome the client's fears and resistance.  </p>  <p>  \t  Next you'll find in-depth exercises to prepare you to step confidently into the role of CEO. You'll do the groundwork that will help clearly communicate the value you deliver and how it impacts your client and their business.  </p>  <p>  \t  You'll walk into your next client meeting with an arsenal of content ready and you'll have a plan to get the client's signature on the dotted line. You'll have my step-by-step format.  </p>  <p>  \t  There are nine lectures with handouts so you can follow along and take your own notes as well. Additionally, the downloads are nice to put into a binder so you refer to each time you prepare for another sales conversation. Additionally, you'll get a complete Sales Conversation Template which distills the entire process to easily refresh yourself.  </p><p>Get ready to step up into a whole new level of success with your business!</p>", 
    "end_date": null, 
    "title": "Sales Strategies: 4 Steps to Better Paying Projects", 
    "price": "20.00", 
    "instructors": "Barbara Saunders", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226652_1c0d_3.jpg", 
    "course_url": "https://www.udemy.com/mastering-the-solo-pro-sales-conversation/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T20:42:44Z"
}