{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                       This sales training course<a href=\"http://www.saleshorizons.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"></a> will help <strong style=\"\">you develop sales skills to win more business.</strong>  </p>  <p style=\"\">  \t                    Whether you are new to sales, a veteran salesperson, technical staff who increasingly are being called on for business development, or an inside salesperson who wants to update their sales skills - this course is for you.  </p>  <p style=\"\">  \t<strong style=\"\">                                           The Course </strong>  </p>  <p style=\"\">  \t                    This sales skills course draws from <strong style=\"\">proven sales training programs used by thousands of salespeople over 30 years in Fortune 500 companies </strong>- including UPS, GE, J&amp;J, Boston Scientific, Kimberly-Clark, Medtronic, Smith &amp; Nephew - and other market leaders like Booz Allen and the Center for Creative Leadership.  </p>  <p style=\"\">  \t                    We learned from the very best what it takes to win business and translated those sales skills and insights into <em style=\"\">ACE - Achieve a Competitive Edge</em>.  </p>  <p style=\"\">  \t<strong style=\"\">                                                        Course Structure</strong>  </p>  <p style=\"\">  \t                    The 18 lectures are divided into 8 sections (spanning 2 hours) and cover:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">fundamentals of face-to-face selling</strong> - from opening, call planning and asking questions to objection handling and closing</li>  \t<li style=\"\"><strong style=\"\">emerging sales topics</strong> - team selling, building credibility, using social media, and storytelling</li>  </ul>  <p style=\"\">  \t                    Sections conclude with:  </p>  <ul style=\"\">  \t<li style=\"\">lecture notes containing all of the slides and a transcript of the Instructor&#039;s presentation for the section </li>  \t<li style=\"\">questions you can use to help you review the content presented and apply the concepts to your sales challenges</li>  \t<li style=\"\">online sales tools introduced in the Section</li>  </ul>  <p style=\"\">  \t<strong style=\"\">                                                  Start Boosting Your Sales - Now</strong>  </p>  <p style=\"\">  \t                    How companies buy, what they buy, and what they are willing to pay are all changing dramatically. <em style=\"\">ACE - Achieve a Competitive Edge</em>shares the knowledge and skills you need to win more business in this challenging environment.  </p>  <p style=\"\">  \t                    Now is the time to for you to get that extra edge - building your sales skills to develop and win more business. Take the first step now and start winning more business.  </p>", 
    "end_date": null, 
    "title": "Sales Skills: Communicate with Customers to Win More Sales", 
    "price": "50.00", 
    "instructors": "Richard Ruff", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235732_8dd5_9.jpg", 
    "course_url": "https://www.udemy.com/sales-skill/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T17:21:08Z"
}