{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>MY SALES SYSTEM WITH </strong><strong>STEP BY STEP SALES BLUEPRINT TO BRING SALES FOR ANY BUSINESS WITH JUST A COMPUTER AND INTERNET CONNECTION</strong></p><p><strong></strong></p><p><strong>--------------------------------------------------------------------------------------------------------------</strong></p><p>Are you really interested in bringing online sales to your business? Do you want to make a huge profit from online selling?</p><p>Here is a step by step premium course that explains how to get succeeded in online selling.</p><p>After completing this course, you will be able to bring in automated sales from online marketing.</p><p>The system is completely automated and all you need is just 10 to 30 minutes everyday to bring in daily sales for any kind of business or product.</p><p><strong><em>What This Course Is All About?</em></strong></p><p><strong><em>---------------------------------------------------------------</em></strong></p><p>Do you want to join millions of people who are making automated sales using social media marketing?</p><p>Are you struggling to bring in sales to your business?</p><p>Dont Worry... This course is going to teach you how to bring in sales using a Step-By-Step Blueprint in just 1 week.</p><p>You just need a simple website selling your affiliate product or your own product to get started with this system.</p><p>This Online Selling System is 100% Automated and thats the beauty of this course :)</p><p><strong>This Course Covers 3 Major Blocks:</strong></p><p>1. How every sales marketer are making huge sales with ease.</p><p>2. My complete sales blueprint explained with clear steps.</p><p>3. How to use the Robot Answer Software to bring in automated sales to your business.</p><p>(ROBOT ANSWER Software - FREE WITH THIS COURSE)</p><p>You will be an advanced online sales marketer after you watch and implement this course strategy.</p>", 
    "end_date": null, 
    "title": "Sales Success Blueprint + Software", 
    "price": "20.00", 
    "instructors": "Hema Chandiran", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/731268_d704_3.jpg", 
    "course_url": "https://www.udemy.com/sales-and-online-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-17T14:48:39Z"
}