{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t         My experience has shown me that in order to be a great salesperson, it only takes three things:  </p>\n\n<p>  \t\n\n</p>\n\n\n\n<p>  \t\t\n\n</p>\n\n\n\n<ol>  \t\t\t<li>You have to know the fundamental principles of selling. No amount of trick techniques or gimmicks can replace an understanding of the underlying laws of sales and persuasion.</li>  \t\t\t<li>You have to know the precise steps that every sale must go through, and how to smoothly walk prospects through each. If you can't, you'll never reach your full potential as a salesperson.</li>  \t\t\t<li>You have to have a strong desire to succeed. I know that sounds trite, but it's true--the best salespeople are inevitably the most driven. Fortunately, once you have the first two prerequisites, this final one usually takes care of itself.</li>  \t\t</ol>\n\n\n\n\n\n<p>  \t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\t                       Whether you (or your any of your sales team) are new to sales and have no experience or are a seasoned veteran looking for a way to boost your numbers and make more money, I can help you.  \t\t\t\t</p>\n\n\n\n\n\n<p>  \t\t\t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\t\t\t                       In my courses (parts 1 and 2) you'll find the most important principles, techniques, and training exercises that I've isolated, tested, and codified during my twenty years in sales and sales training.  \t\t\t\t\t\t</p>\n\n\n\n\n\n<p>  \t\t\t\t\t\t\t\n\n</p>\n\n\n\n<p class=\"MsoNormal\">  \t\t\t\t\t\t\t</p>\n\n\n\n\n\n<p>  \t\t\t\t\t\t\t\t  \t\t\t\t\t\t\t\t\n\n</p>\n\n\n\n<p class=\"MsoNormal\">  \t\t\t\t\t\t\t\t</p>\n\n\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\n\n</p>\n\n\n\n<p class=\"MsoNormal\">  \t\t\t\t\t\t\t\t\t\t  Each lesson contains a portion of my video seminar along with the corresponding chapter from my best-selling book. These two formats guarantee maximum retention of the data presented, and (with the test questions and practical exercises) mastery of each skill necessary to be a master closer.  \t\t\t\t\t\t\t\t\t</p>\n\n\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t                       Regardless of what you're selling, I am certain that this course will teach you (or your sales team) how to sell more and sell faster. I know I sound biased, but this just may be the best sales training you will ever experience, but I invite you to preview my course and judge for yourself.  \t\t\t\t\t\t\t\t\t\t\t\t</p>\n\n\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n</p>\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t                       Thank you and I wish you great success!  \t\t\t\t\t\t\t\t\t\t\t\t\t\t</p>", 
    "end_date": null, 
    "title": "Sales Training: Secrets of a Master Closer - Part 1", 
    "price": "50.00", 
    "instructors": "- Mike Kaplan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67330_086f_9.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-a-master-closer/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-20T18:30:30Z"
}