{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This Course Sales Made Simple is to teach anyone who is in the sales industry or does phone sales. To successfully call on clients cold or hot and get a closing decision. Our methods with include information on how to do it, drills to help you practice your pitch and phone skills. After that you will go into perfecting your script and phone sales and finally end of with mastering closing!</p><p style=\"\">Are you ready to take your Sales to the next Level? Reveal the power of Sales in your business, increase leads, and MAXIMIZE PROFITS!</p><p style=\"\">In this Sales course with UNLIMITED &amp; LIFETIME access you will learn how to drive money into your pockets by using advanced and unseen tactics that allow you to get the FULL ATTENTION your business needs to grow!</p><p style=\"\"><em style=\"\">FULL 30 DAY MONEY BACK GUARANTEE.</em></p><p style=\"\">Sales is a must and most people SUCK at it!</p><p style=\"\">This course is the most comprehensive look at Sales out there, showing you not only how to create a presence but how to take over all the space in your market.</p><p style=\"\">What does this course give you?</p><ul style=\"\"><li style=\"\">FREE Cold Calling and Appointment Setting Scripts</li><li style=\"\">The hints, the tricks and industry tips to allow you to dominate your competition</li><li style=\"\">Step by Step training drills</li><li style=\"\">Generate more revenue for yourself and your business</li><li style=\"\">UNLIMITED and LIFETIME access, come back when ever you need to learn more and we&#039;re always here to answer questions</li></ul><p style=\"\">We go right into it and get you seeing results within 1 WEEK!</p><p style=\"\">This course will take you from social zero to Sales expert where you are literally taking over your industry! This approach is unlike anything you&#039;ve ever seen before. It is without a doubt one of the MOST effective ways to get quick and generate results than any other method on UDEMY!</p><p style=\"\">DON&#039;T FORGET: Udemy operates a 30 day full money back guarantee, no questions asked! If you&#039;re not happy with this course you can request your money back.</p><p style=\"\">Click the &quot;take this course&quot; button straight away at the top right of this page to start DOMINATING!</p><p style=\"\">What are the requirements?</p><ul style=\"\"><li style=\"\">A computer and a phone</li></ul><p style=\"\">What am I going to get from this course?</p><ul style=\"\"><li style=\"\">Proven sales scripts to generate more leads and appointments</li><li style=\"\">Be able to control your income</li><li style=\"\">Build confidence in your closing</li><li style=\"\">Develop skills that will go with you through life!</li></ul><p style=\"\">Who is the target audience?</p><ul style=\"\"><li style=\"\">Those interested in a comprehensive sales education</li><li style=\"\">Those who have a business and want to achieve greater sales results</li><li style=\"\">Business owners, sales people, media students, marketing, PR professionals, customer services teams, HR people</li><li style=\"\">Marketers, business owners, individuals</li></ul><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Sales Made Simple", 
    "price": "30.00", 
    "instructors": "Carlos Redlich, Mike Mcdaniels", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528656_6626_2.jpg", 
    "course_url": "https://www.udemy.com/sales-made-simple/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T15:59:46Z"
}