{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will enable B2B salespeople to craft better sales scripts to schedule more sales appointments with top level decision-makers at their most desired future accounts and with their competitors top clients. Practical step by step instruction by someone that actually did it.</p><p>Starting at the beginning of the sales script creation process this course is a step by step guide to crafting phone scripts that get you more meetings, phone appointments, webinar presentations and demos with qualified prospects. Based upon the book by Scott Channell entitled \"<em>7 Steps to Sales Scripts For B2B Appointment Setting: Creating Cold Calling Phone Scripts</em>.\"</p><p><strong>Reviews of the book this course is based upon</strong></p><p>\"Lots of great ideas that stray away from the traditional training you often get about this matter. I found his ideas on voicemails very insightful. Lots of great take aways...\"<br><br>\"Scott refers to his book as a primer, however, his book goes beyond this by offering time-tested script strategies that work today. He tells us that, and I quote, \"There is one truth. Cold calling stinks. I teach the stuff yet don't love it\". Scott teaches you how to make cold calling a little easier to digest. <br>This may sound obvious - would you rather pick up the phone with confidence or pick it up with your voice cracking and your hand trembling - the answer is simple, buy his book, you won't be disappointed. You'll will also enjoy his light humor sprinkled throughout the book.\"</p>\n\n<p>\"Studied his thoughts and examples of brilliantly written scripts and a system to continually take action. In the week since studying and acting on these ideas, I've been able to get great traction in two F500 firms and one Global 500 firm. I've not gotten these results prior to following Scott's ideas. Just buy and then act on this book!\"<br><br>\"Only book that offered different techniques on cold calling that I will certainly apply. This book reminds you the very short time you have after you hear Hello. How to say the right words and use your words wisely to capture the appointment! Very highly recommend.\"<br><br>\"Good scripting ideas that showcased some of the things I've been doing wrong over the years. I think my staff will benefit and my appointments should increase.\"<br><br>\"Scott Channell knocked it out of the park with this book. All the scripts you would ever need are included. And he has masterful ways to handle questions and objections to getting a sales appointment.\"</p>\n\n<p>\"If you are setting appointments on the phone so that you can make sales presentations, this is the best book I've read, for that specific purpose.</p>\n\n<p>It's obvious that the author really made a couple of thousand appointments on his own. And the techniques are well tested, and they work. I'm already an expert, and I picked up several tips out of the book.\"<br>\"Scott doesn't give you the magic bullet phone script. Instead, he gives you a step by step process to create a winning script that fits you! It doesn't matter what industry you're in because he's proved this system works across all industries. It doesn't matter if you are cold calling or calling warm leads, his system works for that too.<br>This book is great for anyone who makes calls for a living or develops scripts for those that do. I happen to be the latter and will be replacing our phone script system at our 150 year old, Fortune 250 company, with a system developed based on this book for our 3600+ sales force.\"<br><br>\"Using this book, I was able to</p>\n\n<p>-sell myself on the phone and find a good sales job<br>-beat every salespeople's performance during my probation period<br>-secure my position as a new hire and gained the respect of my peers</p>\n\n<p>I am currently on my way to beating the company sales national record.<br>Thanks to Scott, I am on the right track to becoming a successful phone sales professional.\"</p><p>\"If you can't read these scripts, adapt them to your product, and produce appointments, you should hang up the phone and find a different method for prospecting. Scott gives you word-tracks for every situation- lead generation, finding the decision maker, dealing with gatekeepers, getting the appointment and handling objections- its all here. He breaks a script down to its six basic parts, and explains the importance of each one. It also tells you what words and phrases to avoid, and why.<br>I don't prospect by phone much- maybe 20% of the time. But you can bet that when I do, I study these pages first.\"</p><p>\"What I loved about this book is that the author cuts the crap and gets to the point. It respects your time. It is a lean book that guides you step by step from picking up the phone to getting a \"yes, I'm interested in a demonstration\".\"<br><br>\"As a regional sales manager I have applied Scott's approach and can tell you from direct experience that it works. This book is a practical \"how to\" manual for professionals looking for a holistic and proven system to set meetings, in the right companies, with the right contacts. Professionals who use the phone to prospect typically get a few things right. Scott brings all those and more together and then guides the reader step by step on how to build a duplicable process.</p>\n\n<p>Warning: Procrastinators need not apply. Also, readers should check their egos at the door. The author does not sugar coat the fact that gimmicky conventional methods don't work. My team and I learned through application of this work that the author is sharing from direct experience where there are land mines. Bottom line- this book is worth far more than the price for admission.\"</p><p><br></p>", 
    "end_date": null, 
    "title": "Sales Scripts for Appointment Setting B2B Quick-Start", 
    "price": "30.00", 
    "instructors": "Scott Channell", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794342_5eee_5.jpg", 
    "course_url": "https://www.udemy.com/sales-scripts-for-appointment-setting-b2b-quick-start/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T02:38:43Z"
}