{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span>Straight talk about the reality of sales. – It’s not just you.</span>  </p>  <p>  \t<strong style=\"\">Discover How to Get Out of Your Own Way! </strong>  </p>  <p>  \tReal Word – Time Tested – Proven Results  </p>  <p>  \tHave you ever been caught in the Catch -22 of needing to make sales but unable to do the things that need to be done?  </p>  <p>  \tIt Gets Worse!  </p>  <p>  \tNot only do you need to make sales and unable to force yourself to get started… Now you feel guilty about not doing the things you know you need to do!  </p>  <p>  \t<strong style=\"\">The guilt, anger, frustration and fear that builds up…  It just shouldn&#039;t be this hard!</strong>  </p>  <p>  \tIn the past 15 years I’ve shared The Diary of a Wimpy Sales Guy with live audiences and in 1-on-1 conversations. People all over say the same thing…  </p>  <p>  \t<strong style=\"\">“It sounded like you were describing me!”</strong>  </p>  <p>  \tThe point is everybody knows about this stuff BUT no one talks about it.  </p>  <p>  \tWe will be coaching to 5 specific mistakes that I made during my first 10 years in sales…  </p>  <p>  \tMistakes that were made over and over again creating the exact situation I was trying to avoid.  </p>  <p>  \t<strong style=\"\">If you have ever felt uncomfortable with the idea of sales, making a presentation or simply asking someone if they would like to buy what you offer… </strong>  </p>  <p>  \tDiscover the difference that makes the difference.  Learn how to take all the pressure off yourself and start defining realty.  </p>  <p>  \t<strong style=\"\">What separate professionals from everyone else is the willingness to look at ideas, maybe in a different way and the ability to take action.</strong>  </p>", 
    "end_date": null, 
    "title": "Sales - Start Selling on Purpose", 
    "price": "20.00", 
    "instructors": "Bob Marx", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404034_1136_15.jpg", 
    "course_url": "https://www.udemy.com/the-diary-of-a-wimpy-sales-guy/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T03:07:45Z"
}