{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Sales is all about listening to people and prescribing a solution. In every job you'll come across sales moments, whether you're selling yourself in a job interview or selling products to customers - it's an essential skill in all career paths. Sales needn't be slimy, immoral, or complicated - it's simply about getting the best solution for the customer so they are thrilled to buy from you. </p><p>With this course you can maximise your sales potential in just a few minutes - if you're already working in sales, or looking for a lucrative and enjoyable future career, effective selling is a valuable skill that you definitely need to master.<br></p><p>Chris Croft is an international speaker and widely published author, who's been teaching Sales skills to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for home and work.</p><p>This course covers everything you need to know about sales: from preparing and planning, relationship building, objection handling techniques, and closing the deal at a brilliant price. It looks at lots of real life examples (some of which will definitely get you laughing) and gives practical tools you can use right away to get better results.</p><p>Sales Hacking overview includes:</p><ul><li>Planning your toolkit</li><li>Building a rapport and relationship</li><li>Handling objections and hidden excuses</li><li>Creating a foolproof efficiency system for organising your sales</li><li>Simple tricks to raise yourself above 90% of the competition</li><li>Simple phrases that will get you a brilliant closing price</li><li>And lots lots more!</li></ul>", 
    "end_date": null, 
    "title": "Sales Training: Practical Sales Techniques", 
    "price": "20.00", 
    "instructors": "Chris Croft", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563478_2c35.jpg", 
    "course_url": "https://www.udemy.com/master-successful-selling/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T08:15:57Z"
}