{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Job titles don’t matter. Everyone is in sales. It’s the only way we stay in business. – <em style=\"\">Harvey Mackay</em></strong>  </p>  <p style=\"\">  \t    No sales, no business.  It&#039;s the most fundamental fact of commerce.  However, Sales is often one of the most misunderstood and mismanaged aspect of business, despite its obvious and enormous importance.  </p>  <p style=\"\">  \t<strong style=\"\">Every sale has five basic obstacles: no need, no money, no hurry, no desire, no trust. – <em style=\"\">Zig Ziglar</em></strong>  </p>  <p style=\"\">  \t  In this course you will learn basic sales strategies and tactics as well as how sales organizations work. You will learn techniques honed and mastered by companies such as Salesforce, Marketo, Hubspot and modern brands used by Coca Cola, Procter and Gamble and more.  You will learn how a modern sales structure works and the different roles that make it function.  </p>  <p style=\"\">  \t<strong style=\"\">Excellence is not a skill. It’s an attitude. – <em style=\"\">Ralph Marston</em></strong>  </p>  <p style=\"\">  \t  The lectures included in this course are:  </p>  <ul style=\"\">  \t<li style=\"\">Selling Defined</li>  \t<li style=\"\">Customer Profiles</li>  \t<li style=\"\">Sales Funnels</li>  \t<li style=\"\">Nimble Prospecting</li>  \t<li style=\"\">Lead Qualification</li>  \t<li style=\"\">Sales Pitches</li>  \t<li style=\"\">Great Sales Emails</li>  \t<li style=\"\">Outbound Prospecting</li>  </ul>  <p style=\"\">  \t    By the end of this course, you will know how to identify and target your customer, how to write and deliver compelling pitches, how to qualify and how to structure sales funnels.  In short - how the basics of sales works!  </p>  <p style=\"\">  \t<strong style=\"\">Try not to become a person of success, but try to become a person of value. – <em style=\"\">Albert Einstein</em></strong>  </p>  <p style=\"\">  \t  This is a course many startup CEOs will wish they had taken before they started a sales organization - or anyone who wants to be valuable to an organization.  </p>", 
    "end_date": null, 
    "title": "Sales Fundamentals", 
    "price": 0, 
    "instructors": "Jobs University LLC", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387400_7a69_3.jpg", 
    "course_url": "https://www.udemy.com/sales-fundamentals/", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T04:53:47Z"
}