{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>    Scientific Selling</strong> is a sales style best practiced when the item being sold is highly technical, with a high ticket value and where the customer is a technology corporation.  </p>  <p>  \t            The style itself incorporates many principles of science: Data gathering, data analysis, experimentation, skepticism.  <strong>Scientific Selling</strong> builds-upon more generic sales training with this course referring to several famous sales formulae and concepts, with pointers on where to find the original source material.  The subscriber is encouraged to have some of this general knowledge before starting this course.  </p>  <p>  \tAlthough the style is important, this course is more focused on the practical.  It supplies examples and templates as well as generalized advice.  Many topics are covered, but the emphasis is on prospecting as a routine, so that you are always growing your pipeline.  </p>  <p>  \t    This course is for three kinds of people:  </p>  <p>  \t    A. <strong><em>Young graduates</em></strong> with a hard science degree, seeking a career in business development.  </p>  <p>  \t    B. <strong><em>Technology entrepreneurs </em></strong>suddenly responsible for selling without any prior experience.  </p>  <p>  \t    C. Practicing sales and marketing <strong>professionals looking for new ideas</strong>.  </p>  <p>  \t            The course is eleven chapters in slide show format of about a dozen topics each chapter, narrated and also available as pdfs.  Narrated videos in chapters one and two are about six minutes each, but from chapter three forward, they have median times of 12-16 minutes.  Pdfs in the supplemental material will contain live links to material referenced in the videos.   Keep a look out for special supplemental material in some chapters.  </p>  <p>  \t            Two early chapters are presented free of charge.  Please leave me some feedback on the course, telling me something you found valuable.  I aim to bring unique insights and tips in addition to a scientific synthesis of existing sales concepts.  Also please contact me if you are convinced of the potential success of scientific selling in your industry segment, but just do not have the time and want to offload it to a specialist.  I also want to hear from you long-term if you do implement scientific selling yourself and what kind of difference it made to your new customer acquisition figures.  </p>  <p>  \t    Good Hunting!  </p>  <p>  \t    Carol Gebert  </p>", 
    "end_date": null, 
    "title": "Scientific Selling", 
    "price": "20.00", 
    "instructors": "Carol Gebert", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/254702_227e_8.jpg", 
    "course_url": "https://www.udemy.com/scientific-selling/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-02T20:50:50Z"
}