{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">This is a complete lead generation sales process you can use - Nothing is left out of this sales coaching program! - deliver the business building leads to increase closed sales and generate leads using email, internet marketing while increasing your selling communication.</strong></p><p><strong style=\"\">Start closing more sales now.</strong></p><p>Blow past all the BS that your prospects tell every other salesperson...</p><p>Easily identify the people who are open to having a conversation...</p><p>Get them to call you and suggest getting together...</p><p><em style=\"\">Selling is 2 Parts: Finding people to sell &amp; Selling people you find.</em></p><p>At the end of the day - it just doesn&#039;t matter how good of a sales person you are, if you don&#039;t have enough people to sell to.</p><p><strong style=\"\"><em style=\"\">How to Write Emails that Sell </em></strong><strong style=\"\">is designed to help you find and identify those ideal &quot;good fit&quot; sales prospects in a way that takes all the pressure off of you - the salesperson.</strong></p><p><strong style=\"\">Crack the cold email code and stop cold calling for business.</strong></p><p><strong style=\"\">Learn these sales growth, business building secrets. Increase your selling opportunity with these sales coaching ideas.</strong></p><p>Learn this sales growth hack. Business to Business sales and consumer direct sales strategies to generate more closed sales.</p><p><strong style=\"\">START CLOSING MORE SALES! Learn this 1- 2 business building secret.</strong></p><p>Using this simple 2-step lead generating telephone and email sales process, you will blow past all of the BS that your prospects make every other sales person go through. Increase your sales ability to communicate and grow your business. Specific lead generating sales emails and voice mails that grab attention! Grab this income producing sales blueprint and get the sales edge over your competition.</p><p>Master sales and attract more sales leads and customers.</p><p>Sales training and sales coaching has never been this easy to implement in your business until now.</p>", 
    "end_date": null, 
    "title": "Selling by Email - Build Your Business, Close the Deal", 
    "price": "35.00", 
    "instructors": "Bob Marx", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554456_a93a.jpg", 
    "course_url": "https://www.udemy.com/emails-that-sell/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T15:40:00Z"
}