{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course offers time-tested techniques and ideas to make your direct selling job more enjoyable and productive. These useful techniques help you focus on the basic aspects of prospecting and selling and have proven to produce results in some of the greatest sales persons on our planet. <strong class=\"redactor-inline-converted\">The good thing about these techniques are they are easy to learn and once you internalize them, are simple to apply in your day-to-day selling profession.</strong> Remember, selling is no rocket science. Anybody can become a sales superstar by following the methods suggested in these modules repeatedly!\n\n  </p>\n\n<p>The course starts with an introduction to the selling world in the current scenario, reinforces the fact that the direct selling job has traditionally been a stressful one. After this, we move on to learn systematic techniques to help you become a more effective and productive sales person.  You may practice all of them or pick 5-6 techniques best suited for your style of work, product or market place. \n\n  </p>\n\n\n\n<p><strong>We have added three workbooks to supplement your learning experience and lead you to positive action.</strong> The workbooks start with a 10- point questionnaire on finding your present Stress Index – giving you an awareness of how stressful you feel in your present selling job. The next workbook is on developing your own PDCA, which ensures continual growth and course correction. Finally, we have the MAP for you – a specially designed My Action Plan sheet to help you summarize and document the key ideas and techniques learned in this course. \n\n  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course focuses on effectiveness and workable smart tools to help you quickly succeed in your direct selling profession.</strong> You may be able to complete the entire course in an hour or two. However, the techniques being very basic, like our human behaviors, have to be internalized first if you wish to become more effective and substantially increase your income. We urge you to use the workbooks and get on the journey of a continual self-improvement process. \n\n  </p>\n\n\n\n<p>Happy Selling and wishing you shine like Superstar!\n\n  </p>", 
    "end_date": null, 
    "title": "Sell Right: 13 Effective Techniques to Boost your Sales", 
    "price": "20.00", 
    "instructors": "Sam Krishnan", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814290_98fc_3.jpg", 
    "course_url": "https://www.udemy.com/stress-free-selling/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T09:57:30Z"
}