{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>THIS IS THE FASTEST AND EASIEST SALES COURSE THAT YOU'VE COME ACROSS IN YOUR LIFE!</p>  <p><strong>Over </strong>1.500 students <strong>from over</strong> 100 countries <strong>have already started</strong> SELLING MORE <strong>with the </strong>Searching for Excellence Series!! WHY DON'T YOU?</p><p><span></span>This course will change YOUR LIFE and your way of thinking about sales!<br></p>  <p>There is no fluff talk here! I'm going straight and to the point! Period! </p>  <p>YOUR LIFE DEPENDS ON HOW MUCH YOU SELL! Period!</p>  <p>In this course I will provide you with the methodology that will make your sales increase to an unimaginable scale with 4 very easy and uncomplicated single steps! Once you'll learn them and you put them into practice, you'll see how your sales will not be a GOAL, but a NATURAL CONSEQUENCE. You will start selling from MINUTE ONE if you do well you homework.</p>  <p>Can you imagine how many brands and products and services are out there? Do you know that we're exposed to about 5.000 brands DAILY?</p>  <p>Then, how do you expect people to choose your product among so many others?</p>  <p>Why should people spend money on whatever you are selling?</p>  <p>Why should they buy from you and not from the rest?</p>  <p>I’ve been on sales for over 20 years in so many industries from fruits, to computers, industrial chemical products, home appliances, real estate, plastic bags, import/export. You name it! And everything reduces down to this simple steps. </p>  <p>LET ME TELL YOU A SECRET VERY FEW PEOPLE KNOW ABOUT! </p>  <p>THE BEST SELLER IN THE WORLD IS NOT YOU, NOT ME OR ANY BESTSELLING SALES STRATEGIES AUTHOR! </p>  <p>IT’S YOUR CLIENT’S BRAIN!</p>  <p>So, if you want a beautiful home, you have to SELL!</p>  <p>If you want a yacht, you have to SELL! A lot!</p>  <p>If you want a fancy car parked in your garage, you have to SELL!</p>  <p>Whatever is the lifestyle that you’re living, chances are that you’ll most probably want to improve it to have a relaxed and joyful life with a healthy and happy family.</p>  <p>But the only way to get that is by SELLING and selling as much as you humanly can!</p>  <p>Think about how many things you could start selling and thanks to this course. What do you need and what do you want or desire in your life?</p>  <p>Join me in this course and you’ll end up asking yourself why you didn’t learn all this long time ago!</p>  <p>Your next big sale will be much closer than what you think and your investment in this course will be much worth it!!</p>  <p>You know that you also have your 30 day money back guarantee, so don’t waste time and JOIN NOW!</p>  <p>I’m waiting for you inside the course! See ya!</p>", 
    "end_date": null, 
    "title": "Sell, Sell, Sold!  Selling Made Easy in 4 Steps! SSS-101", 
    "price": "50.00", 
    "instructors": "Magneter Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673944_b243.jpg", 
    "course_url": "https://www.udemy.com/sell-sell-sold-fastest-selling-course-ever-in-4-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T01:12:38Z"
}