{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Através desse curso você vai adquirir ferramentas para no mínimo dobrar as suas vendas nos próximos 30 dias, seja qual for a área que você atua.</p><p>A decisão de comprar é extremamente influenciada pelo emocional de quem compra, portanto aprenderemos a usar técnicas de Inteligência Emocional, Psicologia e Neuro-Ciências para conduzir o processo de vendas de modo a ter melhores resultados.</p><p>Vamos aprender a ajustar o nosso estado emocional para otimizar vendas, e como conduzir o processo com o cliente de modo a criar empatia e conexões que facilitem a decisão de compra.</p><p>Ele é dividio em 5 Seções:</p><p><strong>1 - O Que Mudou Em Vendas E Qual o Perfil do Novo Campeão de Vendas</strong></p><p>Uma visão geral do que mudou e o que é necessário agora para vender de maneira eficaz. Vamos ver que o poder hoje está na mão dos compradores, portanto as técnicas que usamos, tanto para vendas presenciais como online, precisam refletir essa mudança.</p><p><strong>2 - Mude a Sua Mentalidade e Mude o Seu Resultado</strong><br>Eficácia em vendas começa com o seu estado emocional e a sua motivação, e elas são determindas pela sua mentalidade - a maneira como você interpreta todas as coisas.</p><p>Essa sessão mostra como podemos detectar mentalidades nocivas e adotar mentalidades que formarão o alicerce para sermos campeões de vendas. Vamos aprender a usar Inteligência Emocional e técnicas desenvolvidas usando as últimas descobertas da Neurociência para termos melhores resultados. Vamos aprender a vencer bloqueios emocionais e como se livrar do sentimento de rejeição quando ouvimos um não. </p><p>Vamos também aprender a organizar o nosso dia de modo a termos mais resultados, e como gastar os primeiros minutos para se preparar para um dia super-produtivo.</p><p><strong>3 - Preparando-se Para Um Dia de Grandes Resultados</strong></p><p>Quando você acorda, existe um processo de reinciação de partes do seu cérebro, parecido com o que acontece com computadores. É nesse momento que podemos \"sintonizar\" nossa mente com as nossas prioridades.</p><p>Nessa seção vamos aprender um sistema de gestão de tempo que vai no mínimo dobrar a sua produtividade no dia, chamado de Micro Gestão de Tempo. É extremamente simples e pode ser colocado em prática em imediatamente.</p><p><strong>4 - Vendendo com Inteligência</strong></p><p>Uma vez que o seu emocional está \"afinado\" e preparado, podemos então usar as técnicas que aprenderemos para criar conexões com clientes e para argumentar de forma a abrir o caminho para o fechamento do negócio.</p><p>A combinação dessas ferramentas permitirá que você alcance um novo patamar em vendas e tenha resultados surpreendentes.</p><p><strong>5 - Vendendo com Eficácia</strong></p><p>Nessa seção vamos aprender a usar duas técnicas poderosas para vendas de qualquer tipo: a metodologia AIDA e a criação e uso de Micro Scripts. </p><p>Nesse ponto do curso você terá em mãos tudo o que precisa: Uma mente sintonizada e otimizada para resultados, um método de estabelecimento de alvos que realmente funciona, um sistema inigualável de gestão de tempo, técnicas de conexão com o cliente que são simples mas que usam o que há de mais sofisticado em neurociências, e um método criado pelos melhores profissionais de vendas no mundo para atrair e manter a atenção do cliente, gerar o desejo da aquisição e conduzir ao fechamento da venda.</p>", 
    "end_date": null, 
    "title": "Sem Medo, Sem Crise e Vendendo Como Nunca!", 
    "price": "20.00", 
    "instructors": "Marcos Barros", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733184_130d_4.jpg", 
    "course_url": "https://www.udemy.com/sem-medo-sem-crise-e-vendendo-como-nunca/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T19:40:02Z"
}