{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t There’s a saying:  Until you sell something, you don’t make money.  As true as this statement is, there’s another thing that all sales people know:  The best way to make money is to keep your customers satisfied, so they continue to buy from you.  </p>  <p>  \t<strong><em>Servant Salesmanship </em></strong><strong></strong>will provide students with a solid understanding of the process of selling.  Beginning with understanding what business you are really in, and why people buy from you, to developing a sales process, <strong><em>Servant Salesmanship</em></strong> imparts the art of serving, rather than selling, your customers.  We’ll teach you that the key to building strong customer relationships is to build profit generating partnerships with your customers.  <strong><em>Servant Salesmanship</em></strong> will teach you how to ask for the order with the primary motive of benefiting the customer.  </p>  <p>  \t<strong></strong>  </p>  <p>  \t    This course is divided into eight sessions.  The first session, <strong>Introduction</strong>, is designed to explain who can benefit by taking this course, and how you can use the material to enhance sales in your business  </p>  <p>  \t<strong>Session Two,</strong> <strong>Until You Sell Something, You Don’t Make Money</strong> introduces key concepts about selling.  In this session, we focus on serving customers.  When you do so, you will sell them your services – and enter into a mutual profit generating partnership.  </p>  <p>  \t<strong>Session Three,</strong><strong>Understanding the Needs of Our Customers.  </strong>In this session, we want to dig into a specific company in the book publishing industry, and answer two questions:  First, what business are they really in?  Second, why do their customers buy from them – instead of from someone else?  .  </p>  <p>  \t<strong>Session Four,</strong> <strong>Prospecting:</strong> <strong>Looking for Opportunities to Serve Someone</strong>, reveals key information about your chosen company for you to compare to what you were able to discover in the previous session.  Knowing these things will helps us as we prospect for potential customers whom we can serve with what we sell.  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong>Session Five,</strong> <strong>Planning Your Sales Strategy</strong>, examines the difference between Selling and Serving, as well as how to use a Customer Relationship Management software database.  You’ll learn how to create a sales process roadmap that allows you to journey with your potential customer to the destination of having a satisfied client.  </p>  <p>  \t<strong>Session Six, What Motivates a Customer to Buy</strong>, looks at methods for speaking with three types of buyers:  The Conscious Buyer, the Unconscious Buyer, and the Preconscious Buyer.  </p>  <p>  \t<strong>Session Seven</strong>, <strong>Planning on Closing the Sale</strong>, shows you the customer’s three basic buying criteria.  First, does the product do what it promises to do?  Second, the value I receive from purchasing it equal to or greater than the price being charged?  Third, what sort of service will I receive over the life of the product or service?  In this session, we’ll explore these issues so we can better understand how to serve our customers.  </p>  <p>  \t<strong>Session 8</strong>, <strong>Next Steps,</strong> summarizes what has been learned in this course, and preview additional courses in the series available from Generation Self Employed.  </p>", 
    "end_date": null, 
    "title": "Servant Salesmanship", 
    "price": "25.00", 
    "instructors": "David Lantz", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/102052_918d_5.jpg", 
    "course_url": "https://www.udemy.com/servant-salesmanship/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-06T02:20:44Z"
}