{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Newly Released February 2016!</strong><br></p><p><strong><br></strong></p><p><strong>Do YOU want to be a Sales Superhero?</strong><br></p><p><strong>Well, this is the course you've been waiting for!</strong></p><ul><li><strong>Win more customers and keep them!</strong></li><li><strong>Learn what <em>really </em>works in sales!</strong></li><li><strong>Use simple techniques to close the deal!</strong></li></ul><p><strong></strong></p><p>Simple Sales for Superheroes is the first in a series of professional training courses developed for the modern sales person, business owners, tradesmen, and anyone new to sales and marketing.</p><p>Our course is designed for you to dip in and out, taking note of whichever tips apply to you at defined stages in the sales, marketing and account management process. Our modules are intended to be easily digestible, friendly, humorous and deeply informative, and are based on the real-life experiences of two highly respected and high achieving global professionals.</p><p>The course is structured into five sections: </p><ol><li><strong>Developing a Superhero Mindset<br></strong></li><li><strong>Marketing for Superheroes<br></strong></li><li><strong>Managing The Sales Process<br></strong></li><li><strong>Account Management<br></strong></li><li><strong>Tips on Improving Your Powers</strong></li></ol><p><strong><strong></strong></strong></p><p>Each lecture includes a professional video featuring a set of powerful tips and techniques, and is accompanied by a workbook which will help you develop our ideas in your own time and apply them to your business or place of work.</p><p>Using our course you will hone your sales powers, attract more long-term customers and dramatically increase your income.</p><p>But don't just take our word for it. Here's what some existing sales superheroes are saying about our course:</p><p><br></p><p><em><strong>\"I have to say this is one of the best sales guides that I have read. It's informative and full of excellent tips for anyone new to sales and marketing. The information is well laid out and easy to understand. I thoroughly enjoyed the course and recommend it to anyone who wants to further their sales career\".</strong></em></p><p><em><strong></strong></em>Peter, Head of Sales, Global Telecommunications company</p><p><br></p><p><em><strong>\"Steve and Nadeem have produced a work of common sense that will be invaluable to professional sales people at any stage of their career, from the junior to well-established. Their tips and techniques make sense because they have been there, done it, and got the t-shirt. I recommend the course if you want to earn more money and achieve a sustainable sales career\".</strong></em></p><p>Jason, International Sales Director, Utilities company </p><p><br></p><p><strong><em>\"One of the biggest challenges in sales is collecting and sorting through the mounds of \"tips\" and other good advice that are so common in sales know-how. There is a lot of information available on the internet. Here the work has been done the for us, the knowledge has been collated, sorted and put it into process that will keep you on track. This course is an excellent resource to people working in the sales industry as well as students. I would recommend it to anybody\".</em></strong></p><p>Beate, Sales Co-Ordinator, Pharmaceutical company</p><p><br></p><p><strong><em>\"At last! A simple sales guide that I can really get my claws into!\"</em></strong></p><p>Tigerman, Superhero</p><p><br></p><p><strong><em>\"If everyone memorises these 352 incredible tips and techniques I could be out of business!\"</em></strong></p><p>Memoryman, Superhero</p><p><br></p><p><strong><em>\"I'm going to take this course and then eat it!\"</em></strong></p><p>Fatman, Superhero</p><p><br></p><p><strong>YOU can be be that Sales Superhero! </strong></p><p><strong><br></strong></p><p><strong>Enrol now and start to save your world!</strong></p><p>  <br></p>", 
    "end_date": null, 
    "title": "Simple Sales for Superheroes", 
    "price": "20.00", 
    "instructors": "Steve Pinkney", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759614_46c2_2.jpg", 
    "course_url": "https://www.udemy.com/simple-sales-for-superheroes/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T13:34:31Z"
}