{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Getting people to buy something is hard. So many things can happen in a customer's mind that factor into the purchase decision. This course turns to solid scientific research in psychology to uncover tricks and hacks you can use to increase sales by massaging one fundamental element: <em>the price</em>.<br></p><p><strong>What You'll Learn</strong></p><p>In this course we consider <strong>six major strategies </strong>you can use to your marketing pursuits by using real data from price psychology. Within each one are many individual things that make prices more appealing, totaling <strong>more than 30 psychological price effects </strong>that will strengthen your offline and online marketing campaigns.</p><ol><li><strong>Picking the Right Price:</strong> How to choose the number that will appeal most to consumers without changing your profit level.</li><li><strong>Presenting Your Price: </strong>How to write and say your price in the most appealing ways possible.</li><li><strong>Framing Your Price: </strong>How to communicate your price more effectively once the price is set.</li><li><strong>Using Context to Your Advantage: </strong>How to present differently priced products <em>together</em> in ways that maximize profits.</li><li><strong>Smart Discounting Practices:</strong> How to present your promotions in ways that make the deal irresistible.</li><li><strong>Handling Extra Charges</strong><strong>:</strong> How to most effectively present your prices when there are unavoidable additional fees to communicate.</li></ol><p>As a bonus, I also include a full <strong>PDF notes</strong> document that summarizes all the major techniques we go over because when you are designing your marketing and advertising strategies, you don't always have time to review a full <em>3 hour</em> video course.</p><p><strong>Why Learn From Me?</strong><br></p><p>As an award-winning psychology instructor, I have experience translating research in the field and presenting it in an <em>engaging</em>, <em>understandable</em><em> </em>way. My students routinely evaluate my courses highly and comment on the <em>passion</em><em> </em>I have for social psychology. I hope you can join this group of satisfied students and learn something new about yourself and psychology.</p><p>So <strong>take this course</strong> now and understand the science of pricing and what it can do for your business and marketing efforts!</p>", 
    "end_date": null, 
    "title": "Smart Marketing with Price Psychology", 
    "price": "35.00", 
    "instructors": "Andrew Luttrell", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519050_51c3_5.jpg", 
    "course_url": "https://www.udemy.com/price-psychology-online-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T12:34:13Z"
}