{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    The <strong>Social Prospecting Blueprint</strong> is a step-by-step video course that allows B2B entrepreneurs, small business owners and sales professionals to utilize social media to effectively find, target, interact and build relationships with the key stakeholders that they need to be in touch with in order to generate new business or grow existing business.  </p>  <p>  \t    Social media provides the perfect ground for collecting the intelligence necessary to find the find the decision-makers, learn about them and create an introduction that effectively kills cold calling and allows you to position yourself at a higher perceived value, since you&#039;re beginning on a relationship basis.  </p>  <p>  \t This course overcomes the traditional challenges faced with social media, namely time constraints, challenges with content and lack of strategy. Armed with this blueprint, your efforts will be quick, effective, focused and repeatable in generating new prospects, leads and business via social media.  </p>  <p>  \t    This training material has been used in group coaching settings with <a href=\"http://youtu.be/LMzTywCbyxk\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">outstanding results to show for</a> and should take approximately 4 to 6 weeks to complete.  </p>  <p>  \t   The course is comprised of video tutorials (over 8 hours of total instruction, with each video no more than 20 minutes in length) and each course section is capped off with an actionable downloadable PDF that will contain action steps or exercises to put what was taught into practice.  </p>", 
    "end_date": null, 
    "title": "Social Prospecting Blueprint - B2B Social Selling System", 
    "price": "50.00", 
    "instructors": "Tony Zayas", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65276_da1b_4.jpg", 
    "course_url": "https://www.udemy.com/socialprospectingblueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-13T15:41:49Z"
}