{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Are you tired of trying to sell products or services only to find customers are dissatisfied? Or clients leave negative reviews? Are you finding that selling your product or service has become pushy?</p><p>Its time for Solution Based Selling. Solution Based Selling delves into what makes people buy. Understanding why people buy will help you understand how to uncover the real needs why people buy (hint: it has to do with emotions)</p><p>Once you understand the real reasons clients are looking for solutions, you become a Trusted Advisor, an advisor who wants to serve clients instead of just trying to sell them.</p><p>You will learn:</p><ul><li>The Entrepreneurial Mindset</li><li>The difference between benefit based selling and solution based selling</li><li>Why people buy and their real motives behind buying decisions</li><li>Why selling is the last thing you want to do, and why serving your clients is so much more profitable</li><li>Why its easier not to sell if there is no fit for the client (this will lead to even more sales if done correctly!)</li><li>How to become a Trusted Advisor and the mindset of a Trusted Advisor</li></ul><p>Start your training now and learn how to become a master at sales and have clients rave about your skills and refer even more business to you</p><p><br></p>", 
    "end_date": null, 
    "title": "Solution Based Selling - Why The Game of Selling has Changed", 
    "price": "35.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641204_8353_2.jpg", 
    "course_url": "https://www.udemy.com/solution-based-selling/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T09:11:24Z"
}