{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Launched 11/18/15!!</p><p><strong>THIS IS AND WILL BE THE BEST BRANDING, MARKETING AND SALES COURSE IN THE INTERNET!!</strong></p><p><strong>Over </strong>1.400 students <strong>from over</strong> 100 countries <strong>have already started </strong>SELLING MORE<strong> with the </strong>Searching for Excellence Series!! <strong>WHY DON'T YOU?</strong></p><p><strong>Look at what they say about this course!</strong></p><p>\"Looking forward to the next course<br></p><p>This course is an introduction to a series on branding strategy. I had not heard of the magneter model before. Thus far, the manner in which the information has been presented seems innovative and not a rehash of the usual branding training. I look forward to the next in the series. Instructor is engaging and seems to be an expert on the topic.\"</p><p><strong></strong></p><p><strong></strong><strong>Most companies, about 90% of them, die</strong> BEFORE 5 YEARS <strong>because they can’t handle it anymore and they’ve</strong> LOST CONTROL <strong>of their business.</strong> 80% <strong>of the</strong> SME’s <strong>die even before the</strong> SECOND YEAR <strong>ends</strong>.</p>  <p><strong>That’s because most of them </strong>WERE NOT PREPARED<strong> to what was coming: the </strong>UNAVOIDABLE AND FRENETIC CHANGES OF LIFE <strong>that technology and civilization forced them to</strong> ADAPT<strong> to survive, </strong>OR <strong>dramatically </strong>DIE.</p>  <p><strong>The vast majority\nstart without an</strong> STRATEGIC PLAN <strong>or no plan at all. They just </strong>DON’T SET ANY\nGOALS, <strong>they </strong>LACK OF VISION <strong>to head anywhere and start running in </strong>THE MARATHON <strong>of\ntheir lives without previous training. </strong><strong></strong> </p>  <p><strong>Suddenly they find themselves fighting against all odds, tired, with </strong>ZERO RESOURCES <strong>and with the same</strong> LACK OF VISION AND MOTIVATION <strong>to continue.</strong></p>  <p><strong>Don’t let\nthat happen to</strong> YOUR BRAND <strong>and to</strong> YOUR LIFE. <strong>We’ve got</strong> LIMITED TIME IN LIFE <strong>and\nwe must take good care about how we should spend it, because </strong>TIME <strong>is the</strong> ULTIMATE\nLUXURY<strong>, since in the absence of Time, nothing else matters.</strong><strong></strong></p>  <p><strong>So if you want to be able to adapt in order to </strong>SURVIVE, <strong>you </strong>MUST <strong>take </strong>FULL CONTROL <strong>of your brand </strong>TODAY<strong>. You must be able to see your</strong> FULL BUSINESS<strong> in a global perspective and get </strong>INTO THE DETAIL <strong>anytime you want to make the precise corrections so that </strong>THE MECHANISM <strong>keeps working at the right pace and keeps providing a</strong> POSITIVE RETURN <strong>that you reinvest in making it</strong> GROW BIGGER.</p>  <p>IT’S AS SIMPLE AS THAT!</p>  <p><strong>The complicated part is not </strong>THE WHAT <strong>you should do. The complicated part is</strong> THE HOW.</p>  <p><strong>In the </strong>SEARCHING FOR EXCELLENCE SERIES <strong>I will tell you </strong>THE HOW <strong>you can get the </strong>BROADER PICTURE <strong>and the</strong> CONTROL <strong>of each one of your touch points, no matter how big is </strong>YOUR BRAND. <strong>As long as you have total control of all your touch points, your brand </strong>WILL BE STRONG.</p>  <p><strong>In this course I’ll introduce you how to get the</strong> BROADER PICTURE. <strong>Without it, you won’t be able to know where </strong>TO FOCUS <strong>and where is your business</strong> FAILING <strong>or is</strong> CORRECT.</p>", 
    "end_date": null, 
    "title": "Start Selling Big by Building a Strong Brand - S4E 201", 
    "price": "50.00", 
    "instructors": "Magneter Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655072_0bea_7.jpg", 
    "course_url": "https://www.udemy.com/start-selling-big-by-building-a-strong-brand-s4e-201/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T23:54:01Z"
}