{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>**This course is updated and will work in 2016**</p>  <p>  \t         In this course, we will teach and demonstrate:  </p>  <ul>  \t<li> How to rank on the first page of Google using Youtube videos</li>  \t<li> How to consistently drive sales using Youtube</li>  </ul>  <p>  \t         ... basically how to setup your very own sales machines that work to bring you sales 24 hours a day, seven days a week, or your money back.  </p>  <p>  \t         Today, you can start to make videos with YouTube, with no outlay whatsoever - and with ZERO prior experience!  </p>  <p>  \t         See, Google owns Youtube, and I'm telling you :Google is working hard to rank videos on top of pages, and this could mean YOURS.  </p>  <p>  \t<em><strong>We have thaught over 11,000 students the ropes of internet marketing, and now we are once again over-delivering, so enjoy the ride !</strong></em>  </p>  <p>  \t         You will need no cameras or any equipment -  We'll show you how you can either record your screen to produce a video, or easily create free professional explainer videos that convert like crazy (the same type as our promo video).  </p>  <p>  \t         Based on our huge successes, we have streamlined the process into one information-packed step-by-step guide !  </p>  <p>  \t         We will also show you how to optimize your Youtube Channel (free!) in no time, to further increase your results.  </p>  <p>  \t         I stress that you need no prior experience and that yes, you will learn to rank on page one overnight.  </p>  <p>  \t         You are going to learn :  </p>  <ol>  \t<li> How to quickly create amazing videos, in five minutes.</li>  \t<li> The right way to use descriptions to get your video to rank through the roof</li>  \t<li> How to use tags to show up on youtube's sidebar, and acquire insane amounts of views.</li>  \t<li> How to make sure your viewers turn into buyers.</li>  </ol>  <p>  \t         ... and much, much more!  </p>  <p>  \t         So, you've read this far! Thank you.  </p>  <p>  \t        Reading time is up, now is <strong>time to take action.</strong>  </p>  <p>  \t        This course comes with an unbreakable 30-days money back guarantee. We know you will succeed, and want you to take absolutely no risk !  </p>  <p>  \t         You can start ranking videos and driving sales as soon as you have taken this course, that means today !  </p>  <p>  \t        Click the \"take this course\" button, top right, now ... every minute without action is one less sale.  </p>  <p>  \t         To Your Success,  </p>  <p>  \t         Howard Lynch &amp; Antoine Lelievre  </p>", 
    "end_date": null, 
    "title": "Strategic Ways to Build Your Business with YouTube", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417284_1cf4_6.jpg", 
    "course_url": "https://www.udemy.com/strategic-ways-to-build-your-business-with-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T13:21:25Z"
}