{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>The Ask Without Fear!® Fundraising System<br></strong>If your board members (or you!) are afraid, it can be frustrating to know you could be raising more money, but aren't!</p><p>You're not alone.</p><p>Marc A. Pitman travels around the globe, helping nonprofit boards and teams get over their fears about fundraising.</p><p>Marc demystifies the fundraising process. He shows how even volunteers can have fun in the process of fundraising!</p><p><strong>Now that training is available in this convenient course!<br></strong>Marc's gone into the studio to condense his training onto video you can share with your board or team. Broken up into short \"question and answer\" segments, you can watch this straight through in one sitting, or just a little bit at a time.</p><p>By the time your board members have finished watching they'll be saying \"I can do that!\"</p><p>Marc also shares some great strategies to help you as well</p><ul><li><strong>How to overcome donor objections</strong><br>One part of the video you'll definitely want to watch is on overcoming donor objections. Marc details how to have answers for your donor's objections. It's easier than you think!</li><li><span></span><strong>How to get bigger donations from your current donors </strong><br>In the section on \"Upgrading Your Donors,\" Marc shows you how to get bigger donations from the donors you currently have without any other work. You can use these techniques immediately!<br><br>Just watching this little section will end up paying for this DVD set many times over. In fact if you don't watch this section, you're losing some larger donations.</li></ul><p><strong>The tools you'll need</strong><br>Marc also provides you with \"Done for You\" resources and samples. Need a prospect rating tool for your board? A pledge form? They're here in the resources. Just print it out. It's that easy.</p><p><strong></strong></p><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Successful Nonprofit Fundraising for Board Members & Staff", 
    "price": "50.00", 
    "instructors": "Marc Pitman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645152_08e8_8.jpg", 
    "course_url": "https://www.udemy.com/ask-without-fear/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T20:31:56Z"
}