{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\"><strong style=\"\">Welcome To Success In Sales Course</strong></span>  </p>  <p style=\"\">  \t<span style=\"\">Selling is the most basic and fundamental skill required to be a successful entrepreneur. Success in sales however and building that million dollar book of business has more to do with your philosophy as a person than your ability to sell. It is these philosophical ideas in addition to the right attitude and the right action steps that lead to great success in sales. These are the things that this course teaches.</span>  </p>  <p style=\"\">  \t            Our sales business can be compared to a sail boat. It’s not the blowing of the wind that determines our destination.  </p>  <p style=\"\">  \t            It is the set of our sail that determines our destination.  </p>  <p style=\"\">  \t            You must realize that the same life wind, blows on us all; the wind of opportunity, the wind of difficulties, the wind of expansion, and the wind of recession and an ancient script says: there is a set time for everything under the face of the earth. However it is the set of your sail that will determine where you arrive in 3years or 5years in your sales business. This course was developed to help you set a better sail for your sales future, correcting the errors of the past and establishing the correct thinking pattern to take you to your Eldorado –Whatever that represents for you.<br style=\"\">  \t        ------------------------------------<br style=\"\">  \t<em style=\"\"> <strong style=\"\">Success in Sales - Join this course NOW!</strong></em>  </p>  <p style=\"\">  \t<em style=\"\">------------------------------------</em>  </p>", 
    "end_date": null, 
    "title": "Success in sales: Building your book of business ", 
    "price": "20.00", 
    "instructors": "Osamede Arhunmwunde", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383374_4e50_3.jpg", 
    "course_url": "https://www.udemy.com/success-in-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T19:50:19Z"
}