{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Superação…</p><p>Seja sempre positivo, mas saiba que primeiro você precisa encontrar o problema para depois oferecer a solução, vaamos então… primeiro falar dos problemas…<strong> O mundo e o mercado passam por crises constantes, que podem demorar semanas ou até mesmo alguns anos, mas são neste momentos que você deve fazer a diferença!</strong> Na instabilidade você precisa de muita firmeza e autocontrole, mas é exatamente neste momento de crise que as pessoas entram em desepero e se descontrolam. As crises não são um “privilégio” do Brasil, mas é um problema universal, tudo têm altos e baixos, a vida não é um linha reta, mas um traçado cheio de curvas, algumas vezes para cima, outras para baixo. Isso é algo que sempre existiu e nunca vai mudar, talvez você tenha tido a sorte de nunca ter enfretado um momento difícil, mas isso pode mudar a qualquer momento. E não estamos passando por uma fase difícil só agora, iremos passar também no futuro, isso é tão certo quanto o céu é azul.</p><p>Neste momento de dificuldade você deve respirar fundo e agir rápido, não pode esperar o terremoto destruir sua casa, deve construir bases sólidas para aguentar qualquer movimento traiçoeiro, ou seja, <strong>você deve estar preparado e ainda pronto para tomar decisões difíceis</strong> em tempo recorde. Desde cortar custos até mudar o 100% o foco da sua vida, da sua profissão ou da sua empresa. Você deve estar sempre preparado, no seu passado, presente e futuro. Atitudes que vão mudar você, sua família e seus coloegas de trabalho, mas que são medidas passageiras, até o vento voltar a soprar a seu favor.</p><p>Durante todos estes anos vi muitos cairem, mas sempre estive de pé, e o melhor, com um sorriso no rosto, por que <strong>enfrentar os problemas não é só uma questão de atitudes profissionais, mas também é uma questão emocional</strong>, é saber lidar com os problemas sem se afetar ou as pessoas ao seu redor. E ao invés de se lamentar, preferiu estudar as possibilidades e ver qual era o melhor caminho a tomar. E exatamente o que você vai aprender, a dominar seus medos e fazer acontecer neste complexo setor.</p>", 
    "end_date": null, 
    "title": "Superação e Gestão de Crise", 
    "price": "50.00", 
    "instructors": "Roberto Pantoja", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/734570_8928_2.jpg", 
    "course_url": "https://www.udemy.com/curso-dobre-suas-vendas-gestao-de-crise/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T19:42:38Z"
}