{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Join over 300 people who are finding SOLUTIONS to their fear of rejection, call reluctance, lack of appointments and their prospects' objections.</strong>  </p>    <p>  \t<em>\"I wanted to personally thank you for the positive impact you have made on my sales career. I have received a promotion, earned President's Club in my company, and increased my income 40%...\"</em>  </p>  <p>  \t                                                                    -Randy Hansen, Regional Sales Manager, HD SUPPLY Facilities Maintenance  </p>  <p>  \t                                                           This is one of the many testimonials I have received over the years from people who have participated in my sales seminars, workshops and programs.  And I tell them all the same thing: There are no magic formulas!  </p>  <p>  \t                                                                     After 41 years in sales I can tell you the single, biggest reason salespeople don't do enough business is: THEY DON'T TALK TO ENOUGH PEOPLE!  </p>  <p>  \t                                                                             Selling is rejection, plain and simple.  The top salespeople can deal with it, the rest can't.  Ask any sales VP or sales manager and they'll all tell you the same thing.  The biggest reason their salespeople do not bring in enough business is that they don't make enough calls, sell enough appointments and see enough people.  They don't see enough people because they fear rejection.  They fear rejection because they don't know how much rejection they need.  </p>  <p>  \t                                                                             I don't care how great your product or service is; how polished your presentation is; and I certainly don't care how many books you've read or Udemy courses you've taken: <strong>If you're not getting in front of prospects every day to tell your story, none of that matters.  </strong>  </p>  <p>  \t                                                                             This is exactly why I developed “Supercharged Prospecting.\" To help every salesperson who takes this course:  </p>  <ul>  \t<li>Eliminate the fear of rejection</li>  \t<li>Learn how to control the phone conversation</li>  \t<li>Easily handle and turn around objections, and, naturally….</li>  \t<li>Sell more appointments, get in front of FAR more people and close more sales!</li>  </ul>    <p>  \t                                                                             In \"Supercharged Prospecting,\" we're going to cover five important areas of prospecting.  </p>  <ul>  \t<li>Why prospecting, and generating consistent, every day activity, is so important.</li>  \t<li>How to handle rejection by understanding how much rejection you need.</li>  \t<li>How to prepare for and make the prospecting call, </li>  \t<li>How to anticipate, handle and turn around objections, and</li>  \t<li>EASY to implement practice techniques guaranteed to work like a charm</li>  </ul>                                                             \"Supercharged Prospecting,\" consists of:  <ul>  \t<li>Eleven (11) video lectures delivered to you over 70+ minutes.</li>  \t<li>The video contains Power Point support and, as an added bonus, </li>  \t<li>You will receive a 28 page PDF workbook/note taking guide that will include the world's most user-friendly call counting system that will allow you to calculate your success ratios so you know exactly how many “No's\" you'll need to get to “Yes.\"</li>  </ul>  <p>  \t                                 This system is so EASY to implement, You will have no excuse NOT to use it.  </p>    <p>  \t<em>              My personal guarantee: If you do what I tell you to do in this program every day; </em><strong>your sales will increase and so will your income!  </strong>  </p>    <p>  \t                                                                           So register for Supercharged Prospecting today and get started on the road to Sales Success and Financial Independence.  </p>", 
    "end_date": null, 
    "title": "Supercharged Prospecting", 
    "price": "45.00", 
    "instructors": "Warren Greshes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274550_27f9_2.jpg", 
    "course_url": "https://www.udemy.com/supercharged-prospecting/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T15:14:41Z"
}