{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                Over 700 students have already enrolled and are committed to their success in 2015!  </p>\n\n<p>  \t                Are you ready for SUCCESS in 2016? Are you fed up of working yourself to the bone and not seeing results?  </p>\n\n<p>  \t                Are you eager to become the confident, successful salesperson you believe you can be?  </p>\n\n<p>  \t                Make a new start this year. Learn the secret, <strong>psychological sale</strong><strong>s</strong> techniques used by the top-earning telephone account managers in this phone sales training course.</p>\n\n<p>  \t                This course is for you if you want a career in account management, sales, telesales, telemarketing or even customer services.  </p>\n\n<p>  \t      If your work on the phone most of the day, this course will teach you how to create effective relationships with new clients and existing customers and help you smash those targets.  </p>\n\n<p>People with strong sales skills are always in demand and this phone sales training course teaches you the basics and much more.</p>\n\n<p>  \t                In this course, you will learn:  </p>\n\n<ul>  \t<li>The right way to talk to people so they want to buy from you.</li>  \t<li>How to open and close a sales call</li>  \t<li>How to cold call without the fear!</li>  \t<li>How to recognise buying signals</li>  \t<li>How to overcome objections and gain trust</li>  \t<li>The <strong>secret sales tips</strong> used by the top salespeople</li>  \t<li>The 'no-brainer' sales tip that helped me triple my sales and smash my targets</li>  </ul>\n\n<p>  \t      ...and much much more!  </p>\n\n<p>  \t                It doesn't matter if you are an existing account manager who is struggling to meet your targets, or if you want to break into the lucrative field of telephone account management, this course can help you.  </p>\n\n<p>  \t          Even if you don't sell on the phone, these sales secrets will benefit <strong>ANY</strong> sales person.  </p>\n\n<p>  \t               As a bonus for enrolling on this course, you will receive a FREE <strong>Psychological Sales </strong>Secrets Ebook containing sales secrets used by the most successful online marketers.  </p>\n\n<p>  \t                This course includes a discussion forum where you can share sales tips with other students and you also get the opportunity to ask me questions!  </p>\n\n<p>  \t                I am here to support you. I've been in sales for almost 20 years, 6 of them as an Account Manager, so I know what I'm talking about! I want <strong>you</strong> to be successful too.  </p>\n\n<p>  \t                The course comes with a certificate of completion, which you can put on your CV to show potential employers.  </p>\n\n<p>  \t                This course has an unconditional 30 day money back guarantee, so there is ZERO risk to enrolling in this course!  </p>\n\n<p>  \t    So what have you got to lose? Enrol today and take the first steps to an exciting new career.  </p>", 
    "end_date": null, 
    "title": "Telephone Sales Training Certification", 
    "price": "20.00", 
    "instructors": "Business Divas Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362494_d89c_3.jpg", 
    "course_url": "https://www.udemy.com/phone-sales-success-make-more-sales-earn-more-commission/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T19:40:50Z"
}