{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Are you ready to learn the art of selling high priced events or offerings via the phone? Do you want to have eager prospects wanting to hear more about your offerings and willing to pay you large sums of money to guide and assist them?</p><p>In this concise, hard-hitting course, you will learn the how to handle qualified prospects on the phone. You are about to discover why speaking to unqualified prospects will cause you headaches and why these calls are a waste of time. Its more important to qualify prospects before even getting on the phone.</p><p>You will discover how to set the scene before the actual phone call starts and why it is imperative to do so to ensure you are in control of the call at all times.</p><p>Establish the reason for the call upfront and learn the exact questions to ask your prospect so you can get to the root of the problem and why they are actually on the call with you. Learn how to dig deep and build immediate rapport and trust with your prospect.</p><p>You will discover the steps to get the prospect to come up with solutions for themselves, and how to get them to enquire about your solution (if there is a fit)</p><p>Finally, you will know exactly how to get prospects to become raving clients, and know how to ask for them to pay for your high priced services, products or events.</p><p>Take this course today and start selling high priced events (or pretty much anything)</p><p>This course comes with a 30 day money back guarantee so start today</p>", 
    "end_date": null, 
    "title": "The Art of Selling High Priced Events Via the Phone", 
    "price": "30.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648472_2523_3.jpg", 
    "course_url": "https://www.udemy.com/high-ticket-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T02:34:29Z"
}