{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Would you like more money, more time-off and more happiness and excitement in your life?</p><p>Then you need email marketing.</p><p>If you've ever wondered how some people make money on the internet, work 4 hours a week and travel the world, you can bet that they're probably experts in email marketing. </p><p>How can I be sure?</p><p>Because I'm one of them. I've lived in 10+ countries over the last 5 years... in exotic places like Thailand and the Philippines... as well as modern cities like Sydney, Berlin and Austin, TX. Plus, I've lived this amazing lifestyle while managing and growing my business...</p><p>...by leveraging the power of email marketing and autoresponders.</p><p><strong>What you get in this course:</strong></p><p>Email marketing campaigns and email autoresponders are automatic sales machines.</p><p>First, you study the science of email marketing.</p><p>Second, you write your emails and upload them to your software.</p><p>Third, you turn your computer off and go travel the world.</p><p>OK. While it's not THAT simple, it sure beats cold calls, cubicles and coffee runs.</p><p>Now, you might be wondering... what exactly will you learn in The Ultimate Guide To Email Marketing And Autoresponders?</p><p>I'm glad you asked.</p><ul><li>how to plug your conversion holes with email marketing (so you stop losing money through the leaks in your sales funnel)</li><li>how to write stories that sell (because the old cliche is true - facts tell and stories sell)</li><li>how to make people ADDICTED to your emails (so they open, read, click and ultimately buy from you AGAIN AND AGAIN)</li></ul><p>Plus, lots more.</p><p>Sound good?</p><p><strong>Sign up now and discover</strong><strong> little-known email marketing secrets that will transform your business and your life.</strong></p><p>Every minute you delay is a minute you could have spent on a tropical beach, skiing in the mountains or eating ice-cream with your kids.</p>", 
    "end_date": null, 
    "title": "The Ultimate Guide To Email Marketing And Autoresponders", 
    "price": "20.00", 
    "instructors": "Alex Genadinik, John McIntyre", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789716_df38.jpg", 
    "course_url": "https://www.udemy.com/ultimate-cours-to-email-marketing-and-autoresponders/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T15:04:37Z"
}