{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>What I'm about to share with you is especially important if you're an author, speaker, teacher, musician, artist, coach, consultant or other type of creative entrepreneur ... <strong class=\"redactor-inline-converted\">AND you want to generate more income from your talents and know-how</strong>.</p>\n\n<p>I'm Bob Baker, and for most of my adult life I've been self-employed in the arts - as an author, musician, visual artist, and improv comedy instructor and performer.</p>\n\n\n\n\n\n<p>If you know anything about creative fields, you know that making a living in the arts is NOT that common. <strong class=\"redactor-inline-converted\">Yet I've been able to do it</strong>.</p>\n\n\n\n\n\n<p>Yes, I create high-quality books and experiences for my readers and fans. But I truly believe one of <strong class=\"redactor-inline-converted\">my biggest secrets to full-time success is the skill I've honed at copywriting and sales</strong>.</p>\n\n\n\n\n\n<p>The way you describe your product or service, and the specific offers you make to your fans, make all the difference in your ability to generate income.</p>\n\n\n\n\n\n<p>But this isn't a skill that comes easily to most people. I've spent more than 25 years refining and putting into practice the authentic sales tactics that work for me.</p>\n\n<p><em class=\"redactor-inline-converted\">And now I'd like to teach these principles to you</em>.</p>\n\n\n\n\n\n<p>That's why I created the Magnetic Cash Flow Formula course. It will show you how to ...</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Craft Descriptions and Sales Offers That Attract Fans and Compel Them to Buy Now!</strong></p>\n\n\n\n\n\n<p>Here's just some of what you'll learn:</p>\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">How to write effective sales page headlines that grab attention and inspire your fans to learn more</strong></li><li>The #1 most important word you need to include in any sales message</li><li><strong class=\"redactor-inline-converted\">How to craft magnetic sales offers (and the key aspects that most people mistakenly leave out)</strong></li><li>An inside look at a simple promotion I ran that generated $3,976 in just 5 days</li><li><strong class=\"redactor-inline-converted\">The three types of fans and prospects to be aware of (and why you need all three)</strong></li><li>Your two main goals when selling (most marketers miss the boat on this one)</li><li><strong class=\"redactor-inline-converted\">The most powerful motivator to use when persuading people to buy</strong></li><li>The two types of offers that always get people to buy now ... instead of later</li><li><strong class=\"redactor-inline-converted\">How to uncover what your fans really crave and are willing to pay for</strong></li><li>The four traits of the most compelling sales offers</li><li><strong class=\"redactor-inline-converted\">How to get your emails opened and read</strong></li><li>The secrets of fan attraction</li><li><strong class=\"redactor-inline-converted\">How to turn lukewarm prospects into hungry buyers</strong></li></ul>\n\n\n\n<p>\n\n</p>\n\n\n\n<p>Using easy-to-follow video lessons and worksheets, I'll show you how to squeeze more revenue out of your existing products, services and fan base!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are you interested?</strong></p>\n\n\n\n\n\n<p>I hope you'll join me as I share my favorite secret weapons through the Magnetic Cash Flow Formula course.</p>\n\n\n\n\n\n<p>There's no time like the present. And the course is surprisingly affordable.</p>\n\n\n\n\n\n<p>Register for this course on Udemy today and get lifetime access to the lessons. Watch them on your computer, or on your smartphone or tablet using the free Udemy app.</p>\n\n\n\n\n\n<p><strong>Plus, it comes with a 30-Day, Money-Back Guarantee!</strong></p>\n\n\n\n\n\n<p><em>Go ahead and register now, and I'll see you inside the course</em>.</p>", 
    "end_date": null, 
    "title": "The Magnetic Cash Flow Formula", 
    "price": "40.00", 
    "instructors": "Bob Baker", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683516_839b.jpg", 
    "course_url": "https://www.udemy.com/magnetic-cash-flow-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T19:14:29Z"
}