{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  The Automotive Sales Process is the absolute key to successful automotive sales, yet it is rarely understood well. Too often new people are told <em style=\"\">what</em> to do, but not <em style=\"\">why</em> they should do it. This course explains the Automotive Sales Process, step by step, with an emphasis on why each step is necessary and how it leads you to a sale.  </p>  <p style=\"\">  \t  In this course, you&#039;ll first see why the process is crucial to success. Then, each step of the process is explored with a focus of why the step exists and how it fits into the process as a whole.  </p>  <p style=\"\">  \t  Next, you&#039;ll learn what else you need--apart from the process itself--to make everything work. Finally, we look at some challenging situations where the Sales Process may seem like it won&#039;t work, but in fact comes to the rescue!  </p>  <p style=\"\">  \t  We take a non-adversarial, client-centered approach to sales. Our courses are aimed at the <em style=\"\">true Automotive Sales Professional</em> who is striving for a career in automotive sales. We strive to help you build that career. If you are someone who approaches the job as a money maker &quot;until something better comes along&quot; or if you&#039;re looking for &quot;tricks&quot; to make huge profits at the client&#039;s expense, please look elsewhere. This isn&#039;t that kind of course.  </p>", 
    "end_date": null, 
    "title": "The Automotive Sales Process: Sell More Cars/Hold More Gross", 
    "price": "25.00", 
    "instructors": "Terry Coates", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399372_8e61_2.jpg", 
    "course_url": "https://www.udemy.com/automotive-sales-process/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T21:31:58Z"
}