{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Most people think of cards like <strong class=\"redactor-inline-converted\">Magic The Gathering</strong> as simply fun little trinkets that belong in a shoe box. If you fall into that category then I am about to blow your mind! I am going to show you the true value of MTG cards and how to make money selling them.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">What is this course about? </strong>This course breaks down how to make money buying and selling Magic The Gathering cards. We look at how to determine <strong class=\"redactor-inline-converted\">card values</strong>, buying strategies, and how to expand your business for even more money making opportunities!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What kind of materials are included? </strong>This course is <strong class=\"redactor-inline-converted\">video lectured</strong> with only slight variations, such as a quiz and additional details in the lecture description area. There are also references to several third party websites that allow you to determine card values and sell cards.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">How long will it take to complete this course? </strong>With over 2 hours of <strong class=\"redactor-inline-converted\">video lectures</strong> you can complete it in one session. However, I recommend that you complete one section at a time per day and use the material to reflect on what you have learned.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">How is the course structured? </strong>Each section <strong class=\"redactor-inline-converted\">grows</strong> from the previous sections and lectures. The easy parts are first, <strong class=\"redactor-inline-converted\">followed</strong> by the more difficult aspects at the end. It follows a <strong class=\"redactor-inline-converted\">logical</strong> order.</p>\n\n\n\n<p>I’m Serving over 9,000 students daily! Across more than 130 countries! With more than 150 five star reviews! This course is updated frequently! I will answer all of your questions! There is even a no questions asked 30 day money back guarantee! When you enroll in this course you have instant lifetime access which includes every update and the ability to reach out to me for help! It is time for you to position yourself for success! Just click the “Take This Course” button now and I will see you on the inside my friend!</p>\n\n\n\n<p><strong>I last updated this cou</strong><strong class=\"redactor-inline-converted\">rse on 10APR2016!</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">UPDATE - 10APR2016: </strong>I updated the intro and outro sections of the course!</p>", 
    "end_date": null, 
    "title": "The Masterclass To Selling Magic Cards Online", 
    "price": "20.00", 
    "instructors": "Success Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/734252_865e_2.jpg", 
    "course_url": "https://www.udemy.com/2016-magic-the-gathering-card-game-buyingselling-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T15:49:29Z"
}