{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><em><em><em><em><em><em>Course fully up-to-date and new lectures added as of this month.</em></em></em></em></em></em></em><br></p>\n\n<p><strong>JOIN 1,000s OF SUCCESSFUL MARKETERS WHO ARE ATTRACTING MORE TRAFFIC, LEADS, AND SALES!</strong></p>\n\n<p>\t 1. Would you like to <strong>increase your sales</strong> without <em>spending thousands</em> on marketing?</p>\n\n<p>\t 2. Would you like to <strong>improve your marketing savvy</strong>, strategies, and activities without committing a <em>great deal of time</em>?</p>\n\n<p>\t 3. Are you a business owner, self-publisher, salesperson, consultant or independent operator who desires to learn more about <strong>online marketing and sales</strong>?</p>\n\n<p>\t If you answered \"yes\" to at least one of these questions, then this course is for you!</p>\n\n<p>\t<strong>Effective marketing activities increase sales.</strong> If you don't have a marketing plan or your plan is ineffective, there's little chance you'll generate the desired sales and income results. Marketing is about creating awareness and by using the best free and low-cost practices, you can expect to drive more purchases of your products and services.</p>\n\n<p><em>Internet Marketing and Sales</em><em> </em>highlights key fundamentals, concepts, strategies, and insights. This course is designed to infuse your marketing and sales plans with best in class online activities. Additionally, if you don't have a marketing and/or sales plan or if you're new to marketing, this is the <strong>best place to start</strong> your journey.</p>\n\n<p>\t As you create your marketing strategy, you'll select and strike a balance between various online marketing activities. Upon successful completion of this course you'll be able to:</p>\n\n<ul><li>Develop an efficient, free, and low-cost online marketing plan</li><li>Out market, outperform, and outsmart your competitors</li><li>Apply various strategic online marketing and sales initiatives</li><li>Increase your leads and sales to attract your desired income</li><li>Understand your consumer, target market, and product/service market</li><li>Create eye-catching promotional messages using seven key factors</li><li>Enhance your brand, marketability, discoverability, and credibility</li><li>Plus many other course goals as stated</li></ul>\n\n<p><br></p>\n\n<p>\t Sign up and experience the <strong>best online marketing and sales</strong> course on the web.</p>\n\n<p><strong>Start Learning!</strong></p>\n\n<p>\t<strong></strong>Enroll now and start improving your marketing and sales results TODAY!</p>", 
    "end_date": null, 
    "title": "The Complete Internet Marketing and Sales Strategies Course", 
    "price": "20.00", 
    "instructors": "Chad Tennant, Make Money Online - Home Business", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164228_f340_17.jpg", 
    "course_url": "https://www.udemy.com/online-marketing-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-14T13:02:43Z"
}