{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course provides a complete step-by-step strategy for creating webinars that convert and also provide a great educational experience for the participants.</p><p style=\"\">The Webinar Selling System includes videos, downloadable PDFs of each module and additional material to support the student as they create their own successful webinar.</p><p style=\"\">This course will take approximately 2-3 hours to complete.</p><p style=\"\">This course is structured in a step-by-step format.  The content is delivered in a very linear format so that anybody can go through the course and implement the training.</p><p style=\"\">When done right, webinars are one of THE most powerful tools for selling your products &amp; services while also developing a bond with your prospective students and clients resulting in incredible word-of-mouth marketing. </p><p style=\"\">If you are a coach, consultant, author, trainer, realtor or anybody who has knowledge to share and a product or service to sell then creating effective webinars is a must-have tool to add to your marketing mix. </p><p style=\"\">In fact, webinars have been the #1 way that I&#039;ve converted hot, warm and even cold leads into paying clients taking my business into 6-figures per year.  </p><p style=\"\">Whether you take the Webinar Selling System course or not, I highly recommend that you learn how to create and deliver amazing webinars.  </p>", 
    "end_date": null, 
    "title": "The Webinar Selling System", 
    "price": "20.00", 
    "instructors": "Tom Buford", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466216_3ead_3.jpg", 
    "course_url": "https://www.udemy.com/the-webinar-selling-system/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T21:27:43Z"
}