{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Master the function of business development in this practical, content-rich, and hands-on training course that over 800 people have taken. </strong>  </p>  <p>  \t                  When you look around the web for resources on business development, you’ll come up with nearly nothing. Business development, both in the context of startups and large organizations is exploding, yet it’s something that is rarely covered in a holistic manner. The resources to learn and grow in the function simply don’t exist.  </p>  <p>  \t<strong style=\"\">This course was created to change that.</strong>  </p>  <p>  \t                  Business development has become a catch-all for terms like sales, operations, or marketing, but it’s so much more than that. Business development, when you break it down to the core, blends strategy, customer acquisition, product, marketing, sales, analytics, and creative skills into a single function. There’s a lot to learn to be truly great in a career in business development and commonly fetch a six-figure salary. This course was created to help you develop those skills.  </p>  <p>  \t                  Not only will you learn the structural basics of business development, you’ll also gain tactical tools, tips, and worksheets to implement in the work you’re doing right now.  </p>  <p>  \t<strong style=\"\">Is this course for you? This course was created for those that...</strong>  </p>  <p>  \t<strong style=\"\">Want to start a career in business development. </strong>Over the years, I’ve introduced dozens of people to the function of business development and mentored them to prosperous careers at some of the technology industry’s top companies. After taking this course, you’ll be armed with the skills and knowledge to do the same.  </p>  <p>  \t<strong style=\"\">Are new to the function of business development. </strong>Did you find yourself in a business development role without any background or previous experience? I was there too. In this course, I’ve taken all I’ve learned over the past 7 years in business development roles to speed up that growth period. You’ll go from amateur to expert.  </p>  <p>  \t<strong style=\"\">Have been in business development for years but want to grow. </strong>This is where I am as well. Creating this course has helped me immensely. I’ve picked the brain of other top business development professionals and reflected on my many failures and occasional successes to create a truly compelling course. It’s time to level up.  </p>  <p>  \t<strong style=\"\">Work with or manage a team of business development professionals. </strong>You can’t manage what you don’t understand. This course will help you deeply understand the function of business development, making you a better manager and teammate.  </p>  <p>  \t<strong style=\"\">- All of the video lectures, eBooks, and worksheets are download-enabled.</strong> If you have a slow internet connection, or want to take this course with you on your laptop, smartphone or other portable device, sign up and download all the videos and other course materials now.  </p>  <p>  \t<strong style=\"\">Sign up now to get lifetime access to this course. With Udemy&#039;s 30-day money-back guarantee, it&#039;s risk-free.</strong>  </p>  <p>  \t<strong style=\"\">HURRY! This course is on a temporary sale. Soon it&#039;ll go back up to its original price of $197.</strong>  </p>", 
    "end_date": null, 
    "title": "The Ultimate Guide to Startup Business Development", 
    "price": "30.00", 
    "instructors": "Andrew Dumont", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94704_f2fb_12.jpg", 
    "course_url": "https://www.udemy.com/startup-business-development-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T23:22:53Z"
}