{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Do you ever wonder why some sales conversations go so well while others don&#039;t? What makes some clients click with you? Why do some clients not return your phone calls or reply to your emails after you&#039;ve had a great conversation? </p><p style=\"\">This course will uncover the secrets behind how your clients make buying decisions and the 3 most important elements that high converting sales conversations need to have. </p> <p style=\"\">It will show you that making a sale doesn&#039;t require you to have all the right answers and how to overcome the pressure points in every conversation. You&#039;ll realise that you CAN make more sales without being a pushy sales person. Instead you could build trust and respect AND win more work.</p>  <p style=\"\">  \t      The course is for those who sell face to face or over the phone and is made up of several short videos that will go through these points and more:  </p>  <ul style=\"\">  \t<li style=\"\">The unconscious behaviours that are resulting in you missing out on opportunities</li><li style=\"\">How our clients make buying decisions</li><li style=\"\">Why the old way of selling no longer works</li>  \t<li style=\"\">The new way of selling and how it works</li>  \t<li style=\"\">3 pillars of sales effectiveness that have helped some of my clients increase their revenue by 40% within 3 months</li>  </ul>  <p style=\"\">  \t      There is a downloadable workbook that will guide you through the course and allow you to take down the most important points!  </p>  <p style=\"\">  \t      Est time to complete is 90 minutes.  </p>", 
    "end_date": null, 
    "title": "The special recipe to supercharge your sales conversations", 
    "price": "45.00", 
    "instructors": "Jenny Tse", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/78452_9568_7.jpg", 
    "course_url": "https://www.udemy.com/secretrecipetosuperchargeyoursalesconversations/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-14T07:56:01Z"
}