{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t       Window Three is thrilled to present you with our Infused Coaching Program, Relationship Sales for our New Economy! Based on the ideas behind emotional intelligence, the Infused Coaching Program promises to have a dramatic and sustained effect by improving <em style=\"\"><strong style=\"\">attitude, confidence, customer loyalty and new accounts.</strong></em>  </p>  <ol style=\"\">  \t<li style=\"\">This Course is the introduction for the Infused Coaching Program, a 13 session coaching program based on using emotional intelligence in a position of sales or customer service.</li>  \t<li style=\"\">This is a video based coaching session that includes 8 videos totaling one hour and fifteen minutes in length. Coaching Guide included.</li>  \t<li style=\"\">If you enjoyed this program and are interested in learning more, please visit www.WindowThree.com for more information regarding the Infused Coaching Program in its entirety.</li>  </ol>  <p style=\"\">  \t  *This is the Intro Session for the Infused Coaching Program. The full program is ultimately made up of 13 Sessions (This Intro Session plus 12 other monthly sessions). This course can be taken from the perspective of three tracks: <em style=\"\">Theory of </em><em style=\"\">Motivational Leadership, Theory of Relationship Sales or Theory of Team Development</em>. For each track, the message is the same but the dialogue and scenarios differ slightly based on the path you choose.  Please do not sign up for multiple paths. Choose the path that aligns most closely to you<em style=\"\">.</em> You may wish to sign yourself up for one path, and team members for another.  </p>", 
    "end_date": null, 
    "title": "Theory of Relationship Sales", 
    "price": "25.00", 
    "instructors": "Jon Nodine", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/159324_6259_4.jpg", 
    "course_url": "https://www.udemy.com/infused-coaching-relationship-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-06T17:15:51Z"
}