{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are an bootstrapped entrepreneur, ambitious business owner or hungry sales person? If so, you would be NUTS not to take this course.</p><p>Here is why...</p><p>If you use JUST THE TIPS in &quot;Craft Email 3&quot; and NOTHING ELSE, I guarantee that 3-5x more prospects will respond to your emails and you will get way more leads. This is a proven fact. </p><p>BAM! You get immediate value and an instant return on your investment from watching just 1 of my videos. How many Udemy courses can make a claim like that?</p><p>The problem with online courses, is that you never complete them so you don&#039;t reap the benefits. AMIRIGHT?</p><p>I&#039;m not going to waste your time with crap you do not need to know! You are busy. For this reason, I have taken the time to make my videos short, yet potent and get you results FAST. </p><p>Don&#039;t waste another frustrating second sending cold emails, banging your head against the wall and wondering why prospects don&#039;t like you. </p><p>SERIOUSLY! Do not send another email until you take this course. It pays for itself.</p><p>Prove it? The last 1000 emails I sent yielded 243 responses, 33 leads and $22,000 in new business. </p><p>You can do the same and best of all, we will do it together. </p><p>I get paid $150/hr to go into businesses, train their marketers and build their outbound email marketing systems. </p><p>You will get unlimited access to me and my $150/hr expertise by signing up now. I will literally help you write your headlines, email copy and give you 1-on-1 marketing advice. </p><p>Stop being bamboozled by email marketing, start getting hot leads in your inbox and closing more business today. </p><p>I am your guy. Sign up now and introduce yourself to the tribe. Once you have done so. I will greet you immediately and give you a free email audit to jumpstart your progress.</p><p>Your new email marketing wizard, </p><p>Bryce</p>", 
    "end_date": null, 
    "title": "Turn Cold Emails Into Cash - Email Marketing Mastery", 
    "price": "30.00", 
    "instructors": "Bryce Anderson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567926_d7df_3.jpg", 
    "course_url": "https://www.udemy.com/turn-cold-emails-into-hot-leads-email-marketing-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T03:30:58Z"
}