{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Finalmente, un taller de técnicas de ventas, que<strong style=\"\"> revela los secretos</strong> <strong style=\"\">más de 50 de los mejores vendedores y negociadores de la historia</strong>, todo en un mismo taller.</p><div style=\"\">Estimados Freelancers, Consultores, Emprendedores, Empresarios, Vendedores, Gerentes Comerciales, Key Account Managers<strong style=\"\">: </strong><p style=\"\"><strong style=\"\"></strong>Si los contadores fueron a la escuela de contabilidad, y los diseñadores a la de diseño <strong style=\"\">¿A cuál escuela de ventas fueron ustedes?</strong></p></div><div style=\"\">Si usualmente tú o tus vendedores:</div><ul style=\"\"><li>Tienen decenas de reuniones y no cierran la venta</li><li>No usan eficientemente tu tiempo</li><li>Se van de tu empresa porque no funcionaron</li><li>Parecieran ser amateurs en vez de profesionales</li></ul><div style=\"\"></div>  <p style=\"\">  \t              Seguramente es porque no has recibido la capacitación adecuada.  </p>  <div style=\"\">Este no es un tema para avergonzarse, yo estuve donde mismo están ustedes y luego de mucho entrenamiento, cursos, un centenar de libros y entrevistas a los mejores agentes comerciales hemos reunido un programa espectacular , con todos los secretos, trucos y metodologías que necesitas para entrenar tus técnicas de ventas.</div><div style=\"\"><strong style=\"\">Pero….este programa </strong><strong style=\"\">NO es para todos</strong></div><p style=\"\">Si crees que el éxito es gratuito y que está asociado más al talento que al esfuerzo…este programa no es para tí.Si crees que por haber estudiado alguna ingeniería, sabes todo lo que tienes que saber…este programa no es para tí. (Incluso Ingeniería Comercial!)<br style=\"\"></p><div style=\"\"><div style=\"\">Este programa es un <strong style=\"\">ENTRENAMIENTO </strong>y es por eso que soy conocido por obtener resultados y ahorrar a las empresas decenas de millones de pesos. </div></div><p style=\"\">Al final del curso deberás tener los siguientes beneficios:</p><div style=\"\"><ol style=\"\"><li>Repercutir inmediatamente en los <strong style=\"\">resultados comerciales</strong> de tu empresa.</li><li>Crear <strong style=\"\">hábitos </strong>profesionales.</li><li>Identificar formas de <strong style=\"\">acercarse a los prospectos</strong> y optimizar la forma en que nos relacionamos.</li><li>Lograr <strong style=\"\">negociar</strong> en ambientes amigables y hostiles.</li><li>Entender cuáles son los <strong style=\"\">momentos claves</strong> en los que puedo y debo cerrar el negocio.</li><li>Comprensión integral del <strong style=\"\">proceso de ventas</strong>.</li><li>Representar de <strong style=\"\">forma profesional</strong> a tu empresa y la dejen bien parada siempre.</li></ol><div style=\"\"><em style=\"\"></em></div></div><p><em style=\"\"></em></p><p><em style=\"\"></em></p>  <p style=\"\">  \t              Dentro de los temas que <strong style=\"\">develaremos y entrenaremos</strong> se encuentran:  </p>  <ul style=\"\">  \t<li>Planificación</li>  \t<li>Acercamiento al prospecto</li>  \t<li>Presentación</li>  \t<li>Manejo de objeciones</li>  \t<li>Negociación</li>  \t<li>Cierre de ventas</li>  </ul>  <p style=\"\">  \t              Todo esto con nuestro efectivo <strong style=\"\">método de Aprendizaje Progresivo</strong>, el que asegura la asimilación de los contenidos gracias a su modalidad y distribución temporal, lo que te permitirá ir implementando nuevas técnicas  al mismo tiempo que aprendes y trabajas, avanzando las semanas para así pulir tus hábitos de venta.  </p><p style=\"\">Deberías ser capaz de realizar este taller en unas <strong style=\"\">4 sesiones de 2 horas</strong> cada una, incluyendo los entrenamientos. Cada sección tiene material de apoyo para que generes tu propia mini-wikipedia de <strong style=\"\">tu propio proceso de ventas</strong>.</p>  <p style=\"\">  \t              <strong style=\"\">Toma este curso hoy</strong> para lograr un aumento rápido y eficiente en tus ventas, sorpréndete a ti mismo y descubre tus verdaderas aptitudes.  </p><p style=\"\">Recuerda que tenemos una <strong style=\"\">garantía de un 100%</strong> de retorno de tu dinero si quedas insatisfecho, por lo que puedes tomar este curso es sin ningún riesgo. (Sin preguntas, sin letra chica)</p>", 
    "end_date": null, 
    "title": "Técnicas de Venta \"Negociando como un Profesional\"", 
    "price": "40.00", 
    "instructors": "Francisco Israel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392662_daf8_5.jpg", 
    "course_url": "https://www.udemy.com/tecnicas-de-venta-negociando-como-un-profesional/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T03:07:51Z"
}