{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Welcome to the Ultimate Referral System. You are about to discover a simple way to get Referrals like Clockwork.</p><p>Find out exactly how easy it is to get referrals when you know exactly what to say to people you want referrals from. You will learn to recognize who clients you can help the most, and also who would make the perfect client for you.</p><p>You will be shown why it is critical to follow up on referrals and when you need to contact referrals (the answer might surprise you)</p><p>You will learn why communication is critical - with your referrals and the people who refer business to you. Find out exactly what to say when a referral is sent to you that isn't ideal.</p><p>Imagine finding out exactly where your ideal referral sources are? Would that make a difference to how many referrals you can get? And best of all, referrals are in most instances free!</p><p>You will be introduced to the perfect system to be always remembered! This will result in a steady stream of referrals whenever you like - its almost like having you own sales force working for you (and for free!)</p><p>You will also be exposed to the real reasons why you need to be the best, why you need to strive to be the best and why you need to let people who refer business to you know you are the best.</p><p>You will need to make sure you use this information for good. There are strategies in this course that will completely transform your referrals (if you implement!)</p><p>This course comes with a 30 day money back guarantee so enroll today.</p>", 
    "end_date": null, 
    "title": "Ultimate Referral System - Get Referrals Like Clockwork", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653068_d652_2.jpg", 
    "course_url": "https://www.udemy.com/referrals/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T04:56:26Z"
}