{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course could save your business $1000s - if you&#039;re launching a new brand, moving into new markets, or wanting to grow your existing sales - marketing is a valuable skill that you definitely need to master.</p><p>Chris Croft is an international speaker and widely published author, who&#039;s been teaching Marketing skills to companies for over 20 years. He&#039;s taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for home and work.</p><p>He covers everything you need to know from preparing and planning, understanding your customers and competitors, setting your prices, and ultimately getting the right products in front of the right people. This course covers all the academic models and theories you&#039;d learn on an MBA course, but with practical tools and examples you can use right away to get better results for your business.</p><p>The course overview includes:</p><ul style=\"\"><li>Getting your product in front of the right people at the right time, to see your sales rocket</li><li>How to understand your customers better</li><li>Spotting new lucrative markets to move into</li><li>Understanding you weaknesses, and minimising them</li><li>Marketing theories ranging from SWOT, 4Ps, Porters 5 Forces, Ansoffs Matrix, and many others</li><li>Setting your prices for maximum revenue</li><li>How to make sure your marketing budget gets the highest return possible</li><li>And lots lots more!</li></ul>", 
    "end_date": null, 
    "title": "Understanding Strategic Marketing", 
    "price": "25.00", 
    "instructors": "Chris Croft", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554518_27fc_3.jpg", 
    "course_url": "https://www.udemy.com/understanding-strategic-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T16:32:06Z"
}