{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                Inside <em style=\"\"><strong style=\"\">Voice Mail That Makes Money,</strong></em> you will learn how to get people to return your call and build credibility along the way.  </p>  <p>  \t  Learn this sales growth hack. Business to Business sales and consumer direct sales stratigies to generate more closed sales.  </p>  <p>  \t<strong style=\"\">START CLOSING MORE SALES! Learn this 1- 2 business building secret.</strong>  </p>  <p>  \t                Using this simple 2-step lead generating telephone and email sales process, you will blow past all of the BS that your prospects make every other sales person go through.  Increase your sales ability to communicate and grow your business.  Specific lead generating sales emails and voice mails that grab attention!  Grab this income producing sales blueprint and get the sales edge over your competition.  </p>  <p>  \t    Master sales and attract more sales leads and customers.  </p>  <p>  \t      Sales training and sales coaching has never been this easy to implement in your business until now.  </p>  <p>  \t<strong style=\"\">We also talk about:</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">The 6 reasons why people don&#039;t return your calls and what to do about it.</strong></li>  \t<li>The strange phenomenon that takes place, when we leave someone a voice mail       message and how it sets us up to fail.</li>  \t<li><strong style=\"\">The common theme that most people in sales follow and why it simply doesn&#039;t           work.</strong></li>  </ul>  <p>  \t<strong style=\"\"><em style=\"\">Small business lead generation, Business development for start ups and tech companies...  Start closing more sales and generating online leads. </em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\"> Crack the cold calling and cold emailing code!</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\"> Eliminate cold calling with these business building sales coaching secrets!   </em></strong>  </p>  <p>  \t               Peter Drucker said;  </p>  <p>  \t<em style=\"\">&quot;If we want something different, then we have to do something different.&quot;</em>  </p>  <p>  \t<em style=\"\">Get the sales psychologisy and persuasion skills to supercharge your business lead generations, phone sales skills and get more clients now by doubling you business.</em>  </p>  <p>  \t<em style=\"\">Learn phone sales success, discover online sales strategies and techniques that increase business to business sales and close consumer sales faster. </em>  </p>  <p>  \t<em style=\"\"> Quickly develop email marketing that delivers leads and closes sales.</em>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>", 
    "end_date": null, 
    "title": "Voice Mail That Makes Money - Make More Sales", 
    "price": "20.00", 
    "instructors": "Bob Marx", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206636_ac2e_3.jpg", 
    "course_url": "https://www.udemy.com/voice-mail-that-makes-money/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-28T17:10:37Z"
}