{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\n<strong>THE\n#1 COURSE ON SELLING WEBSITES</strong></p>\n\n<ul><li>Looking\nfor an <strong>easy way</strong> to\nfind customers for your custom websites?</li><li>Tired\nof being payed only $400 for a new website on Flippa, when you know your <strong>skills\nare worth much</strong><strong> </strong><strong>more</strong>?</li><li>Hate\nthe <strong>insecurity</strong> of\nbeing a freelancer – never knowing where and when you will get your\nnext order for a website?</li><li>Want\na steady stream of new, <strong>extremely\nprofitable</strong> customers?</li><li>Want\nto turn a one-time website deal into a <strong>$1000/m\nrecurring revenue</strong> stream?</li><li>Want to know the <strong>Best Kept Secret</strong> that make other website creation businesses so successful?</li></ul>\n\n<p>\n<br>\n\n</p>\n\n<p>\n<strong>WEBSITE CREATION </strong>for clients is\na lot of fun. But trying to get new clients for your custom made\nwebsites, can be draining. Especially if your not seeing the results\nyou want.</p>\n\n<p>Pay-per-click ads, blogging and responding to freelancer site job\nrequests is all good and fine, but it really isn’t that effective.\nThere is a lot of competition – and as the price is driven to the\nbottom – so are your profits.<br></p>\n\n<p>\n<strong>What\nif I told you</strong> theirs\na better way? A straightforward sales strategy that will get you\nhighly profitable clients, that will easily pay you\n$4000 for a new website?</p>\n\n<p>\n<strong>There\nis</strong>.\nIt's called the <strong>Lumpy\nMail Method</strong>.\nThe best kept lead generation secret in recent years.</p>\n\n<p>\nWith\nthe Lumpy Mail Method you will have an <strong>endless\nsupply of companies</strong> wanting\nto pay you <strong>4\nfigures</strong> for\na new website. Say <strong>“</strong><strong>Goodbye”</strong> to\nlow profits and <strong>“</strong><strong>Hello”</strong> to\nquiet mornings, where all you have to do is grab a cup of coffee, and\ngo work on that new website.</p>\n\n<p><br></p>\n\n<p><strong>IN THIS COURSE YOU WILL LEARN:</strong><br></p>\n\n<ul><li>How to identify wealthy companies that needs and wants to pay you\npremium prices for a new website</li><li>How to create a Lumpy Mail to send the companies so they will be\nconvinced to buy a site from you</li><li>How to book sales meetings/consultations with the companies and sell the website</li><li>How to turn a one-time website deal into a $1000/m recurring revenue\nstream with minimum maintenance required (Bonus lecture)</li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong>HERE'S WHY MY STUDENTS ARE EXITED!</strong></p>\n\n<p><em>\"A winning strategy to sell web sites. Very easy to follow and straightforward. This course confirmed my guess about how to reach companies that need web sites. Thanks.\"</em><br>- Shelley Corbin, USA </p>\n\n<p><em>\"Really well explained, easy to follow, and convincing. I know if I got one of these lumpies, I would open it and contact whoever sent it. Good job!\"<br></em>- Joe Finn, USA</p>\n\n<p><br></p>\n\n<p><strong>GUARANTEE</strong></p>\n\n<p><strong></strong>If\nwithin 30\ndays\nof using the Lumpy Mail method you haven’t seen the results you\nexpected (or for <strong>any\nother reason</strong>)\nplease, get a <strong>Udemy-backed\nrefund</strong> and\nspend the money elsewhere. I\nonly want satisfied customers.</p>\n\n<p><br></p>\n\n<p><strong>FREQUENTLY ASKED QUESTIONS</strong></p>\n\n<p><strong>Who are you?<br></strong>My name is Ivan Westen. I have 10 years of experience designing\nwebsites and selling on my e-commerce stores. I am a online marketing junkie\nand have taken lot's of online courses, listen to 1000's of podcast\nepisodes and read countless blog-post. I have tried a lot of stuff\nand learned what worked and what didn’t. You should trust me\nbecause I have succeeded in making money with my businesses, while\nother teachers have not.</p>\n\n<p><strong>What's in it for\nyou?<br></strong>I get paid for teaching you step-by-step how to use the Lumpy Mail sales process to optimize your B2B sales prospecting. I use the\nmoney you pay me to buy coffee and diapers for my daughter. Simple\nenough.</p>\n\n<p><strong>I have never sold a website before - will the Lumpy Mail Method work for me?</strong><br>Yes it will. If you know how to do simple website development (or you know someone who does), you can use the Lumpy Mail Method to to sell custom websites and keep the profit. If you use the Lumpy Mail sales training from the beginning, you will have a very successful start as a website seller. <br></p>\n\n<p><strong>Can you guarantee\nthe Lumpy Mail Method will work for me?<br></strong>I guarantee that the method itself has proven to work for me and many others. But, it is not a passive website marketing method (not to\nbegin with at least). It requires a time investment to build the\nLumpy Mails you send out. But more importantly, you have to have the skills to create quality website (or know someone who has). If you can produce quality websites and are willing to spend the time it takes to create a Lumpy Mail, I am convinced the method will work\nvery well for you.</p>\n\n<p>And if for some reason you do not like your results – just get a\nrefund.</p>\n\n<p><strong>Does it work\noutside USA?<br></strong>It sure does.  I'm from Europe and the method works equally well in USA, Germany or\nany other country and can be used across borders as well.</p>\n\n<p><strong>What is a Lumpy\nMail exactly?<br></strong>It is a big, bulky letter that has a special surprise inside for the receiver. To see a real world example of a Lumpy Mail, please\nwatch the free preview of the lecture <strong>“Lumpy Mail Explained\n– Why It Works So Well”</strong> below.</p>\n\n<p><br></p>\n\n<p>\n<strong>                                        READY\nTO SELL MORE WEBSITES?</strong></p>\n\n<p>Press\nthe \"Take This Course\" button on top, and start getting\npaid what your worth today!<br></p>", 
    "end_date": null, 
    "title": "Web Design Secret: How To Sell 10+ $4000 Websites A Month", 
    "price": "25.00", 
    "instructors": "Ivan Westen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589862_bed8_8.jpg", 
    "course_url": "https://www.udemy.com/lumpymail/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T20:58:37Z"
}