{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <br>  \t   </p>\n\n<p>  \t <strong>          \"Understanding how to scrape the web can be a startup employee's best asset. This course makes it dead simple without any prior technical knowledge.\"</strong><strong> </strong>  </p>\n\n<p>  \t                                                                                 - <em>Max Altschuler, Founder @ Sales Hacker Conference</em>  </p>\n\n<p>  \t <em><br>  \t </em>  </p>\n\n<hr>\n\n<p>  \t <strong>                                                     I've made my career out of growing companies and no matter the stage your company is in, you're always trying to find your unfair advantage that provides sustainable growth now and into the future.</strong> When I first learned what web scraping was I knew it was a game changer! Being able to grab massive amounts of data from the web for leads was the unfair advantage over my competitors I was looking for.  </p>\n\n<p>  \t                       The only problem was that I had to know how to code to use it. I spent months learning to code just so I could start utilizing web scraping, but this course shows you have to skip all of that.  </p>\n\n<p>  \t <strong>Learn to scrape without code</strong>  </p>\n\n<p>  \t <strong>Imagine you could have all the web data you need to power your sales team or your marketing efforts and you can get it in minutes.</strong> Research that takes hours, sometimes days or even weeks can be accomplished over and over with the click a button. Web scraping is more powerful than you think.  </p>\n\n<p>  \t                                                                            You're here because above all else you want to be successful and you want your company to benefit from that success. You're one step ahead right now, but let's make that 10 steps ahead, today.  </p>\n\n<p>  \t                            If you're here because your competitors are growing faster than you, or you are losing opportunities to other peers that are more efficient than you, this course will give you the tools to be more efficient and beat the competition.  </p>\n\n<ul>  \t<li><strong>You want or have a job in growth </strong>(sales, marketing, business development)</li>  \t<li><strong>You want to crush your competitors </strong>- This course will teach you how to create track your competition's job postings, media coverage, and expansion plans.</li>  \t<li><strong>You want to easily capture the names and content of the publications writing about you </strong>- I'll show you have to search all of the blogs &amp; publications in your field and compile that into one dataset.</li>  \t<li><strong>You want you to create massive lead lists for your sales team </strong>- You'll learn to scrape sites like Yelp &amp; Crunchbase and export the results into a spreadsheet to load into your CRM.</li>  \t<li><strong>You want to optimize your content marketing effectiveness </strong>- Want to know what's getting submitted to news sources like Reddit &amp; Hacker News? I'll show you how to get intelligence on the posts from top influencers.</li>  \t<li><strong>You simply want to be the best! </strong>- There's so much more to unlock and we're going to work on that together.</li>  </ul>\n\n<p>  \t <strong>Some of the sites you'll scrape in this course</strong>  </p>\n\n<ul>  \t<li>Twitter</li>  \t<li>Yelp</li>  \t<li><strong></strong>Reddit</li>  \t<li>Hacker News</li>  \t<li>And many more!</li>  </ul>\n\n<p>  \t            We'll be learning to master the Import. io tools and I'll be adding new videos and datasets all the time. There are new videos in the works right, on top of what you already see here.  </p>\n\n<p>  \t                       Students are encouraged to share their strategies for scraping in the course that will become a much larger community of people growing their businesses together.  </p>\n\n<p>  \t <strong>What students are saying about the course</strong>  </p>\n\n<p>  \t \"The lessons taught in this course provide the tools to make a single sales rep worth 3x by making it easy to source thousands of targeted leads. This is a must see course for teams trying to get the most with limited resources.\"  </p>\n\n<p>  \t <em>-Ryan Budd, Growth @ Square</em>  </p>\n\n<p>  \t <em><br>  \t </em>  </p>\n\n<p>  \t   </p>\n\n<p>  \t <br>  \t                                                                 \"This is the ultimate course for anyone who wants to reach new customers.\"  </p>\n\n<p>  \t <em>-Tristan Pollock, Co-Founder &amp; COO @ Storefront</em>  </p>\n\n<p>  \t <em><br>  \t </em>  </p>\n\n<p>  \t <em><br>  \t </em>  </p>\n\n<p>  \t   </p>\n\n<p>  \t <br>  \t                                                                 \"This course is for anyone wanting to mine any public data on the web. The competitive intelligence section is pretty much exactly what anyone who can benefit from collecting info about their industries competitive landscape.\"  </p>\n\n<p>  \t <em>-Louis Abramowski, Founder &amp; CEO @ Unbenchable</em>  </p>\n\n<p>  \t <em><br>  \t </em>  </p>\n\n<p>  \t   </p>\n\n<p>  \t <br>  \t                                                                 \"More leads, less time, lower costs? I'll take it. This is a must have for early startup teams looking to send their growth chart up and to the right.\"  </p>\n\n<p>  \t <em>-Soso Sazesh, SEM &amp; Paid Acquisition Expert</em>  </p>\n\n<p>  \t <em><br>  \t </em>  </p>", 
    "end_date": null, 
    "title": "Web Scraping for Sales & Growth Hacking with Import io", 
    "price": "30.00", 
    "instructors": "Matt Ellsworth", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107672_35da_7.jpg", 
    "course_url": "https://www.udemy.com/learn-web-scraping-in-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-18T21:37:59Z"
}