{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">My Udemy courses have been taken 100,000 times by over 25,000 students, have been awarded countless 5 stars reviews. </strong><em class=\"redactor-inline-converted\">That is all the proof we need that our methods work!</em></p>\n\n<p><em class=\"redactor-inline-converted\">LATEST: Course Up to date for 2016. Only fresh information.</em></p>\n\n<p>Dear Marketer,</p>\n\n<p>If like me you have been wondering for a while how to add high-ticket commissions to your downline, then <strong>wonder no more.</strong></p>\n\n<p><em>I'm sure you are aware of what a webinar is, but if you aren't..</em></p>\n\n<p>..a webinar is an online presentation, usually live, where a marketer get to interact with a large audience eager to learn more, and to buy.</p>\n\n<p>I have been using webinars for the past two years to produce high-ticket sales from coaching, high-end softwares and consulting.</p>\n\n<p>In this course, I have laid down the <em class=\"redactor-inline-converted\">exact</em> foundation for my business, to the letter.</p>\n\n<p>But please don't take my word for it. You can take this course for 30 Days, and by the time you know every sentence by heart, when you have taken ALL the content, you can STILL ask for a refund.</p>\n\n<p>This is our proof that our methods work: <strong class=\"redactor-inline-converted\">our unbeatable 30 Days Money Back Guarantee, that we've NEVER turned down.</strong></p>\n\n<p>See you inside the course, where you'll discover how one single webinar made me 5 figures</p>\n\n<p>Cheers</p>\n\n<p>-Howard</p>", 
    "end_date": null, 
    "title": "Webinar Crusher by Howard Lynch - Sell High Ticket Products!", 
    "price": "20.00", 
    "instructors": "Howard Lynch", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/845330_b60b_2.jpg", 
    "course_url": "https://www.udemy.com/webinar-crusher-by-howard-lynch-sell-high-ticket-products/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-10T20:00:55Z"
}