{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">West Coast Selling - A Fresh Look at Sales With A Social Technology Twist</strong> is a combination of organizational and sales coaching tied into using our modern technologies to market your business and generate appointments.  </p>  <p style=\"\">  \t  Who should take this course?  </p>  <p style=\"\">  \t  This course is made for the service professional who is looking for a comprehensive philosophy to follow to grow their practice. A financial advisor or an insurance broker will find great value in West Coast Selling. The new advisor or broker will especially benefit from the insights within this course.  </p>  <p style=\"\">  \t  What is the course about?  </p>  <p style=\"\">  \t  West Coast Selling teaches you a series of key steps to follow to build your professional services practice. We start out by helping you allocate your time correctly between your personal life and work. We then teach you how to build a complete and vibrant social network on LinkedIn. Once your network is established we show you how to create a series of meetings within your network to establish the beginning of a sales pipeline. We teach you how to hold your first meeting, what to say, and more importantly what to ask. Once you have prospects in your pipeline we teach you how to project when they will close and how to allocate your time between current prospects and future prospects. Our final modules focus on closing business and the first 90 days of a new client. How you handle your new client leads directly to how likely they are to refer you to their friends. We teach you how to run a remarkable practice.  </p>  <p style=\"\">  \t  What terminology would you students use to find your course?  </p>  <p style=\"\">  \t  How do I grow my insurance business?  </p>  <p style=\"\">  \t  How do I grow my financial advisory business?  </p>  <p style=\"\">  \t  How do I manage my time correctly?  </p>  <p style=\"\">  \t  How do I sell insurance?  </p>  <p style=\"\">  \t  How do I use LinkedIn to grow my business?  </p>  <p style=\"\">  \t  What kind of Materials are included?  </p>  <p style=\"\">  \t  We have several templates we share with you. We have a 45 day planning sheet. We have a prioritization template. We offer a value ranking of contacts template.  </p>  <p style=\"\">  \t  How long will it take to complete the course?  </p>  <p style=\"\">  \t  Each module is 20 minutes or less and it is best to take one week in between each module to put into practice the suggested behaviors. With that said we think an active learner could get through the course in one month.  </p>  <p style=\"\">  \t  How is the course structured?  </p>  <p style=\"\">  \t  The course in linear in that we start with organization of your life and contacts and then move on to the first meetings and end up with how to have a great first 90 days for your client.  </p>", 
    "end_date": null, 
    "title": "West Coast Selling ", 
    "price": "50.00", 
    "instructors": "Drew Sanders", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319622_5e6a_2.jpg", 
    "course_url": "https://www.udemy.com/west-coast-selling/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T18:00:51Z"
}