{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    The course is designed for regional newsrooms and web-portals. Its aim is to present different business models and income sources for local media projects.  It will help editors and managers to understand trends in digital marketing and advertising in new media environments. The course includes a variety of practical cases, examples and manuals how to diversify and increase profits from web-based projects.  </p>  <p style=\"\">  \t    We practice in  </p>  <ul style=\"\">  \t<li style=\"\">Understanding our audience better</li>  \t<li style=\"\">Presenting our advertisers brighter</li>  \t<li style=\"\">Enlarging our budget quicker</li>  </ul>  <p style=\"\">  \t    We examine different ways to optimise our business processes and to make our creative teams more effective.  </p>  <p style=\"\">  \t<strong style=\"\">  Практический курс ориентирован на тех редакторов и менеджеров, кто готов увеличивать доходы своего интернет-сайта. При этом мы ждем на этом курсе тех, кто уже понял, что сам факт создания сайта не приносит автоматически новых рекламных денег.  </strong>  </p>  <p style=\"\">  \t    Очень многие редакции сейчас достигли такого уровня развития своих сайтов, что редакционная работа внутри них уже отлажена, есть определённое ядро аудитории, есть представление о том, какое место сайт занимает в региональных и тематических рейтингах. Казалось бы, самое время начинать «продавать аудиторию». Однако те шаблонные решения, которые унаследованы от традиционных медиа, часто неэффективны. Продажа баннеров на сайте по аналогии с продажей модулей в газете не приносит того количества денег, которые хотелось бы получать от сайта. И в этот момент редакторы и руководители отделов рекламы задаются вопросами: <strong style=\"\">&quot;Как можно увеличить доходы с конкретного интернет-ресурса? Что ещё мы можем продавать в интернете?&quot;</strong>. Блогеры, достигшие определенного уровня, тоже задумываются о монетизации своего ресурса. Но и им шаблонные решения помогают мало.  </p>  <p style=\"\">  \t<strong style=\"\">Курс будет полезен редакторам информационных сайтов, руководителям рекламных служб медиакомпаний, менеджерам по рекламе, рекламным агентам, работающим с интернет-проектами, блогерам, задумывающимся о монетизации своих ресурсов. </strong>  </p>  <p style=\"\">  \t    Участники курса получат представление о <strong style=\"\">многообразии рекламных решений в интернете, проанализируют свои собственные ресурсы, составят план развития своих рекламных площадок</strong>. Отдельно мы будем говорить о ежедневной работе менеджера по рекламе: как искать, находить и налаживать отношения с рекламодателем, как вовлекать его в рекламные интернет-проекты, как писать коммерческие предложения, как презентовать ваши рекламные площадки, как вести переговоры, преодолевать сопротивление и скепсис.  </p>", 
    "end_date": null, 
    "title": "Как заработать на своём сайте", 
    "price": "30.00", 
    "instructors": "Oksana Silantieva", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248894_2c08_2.jpg", 
    "course_url": "https://www.udemy.com/silamediamoney/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-23T18:41:43Z"
}