{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tВы никогда не задумывались о том, что <strong>потенциальные клиенты выбирают конкурентов, </strong>а не Вашу компанию, только потому, что<strong> Ваши менеджеры по продажам недостаточно обучены?</strong>  </p>  <table>  <tbody>  </tbody>  </table>  <p>  \t<strong>НЕ ВАЖНО</strong>, есть у Вашей компании 200 собственных траков, или только офис с телефоном, <strong>ВАЖНО</strong> только то, <strong>умеет ли менеджер заключать нужные контракты!</strong>  </p>  <p>  \tНачинается высокий сезон осенних продаж транспортно – экспедиционных услуг в РФ. По устоявшейся практике, многие крупнейшие компании в этот период проводят тендеры на обслуживание своих грузопотоков. Это именно тот активный период продаж, когда закладывается <strong>основа финансовой стабильности вашей компании</strong> на будущий год.  </p>  <p>  \tВ течении ближайших месяцев состоится распределение основных грузопотоков, которые формируются на территории РФ. Конкуренция обостряется до невиданных масштабов. Многим компаниям будет <strong>тяжело пережить данные времена, некоторым придется уйти с рынка!</strong>  </p>  <p>  \tПредлагаем поддержать Ваших менеджеров по продажам авторским обучающим курсом от дипломированного специалиста с опытом работы более 15 лет в транспортном бизнесе, с общим портфелем продаж более <strong>500 миллионов рублей!</strong>  </p>  <p>  \tАвторский обучающий курс <strong>“Эффективные продажи транспортно-экспедиционных услуг крупным компаниям”</strong> — это первое практическое руководство по продажам услуг для компаний, работающих на рынке обслуживания грузов в современном интерактивном формате.  </p>  <p>  \t<strong>Обучение по продажам – это такая же инвестиция</strong> в бизнес, как и обновление подвижного состава. Существенная разница лишь в том, что навыки, которые приобретает Ваш персонал на повышении квалификации, не изнашиваются со временем!  </p>  <p>  \tОбучение, проведенное грамотным специалистом, может сотворить с Вашим бизнесом <strong>маленькое экономическое чудо при минимальных затратах.</strong>  </p>  <p>  \tК примеру: стоимость только одного нового тягача с прицепом сейчас составляет <strong>6 миллионов рублей.</strong> И месячная доходность такой сцепки всем известна, в этом случае, выше головы не прыгнешь…  </p>  <p>  \tВ то же время, с <strong>минимальными вложениями в обучение</strong> персонала, менеджер, при правильном подходе, может заключать контракты, которые будут обеспечивать <strong>продажи услуг на десятки миллионов рублей в месяц.</strong>  </p>  <p>  \tЭто реально! Именно такими продажами я занимался на протяжении более 6 лет. Мои общие продажи превысили сумму в<strong> 500 миллионов</strong> рублей!!!  </p>  <p>  \t<strong>Сможете и Вы!</strong>  </p>", 
    "end_date": null, 
    "title": "Эффективные продажи транспортно-экспедиционных услуг", 
    "price": "50.00", 
    "instructors": "Г-н Игорь Волков", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286900_1b51_5.jpg", 
    "course_url": "https://www.udemy.com/vlkcomru/", 
    "currency": "USD", 
    "subject_name": [
        "Sales"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-24T10:27:33Z"
}