{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "This Contract Law course <strong style=\"\">summarizes the fundamentals</strong> of American legal system related to the expression of the free will of bargaining and entering into legally binding and valid agreements. <p style=\"\">It is directed towards the broadest audience and requires no special knowledge or educational background in the field of Law, Business or Administration. </p><p style=\"\">The course is structured in a way that will allow the listener to take time to <strong style=\"\">learn and estimate the basic notions of Contract law. </strong></p><p style=\"\">The outcome of its taking will be the more professional and  learned approach of the student towards the matter of the framing of business relations and their legal aspects and implications. </p><p style=\"\"><strong style=\"\">The primary goals of the course are to:</strong></p><p style=\"\">- <strong style=\"\">familiarize</strong> the students with the fundamentals of Contract Law,</p><p style=\"\">- <strong style=\"\">prepare</strong> themselves <strong style=\"\">for examinations</strong> an a clear and structured way that will save them a lot of time and further reading,<br style=\"\"></p><p style=\"\">- <strong style=\"\">help </strong>them work with ease with the <strong style=\"\">basic terminology </strong>in the area and </p><p style=\"\">-<strong style=\"\"> broaden the knowledge</strong> of the way business agreements operate in an environment conformed with the legal standards. </p><p style=\"\">The course can be especially helpful for students who are not native English speakers and are not familiarized in detail with the Common law terminology, related to Contract law. These students may be called a special target group of the current course.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Contract Law", 
    "price": "40.00", 
    "instructors": "Tsvetelina Merjankova", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444012_a41d_3.jpg", 
    "course_url": "https://www.udemy.com/contract-law/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T18:29:50Z"
}