{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is for anyone who has ever posted content that they created on the internet, whether it’s a educational course, a book, a video, a game or even a powerpoint presentation.</p>  <p>This course covers the basics of the US Copyright Act and provides an introduction into international copyright law under the Berne Convention.  Students will learn the history of copyright law, the basic tenets of copyright law, as well as the rights they have as a copyright owner.   </p>  <p>By the end of this course, the students will know how to register their copyright in the United States, which form they need to use and what to include in their copyright registration. Additionally, students will understand the benefits of registration versus the benefits of notice and be able to make an informed decision as to whether or not they want to register their copyright best for them. </p>  <p>This course will go over the law related to online copyright protection and, at the end of the course, students will understand how the law applies to them. </p>  <p>Additionally, they will understand the importance of the takedown letter, where they need to send the takedown notice, how and write a takedown letter that complies with the relevant law. Students will also understand the potential legal pitfalls and liability related to issuing a take down notice.  </p>  <p>Students learn how to write a cease and desist letter, when and where to send the cease and desist letter, as well as the difference between a cease and desist and a takedown notice. </p>  <p>Students will also come away from this course with a basic understanding of the Fair Use Doctrine and why it is important. </p>  <p>Students will learn what legal remedies they may have if someone violates their copyrights.  Students will be provided information as to what they should request in a law suit related to potential remedies. </p>  <p> At the end of this course, students will know how to protect their own copyright without having to enlist the help of an attorney!</p>", 
    "end_date": null, 
    "title": "Copyright Law for Online Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Elizabeth Hale", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594494_2bcf_3.jpg", 
    "course_url": "https://www.udemy.com/copyright-law-for-online-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T23:56:07Z"
}