{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong>►</strong> Whether you’re an artist, author, photographer, or anyone else who creates works of arts to support yourself, <strong>you will need to protect your creative work in the form of copyright protection</strong>.<br></p>\n\n\n\n\n\n\n\n\n\n<p>Developing creative works represents an important investment of time, effort, and other valuable resources. <strong>Taking steps to secure your work is an important aspect of protecting your investment. </strong></p>\n\n\n\n\n\n\n\n\n\n<p>By the end of this course, you’ll be well-equipped to <strong>use copyright protection for your benefit and to avoid serious legal issues with copyright infringement</strong>. </p>\n\n\n\n<p>Everything you need to know about copyright is in this course so you don’t have to worry about missing anything.</p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em class=\"redactor-inline-converted\">What is Copyright?</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong></strong> Intellectual property rights are legally recognized exclusive rights to creations of the mind. The purpose of intellectual property rights is to <strong>promote the progress of artists by giving creators exclusive rights to their works</strong>. </p>\n\n\n\n\n\n\n\n\n\n<p>As you can imagine, if you created something and everybody had the right to use it without paying you, not very many people would go through the trouble of creating anything!</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Copyright is a law that gives you ownership over the things you create. Copyright also allows you to legally protect your creative work.</strong> </p>\n\n\n\n\n\n\n\n\n\n<p>Copyright protects any kind of creative work, including <strong><em class=\"redactor-inline-converted\">photos, videos, blogs, books, articles, songs, plays, sculptures, sound recordings, and other creative works</em></strong>. When you create any of these, you own the copyright to it. </p>\n\n\n\n\n\n\n\n\n\n<p>Copyright to these creative works are your rights and your rights alone. Unless you willingly give permission for anyone to do any of these, no one can violate them legally. </p>\n\n\n\n\n\n\n\n\n\n<p>In general, <strong>it’s illegal for anyone use or copy your work without your permission</strong>, but there are some exceptions and limitation to Copyright — <strong>Fair Use and Public Domain </strong> — both which we will cover in detail in this course.</p>\n\n\n\n\n\n\n\n\n\n<p>Typically, <strong><em class=\"redactor-inline-converted\">content creators, </em></strong><em class=\"redactor-inline-converted\"><strong>authors, artists, photographers, and other creative professionals</strong></em> need copyright protection for their work.</p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>► WHY DO I NEED TO TAKE THIS COURSE?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>The Internet is fast becoming a sanctuary of copyright abuse. </p>\n\n\n\n<p>The idea of freedom of information and the ease of posting, copying and distributing messages online has created a false impression that text and graphic posted online are except from copyright protection. However, this is not true.</p>\n\n\n\n\n\n\n\n\n\n<p>Copyright law was established not to give the author the right to deny his or her work to other people, but instead to encourage its creation. </p>\n\n\n\n<p>Copyright is a delicate balance between the rights of the creator and the public’s interest.</p>\n\n\n\n\n\n\n\n\n\n<p>When it comes to photos, images, and content, when in doubt, assume it’s subject to copyright and don’t use it without the appropriate permission. </p>\n\n\n\n\n\n\n\n\n\n<p>There are many free resources for images and videos, whether public domain, licensed creative commons or inexpensive stock images, that you can find as a resource in this course so you really shouldn’t need to use copyright-protected works for your blog, website, or video. </p>\n\n\n\n\n\n\n\n\n\n<p>My goal in this course is to help you better understand how to use images, videos, text, and other content in a way that is both legal and respectful of the author’s ownership rights. </p>\n\n\n\n<p>Fair Use may be an exception allowing you to use copyrighted content, but chances are you’ll find your content taken down by your host if the copyright holder disagrees. </p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>★</strong><strong> BONUS CONTENT &amp; TOOLS ★</strong><br></p>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>How to Use Content That Isn't Yours - </strong>quick but comprehensive summary of what you should do if you want to use any image, video, or content that isn't yours. Don't use anyone else's content until you've reviewed this!</li><li><strong>Resources of Images You Can Use Without Legal Trouble</strong>- it’s common practice to snag photos off Google Images, but just because everyone is doing it doesn’t make it right. In the course you will find a great source of websites you can use to find pictures without worrying about copyright infringement.</li><li><strong>Resources of Videos You Can Use Without Legal Trouble</strong> - You are free to embed any video from YouTube and other video platform on your blog or website as long as it gives you the embed option. That being said, you can’t necessarily use parts from videos on YouTube  to make mashups or as part of another video. Be sure to have permission to use any video that you are cutting, making changes to, or adding to a project.</li></ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n<p><em>Thank you for making this the best selling Copyright course on Udemy! I show my gratitude by consistently making new lectures and answering your questions in the course discussion!</em><br></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong>What are you waiting for?</strong></em> </p>\n\n\n\n\n\n\n\n\n\n<p><strong>★ Enroll right now!</strong></p>", 
    "end_date": null, 
    "title": "Copyright Easily Explained", 
    "price": 0, 
    "instructors": "Sam Mollaei, Esq.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741364_56b6_5.jpg", 
    "course_url": "https://www.udemy.com/copyright/", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T19:28:26Z"
}