{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is about copyright and how it affects YOU if you use other people's work in your own videos, courses, creative work, etc. It explains different types of copyright licenses, which ones you can use, and how you can use them.</p><p>The course is made for all levels. It's essential for beginners and for intermediate users, but it's also useful for people who think they know everything there is to know. Unless you have really spent time educating yourself properly about copyright, chances are that you don't know many facts that I present in this course. I was inspired to create this course after hearing many scary copyright beliefs by Udemy instructors, including those who \"took copyright courses in school\". Wow! You can run into dangerous legal problems if you don't know what you're doing! The fact is that <em>you simply don't know what you don't know</em>.</p><ul><li>The first part of the course are 27 myths that many people believe are absolutely true. These beliefs are so firmly entrenched that I've even experienced very unfriendly replies in the forums where people were fighting me over copyright facts, not my opinions. Just knowing about these myths is worth the low price of admission to the course.</li><li>In the second part I explain some of the main copyright licenses and related important issues about copyright. These are fair use, public domain, creative commons, releases, etc.</li><li>The third section gives you selected links to more detailed information about copyright as well as different resources where you can find good materials that you can use.</li></ul><p>.</p><p>Please watch the promo, the introductions, and all free previews to find out about the course. And don't forget to read the reviews. Remember, at Udemy you also have a 30-day money back guarantee. So, what are you still waiting for?</p><p><strong>***** If you use anything not created by you, you need to learn what's in this course *****</strong></p><p><em>Course updates: quiz, PDF resources, closed captions.</em></p>", 
    "end_date": null, 
    "title": "Copyright Myths – Public Domain, Fair Use, Creative Commons", 
    "price": "20.00", 
    "instructors": "Logan Susnick", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480170_2360_3.jpg", 
    "course_url": "https://www.udemy.com/copyright-myths-for-creative-people/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-19T06:26:06Z"
}