{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  You’re an artist… a graphic designer… you’re writing a book… you’ve developed a website, you’re a photographer, you’ve recorded some great music.. .. you’re a start-up.  </p>  <p style=\"\">  \t<strong style=\"\">In that case, you really need to understand how to protect your intellectual property. It could be your most valuable asset- and the easiest to steal.</strong>  </p>  <p style=\"\">  \t   Someone breaks into Coca Cola’s premises and steals a truck. That’s easy to sort out. A truck is physical. Coca Cola owned the truck, they taxed it, they registered it. They even insured it against theft.  </p>  <p style=\"\">  \t<strong style=\"\">Intellectual property</strong>  </p>  <p style=\"\">  \t   Your photos. Your designs. Your novel. Your music composition are your intellectual property, so you need to understand the basics of copyright protection.  </p>  <p style=\"\">  \t<strong style=\"\">What will you learn in this Copyright Basics: How to Copyright?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">The really basic stuff, like how to type a Copyright symbol © on your computer – you know, the little C in a circle in this copyright basics course.</li>  \t<li style=\"\">The difference between copyright, patenting and trade mark protection. Why protecting a product design is different from a graphic design.</li>  \t<li style=\"\">The ins and outs of registering copyright – and I’ll explain the dangers in using what’s called ‘Poor man’s Copyright’</li>  \t<li style=\"\">I’ll reveal all the misconceptions - and there are lots! For example – THERE IS NO EQUIVALENT of the Drugs Enforcement Agency. There ARE no copyright cops. There is no authority that will sort out disputes for you</li>  \t<li style=\"\">How to find out if someone has already registered a trademark</li>  \t<li style=\"\">How the music industry and book publishers are protecting themselves against internet Pirate sites.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">And I’ll show you how, even as a one-man band, you can get someone who infringes your copyright to desist - without going to law. </strong>  </p>  <p style=\"\">  \t<em style=\"\">In fact, I’ll share a real-life Case Study where another writer copied my own website - wholesale. How I stopped her in one day flat.</em>  </p>  <p style=\"\">  \t   AND, I’ll give you lots of really useful links. Plus some interesting anecdotes and history about copyright to amuse you along the way.  </p>  <p style=\"\">  \t   Take this Copyright Basics: course right now and learn how to copyright your intellectual property.  </p>", 
    "end_date": null, 
    "title": "Copyright Basics: How to Protect Your Work from Piracy", 
    "price": "20.00", 
    "instructors": "Len Smith, Sean Kaye", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38374_6d78_12.jpg", 
    "course_url": "https://www.udemy.com/copyright-how-to-protect-your-work-from-piracy/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-26T17:16:57Z"
}