{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">        This is a lawyers guide for non-lawyers on how to navigate the trademark registration process.  </strong>  </p>  <p>  \t        Let’s face it, starting a business is expensive and time consuming. Time is money. What you don&#039;t is an overly complicated law course that law students take on the ins and outs of intellectual property. Instead, you just need answers on whether you have a mark that is entitled to trademark protection and if not how to find a mark that is entitled to trademark protection. If you have a mark that is entitled to trademark protection, you need to know how to protect it. And of course, you want to know what kinds of legal remedies you are entitled to should someone be found to be infringing on your lawful trademark.  </p>  <p>  \t       The more information you have up front on things like intellectual property and brand protection, the more money you can save down the line with costly legal fees.  </p>  <p>  \t        Taking this course will give you the foundation you need to understand whether you meet the initial criteria to quality for trademark protection. This will include a in depth explanation of what qualifies as a mark and what kinds of marks are excluded from protection and why. In addition, you will have a better understanding of whether you need to hire a lawyer to register your trademark or can do it yourself.  </p>  <p>  \t        This course gives a nuts and bolts explanation of:  </p>  <p>  \t          What a trademark is  </p>  <p>  \t          What a trademark protects  </p>  <p>  \t          What kind of marks are eligible for trademark protection  </p>  <p>  \t          How to obtain trademark protection  </p>  <p>  \t          Remedies for trademark infringement  </p>  <p>  \t          What is the process for registering a trademark  </p>  <p>  \t        This course includes 50 minutes of training provided in 16 videos. This course is perfect for small business owners, entrepreneurs and anyone else who is interested in protecting their brand and intellectual property through a trademark.  </p>  <p>  \t        Although I am an attorney, this information is for educational purposes only and should not be construed as legal advice.  </p>", 
    "end_date": null, 
    "title": "Do it yourself trademarking", 
    "price": "20.00", 
    "instructors": "Lisa Gibson", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265178_7139_6.jpg", 
    "course_url": "https://www.udemy.com/do-it-yourself-trademarking/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-20T17:34:52Z"
}