{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Price includes HST. Enrolment limited to residents of Canada only.  </p>\n\n<p>  \t  Breathalyzer tests used by police to prove blood alcohol concentration (BAC) of drinking drivers may not always be reliable. How do you find out if the case you are defending is an example of an unreliable breath test? Canadian police need to check the calibration accuracy of their Intoxilyzers and other approved instruments. If they do not use reliable accessory equipment or they don't conduct the cal. checks properly then a defence lawyer may be able to argue that the breath test results are not scientifically reliable.  </p>\n\n<p>  \t      This breathalyzer evidential testing course explores the Guth wet-bath simulators used to heat and maintain liquid alcohol standard. Liquid alcohol standard is one of two types of alcohol standard contemplated by the Criminal Code of Canada. An alcohol standard is only a reliable standard if it is used properly. Currently, whenever a qualified technician uses a liquid alcohol standard in Canada, the contents of a 500 ml bottle of a weak solution of ethyl alcohol in distilled water are poured into a simulator jar. The contents of the jar are stirred by the simulator and heated to exactly 34.0 ±.2<strong>° C.</strong> The simulator is the device that holds the alcohol standard and maintains the standard at an even temperature.  </p>\n\n<p>  \t      This course explores the use and misuse of simulators as well as their calibration checks, inspection, and calibration. Students will use this information to prepare defence cross-examination of police officers and government experts. The course builds on the Recommendation of the Alcohol Test Committee, the Training Aids published by the Centre of Forensic Sciences, and the author's extensive experience in cross-examining qualified technicians and CFS experts. The course will take 2 to 3 hours to complete. It contains a number of video lectures and quizzes to help students develop their own checklists for preparation of cross-examination. By the end of this course you will have a good understanding of the operation of a wet-bath simulator as used in Canadian Intoxilyzer breath testing. The course also includes an extensive technical discussion of tips for wet-bath simulator litigation.  </p>\n\n<p>  \t      Some provinces in Western Canada now use dry gas alcohol standard during evidential breath testing. A lecture has been included discussing the use of dry gas or air gas.  </p>", 
    "end_date": null, 
    "title": "DUI Defence in Canada: wet-bath simulator alcohol standard", 
    "price": "50.00", 
    "instructors": "Stephen R. Biss", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184940_0a3a.jpg", 
    "course_url": "https://www.udemy.com/operation-of-wet-bath-simulator-alcohol-standard-in-canada/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-19T01:00:50Z"
}