{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   This tutorial teaches the basics of patent protection, aiming to help engineers gain some intellectual property awareness and lay a good IP foundation for them. People who complete this tutorial will become active members of a company&rsquo;s innovation source, understand the essence of true patent protection and be able to efficiently capture any valuable intellectual properties from their daily engineering work. This tutorial covers various IP topics in an easy to understand language from unique perspectives of engineers.  </p>  <p style=\"\">  \tThe tutorial includes downloadable &quot;Course Notes&quot; containing a transcript of all audio from the tutorial.  </p>  <p style=\"\">  \t<strong style=\"\">Earn an IEEE Certificate of Completion</strong>  </p>  <p style=\"\">  \tOnce you&#039;ve completed all lectures and have passed the final quiz with a score of 70% or better, request your certificate of completion from IEEE, good for 1 Professional Development Hour or .3 Continuing Education Units, available at no extra charge.  </p>  <p style=\"\">  \t<strong style=\"\">About the Author</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Dr. Matthew Ma</strong> has an extensive industrial experience having worked in the field of electrical and computer engineering with 2 published books, more than 30 publications and 14 U.S. granted patents. He has also played several roles in the intellectual property field as IP analyst, in- house IP counsel and Director of Intellectual Property in the last several years. He is an IEEE senior member and also a patent agent admitted to the U.S. Patent and Trademark Office.  </p>  <p style=\"\">  \t  His third book<em style=\"\"> <a href=\"http://www.amazon.com/Fundamentals-Patenting-Licensing-Scientists-Engineers/dp/9812834206\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Fundamentals of Patenting and Licensing for Scientists and Engineers,</a></em> World Scientific, 2009, has been featured in I<em style=\"\">EEE Spectrum</em> Oct 2009 issue. It has also been adopted by several universities as text books for their innovation courses in U.S., Norway and China. It is indeed his engineering background that motivated him to write his book about patents and this IEEE tutorial series from the unique perspective of engineers and inventors.  </p>  <p style=\"\">  \t  Matthew holds a B.S., M.S., and a Ph.D., all in electrical and computer engineering from Tsinghua University in Beijing, University at Buffalo and Northeastern U. of USA, respectively. He can be reached at <a href=\"javascript:void(0)\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">mattma@ieee.org.</a>  </p>", 
    "end_date": null, 
    "title": "Fundamentals of Patent Protection for Engineers", 
    "price": "30.00", 
    "instructors": "IEEE Continuing Education", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/93182_eb03_6.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-patent-protection/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-16T20:21:28Z"
}