{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Do you have a great idea for a business?</strong> Do you want to start your business as a UK limited company?  </p>  <p style=\"\">  \tThis course is all about getting you started by helping you setup a fully registered UK limited company. Whilst the thought of all the requirements and legal issues can be a daunting prospect, the fact is, it&#039;s <strong style=\"\">much easier to set up a UK company </strong>than you probably think - even if you are not a UK resident!  </p>  <p style=\"\">  \tAnyone can form a UK limited company, all you need is a few minutes and an understanding of the requirements.  </p>  <p style=\"\">  \t<strong style=\"\">Over 13 short lectures this course will show you:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">How to check if your business idea is viable</li>  \t<li style=\"\">The main types of company you can set up</li>  \t<li style=\"\">What details need to be provided and how to structure your company</li>  \t<li style=\"\">What you need to do after your company has been formed</li>  </ul>  <p style=\"\">  \tBecause the course covers the before, during and after, you will have a complete understanding of how to start your company and feel much more confident about running your business.  </p>  <p style=\"\">  \tNo previous experience is required and no technical or legal knowledge is necessary. We&#039;ll simply take you <strong style=\"\">step-by-step</strong> through everything you need to take care of to get your business trading legally as a UK limited company.  </p>", 
    "end_date": null, 
    "title": "How To Set Up A UK Limited Company", 
    "price": 0, 
    "instructors": "Paul Bryant", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112276_5a33_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-set-up-a-uk-limited-company/", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-29T14:19:19Z"
}