{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\">  \t<li style=\"\"><em style=\"\"><strong style=\"\">Join over 500 students who enrolled in the first 24 hours that the course was available!</strong></em></li>  \t<li style=\"\"><em style=\"\"><strong style=\"\">Learn what to do when someone steals your Internet content - from a practicing attorney!</strong></em></li>  \t<li style=\"\"><em style=\"\"><strong style=\"\">Get sample letter templates that you can put to use!</strong></em></li>  </ul>  <p>  \t<strong style=\"\">    Content creators who have</strong> <strong style=\"\">had their work stolen</strong> and reposted on the Internet know how awful that can be, both personally and for business.  </p>  <p>  \t            This course will teach you <strong style=\"\">how to respond to this stolen content</strong> and walk you through the following:  </p>  <ul style=\"\">  \t<li style=\"\">analyzing a stolen content situation</li>  \t<li style=\"\">finding the right ISP to send a takedown notice to</li>  \t<li style=\"\">getting the content taken down by drafting and sending a DMCA takedown notice</li>  \t<li style=\"\">responding to a takedown if you believe you had a right to post something</li>  \t<li style=\"\">understanding the responsibilities an ISP has regarding takedowns and the DMCA</li>  </ul>  <p>  \t                The course also includes <strong style=\"\">numerous resources</strong>, including:  </p>  <ul style=\"\">  \t<li style=\"\">sample takedown letters that you can use to get stolen content taken off the Internet</li>  \t<li style=\"\">a free Fair Use eBook to help you in your analysis</li>  \t<li style=\"\">links and addresses for popular sites that you can use to put this information into practice</li>  \t<li style=\"\">links to a number of helpful resources to help broaden your knowledge of the subject</li>  </ul>  <p>  \t<strong style=\"\">    If you create content on the Internet, this course is for you!  </strong>  </p>  <p>  \t        Legal Disclaimer: This course is for informational purposes only, and is not a substitute for real, specific legal advice. Viewing this course does not create an attorney-client relationship between the viewer and I. If you have a legal issue, please see an attorney for advice specific to your needs.  </p>", 
    "end_date": null, 
    "title": "How I get stolen content taken OFF the Internet", 
    "price": "25.00", 
    "instructors": "Zachary Strebeck", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398650_7c63_3.jpg", 
    "course_url": "https://www.udemy.com/understanding-dmca-takedowns/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T00:46:59Z"
}