{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>These 21 lessons cover everything that you need to know to give you a solid understanding of the training contract application process for commercial law firms. It is a step-by-step guide, starting from first notions of a career as a solicitor right the way to interview at a law firm.</p><p>The video lectures start with how you should go about selecting the law firm or group of law firms that could be right for you. Then, how to research them and the commercial market more generally so that you are able to talk with confidence both in your application and at interview about why you want to work with your chosen firm. There are hints and tips about how to get the necessary work experience to enable you to back-up your claim that you are interested in law. Next we go over detailed advice on how to respond to the different sections of the application form. Once you are invited to interview we tell you how to prepare, including what to wear and how to answer the questions. Finally, there is a section on video interviews with all the information you need to make sure you present yourself well.</p>In short it is a complete guide that condenses weeks of research into less than two hours. It has been made in consultation with law careers advisors at top UK universities as well as law firm graduate recruitment teams and interviews with current practicing solicitors who have successfully navigated through the process.", 
    "end_date": null, 
    "title": "How to get a training contract", 
    "price": "35.00", 
    "instructors": "Will Foulkes", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687116_bfd2_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-training-contract/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T15:29:00Z"
}