{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>To protect your business and your staff, it's crucial you have an understanding of HR and employment law. The consequences of getting your employment obligations wrong range from bad publicity, to loss of customers and tenders - and potentially even professional body intervention or an employee pursuing an employment tribunal claim.</p><p>In this course, Managing Director of Bhayani HR &amp; Employment Law, Jay Bhayani, provides a comprehensive introduction to all aspects of the law affecting your business as an employer.</p><p><br style=\"\"><strong style=\"\">COURSE STRUCTURE</strong></p><p><strong style=\"\">HR Law introduction. </strong>Find out more about course instructor Jay Bhayani, and what you'll be learning throughout this course. What happens when you employ people. New employees means your business grows and you have a higher turnover, which ultimately means higher profits. But what are the consequences of getting your employment obligations wrong?</p><p><strong style=\"\">10 HR Essentials:</strong></p><ol style=\"\"><li>Recruitment - get it right. When you have a vacancy to fill, it's important you start out on the right foot. This section covers correct recruitment practices. </li><li>Contracts of employment and staff handbooks. Protect yourself from future compensation claims, by ensuring all your employees have access to the correct literature. </li><li>Grievances - what are they? A grievance isn't always a piece of paper with the word 'grievance' written on it! Learn how to spot a grievance, and how to deal with them correctly. </li><li>Disciplinary issues. Get step-by-step advice on how to correctly discipline and performance-manage your staff. </li><li>Proactively manage sickness absence. It's crucial you know how to manage a long term sickness absence, return to work interviews, and capability proceedings. </li><li>Stress and disability. There's a difference between working under pressure, and working under stress. Learn how to spot the signs of stress and disability. </li><li>Redundancy and business reorganisation. Can you tell a redundancy situation, from a business reorganisation? </li><li>TUPE transfers. What is a TUPE transfer? And what are the implications of failing to adhere to TUPE implications?</li><li>Avoid discriminating. In a discrimination situation, there's no maximum amount of compensation a tribunal can grant. This section includes advice on how to create an inclusive workplace, and how to correctly handle discrimination complaints. </li><li>Training your staff. Why an effective staff training programme is crucial for protecting your business.</li></ol><p><strong style=\"\">Summary</strong>,<strong style=\"\"> further information and getting it wrong. </strong>What are the financial implications of getting your employment obligations wrong? </p><p><strong style=\"\">This course also features lots of additional resources, including:</strong></p><ul style=\"\"><li>letter templates and consent forms you can use when investigating a sickness absence</li><li>a step-by-step plan for correctly initiating, conducting, and concluding a disciplinary meeting or hearing</li><li>a step-by-step guide to successfully dealing with an employee grievance.</li><li>a redundancy procedure checklist, so you can check whether you're dealing with a genuine redundancy situation</li><li>a case study that explores some of the course's HR and employment issues in more detail.</li></ul><p> This course is presented by Jay Bhayani, Managing Director of <u style=\"\">Bhayani HR and Employment Law</u>.</p>", 
    "end_date": null, 
    "title": "HR Law - 10 Essentials For Your Business", 
    "price": "50.00", 
    "instructors": "Can Studios", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608980_27ff_2.jpg", 
    "course_url": "https://www.udemy.com/hr-law-10-essentials-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T10:24:39Z"
}