{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong>** Chris is the author of the #1 best selling business course on Udemy called \"An Entire MBA in 1 Course.\" ** </strong></p>\n\n\n\n<p><strong>** ACCORDING TO BUSINESS INSIDER: \"<em>Haroun is one of the highest rated professors on Udemy, so you can expect to be in good hands through the course of your education</em>.\" **  </strong></p>\n\n<p>What kind of legal company registration should I set up so that I protect my family and assets if my company gets sued? How do I protect my brand and products and make sure that nobody can copy them? What red flags and issues should I watch out for so that my investors can't take a larger percent of my company if my company has issues? This course will answer all of the aforementioned questions and many more. We will go through the life cycle of a company from founding to a stock market listing (initial public offering) to restructuring and or declaring bankruptcy if needed (there are significant benefits to doing this in many situations). </p>\n\n\n\n<p>The course is taught by an award winning business school professor who has started several companies and sits on many boards. He has dealt with many legal issues over the years and he will share a lot of his legal knowledge with you to ensure that you and your family have protection; please also hire a lawyer when starting a company and when dealing with contracts (don't ever do it yourself). Professor Chris Haroun is currently a venture capitalist in the San Francisco Bay Area during the day and a professor at several Bay Area graduate business schools during the evenings. </p>", 
    "end_date": null, 
    "title": "Intro to Business Law for Entrepreneurs (+Free Book!)", 
    "price": "20.00", 
    "instructors": "Prof. Chris Haroun", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739580_a312_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-business-law-for-entrepreneurs-mba-business-school/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T03:38:02Z"
}