{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "About the course:    This is a course for Indian Corporates.    Yes! Almost every company borrows from Bank for meeting their project and operating requirements.    When they borrow from Bank or Financial Institution, they provide securities which may be assets or properties of the company.    When they provide the assets as security to the lender, they are creating right over the assets in favour of the lender and this right is called as Charge and it should be  registered with regulatory authority called Registrar of Companies in India.    There are certain legal aspects related to registration of charge with Registrar of Companies.    Those legal aspects have to be complied in a given time frame.    In case, time frame could not be adhered, the delay should be condoned by appropriate authorities in compliance with Indian Companies Act, 2013.    Apart from that, when ever charges are modified it should be registered with Registrar of Companies. Similarly when the loans are closed and charges are satisfied, it should also be communicated and registered with Registrar of Companies and again they have to be done or completed in a given time frame.    The companies which borrow from Bank have to maintain Register of Charges for inspection by the share holders and creditors.    Similarly, the Registrar of Companies will maintain a register of charges of all the companies in the country for inspection by any one upon payment of prescribed fees.    Hence, registration of charges is very important for every corporate who have taken secured loans from Banks.    In case, the charge is not registered, it will go against the lender in the event of liquidation of the company because at that point, liquidator will consider or rank only those creditors whose charge were registered with Registrar of Companies. Hence, Registration of Charge is highly important from the Lender / Bankers point of view.    Terminology:    This course uses less legal terminologies. Efforts were taken to explain in simple English without legal jargons.    Material used in this course:    This course is presented through Video Lectures.    Course Structure:    This course is structured in self paced learning style.    Why take this course?    Registration of Charge is mandatory for every company taking secured loan from Banks / Financial Institutions. Hence, absolute knowledge on Charges and its related provisions, sections, rules in Companies Act, 2013 is must for every one who is dealing or will be dealing in charge matters.", 
    "end_date": null, 
    "title": "Legal and Regulatory aspects of Registration of Charges", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405004_1f0b.jpg", 
    "course_url": "https://www.udemy.com/legal-and-regulatory-aspects-of-registration-of-charges/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T04:45:47Z"
}