{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Protect your invention by filing a provisional patent application today!</p><p style=\"\">When the Constitution was passed, the founding fathers understood the need provide inventors with the ability to get patents.  Unfortunately, this process can be expensive and confusing.  However, provisional patent applications allow an inventor to reserve the right to get a patent and give the inventor a year to market and test his invention before having to go through the expense of filing a full patent application.</p><p style=\"\">More importantly, once a provisional patent application has been filed on an invention, the inventor can legally state this his invention is <strong style=\"\">patent pending</strong>. </p><p style=\"\">Online legal service companies such as Nolo and LegalZoom charge up almost two hundred dollars per provisional patent application.  Hiring an attorney will cost thousands more.</p><p style=\"\">With this course, you will learn how to</p><ul style=\"\"><li style=\"\">Learn how to draft and file your own provisional patent applications from an experienced patent attorney.  </li><li style=\"\">Get brainstorming tips for strengthening your invention for a stronger a provisional patent application </li><li style=\"\">Get access to all of the forms necessary to file a provisional application.</li></ul><p style=\"\">Buy this course now and begin the journey of being a successful entrepreneur and inventor.</p>", 
    "end_date": null, 
    "title": "Patent Pending: Drafting a Provisional Patent Application", 
    "price": "20.00", 
    "instructors": "Douglas Bridges", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448068_9db9_3.jpg", 
    "course_url": "https://www.udemy.com/patent-pending-in-one-day-writing-provisional-patents/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-15T20:10:45Z"
}