{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5>LET ME TAKE A GUESS AT WHY YOU'RE HERE</h5>\n\n<ul>  \t<li>You own a web services company and your sales are always up and down. <strong class=\"redactor-inline-converted\">No steady income = STRESS!</strong></li>  \t<li>You need more leads but you don’t know where to get them. <strong class=\"redactor-inline-converted\">All your efforts are useless!</strong></li>  \t<li>You spend way too much time writing proposals and not getting the job. <strong class=\"redactor-inline-converted\">So Frustrating!</strong></li>  \t<li>Your closing ratio is too low.  <strong class=\"redactor-inline-converted\">You know you can make more money, but how?</strong></li>  \t<li>Your business is not growing. <strong class=\"redactor-inline-converted\">You feel like you’re spinning your wheels!</strong></li>  \t<li>You know you should be using contracts or improve the ones you use. <strong class=\"redactor-inline-converted\">One Lawsuit could end your dreams. WOW! Have you ever really thought about that?<br>  </strong></li>  </ul>\n\n<p><strong class=\"redactor-inline-converted\">Yeah, I get it! Because I was in the exact same boat. Some days I didn’t know where my next job was going to come from or how I was going to pay my bills.</strong><br></p><p>Hello my name is Mike Carson<br>   I am a Corporate Trainer, Entrepreneur, and Internet Marketer. I have owned many successful startup companies and I have taught thousands of people from hundreds of companies in closed-door sessions how to maximize profits, generate qualified leads, win customers and close sales. For the first time I am offering YOU these same critically acclaimed and sought after secrets that I have learned from many years of experience and research. </p>\n\n<p>This extremely popular course presentation topic has been taught at events around North America and we have received excellent reviews from so many of our attendees. Now I am bringing it to you as an online course.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In this amazing one of a kind course you will learn the following:</strong></p>\n\n<ul>  \t<li>First I will show you where and how to get new leads using free and paid methods.</li>  \t<li>Next we will discuss the sales skills and tactics you need to know when approaching businesses.</li>  \t<li>Then we will discuss the 3 differences in the types of  requests you receive and how to qualify them to so you don’t waste time and increase your chances of converting your leads into clients.</li>  \t<li>We will also review some steps of the proposal process,  how to respond to an RFP, appear professional, and also the tools and resources available to help make you look more professional and efficient.</li>  \t<li>You will learn how you can increase your revenue with the little things and where your lost opportunities lie so you can land those “Bigger Fish” and turn every client into a long term revenue stream.</li>  \t<li>And finally you will learn about the importance of contracts, how to write a solid contract, the elements that should be included, and some little known “forgettable” items  you will need in case things go wrong.</li>  </ul>\n\n<h5></h5><em><strong>GET 15 BONUS DOWNLOADS WORTH $2150.00 FOR FREE!</strong></em>\n\n<p><strong class=\"redactor-inline-converted\">CONTRACT PACK</strong><br></p><ul><li>Web Design Contract</li><li>Website Maintenance Contract</li><li>Non-Disclosure Agreement</li><li>SEO Agreement</li></ul><p>\n\n</p><p><strong class=\"redactor-inline-converted\">RFP RELATED DOCUMENTS</strong><br></p><ul><li>Executive Summary</li><li>Web Development Proposal Template</li><li>No-Bid Letter</li><li>RFP Letter of Intent</li></ul><p>\n\n</p><p><strong class=\"redactor-inline-converted\">SALES RELATED DOCUMENTS</strong><br></p><ul><li>Company Profile Template</li><li>Sales Lead Document</li><li>Sales Lead Spreadsheet</li><li>Negotiating Essentials Training Report</li></ul><p>\n\n</p><p><strong class=\"redactor-inline-converted\">COURSE REFERENCE DOCUMENTS</strong><br></p><ul><li>Top 50 Business Directories For Local Marketing</li><li>Referenced Websites</li></ul><p>\n\n</p><p><strong class=\"redactor-inline-converted\">DOCUMENTS FOR YOUR CLIENTS</strong><br></p><ul><li>A Guide To Writing A Request For Proposal</li></ul><p><br> <strong class=\"redactor-inline-converted\">Who should attend?</strong><br> Freelancers, Web Designers, Web Programmers and Developers, CEO's, Marketing Agencies, Web Agencies, Project Managers and anyone with a web based service company that wants to grow their business, attract more clients, and increase revenue.<br> <br> If you are serious about taking your web business to the next level then you need to attend this course. You cannot get this kind of advice and consultation anywhere else. And at this price, you seriously don't want to miss out on this opportunity of a lifetime.<br> By applying our simple principles you will easily get the cost of this course back (and then some) the first time you respond to your next proposal request.<br> </p><p><strong>WHAT OUR STUDENTS ARE SAYING ABOUT THIS COURSE</strong></p>\n\n<p><em>“The RFP’s, Proposals and \nContracts session was very informative.  While I have a fairly good \nbackground in contracts, RFPs and proposals, the little “gotchas” (or as\n you say “meat &amp; potatoes”) portion of the session was well \ndiscussed with an obvious amount of personal experience.  The upsells \nportion was good as many times I think of a “package” deal when in fact \nwe are rewarded better if we consider what we really do by segment or \nproject phase. Thank You!”</em></p>\n\n\n\n<p>Steve Odlin</p>\n\n\n\n<p><em> “Where were you 10 years ago? \nThis information is golden. Thank you so much for putting this together \nand making it accessible to everyone looking to grow their internet \nservice business.”</em></p>\n\n\n\n<p>Joe Manga</p>\n\n\n\n<p><em> “I really Enjoyed the course. \n It was more informative than I expected.  I picked up several things \nthat we need to look into within our own contracts and proposals.”</em></p>\n\n\n\n<p>Jason Champion</p><p><br></p>", 
    "end_date": null, 
    "title": "RFPs, Proposals, and Contracts for Web Developers", 
    "price": "50.00", 
    "instructors": "Mike Carson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29246_5980_7.jpg", 
    "course_url": "https://www.udemy.com/rfps-proposals-and-contracts-for-web-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-10T16:50:03Z"
}