{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong>Course Description</strong><span style=\"\"></span></p><p style=\"\">Are you interested in quickly and easily learning about the field of U.S. immigration law, without having to spend lots of time researching or attending costly trainings? In this approximately one-hour course, you will get a comprehensive overview of what it is like to work or practice in the field of U.S. immigration law. You will learn the work opportunities, challenges, key terminology, and practice areas so that you can decide whether immigration is a good career fit for you. </p><p><strong>Dive Into the Practice of U.S. Immigration Law</strong><br></p><ul><li><strong>Define Immigration Law</strong></li> <li><strong>Master Basic Terminology</strong></li> <li><strong>Explore Sub-practice Areas</strong></li></ul><p><strong><br></strong></p><p><strong></strong><strong>Determine Whether or Not You Want to Work in the Immigration Field</strong></p><ul><li>Understand who hires an immigration professional and why</li> <li>Discover litigation vs. transactional opportunities</li> <li>Learn the good, bad, and ugly realities that impact your revenue stream and work satisfaction</li> <li>Complete exercises to assess your experience and “fit” with the field</li></ul><p><strong></strong><strong>Who Should Take This Course?</strong></p><p>This course is ideal for lawyers, law students, paralegals, document preparers, non-profit legal service providers, and others interested in exploring the field of U.S. immigration law for a potential job, career, or practice area.</p><p>No prior experience or materials are required - only your interest in learning about the field of U.S. immigration law!</p><p>     <strong>CONTENT AND COURSE OVERVIEW</strong></p><p>After learning about the dramatic experiences that led me to practice immigration law and ultimately to develop this course, you will learn exactly what is immigration law, and how it is distinguished from nationality law. You will then master and test your knowledge of key introductory immigration terms and acronyms related to the “status” of people who may seek the assistance of an immigration professional.</p><p>Next, you will discover the myriad of things one can be hired to do in the immigration field. Along the way, you will become familiar with six sub-practice areas within the field of immigration law, as well as litigation vs. transaction opportunities, to help narrow down your work/practice preference options. With this information, you will be able to determine what types of things within immigration that you may want to do, and, of course, what you would not want to do!</p><p>Every job or field has its highlights and drawbacks. You will explore the pretty good, the not so bad, and the downright ugly realities of working in the immigration field. You will also appreciate the impact that politics and policies have on the field and ultimately, on your job or practice.</p><p>Now it is time for you to determine whether you want to work in the field of U.S. immigration. You will complete the Experience and Interest Checklist to compare your background with the tasks and sub-practice areas associated with the immigration legal field. Then you will complete the \"Reality\" survey to get a sense of how satisfied (or dissatisfied!) you might be while working in the field of U.S. immigration. These tools will enable you to synthesize the information learned in the course. After analyzing your personal results, you will be able to comfortably answer the question “Should I Practice/Work In Immigration Law?”</p>", 
    "end_date": null, 
    "title": "Should You Practice/Work in Immigration Law? ", 
    "price": "25.00", 
    "instructors": "Tanya Lee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94380_c919_2.jpg", 
    "course_url": "https://www.udemy.com/should-you-practice-immigration-law/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T05:16:57Z"
}