{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Published on February 18, 2016</strong></p><p>Business plans are inherently strategic. The more you prepare and accurately plan your business, chances are the more successful it will be. So why wait? You Can start today with the resources and tools provided in this course.</p><p>People always ask for a list of fundamental tools that they can use to start their own business. From your business type to your business model, to your physical location, there are too many variables. the truth is, a list like that cannot exist. It is not easy to come up with a list that will work for everybody.</p><p>With that being said, this course will help you understand the business startup process from planning to marketing, to raising funds and to a point where your business will be an established system. Step by Step Guide To A Successful Business Plan is a course that will not tell you what to do because every business is different and that is why, the same strategy will not work for all. Rather, this course will teach you the knowledge you need to make your own strategy that will be the best fit for the type of business you want to start.<br></p><p>Join me and understand that every business started as a small idea in someone's mind but it reached success because the idea's founder strategically planned the business that helped it in reaching it's success.</p><p><strong><em>“Any time is a good time to start a company.”</em>  –Ron Conway, Noted Startup Investor, SV Angel</strong><br></p>", 
    "end_date": null, 
    "title": "Successful Business Plan: Step by Step Guide", 
    "price": "20.00", 
    "instructors": "Nafiz Iqbal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746580_de44_3.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-guide-to-a-successful-business-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T06:30:22Z"
}