{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tThe course will take maximum 8 hours to complete and is divided into 9 major course sections, consisting of 41 lectures and 18 quizzes. There will be an assignment at the end of the course, and on successful completion of this assignment, a certificate of '<strong>Tyoosis's  Certified Global Patent Search Analyst'</strong> shall be awarded from <strong>Monk Akarshala School of Intellectual Property.</strong>  </p>  <p>  \tThe course aims at enabling you become more efficient at searching relevant prior art. It provides the exact steps, techniques and strategies involved, from the point of beginning the search, till the point of creating the search report. Comprehensive and easy to understand course notes are provided to each participant. </p><p> Tyoosis's Global Patent Search Analysis',is a certification based online training programme, aimed at enabling you become more efficient at searching relevant prior art. This programme provides the exact steps, techniques and strategies involved, from the point of beginning the search, till the point of, creating the search report. At the end of this course you will be able to understand different concepts of prior art search, create strategies to conduct prior art search, locate and use different databases for prior art search, devise search methodologies to conduct prior art search, implement search efficiently by using effective and result-oriented keywords, prepare prior art search report as per industry standards successfully. This course will enable you to become eligible for a job as a Patent Search Analyst, the inventors can verify whether their invention is patentable, this course will help entrepreneurs make informed decision while entering into any Joint venture or Merger&amp; Acquisition activities, this course will enable you to conduct Patent searches for prior art or inventions being devised or filed in India, U.S., Europe and across the world.  </p>", 
    "end_date": null, 
    "title": "Tyoosis Global Patent Search Analysis", 
    "price": "20.00", 
    "instructors": "Monk Akarshala", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429942_a520_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-conduct-patent-search-and-analysis-using-global-databases/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T14:06:55Z"
}