{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Cuando entra en vigor un nuevo ejercicio fiscal ¿te has sentido confundido a causa de la ley fiscal? ¿Te ha sido difícil encontrar una solución para aclarar lo que el legislador o la miscelanea fijan como obligaciones? ¿Has sentido frustración y estrés en razón de que los consejos que brinda el SAT parecen contradecir la norma o no son lo suficientemente claros en su redacción? ¿Has recibido consejos por parte de la propia autoridad fiscal que resultan contradictorios y te han ocasionado mayor confusión? ¿Cuándo ha ocurrido una auditoria a tu negocio o a tu clientela has sentido esa necesidad de tener soportado materialmente el consejo que te brindo la propia autoridad fiscal para demostrarle con pruebas fidedignas y contundentes que no es correcta la liquidación pues seguiste los consejos que el propio SAT te brindó pero no tienes el documento a la mano porqué este no existe?  </p>  <p>  \t      En un entorno legalmente incierto dada la mala redacción y la técnica empleada en la elaboración de las normas fiscales, así como los consejos contradictorios que el Servicio de Administración Tributaria brinda, se deriva la urgencia de que los contribuyentes cuenten con medios para solucionar las dudas que el propio entorno fiscal ocasiona.  </p>  <p>  \t      Todos sabemos y estamos conscientes que, de la certeza que tu como contribuyente o asesor tengas en materia de la aplicación de la norma fiscal se derivaran a tu favor o en tu contra determinaciones que reconozcan o no el cabal cumplimiento de tus obligaciones fiscales. Y generalmente ésto es lo estresante.  </p>  <p>  \t      Pues cuando somos profesionistas responsables y/o contribuyentes cumplidos en el acatamiento de la norma, lo que deseamos todos y siempre, es saber cual es el exacto alcance de la norma para cumplir con lo que legalmente se debe al fisco y ocupar nuestros pensamientos en la ejecución del negocio con la tranquilidad debida al encontrarnos en el cumplimiento cierto de la obligación.  </p>  <p>  \t    Este curso básico se enfoca concretamente a enseñarte ¿cuáles son los medios con los cuales podrás lograr certeza para cumplir tus obligaciones fiscales a pesar del entorno de confusión que priva durante el ejercicio.  </p>  <p>  \t    Dividido en 5 módulos, este curso aborda:  </p>  <p>  \t    1.- El concepto de certeza tributaria y su composición como derecho humano.  </p>  <p>  \t    2.- Su exigibilidad en la ley.  </p>  <p>  \t    3.- Los métodos con los cuales jamás se logrará certeza.  </p>  <p>  \t    4.- Los métodos legales aplicables para lograrlo, tanto por lo que respecta a personas físicas o morales, sean en ambos casos mexicanas o extranjeras.  </p>  <p>  \t    5.- La desventaja de aplicación de éstos métodos.  </p>  <p>  \t    6.- La exposición de un caso práctico que actualmente está generando dudas en el RIF y el método para resolverlo.  </p>  <p>  \t    7.- La razón porqué éstos métodos te brindan tal certeza que de los mismos puedes lograr un traje fiscal a tu medida.  </p>  <p>  \t    Este curso es básico para comprender el conjunto de escritos libres y consultas que el contribuyente puede presentar ante el fisco de manera especial para resolver sus cuestionamientos, adquirir y preconstituir derechos, asistir a convocatorias e incluso solicitar al fisco la revisión de actos de molestia.  </p>  <p>  \t    Este curso básico e introductorio a la solicitud fiscal, te servirá para conocer que herramientas establece la ley a tu favor para que el fisco por fin resuelva todas tus dudas, aún respecto a situaciones reales y concretas de tu situación fiscal o no.  </p>  <p>  \t    Dirigido a abogados, contadores y empresarios interesados en lograr certeza y control en el cumplimiento de sus obligaciones tributarias e introducirse a los aspectos elementales de este tema.  </p>  <p>  \t            Enfocado especialmente a la protección de los derechos humanos del contribuyente en materia de certidumbre y petición ante la autoridad tributaria.  </p>  <p>  \t            El curso utiliza un lenguaje didáctico y parte de las reglas más generales de la relación entre el contribuyente y el fisco.  </p>  <p>  \t            El tiempo de realización de éste curso es de dos horas de capacitación, las que podrás administrar libremente.  </p>  <p>  \t    Y en todo momento se encuentra monitoreado por mí para exclarecer tus dudas enfocadas y relacionadas a los temas que este curso aborda.  </p>", 
    "end_date": null, 
    "title": "¿Cómo aclarar todas tus dudas fiscales?", 
    "price": "20.00", 
    "instructors": "José Antonio Apipilhuasco Ramírez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/290468_9145_3.jpg", 
    "course_url": "https://www.udemy.com/como-aclarar-todas-tus-dudas-fiscales/", 
    "currency": "USD", 
    "subject_name": [
        "Business Law"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-30T00:46:50Z"
}