{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>New Bonus Lecture added!</p><p>First congratulations! Buying or investing can be one of the most challenging and rewarding events in your life. So whether you are taking the first steps to understanding what real estate is about, interested in real estate as a career, or looking for key insights on buying your first home or investment property then this course is the one for you.</p>\n\n<p><strong>Through this course you will learn brand new techniques not available through traditional real estate courses or schools. I’ve put together these techniques using into 7 EASY STEPS that will lead you to being successful in any real estate deal.  </strong></p>\n\n<p><strong></strong>At the end of the course you will feel confident and well informed. </p>\n\n<p>Step 1: The Color of Real Estate: how using the right type of color influence buyers, rents and create winning profits and investments. </p>\n\n<p>Step 2: The Right Type of Flooring: factors like economics, cost or outcome may actually impact your decision.</p>\n\n<p>Steps 3-7: \"LATTE Steps\" Location, Affordability, Type, Technology &amp; Economy: we will dive into each corresponding letter to discuss the impact it has on the real estate deal. These sections are jam packed with the dos and don'ts as well as case studies and economic research methods. </p>\n\n<p>I also love Bonus Materials. So in the last section I have included not one, but four bonus lectures. </p>\n\n<blockquote>“Heather hosted a very informative and interesting Call4All.  With the popularity [of real estate] today, Heather was a wealth of information for our members and offered many great insights and advice for our listeners.” – Olivia Frick, NAWRB</blockquote>\n\n<p><br></p>\n\n<p>Are you ready? I’m ready! I can’t wait to have you so let’s get started.  </p>", 
    "end_date": null, 
    "title": "7 Proven Steps to Real Estate Success", 
    "price": "20.00", 
    "instructors": "Heather Boren", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663324_9ad7_4.jpg", 
    "course_url": "https://www.udemy.com/7-proven-steps-to-real-estate-success/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T22:20:41Z"
}