{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course you will begin to understand how a mortgage works from the bank's perspective. It will explain why a bank creates a promissory note and mortgage secured by real estate. We will break down the various parts of a note and you will have a good understanding of how to make money when the homeowners not paying their mortgage. you will hear terms such as promissory note, mortgage, assignment of mortgage, alonge and servicing. I will give you specific websites to go to where you can buy notes and mortgages as well as do investigative research so you can ascertain a good valuation. We will go over various strategies of performing collections on nonpaying homeowners. I will show you specific companies that can put your entire business on autopilot. This is a type of business that you can make money from anywhere in the world just by using a laptop computer or tablet. at the end of the course I will provide you with actual case studies on properties that I personally did the work out and took them from non paying to very excited paying and looking forward to living in the home forever. Also, I will show you how to make $5000 a month without using any of your own money or as much as $400,000 in a single year. </p><p>The course is structured in 10 parts and should take you about two hours to finish. It consists of mostly lectures along with illustrations and examples of what the paperwork looks like. </p><p>You should take this course if you are interested in finance or real estate. It will show you how to make money from anywhere in the world. You will learn about promissory notes and distressed debt as well as mortgages. This course will not only show you how to make money when a homeowner is not paying the mortgage but it will also show you how you can own property at deep discounts.</p>", 
    "end_date": null, 
    "title": "A Comprehensive Guide To Distressed Mortgage Notes", 
    "price": "20.00", 
    "instructors": "Frank Anthony Buono", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667224_4e2a_2.jpg", 
    "course_url": "https://www.udemy.com/comprehensive-guide-to-distressed-mortgage/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T22:08:40Z"
}