{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>***** COURSE MATERIAL IS UP-TO-DATE AS OF 01/01/2016 *****</p>\n\n\n\n<p>  \t      <strong>Start making money on Airbnb, </strong>learn secret Airbnb tricks &amp; tips, become the best Airbnb host you can be and increase the revenue from your Airbnb listing. </p>\n\n\n\n<p>  \t      Are you ever away from home? Why not make back your travel expenses and rent out your home? It's easy, safe and you can have your first guests within a week!  </p>\n\n\n\n<p><strong>What students say: </strong></p>\n\n\n\n<p><em>\"Fantastic Course! </em><em>I have read Jasper's Book and went through his Udemy Course. It is absolutely brilliant and I recommend it to any serious Airbnb hosts! David G\"</em></p>\n\n\n\n<p><em>\"Airbnb Saigon??? </em><em>Awesome course. Moving to Saigon for startup work and renting a 2 bedroom flat. I think I can use your tips to actually pay for cost of living!\"</em></p>\n\n\n\n<p>  \t      ++++++++++++++  </p>\n\n\n\n<p>  \t      About this course:  </p>\n\n\n\n<ul>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy </em><strong><em>30 day money-back guarantee</em></strong><em> - that's my personal promise of your success!</em></li>  \t<li><em>Includes my </em><strong><em>personal guidebook</em></strong><em> that I send to my guests that you can copy </em></li>  \t<li><em>Free surprise bonuses to increase your income even more!</em></li>  \t<li><em>Upon completion of the course, you will get access to the private Facebook group </em><strong><em>Airbnb Academy</em></strong></li>  \t<li><em>Includes several email templates that you can use to communicate with your guests</em></li>  \t<li><em>Includes unique pricing tool that you can use to optimize your prices </em></li>  </ul>\n\n\n\n<p>  \t      SEE HOW I MADE <strong>$60,000</strong> from renting out a single two bedroom apartment <strong>while traveling the world full-time!</strong> You can see proof of my earnings in the free preview video below.  </p>\n\n\n\n<p>  \t      Based on my huge success I am going to go over every single aspect of Airbnb hosting, I will not hold anything back. Everything I teach is easily implemented and designed to make the most from your Airbnb listing.  </p>\n\n\n\n<p>  \t      This course is for current Airbnb hosts that want to improve their earnings and for hosts who are starting out on Airbnb.  </p>\n\n\n\n<p>  \t      For those who haven't started yet, you might be sitting on a goldmine! Here are examples of how you can make money on Airbnb:  </p>\n\n\n\n<ul>  \t<li><em>Move in with your partner and rent out your entire house full-time</em></li>  \t<li><em>List your house only in the weekends and if booked go on a fun weekend trip </em></li>  \t<li><em>Rent out a spare room and make back </em><strong><em>up to half of your rent or mortgage </em></strong></li>  \t<li><em>Rent out an air mattress or couch </em></li>  \t<li><em>Rent out your entire place and go on a round the world trip (like I do!) </em></li>  \t<li><em>List your house and when booked stay with friends or family </em></li>  \t<li><em>Rent out your house only when you are on holiday and make back at least half of your travel expenses</em></li>  </ul>\n\n\n\n<p>  \t<em>++++++++++++++</em>  </p>\n\n\n\n<p>  \t      MOST COMMON QUESTION: IS IT SAFE?  </p>\n\n\n\n<p>  \t<strong>Answer:</strong>  </p>\n\n\n\n<ul>  \t<li>After hosting over 150 groups of guests and interviewing over 50 Airbnb hosts on my podcast I can tell you that issues (like guests misbehaving, stealing  your stuff or damaging your house) are extremely rare! </li>  \t<li>Airbnb has a $1,000,000 Host Guarantee policy in place that covers you in case your insurance fails to reimburse you</li>  \t<li>YOU decide who will stay in your house, you are 100% in control</li>  </ul>\n\n\n\n<p>  \t      +++++++++++++++  </p>\n\n\n\n<p>  \t      You will learn:  </p>\n\n\n\n<ol>  \t<li>How to create a killer title for your listing </li>  \t<li>The right way to compose a description </li>  \t<li>How to get stunning pictures of your space </li>  \t<li>How to prepare your house for your first guests </li>  \t<li>My two-step strategy for getting outstanding reviews </li>  \t<li>How to manage your listing from anywhere in the world </li>  \t<li>The correct settings for your listing </li>  \t<li>My personal pricing strategy that will get your place fully booked </li>  \t<li>Airbnb SEO, how to get your listing to page 1 of the search results </li>  \t<li>How to negotiate with your guests </li>  \t<li>How to communicate with your guests </li>  \t<li>What to do when a guest isn't happy </li>  \t<li>How to outsource the Airbnb management process </li>  </ol>\n\n\n\n<p>  \t      And much much more!  </p>\n\n\n\n<p>  \t      So you've read this far! Thank you.  </p>\n\n\n\n<p>  \t      <strong>You can watch 12 videos for FREE!</strong> Check them out!   \t  \t       One very important final point: if you own a house or you are renting a house and you are ever away from home, then you're missing out on serious $! <em>Every day you wait is costing you money…</em>  </p>\n\n\n\n<p>  \t      I know it is scary to have random people from the internet in your house, every single Airbnb host has had this concern. Worried? Here's the solution:  </p>\n\n\n\n<ol>  \t<li>Create your Airbnb listing </li>  \t<li>When you get a booking request, you can still reject the booking if you feel unsure about the guest</li>  </ol>\n\n\n\n<p>  \t      There is <strong>zero risk</strong> in creating a listing and it <strong>costs nothing! </strong>  </p>\n\n\n\n<p><strong>Click the “Take This Course”button and start your journey today.</strong></p>\n\n\n\n<p>  \t<strong>To your hosting success!!!</strong></p>\n\n\n\n<p><strong>  \t       Jasper Ribbers</strong>  </p>\n\n\n\n<p>  \t<strong><em>Author of  the #1 Amazon Best Seller “Get Paid For Your Pad - Maximize Income From Your Airbnb Listing\"</em></strong>  </p>", 
    "end_date": null, 
    "title": "Airbnb Hosting Mastery: Run a Business Using Your Own Home", 
    "price": "50.00", 
    "instructors": "Jasper Ribbers, Huzefa Kapadia", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/330598_960f_2.jpg", 
    "course_url": "https://www.udemy.com/airbnb-hosting-mastery-run-a-business-using-your-own-home/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T15:32:34Z"
}