{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you currently own rental property or have you wondered if running Airbnb or VRBO rentals are right for you? If so this course is for you. You will learn in detail the differences of being a traditional landlord and becoming a host of an Airbnb space. You will have a better understanding of the many decisions you need to make to see if this new rental model will work for you. You will get a spreadsheet to help you assess the financials – how much more money will you really make and is it worth your time and effort. The cheat sheets and videos will help you answer other burning questions like: What is involved in setup; How do I protect myself; What does it take to be successful in this new business; and much more. It might make sense to convert only 1 of your units and try it out first – take this video and make your own educated decision!</p><p><br>As a traditional landlord you might have a flexible schedule, freedom to travel and do what you want with your time.  Many students ask me does this change – will my lifestyle change? It might but it doesn’t have to. Take the course and figure out how to create a semi-automated process so you can retain your flexibility.  You can still travel the world, pay for school, or achieve your dreams with a short term rental – you just have to be smart about how you do it so you stay in control of your schedule.<br></p>", 
    "end_date": null, 
    "title": "Airbnb Hosting: Transitioning from a Traditional Landlord ", 
    "price": "20.00", 
    "instructors": "Sharon Cunnington", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/798990_d161_2.jpg", 
    "course_url": "https://www.udemy.com/airbnb-hosting-transitioning-from-a-traditional-landlord/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-20T18:19:31Z"
}