{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Best selling authors, Jake Stenziano and Gino Barbaro teach the first leg of their <strong>Wheelbarrow Profits</strong> Framework: “<em>Buy Right, Manage Right, Finance Right.</em>”  In the framework, investors will be instructed on how to purchase the asset correctly, based on using actual numbers.  We teach investors that Buying Right is where you make your money in real estate.  You will learn how to,</p><ul><li>Select an emerging market</li><li>Build a superstar team</li><li>Speak the real estate lingo so you sound like a pro</li><li>Find deals that you can create value</li><li>Negotiate like a pro</li><li>Discover what a “mom and pop” property is and how they will make you rich<span></span></li><li>Perform due diligence thoroughly</li><li>Takeover the property once it comes time for the closing</li></ul><p>We will show you why “Buy Right” is crucial to a successful real estate investment.  Let Jake and Gino, who have exploded their portfolio to over 500 units in only three years by utilizing their proven system, be your personal guide on your path to financial independence through multifamily real estate investing. </p><p>This course created by Jake Stenziano and Gino Barbaro, #1 Amazon Best-Selling Authors of “<em>WheelBarrow Profits: How To Create Passive Income, Build Wealth, And Take Control Of Your Destiny Through Multifamily Real Estate Investing.</em>” and founders of Jake &amp; Gino, LLC.<br></p>", 
    "end_date": null, 
    "title": "Buy Right, How To Acquire Well Priced Multifamily Properties", 
    "price": "20.00", 
    "instructors": "Jake Stenziano & Gino Barbaro", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683638_4bf4.jpg", 
    "course_url": "https://www.udemy.com/buy-right-how-to-acquire-well-priced-multifamily-properties/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T22:27:16Z"
}