{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t         Is real estate investing and flipping houses really as profitable as you see on TV ...or is it all hype?  </p>  <p>  \t         Is it actually possible for you to buy a house without using cash to credit?  </p>  <p>  \t         Can anyone really go from rags to riches through real estate?  </p>  <p>  \t         Led by the leading authority on creative real estate investing in North America, Phil Pustejovsky, <em style=\"\">Creative Real Estate Investing and Flipping Houses</em> will reveal how you can successfully invest in real estate, regardless of your current financial position, in today&#039;s market, right in their own backyard.  </p>  <p>  \t         You&#039;ll discover Phil&#039;s incredible true story, from his humble beginnings, homeless and living out of his truck, to living in a waterfront mansion in Florida.  </p>  <p>  \t         You&#039;ll learn what most people will never know about creative real estate investing and flipping houses...what works and what doesn&#039;t.  </p>  <p>  \t         You&#039;ll be able to determine if creative real estate investing is right for you.  </p>  <p>  \t         Best of all, you&#039;ll be entertained and inspired along the way, as Phil energetically and passionately shares the secrets he has learned from being a part of more than 1,000 real estate deals over the past decade. You&#039;ll see Freedom Mentor Reviews that are incredibly inspiring. You&#039;ll discover the Freedom Mentor cost. Plus, as a special bonus, you&#039;ll receive a FREE copy of his best selling book, &quot;How to be a Real Estate Investor&quot; as soon as you enroll. What are you waiting for? Get started learning now!  </p>", 
    "end_date": null, 
    "title": "Creative Real Estate Investing & Flipping Houses", 
    "price": "20.00", 
    "instructors": "Phil Pustejovsky", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33895_4616_7.jpg", 
    "course_url": "https://www.udemy.com/real-estate-investing-flipping-houses/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-30T13:10:07Z"
}