{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p>Für Eigentümer einer Ferienimmobilie ist die clevere Vermarktung des Objektes an Feriengäste eine Aufgabe mit zahlreichen Facetten und Möglichkeiten. Neben der eigenen Fewo-Homepage, dem Marketing über Social Media-Kanäle und Offlinemedien sowie einem kreativen Stammgästemarketing ist die richtige Nutzung von Unterkunftsportalen ein wichtiges Vermietungsinstrument, das es geschickt einzusetzen gilt.</p>\n\n\n\n<p>In diesem Kurs erfahren Sie, welche Grundlagen zu einem überdurchschnittlichen Vermietungserfolg auf Unterkunftsportalen führen und wie man als Vermieter das/die richtige(n) Portal(e) auswählt.</p>\n\n\n\n<p>Im <strong class=\"redactor-inline-converted\">ersten Abschnitt</strong> vermitteln wir Basiswissen zum Portalmarkt, erläutern das Erfolgsgeheimnis der Unterkunftsportale und bringen Ordnung in den vielschichtigen Markt der Unterkunftsplattformen. Zudem verschaffen wir uns einen Überblick im Dschungel der zahlreichen Preismodelle.</p>\n\n\n\n<p>Im <strong class=\"redactor-inline-converted\">zweiten Abschnitt</strong> kümmern wir uns um die Voraussetzungen für eine effektive Portalwahl. Dabei gehen wir auf die Bestimmung passender Gästezielgruppen ein, eruieren den zu erwartenden Marketingaufwand und stellen wesentliche Überlegungen zur Saisonalität und der ganzjährigen Vermietbarkeit an.</p>\n\n\n\n<p>Im <strong>dritten Abschnitt </strong>gehen wir detailliert auf die richtige Vorgehensweise bei der Auswahl erfolgversprechender Unterkunftsportale ein. Wir recherchieren, auf welchen Wegen potentielle Buchungsinteressenten zu den Portalen gelangen und untersuchen die Bedeutung von Positionen in den Suchmaschinen. Mit Hilfe eines cleveren Tools ermitteln wir an einem konkreten Beispiel, welche Unterkunftsplattformen für das Beispielobjekt attraktiv sind.</p>\n\n\n\n<p>Darüberhinaus beleuchten wir die  Inseratskosten auf den favorisierten Portalen, werfen einen ausführlichen Blick auf zielgruppengerechte Nischen- und Spezialportale und geben Tipps für eine schlanke und zeitsparende Verwaltung genutzter Portalkanäle. Hilfreiches Downloadmaterial für eine begleitende Recherche passender Portale für das eigene Ferienobjekt ist verschiedenen Lektionen beigefügt. <br></p>", 
    "end_date": null, 
    "title": "Die besten Portale zur Ferienvermietung finden", 
    "price": "50.00", 
    "instructors": "Christine und Tilo Boy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789390_6561.jpg", 
    "course_url": "https://www.udemy.com/die-besten-portale-zur-erfolgreichen-ferienvermietung-finden/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T08:39:06Z"
}