{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>***Over 900 Students Currently Enrolled!***</strong></p>\n\n<p><strong><em></em></strong></p>\n\n<p><em><strong>LATEST: Course Updated Again for May 2016</strong></em></p>\n\n<p>-------------------------------------------------------------------------------------------------------------------<br></p>\n\n<p>  \t        Do you enjoy riding around looking at old houses? Have you always wanted to fix and flip a house but you were not sure where to start? Could you use some extra income in your life?  </p>\n\n<p>  \t                          If you answered yes to any of these questions, then this course is for you!  </p>\n\n<p>  \t                  This course will teach you what you need to know to Fix and Flip a real estate deal in your city. The course teaches you how to use a team of real estate professionals to Find &amp; Finance, Fix and Sell an investment property for you.  </p>\n\n<p>  \t<strong>Learn to Fix and Flip Real Estate In Your Free Time</strong>  </p>\n\n<ul>  \t<li>Find the low cost houses that aren't always available through your real estate agent</li>  \t<li><strong></strong>Learn what to say to get hard money lenders to lend you money</li>  \t<li>Build a relationship with a general contractor who will oversee all of the repairs on your investment property</li>  \t<li>Sell your investment property to realize significant profit</li>  </ul>\n\n<p>  \t<strong>Leverage The Efforts Of Others To Make Profit In Real Estate</strong>  </p>\n\n<p>  \t                        We all know that the quickest way to see success in business is to:  </p>\n\n<p>  \t                      1.) Put together a team of people who know more than you, and…  </p>\n\n<p>  \t    2.) Add value by helping others to meet their goals  </p>\n\n<p>  \t                      The methods that you will learn in this course will show you how to find the real estate agents, wholesalers, hard money lenders and general contractors, who will practically do your real estate deal for you. The best thing is that they will make money and you will make money, so it is a win-win/mutually beneficial business relationship.  </p>\n\n<p>  \t                        What makes this course unique from the many real estate courses on the market is that it is designed for individuals who want to maintain their day job and who have little knowledge about real estate. The lessons will teach you the practical knowledge and the \"in the field videos\" will show you how we apply these principles in real life, to make money. It is a great course that will allow you to learn more about real estate while you begin to gain experience and generate a profit.  </p>\n\n<p>  \t                   This course has been designed in a way that will allow you to “fix and flip\" a house, <strong>without having to do any repairs yourself!</strong> Not only that, but I've designed this course in a way that will have real estate professionals <strong>bringing you deals</strong>, so there is no need for you to waste your valuable time searching for that great real estate deal. Best of all, I provide you specific information on what to say to real estate professionals such as the agents, wholesalers, hard money lenders and general contractors, <strong><em>so that they want to do business, with YOU</em></strong>.  </p>\n\n<p>  \t                  This course covers all of the things that I wish I had known when I first began investing in real estate. I have placed an extra emphasis on teaching this course as if we were sitting in the same room, chatting about real estate investing. In addition I have added <strong>Closed Captions </strong>(optional), to the videos, for your convenience.  </p>\n\n<p>  \t                            In this course, I will take you on live \"days in the field\" where you get to see properties that we are considering purchasing, as well as properties that we have fixed and flipped in the past.  </p>\n\n<p>  \t                            I will be updating this course often with new information and videos. Besides the extensive knowledge and resources that I provide you in this course, the biggest benefit, in my opinion, is the fact that you have access to ask me and your classmates questions, at any time in this course.  </p>\n\n<p>  \t                            Whether you want to complete a deal, learn more about real estate or just network with like minded individuals, this course is for you! <strong>Enroll in this course now to get started</strong>. With Udemy's money back guarantee, you have <strong>nothing to lose and everything to gain</strong>! Looking forward to the opportunity to interact with you and to help you learn how to make money fixing and flipping real estate!  </p>", 
    "end_date": null, 
    "title": "Discover How To Fix and Flip Houses, Step by Step!", 
    "price": "20.00", 
    "instructors": "Khari Parker", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343768_7b4c_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-extra-money-fixing-and-flipping-real-estate/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T23:58:48Z"
}