{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Após concluir este<strong style=\"\"> Crash Course em Mediação Imobiliária</strong> terá uma compreensão profunda da atividade como um todo e do impato das suas várias compenentes. Conhecerá e saberá quantificar as diversas atividades necessárias à conclusão do negócio imobiliário. Dominará um conjunto de ferramentas que lhe permitem planear, executar e controlar com sucesso uma atividade de mediação ou angariação imobiliária.</p><p style=\"\"><strong style=\"\">Ganhe uma Vantagem Competitiva com a Metodologia e as Ferramentas Aprendidas neste Curso</strong></p><ul style=\"\"><li style=\"\">Conheça aprofundadamente o seu mercado</li><li style=\"\">Entenda o Fluxo de Atividades do negócio imobiliário</li><li style=\"\">Compreenda os modelos alternativos da atividade</li><li style=\"\">Saiba quantificar os gastos e investimentos</li><li style=\"\">Aprenda como planear e orçamentar a sua atividade</li></ul><p style=\"\"><strong style=\"\">Alcance uma compreensão superior do mercado em que desenvolve a sua atividade</strong></p><p style=\"\">Assumindo o ponto de vista do mediador imobiliário,que muitas vezes coincide com o do angariador imobiliário, fazemos uma análise detalhada do mercado imobiliário em que atuamos. Compreendemos como o definir e sgementar, e como o quantificar. Procedemos para um estudo profundo do fluxo de atividades do negócio da mediação imobiliária. Aprendemos como as quantificar e entendemos como se articulam, compreendendo assim o impato de cada uma no alcance dos nossos objetivos. Cobrimos igualmente os gatos e investimentos inerentes à atividade. No final, utilizamos um modelo que permite planear toda a atividade e elaborar o orçamento de uma empresa de mediação imobiliária, comportando inclusive a análise de vários cenários de mercado.</p><p style=\"\">São propostos inúmeros exercícios práticos para todas as partes da matéria, apresentando-se a resolução detalhada de alguns. No final do curso terá uma compreensão superior e uma perspetiva diferente da atividade de mediação imobiliária.</p>", 
    "end_date": null, 
    "title": "Dê Cartas Na Mediação Imobiliária!", 
    "price": "20.00", 
    "instructors": "Anika Dzus", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452616_f012_3.jpg", 
    "course_url": "https://www.udemy.com/de-cartas-na-mediacao-imobiliaria/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T21:57:04Z"
}