{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">Tools and Tips to Sell Your Home Online</strong></em><br style=\"\"> </p><p style=\"\">&quot;Tim Kasnoff is the instructor for this course. For over 25 years he has been involved in the real estate industry as an Agent, Manager, Internet marketing trainer and consultant, Internet startup executive and Web architect. </p><p style=\"\">The goal of this course is to teach you, the &quot;For Sale by Owner&quot; (fsbo) seller, the marketing tools that real estate agents have used for many years. This course will teach you how to save hours and thousands of dollars while marketing your home online.&quot; </p><p>This &quot;Online Primer&quot; will walk you through 5 areas geared toward reducing time, money &amp; confusion when you get the &quot;Online Marketing&quot; section of your fsbo journey.</p><p>The areas we will discuss are:</p><p><strong style=\"\">Getting Organized and Oriented:</strong> This section contains a few simple ideas that will help in getting and staying organized. I introduce you to a FREE online tool that will make creating InfoPics (Informational Photos) a breeze.</p><p><strong style=\"\">Leveraging Google:</strong> We will have explored several google tools that will help make marketing your home easier. From gmail and google+ to YouTube and Alerts (and best of it&#039;s FREE!!!)</p><p><strong style=\"\">The Directories:</strong> With dozens of Classifieds, FSBO directories, listing platforms (MLS) and social media sites where do you start? I will explain the different features of each and show you several other sites as well.</p><p><strong style=\"\">Social Media:</strong> We will explore several social media sites, highlighting the benefits of each. What are Hashtags#??? What to Post? When to Post? How about a system that pre-schedules your postings to ALL of your social media platforms?</p><p><strong style=\"\">FSBO Tips:</strong> A recap of Ideas, tips and tools that make getting listed and leveraging social media easier. Just one or two of these are worth the value of this course.</p><p>We have also created a website, fsboED with additional information. <br style=\"\">We hope you find this useful and wish you luck in your FSBO venture.</p>", 
    "end_date": null, 
    "title": "fsboED - For Sale By Owner \"Online Marketing Primer\"", 
    "price": "30.00", 
    "instructors": "Tim Kasnoff", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236638_ca68_3.jpg", 
    "course_url": "https://www.udemy.com/fsboed-for-sale-by-owner-online-marketing-primer/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-03T20:00:22Z"
}