{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>My name is Brad Lindley. I have been managing rental property for 6 years. As a licensed Realtor for the past 4 years, I have managed over 50 rental properties for clients across Louisiana. I currently have twenty-five 5-star reviews on Zillow. I also own a fourplex, a single family home, and 4 mobile homes that are all tenant occupied. I know landlords and I know tenants from all walks of life, and more importantly, I know what they are looking for and what they are thinking.</p><p>This course will teach you a variety of tools, tips, and tricks that will focus on two main course objectives: <strong>Reduce Vacancy Time</strong>, and <strong>Maximize Rent Rates</strong>.<br><br><strong>Vacancy is the number one enemy</strong> of a property owner! As a property manager, I picked up a client that had a vacant condo unit for 6 months that was under contract with a \"professional\" property management company! Think of the all those lost rents. And we know that just because the rent isn't coming in, doesn't mean the mortgage bill, the association fee, or the tax and insurance bill stop! He reached out to me in desperation. <strong>Using the tools in this course, I leased his property in a mere <em>THREE DAYS</em></strong>! I have done this multiple times!<br><br>There is something for everyone in this course, from the person considering buying their first property, to the new Landlord, to the professional property manager!</p><p>I will share with you my years of practical and professional experience in what works and what doesn't. <strong>You will learn:</strong></p><ol><li>Proper <strong>attitude and mindset.</strong></li><li>How to make your property <strong>Rent Ready</strong> to maximize results for as little money as possible!</li><li>All techniques of <strong>Physical Advertising </strong>(much more than one sign in your yard!)</li><li>An <strong>in-depth study</strong> of <strong>multiple Online Advertising techniques</strong> to get your property exposed to <strong>thousands of renters</strong> in your local area. I will show you EXACTLY how to prepare the perfect advertisement and on what sites to post it on. Your <strong>phone will be ringing off the hook with leads</strong>!</li><li>What to do after the signs and Ads are up to<strong> guarantee success</strong>! Most people don't get this part, even professional property managers that I have worked with! If you fail here, then all of your previous work is for nothing!</li><li>What to do before, during, and after the showing.</li></ol><p>*******And finally towards the end of this course, I will share a technique that will <strong>TRANSFORM</strong> the way you show property <strong>FOREVER!</strong> This technique will supercharge the power of your showings by giving your property an aura of <strong>SCARCITY</strong> and <strong>VALUE!</strong> I will give you a real example in which this technique had a prospect <strong>BEGGING</strong> me to lease the property and gave me <strong>SIX MONTHS in ADVANCE CASH for rent at the very first showing!</strong>*******</p>", 
    "end_date": null, 
    "title": "How to Successfully Advertise Your Rental Property", 
    "price": "20.00", 
    "instructors": "Bradley A. Lindley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461766_0f14_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-successfully-advertise-your-rental-property/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T01:41:32Z"
}