{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Buying your own home is the American Dream, especially once  you get into your home. But the home buying process can be confusing and  stressful, and the outcome can be costly and disheartening, unless you know  what you are doing going into the purchase process.</p>  <p style=\"\">This course is designed to give home buyers all the  information they need to protect themselves and make smart decisions throughout  the home buying process.&nbsp; This course is  designed to make buying your home the fun and enjoyable process it should be.</p>Anybody buying a home will benefit from this course as well  as anybody new to the real estate industry including new real estate agents,  loan officers or escrow officers.&nbsp; After  taking this course you will understand what a home buyer needs to do to get the  best home while protecting their interests as much as possible.  <p style=\"\">The value of this course for anybody planning to buy a home  far exceeds the price of the course.&nbsp; The  course will teach you how to get the home you want at the best possible price  and how to renegotiate to save even more money after your property is already  under contract.&nbsp; The instructor is also  offering to help you find the best agent in your area.&nbsp; And in the end, if this course helps you get  the home of your dreams, you couldn’t be thankful enough for having taken the  course.&nbsp; </p>    ", 
    "end_date": null, 
    "title": "How to Buy a Home: Expert Advice on the Whole Buying Process", 
    "price": "20.00", 
    "instructors": "Trevor Roberti", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/52385_d89f_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-buy-a-home-expert-advice-on-the-whole-buying-process/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-04T23:21:21Z"
}