{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  How can I invest in real estate if I don&#039;t have any money??  </p>  <p style=\"\">  \t  This is a common question from aspiring investors, and the reason why they believe they can&#039;t get started.<br style=\"\">  \t   But don&#039;t worry, this course will show you how to raise money from private investors to fund your deals, even if you don&#039;t have any prior experience!<br style=\"\">  \t <br style=\"\">  \t   The course is taught by Vinod Chopra, a seasoned real estate syndicator from California, who specializes in buying commercial properties in emerging markets.  </p>  <p style=\"\">  \t   Vinod has raised capital through various syndications and his company now manages over $55 Million worth of assets.  Just recently, he raised $1.9 million in 35 days!!! He reveals his vast knowledge and secrets in this course.  </p>  <p style=\"\">  \t   The course consists of easy-to-follow training videos that break the syndication process down step-by-step.  You will learn how to find good deals for your syndication, how to attract investors, what SEC regulations you need to follow, and how to close the deal and profit in the process.<br style=\"\">  \t <br style=\"\">  \t   Vinod also explains the various ways to structure a syndication so that you can not only earn money upfront, but also earn monthly cash flow and a large payday when you opt to sell the property.  </p>  <p style=\"\">  \t   This course lays out the exact strategy that Vinod uses to buy large multi-family and commercial properties.  If you want to start buying properties without having to put any of your own money in the deal, then this course is a must have for you!  </p>", 
    "end_date": null, 
    "title": "How to Raise Capital For Your Real Estate Deals", 
    "price": "50.00", 
    "instructors": "RealEstate U", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/264906_4fc9_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-raise-money-for-your-real-estate-deals/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-20T03:44:37Z"
}