{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        Investing in Commercial Real Estate doesn’t have to be any different than investing in residential real estate. The only difference is the number of Zeros. This course aims to overcome one big challenge with investing in commercial real estate, finding the true owner so that you can personalize your marketing, get past the gatekeepers and negotiate the deal.  </p>  <p>  \tI used The Strategy Outlined In This Course To Find, And Purchase A 24,000 Square Foot Retail Strip Center And A $60,000 Billboard. It will work for what you are looking at doing.  </p>  <p>  \t<strong style=\"\">Learn and Master how to get the owners’ name of any commercial real estate property you are looking at buying, thus bypassing the gatekeepers and getting the deal.</strong><br style=\"\">  </p>  <ul style=\"\">  \t<li>Learn how to double your marketing efforts with the list you currently have.</li>  \t<li>Learn how to find prospects through associations and Google Places –Free.</li>  \t<li>Learn the difference between List Brokers and List compilers.</li>  \t<li>Know the questions to ask a List Broker that could save you thousands.</li>  \t<li>Learn how to create awesome looking direct mail pieces using mail merge.</li>  \t<li>Find all the corporation data in one place for FREE!</li>  \t<li>A Resource Guide that includes links to <strong style=\"\">Free </strong>low cost Clip Art and Photo sites.</li>  \t<li>MP3 downloads of all lectures.</li>  </ul>  <p>  \t<strong style=\"\">A Powerful Weapon in Your Marketing Arsenal.</strong>  </p>  <p>  \t        Learning the fundamentals of finding the owner(s) to any commercial real estate property or business (es) you are looking at buying <strong style=\"\">puts a powerful and useful strategy</strong> in your hands. This process is easy to learn and is the foundation for all business deals that you will encounter in the Commercial Real Estate investing field or in the business buying arena.  </p>  <p>  \t        If you hired a lawyer to sue a company, he would follow the same process I show you for a 10th. of the cost.  And afterwards you have the complete process documented and are able to use it over and over again. Use it on your first Commercial Real Estate Deal to your 100th deal.  </p>  <p>  \t        The ability to get past the gatekeeper that is a skill that is in demand in this new economy because people are just overwhelmed with content, so if your content (sales letter) makes an impression you will more than likely get a chance at that commercial real estate deal that your competition won’t.  </p>  <p>  \t        In the commercial real estate investing business your prospect list is what can make or break you. Getting the names of the &quot;Real&quot; owners of properties and businesses that you want to purchase is critical to making money.  </p>  <p>  \t<strong style=\"\">Contents and Overview:</strong>  </p>  <p>  \t        This course is suitable for the beginner real estate investor to the advanced, through this course of 17 lectures and more than 2 hours of content, you’ll learn all of the marketing fundamentals and establish a strong understanding of the concept behind getting past the gatekeepers and getting the real estate deal.  </p>  <p>  \t              Starting with the creation and setup of your Excel spreadsheet that you will use as your prospect list this course will take you through finding prospects for Free from several sources to creating a sales letter and envelope that gets you past those gatekeepers. Additional, I show you how to print these direct mailers right in your home office, after finishing this course so you can apply what you just learned. How is that for Action?  </p>  <p>  \t              After completing this course you will have the working knowledge of how to research and find the owner of any commercial property or business you are looking at interacting with. As well you will have a crash course in direct mail marketing that will serve any business.  </p>  <p>  \t              You will be able to work alongside the author, in this screen capture course, as you work through each concept in this course, complete with section quizzes, you’ll be able to fully grasp each concept before moving onto the next. I show you step by step in each one of the screen capture videos what to do, then all you have to do is follow along.  </p>  <p>  \t<em style=\"\">What this course is not:</em>  </p>  <p>  \t<em style=\"\">I do not cover items that are freely published by Udemy as these are available for free from Udemy. <strong style=\"\">I present you with real evidence of what works to get your direct mail opened and to get that deal.</strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\"></strong></em>  </p>  <p>  \t<em style=\"\">I will not &quot;look at your mailing&quot; and &quot;tell you what&#039;s wrong&quot;. I don&#039;t know your niche or your knowledge - and it would be reckless of me to advise you. <strong style=\"\">You must have something (anything!) you can mail and say to your target market.</strong></em>  </p>  <p>  \t<em style=\"\">I won&#039;t teach you anything that in any way breaks Udemy&#039;s terms, rules, conditions etc, whether they are written or implied </em>- <strong style=\"\"><em style=\"\">I value my Udemy earnings too much!</em></strong>  </p>  <p>  \t<em style=\"\">This course is not backed or produced by Udemy - it&#039;s all my own work ... but the excellent Udemy staff are there to help you, too, of course!</em>  </p>  <p>  \t      But, if you want my personal &quot;insider&quot; information - you need to get this course now ... right this minute.  </p>  <p>  \t<strong style=\"\">Every minute you delay is actually COSTING you money ....</strong>  </p>  <p>  \t<strong style=\"\">Enroll now!</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\"></strong></em>  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "How To Get Past The Gatekeepers & Get That Real Estate Deal.", 
    "price": "35.00", 
    "instructors": "Pat Gage", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346566_7227_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-past-the-gatekeepers-and-get-the-deal/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-16T20:26:38Z"
}