{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t Investing in multi-family properties has become a popular investment strategy among real estate entrepreneurs since the financial crises of 2008.  The demand for rental apartments has surged as many home owners have lost their properties due to foreclosure while new home buyers struggle to obtain bank financing.  </p>  <p style=\"\">  \t This course will teach you the various ways you can profit from the recent multi-family boom.  The course consists of easy-to-follow training videos that offer practical, actionable advice.  You will learn the exact steps you need to take to find, analyze, and close your first deal!  </p>  <p style=\"\">  \t The course is taught by Albert Dweck, a seasoned New York City investor and NYU professor.  This course is NOT theoretical.  Albert uses several of his own recent deals to illustrate the investing process.  He explains how he finds deals, values perspective properties, arranges financing, and closes the deal!  </p>  <p style=\"\">  \t  He goes in-depth with the numbers behind a deal and explains what you should look for in a good deal.  </p>  <p style=\"\">  \t The course also explains what pitfalls to avoid, which are common among novice investors. <br style=\"\">  \t<br style=\"\">  \t  By the end of this course you will not only have the blueprint for profiting from multi-family properties, but you will also understand the mindset that experienced investors have when approaching a multi-family deal. <br style=\"\">  \t<br style=\"\">  \t  You should take this course if you are looking for a solid investment vehicle that will lead you towards financial freedom.  </p>", 
    "end_date": null, 
    "title": "How to Buy Your First Multi-Family Property", 
    "price": "50.00", 
    "instructors": "RealEstate U", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/264898_e52d_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-buy-your-first-multi-family-property/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-20T03:32:20Z"
}