{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will teach investors how to create an effective business plan for their real estate business. We call it our <strong>Credibility Book</strong>, a business plan that details an investor’s strategy, any current holdings, a plan to purchase undervalued assets, case studies and their personal plan on how to purchase future properties and the strategy they utilize to create value for themselves and their investors.</p><p>This course is for <strong>any investor</strong> who wants to,</p><ul><li><strong>Crystallize their business plan</strong></li><li><strong>Focus on a specific niche</strong></li><li><strong>Be able to communicate their plan clearly to potential investors and bankers</strong></li><li><strong>Be prepared for their next deal</strong></li></ul><p>You will learn from a banker on how he was impressed by our credibility book by the attention to detail and professionalism we exhibited, (the exact model we will be teaching you). It was all there structured for him and easy to consume and understand. This book separated us from the novice beginner and helped us to establish those crucial relationships in real estate with our bankers and investors.</p><p>This course is <strong>not only for investors</strong>, but can also be employed by </p><ul><li>Other real estate professionals who want to convey their message to their clients. </li><li>Real estate brokers who wants to highlight out their strategy to sell homes.</li><li>Fix and flippers who wants to raise private money </li></ul><p>Each will all find our credibility book indispensable to delivering the message.</p><p>As a student, you can expect to,</p><ul><li>Be able to design your own personal credibility book</li><li>Learn how to build case studies</li><li>Begin to focus on a niche in real estate (if you don’t have one already) </li><li>Emerge as a professional with “<em>credibility</em>”</li></ul><p>To help you build your book, in this course you will be receiving,</p><ol><li>Our Credibility Book to model as you build your own</li><li>A guide to designing your Credibility Book</li><li>A template used for you to easily design your own Credibility Book</li><li>Video lessons that show you how to build case studies. We have also included video lessons that highlight the success of our case studies and how we structured them.</li></ol><p>This course created by Jake Stenziano and Gino Barbaro, #1 Amazon Best-Selling Authors of “<em>WheelBarrow Profits: How To Create Passive Income, Build Wealth, And Take Control Of Your Destiny Through Multifamily Real Estate Investing.</em>” and founders of Jake &amp; Gino, LLC.</p>", 
    "end_date": null, 
    "title": "How To Create A Successful Financing Credibility Book", 
    "price": "25.00", 
    "instructors": "Jake Stenziano & Gino Barbaro", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682920_504f.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-successful-financing-credibility-book/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T23:52:45Z"
}