{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Cuando <strong>mires el vídeo arriba</strong> comprenderás el por qué a través de este curso aprenderás los fundamentos sobre Propiedad Horizontal contenidos en la Ley que regula la Propiedad Horizontal en Panamá, lo cual te dará las herramientas y conocimiento para principalmente <strong>mantener</strong> e <strong>incrementar</strong> el valor de tu vivienda.</p><p><strong>Incrementa El Valor De Tu Propiedad</strong></p><ul><li>Aumenta tu conocimiento teórico y pon a prueba lo aprendido creando proyectos de beneficio para toda la propiedad horizontal</li><li>Crea una oportunidad para que ganes conocimientos que puedan generar ingresos adicionales para ti (por ejemplo: a través de servicios de asesorías a otros edificios)</li><li>Gana el respeto y admiración de otros propietarios y residentes a los cuales puedes orientar, guiar, ayudar y liderar con tus nuevos conocimientos adquiridos</li></ul><p><span></span><strong>Una Mirada Sencilla a la Ley de Propiedad Horizontal</strong></p><p>Como propietario actual o futuro de una vivienda dentro del régimen de propiedad horizontal en Panamá, es importante obtengas el conocimiento necesario para ejercer tus derechos y cumplir con tus obligaciones. Más aún, este conocimiento te dará recursos para que propicies la buena convivencia y el trabajo en equipo entre propietarios y residentes. </p><p><strong>Contenido Del Curso</strong></p><p>En estas 3 horas de contenido para propietarios que no conocen sobre Propiedad Horizontal, te llevaré paso a paso para que conozcas los actores principales que forman parte del régimen de propiedad horizontal, apoyándonos principalmente en el contenido de la Ley 31 de 2010 y traduciendo las definiciones legales en lenguaje y ejemplos sencillos que podrás entender con mayor facilidad.</p><p>Si eres nuevo viviendo en un edificio, condominio o urbanización dentro del régimen de Propiedad Horizontal, es probable que hayas pasado lo mismo que yo. Desconocía totalmente mis derechos y deberes como propietario, no sabía cuál era la responsabilidad del Administrador y del Promotor, no sabía a quién le tocaba darme respuesta sobre problemas varios, entre otras muchas situaciones.</p><p>Sumado a lo anterior, el reto de vivir en comunidad (edificio o condominio) es grande, se requiere mucha comunicación, buenas relaciones con los otros propietarios y una intención sincera de vivir en armonía.</p><p>Es por ello que decidí ser parte de la solución y participar activamente con la comunidad, eventualmente formando parte de la Junta Directiva de la Propiedad Horizontal donde resido y con ello derivándose la responsabilidad de prepararme con el conocimiento necesario para poder colaborar de la mejor manera posible con el resto de los propietarios y residentes.</p><p>Ahora pongo en tus manos este curso introductorio para que des conmigo esos mismos pasos que yo di para conocer sobre Propiedad Horizontal.</p><p>Al final de cada sección incluyo para ti algunas preguntas básicas para que pongas a prueba lo aprendido en las diferentes charlas y al momento en que concluyas en su totalidad este curso te entregaré un certificado de compleción de curso. Recuerda también que al tomar este curso tendrás acceso al foro de discusión donde podremos interactuar abiertamente. </p><p>¡Gracias por leer este contenido y aprecio el hecho de que estés evaluando el tomar este curso conmigo!</p><p><strong><br></strong></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Introducción a la Propiedad Horizontal en Panamá", 
    "price": "20.00", 
    "instructors": "Luis Peluffo", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644368_bb99_2.jpg", 
    "course_url": "https://www.udemy.com/introphpanama/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T02:59:11Z"
}