{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            This informative presentation has been created with the beginning investor in mind. Through a series of integrated lectures, Rich Dad Education instructor and investor Jeremy Reece will take you through 5 different ways you can find the money to finance your real estate deals as well as introduce you to many of the foundational principles that can lead to success as an investor and entrepreneur.  </p>  <p>  \t            Reece will also share his own inspiring story of coming back from a devastating car accident to build a successful career as a real estate investor, something he has now enjoyed for more than a decade. He will share some of the same principles for personal success that he has presented to more than 70,000 students both in the United States and abroad.  </p><br style=\"\">  <p>  \t            During this powerful, wide-ranging instructional video, you’ll learn:  </p>  <ul style=\"\">  \t<p>  \t\t            • <strong style=\"\">How Debt Can Actually Help You Build Wealth</strong>  \t</p>  \t<p>  \t\t            • <strong style=\"\">Ingredients to Finding the Money</strong>  \t</p>  \t<p>  \t\t            •<strong style=\"\"> Building a Mindset for Success</strong>  \t</p>  \t<p>  \t\t            •<strong style=\"\"> The “Super 7” Power Teams Members Who Can Supercharge Your Drive to Wealth</strong>  \t</p>  </ul><br style=\"\">  <p>  \t            In a special bonus section, Reece will also provide vital information on personal credit, including:  </p>  <ul style=\"\">  \t<p>  \t\t            •<strong style=\"\"> The 5 Key Elements of Understanding Your Credit Score</strong>  \t</p>  \t<p>  \t\t            •<strong style=\"\"> Managing Your Credit Score</strong>  \t</p>  \t<p>  \t\t            • <strong style=\"\">Improving Your Credit Score</strong>  \t</p>  </ul><br style=\"\">  <p>  \t      Disclaimer:  </p>  <p>  \t       The training program provided is not designed or intended to qualify students for employment. It is intended for avocational and personal development in real estate investing and/or entrepreneurship.<br style=\"\">  \t <br style=\"\">  \t         The Rich Dad Education products and services are provided with the understanding that the company is not engaged in rendering legal, accounting, or other professional advice. <br style=\"\">  \t <br style=\"\">  \t         Please note that investing involves risks. Any decision to invest in either the real estate or stock markets is a personal decision that should be made after thorough research, including a personal risk and financial assessment. Results are based on each individual, the action they take and the time and effort they put in.  </p>  <ul style=\"\">  \t<p>  \t\t <strong style=\"\"></strong>  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Learn Valuable Tips For Real Estate Investing", 
    "price": 0, 
    "instructors": "Rich Dad Education", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235738_e202_3.jpg", 
    "course_url": "https://www.udemy.com/tips-for-real-estate-investing/", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T17:35:23Z"
}