{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Become a CREA® - Certified Real Estate Auctioneer and Make $10,000, $50,000, Even $100,000 or More Per Auction.</strong></p><p>Dear Fellow Real Estate Professional,</p><p>What if I told you that in less than 30 days from now, you could be selling real estate at auction and depositing $10,000, $50,000, even $100,000 or more into your bank account every single month?</p><p>For most people this may sound hard to believe, but what they don’t know is that real estate brokers and agents who specialize in selling real estate at auction are actually making that kind of money in the real estate auction business and getting super wealthy in the process.</p><p>Whether you specialize in residential or commercial real estate, the CREA® – Certified Real Estate Auctioneer Training provides over 30 easy to follow, online video tutorials designed to provide you with all the auction training needed to become an immediate success in the exciting and profitable real estate auction business.<br></p><p>Including how to…</p><ul><li>Find an endless supply of real estate auction listings</li><li>Charge 20% or more in commissions and get it</li><li>Charge 0% commission and still make a fortune</li><li>Earn 5x's more than traditional real estate agents</li><li>Get paid on auction day and then again at closing</li><li>Find unlimited bank foreclosures and REO’s to auction</li><li>Form joint ventures with other brokers and agents</li><li>Go from listing to sold in 30 days or less</li><li>Make huge profits with short sale auctions</li><li>And much more…</li></ul><p>The course also provides all the forms needed to run a successful real estate auction business. Including real estate auction listing agreements, auction terms and conditions, auction purchase and sale contracts, addendum’s, joint venture agreements, marketing proofs and more.</p><p>Upon successful completion of this online course you’ll earn the CREA® – Certified Real Estate Auctioneer designation. The CREA® designation will identify you as a professional real estate auctioneer and help you to grow your real estate auction business.</p><p>The price to attend this same course at the Real Estate Auction School is regularly $397, but it is being offered here on Udemy at a fraction of that price. This is a special limited time promotion and it will not last long, so don't delay.</p><p>Enroll the CREA® – Certified Real Estate Auctioneer Training today and you’ll discover why real estate auctioneers are the highest paid real estate professionals in the United States, Canada and throughout the world.</p>", 
    "end_date": null, 
    "title": "Learn How To Sell Real Estate At Auction", 
    "price": "50.00", 
    "instructors": "Giacomo Sinisgalli", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782750_84c3_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-certified-real-estate-auctioneer/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T01:53:38Z"
}