{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to the lesson  you will learn to highly advanced technique of real estate investors of how buy houses &quot;Subject To&quot; the existing financing where you can take ownership of a property via the house being Deeded to you while keeping the existing mortgage in place. You never have to qualify for a loan. You never have to complete a credit application and yet the house is yours easier than if you did go through that long drawn out process. </p><p>Most real estate investor&#039;s that utilize this technique make a minimum of $10K per deal. How&#039;s would you feel about doing 1 a month and making more than you do on your JOB? Also, imagine moving into you own house, assuming you don&#039;t already have one. How exciting would that be?</p><p>Enroll in this highly sought after course and you will learn </p><ul style=\"\"><li>Step by step process of acquiring the deed on beautiful houses in gorgeous neighborhoods </li><li>What you need to do business</li><li>What you&#039;ll need to know</li><li>Setting up your team of professionals</li><li>How to locate Motivated Sellers</li><li>What are Target Properties</li><li>Why it pays to work on higher price houses</li><li>How to avoid risks and protect yourself</li><li>The most common mistakes when buying and selling</li><li>How to Market to and prescreen buyers quickly</li><li>What documents to use when buying and selling</li><li>Why you should use a Real Estate Attorney to close your deals</li><li>How to make $10K a month using just this technique</li><li>How to outsource 90% of your work</li></ul><p>In the past this information was included in high priced seminars. This absolutely qualifies as potentially life changing information in the way you can increase your income and even move into a house of your very own!</p><p>Join Us</p>", 
    "end_date": null, 
    "title": "Learn how to buy a house \"subject to\" the existing financing", 
    "price": "50.00", 
    "instructors": "James Bealer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428146_3545_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-buy-a-house-subject-to-the-existing-financing/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T00:19:19Z"
}