{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t            More than 300 students enrolled in the first 24 hours of being a publicly available course! More resources have been added! This course consists of 34+ coaching sessions that will teach you step-by-step how to double or triple your income from one year to the next. This will enable you to achieve all the things you&#039;ve dreamed of — whether that&#039;s buying your dream car or dream house, investing in property, sending your kids to college, or donating money to charities. Whatever your dream is, money helps you get there! This course will provide you with the tools to make as much money as you want, whether you are a novice or an experienced agent. In real estate, there are no limits! Treat this as your own personal real estate coach… when you complete a lesson you should spend the next week executing the tips in the lesson. Schedule a recurring appointment on your calendar to take in each new lesson. Then follow through on the lesson before moving on to the next one. If you do this in this fashion, it will be the equivalent of having your own real estate coach (which normally costs $250/session). That means you are getting more than a $8000 value! If you are not absolutely happy with this class, you can get a full refund within the first 30 days. Enroll in this class now to start your future today! (If you are really really really happy with the course, please leave me a good review. If you aren&#039;t completely happy with something in the course, please let me know so I can help you and correct the problem…) NOTE: Beware of Pirate sites that may put viruses on your computer if you download this lecture elsewhere. ADDED BONUS: Follow the instructions in the final quiz and at the end of the final video and you could receive a free half hour one-on-one coaching session ($250 value, no strings attached). This course is currently priced at $125, but will increase in price periodically until the price is finalized at $250. So, ENROLL NOW!  </p>", 
    "end_date": null, 
    "title": "Learn How to Double or Triple Your Income in Real Estate!", 
    "price": "50.00", 
    "instructors": "Kristen Crabtree", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384214_34dd_11.jpg", 
    "course_url": "https://www.udemy.com/tripleyourincome/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T18:15:37Z"
}