{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>“This class was amazing. Rob is a tremendous teacher and the gems I walked away with far outweighed the monetary cost. You must check this out!\"</strong></em><br></p><p>- Scott Britton, Founder, Life-Long Learner</p>\n\n\n\n<p><strong><em>\"...a little update, thanks to you I am only paying about $100 a month  \t                    for rent and paying off my credit cards!!\"<br></em></strong>- Sabrina Fairclough, Photographer</p>\n\n\n\n<p><strong><em>\"Rob doesn't waste time and has tons of knowledge.\"<br></em></strong>- Jeff Ramos, Polygon</p>\n\n\n\n<p>What is the biggest obstacle you face in pursuing your dreams here in New York City? For thousands of New Yorkers the answer is simple: the rent. I struggled for ten years with this issue - until finally I solved it - and began the rent-free life I've been enjoying for the last four years (yes, that's my home in the photo above). In this revolutionary online course you'll learn how to:</p>\n\n\n\n<ul><li>Save money painlessly</li><li>Avoid the biggest mistakes made by NYC home-buyers</li><li>Buy the very best NYC home - at the lowest possible price - and get paid to live in it!</li></ul>\n\n\n\n<p>The course contains 20+ in-depth video lessons (3-10 minutes a piece), and everything I learned over those ten years, plus direct access to me through the discussion forums and even free one-on-one consultation. You'll learn powerful techniques that will dramatically improve your financial and home life, guaranteed. By the end of the course you will have a realistic and achievable step-by-step plan that flips the script on the New York real estate market and puts you in control of your home and your finances.</p>\n\n\n\n\n\n<p>Think of me as your rent-free lifestyle coach. I'll be here to answer your questions as you move through the modules and put your rent-free plan into action. Freed from the burden of ever-rising rents, what could you do? What could you be? Lets find out!</p>", 
    "end_date": null, 
    "title": "Life Hack: How to Live Rent-Free in NYC", 
    "price": "50.00", 
    "instructors": "Roberto Gonzalez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99746_1b5a_6.jpg", 
    "course_url": "https://www.udemy.com/lifehack/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-30T23:31:49Z"
}