{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<em></em><em></em><em></em><p>This course lays out our guidelines and parameters for a <em>great </em>deal. Multifamily Real Estate Investing Strategist and Consultant, Gino Barbaro will help you get a strong understanding of cap rates and cash on cash returns, vital for beginning investors to learn about in order to correctly analyze a deal. <br><br>What formulas should you use? In this course, you will be able to analyze a deal faster and with higher accuracy using our Rules of Thumb. </p>What are some of our rules? <ul><li><strong>Cap Rates:</strong> What is a cap rate, and how will you best use them in <em>your</em> investment strategy? </li><li><span></span><strong>Cash on Cash Return:</strong> We will detail the return we strive for with our investments and help you define yours? (<em>hint: 10%</em>) </li><li><span></span><strong>Debt Coverage Ratio:</strong> What ratio will your bank look for when deciding whether to provide your business with financing? </li><li><span></span><strong>Management Fees: </strong>What are the going rates to manage your properties? </li></ul>Once you learn the basic rules of thumb, you will become more confident in analyzing deals, going through the due diligence phase, and putting in offers that will land you deals. You will also learn how to manage your property more effectively.", 
    "end_date": null, 
    "title": "Multifamily Real Estate Investing Rules of Thumb", 
    "price": "25.00", 
    "instructors": "Jake Stenziano & Gino Barbaro", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667880_016b_2.jpg", 
    "course_url": "https://www.udemy.com/rules-of-thumb-for-multifamily-real-estate-investing/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T15:06:22Z"
}