{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em>LATEST: Course Update Coming At The End Of December To Include More Lectures.</em>  </p>  <hr style=\"\">  <p>  \t<em>* OVER 1,400 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE</em>  </p>  <hr style=\"\">  <p>  \t                                                This course is based on an interview of Chris Stafford, who is a real estate broker with a successful real estate career in which he sold over $10,000,000 in real estate.  </p>  <p>  \t        In the course, Chris explains what to expect from different real estate career paths, and how to get into different real estate careers like being a real estate mortgage broker, investor, an appraiser, or a commercial real estate broker.  </p>  <p>  \t<strong>How The Course Is Structured</strong>  </p>  <p>  \t                                                The course is about 1 hour of video tutorials, which is the preferred Udemy format. The course is structured as an overview of different careers within real estate. The course teaches you how to find success in each of the possible real estate career options, and helps you decide which one might be right for you.  </p>  <p>  \t<strong>Who Should Take This Course</strong>  </p>  <p>  \t                                                You should take this course if you have ever thought of getting into real estate, or are thinking of making money in real estate. If you are new to real estate, and want to start a career in it and make money, this course should be very helpful.  </p>  <p>  \t    Real estate is one of the fields that is always growing. For many people it represents an escape from miserable jobs with terrible bosses. If you become a real estate agent, you won't have a boss, and you will make your own schedule. Real estate can be your path to freedom.  </p>  <p>  \t<strong>Personal Touch Like No Other Course</strong>  </p>  <p>  \t                              In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p>  \t<strong>Still Wondering If This Course Is Right For You?</strong>  </p>  <p>  \t    It is always difficult to know whether any course you buy will help you. You only learn about it after you take the course. Luckily, this course comes with a 30-day money back guarantee. So take the course now, and if you feel that it wasn't helpful or informative, just get your money back. If you don't try it, you'll never find out if the class can help you, so get the course now, and see for yourself without risking your money.<strong></strong>  </p>  <p>  \t                          +++++++++++++++++++++++++++++  </p>  <p>  \t                                      MONEY BACK GUARANTEE  </p>  <p>  \t<em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Real estate careers", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207970_2dfd_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-career-in-real-estate/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-30T13:23:19Z"
}