{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Understanding the fundamentals is absolutely critical when venturing into real estate markets.</strong>  </p>  <p style=\"\">  \t       This course is designed to ensure a clear understanding of how the market value of real estate is determined.  </p>  <p style=\"\">  \t       By taking this course you will learn from George Walsh, a certified general real estate appraiser. He is certified to perform appraisals on all commercial and residential properties. He has worked as a Forensic Appraiser, General Appraiser, Commercial Appraiser and Residential Appraiser throughout the New York area.  All of that experience is combined with 25+ years in the real estate industry as a buyer, seller, investor, renovator, educator, appraiser and consultant. Currently, George is appraising in New York and teaching as an adjunct professor at Stephen L. Newman Real Estate Institute at CUNY Baruch College.  </p>  <p style=\"\">  \t <strong style=\"\">In this course he describes the tools, techniques and process to value real estate.  By the end of the presentations you will be able to:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Identify the market value of a residential home</li>  \t<li style=\"\">Identify the market value of an income producing property</li>  \t<li style=\"\">Understand the purpose of an appraisal</li>  \t<li style=\"\">Increase your real estate transaction literacy</li>  \t<li style=\"\">Determine the fundamental building blocks of real estate value</li>  \t<li style=\"\">Understand Highest and Best Use principles</li>  \t<li style=\"\">Understand the formulas which determine the value of an income producing property</li>  </ul>", 
    "end_date": null, 
    "title": "Real Estate Fundamentals: The Valuation Process", 
    "price": "20.00", 
    "instructors": "George Walsh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/193854_a20f_2.jpg", 
    "course_url": "https://www.udemy.com/real-estate-fundamentals-the-valuation-process/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-04T14:48:56Z"
}