{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Updated 5/2016</strong></p><p><strong>Want to try before you buy?</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Download a free model in Lecture 3 (check out the link in the description) and preview the Jumpstart section before you buy.</strong></p>\n\n\n\n\n\n<p>In that Jumpstart section, you'll learn how to do market research for a rental market of YOUR CHOICE and then use those learnings to evaluate a rental income property, also of YOUR CHOICE. </p>\n\n\n\n\n\n<p>In the rest of the course, you get two advanced models and examples covering flips and rental income investments. Enjoy!</p><p>By the way, the BIGGEST value add for this course is that I answer every question for every student.  </p><p>Just shoot me a direct message. </p>\n\n\n\n\n\n<p>_________________________________________________________</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are you sick and tired of real estate \"systems\" that turn out to just be a hard sell for another \"system\"?</strong></p>\n\n\n\n\n\n<p>Tired of \"no money down get rich like me\" real estate investing \"secrets\" from real estate \"gurus\" that leave you filled with nothing but marketing fluff?</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Do you just want to know what REAL real estate investment analysis is all about?</strong></p>\n\n\n\n\n\n<p>If you want to learn the fundamentals of real estate investing and how to actually evaluate investment opportunities the way professional investors do, keep reading.</p>\n\n\n\n\n\n<p>I can't promise I'll help you get rich, own a yacht and two Ferraris.</p>\n\n\n\n\n\n<p>But I can teach you some serious real estate investment analysis techniques.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">After getting my MBA from Stanford, I worked on over $400M in real estate deals.</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">And I took what I learned from that and put all of it in this course.     </strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How do I know if this course is right for me?</strong></p>\n\n\n\n\n\n<p>If you've EVER wanted to:\n</p>\n\n\n\n\n\n<ul><li>Invest in a rental income property?</li><li><em>Do a fix &amp; flip for profit?</em></li><li>Have professional investment analysis tools that you could use immediately to evaluate your own investment opportunities?</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>IF YES to any of the above, then this course is definitely for you.</em></strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>_______________________________________</em></strong></p>\n\n<p><strong>How is this different from your other course?</strong></p>\n\n\n\n<p>This one only covers the foundational topics and only has two case studies with the fix &amp; flip and the rental income property.</p>\n\n\n\n<p>The other course is more comprehensive and covers all of these plus topics such as investing in apartments, investing with partners, investing in Airbnb units, commercial real estate, etc...</p>\n\n\n\n<p>If you only intend to invest in fix &amp; flips and rental income properties, this course is all you need for investment analysis.</p>\n\n\n\n<p>If you intend to invest with business partners, in apartments, in commercial, etc...then you should take my other course. </p>\n\n<p><strong class=\"redactor-inline-converted\">What if I don't have any real estate background?</strong></p>\n\n\n\n\n\n<p>This is the perfect course to get your feet wet.  I'll cover all the important foundational topics for you and then show you how to apply those same concepts for evaluating a fix &amp; flip as well as a rental income property.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I have some real estate background already, what could I learn from your course?</strong>\n</p>\n\n\n\n\n\n<p>If you have some background, I'd recommend you check out my Complete Investment Analysis course that is 18+ hours long.</p>\n\n\n\n<p>That course covers ALL of the topics here PLUS ALOT more.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I can learn all of this elsewhere, why should I learn from you?</strong>\n</p>\n\n\n\n\n\n<p>No, you can't. Go google how to use the waterfall structure and try to find someone that not only covers the waterfall framework in great detail but also GIVES you examples on its use. I've looked and it's not there.</p>\n\n\n\n\n\n<p>The other stuff? Same thing. You can find the descriptions and commentary, but you won't get the detailed examples and the investment models that I give you.</p>\n\n\n\n\n\n<p>Yea sure….you could search all over the internet...buy TONS of books...talk to lots of experts....go get an MBA…do ALL this research...work in real estate private equity….and do $400M+ in real estate deals also....</p>\n\n\n\n\n\n<p>OR….you could just take advantage of my experience. I've done that and I took all that and put it into this course.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Can you make me rich by taking your course?</strong>\n</p>\n\n\n\n\n\n<p>No way! Not just from taking the course. Anyone who promises you that is selling snake oil.</p>\n\n\n\n\n\n<p>If you take my course AND apply the learnings to make smarter invests in the future, then you have a chance.</p>\n\n\n\n\n\n<p>What I can guarantee is that you will leave with some serious real estate investing knowledge, techniques, and tools. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What else does this course cover besides real estate investing?</strong>\n</p>\n\n\n\n\n\n<p>This course is ALL about and ONLY about professional real estate investing analysis concepts and techniques. So nothing else. But as you can see, just this topic is quite a bit to cover already.</p>\n\n\n\n\n\n<p>Actually, I do cover one more thing: I will also cover daily affirmations that help you build that \"winning\" mindset and I'll have lots of sales videos that will push you to sign up for my top secret real estate system for only 12 monthly low payments of just $999. Just kidding.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What will I be able to do after I take your course?</strong></p>\n\n\n\n\n\n<p>After taking my course, you will be:</p>\n\n\n\n\n\n<ul><li>Able to confidently use professional real estate investment techniques.</li><li>Able to evaluate both fix &amp; flips as well as rental income properties.</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What WON'T I get from this course?</strong></p>\n\n\n\n\n\n<ul><li>You will not get a Real Estate License from taking this course. You can only get licensed by taking the appropriate test with the testing agency of your state and country. But what is taught in this course has nothing to with getting a license, which focuses on how to legally transact real estate deals between buyers and sellers. This course is about investment analysis.</li><li>I will not be evaluating your personal investment deals for you for this course. This is about you learning how to do it on your own using the lessons and the tools here. =) If you really want me to consult, you can reach out to me. My hourly rate is $350/hr.</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Tell me again why I should take your course?</strong><br></p>\n\n\n\n\n\n<p>If you've read this far down, you already know why. You've always wanted to. So why haven't you pulled the trigger?</p>\n\n\n\n\n\n<p>Ask yourself this: \"What is holding me back?\"</p>\n\n\n\n\n\n<p>Are you afraid you'll actually learn what you've always said you would but never did?</p>\n\n\n\n\n\n<p>Yeah, you'll have to put in the time and effort. If you're lazy, this course (or any other course) won't be able to help you.</p>\n\n\n\n\n\n<p>But if you're serious about learning real estate investing, then I can definitely help you.</p>\n\n\n\n\n\n<p>Plus, you have absolutely ZERO risk.</p>\n\n\n\n\n\n<p>Udemy gives you a 30-day money back guarantee and they're really really good on that.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">But if you don't find any value in my course after 30 days of taking my course, I'll personally refund you.</strong></p>\n\n\n\n\n\n<p>So if you've read this far, you have no excuse. You have no risk at all. If you don't sign up, it just means you aren't serious about learning real estate investing.</p>", 
    "end_date": null, 
    "title": "Real Estate Investing: Intro to Investment Analysis", 
    "price": "25.00", 
    "instructors": "Symon He", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/816662_043a_4.jpg", 
    "course_url": "https://www.udemy.com/real-estate-investing-introduction-investment-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-08T20:02:18Z"
}