{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Ever wanted to get into the lucrative property investment game? How about generating recurring income from a portfolio of buy-to-let properties? Buying at property auction means you can pick up properties below market value, and, for rental purposes increase your rental yield significantly.  </p>  <p>  \t      You don't need to be a wealthy individual or large business to start your own property empire. Ordinary people can and are buying additional properties for long term investment and securing their future.  </p>  <p>  \t      This course is not one of this 'this is what you should do' with no examples. My wife and I have done this and do this. We are ordinary working people that have saved and bought properties to rent out.  </p>  <p>  \t      So this course is based on real world <em style=\"\">actual experience</em>. Not theory but all you need to know learned from our experience having bought properties. If you are tired of all the 'How I make $xxx' or 'Make Money' on courses that seem to be lacking <strong style=\"\">proof</strong> of income or any evidence that the instructor actually <em style=\"\">does </em>what they teaching in the course then this course is for you.  </p>  <p>  \t    It is all here, the selection process my wife and I have used for the last 4 years, the properties we have bought and the money we make, I show you it all round down to the pounds and pence amount. Even what I declare to the UK government.  </p>  <p>  \t    This is not a 'do as I say' like so many other courses, its a 'do as I do'. Also with each passing month we will be adding a video where we review unsold lots at auctions.  </p>  <p>  \t    If there is demand we might also do 'live' session.  </p>  <p>  \t    Sign up today and do not forget that if it is not for you then you have the udemy 30 back money back guarantee to fall back on.  </p>  <p>  \t    Here's to <strong style=\"\">YOUR</strong> success.  </p>", 
    "end_date": null, 
    "title": "Real Estate: How to get Discounted Property at Auctions", 
    "price": "20.00", 
    "instructors": "Gary Kind", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399016_e123.jpg", 
    "course_url": "https://www.udemy.com/real-estate-how-to-get-discounted-property-at-auctions/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T10:29:09Z"
}