{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">REAL ESTATE INVESTING COURSE:</strong></p><p><strong class=\"redactor-inline-converted\">Is financial freedom constantly on your mind?</strong><br></p>\n\n<p>Did you know that real estate is the number one way to obtain financial freedom allowing you to make all your dreams come true in a very short time frame?<br></p>\n\n\n\n<p>However, real estate investing requires knowledge, a solid foundation and understanding of the market and this is what I will provide you in this course.</p><p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Real estate investing is not only for the rich!</strong><br></p>\n\n\n\n<p>Don’t have the capital to get started, <strong class=\"redactor-inline-converted\">No problem!</strong><br></p>\n\n\n\n<p>Remember the saying “you need money to make money” That is true, however who ever said it has to be your own money?<br></p>\n\n\n\n<p>I will teach you industry secrets that will allow you to get into real estate investing without using your own money.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Do you prefer working alone or as part of a team?</strong></p>\n\n\n\n<p>Real estate investing is perfect for everyone’s lifestyle and personality.  Regardless if you prefer to work alone or with others,  I will teach you how to identify and determine the benefits of doing a deal alone or with a partner.<br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Look at the 5 stars reviews!</strong></p>\n\n\n\n<p><em>\"I like this course because it is not a “get rich quick” program that promises to make you rich with no money down tactics. This course gave me some solid base and concepts of real estate investing and it is giving me a nice base to work with. I really recommend it.\" -Michael Williams</em></p>\n\n\n\n<p><em>\"I have completed this course and I wanna say this course is a great investment for real estate investors. It takes you through the beginning processes of investment and what you need to be wary of. I would definitely recommend this course to anyone thinking about real estate investing.\" -Andrew Joseph<br></em></p>\n\n\n\n<p><em>\"After being in real estate investing for a while I saw that there was something that I wanted to change in this industry and that’s how I came across to this course. You should be able to learn how to do real estate investing without investing your own money. I recommended this course if you're just getting started in real estate investing and want to make living income from this source.\" -Charles Coleman<br></em></p>\n\n\n\n<p><em>\"This course gives the knowledge and the motivation needed to begin with a real estate investing project. Gerald explains very well the different pillars of investment as well as the method used by the experts in real estate. Getting your knowledge from a successful real estate investor is a great way to start your own journey!</em><em>\" -Cynthia Ayoub</em></p>\n\n\n\n<p><em><br></em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Now</strong>, if you are ready to get started on your road to <strong class=\"redactor-inline-converted\">financial freedom</strong> through Real Estate Investing, take the first step by clicking on the “<strong class=\"redactor-inline-converted\">Take This Course”</strong> button in the top right hand side of this page and follow the instructions that are then provided.  </p>\n\n\n\n<p>With a 30 day money back guarantee and over 27 lectures, you will learn the necessities to get you started in real estate investing and a path to owning your first property even if you don’t have your own capital. Remember, <strong>no matter what you do </strong>OR<strong> where you live,</strong> understanding Real Estate Investing is very useful because you can apply these fundamentals all over the world!</p>", 
    "end_date": null, 
    "title": "Real Estate Crash Course: Investing Fundamentals", 
    "price": "35.00", 
    "instructors": "Gerald Czernohorsky, Juan Manuel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604216_3f47_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-real-estate-investor-learn-the-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T20:44:18Z"
}