{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>What is this course about?</strong></p><p>Our course covers everything from the getting started phase, to choosing a property type, to selecting your investment strategy and purchase strategy. We dive deep into each individual strategy or niche in its own video rather than gloss over them briefly as a whole in one video like some courses do.</p><p><em>Picking the right niche that suits your knowledge, experience, and skill set will be important to your success and determining the proper strategy to use for each investment you come across is another major skill to develop.</em></p><ul><li>You'll learn the things to do before you start investing</li><li>You'll learn the 4 main residential property types to master</li><li><span></span>You'll learn the 3 main investment strategies</li><li>You'll learn 10+ purchase and financing strategies</li><li>You'll discover an easy way to find properties to invest in</li><li>You'll learn how to set up a website for your business to build credibility and generate leads. You may also use it for renting out properties to tenants and collecting rent using software if you wish to automate your business.</li><li>You'll also get bonus gifts at the end to assist your investment business such as worksheets, checklists, and eBooks.</li></ul><p><strong>My Experience Investing in Real Estate:</strong></p><p>I got started investing in real estate as a teenager with family, having grown up with a father who is a real estate broker, landlord, and property manager. By age 20, I purchased my first rental property and it was a gut rehab, where we pretty much fixed it up brand new to rent out to tenants.</p><p>By age 22, I raised capital in the 7 figures from different investors to purchase apartment complexes and single family homes in two different markets in the U.S. I had automated my business with property managers and team members set up in each location to operate my business smoothly without me physically being in one location or the other.</p><p>I did this in order to follow my plan of generating passive income. I enjoy living life freely and setting my schedule without worrying about trading time for wages. Passive income gives you the opportunity to do what you're passionate about while still earning income.</p><p><strong>Who this course is for?</strong></p><ul><li>Beginners seeking knowledge on how to get started investing in real estate</li><li>Investors who want to learn strategies on a deeper level than most courses get</li><li>People who hate their job and want an alternative source of income</li><li>People who love fixing up distressed real estate and making it nice again</li><li>Beginners who have little capital of their own to use and wish to invest with other people's money</li><li>Ambitious, driven to success, and self-motivated individuals</li></ul>", 
    "end_date": null, 
    "title": "Real Estate Investing for Beginners", 
    "price": "25.00", 
    "instructors": "Nick Foy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758990_7db0_2.jpg", 
    "course_url": "https://www.udemy.com/real-estate-investing-for-beginners-with-under-30-wealth/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T23:12:01Z"
}