{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course, I'll teach you how to systematically <strong class=\"redactor-inline-converted\">attract</strong>, <strong class=\"redactor-inline-converted\">recruit</strong>, <strong class=\"redactor-inline-converted\">train</strong>, and <strong class=\"redactor-inline-converted\">manage</strong> a vast number of birddogs who will find you the Real Estate deals you are looking for.</p><p>There's no better way to duplicated your acquisitions efforts than to train people who can go out and find deals on houses for you.</p><p>It takes time, skill, and perseverance to build a successful Real Estate business, and there's no better way to grow your business than to enlist the help of others.</p><p>Truth of the matter is that there are thousands of people right now, in your market, who would love the opportunity to make some extra money by searching out house deals for you. The trick is how to go about finding those people, and training them up so that they can work effectively.</p><p><strong>It takes a system to build an army of birddogs</strong> - and I'd like to show you how to build the same system that I use to grow my business like never before.</p><p>Once your system is built, all you have to do is focus on the front and and the back end -</p><p>On the front end, you have to keep the doors open so that your prospective birddogs can find you and enroll in your educational system. It's easy, and I'll show you exactly how.</p><p>On the back and, you have to keep the deals headed towards the closing table. Once your birddogs and trained and bringing you solid deals, the closings will occur naturally. You'll see.</p><p>So, enroll in the course. The cost is low, the material is delivered in step-by-step fashion, and you can literally be recruiting your army of birddogs by this time tomorrow.</p><p><strong class=\"redactor-inline-converted\">ENROLL NOW.</strong></p>", 
    "end_date": null, 
    "title": "Sniffing Out The Deals With Real Estate Birddogs", 
    "price": "50.00", 
    "instructors": "Ben Clardy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/820870_348f.jpg", 
    "course_url": "https://www.udemy.com/sniffing-out-the-deals-with-real-estate-birddogs/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T13:08:47Z"
}