{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This course is for anyone interested in real estate investing</strong>, from the <strong>beginner</strong> to <strong>seasoned pros</strong> looking for more money making strategies. In this course you will learn how to:</p><p>1. Buy houses for super cheap and<strong> flip them for a huge profit</strong></p><p>2. Buy houses for super cheap and <strong>wholesale them for a quick profit</strong></p><p>3. Buy houses for super cheap and <strong>rent them for passive income</strong></p><p>4. Buy tax lien certificates and tax deeds for super cheap and <strong>earn a huge return</strong></p><p>5. <strong>Build wealth</strong> through the oldest and best strategy in the world: Real Estate</p><p>Throughout the course you will not only learn how to do all of the above but many more <strong>tips, tricks, and ideas</strong> that it took myself and my business partner many years of trial and error to discover, tweak, and perfect. There are so many ways to <strong>make money in real estate</strong>, reduce your taxes, defend your wealth, and even just have fun, that you can never do it all.</p><p>In addition to everything else that you will learn in this course, you will have access to myself and my partner through the discussion board and private messages on Udemy to <strong>get the extra help that you need</strong>. We understand that it's hard starting out, so we're here to give you a boost.</p><p>This course is the answer to students of my current Udemy course, <strong>Learn the Secrets of Probate Real Estate Investing</strong>, who kept asking me: When will you produce another course?! Well now I've done it, and<strong> I hope you enjoy it and accomplish all of your learning and investing goals</strong>.</p>", 
    "end_date": null, 
    "title": "Super Real Estate Investing", 
    "price": "20.00", 
    "instructors": "Greg Vanderford", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645816_bca4_3.jpg", 
    "course_url": "https://www.udemy.com/super-real-estate-investing/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T13:28:11Z"
}