{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        In this course, we will cover  everything you need to know to be knowledgeable about residential  mortgages in the United States. We will look at the important players/departments in the  space as well as Key Terminology that you need to know. We will spend  some time unpackaging the consumer buying cycle and examine the life  cycle of the Mortgage. In addition, we will spend some time examining  what goes into originating, servicing and valuing a Mortgage by  examining the metrics that make up the loan process. We will examine the  tools that help a company make a sound credit worthiness decision, by  exploring the Credit Report and the Real Estate Appraisal. Finally, we  will demystify the Securitization process by looking at the process of  Mortgage Securitization and its benefits.  </p>  <p>  \t     The makeup of the course is as follows, containing nearly 30 modules over 3 sections:  </p>  <ul style=\"\">  \t<li>U.S. Residential Mortgage Business and Process Fundamentals</li>  \t<li>U.S. Residential Mortgage Analysis: Bringing It All Together</li>  \t<li>Loan Management, Servicing and Securitization</li>  </ul>  <p>  \t     This course&#039;s contents consists of a video introductions for each section, outlining the key elements to be covered, followed by each module, consisting of a narrated presentation.  </p>", 
    "end_date": null, 
    "title": "The U.S. Residential Mortgage Business", 
    "price": "50.00", 
    "instructors": "Paul Siegel", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176722_0fcd_4.jpg", 
    "course_url": "https://www.udemy.com/the-us-residential-mortgage-business/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T16:22:48Z"
}