{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tAll too often real estate agents work for months with a buyer, only to find out later that the buyer is not qualified to make a home purchase.  The agent has lost precious time and lost other potential business by focusing on someone who wasn&#039;t in a position to buy.  </p>  <p style=\"\">  \tReal estate agents work on commission and cannot afford to waste time on anything that isn&#039;t generating revenue.  </p>  <p style=\"\">  \tTake control of the real estate transaction from the very start.  </p>  <p style=\"\">  \tManage the expectations of the buyer from the beginning of the relationship.  </p>  <p style=\"\">  \tLearn what topics should be discussed at the first buyer meeting to have a smoother real estate transaction.  </p>  <p style=\"\">  \tDiscover a step-by-step process to walk your buyers through the home buying process.  It is possible to work with buyers and have a smooth real estate transaction.  </p>  <p style=\"\">  \tTell buyers what you expect from them and what they can expect from you.  </p>  <p style=\"\">  \tBuild your confidence so you can stop &quot;jumping&quot; every time the buyer says &quot;jump&quot;.  Discussing what happens throughout the home buying process upfront will help the buyer have a more realistic view of the process.  </p>  <p style=\"\">  \tInside The Buyer Presentation - 12 Steps to a Smooth Transaction, we give you the information you need to discuss with your buyer so they have a clear understanding as to what to expect during the home buying process.  </p>  <p style=\"\">  \tBeing a successful real estate agent is not easy, buy you can achieve success with the right systems in place.  </p>  <p style=\"\">  \tThe information in this course has been tested and proven to be effective for over a decade.  Unlike other real estate agent training programs, this course was designed by an active, producing Realtor.  The Buyer Presentation is what I use in my thriving real estate practice...so I know it works!  </p>  <p style=\"\">  \tMake a decision to start having smoother transactions today with the Buyer Presentation - 12 Steps to a Smooth Transaction.  </p>", 
    "end_date": null, 
    "title": "The Buyer Presentation ", 
    "price": "50.00", 
    "instructors": "Candy Miles-Crocker", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436068_4446_2.jpg", 
    "course_url": "https://www.udemy.com/the-buyer-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T01:29:29Z"
}