{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">I wasn&#039;t always a experienced veteran in real estate</p><p style=\"\">I&#039;ve been where you are now.</p><p style=\"\">There was a time early in my real estate career when I struggled. I fumbled around for a couple of years before I finally got a deal under contract and I was nervous and it took me about 20 minutes to complete a simple 2 page contract.</p><p style=\"\">I didn&#039;t have someone to guide me along the way.</p><p style=\"\">After several dozen deals I wanted to help others to bypass the normal learning curve associated with real estate investing.</p><p style=\"\">There is no telling how many more deals I would have done without the painful mistakes if I had someone like myself to help me streamline the buying and selling process...ESPECIALLY using through leveraging the internet and saving time..</p><p style=\"\">and avoid potential landmines and bad deals.</p><p style=\"\">Since the standard real estate purchase and sales agreement is fundamental to any real estate transaction...</p><p style=\"\">I wanted to take the time to show exactly how to complete a purchase and sales agreement (by filling in a few blanks and signing) and having the confidence to come across to a prospective seller as a professional real estate investors that does deals regularly.</p><p style=\"\">A real estate contract is not a big deal and usually your title company or attorney will need you to sign one or two contracts prior to closing.</p><p style=\"\">So basically the initial real estate contract is used to start the process and to lock in your buy price and/or terms.</p><p style=\"\">This is a great training and I invite newbie investors as well as seasoned investors who are looking to learn how to flip houses without using any cash or credit.</p><p style=\"\">I feel the content will be helpful and would a appreciate any suggestions below.</p><p style=\"\">FREE Real Estate Docs included with the course!!! ($497 Value)</p>", 
    "end_date": null, 
    "title": "Wholesale Real Estate: Fill Out, Edit, & Send Contracts", 
    "price": "25.00", 
    "instructors": "Brandon Calhoun", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499072_f25e_2.jpg", 
    "course_url": "https://www.udemy.com/wholesale-real-estate-fill-out-edit-send-contracts/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T16:02:39Z"
}