{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Wholesale Real Estate Contracts</strong></p><p>Gain immediate access to 7 Wholesale Real Estate contracts that I've developed over the the last decade to turn houses into money.</p><p>This contract package will give you the ability to control Real Estate deals all the way to the closing table while also keeping you safe and risk-free.</p><p><br></p><p><strong>Are your current Real Estate contracts up to snuff?</strong></p><p><strong>Do you worry about losing your Earnest Money deposits?</strong></p><p><strong>Can you EFFECTIVELY control deals with both Buyers AND Sellers?</strong></p><p><strong>Are you scared of making offers for fear of making BIG mistakes?</strong></p><p><strong><br></strong></p><p>These are just a few of the concerns and problems that can be alleviated by owning a purpose-built set of Real Estate contracts.</p><p>Now, having the contracts themselves is just half of the battle...</p><p><br></p><p><strong>Do you know how a contract actually works?</strong></p><p><strong>Do you understand the verbiage, and more importantly, WHY it's there?</strong></p><p><strong><br></strong></p><p>Within my course, I will slowly walk you through each and contract, line by line. This way you will truly understand why each line is there, why it's important, and what it can do for you.</p><p>You see, everything is there for a reason. Whether it's to help you get offers accepted, to control the deals, or to protect you from liability - everything has a purpose, and you'll be a far more effective Investor by knowing the ins-and-outs of each contract.</p><p>You just don't get this kind of hand-holding anywhere else. Where else are you going to get a full set of contracts that are proven, effective, and used DAILY to turn houses into money.</p><p>The answer is NOWHERE ELSE. This is the place.</p><p><br></p><p><strong>Get the course now. Simply sign up, enroll, and you'll gain instant access to all of the course material. If that's not enough, you can take full advantage of a 30-day money-back guarantee.</strong></p><p><br></p><p><strong>ENROLL NOW.</strong></p><p><strong><br></strong></p><p><strong>PS: Here's a quick story...</strong><strong> </strong><em>When I first started off, it took me over a year and a half to even get my first house under contract. Yeah - it's embarrassing to admit. Why did it take me so long? FEAR. I was scared of making a mistake that would result in a lawsuit. Simple as that. I conquered my fear by gaining an understanding in how contracts can protect me from liability. Once I realized that, and had contracts that I could use to control houses RISK FREE, I was off to the races and I've gone on to close more than 400 houses! I hope you can benefit from understanding Real Estate contracts as much as I did.</em><em></em><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Wholesale Real Estate Contracts: Flip Houses Risk Free", 
    "price": "50.00", 
    "instructors": "Ben Clardy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790080_108b_2.jpg", 
    "course_url": "https://www.udemy.com/wholesale-real-estate-contracts/", 
    "currency": "USD", 
    "subject_name": [
        "Real Estate"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T20:30:20Z"
}