{"selfpaced": false, "topic_name": ["Film & Theatre"], "description": "\n\n                    \n                    \n                    Over three weeks, The Production Guild of Great Britain, guided by respected film and television professionals, will demystify the process of making a feature film. You will discover the key stages of how a film gets made and the different types of production.\n\nWant to start working in film production?\n\nWe will explore the different departments, and how they interact and work together. We will look at the structure of a film crew - how individual job roles fit into the wider crew - and get to grips with industry jargon and etiquette. Industry professionals, working in key roles on award-winning productions, will talk about their jobs and give practical insights and tips into how the industry works.\n\nEach week, you will have the opportunity to test your own knowledge and understanding via multiple choice quizzes, and post your thoughts and ideas for discussion with your fellow students.\n\nStarting out as a Runner\n\nAnyone with a more specific interest in working in the film industry will gain an understanding of entry-level jobs and potential career progression pathways. You’ll also hear hints and tips for how to get on in the industry and pursue your dream.\n\nImage credit: Far from the Madding Crowd © DNA Films, Fox Searchlight Pictures – contributors to the Creative Skillset Skills Investment Fund\n\n\n                                    ", "end_date": "2016-08-15T00:00:00Z", "title": "Film Production: Behind the Scenes of Feature Filmmaking", "price": 0, "instructors": "Lesley Lipscombe", "institution_name": [], "commitment": "3 hours", "subject_name": ["Art & Design"], "course_url": "http://www.futurelearn.com/courses/film-production?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-07-25T00:00:00Z"}