{"selfpaced": false, "topic_name": ["Philosophy"], "description": "\n\n                    \n                    \n                    This course has two goals. The first is to introduce you to the things that philosophers think about. We will look at some perennial philosophical problems: Is there a God? What is knowledge, and how do we get it? What is the place of our consciousness in the physical world? Do we have free will? How do we persist over time, as our bodily and psychological traits change? The second goal is to get you thinking philosophically yourself. This will help you develop your critical reasoning and argumentative skills more generally. Along the way we will draw from late, great classical authors and influential contemporary figures.\n\nIf you wish to take the course as a 'verified' student (technological checks guarantee it is you taking the course) then please register as Verified below. It will cost you $50. Upon completing the course you will receive a certificate that says that you completed the course as a 'verified' student. Otherwise you can take the course as a non-verified student (you guarantee it is you taking the course by signing an honor code) for free. You will receive a certificate that says that you completed the course as a non-verified student.\nNext Spring (2015) we will be offering 24.118x Paradox and Infinity for the first time. Next Fall (2015) we will be offering 24.09x Minds and Machines for the first time. By completing all three courses as a verified student you will be eligible for a Philosophy X series certificate.\n\nBefore your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\n                                    ", "end_date": "2014-12-16T00:00:00Z", "title": "24.00x: Introduction to Philosophy: God, Knowledge and Consciousness", "price": 0, "instructors": "Caspar Hare", "institution_name": ["Massachusetts Institute of Technology"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.edx.org/course/introduction-philosophy-god-knowledge-mitx-24-00x", "duration": "11 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2014-09-30T00:00:00Z"}