{"selfpaced": false, "topic_name": ["Philosophy"], "description": "\n\n                    \n                    \n                    Le MOOC sera consacré à l’étude de la pensée critique. Les enjeux de cette dernière sont déterminants pour les sociétés contemporaines. On répète qu’il faut lutter contre les préjugés, l’obscurantisme voire le fanatisme. Mais on n’apprend pas à penser, à critiquer les opinions reçues, à ne les accepter qu’après un travail personnel de réflexion et d’examen. Si bien que, face à des thèses simplificatrices, complotistes, manichéennes, nous sommes souvent dépourvus de ressources parce que nous n’avons pas véritablement appris à penser et à argumenter.\r\nOr, on sous-estime souvent la difficulté de penser librement et de façon critique. C’est la raison pour laquelle le cours se développera de façon progressive, abordant des questions de plus en plus complexes. Dans un premier temps, il s’agira d ‘analyser les divers aspects de la pensée critique dans ses rapports avec la politique au sens large du terme. Ensuite, une fois les concepts de base acquis, quelques brefs éléments d’histoire de la pensée critique seront présentés. Nous en passerons alors à l’analyse plus approfondie de thèmes intrinsèquement liés à la problématique de la pensée critique : la laïcité, la capacité d’argumenter correctement, la liberté d’expression et l’athéisme.\r\nCe MOOC a donc une double vocation : l’acquisition de certaines connaissances nécessaires à bien comprendre les enjeux de la pensée critique, et une invitation à penser par soi-même dans un monde complexe.\n\n                                            Syllabus\n                        Semaine 1\r\nModule 1 - Présentation du MOOC.Module 2 - La pensée critique et la politique.Introduction.La critique du pouvoir.La pensée critique, les faits, les préjugés.\r\nSemaine 2\r\nModule 3 - Quelques éléments d’histoire de la pensée critique.Introduction.Origines et histoire de la pensée critique.Genèse de la notion de libre examen.\r\nSemaine 3\r\nModule 4 - Débats et enjeux philosophiques : la question de la laïcité.Introduction.Les différents aspects de la laïcité.Comparaisons entre pays.La laïcité et les pressions religieuses contemporaines.\r\nSemaine 4\r\nModule 5 - Débats et enjeux philosophiques : la pensée critique, l’argumentation et la liberté d’expression.Pensée critique et argumentation.Pensée critique et liberté d’expression.\r\nSemaine 5\r\nModule 6 - Débats et enjeux philosophiques : pensée critique et athéisme.L’athéisme des Grecs aux Lumières.L’athéisme contemporain.Conclusion.\r\nSemaine 6\r\nModule 7 - Conclusion.Evaluation finale.\n                                    ", "end_date": "2016-04-27T00:00:00Z", "title": "Développer sa pensée critique", "price": 0, "instructors": "Guy Haarscher", "institution_name": ["Université libre de Bruxelles"], "commitment": "3-4 hours", "subject_name": ["Humanities"], "course_url": "https://www.fun-mooc.fr/courses/ulb/44003/session01/about", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["France Université Numerique"], "start_date": "2016-03-16T00:00:00Z"}