{"selfpaced": false, "topic_name": ["Philosophy"], "description": "\n\n                    \n                    \n                    This is the seconding reading in our series on “Readings that Matter”. This series is adapted from a set of readings that Acumen’s Fellows and staff discuss on a regular basis as part of our leadership training and development.\r\n\r\n“A person’s identity … is like a pattern drawn on a tightly stretched parchment. Touch just one part of it, just one allegiance, and the whole person will react, the whole drum will sound.”\r\n\r\nIt’s easy to understand why Amin Maalouf, the Lebanese-born French author of “In the Name of Identity: Violence and the Need to Belong“, calls identity a “false friend.”  Throughout history, most large-scale acts of violence—whether the genocides, the Holocaust, or wars—have been committed in the name of identity: one tribe against another, one religion against another, one nation against another.\r\nAs Maria Popova aptly observes, “All violence requires an Other as its target, and the shifting boundaries of our own identity are what contours that otherness.” It is only through exploration of how we understand our own identities that we can unpack where our sense of “other” comes from: how it is constructed, and how it can be pulled apart to create more productive dialogue and deeper mutual understanding. These questions are increasingly relevant at a time when terrorism, extremism, mass shootings and protests proliferate, while our capacity to discuss and understand such events can feel stagnant.\r\nIn this course, you’ll have a chance to join a global conversation about Maalouf’s writings and larger questions of identity in light of current events.  You’ll receive a discussion kit complete with a downloadable version of the text, a step-by-step facilitator’s guide and background materials that will equip you to host a small group of friends or colleagues in a 2-hour discussion of the first five chapters of Maalouf’s book. The course will also give you tools to reflect on your own identity and think about it in relation to the larger historical and cultural factors that Maalouf lays out.\r\nOne of the most important takeaways from Maalouf’s book is that our identities are multi-faceted, evolving, and resist easy definitions. To that end, we do not propose that this course and group discussion will bring you to any resolution regarding your own identity, or any clear understanding about why so many commit acts of violence and aggression in the name of identity.  Yet, as Maalouf himself says, “that shouldn’t prevent us from observing, from trying to understand, from discussing, and sometimes suggesting a subject for reflection.”\r\nMaalouf’s “In the Name of Identity” does not offer easy answers.  Yet his writings serve as a powerful exploration of the multiple dimensions of identity, the roots of violence and tribalism, and the value of embracing multiple allegiances and affiliations.  Please join us in this important global conversation.\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "In the Name of Identity: Violence and the Need to Belong", "price": 0, "instructors": "", "institution_name": ["+Acumen"], "commitment": "3 hours", "subject_name": ["Humanities"], "course_url": "http://plusacumen.org/courses/in-the-name-of-identity-violence-and-the-need-to-belong/", "duration": null, "language_name": ["English"], "provider_name": ["Independent"], "start_date": "2016-02-20T00:00:00Z"}