{"selfpaced": false, "topic_name": ["Philosophy"], "description": "\n\n                    \n                    \n                    This course will introduce you to some of the main areas of research in contemporary philosophy. Each module a different philosopher will talk you through some of the most important questions and issues in their area of expertise. We’ll begin by trying to understand what philosophy is – what are its characteristic aims and methods, and how does it differ from other subjects? Then we’ll spend the rest of the course gaining an introductory overview of several different areas of philosophy. \n\nTopics you’ll learn about will include: \n\nEpistemology, where we’ll consider what our knowledge of the world and ourselves consists in, and how we come to have it;\n\nPhilosophy of science, where we’ll investigate foundational conceptual issues in scientific research and practice;\n\nPhilosophy of Mind, where we’ll ask questions about what it means for something to have a mind, and how minds should be understood and explained;\n\nMoral Philosophy, where we’ll attempt to understand the nature of our moral judgements and reactions – whether they aim at some objective moral truth, or are mere personal or cultural preferences, and;\n\nMetaphysics, where we’ll think through some fundamental conceptual questions about the nature of reality.\n\nThe development of this MOOC has been led by the University of Edinburgh's Eidyn research centre.\n\nTo accompany 'Introduction to Philosophy', we are pleased to announce a tie-in book from Routledge entitled 'Philosophy for Everyone'. This course companion to the 'Introduction to Philosophy' course was written by the Edinburgh Philosophy team expressly with the needs of MOOC students in mind. 'Philosophy for Everyone' contains clear and user-friendly chapters, chapter summaries, glossary, study questions, suggestions for further reading and guides to online resources. Please click \"Start Here\" and navigate to the \"Optional Reading\" page for more information.\n\n                                            Syllabus\n                        What is Philosophy?(Dr. Dave Ward) We’ll start the course by thinking about what Philosophy actually is: what makes it different from other subjects? What are its distinctive aims and methods? We'll also think about why the questions that philosophers attempt to answer are often thought to be both fundamental and important, and have a look at how philosophy is actually practiced. Finally, we'll briefly touch upon two very influential philosophers' answers to the question of how we can know whether, in any given case, there really is a right way of thinking about things.What is Knowledge? And Do We Have Any?(Professor Duncan Pritchard) We know a lot of things – or, at least, we think we do. Epistemology is the branch of philosophy that studies knowledge; what it is, and the ways we can come to have it. In this module, we’ll take a tour through some of the issues that arise in this branch of philosophy. In particular, we’ll think about what radical scepticism means for our claims to knowledge. How can we know something is the case if we’re unable to rule out possibilities that are clearly incompatible with it? \nMinds, Brains and Computers(Dr. Suilin Lavelle) If you’re reading this, then you’ve got a mind. But what is a mind, and what does it take to have one? Should we understand minds as sets of dispositions to behave in certain ways, as patterns of neural activation, or as akin to programmes that are run on the computational hardware of our brains? In this module, we’ll look at how and why recent philosophy of mind and psychology has embraced each of these options in turn, and think about the problems and prospects for each.\nMorality: Objective, Relative or Emotive?(Dr. Matthew Chrisman) We all live with some sense of what is good or bad, some feelings about which ways of conducting ourselves are better or worse. But what is the status of these moral beliefs, senses, or feelings? Should we think of them as reflecting hard, objective facts about our world, of the sort that scientists could uncover and study? Or should we think of moral judgements as mere expressions of personal or cultural preferences? In this module we’ll survey some of the different options that are available when we’re thinking about these issues, and the problems and prospects for each.\nShould You Believe What You Hear?(Dr. Allan Hazlett) Much of what we think about the world we believe on the basis of what other people say. But is this trust in other people's testimony justified? In this module, we’ll investigate how this question was addressed by two great philosophers of the Scottish Enlightenment, David Hume (1711 - 1776) and Thomas Reid (1710 - 1796). Hume and Reid's dispute about testimony represents a clash between two worldviews that would continue to clash for centuries: a skeptical and often secular worldview, eager to question everything (represented by Hume), and a conservative and often religious worldview, keen to defend common sense (represented by Reid).\nAre Scientific Theories True?(Dr. Michela Massimi) In this module we will explore a central and ongoing debate in contemporary philosophy of science: whether or not scientific theories are true. Or better, whether a scientific theory needs to be 'true' to be good at all. The answer to this question comes in two main varieties. Scientific realists believe that theories ought to be true in order to be good. We will analyse their main argument for this claim (which goes under the name of 'no miracles argument'), and some prominent objections to it. Scientific antirealists, on the other hand, defend the view that there is nothing special about 'truth' and that scientific theories and scientific progress can be understood without appeal to it. The aim of this session is to present both views, their main arguments, and prospects.\nTime Travel and Philosophy (Dr. Alasdair Richmond) In our last module we'll think about some issues in metaphysics, a branch of philosophy that investigates the ways that reality could intelligibly be. Our case study will be the possibility, or otherwise, of time-travel. Some have thought that the apparent possibility of creating a machine that we could use to transport a person backwards in time can be ruled out just by thinking about it. But is time-travel really logically impossible? What would the universe have to be like for it to be possible? And can we know whether our universe fits the bill?\n\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Introduction to Philosophy", "price": 0, "instructors": "Dave Ward, Duncan Pritchard, Michela Massimi, Suilin Lavelle, Matthew Chrisman, Allan Hazlett and Alasdair Richmond", "institution_name": ["University of Edinburgh"], "commitment": "1-2 hours", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/philosophy", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}