{"selfpaced": true, "topic_name": ["Philosophy"], "description": "\n\n                    \n                    \n                    It is often claimed that relativism, subjectivism and nihilism are typically modern philosophical problems that emerge with the breakdown of traditional values, customs and ways of life. The result is the absence of meaning, the lapse of religious faith, and feeling of alienation that is so widespread in modernity. \n\nThe Danish thinker Søren Kierkegaard (1813-55) gave one of the most penetrating analyses of this complex phenomenon of modernity. But somewhat surprisingly he seeks insight into it not in any modern thinker but rather in an ancient one, the Greek philosopher Socrates.\n\nIn this course we will explore how Kierkegaard deals with the problems associated with relativism, the lack of meaning and the undermining of religious faith that are typical of modern life. His penetrating analyses are still highly relevant today and have been seen as insightful for the leading figures of Existentialism, Post-Structuralism and Post-Modernism.\n\n                                            Syllabus\n                        Course Introduction: The Life and Work of Kierkegaard as a \"Socratic Task\"In this first unit, the basic premise of the class is presented, namely, the idea that Kierkegaard used Socrates as his model. The lecture begins by taking a brief look at Kierkegaard’s early life: his family background and his education at the School of Civic Virtue in Copenhagen. We then turn to The Concept of Irony and to understand its structure and argumentative strategy. Since Kierkegaard sees himself as fulfilling a Socratic task, it is important to gain some insight into the thought of Socrates in order to determine exactly what it is that this means. So this week’s lesson looks briefly at a couple of Plato’s dialogues, Euthyphro and The Apology, which Kierkegaard studied carefully. After each analysis a brief account of Kierkegaard’s use or appropriation of the given idea is sketched.Kierkegaard, Martensen and HegelianismKierkegaard’s understanding of Socrates was of course based on his reading of the texts of Plato, Xenophon and Aristophanes, that is, the primary sources. But it was also largely shaped by the interpretation of the famous German philosopher G.W.F. Hegel, with whom he was in a constant critical dialogue in The Concept of Irony. Hegel’s philosophy was a highly popular trend at the University of Copenhagen in the late 1830s when Kierkegaard was a student and was writing this work. So this week explores first the presence of Hegel at the university during Kierkegaard’s time, and then Hegel’s analysis of Socrates. This provides the opportunity to revisit and build on the key topics that were introduced in the first lecture: Socratic irony, aporia, the daimon, etc. It is shown how Kierkegaard is inspired and influenced by the important historical role that Hegel ascribes to the person of Socrates. This week also continues the biographical narrative of the young Kierkegaard. It sketches his life as a young student at the University of Copenhagen and his trip to Gilleleje, where he wrote the famous journal entry about seeking a truth for which to live and die. This provides the opportunity to introduce the figure of Hans Lassen Martensen, who was a lifelong rival for Kierkegaard and an important figure in the Danish reception of Hegel’s philosophy.Kierkegaard’s View of SocratesThe goal in this lecture is to have a look at Kierkegaard’s understanding of Socrates and to see where he agrees with Hegel and where he disagrees. We look at Kierkegaard’s analysis of Socrates’ daimon, the trial and conviction of Socrates, the relation of Socrates to the Sophists and to the later schools of philosophy. An account is also given of how Kierkegaard was quite exercised by Hans Lassen Martensen and his lectures at the University of Copenhagen. We explore Kierkegaard’s response to Martensen’s article on Faust, and Kierkegaard’s two satirical works that were aimed at Martensen and his students, namely, The Conflict between the Old and the New Soap Cellars and Johannes Climacus or De Omnibus dubitandum est. Finally, we also introduce a lesser-known Danish figure, Andreas Frederik Beck, who wrote the first book review of The Concept of Irony—a review that gives us a brief snapshot into the contemporary assessment of the work and also affords some insight into Kierkegaard’s view of it when we see his negative reaction to Beck’s comments.Kierkegaard, Heiberg and HistoryKierkegaard is interested in the problem of the meaninglessness of life. He regards this as an important modern phenomenon that must be taken seriously. This lecture begins with a treatment of the second part of The Concept of Irony, where Kierkegaard examines different forms of what he calls “modern irony.” The positions that he looks at are very similar to that of the modern nihilist. We examine this analysis to see what insights it might hold for the modern problem of the absence of meaning in our 21st century world. This lecture introduces Kierkegaard’s contemporary Johan Ludvig Heiberg, who tried to alert his age to the crisis of nihilism and subjectivism in a way that anticipates some of Kierkegaard’s considerations. In this lecture we go through Kierkegaard’s critical assessment of Hegel’s understanding of Socrates and history. We try to see where Kierkegaard follows Hegel and where he strikes out on his own.Kierkegaard, Møller and SchlegelDuring this unit, we will continue the analysis of the second part of The Concept of Irony. Here Kierkegaard introduces the irony of the German Romantics as a contrastive form of irony to that of Socrates. We begin with Kierkegaard’s account of Fichte’s theory of subjectivity which, he (following Hegel) claims is the forerunner to Romantic irony. This then leads to Kierkegaard’s account of the appropriation of Fichte’s theory by the Romantic authors, Friedrich von Schlegel and Ludwig Tieck. This lecture also introduces one of Kierkegaard’s great mentors, Poul Martin Møller, who was also interested in an analysis of Romantic irony as a form of modern nihilism. We see how Kierkegaard is critical of Romantic irony as “historically unjustified,” while he continues his praise of Socratic irony. Finally, we continue the biographical narrative of Kierkegaard’s life with an account of his relation to and broken engagement with Regine Olsen.The Trip to Berlin and the Beginning of the AuthorshipThis unit looks at the years that immediately followed Kierkegaard’s The Concept of Irony, namely, from 1841 to 1843. From the autumn of 1841 to the spring of 1842 Kierkegaard was in Berlin where he heard the lectures of the German philosopher Schelling. During this time he struggled with what he wanted to do with his life. He decided to became a writer and, drawing on the knowledge gained from his dissertation, to use Socrates as his model. We examine Kierkegaard’s breakthrough work, Either/Or, which appeared at the beginning of 1843. This work develops in a literary way some aspects of the character of the Romantic ironist that he explored in the second half of his dissertation. We also examine Johan Ludvig Heiberg’s critical review of this work. We briefly mention the key works that Kierkegaard published after Either/Or, namely, Repetition, Fear and Trembling and his series of edifying or upbuilding discourses. We look in some detail at Kierkegaard’s conception of the nature of faith as presented in Fear and Trembling. His conception is a highly troubling one that raises important questions for religious life today.The Development of the Pseudonymous WorksThe years 1844 to 1846 were perhaps the most productive in Kierkegaard’s entire life. In this lecture we explore the series of famous works that he penned during this time, among others, the Philosophical Fragments, The Concept of Anxiety, Prefaces, Stages on Life’s Way and the Concluding Unscientific Postscript. These books present a complex series of works ostensibly authored by different pseudonyms, each with his own agenda and intentions. At first glance, this might all look like a playful chaos or a straightforward kind of madness on Kierkegaard’s side. But in this lecture we try to make sense of Kierkegaard’s plan with these works and their complex relations to one another. We see that many of the main motifs concerning Socrates that Kierkegaard originally treated in The Concept of Irony now reappear in different contexts in these later works. This is particularly interesting when we consider that these works treat important Christian concepts such as the incarnation, the revelation, faith, sin, and forgiveness. Many people might think that it is outrageous to believe that a pagan philosopher can help to understand these Christian concepts. Here we can catch a glimpse of the radicality of Kierkegaard’s thought. He believes that Socrates has some important insights for Christians today. This lecture also continues the biographical narrative by highlighting Kierkegaard’s polemic with Johan Ludvig Heiberg and his conflict with the satirical journal, The Corsair. The lecture ends with a discussion of the Concluding Unscientific Postscript, which Kierkegaard believed would be his last work before he died. We explore Kierkegaard’s conception of a parallel authorship that features a series of pseudonymous works that run parallel to a series of signed works, which are intended to treat the same topics but in different ways.The 2nd Half of the Authorship and the Attack on the ChurchThe last decade of Kierkegaard’s life was in many ways the most dramatic. This was the time of the Revolution of 1848 and of Kierkegaard’s public attack on the Danish state church in his final years. This period represents what Kierkegaard scholars refer to as the second half of the authorship, namely, the period from 1846 after the Concluding Unscientific Postscript to Kierkegaard’s death in 1855. In this lecture we explore some of Kierkegaard’s main works from these years, such as A Literary Review of Two Ages, Upbuilding Discourses in Various Spirits, The Sickness unto Death, Practice in Christianity and The Moment. We will see how some of the themes and motifs that we have examined re-appear in these works. In our exploration of these texts it will become evident that even as Kierkegaard grows older, he continues to return to the figure of Socrates as a source of inspiration. Indeed, he never abandons the great hero of his youth. Even in the last text that he ever completed before his death, he explicitly states that Socrates was the only model that he used for his work. Our goal in this lecture is, among other things, to try to understand what he means by this. The lecture ends with a biographical account of Kierkegaard’s attack on the Danish State Church, his final illness and death.\n                                    ", "end_date": "2015-11-30T00:00:00Z", "title": "Søren Kierkegaard - Subjectivity, Irony and the Crisis of Modernity", "price": 0, "instructors": "Jon Stewart", "institution_name": ["University of Copenhagen"], "commitment": "4-6 hours", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/kierkegaard", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-10-05T00:00:00Z"}