{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Whenever Apple releases a new device class like the Apple Watch, people lining up in front of stores to get their hand on the product as quickly as possible. The question is, if it makes sense to buy one or not. </p><p>This course shows you from a user perspective what you can do with the Apple Watch based on daily real-life use-cases. This course is for you if you hesitating to buy the Apple Watch or if you have one and you are wondering when to use the watch and when to use the iPhone instead.</p><strong>Is it worth to buy the Apple Watch?</strong><ul><li>Only course which was specifically written from a user experience perspective</li><li>Comprehensive list of use-cases for the Apple Watch</li><li>List of use-cases when it is better to use the iPhone instead</li><li>Five things you should know before you buy the Apple Watch</li><li>My top five reasons why I added an Apple Watch to my system of Apple devices</li></ul><strong>Contents and Overview</strong>This course contains just 6 lectures and 6 quizzes and can be finished just within one hour. It enables the student to make a decision on the purchase of an Apple Watch based on thorough research of daily use-cases. It is designed for anyone, regardless of experience level, who is interested in the new functionalities of the Apple Watch.You can listen to this course from start to finish or you can read the short description of each lecture and jump right into the once you are interested in.<p>You will learn based on videos, slides and text. It starts with a pre-quiz and each sections ends with a quiz as well.</p>Use the discussion groups in each lecture to ask specific questions about details that interest you.", 
    "end_date": null, 
    "title": "Apple Watch: The ultimate user and decision guide", 
    "price": "20.00", 
    "instructors": "Markus Mueller", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565356_9ad6_3.jpg", 
    "course_url": "https://www.udemy.com/apple-watch-the-ultimate-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T18:29:53Z"
}