{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Faça o Curso de Mac!</strong></p>\n\n<p><strong>O que é o Programa Aprenda Mac?</strong></p>\n\n<p>O Programa Aprenda Mac em 4 Semanas é um <strong>curso prático</strong> voltado para usuários iniciantes e intermediários de computadores Apple. </p>\n\n<p>O objetivo é ensinar os fundamentos, eliminando a sub-utilização desses equipamentos.</p>\n\n<p><strong>Por que se inscrever no Programa Aprenda Mac?</strong></p>\n\n<p>Todo conteúdo foi desenvolvido com base em experiências de erros e acertos de vários usuários de Mac que acompanham o Blog do Super Apple e alunos atendidos pela Tecnologia Pessoal, empresa de suporte e treinamento Apple que atua em Campinas e região. </p>\n\n<p>Mesmo que você não tenha nenhuma habilidade ou experiência com o Mac, o Programa Aprenda Mac em 4 Semanas irá te ajudar a aprender utilizar totalmente seu Mac.</p>\n\n<p><strong>E se você tiver dúvidas?</strong></p>\n\n<p>Ao se inscrever no programa Aprenda Mac, você terá um instrutor te acompanhando, não só durante as 4 semanas do treinamento, mas em todo o tempo em que o curso estiver disponível na Udemy.</p>\n\n<p><em></em></p>\n\n<p><strong>E se você não conseguir aprender Mac em 4 semanas?</strong></p>\n\n<p>Não se preocupe, todo conteúdo será disponibilizado com acesso vitalício, ou seja, mesmo que você não consiga aprender as aulas ficam disponíveis para ser acessado por tempo indeterminado : )</p>\n\n<p><strong>E se você não tiver tempo para estudar?</strong></p>\n\n<p>Esse é um ponto interessante, realmente a falta de tempo é uma realidade em nossas vidas.  Foi por isso que todas as aulas foram gravadas com tempo máximo de até 20 minutos, assim você poderá se dedicar pouco tempo por dia tendo o máximo de resultado!</p>\n\n<p><strong>Como são as aulas?</strong><br></p>\n\n<p>As aulas são gravadas e <strong>100% práticas!</strong> Desta forma acreditamos que aprender Mac fica muito mais fácil. Outro coisa interessante é que todas aulas tem duração média de 15 minutos, assim você pode estudar um pouco por dia sem perder muito tempo, legal né?</p>", 
    "end_date": null, 
    "title": "Aprenda Mac em 4 Semanas: O Guia Prático do Usuário", 
    "price": "50.00", 
    "instructors": "Paulo Alexandre", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648370_aa7c_9.jpg", 
    "course_url": "https://www.udemy.com/aprenda-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T00:12:52Z"
}