{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Have you ever wondered  how much time do you waste with the wrong applications </strong>day after day? <strong style=\"\">Can you imagine how much time you can save</strong> by using keyboard shortcuts? Do you know how to leaverage all the potential of mac built in tools like spotlight, finder, safari, mail or gmail, office etc.?</p><p><strong style=\"\">If you don&#039;t have an answer to these questions this is the right place for you</strong>. I will guide you into a journey inside of the best tips to avoid wasting your time while working and getting things done in the most productive way.</p><p>A study  estimates that people that don&#039;t use shortcuts and do not manage how to increase their productivity with their tool waste more than 20 days per year that considering the working days in a year is about <strong style=\"\">2 hours per day!</strong></p><p>What would you do with 2 additional hours per day? Walk your dog, study a new language, business development...There are a plenty of opportunity out there to live a better life and one is to invest time in studying the right way to be more effective at working. This course is aimed to be a part of this journey to avoid waste of time in our precious life.</p><p>By the end of this course you will learn the most incredible mac trick that will impress your friend and colleague and let you be more productive. Here are something that you will learn by the end of the Mac Productivity Course: </p><ul style=\"\"><li>Shortcuts and tools to cut the time you spend your mac by 40%</li><li>How to manipulate text like a Master </li><li>How to avoid using your mouse </li><li>Learn how to process email (with Mail or Gmail) in seconds and be always on inbox zero</li><li>Install and Mastering the new Office 2016 (free installation package provided by Microsoft)</li><li>Introduction to new free tools that will save you hours over the course of your workday</li></ul><p>Udemy offers a money back guarantee if for any reason you&#039;re not satisfied with any course you buy here. <br style=\"\"></p><p><strong style=\"\">This is a ongoing course a new video will be released every week and I will follow any comment you will post assuring that I can provide videos on subject that you are interested in.</strong><br style=\"\"></p><p><strong style=\"\"><br style=\"\">The education is evolving and you are being part of this evolution, help me creating the right content for you and the other students by leaving comments and suggestions. I will reply at every comment and will make any video related to the productivity field.<br style=\"\"><br style=\"\"></strong></p><p>What are you waiting for?</p><p><br style=\"\">See you in the first lesson.<br style=\"\"><br style=\"\"></p><p>Andrea</p>", 
    "end_date": null, 
    "title": "Be productive with your Mac like a pro!", 
    "price": "20.00", 
    "instructors": "Andrea Cirulli", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452500_337c_5.jpg", 
    "course_url": "https://www.udemy.com/mac-productivity-save-up-to-2-hours-per-day/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T19:41:26Z"
}