{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t        **This is not a development course**  </p>  <p>  \t  Over 500 satisfied students!  </p>  <p>  \t&lt;&lt;Updated:10-30-2014&gt;&gt;  </p>  <p>  \t  Each day you use your iPhone for everything from sending texts to finding out how to get from one place to another.  Some spend hours a day on their device. Fortunately, Apple has given an incredible number of changes and new features that will help to save you time so it can be better spent on the things in life you enjoy. I guarantee you will find a good number of features and other aspects of iOS 8 you were unaware of and that will help you to become more efficient and more knowledgeable of your own device!  </p>  <p>  \t<strong>Feeling lost?</strong>  </p>  <p>  \t        iOS 8 is Apple's \"<strong>biggest update</strong>\". Amidst all of the changes, you need to know how to properly and efficiently navigate and use your own phone. In just an hour you can learn all the tips and tricks of iOS 8 and become a master of all of its new features designed for efficiency.  </p>  <p>  \t<strong>Not sure about iOS 8?</strong>  </p>  <p>  \t        Unsure if you really want to switch over to iOS 8? Comfortable with iOS 7 because its what you are used to? Well in just an hour I can get you to become more familiarized and deeply knowledgeable of iOS 8 then you are in your current operating system. I will also show why exactly it is that <strong>iOS 8 is better for you!</strong>  </p>  <p>  \t<strong>In This Course:</strong>  </p>  <p>  \t        Throughout the course I will walk you through what iOS stands for and its significance, iOS 8's top features, give you all of iOS 8's efficiency features, walk you through all of the new features of iOS 8, and finally give you an overview of why iOS 8 has such a bright future.  </p>  <p>  \t        Looking forward to seeing you in the course!  </p>", 
    "end_date": null, 
    "title": "Become Efficient With iOS To Save Time", 
    "price": "20.00", 
    "instructors": "Casey Gauss", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301592_63f3_4.jpg", 
    "course_url": "https://www.udemy.com/learnios8/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T21:28:54Z"
}