{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t                 (<strong>Note:</strong> This course was developed in 2013 and uses <strong>ScreenFlow <em>version 4</em></strong>. A<em> newer version of ScreenFlow (v5) was released on November 4, 2014. </em>If you are currently using ScreenFlow version 4, then this course is for you. If, you're using ScreenFlow version 5, then you may be interested in purchasing the author's newest course, <strong><em>ScreenFlow version 5 Essentials: Teach Online Today</em></strong>, which was released on December 31, 2014. </p>  <p>  \t<strong>Learn the Fundamentals of ScreenFlow and Create Your Online Course Now.</strong>  </p>  <p>  \t                             You will start with the demonstration of a sample feature-rich animated web video screencast -- then you'll learn to replicate it.  </p>  <p>  \t                             In this course, you'll learn how to use ScreenFlow for Macintosh -- one of the \"Big 3\" video screen capture and editing software programs in the market used by professional screencasters and online learning professionals.  But, your learning won't stop there.  </p>  <p>  \t                             Delivered by a professional screencaster, online learning architect, and winner of the 2012 Techsmith Best In Category ScreenChamp award.  </p>  <p>  \t<strong>Testimonials</strong>  </p>  <p>  \t                             \"Mel has a uniquely 'feet on the ground,' personable style with emphasis always being on the message rather than the messenger...\"<br>  \t<em>~ Richard Andrews, TTA Online Course Creator &amp; Facilitator</em>  </p>  <p>  \t                             \"I had hired a college student as a marketing assistant to help me with other aspects of executing our marketing efforts but she had zero experience with video...One week later, Kristin was producing amazing videos... Mel delivers a comprehensive and intuitive learning style that is easy to follow for students with any level of experience.\"<br>  \t<em>~ Scott Schang, Broadview Mortgage Katella Team</em>  </p>  <p>  \t<strong>Go beyond the classroom.  </strong>Learn how to transform your live presentations, workshops and live training courses to a digitized format that's easily shared, easily consumed and potentially profitable.  </p>  <p>  \t<strong>Don't be boring.</strong> Learn to kick your online presentations up a notch from run-of-the-mill online presentations by overlaying quality audio and synchronizing live action web video to increase your audience's engagement.  </p>", 
    "end_date": null, 
    "title": "Beyond PowerPoint: Teach Online With ScreenFlow (v4) For Mac", 
    "price": "25.00", 
    "instructors": "Mel Aclaro", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71370_fcdf_6.jpg", 
    "course_url": "https://www.udemy.com/screenflow-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-29T22:46:26Z"
}