{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t   The first time you got your new shiny Mac you <em style=\"\">swore</em> to keep it clean and organized.  </p>  <p style=\"\">  \t   Today, your computer files are scattered between the Download Folder and the Documents Folder, your music is all over your computer and iPhoto takes forever to open with all the events you&#039;re Mac has automatically created. As a result, it has become disorganized and even slow!  </p>  <p style=\"\">  \t <strong style=\"\">But it doesn&#039;t have to be this way!</strong>  </p>  <p style=\"\">  \t   If you&#039;re like me, you use your computer on a daily basis for important tasks. Whether it be for school or business related projects, everyone wants to be able to access their files when they need them as soon as they need them! <strong style=\"\">Nobody has the time or patience for a rainbow wheel or scavenger hunt through your hard drive.</strong>  </p>  <p style=\"\">  \t   Thats why in this course we will cover the best organizational tactics, such as:  </p>  <ul style=\"\">  \t<li style=\"\">Tagging your files for easy search</li>  \t<li style=\"\">Automating file comments to keep documents organized</li>  \t<li style=\"\">Using Smart Folders to sort lose files</li>  \t<li style=\"\">An awesome music structure that will organize your music with one click</li>  \t<li style=\"\">Organizing photo Events in iPhoto</li>  \t<li style=\"\">Using Keywords and Smart Albums to organize photos</li>  \t<li style=\"\">Deleting additional application files left behind for more free space!</li>  </ul>  <p style=\"\">  \t <strong style=\"\">If you&#039;re ready to regain full control of your computer, check out my 32 detailed videos below!</strong>  </p>  <p style=\"\">  \t   I will personally answer all questions twice a week so feel free to ask questions if you cannot apply any of the materials yourself!  </p>  <p style=\"\">  \t   Sincerely,  </p>  <p style=\"\">  \t <strong style=\"\">Luis Morales</strong>  </p>", 
    "end_date": null, 
    "title": "Clean & Organize Your Mac In Under 2 Hours", 
    "price": "50.00", 
    "instructors": "Luis Morales", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86990_7e53_9.jpg", 
    "course_url": "https://www.udemy.com/organize-and-clean-your-messy-macbook/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-02T06:46:12Z"
}