{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Welcome to the crash course on Mac Operating System (commonly referred to as Mac OS X)!</p><p>Mac computers are wonderful, stable, carefully designed and well built - no doubt about that. And it's safe to assume that almost always, there is an easy and cool way to do things in Mac OS X. But many people think that with Mac computers, one needs to purchase many extra software packages, which come built in with Windows computers. If you have the same views, <strong class=\"redactor-inline-converted\">I have a great news for you! Your Mac computer is full of tools and functionalities which you probably have never had a chance to explore</strong>,<strong class=\"redactor-inline-converted\"> so you're missing out on a lot of cool stuff. </strong>And that is why I created this course to make your life easier and better :)</p><p>This course is also for those who switched from Windows to Mac OS X, and are learning the new operating system. I know how confusing and frustrating it can be, but don't worry as I got you covered!</p><p>In this hands on course, I have carefully put together many tricks and best practices in the form of short video tutorials. <strong>It took me years (well, literally!) to learn them, but with this course, you can learn them super fast with minimal effort.</strong> These wonderful tips and hacks will save your time and energy, and will have a big impact on your productivity. <strong class=\"redactor-inline-converted\">Thanks to Udemy, this course will take you from a beginner to an advanced level user in no time</strong>! After taking this course, you would be able to navigate the Mac OS X with swipes and keyboard shortcuts like a breeze, and would be able to minimise computer slowdowns like a boss.</p><p>This course will be regularly updated and I will be adding more tips as I explore them, or whenever a new version of Mac OS X is released!</p><p>Have fun :)</p><p><br></p>\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Crash course: How to use your Mac Computer effectively!", 
    "price": "20.00", 
    "instructors": "Kashif A.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/805666_265c_2.jpg", 
    "course_url": "https://www.udemy.com/crash-course-how-to-use-your-mac-effectively/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-27T22:19:17Z"
}