{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>★ ★ ★ ★ ★ </p><p><em>More than 200 people are now enjoying a less stressful life!</em>  </p>  <p>  \t<em>Thank you for your interest in improving your life using OmniFocus!</em></p><p>★ ★ ★ ★ ★ </p><p><em><em><strong>## Updates</strong></em></em></p><p><em><em><strong></strong></em></em><em><strong>New lecture</strong> about how to reduce the size of your database so you can sync your tasks faster!.</em></p>  \t  <p>★ ★ ★ ★ ★ </p><p><strong>## What is a SKILL PILL?</strong></p><p>A skill pill is an <strong>action course</strong>, where I grind and filter the most relevant information so you can understand the key concepts, and apply them to your life or business right away.</p><p>Learn by doing, not by watching courses on your screen!<br></p><p>★ ★ ★ ★ ★</p>  <p><strong>## You need this course if...</strong></p>  <p>  \t<strong>Your tasks management system doesn't cover your needs anymore</strong>, you've heard that in the Getting Things Done® world, OmniFocus is the King, but you still have doubts.  </p>  <p>  \t        Or maybe you tried OmniFocus once, but it left you the bitter feeling of being doing somethings wrong and not being taking advantage of the full potential of the application.  </p>  <p>  \t        Or even worse, you don't have any tasks management system, and you work on your tasks and projects without any order or criteria.  </p>  <p><strong>## Why take this course?</strong></p>  <p>  \t        You deserve be the captain of your life, and stop disappointing yourself and people around you because you promise do things that later you forget or you don't finish on time.  </p>  <p>  \t        GTD could be difficult, but I adapted it to a simpler version in OmniFocus.  </p>  <p><strong>## How is the course structured?</strong></p>  <p>  \t        The course is structured in 6 chapters. Each one is a step forward to become a more efficient person. You can gradually learn at your own pace, and repeat the section or ask your doubts within the community before continue to the next section.  </p>  <ol>  \t<li><strong>Basic principles</strong>: don't know what GTD is? Never used OmniFocus before? This section is for you.</li>  \t<li><strong>Capture</strong>: techniques for capturing all the ideas and tasks that come to you and your mind daily.</li>  \t<li><strong>Organise</strong>: slow down your horses! Where are you going to put all that captured stuff?</li>  \t<li><strong>Process</strong>: send the items to their place.</li>  \t<li><strong>Work</strong>: move your ass and get things done!</li>  \t<li><strong>Review</strong>: learn how to correctly review your system so nothing will be out of your control, ever.</li>  </ol>  <p><strong>## What kind of materials are included?</strong></p>  <p>  \t        The videos will help you out understand everything,  there are also a couple of PDFs you can save into your Mac, or even print in order to have a good reference of the key points. Plus, every section has a final quiz, so you can be sure you have understood everything before taking the next step!  </p>  <p><strong>## How long will the course take to complete?</strong></p>  <p>  \t        I carefully designed the course so you can at least take it in less than the 14 day free trial. But of course you can be faster. You can ideally take one section per day and finish the course in less than a week.  </p>  <p>  \t        This is up to you, and will also depend on the mess level of your current life.  </p>  <p>★ ★ ★ ★ ★ </p>  <p>  \t    Join the GTD and OmniFocus, <strong>take the course and start improving your life right now!</strong>  </p>", 
    "end_date": null, 
    "title": "Getting Things Done With OmniFocus 2 [Skill Pill]", 
    "price": "20.00", 
    "instructors": "Javier Cristobal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302036_5121_4.jpg", 
    "course_url": "https://www.udemy.com/getting-things-done-with-omnifocus-2/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T11:00:51Z"
}