{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Apple has done it again with a new awesome update!&nbsp;With more than 200 new features coming in the fall, OS X Mavericks brings Maps and iBooks to the Mac, introduces Finder Tags and Tabs, and enhances multi-display support for power users.</p><p><span>This course  will keep you up to speed on all the new tips and tricks.&nbsp;</span></p><p><span>We will move quickly to make sure you catch it all in one  setting. You will learn all you need to know in less then an hour.&nbsp;</span></p><p><span>Here are a few things you will learn in the course.</span></p><p></p><ul><li><span>The New<span>&nbsp;</span>iBooks</span><br></li><li><span>The Maps<br></span></li><li><span>The New&nbsp;</span>Calendar</li><li>The New&nbsp;Safari</li></ul>We will break down the new sidebar here is a&nbsp;quick tip:&nbsp;<p></p><p><span>The new Sidebar is the new home of Bookmarks, Reading List, and the new Shared Links feature. It&rsquo;s a gray bar (minimum width: 300 pixels) that lives on the left side of the browser window. To open it, click on that book-shaped Sidebar icon on the toolbar, or choose Show Bookmarks Sidebar, Show Reading List Sidebar, or Show Shared Links Sidebar from the View menu. (There are also keyboard shortcuts&mdash;Command-Control-1, 2, and 3, respectively. You can toggle the Sidebar on and off by pressing Command-Shift-L.)</span><span><br></span></p><p><span>We are not going to spend a lot of time here. We are going to hop right into it and&nbsp;show you how to get down =)&nbsp;</span></p><p><span><br></span></p><p><br></p><p></p>  ", 
    "end_date": null, 
    "title": "Hands-on with OS X Mavericks", 
    "price": "20.00", 
    "instructors": "Freedom Portis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/75698_e8b0_6.jpg", 
    "course_url": "https://www.udemy.com/hands-on-with-os-x-mavericks/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-08T15:16:09Z"
}