{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>In this iPad video course for beginners I will help you to understand and use the most basic features of your iPad. Initially you will learn everything about the central starting point of your every day usage - the Home Screen. Next, before diving deeper into the software, you will get to know the hardware buttons and switches and learn hot to use them. I will teach you how to arrange your apps and organize them using folders before thoroughly looking at the keyboard and it's features, such as type forward suggestions, special character and the gorgeous emojis. You will learn how to create, edit and revise text, even using the built in dictation feature. The next lesson will cover cut &amp; copy of text and photos, teaching you how to paste the selection at a different place. The Lesson \"Restart and reset iPad\" will empower you to solve the majority of issues you might encounter, when using an iPad. Looking at the multitasking, you will learn how to manage your simultaneously running apps as well as how to profit from slide over and watch videos using the picture in picture functionality. After learning how to use the built-in spotlight search you will find everything you look for right on your iPad. The final lesson will teach you how to easily control your iPad by using the Control Centers shortcuts for the most important features of your device.</p>", 
    "end_date": null, 
    "title": "iPad Tutorial for iOS9 Part 1", 
    "price": "20.00", 
    "instructors": "Tobias Offhaus", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738132_dcc8_2.jpg", 
    "course_url": "https://www.udemy.com/ipad-tutorial-for-ios9-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T18:25:39Z"
}