{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Aufgeregt packen Sie Ihr nagelneues iPad aus und halten es in Ihren Händen. Sie schalten es zum ersten Mal an - ein tolles Gefühl! </p><p>Aber - Hilfe, was mache ich jetzt damit?</p><p>Der Kurs <strong style=\"\">iPad von A-Z: Lernen Sie die Grundlagen im Handumdrehen! </strong>ist das Rundum-Sorglos-Paket, mit dem Sie Ihr iPad in kurzer Zeit von A-Z kennenlernen! Es deckt alles ab, was Sie als Einsteiger für den Anfang benötigen. Sie werden systematisch mit den wichtigsten Bedienschritten für den Anfang vertraut gemacht.</p><p><strong style=\"\">Mit Hilfe dieses Kurses haben Sie Ihr iPad und die unglaublich praktischen Apps (Anwendungen), die sich hinter dem fantastischen Display verbergen schnell im Griff.</strong> </p><p>Vergessen Sie alles, was Sie bisher über Computer gehört haben: Das iPad ist <em style=\"\">einfach </em>anders. Sie können mit dem Finger tippen? Also können Sie ein iPad bedienen!</p><p>Das ist das wirklich Aufregende am iPad: Sobald Sie Ihre Finger zum ersten Mal benutzen, um Dinge direkt auf dem Bildschirm zu bewegen und unmittelbar zu sehen, was Sie tun, sind Sie bereits Profi! Das lässt die Computerbedienung in einem völlig neuen Licht erscheinen.</p><p>Obwohl alles extrem benutzerfreundlich für Sie arrangiert wurde: Das iPad ist dennoch ein bemerkenswert komplexes Gerät, das Ihre Aufmerksamkeit erfordert. Ein paar kleine Dinge gilt es zu lernen, damit Ihr iPad richtig „rund“ läuft:</p><ol style=\"\"><li style=\"\">Wie schalte ich es an- und wieder aus?</li><li style=\"\">Die Funktionen der wenigen Knöpfe und Anschlüsse.</li><li style=\"\">Welche Einstellungen sollte ich im Betriebssystem vornehmen?</li><li style=\"\">Die Möglichkeiten der vorinstallierten Apps bestmöglich ausnutzen.</li><li style=\"\">Wie kann ich Aufgaben des Alltags clever mit dem iPad erledigen?</li><li style=\"\">Wiederkehrende Abläufe sicher beherrschen.<br style=\"\"><br style=\"\"></li></ol><p><strong style=\"\">Wenn Sie sich im mittleren oder fortgeschrittenen Alter befinden und ganz neu mit dem iPad starten, dann ist dieser Kurs genau das Richtige für Sie!</strong><strong style=\"\"> </strong><strong style=\"\">iPad von A-Z: Lernen Sie die Grundlagen im Handumdrehen!</strong> vermittelt Ihnen das nötige Wissen und Selbstvertrauen, um das beste aus Ihrem iPad heraus zu holen und sich vielleicht bald schon größeren Herausforderungen am iPad zu stellen.</p><p>Sie haben die Wahl: Sie können den Kurs Lektion für Lektion durcharbeiten oder sich einzelne Inhalte heraussuchen, die für Sie gerade wichtig sind. Der Kurs besteht aus zahlreichen Einzelschulungen für die allgemeinen Einstellungen und unterschiedliche Apps.</p><p><strong style=\"\">Mit Hilfe dieses leicht verständlichen Videokurses können Sie Ihr Lerntempo selbst bestimmen und entscheiden, wann Sie lernen und - wie oft Sie eine Lektion anschauen.</strong></p><p>Sobald wichtige Updates für das iPad erscheinen, werden auch neue, zusätzliche Videos von mir hinzugefügt. Natürlich stehe ich Ihnen für alle Fragen gerne zur Verfügung.</p><p><em style=\"\">Das iPad bietet Ihnen völlig neue Möglichkeiten, mit einem Computer umzugehen: Intuitiver und angenehmer als je zuvor! Der Kurs <strong style=\"\">iPad von A-Z: Lernen Sie die Grundlagen im Handumdrehen! zeigt Ihnen, wie das iPad für Sie ein mobiler Tausendsassa sein kann… </strong></em>Im Internet surfen, Emails erhalten und schreiben, Fotos anschauen und mit anderen teilen, HD-Videos genießen, Videonachrichten und Telefonate weltweit elektronische Bücher lesen, Musik hören, Spiele spielen und vieles mehr.</p><p>Ich freue mich, Sie in meinem Kurs zu sehen! Was kann Sie jetzt noch davon abhalten? Melden Sie sich jetzt an und machen sich auf den Weg. Am Ende von <strong style=\"\"></strong><strong style=\"\">iPad von A-Z: Lernen Sie die Grundlagen im Handumdrehen!</strong> sind Sie auf dem besten Weg, ein wahrer iPad-Meister zu werden!</p>", 
    "end_date": null, 
    "title": "iPad von A-Z: Lernen Sie die Grundlagen im Handumdrehen.", 
    "price": "40.00", 
    "instructors": "Johannes Friedrich", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392882_be29_2.jpg", 
    "course_url": "https://www.udemy.com/ipadeinsteiger/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T10:05:47Z"
}