{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Hast du auch genug davon, dich statt dem Erstellen deiner Präsentationen mit dem Erlernen von Keynote herumzuschlagen?</p>\n\n<p><strong class=\"redactor-inline-converted\">Was erwartet dich in diesem Kurs?</strong></p>\n\n\n\n<p>Ich nehme dich an die Hand und bringe dir Keynote Schritt für Schritt bei. Wenn du diesen Kurs beendet hast, wirst du Keynote verstehen und beherrschen. Künftig kannst du deine Zeit ins Erstellen deiner Präsentationen, anstatt ins Herausfinden von einzelnen Funktionen investieren. </p>\n\n\n\n\n\n<p>Egal ob du ein Meeting vorbereitest, deine Abschlußarbeit präsentierst, einen Onlinekurs erstellst oder was auch immer - ohne flüssiges Beherrschen von Keynote wird das Ganze entweder ein Murks, ziemlich nervenaufreibend oder reine Zeitverschwendung, </p>\n\n\n\n\n\n<p>Um dich heutzutage von der Masse abzuheben, brauchst du eine vernünftige Präsentation. Und um all deine Ideen umsetzten zu können, ist es unumgänglich, das entsprechende Programm - in diese Fall Keynote 6 - im Schlaf zu beherrschen.</p><p><strong class=\"redactor-inline-converted\">Was dir der Kurs bringt</strong></p><p>Stell dir vor, wie befriedigend es ist, deine Zeit und deine Energie nicht mehr ins Herausfinden bestimmter Funktionen innerhalb Keynote, sondern ins Umsetzen deiner effektiven Ideen zu investieren. </p>\n\n<p>Stell dir vor, wie beruhigend es ist, zu wissen, dass du ab sofort fähig bist, die Präsentation deiner Wünsche zu erstellen oder nachzubauen.</p>\n\n<p>Kannst dir vorstellen, wie es sich anfühlt, endlich DIE Präsentation zu kreieren, die du dir erträumst? </p>\n\n<p><strong class=\"redactor-inline-converted\">Warum noch zögern?</strong></p><p>Melde dich jetzt für diesen Kurs an und lerne Keynote Schritt für Schritt, einfach und schnell beherrschen. </p><p><strong class=\"redactor-inline-converted\">Deine Garantie</strong></p><p><strong>Du wirst es garantiert nicht bereuen, </strong><strong class=\"redactor-inline-converted\">denn d</strong><strong class=\"redactor-inline-converted\">u hast eine <em>30-Tage-Geld-zurück-Garantie</em> - ohne Angabe von Gründen, einfach so. Du gehst also überhaupt kein Risiko ein!</strong></p>\n\n<p>Zögere also nicht mehr und greif zu. </p><p>Ich freue mich auf dich!</p><p>- Gian</p><p><br></p>", 
    "end_date": null, 
    "title": "Keynote 6 Schritt für Schritt, einfach und schnell lernen", 
    "price": "25.00", 
    "instructors": "Gian Camichel", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806096_dc5a_3.jpg", 
    "course_url": "https://www.udemy.com/keynote-einfach-und-schnell-lernen-kurs-deutsch/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T12:50:42Z"
}