{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tLearn how you can use the Keynote App to <strong style=\"\">craft a presentation that stands out from the crowd</strong>.  </p>  <p style=\"\">  \t   If you have an idea you want to communicate, whether it&#039;s selling to a client, pitching to an investor or launching a new product, <em style=\"\">this course will help you to win over your audience with Keynote. </em>  </p>  <p style=\"\">  \t   Together we&#039;ll master three key areas.  </p>  <p style=\"\">  \t <strong style=\"\">1. Understand What Makes a Good Keynote</strong> - we&#039;ll take a look at how masters like Steve Jobs prepare well designed presentations with solid content.  </p>  <p style=\"\">  \t <strong style=\"\">2. Research and Storyboard</strong> - this is all about understanding where to find the right information for your presentation and how to bring it to life through a great story.  </p>  <p style=\"\">  \t <strong style=\"\">3. Master the Keynote App</strong> - you can&#039;t create a good Keynote without mastering the Keynote app. In this section we&#039;ll master the basics and then take a look at some power user hints and tips.  </p>  <p style=\"\">  \t   By the end of this course you&#039;ll be an expert user of the Keynote app and have theskills required to <em style=\"\">conquer your next presentation and impress an audience of any size. </em>  </p>  <p style=\"\">  \t <strong style=\"\">FAQ&#039;s</strong>  </p>  <p style=\"\">  \t <em style=\"\">Can I complete this course using PowerPoint?</em>  </p>  <p style=\"\">  \t   The course is built around preparing presentations using Keynote and many of the lectures contain specific Keynote walkthroughs. What I&#039;m demonstrating can be created in PowerPoint (or any other presentation app) but the focus of this course is all about Keynote.  </p>  <p style=\"\">  \t <em style=\"\">Is this really all it takes to create a Killer Keynote?</em>  </p>  <p style=\"\">  \t   These are the first steps that you can start actioning immediately to make noticeable improvement in the quality of your Keynotes. I&#039;m constantly updating the course and am currently working on updated content for the latest version, Keynote 6.0 (of course if you&#039;re already signed up you&#039;ll have instant, free access to all of these updates).  </p>", 
    "end_date": null, 
    "title": "Keynote: Create a Killer Presentation!", 
    "price": "30.00", 
    "instructors": "Brad Hircock", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33883_9f35_5.jpg", 
    "course_url": "https://www.udemy.com/create-a-killer-keynote-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-30T08:05:38Z"
}