{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Learn Keynote FAST</strong></p><p><em><strong>Do you want to learn how to make great presentations using Keynote but dread the thought of going through a 4 hour course that goes over every button and menu item in excruciating detail?</strong></em></p><p><em><strong>***Keynote Version 6.5.3 is used throughout this course***</strong></em></p><p>If so, this course is for you.</p><p>In this course you'll learn all of the basics required to make great Keynote slides, including:</p><ul><li>slide creation</li><li>theme selection</li><li>formatting text and images</li><li>transitions and animations</li><li>adding video and audio</li><li>recording slideshows</li><li>tables and charts</li><li>exporting presentations in multiple formats</li></ul><p>I've spent 10 years as a professional trainer and I know the teaching methods that work. The course has no fluff and no padding. It's a quick, no-nonsense approach to learning the Keynote functions you really need to make great presentations.</p><p>You'll learn one simple concept at a time in bite-sized chunks. That's the quickest way to learn software programs.</p><p>Here's a comment from one of the students in my other Udemy courses:</p><p><em>Really great way to get started. </em><em>I really love the short and sweet sections of this course. The author has a really great voice to listen to, that combined with the short to the point lectures really made it a breeze for me to finish it really fast.</em></p><p>I'll also stay with you every step of the way by responding very quickly to questions asked the discussion section of the course.</p><p>Go ahead and take Learn Keynote FAST!</p>", 
    "end_date": null, 
    "title": "Learn Keynote Fast", 
    "price": "20.00", 
    "instructors": "Laurence Kim", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573662_34e3_3.jpg", 
    "course_url": "https://www.udemy.com/learn-keynote-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T16:23:56Z"
}