{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t <strong style=\"\">MASTERING YOU MAC HAS NEVER BEEN EASIER</strong> <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">MAC CLARITY - KNOW YOUR MAC<br style=\"\">  \t</strong>  </p>  <p>  \t            Learn how to play your Mac like the beautiful instrument that it is. Stop wasting time, feeling stressed and bugging your children or partner to help you when you get stuck. Know what you are doing every time you sit at your computer.  Turn your projects into opportunities to really shine and express yourself without wasting hours on trying to work stuff out.  </p>  <p>  \t            This is more than just another computer course. This is a way to reach your dreams. This is an exploration into your limitless potential.  </p>  <p>  \t            This course makes learning how to use your Mac easy and fun. You will be guided through 9 levels of learning, starting at the very basics so you will never feel left behind.  The 110+ micro video lessons are 2-8 minutes long and in easily digestible and practical chunks.  You slowly build on your knowledge and will be amazed how quickly you achieve real progress.  </p>  <p>  \t            This course is also suitable for more confident users as so many of us really only use a small percentage of what is possible on our computers.  Imagine knowing the other 70% of what your computer is capable of! <strong style=\"\">You can become more productive and find new and exciting ways of working and playing to your fullest potential.</strong>  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">A UNIQUE AND POWERFUL LEARNING SYSTEM.<br style=\"\">  \t</strong>  </p>  <p>  \t            There is currently no other course on the market that is this comprehensive that will hold your hand as you start and really support you as you grow in competence. Each lesson has lots of directions and tips. They show the keys being used written on the screen so you never have to guess anything. We will never assume you know what we are talking about. We make sure we show you clearly. Arron has been teaching this course for years in person so he knows what people want to know, what the common issues and questions are and how to explain everything in ways that it just makes sense.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">EASY AND ENGAGING LESSONS THAT YOU WILL ENJOY.</strong>  </p>  <p>  \t            Arron is a natural teacher with a strong ability to engage and make learning about your computer fun and easy.  Be inspired throughout this practical course as you build a productive and joyful relationship with your computer. Imagine what your future looks like with this powerful gift to yourself. Are you ready to really give yourself freedom to fully express yourself with this powerful tool you have?  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">TAKE BACK CONTROL OF YOUR TIME AND ENERGY.</strong>  </p>  <p>  \t            Take this opportunity to close the gap in your knowledge. This will serve you powerfully for years to come. Learn at home at your own pace and fit the course around your lifestyle.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">CREATED FOR BEGINNERS, USED BY EXPERTS.<br style=\"\">  \t </strong>  </p>  <p>  \t            This course was designed with beginners in mind. The lessons are planned sequentially, meaning that you will watch your skill level quickly improve. Of course you can just jump around to specific lessons – which is useful later on to revise something. There is so much packed in here that even experts learn a lot about how they can improve their practice.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">FEATURES AND HIGHLIGHTS.</strong>  </p>  <ul style=\"\">  \t<li>100+ micro lessons (2-8mins) </li>  \t<li>9 sequential levels covering specific topics. </li>  \t<li>Life Coaching Tools to keep you on track and motivated. </li>  \t<li>Set up a Mac the way you want it </li>  \t<li>Have all your devices synchronised eg. IPhone, IPad and computer </li>  \t<li>Explore the incredible potential of iTunes </li>  \t<li>Learn simple ways to manage your filing and create order and ease</li>  \t<li>Lot’s of extra apps to improve your productivity and user experience </li>  \t<li>30 day money back guarantee</li>  </ul>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">ADDED BONUS</strong> <br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">1st Bonus</strong>  </p>  <p>  \t            As a special added gift Arron has developed a powerful eBook devided into 12 powerful worksheets. Some of these are interactive and life coach you through your relationship, goals, motivation and intentions of how you use your computer. Would you like some more clarity of what might be getting in your way of being as productive and passionate as possible with your projects?  As a successful life coach Arron has worked with this extensively.  He understands how to move people through from being stuck to being successful. This is a holistic course. We don&#039;t want to offer you just the ability to use your Mac like a Pro. We also want you to feel good while doing it. To be passionately productive, to sit down at your computer and have confidence you won&#039;t get distracted by Facebook because you choose it, to feel powerful and capable every time you are using your Mac so you always reach your highest potential.  </p>  <p>  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">2nd Bonus</strong>  </p>  <p>  \t      Seven video tutorials exploring these more holistic aspects of your relationship and use of your computer. Some fun, playful and informative information with a &#039;special&#039; guest talking about desk yoga, healthy technology boundaries, feelings about technology, structure and flow and loads more.  </p>  <p>  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">OUR VISION FOR YOU</strong>  </p>  <p>  \t            Learn how to play your Mac like the finely tuned instrument that it is. As a pianist, Arron understands the possibilities of muscle memory using shortcuts and practice to encourage flow and creativity. Dissolve the stumbling, clunky barrier of uncertainty and instead gracefully and easily achieve your intentions.  </p>  <p>  \t            Explore and move toward conscious use of your technology. Don’t fall down the Google Hole and get distracted and frustrated with yourself. Knowing your technology will help you stay on task.  </p>  <p>  \t            Imagine sitting down to your computer with peace and clarity, and still feeling this as you finish your task. Aah, this is what we want for you and your life.  </p>  <p>  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">AN AFFORDABLE PRICE WITH VALUE FOR MONEY<br style=\"\">  \t</strong>  </p>  <p>  \t            This course would usually cost you a lot more than our full price. We want this course to be affordable because our vision is bigger than just teaching people how to use their computer. We want to empower people to build a healthy and productive relationship with their technology. We see this as a crucial skill in this new age where we are often forced to use technology just to function.  Imagine how much time and energy knowing how to really use your Computer will save you over your lifetime, most likely hundreds or thousands of hours. Not to mention the blood sweat and tears.  What a powerful investment with a massive return potential!  </p>", 
    "end_date": null, 
    "title": "Mac Clarity - Master Your Mac", 
    "price": "30.00", 
    "instructors": "Arron Artikai", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/225904_138b_5.jpg", 
    "course_url": "https://www.udemy.com/mac-clarity/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T05:56:43Z"
}