{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Mac Keynote is a complete course with 50 lessons including short practical examples of how to build interesting and compelling slides. It includes more than three hours of video tutorials and example files.</p>\n\n<p>This course starts with a simple Keynote example. You will build a short presentation using a basic built-in theme. Then you will see how easy it is to present that presentation.</p>\n\n\n\n\n\n<p>From there, you will move on to learn how to build more complex slides using elements like text, images, shapes, lines, audio and video. You’ll see how to use arrangement and alignment tools to make your own slides look great.</p>\n\n\n\n\n\n<p>You will also learn about transitions and animation. You’ll see how to add transitions between slides, and to build a slide one element at a time. The course also covers animation using Magic Move and other techniques.</p>\n\n\n\n\n\n<p>You will then learn more advanced uses for presentations such as creating videos and making stand-alone interactive kiosks. Other advanced techniques covered include altering and making your own themes, printing, and collaborating with others.</p>\n\n\n\n\n\n<p>Whether you need to use Keynote for work, school, or to create Internet content, this course can get you up to speed fast. It does not assume that you have prior experience with other presentation software. However, if you have used something like PowerPoint in the past, you can also use this course to quickly learn the ins-and-outs of Keynote.</p>", 
    "end_date": null, 
    "title": "Mac Keynote: Creating Presentations On Your Mac", 
    "price": "50.00", 
    "instructors": "Gary Rosenzweig", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/819920_ba8a_2.jpg", 
    "course_url": "https://www.udemy.com/learning-mac-keynote/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-12T15:51:12Z"
}