{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\"><em style=\"\">“Workaholics aren’t heroes. They don’t save the day, they just use it up. The real hero is home because they figured out a faster way.”</em></span>  </p>  <p style=\"\">  \t― <strong style=\"\">Jason Fried,</strong> CEO of <strong style=\"\">37Signals</strong>, Author of International Bestseller <strong style=\"\">Rework</strong>  </p>  <p style=\"\">  \t<span style=\"\"></span>  </p>  <p style=\"\">  \t<strong style=\"\">NEW: Course Updated for OS X Mavericks. Read below for details…</strong>  </p>  <p style=\"\">  \tDouble Your Productivity <span style=\"\">With These Instant Mac Shortcuts &amp; Techniques</span>  </p>  <p style=\"\">  \tIf you can type a few keystrokes, then you’ve got everything <span style=\"\">you need to accelerate your productivity, breeze through </span><span style=\"\">complicated projects, and finish work before lunch.</span>  </p>  <p style=\"\">  \t<strong style=\"\">If you are like me, then you bought your Mac because you know it&#039;s a  powerful tool</strong><span style=\"\">… just like a ninja&#039;s blade. We  must wield this blade responsibly, with integrity, with respect,  and with understanding.</span>  </p>  <p style=\"\">  \t<strong style=\"\">If you work on your Mac for 6+ hours  a day</strong>, then it&#039;s your closest companion.  You need to understand it. You are the ninja, and your Mac is your sword. The  Mac Dojo teaches you how to <strong style=\"\">properly wield your ninja blade.</strong>  </p>  <p style=\"\">  \t~~~~~ Genuine Testimonial ~~~~~  </p>  <p style=\"\">  \t<em style=\"\">“Massive productivity boost! After going through the Mac Dojo and practicing all the shortcuts my guess would be that I save at least an hour a day. I’m way more productive. I’d highly recommend getting this course.”</em>  </p>  <p style=\"\">  \t― Daniel G.<br style=\"\">  \tEntrepreneur<em style=\"\"> and Email Marketing &amp; Deliverability Specialist at Mindvalley</em>  </p>  <p style=\"\">  \t<em style=\"\">~~~~~~~~~~~~~~~~~~~~~~~~~~~</em>  </p>  <p style=\"\">  \tHave you ever  found yourself doing tedious work copy and pasting, moving files  around, or boring data entry stuff? Everyone comes across these tasks daily.  Sometimes this repetitive grunt-work can take up 2 to 3 hours of your precious  time. Most people who are ignorant to certain OSX features, Mac OSX Shortcuts,  keystrokes, and helper programs will fall prey to these tasks and waste a lot  of time. There is no escaping these tasks, but you can work smarter. <strong style=\"\">Your  Mac can slice that time in half, if you know the proper techniques.</strong>  </p>  <p style=\"\">  \tYour computer is the most  sophisticated instrument you have ever used. If you never use Mac OSX Shortcuts, hot corners, command tab, or  spotlight to navigate and work, then you need Mac Dojo. You deserve to work  faster, because the potential within your Mac is already at your fingertips.  Let me train you into a Certified Mac Ninja.  </p>  <p style=\"\">  \t<strong style=\"\">Here&#039;s a brief overview of the Mac  Dojo Productivity course:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Benefits:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Save time</li>  \t<li style=\"\">Save money</li>  \t<li style=\"\">Become more attractive (not-guaranteed)</li>  \t<li style=\"\">Justify spending an outrageous amount of extra money       for your Apple computer</li>  </ul>  <p style=\"\">  \tHow I set the course up and how to  consume it:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Watch over my shoulder</strong> and see every keystroke so you don&#039;t miss a beat.</li>  \t<li style=\"\">Take the ninja action steps after every lesson to <strong style=\"\">integrate your new skills.</strong></li>  \t<li style=\"\">I only offer the exact techniques and shortcuts that I <strong style=\"\">use on a daily basis</strong> myself from personal experience being a lifestyle entrepreneur making a living on the internet<strong style=\"\">.</strong></li>  </ul>  <p style=\"\">  \tWhat&#039;s inside:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Desktop Centric Philosophy</span></li>  \t<li style=\"\"><span style=\"\">Navigate Way Faster Through Windows &amp; Apps</span></li>  \t<li style=\"\"><span style=\"\">Copy &amp; Paste Faster Than A Wisp Of Smoke</span></li>  \t<li style=\"\"><span style=\"\">Ninja Chrome Tactics &amp; Extensions</span></li>  \t<li style=\"\"><span style=\"\">Ninjutsu Keyboard Shortcuts</span></li>  \t<li style=\"\"><span style=\"\">System Settings For Agility</span></li>  \t<li style=\"\"><span style=\"\">Stealth Finder Techniques &amp; Navigation</span></li>  \t<li style=\"\"><span style=\"\">Tags, Tabs, &amp; Mavericks Tricks</span></li>  \t<li style=\"\"><span style=\"\">Apps For Ninja Quick Workflow</span></li>  \t<li style=\"\"><span style=\"\">And Much Much More!</span></li>  </ul>  <p style=\"\">  \tIf you save an average of 15 minutes  a day, (out of an 8 hour working day) with these tips and you get paid, let’s  say $30 an hour for your work, then <strong style=\"\">THIS COURSE WILL PAY FOR ITSELF IN JUST  7 DAYS!</strong>  </p>  <p style=\"\">  \tThere&#039;s a money-back guarantee so there is absolutely no risk. If  you aren’t absolutely satisfied, just notify Udemy within 30 days for a prompt  and courteous refund.  </p>  <p style=\"\">  \tIf you bought your Mac  just to be cool, that&#039;s fine, you wasted your money. On the other  hand, if you bought your Mac because you know it&#039;s a powerhouse of potential  productivity and you want to learn how to unleash that potential,  then enter the Mac Dojo.  </p>  <p style=\"\">  \t<strong style=\"\">Master the productivity hacks in  these 32 Full HD videos and you will begin to see results. You will notice how fun it  is to zoom around your computer, getting things accomplished more quickly, and  saving time you can spend doing more meaningful things, like playing catch with  your kid (or video games, it&#039;s up to you).</strong>  </p>  <p style=\"\">  \tTake this course today and learn Mac to start working smarter. Thanks for  investing in yourself! See you in the course.<br style=\"\">  \t<span style=\"\">– </span><span style=\"\">Tharyn Taylor<br style=\"\">  \tMac Dojo Sensei and Productivity Advocate</span>  </p>", 
    "end_date": null, 
    "title": "Mac Dojo - Professional Mavericks OS X Productivity Training", 
    "price": "20.00", 
    "instructors": "Tharyn Taylor", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32638_3fc6_7.jpg", 
    "course_url": "https://www.udemy.com/mac-dojo-apple-productivity-tips-keyboard-shortcuts/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-14T11:33:40Z"
}