{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Mac or Windows? Why not both? Do you already know how to use a Windows computer but need or want to learn how to use a Mac? If so, then this course is for you.</p>\n\n<p>In this class, you’ll learn how to apply what you already know about Windows to the Mac, making it much easier and faster to learn. The goal of this course is to give you an overview of how the Mac operates, how to change important settings, and how to manage your files. In doing that, we will go over the dock, the menu bar, window behavior, the mouse and the trackpad, keyboard shortcuts, managing applications, creating and removing shortcuts, understanding file management, finding your way around, making selections, using an external hard drive, changing preferences, and file sharing.</p>\n\n<p>At the end of the course, you will know enough to be dangerous, and you’ll be ready to start learning all about the different applications that came with your Mac. You’ll start to see how by just learning a few basics, that you become a Master of your Mac!</p>\n\n\n\n<p>This course is designed for those who were comfortable using Windows and are now switching over to the Mac. It’s also for those who are considering making a switch but haven’t taken the plunge yet. It’s helpful if you already have a Mac, but if you don’t, you could certainly just watch the course and decide if this is something that you want to dive into.</p>", 
    "end_date": null, 
    "title": "Mac for Windows Brains", 
    "price": "35.00", 
    "instructors": "Shana Russell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/769170_88ca.jpg", 
    "course_url": "https://www.udemy.com/mac-os-x-fundamentals-for-windows-brains/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-21T01:06:37Z"
}