{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"> In this class you will learn how to use the Keynote software on your Apple desktop or laptop computer to create compelling, creative, visually rich presentations. <br style=\"\"><br style=\"\"> Your Keynotes will enrich and enhance your speeches, lectures, and even short talks - but can also 'stand on their own' as self-contained presentations, complete with your narration and even music and video. <br style=\"\"><br style=\"\">The course is structured so you can learn step by step as we work our way through the menus towards a completed presentation.  But for those who are on deadline, jump right into the Keynote Quick Guides to learn key functions in less than 3-minutes!<br style=\"\"><br style=\"\">You will learn while viewing the short video lessons as Chet points out not only software functions but also tips to make your presentation smoothly and creatively.  There are several PDF documents you can download and print out for reference as you construct your own awesome Keynotes.</p><p style=\"\">From learners in Chet's other Udemy classes:<br style=\"\"></p><p style=\"\">\"<em style=\"\">His teaching is focused, clear ,straightforward and concise with the   visual and audio accompaniment. He is an excellent teacher who also is a   computer expert. That is a winning combination. Most techs lose me   because they know the material yet they cannot get it across in everyday   language</em>.\" Pat K.<br style=\"\"></p><p style=\"\">\"<em style=\"\">The lectures are quite detailed and Chet Davis has a very comfortable teaching style that makes learning entertaining.</em>\"  Lisa A.<br style=\"\"></p><p style=\"\"><br style=\"\">NOTE: While you can display or share your completed Keynote presentations on Windows computers, you can only create Keynote using an Apple computer.  This course requires an installed copy of the Apple Keynote software (part of iLife 09 or available by itself in the App store).  <br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Mastering Keynote Presentations", 
    "price": "25.00", 
    "instructors": "Chet Davis", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46209_10d8_5.jpg", 
    "course_url": "https://www.udemy.com/mastering-keynote-presentations/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-17T20:19:52Z"
}