{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>\r\n\t Did you know that as an iPhone user, you&#039;re likely spending over $1,000 a year in carrier fees, apps, and accessories? What&#039;s worse is that most people are barely scratching the surface in terms of using their iPhone&#039;s capabilities. I don&#039;t know about you, but if I&#039;m spending $1,000 a year on something, I would want to get my money&#039;s worth.\r\n</p>\r\n<p>\r\n\t           That&#039;s where this course comes in. I&#039;ve designed this video series to help you master your iPhone and dramatically increase your productivity.\r\n</p>\r\n<ul>\r\n\t<li>Imagine being able to cut down the time it takes to do 90% of your most common tasks. </li>\r\n\t<li>Imagine knowing tricks that the vast majority of iPhone users don&#039;t know. </li>\r\n\t<li>Imagine becoming a real-life iPhone ninja.</li>\r\n</ul>\r\n<p>\r\n\t           I&#039;ve created over 2 hours of step-by-step video content to take you to that level.\r\n</p>\r\n<p>\r\n\t                 The course is broken up into 8 sections covering basic tips, built-in apps, Siri tricks, productivity apps, apps for freelancers and salespeople, and accessories for maximizing productivity.\r\n</p>\r\n<p>\r\n\t <strong>How did I come up with the price of $47? </strong>\r\n</p>\r\n<p>\r\n\t       After the course launched, I got a couple of emails asking me to justify the price. For courses I create, I like to give at least 10 times the value of what you paid. So the math goes like this: if this course saves you 1 hour of time a week (conservative estimate), that equals 52 hours a year you&#039;ve gained. If you make at least $20 an hour, that additional free time is worth at least (52 hours X $20) $1,040. $1040 divided by 10= $104. I just made it $47 to keep it under $50 and give you 20x the value :-)\r\n</p>\r\n<p>\r\n\t <strong>    And who am I?</strong>\r\n</p>\r\n<p>\r\n\t       I&#039;m the Editor in Chief of iPhone Life magazine, one of the largest print publications in the world dedicated solely to iPhone and iPad users. You can find iPhone Life magazine in Barnes &amp; Noble, Walmart, Hudson News locations at major airports, and many other newsstands in over 60 countries.\r\n</p>\r\n<p>\r\n\t             ***As a bonus, every member of the course will get a free issue of iPhone Life magazine*** Just follow the instructions in the last lecture of the course to redeem it.\r\n</p>\r\n<p>\r\n\t           To get started with your iPhone ninja training, tap on the &quot;Take This Course&quot; link.\r\n</p>", 
    "end_date": null, 
    "title": "Master Your iPhone and Be 10X More Productive", 
    "price": "40.00", 
    "instructors": "Alex Cequea", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164978_d854_3.jpg", 
    "course_url": "https://www.udemy.com/master-your-iphone-and-be-10x-more-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-16T01:15:27Z"
}