{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn how to use Microsoft Excel for the Mac to create, format, review, and share spreadsheets.. Understand the user interface of Microsoft Excel for the Mac to efficiently navigate and utilize all the features of the application.</p>\n\n<p><strong>Understand the Features and Functions of Microsoft Excel for Mac to Make the Most of Your Spreadsheet Creation Experience</strong>.</p>\n\n\n\n\n\n<ul><li>Learn the Microsoft Excel for Mac Interface</li><li>Understand How to Get Around Microsoft Excel for Mac</li><li>Create Workbooks and Worksheets</li><li>Create Workbook Templates</li><li>Formatting Page Layout, Themes, and View Options</li><li>Adding Headers and Footers</li><li>Splitting and Freezing Panes</li><li>Working with Cells</li><li>Adding Text or Formulas to Cells</li><li>Selecting, Styling, and Formatting Cells</li><li>Adding Borders and Fills to Cells</li><li>Adding Conditional Formatting to Cells</li><li>Merging, Moving, Inserting and Deleting Cells</li><li>Moving and Resizing Rows and Columns</li><li>Adding and Hiding Rows and Columns</li><li>Sorting and Filtering Columns</li><li>Grouping Rows and Columns</li><li>Work with Tables, Text Boxes, Shapes, Pictures, Smart Art, and Charts</li><li>Creating Data Connections</li><li>Converting Text to Columns</li><li>Highlighting and Removing Duplicates</li><li>Validating and Consolidating Data</li><li>Utilize Review Features for Accuracy and Collaboration</li><li>Printing, Sharing, and Exporting Workbooks</li><li>Learn Time-Saving Shortcuts and Preference Settings</li></ul>\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Content and Overview</strong>\nNoteboom Productions designed this course for beginners who are new to the Mac or an existing Mac user who may not be familiar with Microsoft Excel for Mac. Knowing how to use a spreadsheet application effectively will result in increased productivity.  We'll guide you through 41 videos in just over 3 hours, teaching you the basics of creating spreadsheets using Microsoft Excel for Mac. We demonstrate how to get started by creating a spreadsheet, change formatting and styles, how to work with cells and rows, how to create formulas, insert objects, use review features and add security to workbooks. You are encouraged to have Microsoft Excel for Mac installed on your Mac or MacBook so you can follow along and try it yourself at the end of each lecture.<br></p>\n\n\n\n\n\n<p>This course starts with the basics by introducing you to the User Interface for Microsoft Excel for Mac. From there we look at working with Workbooks and worksheets including how we can add headers a footers to a workbook, add security, and freeze panes in a worksheet. We then take a look at working with cells including selecting and formatting cells, adding and deleting cells, autofilling cells, and merging multiple cells into a single cell. From there we look at how we work with rows and columns including inserting and deleting rows and columns, sorting and filtering columns, and grouping rows and columns. We also look at inserting tables, charts, pictures, and SmartArt into a worksheet. From there we look at working with data including validating data, highlighting duplicates, and creating data connections. We also look at our review options including adding comments and trading changes in Excel. From here we look at our different printing and sharing options as well as looking at Excel shortcuts.</p>\n\n\n\n<p>If you need to learn Excel for the Mac – our tutorial is for you!</p>\n\n\n\n\n\n<p>Students completing this course will have the basic knowledge to comfortably create, format, review, and share Workbooks and Worksheets in Microsoft Excel for Mac.</p>", 
    "end_date": null, 
    "title": "Microsoft Excel for Mac: A Tutorial for Beginners", 
    "price": "20.00", 
    "instructors": "Noteboom Productions, Ltd.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854524_f1b0_3.jpg", 
    "course_url": "https://www.udemy.com/tutor-for-microsoft-excel-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-19T23:03:02Z"
}