{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>**UPDATED AS OF NOVEMBER 2015 - JOIN 5,500+ SUCCESSFUL STUDENTS!**</strong><strong></strong></p><p>  \t  Do you ever feel like you spend too much time trying to accomplish simple tasks on the computer? Like there are days where you spend hours and only accomplish a <em>tenth </em>of what you hoped to accomplish when you got up that morning?  </p>  <p>  \t            It's not a good feeling. But, for many of us, it's reality.  </p>  <p>  \t            Why is this? <strong>Because many of us don't have mastery of the tool we use the most - </strong><em><strong>our computers</strong>.</em>  </p>  <p>  \t            We've all heard the story of the woodcutter who sharpens his saw to cut more trees. <strong>Yet how many of us spend <em>hours</em> on the computer each day, yet never learn the tips and tricks to use them efficiently and effectively?</strong> Instead, we keep doing what we've always done, and waste time that we could spend relaxing, making more money, or hanging out with friends and family.  </p>  <p>  \t            This course will change that. Over the past year, I've learned the tools and shortcuts to 10x my productivity on my Mac. Together, these productivity hacks have allowed me to write faster, blaze through email, use Microsoft Office at 5x the speed and <em>get </em><em>more done.</em>  </p>  <p>  \t            A recent study estimated that slow computer usage cost the average employee <strong>8 WHOLE DAYS</strong> of work per year, simply because they don't know how to efficiently use a computer. If Even if you've grown on up on computers, I guarantee this course will teach you how to use your Mac like a pro.  </p>  <p>  \t            And... the good news is <strong>you don't have to be a natural with computers to reap the benefits!</strong> I've helped my 50 year old mother (bless her) do her work faster so she can get off the computer she hates and spend time with her family.  </p>  <p>  \t            By the end of this course, you’ll learn the deepest, darkest Macbook productivity secrets that only a few of the wizards at Apple know:  </p>  <ul>  \t<li>Shortcuts and tools to cut the time you spend in Microsoft Office by 60%</li>  \t<li>A simple hack to reclaim minutes wasted navigating between programs each day</li>  \t<li>How to manipulate text like a BOSS and never use your mouse again</li>  \t<li>7 strategies to master Gmail and process your email in seconds, not minutes</li>  \t<li>Advanced strategies and shortcuts with Finder, Quicksilver and Google Chrome</li>  \t<li>Introduction to 5 free tools that will save you hours over the course of your workday</li>  </ul>  <p>  \t            If you want to reclaim your valuable time be <strong>more productive <em>for the rest of your life</em></strong>, this course is for you.  </p>  <p>  \t            I packed tons of useful information into this course, so that just 60 minutes from now you can use your Mac better than 95% of Macbook owners. Pretty sweet, eh?  </p>  <p>  \t            If that's not enough, Udemy offers a money back guarantee if for any reason you're not satisfied with any course you buy here. Plus, you'll get unlimited access to me and all further course material I'll be adding as more students join.  </p>  <p>  \t            If you use a computer for more than an hour a day, you owe it to yourself to be as efficient as possible. In fact, your ability to get more done will lead to raises, promotions, time freedom and more productivity than you can believe.  </p>  <p>  \tAnd, <strong>if for any reason you don't like the course,</strong> <strong>I'll give you a full refund, no questions asked.</strong>  </p>  <p>  \t            See you inside!  </p>  <p>  \t            Justin Mares, Macbook wizard  </p>", 
    "end_date": null, 
    "title": "Productivity for Mac Users: 10x Your Productivity", 
    "price": "20.00", 
    "instructors": "Justin Mares", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226718_ca5d_11.jpg", 
    "course_url": "https://www.udemy.com/mac-keyboard-shortcuts/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T21:43:14Z"
}