{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\">Course Description</strong></p><p>I know how it feels to become a Switcher (been using Windows all of your life and suddenly jump into the mac). You found yourself out of place, confused, and trying to use the mac like your previous machine... Stop it! Squeeze the potential of your mac and realize this is not just a pretty and kind of expensive computer, this is a machine built to REALLY make your life easier and save you a ton of time!</p><p>Hey! You have in your hands the most advanced operative system available on the market, but you got to feel comfortable using it and let go those Windows demons... let me make that happen.</p><p><strong style=\"\">Get a clean image of the mac philosophy</strong></p><p>Forget about start button, menus per window and odd system behaviors. </p><p><strong style=\"\">Learn and put the multi touch gestures into context</strong></p><p> Learn how to properly use the super powerful multi touch gestures, take the most of them with real life case scenarios! </p><p><strong style=\"\">Keyboard shortcuts + Multi touch gestures = Save a ton of time!</strong></p><p>You can memorize some keyboard shortcuts and put them to work or you can go beyond and learn to combine them taking the shortcuts concept to another level!</p><p><strong style=\"\">Minimize, maximize and resize windows... seriously? meh! </strong></p><p>Set your workspace with sense and move across your programs with ease using Mission Control, spaces and Dashboard!</p><p><strong style=\"\">Yeah, Finder is like the windows explorer of the mac... but it is much more than that!</strong></p><p>Get a basic knowledge of what Finder <strong style=\"\">really</strong> is, dig deeper and learn the difference between using your mac in a graphic way or through commands with the Terminal app.</p><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">What to expect from this course</strong><br style=\"\"></p><p>A quick, funny and rewarding journey (about 40&#039; of lectures) to completely forget about those bad days you went through using Windows and the feeling of having been using your mac a long time ago.</p>", 
    "end_date": null, 
    "title": "Stop Using Your Mac Like a Windows PC!", 
    "price": "20.00", 
    "instructors": "Miguel Rojas Cortés", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585892_90e8_2.jpg", 
    "course_url": "https://www.udemy.com/suymlawpc/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T23:51:28Z"
}