{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<em>With trembling hands and a giddy sensation in your stomach, you unpack your brand new iPad and turn it on. Help, what do I do now?</em>  </p>  <p>  \t<strong>(Updated January 2015)</strong>  </p>  <p>  \t<strong>The iPad Quick Start Guide</strong> will help you feel comfortable with your iPad so you can hit the ground running in no time at all. It covers everything a new user needs to know to get started. It will introduce you to the key features of your new iPad and take you through the early stages of its use. <strong>With the help of this course you’ll soon get to grips with your iPad and the amazing software that lurks beneath the beautiful Retina screen.</strong>  </p>  <p>  \t    The iPad is unlike any computer you’ve ever laid your hands on. You’re already an expert since you just use your fingers directly on the screen to move and affect what you see. If you know how to point, you know how to use an iPad, and that’s the truly exciting thing about this device: it makes personal computing truly personal.  </p>  <p>  \t    But despite its obvious friendliness, it’s still a remarkably complex piece of hardware and you’ll need to know a little about what makes the iPad tick:  </p>  <ol>  \t<li>How you turn it on</li>  \t<li>What functions its few buttons offer.</li>  \t<li>And what about all the other controls embedded in the software itself?</li>  \t<li>How can you use its many features to the fullest?</li>  \t<li>How do you set up many of the Apps?</li>  \t<li>Syncing media: Movies, books, photos, music</li>  \t<li>How do you get up and going again when trouble strikes?</li>  </ol>  <p>  \t    Whatever your starting point, a complete beginner or somewhat experienced, <strong>the iPad Quick Start Guide</strong> will give you the confidence and knowledge to get the most out of your iPad and be ready to move on to far greater iPad challenges. You can dive straight into the course or selectively pick and choose what you need to learn. The choice is yours!  </p>  <p>  \t<strong>This amazing video course lets you go at your own pace – so you can learn at any time. </strong>It consists of video tutorials and pointers to many documents or support materials to help you when you get stuck. As updates occur to the iPad, new videos will also be added to the course, and I am available to answer any questions you may have at any time.  </p>  <p>  \t<em>The iPad provides a more enjoyable, intuitive and personal dimension to computing, and this course <strong>will give you the power to use it as a complete mobile computing device</strong> ... to browse the web, check and send emails, share and enjoy photos, watch videos in HD, play music, read eBooks, play games and much more.</em>  </p>  <p>  \t    I can&#039;t wait to see you in my course! So what are you waiting for? Sign up now. By the end of the <strong>iPad Quick Start Guide</strong>, you will be well on your way to iPad mastery!<strong><u></u></strong>  </p>", 
    "end_date": null, 
    "title": "The iPad Quick Start Guide: First steps with a new iPad", 
    "price": "20.00", 
    "instructors": "Michele Berner", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/261386_f3a2_8.jpg", 
    "course_url": "https://www.udemy.com/the-ipad-quick-start-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-14T21:42:17Z"
}