{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t    The iPhone may be the greatest device ever invented for <strong style=\"\">managing</strong> and <strong style=\"\">optimizing </strong>your life. Since you always have it with you, why not make use of it to make yourself more productive and become just the person you want to be.  </p>  <p>  \t    When used to its full potential, the iPhone is a terrific tool for organizing your life, for setting clear goals, for monitoring your daily progress and, in the process, for becoming a much more focused and high performing individual.  </p>  <p>  \t                                                      In this course, I&#039;ll show you how to use your iPhone to work from anywhere, to better manage your life and to ultimately thrive in this new hyper-connected (and distracting) digital environment.  </p>  <p>  \t                                                  With the right knowledge and tools, a cloud-based mobile office can give you the freedom and flexibility to run a paperless office that is accessible from anywhere on your iPhone.  </p>  <p>  \t<strong style=\"\">              This course is 100% actionable</strong>. By that I mean you can download the apps on your iPhone while you&#039;re taking the course and build your own mobile office. If you&#039;re also an iPad user, nearly all of these apps will also work on your iPad.  </p>  <p>  \t                                                  This course teaches you to learn faster and work smarter using the latest cloud-based technology on your iPhone.  Here is what you will be able to accomplish after taking this course:  </p>  <p>  \t                                                                    1. Apply proven productivity principles to <strong style=\"\">block out distractions and find your focus </strong>by using your iPhone to track your progress, to manage your must-do tasks and to achieve your goals.  </p>  <p>  \t                                                                    2. Learn the best cloud-based tools for running a <strong style=\"\">paperless mobile office</strong> and syncing your work across all your devices: your PC/laptop, iPhone and iPad so you can save time and eliminate productivity-killing stress and frustration.  </p>  <p>  \t                                                                    3. Learn how to <strong style=\"\">double your reading speed</strong> (and increase your comprehension) through speed reading training. Given that the average knowledge worker spends over 50% of their time managing information, this is a huge productivity boost.  </p>  <p>  \t                                                4. Master<strong style=\"\"> Siri&#039;s voice commands and dictation capabilities</strong> so you can work more efficiently by dictating emails, blogs posts and  mental notes of your insights as they arise.  </p>  <p>  \t                                                5. Learn to focus your time and effort on the 20% of your tasks where you can add the most value. I&#039;ll show you the tools to<strong style=\"\"> automate, delegate or outsource</strong> the rest.  </p>  <p>  \t                                                                    5. <strong style=\"\">Build your personal brand</strong> online and advance your career by building a strong professional network, improving your follow up with the people you meet and maximizing the power of your iPhone as a relationship building tool.  </p>  <p>  \t                                                                    6. Use your iPhone to <strong style=\"\">monitor and</strong><strong style=\"\"> improve your health. </strong>Discover how to improve your diet, habits, sleep, exercise, and to reduce stress. As a result, you will have much more consistent energy and focus to get things done.  </p>  <p>  \t                                                                    7. <strong style=\"\">Manage your finances</strong>, business and freelance operations better through time tracking, invoicing, cash flow budgeting, expense tracking and signing legal digital contracts on your iPhone.  </p>  <p>  \t                                                            These are just some of the ways <strong style=\"\"><em style=\"\">The iPhone Office</em></strong> will increase your productivity and improve your life. Sign up for this course now at the <em style=\"\">launch price of $49</em>, which will only be available for the first week.  </p>", 
    "end_date": null, 
    "title": "The iPhone Office: Use iOS To Double Your Productivity", 
    "price": "30.00", 
    "instructors": "Kyle Pearce", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315440_f4ab.jpg", 
    "course_url": "https://www.udemy.com/the-iphone-office/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T23:24:28Z"
}