{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t      Learn the concepts and functions of a database to easily build your own database solution in FileMaker Pro 13. Effectively and efficiently manage customer relations, inventory, projects, events, and more using this easy to use database software. No programing knowledge necessary.  </p>  <p style=\"\">  \t<strong style=\"\">Learn the Fundamental Basics of FileMaker Pro 13 and Build Your Own Database in Minutes.</strong>  </p>  <ul style=\"\">  \t<li>Learn the Concept of a Database</li>  \t<li>Quickly Build a Custom Database Solution</li>  \t<li>Create and Format Layouts and Reports</li>  \t<li>Create Relational Databases</li>  \t<li>Manage Dynamic Data</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Begin Using a Powerful Data Management Tool Quickly and Effectively.</strong>  </p>  <p style=\"\">  \t      Knowing the basic concepts of a database and how to build and use one are skills that are in high demand in our technologically driven economy. FileMaker Pro is used worldwide by companies and organizations to manage everything from customer relationship management to inventory control. Many people think you need to know technical programming to be successful in database management. But, FileMaker Pro makes database design and management easy and achievable for anyone - especially those without any prior programing experience. We&#039;ll take you through what you need to get started in FileMaker Pro 13 in 48 easy-to-follow video tutorials. So let&#039;s get started!  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Content and Summary</strong>  </p>  <p style=\"\">  \t      Noteboom Productions has designed this course for beginners and those having no prior database experience. Our instructor, Dan, will guide you through 48 videos in just over 3 hours, teaching you the basics of databases and FileMaker Pro 13. In addition to lecturing, Dan gives step by step demonstrations of each concept and topic covered. You are encouraged to have your own FileMaker Pro 13 application open so you can follow along and try implementing the steps yourself at the end of each lecture.  </p>  <p style=\"\">  \t      This course starts with the basics, giving an explanation of what a database is and why you would want to use one. You&#039;ll also learn the basics of FileMaker Pro terminology, including the different modes you&#039;ll use while building and using your database. Once these basics are covered you&#039;ll dive in to building your own database by creating your first tables and layouts.  </p>  <p style=\"\">  \t      Once you have your table(s) built, you&#039;ll learn how your data is stored in your database through individual records. Then we&#039;ll cover how to format your different layouts and create a unique look for your database. As we explore designing our new database, we&#039;ll demonstrate FileMaker Pro&#039;s very powerful tool called the &quot;Inspector.&quot; This tool assists you in formatting everything in your database from where items are positioned to how data is entered into fields, making it easy to design a user-friendly and intuitive database.  </p>  <p style=\"\">  \t      While this course is designed for beginners learning basic database concepts and terminology, you&#039;ll also have the opportunity to learn about relational databases and entering and viewing data between tables or lists. We also cover creating buttons and scripts and how to save and share the data from your database.  </p>  <p style=\"\">  \t      Students completing this course will have the basic knowledge needed to build their own database solution in FileMaker Pro 13.  </p>", 
    "end_date": null, 
    "title": "Tutor for Filemaker Pro 13: The Basics", 
    "price": "20.00", 
    "instructors": "Noteboom Productions, Ltd.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399362_a59c_4.jpg", 
    "course_url": "https://www.udemy.com/tutor-for-filemaker-pro-13-the-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T21:23:40Z"
}