{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn how to use Microsoft Word for the Mac to create, format, review, and share documents. Understand the user interface of Microsoft Word for the Mac to efficiently navigate and utilize all the features of the application.</p><p><strong>Understand the Features and Functions of Microsoft Word for Mac to Make the Most of Your Document Creation Experience</strong>.</p>\n\n\n\n\n\n<ul><li>Learn the Microsoft Word for Mac Interface</li><li>Understand How to Get Around Microsoft Word for Mac</li><li>Create Documents and Templates</li><li>Select and Format Text and Paragraphs</li><li>Understand How to Use Styles</li><li>Work with Tables, Text Boxes, Shapes, Pictures, Smart Art, and Charts</li><li>Utilize Review Features for Accuracy and Collaboration</li><li>Learn Time-Saving Shortcuts and Preference Settings</li></ul>\n\n\n\n\n\n\n\n<p><br><strong>Content and Overview</strong><br>Noteboom Productions designed this course for beginners who are new to the Mac or an existing Mac user who may not be familiar with Microsoft Word for Mac. Knowing how to use a word processing application effectively will result in increased productivity.  We'll guide you through 32 videos in just over 2 hours, teaching you the basics of word processing using Microsoft Word for Mac. We demonstrate how to get started by creating a document, changing formatting and styles, creating mail merges, inserting objects, using review features and adding security to documents. You are encouraged to have Microsoft Word for Mac installed on your Mac or MacBook so you can follow along and try it yourself at the end of each lecture.</p><p>This course starts with the basics by introducing you to the User Interface for Microsoft Word for Mac. From there we dive right in and demonstrate how to create a document - the real focus of the course. There are many options to use when creating documents such as View, Layout, and Design - we walk through each one of these options. Additional options to consider when working with documents include inserting a headers and footers, setting document properties, creating mail merges, and reducing document file size to make sharing easier. Next we cover how to work with and format text and paragraphs, including how to create a hyperlink from selected text. After creating and formatting our document we will demonstrate how to insert objects such as text boxes, tables, pictures, shapes and charts. Reviewing you document is important for accuracy. We cover the Review features such as spelling and grammar check. We also cover the collaboration review features such as adding comments, tracking and reviewing changes, comparing and combining documents, and adding security. We wrap up this course with a demonstration of helpful shortcuts and review important Word Preferences.</p><p>Students completing this course will have the basic knowledge to comfortably create, format, review, and share documents in Microsoft Word for Mac.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Tutor for Microsoft Word for Mac", 
    "price": "20.00", 
    "instructors": "Noteboom Productions, Ltd.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/813796_8df3_4.jpg", 
    "course_url": "https://www.udemy.com/tutor-for-microsoft-word-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-05T18:41:32Z"
}