{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn how to use Apple's OS X El Capitan to navigate your Mac. Customize your experience by setting system preferences to reflect your workflow and personal preferences. Manage files and documents effectively by understanding the file hierarchy on your Mac. Learn to back-up your Mac so data is not lost.</p>\n\n<p><strong>Understand the Features and Functions of OS X El Capitan to Make the Most of Your Mac or MacBook Experience</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Learn Basic OS X Structure and Terminology</li><li>Understand How to Get Around Your Mac in OS X El Capitan</li><li>Set System Preferences to Work for You</li><li>Install and Work with Applications</li><li>Create and Organize Documents and Files</li><li>Learn to Back-up Your Mac</li><li>Understand the newest features to OS X El Capitan.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Use the Latest Features of OS X El Capitan to Enhance Your User Experience.</strong><br>Operating systems are always changing. Knowing all of the latest features and functions will help you avoid frustration when things don't quite work the same and will keep you working effectively and efficiently. We'll take you through what you need to know in OS X El Capitan in 66 easy-to-follow video tutorials. You can go at your own pace and review individual lessons as may times as needed. So let's get started!<strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Content and Overview</strong><br>Noteboom Productions designed this course for beginners who are new to the Mac or existing Mac users upgrading from OS X Yosemite. Learning a new operating system can seem like a daunting task. We'll guide you through 66 videos in just over 5 hours, teaching you the basics of a Mac and its latest operating system, OS X El Capitan. In addition to lecturing, we demonstrate how to get around your Mac quickly, set system preferences, create and organize documents, install and delete applications, and tips on backing-up your Mac. You are encouraged to have OS X El Capitan installed on your Mac so you can follow along and try it yourself at the end of each lecture.</p>\n\n\n\n<p>This course starts with the basics including OS X terminology and migrating from Windows. Once we've established the terminology we move on to getting around OS X El Capitan with the Finder, using the Dock, and using the Menu Bar. Then we go through some extensive lessons on setting up OS X default behaviors through System Preferences. When we have our Mac all set up the way we want it and we're comfortable with getting around, we move on to installing and uninstalling Apps and creating and working with documents. We also spend a little time going over the new features of El Capitan.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Students completing this course will have the basic knowledge to comfortably navigate their Mac using OS X El Capitan.</p>", 
    "end_date": null, 
    "title": "Tutor for Mac OS X El Capitan", 
    "price": "20.00", 
    "instructors": "Noteboom Productions, Ltd.", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801220_b4db_3.jpg", 
    "course_url": "https://www.udemy.com/tutor-for-mac-osx-el-capitan/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T20:03:22Z"
}