{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn how to use Final Cut Pro X with our Tutor for Final Cut Pro. This tutorial includes 51 easy-to-follow video lessons on Apple’s professional video editing app Final Cut Pro X. We start out by looking at the interface, importing and analyzing clips, and organizing clips and events. From there we look at creating projects including changing project settings, adding clips, and adding audio. We then take a closer look at working with clips including adding effects to a clip, adding titles, detaching audio from a clip, and making clip adjustments. We then go to more advanced editing options including adding the Ken Burns effect, retiming our clips, adding speed ramps, adding a blue or green screen effect, and matching color between clips. We wrap it up by looking at various ways to share your finished project and find help including finding a list of keyboard shortcuts. Learn how to use Final Cut Pro X with Tutor for Final Cut Pro.</p>\n\n<p><strong>Understand the Features and Functions of Final Cut Pro v10.2 to create movies from video and photos you've taken. Make the most of your Final Cut Pro v10.2 experience by learning how to: </strong></p>\n\n<ul><li>understand the terminology and user interface of FCP v10.2</li><li>import, organize, and analyze clips.</li><li>work with and organize libraries and events.</li><li>create smart collections of clips.</li><li>rate clips.</li><li>use the playhead and skimmer.</li><li>viewer options.</li><li>work with projects.</li><li>use the timeline.</li><li>add, remove, and arrange clips.</li><li>replace and trim clips.</li><li>work with audio.</li><li>edit with multicam clips.</li><li>add transitions.</li><li>work with precision editing.</li><li>add markers, ToDo's, and chapters.</li><li>add titles, backgrounds, and audio to clips.</li><li>adjust, match, and correct color in clips.</li><li>add Ken Burns effect.</li><li>stabilize clips.</li><li>add instant replay and rewind effects.</li><li>masking clips.</li><li>adding keyframes.</li></ul>\n\n<ul><li>share and export projects.</li><li>troubleshoot and find help.</li><li>complete an amazing Final Cut Pro project project and share it!</li></ul>\n\n<p><br></p>\n\n<p><strong>Content and Overview</strong><br></p>\n\n\n\n<p>Noteboom Productions designed this course for students who are new to the Mac or an existing Mac user who may not be familiar with Final Cut Pro v10.2. Knowing how to use Final Cut Pro effectively will result in increased productivity and give you the ability to make amazing movies to share your own videos and photos.  We'll guide you through 51 videos in just over 2 hours, teaching you the basics of Final Cut Pro. We demonstrate how to get started by creating a new project, reviewing Final Cut terminology, importing media (video &amp; photos) into a timeline, working with various editing tools, and adding effects. You are encouraged to have Final Cut Pro v10.2 installed on your Mac or MacBook so you can follow along and try it yourself at the end of each lecture.</p>\n\n\n\n<p>This course starts with the basics by introducing you to the User Interface for Final Cut Pro v10.2. From there we dive right in and demonstrate how to create a movie project using the advanced editing options and features of Final Cut Pro v10.2. By the end of this course students will have the basic knowledge of Final Cut Pro v10.2 to create and share a movie created with their own video and photos.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Tutor for Final Cut Pro v10.2", 
    "price": "20.00", 
    "instructors": "Noteboom Productions, Ltd.", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834480_1660_2.jpg", 
    "course_url": "https://www.udemy.com/tutor-for-final-cut-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-28T15:01:06Z"
}