{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn how to make great movies with iMovie version 10.1 and this tutorial. Tutor for iMovie v 10.1 includes 49 how-to video lectures. The lectures cover everything from the interface to importing your movies to using editing to using effects including green-screen to sharing and making trailers.</p>\n\n<p><strong>Understand the Features and Functions of iMovie Version 10.1 to create movies from videos and photos you've taken. Make the most of your iMovie experience by learning how to: </strong></p>\n\n\n\n\n\n\n\n<ul><li>work in a timeline</li><li>import your movies from your camera and desktop.</li><li>work with and organize events and projects.</li><li>rate clips.</li><li>understand settings.</li><li>split and merge clips.</li><li>fade, mute, or detach audio.</li><li>add transitions.</li><li>work with precision editing.</li><li>add titles, maps, backgrounds, audio, sound effects to clips.</li><li>enhance clips.</li><li>adjust, match, and correct color in clips.</li><li>add Ken Burns effect.</li><li>stabilize clips.</li><li>add narration.</li><li>add instant replay and rewind effects.</li><li>work with green/blue screen effects.</li><li>place clips side by side.</li><li>add picture in picture effects.</li><li>share and export projects.</li><li>create a movie trailer</li><li>complete an amazing iMovie project and share it!</li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong>Content and Overview</strong></p>\n\n\n\n<p>Noteboom Productions designed this course for beginners who are new to the Mac or an existing Mac user who may not be familiar with iMovie v10.1. Knowing how to use iMovie  effectively will result in increased productivity and give you the ability to make amazing movies to share your own videos and photos.  We'll guide you through 49 videos in just over 2 hours, teaching you the basics of iMovie v10.1. We demonstrate how to get started by creating a new project, reviewing iMovie terminology, importing media (video &amp; photos) into a timeline, working with various editing tools, and adding effects. You are encouraged to have iMovie installed on your Mac or MacBook so you can follow along and try it yourself at the end of each lecture.</p>\n\n\n\n\n\n<p>This course starts with the basics by introducing you to the User Interface for iMovie v10.1. From there we dive right in and demonstrate how to create a movie project - the real focus of the course. By the end of this course students will have the basic knowledge of iMovie v10.1 to create and share a movie created with their own video and photos.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Tutor for iMovie 10.1", 
    "price": "20.00", 
    "instructors": "Noteboom Productions, Ltd.", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815548_ddde_2.jpg", 
    "course_url": "https://www.udemy.com/tutor-for-imovie-10-1/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T15:14:14Z"
}