{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tThis course is intended to assist those that are currently considering moving from the Windows operating system to using Mac OS X.  This move often causes concern and confusion leaving people apprehensive about making the decision to move and worrying about potentially investing a lot of money in hardware that they are afraid they mightn&#039;t be able to use.  This course will allay those fears and demonstrate clearly what the similarities and differences are and how anyone can make a smooth transition from one operating system to the other, regardless of their skill level.  </p>  <p style=\"\">  \tThe course is delivered using screen recordings of both Mac and Windows environments, comparing the two and showing step by step how to complete tasks using Mac OS X that you would be familiar with on Windows.  </p>  <p style=\"\">  \tThe course is divided into 6 sections and will take less than 3 hours to complete.  Each section is divided into lectures, most of which average 4-6 minutes in duration.  </p>  <p style=\"\">  \tIf you are considering making the move to Mac OS X, or have already done so and you are struggling with some basic differences, this is the course for you!  By the time you have completed the course, you will be comfortable with your Mac and be glad you made the decision to move!  </p>", 
    "end_date": null, 
    "title": "Using Mac OS X for Windows Users or complete beginners", 
    "price": "50.00", 
    "instructors": "David Griffith", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/98724_8702_8.jpg", 
    "course_url": "https://www.udemy.com/making-the-switch-from-windows-to-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-28T10:58:02Z"
}