{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Welcome !</p><p>If you are reading this, chances are, you have a mac or you want to buy one.</p><p>Mac&#039;s need no introduction. They are fast, stable and of course beautifully designed!</p><p>Also, they are loaded with features.</p><p><strong>But, do you use your mac to its fullest ?</strong><br></p><p>Do you know all the cool features that come built in with mac,- features that can <strong>save you a lot of time everyday and money?</strong>(by not having to buy extra software !)</p><p>My experience shows that most people do not use their macs to its best !&nbsp;</p><p>And that is why, I put this course together !</p><p>So that you can <strong>take your mac productivity to its max.</strong></p><p><strong>Some of the cool things you will learn in this course :</strong></p><p>Create a keyboard shortcut to launch any application!</p><p>Get the &quot; not responding&quot; applications to respond without force quitting them !</p><p>Create a neat , organized workflow !<br></p><p>Record your screen along with audio, without paying for any extra software!</p><p>Talk to your mac, so that it handles the typing for you !</p><p>Locate any file on your mac, within seconds, without having to know/worry about its location !</p><p>Shut down your mac , real fast!</p><p>Trim/Merge videos without any additional software.<br></p><p>and many more tips and feature!</p><p>This course contains 50 videos, each explaining a<span>&nbsp;carefully chosen tip or a feature,which can save you time and money.</span></p><p><strong>And, I will add 2 updates to this class every month and whenever there is a new release of mac os x!</strong></p><p><strong>After completing this course, you will fully realize your mac&#039;s awesome potential and &nbsp;yes, you will love your mac even more and never want to buy anything else !</strong><br></p>  ", 
    "end_date": null, 
    "title": "Using your mac to its fullest", 
    "price": "20.00", 
    "instructors": "Harsha M", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45806_8e7b_13.jpg", 
    "course_url": "https://www.udemy.com/using-your-mac-to-its-fullest/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-14T03:16:46Z"
}