{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \tVereinfache dein digitales Leben ist ein Kurs, der Euch helfen wird, endlich Ordnung in Eure Dateien zu bringen. Aber wir gehen noch einen Schritt weiter - wir schauen uns nicht nur an, wie Ihr eine Ordnerstruktur anlegt und Eure Dokumente einsortiert, wir bringen auch Ordnung ins Bilder-, Musik- und Videochaos und sorgen dafür, dass Ihr nicht nur einen Überblick habt sondern auch Eure täglichen Aufgaben - egal, ob bei der Arbeit oder Privat - viel schneller erledigen könnt.  </p>  <p>  \tVereinfache dein digitales Leben sorgt dafür, dass du bis zu 100% produktiver bist, deine Aufgaben schneller erledigst und endlich weißt, wo welche Datei auf deinem Computer zu finden ist.  </p>  <p>  \tAußerdem haben wir uns noch die iCloud vorgenommen, um Euch zu zeigen, wie nützlich die sein kann, wenn Ihr zum Beispiel auf mehreren Computern arbeitet. Ein effektives Dateimanagement sorgt dafür, dass der Computer nur noch ein Hilfsmittel ist, strategisch günstig zu arbeiten. Mit der richtigen Struktur und den onboard Mitteln von Apple könnt Ihr dies aber auf jedem Computer tun - und so richtig viel Zeit sparen.  </p>  <p>  \tIm Wesentlichen benötigt Ihr, um diesen Kurs richtig nutzen zu können, nur Euren Mac und seine Programme. Wir haben allerdings noch einige weitere Programme wie Songgenie, Covergenie und iFlicks eingefügt, die Euch helfen, Eure Dateien besser zu organisieren. Diese müsst Ihr nicht haben, sind aber von Vorteil, wenn Ihr z.B. Eure Videos mit Titeln oder Eure Songs mit den richtigen Covern versehen wollt.  </p>  <p>  \tDer Kurs hat über 40 Lektionen und ist eher etwas, dass Ihr immer mal wieder ansehen könnt. So ist es eine gute Idee eine Lektion anzusehen, das gelernte umzusetzen und dann zur nächsten zu schreiten. Am Ende werdet Ihr von einem Computer mit einem Dateisystem profitieren, der Euch viel Freude bereiten wird und Euch Aufgaben viel schneller erledigen lässt.  </p>  <p>  \tVereinfache dein digitales Leben verhilft Euch zu mehr Produktivität im Alltag und Beruf.  </p>", 
    "end_date": null, 
    "title": "Vereinfache dein digitales Leben, endlich Ordnung auf dem PC", 
    "price": "20.00", 
    "instructors": "Monja Wessel, Markus Korsten, Online Lernen SimpleLife Stories", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360460_aaf7_2.jpg", 
    "course_url": "https://www.udemy.com/vereinfache-dein-digitales-leben/", 
    "currency": "USD", 
    "subject_name": [
        "Apple"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T12:24:40Z"
}