{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Create a beautiful life using metaphysical principles made famous by Louise Hay, Wayne Dyer, Marianne Williamson, &quot;The Secret&quot; and others..  </p>  <p>  \tThe &quot;Achieve Your Dreams&quot; course is based upon a set of soothing, gentle videos narrated by beautifully-spoken English Metaphysics expert Michelle Sollicito.  The course includes practical exercises, meditations, positive thinking/affirmations, visualizations, imagery and Neuro Linguistic Programming (NLP) techniques.  </p>  <p>  \t<span style=\"\">Learn who you are at the deepest level by getting in contact with all your &quot;selves&quot; - including your inner child and inner critic.</span>  </p>  <p>  \t    Learn from mistakes and traumas in your past and heal them.  </p>  <p>  \tBecome your own life coach.  </p>  <p>  \t    Identify your goals and how you will achieve them using visualization, imagery, meditation and NLP (Neuro Linguistic Programming) techniques.  </p>  <p>  \t    Make a plan for achieving goals and learn techniques to ensure you meet them.  </p>  <p>  \tWhen taking the course, you are advised to set aside a whole morning and do the whole course in one session, in order to reap the maximum benefit from it.  After some of the videos you will carry out some practical exercises, and you may wish to repeat some of the meditations.  </p>  <p>  \tIt is anticipated that once you have completed the course once, you may want to come back and repeat sections of the course from time to time during your life.  </p>", 
    "end_date": null, 
    "title": "Achieve Your Dreams", 
    "price": "30.00", 
    "instructors": "Michelle Sollicito", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413156_75d7_4.jpg", 
    "course_url": "https://www.udemy.com/achieve-your-dreams_now/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T13:49:50Z"
}