{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>\"Achieve Your Dream in 2016\"</em> is a concise, inspirational, and motivational course designed to help you focus on your main goal for this year and then nail it in the shortest possible time. </p><p>In a series of sixteen 'talking head' videos, Rob Parnell - author of over 30 bestselling self-help books - delivers a strategy that can change your life for the better. </p><p>If you've ever had a dream and feel that now is the time to make it a firm reality, then this course could be the magic key you need to open the door to a brighter future.  </p><p><strong>Become Master Of Your Own Destiny in Less Than Two Hours</strong></p><p>In this potentially life-changing course, you'll discover how to:</p><p>* See your goals as physical locations towards which you're traveling</p><p>* Balance your mind, body, and spirit to ensure success</p><p>* Acquire boundless motivation and enthusiasm - instantly</p><p>* Zone in on what your really want</p><p>* Quickly gain the skills you need for any goal</p><p>* Prepare for any challenge and defeat it</p><p>* Ensure you're in tip top shape for the journey ahead</p><p>* Avoid dead ends, sharks, rogues, and roadblocks</p><p>* Stay focused until your goal is nailed</p><p><strong>Finally create the life you want - and soon - by following Rob Parnell's simple, step-by-step, instructional videos. </strong></p><p>Fifteen years ago, your personal host and success coach, Rob Parnell, needed a way out of the nine to five, one that would provide a new income and better life. </p><p>He found that by carefully identifying his goal and then systematically working towards it, anything seemingly impossible could be achieved. </p><p>Since then, he has used his simple strategy - and success mindset - to create all kinds of new and exciting realities for himself. </p><p>Rob does not claim to have invented the strategy, only to simplifying goal achievement for any area, whether to do with weight-loss, business start up, to career changing, to writing a novel. </p><p>Whatever your most cherished dream, you will no doubt benefit from Rob's unique \"Easy Way\" vision.</p><p>As Rob says: <em>\"When you take total responsibility for your destiny, you can achieve anything you imagine.\"</em> </p><p>Each lesson is around five minutes and full of advice, guidance and simple strategies for instant life-change and goal attainment. </p><p>You can apply the strategies to any goal you may wish to acquire.   </p><p>Step by simple step, this course will guide you through the process of acquiring a success mindset, then help you to identify your most important goal. </p><p>Using the analogy of driving a fast car, the course will help you visualize your goal as an actual destination. </p><p>You will learn that a healthy balance between your mind, your body and your spirit is all you need to maintain the motivation, focus and perseverance to achieve any goal.</p><p>The course uses a combination of down home advice, simple exercises, and self-analysis templates to direct you on a journey to your dream, whether it's big or small. </p><p>You are encouraged to make daily lists, first to help visualize your success and then to track your progress as you move inevitably toward your pre-ordained destination.</p><p>Achievement is about preparing the ground and being equipped. the advice and guidance you receive throughout this course will help your overcome self-doubt, external challenges and internal demons in a safe environment - your own home - and at your own speed.</p><p>At the end of this course, armed with Rob Parnell's simple success strategies, you will be well-equipped to take on any goal and succeed in the shortest possible time. </p>", 
    "end_date": null, 
    "title": "Achieve Any Dream Or Goal In The Shortest Time Possible ", 
    "price": "20.00", 
    "instructors": "Rob Parnell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687592_c736_2.jpg", 
    "course_url": "https://www.udemy.com/achieve-your-dream-in-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T01:02:34Z"
}