{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Seguro que todos hemos pensado en algún momento de nuestras vidas, que significado tienen nuestro sueños. Es muy probable que hayamos intentado buscar el significado de los símbolos u objetos que hemos visto y recordamos nada mas levantarnos.</span>  </p>  <p style=\"\">  \tEn este curso, conoceremos los métodos para interpretar los sueños y conocer cual es el significado de éstos.  </p>  <p style=\"\">  \tA lo largo de 8 temas, veremos que tenemos que hacer para interpretar un sueño de una manera correcta. Enseñaremos a llevar un diario de los sueños, a aprender a recordarlos, técnicas para visualizarlos mas correctamente y a encontrar cual es el núcleo de nuestros sueños.  </p>  <p style=\"\">  \tTambién mostraremos cuales son los sueños mas comunes y que significados tienen. Seguro que todos alguna vez hemos soñados con serpientes, fantasmas o con que podemos volar.  </p>  <p style=\"\">  \tIgualmente enseñaremos algunas habilidades para encontrar el significado de los sueños en los que vemos personas. Éstos son ls mas difíciles de interpretar, pero daremos los consejos necesarios para encontrar su significado adecuado.  </p>  <p style=\"\">  \tAl finalizar el curso, encontraremos un diccionario de los sueños, donde tendremos el significado de los símbolos y objetos mas comunes  </p>", 
    "end_date": null, 
    "title": "Aprende a Interpretar tus Sueños!!", 
    "price": "20.00", 
    "instructors": "Luis Prieto", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418562_749a_3.jpg", 
    "course_url": "https://www.udemy.com/como-interpretar-los-suenos-incluye-diccionario-de-suenos/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T19:20:13Z"
}