{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Lifestyle expert and author Lissa Coffey introduces her\naudience to Ayurveda Lifestyle Practices for Balance and Bliss.  Ayurveda is the 5,000 year old \"Science of Life\" from India. It is a sister science with Yoga and Meditation. If you enjoy yoga or meditation, it's time to take your practice a step further by implementing some Ayurveda into your lifestyle. Ayurveda works wonders for keeping us healthy, managing weight, reducing stress, increasing energy and just generally functioning optimally in body, mind, and spirit.<br></p><p>Whether you’re a long-time vegan or new to the practice, you’ll get some\ngreat tips for how to eat mindfully. \nYou’ll be introduced to the six tastes, and learn about the Ayurvedic\nprinciples of cooking.  Included are\nrecipes for breakfast, lunch, and dinner. \nIt’s not only about what to eat, but also how to eat it, for optimal\ndigestion, assimilation, and elimination of the food.</p><p>Then you’ll\nsit down with Lissa for a primer on meditation.  You’ll learn\nhow to meditate, and get lots of tips for how\nto get the most out of your meditation practice.  You’ll also learn a variety of different\nkinds of meditation so that you can experience them on your own.  Lissa also goes through Ayurveda’s Behavior\nRasayanas, specific practices to help elevate your spiritual growth.</p><p>Take this Ayurveda Lifestyle course right now\nand learn how to live your healthiest and happiest life.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Ayurveda Lifestyle Practices for Balance and Bliss", 
    "price": "25.00", 
    "instructors": "Lissa Coffey", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25044_928f_5.jpg", 
    "course_url": "https://www.udemy.com/balance-and-bliss/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-19T02:58:13Z"
}