{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Course Launched in March 2016</strong><br></p>\n\n<p><strong><em>*Updated May 2016 -- new sections added</em></strong></p>\n\n<p>It’s no secret that happier people reap a ton of benefits in life. They are more likely to graduate college, have more successful careers, have a more fulfilling social life, feel more confident, are more creative, are physically healthier, and even have stronger immune systems.</p>\n\n\n\n<p>Because happiness and a sense of well-being are so crucial to a satisfying life, psychologists have been studying these questions to find <em class=\"redactor-inline-converted\">simple tricks that can increase happiness and well-being.</em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Using Positive Psychology and the Science of Happiness to its Full Potential</strong></p>\n\n\n\n\n\n<p>Everything in this course is rooted in tested life strategies. I'm not just making things up like a lot of self-help \"gurus.\" You'll learn practical tips taken from rigorous research in psychological science, and you'll discover when those strategies will be most effective.</p>\n\n\n\n\n\n<p>A few of the things we'll cover:</p>\n\n\n\n\n\n<ul><li>The surprising link between <em class=\"redactor-inline-converted\">wealth</em> and <em class=\"redactor-inline-converted\">happiness</em>.</li><li>The secret reason why materialism actually undermines well-being.</li><li>How a simple two-minute exercise can create lasting changes in your happiness.</li><li>How to pursue relationships that will give you the most fulfilling life possible.</li><li>How you can change your life by spending money on the right things (and stop spending it on the wrong things…which you almost definitely are).</li><li>...and way more!</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Overview</strong></p>\n\n\n\n\n\n<p>There’s a lot to learn about the science of happiness, but I’ve tried to condense it down to the essentials. Everything in this course is based on actual psychology research, published in peer-reviewed journals. There’s no fluff and no made-up junk science.</p>\n\n\n\n\n\n<p>The course begins with an overview of what it means to be happy and why it’s worth seeking happiness. I’ll also dispel some myths about the importance of happiness and the role of money in life satisfaction.</p>\n\n\n\n\n\n<p>Then we’ll go into the everyday tricks you can start using immediately. These are organized into broad themes that highlight the <em class=\"redactor-inline-converted\">key</em> determinants of happiness and well-being. Within each theme, though, is a collection of specific life hacks that come from real research in the science of happiness.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">And You Can Trust Your Teacher!</strong></p>\n\n\n\n\n\n<p>I'm a trained social psychologist. Not only do I have more than 13,000 students on Udemy, but I also teach classes in social psychology at the university level. Moreover, I conduct my own psychological research in psychological science, so I know a thing or two about the thousands of studies that exist in this field and what the latest experiments reveal.</p>\n\n\n\n\n\n<p>Don't miss out on the chance to dive straight into the secrets of a happier life that have until now remained locked in dense academic journals. So enroll now--you'll be glad you did.</p>", 
    "end_date": null, 
    "title": "Be Happier with Positive Psychology", 
    "price": "20.00", 
    "instructors": "Andrew Luttrell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791690_95af_2.jpg", 
    "course_url": "https://www.udemy.com/happier-positive-psychology-happiness/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T21:00:27Z"
}