{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">I will show you how to <strong style=\"\">hit the jackpot</strong> on my favorite Dave &amp; Buster&#039;s game each and every time. If you&#039;re not familiar with Dave &amp; Buster&#039;s it&#039;s a massive arcade that gives you tickets for winnings at games. Well I love games and I love to win, so it&#039;s a perfect combo. </p><p style=\"\">Plus I am not just winning for fun, I am winning for profit. I have mastered a couple of games at Dave &amp; Buster&#039;s, but one game <strong style=\"\">I hit the jackpot every single time as many times as I want. And I can show you how to do it, it&#039;s NOT even hard. </strong></p><p style=\"\">So easy anyone can do it...</p><p style=\"\"><strong style=\"\">I have such huge piles of tickets under my machine I have crowds form around me in amaze on how good I am.</strong> Not only am I a winner, I am an entertainer, people watch after I bang out jackpot after jackpot completely unaware at what I am doing to win again and again. </p><p style=\"\">Sometimes people even play the machine next to me as I make it look so easy. Only to brick ten times in a row and leave discussed. </p><p style=\"\">However, sometimes if I like the person watching me (I usually talk to my fans) I will show them how to do what I do. <strong style=\"\">Within just 2 or 3 minutes they are now banging out jackpot after jackpot just like me. </strong></p><p style=\"\">After enough jackpots you can take your tickets over to the prize center and buy your new game console. </p><p style=\"\"><strong style=\"\">So not only are you going to get your game console for about one-third the price, you are also going to have a blast winning it every step of the way. </strong></p><p style=\"\">And as an extra bonus, you get to brag to your friends about how you didn&#039;t pay for your game console, you won it for pennies on the dollar with your mad skills. I know I do every time I turn my game consol on! </p>", 
    "end_date": null, 
    "title": "Beat Dave & Busters and Win Prizes For Huge Discounts!", 
    "price": "20.00", 
    "instructors": "Chris Douthit", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440794_80f7_2.jpg", 
    "course_url": "https://www.udemy.com/beat-dave-busters-and-win-an-xbox-or-ps4-for-13-the-price/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T23:30:12Z"
}