{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Becoming your own Best Friend is one of the best gifts you can give yourself. <strong><em>It is the secret to gaining Confidence, Courage and Strength</em></strong>  to go after and get, everything you have always wanted. It is also the key to never feeling lonely, lost or alone again.</p><p><em><strong>The best news? It is not as hard as you may think.</strong></em><br></p><p>This course has been carefully designed to help you step by step: </p><ul><li><em><strong>Peel back the layers of who you are</strong></em></li><li><em><strong>Gain insight into how you operate</strong></em></li><li><em><strong>Move past the things that stop you from getting what you want</strong></em></li><li><em><strong>Give you the confidence to get everything you have always wanted and feel incredible about yourself</strong></em></li></ul><p>This experience provides you with over 3 hours of video content and  a downloadable Discovery Journal to assist you in creating incredible outcomes. </p><p>The Discovery Journal is designed to be completed after each lecture to ensure you have clarity and a deep understanding on the tools and strategies shared. It also gives you the opportunity to learn more about yourself and to personalise and customize the experience of becoming your own Best Friend.</p><p>This experience will feel like you are in the company of great friend who has your very best interests at heart. It is delivered in a friendly, comforting and nurturing tone as well as being straight to the point. <strong><em>We offer a 100% no fluff guarantee. </em></strong>The tools and strategies shared within this experience are easily applicable and adaptable to your everyday life.</p><p><em><strong>By the end of this experience you will know how to;</strong></em></p><ul><li>Tell the difference between your Heart and your Head</li><li>Listen, trust and follow your heart all the time</li><li>Follow your heart and do what is right for you, even when it affects other people</li><li>Follow your heart when it takes you out of your Comfort zone (you'll want to learn this as this will help you achieve things you never thought possible)</li><li>Gain insight into who you are and how you operate </li><li>Move past what holds you back</li><li>Become your own Best Friend</li><li>Move past the challenges of being a Best Friend to yourself. </li><li>Be a Best Friend to yourself for the rest of your life.</li></ul><p>If you're ready for an adventure that will show you; <em><strong>How to get everything you have always wanted and create an incredible friendship with yourself,</strong></em> then you are in the right place. This is an <strong><em>ADVENTURE</em></strong> of a lifetime and an <em><strong>ADVENTURE</strong></em> you can embark upon right now!</p><p><br></p>", 
    "end_date": null, 
    "title": "Become your own Best Friend", 
    "price": "20.00", 
    "instructors": "Jodie Foster", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646478_dcdf.jpg", 
    "course_url": "https://www.udemy.com/become-your-own-best-friend/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T04:56:29Z"
}