{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>True happiness, lasting happiness can be achieved through a process known as Self-Actualisation, or Self-Realisation. This is a natural state and within the reach of all human beings. It comes from having satisfied all of one’s human needs.&nbsp;</p><p>This is the kind of happiness that cannot be obtained through the acquisition of things. The fleeting gratification in receiving goods or services is not true happiness. That is an illusion created by our global consumer society. I am not suggesting that you should avoid having nice things, just that they are not a source of true happiness.&nbsp;</p><p>Truly happy people are Self-Actualised (SA) people, so called because they are a much fuller expression of their unique human potential than non SA people. The state has been given many labels, enlightened or awakened being two of them. In Zen, it is described Satori.&nbsp;</p><p>While you cannot order happiness on demand, you can create the right conditions in yourself for Self-Actualisation to occur. This eBook describes what these conditions are, and how you might go about creating them. The rest is up to you.&nbsp;</p><p>Dr. David Tuffley, and experienced teacher and researcher takes you through a series of short videos that paint a portrait of the self-actualising person that you can learn from and emulate in your own life. If you take this course, follow its advice and put the principles into practice in your own life, you make it much more likely that you will experience true happiness. Enrol today, consider it an investment in your future happiness.</p>  ", 
    "end_date": null, 
    "title": "Being Happy: Your guide to true & lasting happiness", 
    "price": "20.00", 
    "instructors": "David Tuffley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62315_48c1_7.jpg", 
    "course_url": "https://www.udemy.com/being-happy-your-guide-to-true-lasting-happiness/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-26T06:12:54Z"
}