{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Overview</strong><br style=\"\"></p><p style=\"\">Bliss Every Day brings practical skills and ideas to allow you to live in an awakened state. An awakened state is where you are no longer subject to unconscious patterns of behavior, that can create instability and stress. An awakened state is when you live in a surrendered, flowing way, co-creating with the Universe, creating a magnificent life from your true power source.</p><p style=\"\">We would never ever create a life we are unhappy with consciously. This type of life is created unconsciously. This course is about the magnificence and empowerment of living life in a conscious way.<br style=\"\"></p><p style=\"\">Bliss Every Day shares with you wonderful, life changing skills allowing you to not only feel more peaceful and empowered within yourself, but to enjoy fulfilling and meaningful relationships.&nbsp;</p><p style=\"\"><strong style=\"\">Course Structure</strong></p><p style=\"\">The course is taught online as a series of six lectures. There is a video file for each of the following topics:</p><ol style=\"\"><li style=\"\"><strong style=\"\">Tune into your body: </strong>for vibrant health</li><li style=\"\"><strong style=\"\">Make peace with the past:</strong> to enjoy the present</li><li style=\"\"><strong style=\"\">Respond rather than react:</strong> to be empowered</li><li style=\"\"><strong style=\"\">Make your mind your friend:</strong> for mental resilience and peace</li><li style=\"\"><strong style=\"\">Let your intuition be your guide:</strong> create your best life</li><li style=\"\"><strong style=\"\">The joy of conscious relationships:</strong> create a joyful life<br style=\"\"></li></ol><p style=\"\">Each lecture stands alone but also builds on the skills taught in the previous lecture. Ideally each lecture would be taken a week apart, at roughly the same time, giving you time to practice and integrate the skills in between lecture times. <br style=\"\"></p><p style=\"\"><strong style=\"\">Handouts</strong><br style=\"\"></p><p style=\"\">A series of handouts has been developed for each lecture with comprehensive notes and exercises that you will be required to do throughout the course. This personalizes and deepens your experience.</p><p style=\"\">The handout for each lecture is located under &quot;Lecture Files&quot; on the right hand side column at the beginning of each lecture. You are required to print out the handouts, so that you can refer to them and complete the handwritten exercises as you go along. You may like to complement this process by keeping a journal that you write down any reflections you may have during the week in between lectures.</p><p style=\"\"><strong style=\"\">Time Required</strong></p><p style=\"\">Allow about 45 minutes each week as each lecture goes for about 20 minutes and this will give you plenty of time to do the written activities.</p><p style=\"\"><strong style=\"\">Benefits</strong></p><p style=\"\">Bliss Every Day is designed to help you to grow and evolve as an individual. The course will help you feel more calm, loving and centred, like the &quot;real&quot; you—able to express your gifts and talents and engage in the world in a fulfilling and meaningful way.</p><p style=\"\"><strong style=\"\">Instructor availability<br style=\"\"></strong></p><p style=\"\">Just write any questions in the questions box accessed by the questions tab in the upper right hand corner of each lecture. Deborah will get back to you within 24 hours (just to allow for the international time differences).<br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Bliss Every Day", 
    "price": "50.00", 
    "instructors": "Deborah Fairfull", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48944_43d6_12.jpg", 
    "course_url": "https://www.udemy.com/bliss-every-day/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-08T12:48:24Z"
}