{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong>Change Your Life in 21 Days - The Bucket List Challenge</strong></p>\n<p>Do you often wonder, “<em>Is there more to life than this?</em>”  </p>\n<p>Does life seem like a <em>never-ending series of routines that pay the bills</em>?  </p>\n<p><em><strong>Are you dying for some fun and excitement in your life but have no idea what to do?</strong></em></p>\n<p><strong>I invite you to join the 21-Day Bucket List Challenge and change your life.</strong></p>\n<p>I know, I know, a bucket list seems like a strange solution to life’s woes but after you take this course, you will be among the enlightened few who know about this insanely simple and fun solution.</p>\n<p><em>Your exciting new life is just a few lectures away</em>.</p>\n<p>Join the Change Your Life in 21 Days - The Bucket List Challenge community and you will get lifetime access to this course so you can come back year after year as you create your promotions.</p>\n<p><em><strong>FULL 30 DAY MONEY BACK GUARANTEE.</strong></em></p>\n<p>If you are tired of feeling stuck and exhausted then it’s time to permanently change your life.</p>\n<p><strong>WARNING -</strong> After taking this course you will never look at life the same.  You will see adventure and opportunity everywhere.  You can’t undo the change in mindset that you will gain with this course.</p>\n<p>This course will take you from an unsatisfied and uninspired individual to a high-energy and motivated experience creator.  People will wonder what’s gotten into you.</p>\n<p><strong>Remember you get lifetime access plus a full 30 day money back guarantee.</strong></p>\n<p><em>Now is the right time to change your life!!!</em></p>\n<p>Click the <strong><em>Enroll Now</em></strong> button today and let’s get started.</p>", 
    "end_date": null, 
    "title": "Change Your Life in 21 Days - The Bucket List Challenge", 
    "price": "20.00", 
    "instructors": "Julie Ann Price", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639180_e532_5.jpg", 
    "course_url": "https://www.udemy.com/change-your-life-in-21-days-the-bucket-list-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T12:29:00Z"
}