{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Change Your Life in 21 Days - The Healthy Eating Challenge</strong></p>\n<p>There are over 35 popular diets that claim to make you healthier.  After the 35 common ones, there are 100’s lesser known programs that range from bizarre to down-right unhealthy.  If you are looking to eat a healthier diet, it’s no wonder you’re confused and overwhelmed by the choices.</p>\n<p>Which program will get YOU results?  Which program is really healthy?  Are carb’s in or are carb’s out?  Simple put there is just too much contradictory advice for you to make heads or tails of what constitutes healthy eating.  The Healthy Eating Challenge course was created to help you make sense of all the dieting choices and create a healthy eating plan that suits you.</p>\n<p><strong>Design and Execute a Customized Healthy Eating Program in the Exciting Life Changing Course.</strong></p>\n<ul><li>Shed old eating patterns that kept you stuck in the past.</li><li>Learn the #1 sabotager of your healthy eating and how to prevent it from stopping you this time.</li><li>Create simple, effective and varied menus that will help you stay on track no matter what life throws your way.</li><li>Design a 21 day challenge that will lead to a lifetime of healthy eating.</li></ul>\n<p><strong>Master Healthy Eating and Stay Healthy for Life</strong>.</p><p>Healthy eating is often viewed as a chore and a struggle.  No one wants to give up food they like, be hungry all the time or spend hours in the kitchen preparing fresh meals.  I know that the idea of having to cook every single meal, every single day and following the strict menus suggested by most diet plans kept me from making healthy choices.  </p>\n<p>What I found, and what we will cover in this course, is how to tailor menus to fit you while not getting bored.  You will learn how to take the best parts of healthy eating advice and discard the rest.  Overall, with this course, you will get a simple plan of action by following 6 preparation steps.  Then you will get into action by making manageable changes in your life that will add up to a huge improvement in your eating style.</p>\n<p><strong>Course Structure</strong></p>\n<p>Each lecture has been designed to be short and sweet.  I want you to get the main point without a whole lot of rambling.  You have been preached to about healthy eating too much.  You won’t find any preaching here!</p>\n<p>Instead you will be treated like the smart individual you are.  I will lead you through a simple process of weeding out what doesn’t work for you so that you can focus on what does.  You will learn what has been holding you back in the past and how to deal with old baggage so that you can move forward.</p>\n<p>After we lay the groundwork, you and I will get into the actual challenge.  I have created worksheets and resources to help you move through the challenge prep quickly.  </p>\n<p>This course is different from any other healthy eating program you have tried before because you get to make the rules, keep your own score and challenge yourself at any level you want to.  There are no right or wrong ways to succeed with this course!</p>\n<p><em><strong>YOU HAVE LIFETIME ACCESS TO THE COURSE MATERIAL &amp; LIFETIME UPDATES.</strong></em></p>\n<p><em>PLUS A FULL 30 DAY MONEY BACK GUARANTEE.</em></p>\n<p>If this course doesn’t meet your expectations, you can get your money back.  However, I know you will love the simplicity and common sense approach.  You can reach out to me anytime you have questions, want support or want to share your success.  I am just a quick message away.</p>\n<p>Now is the right time to change your life!!!</p>\n<p><strong>Click the \"Take the Course\" button today and let’s get started.</strong></p>", 
    "end_date": null, 
    "title": "Change Your Life in 21 Days - The Healthy Eating Challenge", 
    "price": "20.00", 
    "instructors": "Julie Ann Price", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647818_ab7d_3.jpg", 
    "course_url": "https://www.udemy.com/healthy-eating-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T13:22:57Z"
}