{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t Are you ready to live the longest and most vibrant life possible? Would you like to discover ways to slow and even reverse your aging process?  Do you want to learn proven techniques to feel better, look younger and enjoy life more completely?  </p>  <p>  \t If you said yes to these questions, then this course is for you!  </p>  <p>  \t As we age, many of us complain about feeling tired, gaining weight, not having energy, restless sleep, wrinkles, forgetfulness, etc. And these things are generally attributed to \"getting older.\" Right?  </p>  <p>  \t But what if that isn't true? What if there are ways to stay young, active and healthy for many more years than you ever expected? How would you like to slow or reverse the aging process?  </p>  <p>  \t <strong>Learn from someone who has actually accomplished these things and MORE!</strong>  </p>  <p>  \t My name is Katrina Mayer and at over 50 years of age I have never felt better in my whole life. I sleep well. My weight is perfect. My teeth, skin and eyes are healthy. I have tons of energy. And I have scientific evidence to show that I have not only slowed my aging process but also <strong><em>reversed</em></strong> it! I have literally cut my age in half with test results to prove it!  </p>  <p>  \t <strong>And I'd love to share my techniques with YOU!</strong>  </p>  <p>  \t My fascination with halting (and even reversing) the aging process has lead me on a lifelong journey to discover the best ways possible to stay young and vibrant. I've done the research and now I can share it all with you!  </p>  <p>  \t <strong>If you follow the steps in this video program you will be able to:</strong>  </p>  <p>  \t 1. Sleep better  </p>  <p>  \t 2. Enjoy a healthy weight  </p>  <p>  \t 3. Feel positive about your life  </p>  <p>  \t 4. Look younger  </p>  <p>  \t 5. Experience more energy  </p>  <p>  \t 6. Feel like a kid again  </p>  <p>  \t 7. And so much more...  </p>  <p>  \t In these videos I share <strong>all my tips and secrets</strong> for feeling healthy, vibrant and alive. I address the topics of diet, exercise, meditation, supplements, skin care, dental health, environmental factors and much, much more.  </p>  <p>  \t With two hours of video content you can go through this program as slowly or quickly as you like. And you'll want to take lots of notes. I give you scores of information to turn your life around so you can feel younger and healthier, too.  </p>  <p>  \t I've been touching the lives of tens of thousands of people through my published books, youtube videos, Facebook pages and two websites. But <strong>never before </strong>have I put so much juicy material together in one place. I'm thrilled to be sharing it with you now.  </p>  <p>  \t <strong>What are you waiting for?</strong> Take this course so you can feel more youthful, vibrant and wonderfully, joyfully alive.  </p>  <p>  \t I'll see you on the other side!  </p>  <p>  \t <strong>Katrina Mayer - <em>Author, Motivational Speaker and Longevity Expert</em></strong>  </p>  <p><br></p>  <p><br></p>", 
    "end_date": null, 
    "title": "Cut Your Age in Half! How I Did It And You Can, Too!", 
    "price": "50.00", 
    "instructors": "Katrina Mayer", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/127538_fd9b_10.jpg", 
    "course_url": "https://www.udemy.com/cut-your-age-in-half/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-01T06:08:12Z"
}