{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Tanto si tienes idea de lo que te gustaría hacer como si no, toma papel y lápiz, pues <strong>al final del curso tendrás </strong><strong>un proyecto completo y listo para poner en marcha.</strong> Con una base sólida y concreta, <strong>adaptado a ti, a tu forma de ser y a la vida que te gusta vivir.</strong></p><p><em>“Tu proyecto es un maravilloso regalo porque desde que decidí seguirlo, solo entre las lecciones 9 y 10 no paran de ocurrirme todas esas cosas a través de las cuales me siento “en casa\"… Millones de gracias amorosas…\"</em></p><p><em>- María Pilar Álvarez Novalvos - Escritora y alumna del curso</em></p><p>Empezamos desde lo más esencial, encontrar lo que te gusta, y vamos desarrollando la idea para crear tu proyecto desde ahí. Eso te ayudará a <strong>crear </strong><strong>un proyecto que se mantenga en el tiempo</strong>, porque estarás motivado/a con ello.</p><p>Después, aprenderás cómo definir productos y servicios que sean útiles, rentables e inspiradores. Con esto, <strong>conseguirás que sea </strong><strong>concreto y viable</strong>.</p><p><em>\"UNA GRAN AYUDA TANTO SI YA TIENES TU SUEÑO COMO SI LO ESTAS BUSCANDO</em></p><p><em>Lo que me ha gustado mucho del curso que no se queda en la parte teórica sino que te enseña primero como buscar tu propio sueño y luego como realizarlo paso a paso a través un un plan de acción concreto. Y como está explicado en videos es super fácil de entender y por si quieres recordar las ideas principales a continuación de los videos vienen las diapositivas. Yo ya tenía mi propio sueño pero lo que me faltaba es darle forma y saber como ponerlo en marcha… Me ha servido muchísimo para aclarar mis propias ideas y me ha dado muchas ideas nuevas. Pues realmente agradezco a Margarita por ese “empujón\" que me ha dado con su curso. :)\"</em></p><p><em>- Edyta Aleksandra - Sanadora, formadora y alumna del curso</em></p><p>Y conocerás las claves más importantes para conseguir que todas esas técnicas que ya conoces y las nuevas que vas a aprender, <strong>funcionen para ti</strong>.</p><p>Hay una razón por la que algunas cosas parecen funcionar y otras no, o le funcionan a otros y a ti no. <strong>E</strong><strong>sa razón es sencilla cuando la comprendes, y</strong><strong> es la base de este curso.</strong></p><p><em>\"¡Cree en ti!</em></p><p><em>Un curso que te ayuda a focalizar la mirada en lo que realmente vibra en ti, con serenidad, definición, pasos concretos y sencillos. Útil para todo aquel que cree que no tiene o tiene muchos sueños inconclusos como yo. Muchas Gracias!\"</em></p><p><em>- Valeria - Alumna del curso</em></p><p>Un proyecto debe ser práctico, útil, tener los pies en la tierra y también debe tener corazón. <strong>Ese tipo de proyecto es el que inspira al mundo</strong> y ayuda a crecer y avanzar a las personas.</p><p>Aprovecha todo tu potencial y comienza a crear tu propio proyecto.</p><p>Un proyecto <strong>del que puedas vivir y basado en lo que a tus propias capacidades y sueños</strong>.</p><p><span></span>Contiene el Método completo \"<em>Crea Tus Sueños</em>\" con todos los pasos y la guía didáctica.</p><p>Este curso combina todo el conocimiento y la experiencia del emprendimiento con el del desarrollo interior, para que puedas sacarle el máximo partido, personal y profesional.<span></span></p><p><strong>Crear tus sueños es crear la vida que deseas.</strong></p>  <p>  \t      Mucha gente no se lanza a cambiar de vida porque no sabe cómo, porque no sabe siquiera hacia dónde dirigirse o porque no tiene la seguridad de que vaya a funcionar y tiene miedo a lanzarse y perder lo que ahora tiene.  </p><p>Entonces empiezas a seguir lo que hacen otros y que a ellos les funciona, pero ves que a ti no, o no tanto como a ellos. ¿Qué diferencia hay entre esas personas que parece que todo les va bien y tú? Que <strong>ellos han comprendido las claves fundamentales del éxito, pero no sólo eso, las han comprendido y las han personalizado, las han aplicado a su propia vida</strong>.</p><p>No trates de seguir a los demás al pie de la letra. Has de ser capaz de tomar esas ideas y adaptarlas a ti.</p><p><strong>Este curso te sirve justo para eso, para usar todo lo que ya sabes en tu favor, aplicado a tu forma de ser y vivir.</strong></p>  <p><strong>Si sientes que quieres hacer algo diferente, emprender algo nuevo basado en lo que te más te gusta, este curso te ayuda:</strong></p>  <ol>  \t<li>A averiguar qué quieres en realidad</li>  \t<li>A dar los primeros pasos</li>  \t<li>A mantenerte en el camino</li>  \t<li>A disfrutar de ello</li>  </ol>  <p>  \t<em>\"Dar el primer paso en cualquier camino, es quizá la mayor muestra de valor... saber la dirección de ese paso, la mejor ayuda\" - Vicente Arenas - Fotógrafo de sentimientos  \t</em>  </p>    <p>  \t<strong>La clave principal: creer en ti y en lo que tienes para aportar</strong>  </p>  <p>  \t      Aprenderás a seguirte a ti y a lo que sientes, que puedes creer en ti y en lo que tienes para aportar y sacar de ello un proyecto de vida.  </p>    <p>  \t<strong>No es un curso teórico, sino un taller práctico.</strong>  </p>  <p>  \t      Podrás crear un proyecto concreto, real y que funcione.  </p>  <p>  \t      Cuanto más te impliques en él, <strong>mejores resultados</strong> conseguirás.  </p>    <p>  \t<strong>¡Todos los sueños son realizables, si sigues los pasos adecuados.!</strong>  </p>    <p>  \t<strong>Dispondrás de recursos prácticos</strong>:  </p>  <p>  \t                                Una plantilla de trabajo en la que tendrás que ir desarrollando las ideas que surjan con las claves que te demos en los vídeos y en las presentaciones.  </p>    <p>  \t                                  ¿Tienes una idea, un sueño, un proyecto o, simplemente, ganas de hacer algo distinto?  </p>  <p>  \t<strong>¡Apúntate al curso y empieza a crear tu nueva vida ahora!</strong>  </p>", 
    "end_date": null, 
    "title": "Cómo Crear tus Sueños. Conviértelos en un proyecto real.", 
    "price": "50.00", 
    "instructors": "Margarita Álvarez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273594_d615_5.jpg", 
    "course_url": "https://www.udemy.com/como-crear-tus-suenos/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-02T20:11:22Z"
}