{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Wußtest du, dass 92% aller Neujahrsvorsätze scheitern?</strong></p>\n\n<p>Und weißt du auch wieso?</p>\n\n<p>Weil es <strong class=\"redactor-inline-converted\">unzählige Fehler </strong>gibt, die man machen kann man, wenn man sich Ziele setzt, und die meisten Menschen machen genau diese Fehler immer wieder. </p>\n\n<p>Deswegen meine Frage an dich: </p>\n\n\n\n<p>Wie läuft’s bei dir? Bist du mit deinem Leben on track? Hast du das Gefühl, du hast alles unter Kontrolle? Bist du dabei, alle Ziele zu erreichen, die du dir gesetzt hast? Wenn ja, dann herzlichen Glückwunsch! Du brauchst diesen Kurs nicht!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Oder kennst du eher folgendes Gefühl</strong>:</p>\n\n<p>Du hast dir viel vorgenommen, aber irgendwie hängst du immer deinen Ansprüchen hinterher. Du setzt dir zwar Ziele, aber erreichst sie oft nicht. Du gibst unmotiviert auf oder vergisst was eigentlich all deine Ziele waren. Oder deine Ziele fühlen sich irgendwie falsch an? </p><p>In diesem Kurs steckt nicht nur meine Erfahrung, sondern auch das Wissen und die Techniken der erfolgreichsten Menschen der Welt.</p>\n\n<p>Du wirst nicht nur <strong class=\"redactor-inline-converted\">lernen, wie du richtig Ziele setzt</strong>. Du wirst vor allem erfahren und in <strong class=\"redactor-inline-converted\">vielen Übungen</strong> praktisch durchführen, wie du die richtigen Ziele setzt, die zu <strong class=\"redactor-inline-converted\">deiner persönlichen Vision und deinen Werten</strong> passen, und wie du diese dann auch <strong class=\"redactor-inline-converted\">motiviert bis zum Erfolg verfolgst. </strong></p><p>Worauf wartest du also noch? Hol dir jetzt den Kurs, wenn auch du <strong>DEIN BESTES JAHR</strong> erleben willst!</p><p><br></p>", 
    "end_date": null, 
    "title": "Dein bestes Jahr! Erreiche deine Ziele, lebe deine Träume", 
    "price": "35.00", 
    "instructors": "Dr. Johannes Metzler", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857368_2fb5.jpg", 
    "course_url": "https://www.udemy.com/ziele-setzen-formulieren-erreichen-motivation-erfolg/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T10:39:56Z"
}