{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">              Ultimas Noticias:  </strong>  </p>  <p>  \t<strong style=\"\">MILES DE PERSONAS YAN HAN TOMADO ESTE CURSO, Y POR PEDIDO DE MIS ESTUDIANTES, AHORA ESTE CURSO ESTA DISPONIBLE AQUÍ EN UDEMY</strong>  </p>  <p>  \t<strong style=\"\">Mas reciente actualización del curso: 25 de febrero, 2015</strong></p>  <p>  \t<strong style=\"\">Próxima actualización: 15 de abril, 2015</strong>  </p>  <p>  \t<strong style=\"\">________________________________________________________________________</strong>  </p>  <p>  \t                                    ¿Quisieras que te ENCANTE tu ocupación o profesión?  </p>  <p>  \t                                    ¿Quisieras eliminar el estrés y la ansiedad que te hacen sentir mal?  </p>  <p>  \t                                    ¿Quisieras tener amigos que te inspiren y te apoyen a lograr tus metas?  </p>  <p>  \t                                    ¿Quisieras no tener que preocuparte del dinero nunca más?  </p>  <p>  \t                                    ¿Quisieras sentirte fisicamente estupendo?  </p>  <p>  \t                                    ¿Quisieras saber que se siente AMAR todo lo que haces en la vida?  </p>  <p>  \t                                    ________________________________________________________________________  </p>  <p>  \t                                    Sobre este curso:  </p>  <ul style=\"\">  \t<li>Más de 25,000 personas han tomado este curso</li>  \t<li>Ahora, todo el contenido esta disponible para ti, aquí en Udemy</li>  \t<li>¡55 lecciones y mas de 4 horas de video!</li>  \t<li>Tendrás acceso gratuito de por vida al curso</li>  \t<li>Podrás acceder y bajar el contenido a cualquiera de tus dispositivos móviles</li>  \t<li>Todas las lecciones adicionales que iré incorporando las recibirás gratis</li>  \t<li>Tienes mi garantía personal: Si no cumplo con tus expectativas, se te devolverá tu dinero</li>  \t<li>Este curso ha recibido comentarios increíbles de gente que ha sido transformada gracias al contenido de este curso</li>  </ul>  <p>  \t                                    ________________________________________________________________________  </p>  <p>  \t                                  Estudios científicos recientes muestran que solo el 7% de la población en el mundo se siente totalmente satisfecha y complacida con sus vidas.  En este curso, te revelaré todos sus secretos.  </p>  <p>  \t                                  Te diré exactamente lo que estás personas de éxito hacen en cada una de las áreas de su vida para ser tan felices, y te daré la guía completa detallando todos los pasos que debes de seguir para aplicar este conocimiento, para que tu también puedas sentir esta sensación de júbilo, paz, felicidad y dicha que esta gente de éxito vive.  </p>  <p>  \t                                ________________________________________________________________________  </p>  <p>  \t                                Si logras aplicar si quiera una fracción de lo que voy a revelar en este curso, tu serás una persona más feliz, sin lugar a duda. Te lo digo no solamente por experiencia personal, si no también por los miles de comentarios que he recibido de mis alumnos de alrededor del mundo, que pueden atestiguar sobre los beneficios que ellos también han recibido.  </p>  <p>  \t                                ________________________________________________________________________  </p>  <p>  \t                                Toda la guía y enseñanzas que recibirás durante la duración del curso, es el resultado de más de 50 años de análisis científico, llevado a cabo por las instituciones de investigación más prestigiosas del mundo. Como Educador Master del Centro Chopra para el Bienestar, he estudiado esta información de manera minuciosa y me ha tomado varios meses para crear este curso y presentarte los hallazgos de estos estudios de una manera entretenida, clara y concisa para que puedas asimilar este conocimiento de una manera fácil y didáctica.  </p>  <p>  \t                              Miles de mis estudiantes me siguen comunicando a diario que el aplicar las recomendaciones que revelo en este curso, les ha permitido experimentar niveles más elevados de bienestar y felicidad. ¡Únete a ellos tomando este curso!  </p>  <p>  \t                          ________________________________________________________________________  </p>  <p>  \t                          Si no te sientes TOTALMENTE satisfecho con tu situación actual - ¿No crees que ya es hora de intentar algo distinto? Y que mejor que intentar algo que <strong style=\"\">ya está comprobado que te traerá resultados.</strong>  </p>  <p>  \t                          Y recuerda que te doy mi palabra que si no estás satisfecho con el curso dentro de los 30 días de haber realizado la compra, se te reembolsará todo tu dinero.  </p>  <p>  \t                          Yo actualizo este curso con regularidad, a si que recibirás nuevas lecciones en maneras de como incrementar tus niveles de felicidad ¡Totalmente gratis!  </p>  <p>  \t                          Estás solamente a un paso de transformar tu estilo de vida para que sepas lo que es sacarle el jugo a la vida - no esperes mas tiempo - ¡Tu te mereces más !  </p>", 
    "end_date": null, 
    "title": "Descubre Las 5 Claves para Alcanzar la Felicidad Total ", 
    "price": "30.00", 
    "instructors": "Cesar Gamio", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325726_58b9.jpg", 
    "course_url": "https://www.udemy.com/descubre-las-5-claves-para-alcanzar-la-felicidad-y-el-bienestar-total/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T15:53:01Z"
}