{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Latest Updates:</strong>  </p>  <p>  \t<strong>THOUSANDS HAVE ALREADY TAKEN THIS COURSE, AND BY POPULAR DEMAND IT IS NOW AVAILABLE HERE ON UDEMY</strong>  </p>  <p>  \t<strong>Multiple 5-star reviews from students around the world</strong>  </p>  <p>  \t<strong>Course updated again on Thursday, March 3rd, 2016</strong></p>  <p>  \t<strong>Next course update: April 30th,</strong><strong> 2016</strong></p>  <p>  \t<strong>________________________________________________________________________</strong>  </p>  <p>  \t  Do you want to LOVE what you do for a living?  </p>  <p>  \t  Do you want for get rid of the stress and anxiety that is holding you back?  </p>  <p>  \t  Do you want to have friends that inspire you and help you achieve your goals?  </p>  <p>  \t  Do you want to be financially stable and not worry about money?  </p>  <p>  \t  Do you want to look and feel physically great?  </p>  <p>  \t  Do you want to know how it feels to really love your life?  </p>  <p>  \t<strong>________________________________________________________________________</strong>  </p>  <p>  \t      About this course:</p><ul>  \t<li>Full, free lifetime access</li>  \t<li>24/7 access via your favourite mobile device</li>  \t<li>All future extra lectures and upgrades are always included for free</li>  \t<li>Unconditional Udemy 30-day money-back guarantee - that's my personal promise that you will become happier by taking this course</li>  \t<li>Bonus lectures that will make you an overall healthier person </li>  \t<li>Amazing reviews by transformed students! <strong>(Read the inspiring reviews below the curriculum)</strong></li>  </ul>  <p>  \t      ________________________________________________________________________  </p>  <p>  \t                          Research shows that only 7% of people in the world feel completely happy with their lives. In this course, I will reveal all their secrets.  </p>  <p>  \t             I will tell you exactly what they do in each of the most relevant areas of their lives that makes them so happy, and I will provide you with step-by-step guides on how to apply these learnings, so that you can feel the sense of fulfilment, joy, peace and absolute bliss that these people enjoy.  </p>  <p>  \t            ________________________________________________________________________  </p>  <p>  \t            If you follow even a fraction of what I will share with you in this course, you will be a happier person. I speak from personal experience and thousands of my students around the world can attest to the benefits they have received as well.  </p>  <p>  \t            ________________________________________________________________________  </p>  <p>  \t                          All the guidance and advise you will receive throughout this course is the result of 50 years of scientific analysis conducted by prestigious research organisations.  As a Senior Instructor for the Chopra Centre for Wellbeing, I have studied this data and have taken many months to put together this content to present it to you in a format that is easy to understand and follow.  </p>  <p>  \t                          Students have reported that after applying the insights learned in this course, they have experienced massive transformations in key aspects of their lives and in a very short time. Join them!  </p>  <p>  \t      ________________________________________________________________________  </p>  <p>  \t                          If you feel you are not completely happy with how things are going for you - why keep navigating by trial an error in your life when the answers that you are looking for are right here!  </p>  <p>  \t                          And remember, you have my personal promise that if you are not satisfied with this course, your money will be refunded within 30 days of purchase.  </p>  <p>  \t                        This course is updated regularly, so you will receive new lectures on ways to increase the satisfaction levels in your life absolutely free!  </p>  <p>  \t                  The happy days you seek are now within your reach - don't wait any longer!  </p>", 
    "end_date": null, 
    "title": "Discover The 5 Keys to Achieving Total Happiness & Wellbeing", 
    "price": "30.00", 
    "instructors": "Cesar Gamio", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313302_e198_6.jpg", 
    "course_url": "https://www.udemy.com/5-keys-to-achieving-total-wellbeing/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-04T12:54:14Z"
}