{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em>Course improved, extended and updated December 2015</em>  </p>  <p>Learn how to lessen your stress and anxiety with a 10 step acupressure method </p>  <p>  \t<strong>Never again allow your happiness to depend on your circumstances. </strong>  </p>  <p>Have Fun with All 10 Tried and Tested Happiness Exercises<br></p><p>Train Yourself to Overcome Our Natural Negativity Bias<br></p>  <p>  \t      Monitor your Progress as You Go  </p>  <p>Find Out About the Different Types of Happiness</p><p>Learn About Emotions and How They Serve Us</p><p>Learn the truth about how your happiness is up to you.</p><p>Download the audio's and listen to them when it suits you.</p>  <p>  \t<strong>Take control of your own happiness.</strong>  </p>  <p>  \t       I will be here to support, advise and encourage you through every aspect of the course.  </p>  <p>  \t      I am not going to make exaggerated claims about astounding success or making all your dreams come true. But I do guarantee that you will benefit positively by engaging in well researched and tested exercises to relieve stress, anxiety and even improve the symptoms of clinical depression. And they're fun too.  </p>  <p>  \t      With simple and easy to understand lectures, learn how to take charge of your life by understanding your emotions and about the science of happiness.  </p>  <p>  \t      Measure your own progress as we move through the course so that you can see the improvements in your happiness levels with concrete figures.  </p>  <p>  \t<strong>Content and Overview</strong>  </p>  <p>  \t      After several years of studying the latest research on Positive Psychology and The Science of Happiness from the most trusted academic institutions in the world, I designed this course to be usable, fun and effective for everyone.  </p>  <p>  \t      We'll begin with Dr Jakob Bargak's simple 10 step acupressure method to release stress and anxiety.</p><p>Then we'll move on the Happiness Exercises, where you can have some serious fun with the 10 exercises. And you can download the audio's!</p><p>We then take a look at some of the theory behind the exercises, although this is kept simple and interesting, no scientific jargon. For example, most people are not aware that there is more than one kind of happiness.<br></p><p>We are all born with an inbuilt bias towards negativity but you will learn to know when and how to overcome it in order to get happy.</p>  <p>  \t      Finally you take a look back over the exercises and I can help you to decide which ones you liked the best and are likely to incorporate into your life from here on in.  </p>  <p>  \t      I am available throughout to answer any questions or help with any problems relating to the course.  </p>", 
    "end_date": null, 
    "title": "Discover The Simple Science of Happiness", 
    "price": "20.00", 
    "instructors": "Anne Kelly, Dr. Jakob Bargak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307064_8a8b_3.jpg", 
    "course_url": "https://www.udemy.com/happiness-is-up-to-you-learn-how-to-be-happy/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T18:40:55Z"
}