{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">You&#039;ve heard about the Emotional Freedom Technique (EFT or Tapping) and now you&#039;re wondering: Should I learn EFT? Will EFT work for me? How will it improve my life? <br style=\"\"></p><p style=\"\"><em style=\"\">Well good news.  </em><strong style=\"\">EFT can improve your life; You can start using it today; and It will work for you.</strong>  How do I know?  Because I overcame <em style=\"\">years of negativity</em> with EFT.<br style=\"\"></p><p style=\"\">In this course I guide you, step by step, to show you exactly how to use EFT/Tapping to deal with any issue or problem.  Such as chronic pain, stress, depression, low self esteem, weight, smoking, drinking... The list goes on!</p><p style=\"\">What have you got to lose?  Other than issues that are holding you back, keeping your down and miserable and reducing your quality of life.  </p><p style=\"\">You deserve to feel good and enjoy life.  <em style=\"\">You only have the 1 life - start really living now!</em></p><p>You will learn the <em style=\"\">exact </em>technique I used to:</p><ul style=\"\"><li>Overcome decades of low self-esteem as a result of bullying</li><li>Reduce my anxiety and help prevent anxiety attacks</li><li>Help me manage depression</li><li>Increase self-love and self-esteem</li><li>Feel more in control of my emotions on a daily basis</li></ul><p>Let me now share with you the <strong style=\"\">benefits </strong>and reasons why you should learn Emotional Freedom Technique.</p><ol style=\"\"><li><strong style=\"\">You can do it anywhere.</strong>  At home, in your office, in the car, on the beach, while walking!</li><li><strong style=\"\">You can do it on yourself.</strong>  No therapy classes, counselors or tools needed.</li><li><strong style=\"\">You can use it on any problem or issue you have.</strong> From weight issues to pain.<br style=\"\"></li><li><strong style=\"\">You can teach EFT to other people to help improve their lives.</strong></li></ol><p>Get started with this course to learn how to start feeling more at peace, relaxed, happier and pain free <em style=\"\">immediately</em>! </p><p>Over 1300 students are taking this course.  Check out the 5 star customer reviews.</p><p>Click the &quot;take this course&quot; button, top right, now ...<em style=\"\"> And start getting in control of your life to feel better today.</em><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Emotional Freedom Technique (EFT) to Get Happy & Healthy Now", 
    "price": "50.00", 
    "instructors": "Emma E Knapp", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246182_4ddf_2.jpg", 
    "course_url": "https://www.udemy.com/learn-eft-tapping-in-6-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-19T01:43:53Z"
}