{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        Even if things are &quot;okay&quot; in your life after divorce or breakup, or maybe they&#039;re so bad you think you&#039;re beyond help, please give yourself the gift of this <strong style=\"\">rescue course for &quot;broken hearts&quot;  .</strong></p><p style=\"\"><strong style=\"\">This is your emotional plan for a fast recovery from painful divorce or breakup.<br style=\"\"></strong></p>  <p style=\"\">You will let go of pain, anger, guilt, clear your feeling of out of control and your fear to be seen as a failure. You will achieve remarkable breakthrough in the way you think and feel. Are you ready to shed old patterns once and for all and take a giant leap towards your HAPPY future?</p>  <p style=\"\">  \t<strong style=\"\">Sign-up for this course NOW.</strong>  </p>  <p style=\"\">  \tAs Mary Manin Morrissey says - &quot;Even though you want to move forward in your life, you may still have one foot on the breaks. In order to be free , we must learn how to let go. Release the hurt. Release the fear. The energy it takes to hang onto the past is holding you back from a new life .&quot;<br style=\"\">  \t  </p>  <p>  \t      <em style=\"\">Course overview:</em>  </p>  <p>  \t      The introduction to the emotional stages during divorce and breakup will give you the clarity to access you own situation, feelings and thoughts. You will be able to draw step-by-step plan that will give you the confidence to take a life-changing turn  </p>  <p>  \t      The Starter Kit for Emotional Freedom Technique (EFT) will give you in a very concise way the most important foundation of EFT tapping. You will be able with confidence to apply it to remove emotional charge for all obstacles in your life that are stopping you to reach freedom.  </p>    <p>  \t<strong style=\"\">During this course you will accomplish: </strong><strong style=\"\"></strong>  </p>  <ul style=\"\">  \t<li style=\"\">Denial Stage - you will clear this awful feeling of out of control</li>  \t<li style=\"\">Shock Stage - you will  no longer feel overwhelmed with your mixed feelings</li>  \t<li style=\"\">Rollercoaster Stage - you will clear the fear to be seen as a failure by others</li>  \t<li style=\"\">Bargaining Stage - you will release your doubt if you have taken the right actions and you will reach acceptance that you cannot control another human being</li>  \t<li style=\"\">Letting Go Stage - you will become free from your fear of letting go of your EX and this period of your life</li>  \t<li style=\"\">Acceptance Stage -  you will begin having a strong belief in your own power and will be looking forward to your  life after divorce or breakup</li>  </ul>  <p>  \t  For each of the emotional stages, you will get EFT directions and exercises for self-work so you will be able to work on your own with other issues that bother you.  </p>", 
    "end_date": null, 
    "title": "From Divorce and Breakup - To HAPPINESS - Now", 
    "price": "45.00", 
    "instructors": "Anelia Mitseva", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414198_a4fb_2.jpg", 
    "course_url": "https://www.udemy.com/breaking-free-after-divorce-breakup-be-happy-now/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T15:43:24Z"
}