{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    Everybody has goals. Only most of our goals are either instinctive, or survival based, or they are set for us by somebody else. In this comprehensive course, you&#039;ll learn how to take your <strong style=\"\">biggest dreams</strong> and turn them into an <strong style=\"\">action plan for success</strong>.  </p>  <p style=\"\">  \t    You&#039;ll also learn how to uncover and <strong style=\"\">eliminate hidden fears</strong>, which will allow you to easily <strong style=\"\">obliterate self-sabotage</strong>. This course is designed for anybody who wants more out of life. It&#039;s best to start this course with an area of life you&#039;d like to focus on, such as health, wealth, career, relationships, sports, etc.  </p>  <p style=\"\">  \t    Then we&#039;ll go step by step and turn your dreams into reality.  </p>  <p style=\"\">  \t    This course also comes with a comprehensive manual, a worksheet to take any dream and turn it into a plan, as well as a powerful, <strong style=\"\">thirty minute hypnosis session</strong> that will turn your visualizations into reality.  </p>  <p style=\"\">  \t  First you&#039;ll understand the difference between goals and wishes, and wishes almost never come true, but properly set goals almost always come true.  </p>  <p style=\"\">  \t  Then you&#039;ll learn what the most common fears are to setting goals, and how to obliterate them.  </p>  <p style=\"\">  \t  Then we&#039;ll get into the nitty-gritty, step by step details of how to take your <strong style=\"\">greatest desires</strong> and turn into an <strong style=\"\">automatic success plan</strong>.  </p>  <p style=\"\">  \t  Finally, you&#039;ll learn some very powerful proven motivation strategies that will keep your mind on fire and your creative juices flowing to uncover even faster ways to <strong style=\"\">make your dreams come true</strong>.  </p>  <p style=\"\">  \t  This course comes with in depth lecutres, a comprehensive manual, a worksheet with specific strategies and a powerful hypnosis session to put your goals on auto pilot.  </p>  <p style=\"\">  \tIt&#039;s highly recommended you take your time going through this course, and watch it several times to get the most benefit.  </p>", 
    "end_date": null, 
    "title": "Goal Setting - How To Easily Turn Dreams Into Reality", 
    "price": "25.00", 
    "instructors": "George Hutton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424506_0ed2.jpg", 
    "course_url": "https://www.udemy.com/goalsetting/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T02:01:26Z"
}