{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>JOIN MY <strong>12,900 SUCCESSFUL STUDENTS FROM 145 COUNTRIES</strong> WHO HAVE ALREADY TAKEN MY UDEMY COURSES AND GAVE ME <strong>OVER 200 5 STAR REVIEWS</strong>!</p><p>  \tCourse updated on January 3rd. </p>  <p>  \t<strong>JOIN OVER 4,600 SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE. </strong>  </p>  <p>  \t                                                                            About this course:  </p>  <ul>  \t<li><em>Over 4,600 very happy students</em></li>  \t<li><em><strong>Almost 50  -  5 Star Reviews</strong> from VERY satisfied students</em></li>  \t<li><strong> <em>FREE 30 minutes personal coaching - $175 value - upon 100% course  completion </em></strong>  \t</li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy </em><strong>30 day money-back guarantee </strong><em>- that's my personal promise of your success!</em></li>  \t<li><em>Regular </em><strong>free surprise bonuses </strong><em>to help you change your habits even more!</em></li>  </ul>    <p><strong>What some Udemy Program Participants Have to Say About This Program...  \t<span></span></strong>  </p>  <p>  \t                Braco delivers the lectures with <strong>enthusiasm</strong>, making <strong>you want to keep going and learn more.       </strong>- <strong>Al Riess</strong></p>  <p>  \t<strong>Wonderful instructor </strong>who presents <strong>clearly what happiness is and how to achieve happiness </strong>for your life. . I highly recommend this course<strong>!  </strong>- <strong>Yin Yin,</strong></p>  <p>  \t                My favorite thing about this course is how <strong>applicable</strong> it is!<strong>.  </strong>- <strong>Felix Thea,</strong></p>  <p>  \t                Braco is very <strong>enthusiastic and passionate</strong>. Thanks for this <strong>motivating</strong> course.                     - <strong>Pamela Loveridge</strong></p>  <p>  \t                ..The course contains a <strong>good mix between theory and practice</strong> with explanatory videos.     - Silviu Marisca,</p>  <p>  \t                .... I found it's <strong>straight to the point but comprehensive</strong>.                                                           - Manuel Kraus</p>  <p>The overall <strong>production quality was excellent</strong>, and I <strong>enjoyed Braco's delivery</strong>, which was <strong>upbeat, personable and realistic</strong>.      -<strong>Christine Scarince</strong></p>  <p>  \t                In short, <strong>engaging and powerful lectures</strong>,..There is a <strong>wealth of information and knowledge</strong> in this course and I <strong>would also highly recommend Braco's book for additional information and examples of other habits.                                                                                                                             </strong>-Annie Glynn</p>  <p>The videos <strong>are short &amp; effective </strong>and cover all that one needs to know to change habits positively. <strong>There is no fluff, everything is efficiently presented</strong>.                                              -Louis-Eric Simard</p>  <p>  \t                I love this approach. <strong>Practical, easy to follow step by step</strong>....The two course (taught by Braco)- (this one and positive psychology +) <strong>are along the best positive psychology courses and training methods                                                                                                  </strong>-Erdélyi András</p>    <p><strong>_________________________________________________________________________</strong></p>  <p>  \tAt the end of this this course, you will:</p> <ul><li>Understand <strong>Basic of Habits</strong></li><li><strong>Choose One or More Habits You Want To Change</strong></li><li>Make Necessary Steps to<strong> Change Your Habits </strong></li><li><strong>Increase Will Power and Self Confidence </strong></li><li>Release <strong>Your Own Happy Chemical </strong></li><li><strong>Learn 7 Secrets </strong>to Habits and Happiness </li><li><strong>Become Happier</strong></li><li>Succeed in Any<strong> Habit Formation </strong></li><li><strong>Introduce New Routines </strong></li><li>And much more...</li></ul>    <p>  \t<strong>Habits and Happiness</strong> Udemy Program combines years of research by experts in the field of habits, neuroscience, traditional and positive psychology, and teaches you how to apply this new information in a very simple and practical way. This program will help you understand your habits: why you have them, why you can or cannot change them, and how they can work to help you live a great life.  </p>  <p>  \tImplementing habitual behavior in accordance with this program<strong> will help you become happier and more successful, will improve your wellbeing, and will assist you in living the lif</strong></p><p><strong>  </strong></p><p>Everything you want to achieve in life--<strong>from a successful career, thriving relationships, improved health, or simply increase your happiness and wellbeing—everything starts with habits. Everything!</strong> </p>  <p>If your goal is to <strong>double your income, get a new job, do well on an interview, lose weight, gain weight, start exercising, start meditating, improve relationships, change your diet, become happier</strong> – or anything else in life – <strong>this course is for you. </strong></p>  <p>This program is based on my bestselling book – <strong><em>Habits and Happiness: How to Become Happier and Improve Your Wellbeing by Changing Your Habits</em></strong>, my Habits and Happiness workshops, individual coaching sessions, and many years of helping others change their life for the better in the areas they believe are most necessary. </p>  <p>Regardless of what areas of your life need improvement – <strong>income, career, heath, relationships, spirituality or anything else </strong>- you can only make that happen by changing your habits. <strong>Click the \"take this course\" button, top right, now ... Enroll NOW to become happier and more successful.</strong>  </p>  <p>  \t<strong> </strong><strong>Every minute you delay is actually COSTING you...Happiness, Health, Success...</strong>  </p>  <p>  \t<strong>ENROLL NOW!</strong>  </p>", 
    "end_date": null, 
    "title": "Habits and Happiness|Routines|Science of Positive Psychology", 
    "price": "20.00", 
    "instructors": "Braco Pobric, NLP, Positive Psychology Coach Patrick Howell", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326958_1502_5.jpg", 
    "course_url": "https://www.udemy.com/habitsandhappiness/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-25T11:46:39Z"
}