{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong><em>++++++++++++++++++++++++++++++++++++++++++++++++++++++</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>Note: Over 2,400 students since the course was published and Great Reviews<strong><em></em></strong></em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>We are one of the top Udemy Instructors in the Personal Development Field. our courses have been taken by over 21,000 happy students from 159 Countries.</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em></em></strong><strong></strong><strong><em>We have a thriving community in the course and we are actively involved and answer questions within 24h.</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Discover the keys to finding happiness in everyday life, no matter what obstacles  you may be facing. </strong>In this course, you'll \nlearn how other people's beliefs and desires affect your own, how to \neliminate unwanted parts of your identity, how time affects happiness, \nhow to free yourself of negative patterns, and solutions to help you \ncontrol your emotions and create happiness in any moment--GUARANTEED! With newfound awareness, you can develop better \ncoping skills for day-to-day stressors and make decisions that bring you\n happiness and success in life.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why Happiness? Many studies have demonstrated that happiness:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Can double your critical thinking skills, problem solving, and creativity. </li><li>Can boost your immune system and cardiovascular health </li><li>Live longer</li><li>More fulfilling and longer lasting relationships</li><li>Receive work promotions more often</li><li>More balance in life </li><li>And many more positive side effects of happiness </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>*****NOTE: There is an advanced version of \nthis course available for life coaches called Happiness Life Coach \nCertification. The material in this course is also included in the \ncertification course. Therefore, taking both would be redundant.*****</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will give you the 6 simple, proven keys to experiencing TRUE happiness in your daily life, now matter what’s going on around you. You’ve heard that true happiness comes from within… so, are you ready to UNLEASH it? Instructor Joeel A. Rivera, M.Ed. is finishing a study about happiness (for his Ph.D. in Psychology) and wants to share his powerful findings and experience with you!  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t“Throughout my youth I had the opportunity to see life through many different lenses. Moving every six months, I saw and lived in two worlds—a world of poverty and a world of wealth. I found that regardless of what world we each live in, we all want to experience the same thing—happiness. After failing my first year of college, my brother passed away, and I was reawakened with a new purpose to discover what creates true happiness—internal peace and joy—regardless of what we are experiencing in our life. This led me back to school, where I successfully received my Bachelor, Masters, and now Ph.D. in psychology. My co-instructor Natalie and I have dedicated more than 18 years, combined, academically and professionally to understanding what creates true happiness and teaching others how to create it in their lives. Our life purpose it to help you and others experience more happiness and joy on a daily bases, which is what lead us to create Transformation Services, Inc., Transformation Magazine, and our courses, programs, and coaching. The information in this course is not just based on life experience; it is based on what research from around the world has demonstrated to be the keys to experiencing true happiness.”  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tThis course is for you if:  </p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>You want to know the secrets to finding happiness or      peace NO MATTER WHAT is going on around you\n\n</li><li>You want to identify the beliefs and patterns you have      that are causing your unhappiness and change them.\n\n</li></ul>\n\n\n\n<ul><li>You want to stop living everyone else’ dreams, and      feeling unfulfilled, and instead embrace your own true path to happiness.\n\n</li><li>You want to learn tools to help you choose your      emotions and feel good in any moment.\n\n</li></ul>", 
    "end_date": null, 
    "title": "Happiness Guaranteed", 
    "price": "20.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/84778_86e1_6.jpg", 
    "course_url": "https://www.udemy.com/unleash-your-joy/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-28T01:26:54Z"
}