{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>+++++++++++<br></em></p>\n\n<p><strong><em>Note: Over 2,000 students since the course was published a few months ago-and over 80+ Great Reviews.<strong><em>See what students are saying in the review section. </em></strong></em></strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>We are one of the top Udemy Instructors in the Personal Development Field. Our courses have been taken by over 21,000 happy students from 159 Countries.</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>We have a thriving community in the course and we are actively involved and answer questions within 24h.</em></strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em><strong><em>The course also has a thriving Facebook networking group </em></strong><br></em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em></em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>+++++++++++</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Help your clients find happiness in everyday life, no matter what obstacles  they may be facing. </strong>This\n training program is designed to help you work with  clients to peel off\n the layers of limiting beliefs, negative patterns, and old  \nprogramming—empowering them to unleash their happiness from within! \n With newfound awareness, you can help your  clients (and yourself) \ndevelop better coping skills for day-to-day stressors  and make \ndecisions that bring happiness and success in life.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Not only will you learn powerful tools and concepts for creating happiness in your own life, you'll also learn proven strategies to COACH YOUR CLIENTS as a Certified Happiness Life Coach, adding credibility to your brand and profits to your bottom line.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By having the Happiness Coach Certification under your belt (and the official seal on your marketing material) you'll be giving yourself the credit you deserve for the important work you do.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>IS THIS PROGRAM FOR ME??</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>We understand this certification course is not for everyone, therefor it may not be applicable to you. So to narrow it down, this course may be for you:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li> If you have a passion to help others improve their lives and be more happy</li><li>If you are a counselor, life coach, speaker, teacher or other professional who works with people and you want to enhance the service you provide</li><li> If you like to have a structure to follow and step by step system with proven results</li><li> If you want to be able to give clients something concrete that they can work on</li><li> If you are a presenter, workshop facilitator or speaker and want to add additional tools to your offerings and services</li><li> If you want to expand your credibility through being a Certified Happiness Life Coach</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why Happiness?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Because it’s a choice and a gift we can give to       ourselves and clients! It will not only benefit our clients'       well being, it will increase the positive outcome of whatever else       they are trying to achieve through life coaching.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Many studies have demonstrated that happiness:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>       <li>Doubles your critical thinking skills, problem solving         ability, and creativity</li>       <li>Boosts your immune system and cardiovascular health </li>       <li>Extends life expectancy </li>       <li>Creates more fulfilling and longer lasting relationships</li>       <li>Creates more balance in life </li>       <li>Even helps individuals receive          work promotions more often</li>       <li>And many more positive side effects!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Do you want to help your clients feel inspired with life? Help them stop letting stress and other people zap their joy! This course will give you the 6 simple, proven keys to helping your clients experience TRUE happiness in their daily life, no matter what’s going on around them. You’ve heard that true happiness comes from within… so, are you ready to help others UNLEASH it? Instructor Joeel A. Rivera, M.Ed. is finishing a study about happiness (for his Ph.D. in Psychology) and wants to share his powerful findings and experience with you! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>“Throughout my youth I had the opportunity to see life through many different lenses. Moving every six months, I saw and lived in two worlds—a world of poverty and a world of wealth. I found that regardless of what world we each live in, we all want to experience the same thing—happiness. After failing my first year of college, my brother passed away, and I was reawakened with a new purpose to discover what creates true happiness—internal peace and joy—regardless of what we are experiencing in our life. This led me back to school, where I successfully received my Bachelor, Masters, and now Ph.D. in psychology. My co-instructor Natalie and I have dedicated more than 18 years, combined, academically and professionally to understanding what creates true happiness and teaching others how to create it in their lives. Our life purpose it to help you and others experience more happiness and joy on a daily bases, which is what lead us to create Transformation Services, Inc., Transformation Magazine, and our courses, programs, and life coaching which have reached tens of thousands of people from over 145 countries. The information in this course is not just based on life experience; it is based on what research from around the world has demonstrated to be the keys to experiencing true happiness.”</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>This course will help your clients: </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Experience more joy and happiness on a daily bases, no matter what!</li><li>Help them let go of old patterns and belief systems and replace them with empowering ones!</li><li>Help them to stop living everyone else’ dreams and embrace their true path!</li><li>Help them control their emotions (so they can feel good NOW) instead of their emotions controlling them!</li><li>Help them to live a life of purpose and be their authentic self!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>STUDENTS WHO COMPLETE EVERY LESSON IN THIS COURSE WILL RECEIVE AN <strong>OFFICIAL CERTIFICATION FROM TRANSFORMATION SERVICES, INC., AS WELL AS THE CERTIFIED HAPPINESS LIFE COACH LOGO</strong> TO USE IN HIS/HER MARKETING MATERIAL. SEE THE FINAL LESSON IN THIS COURSE FOR INSTRUCTIONS.<br></p>", 
    "end_date": null, 
    "title": "Happiness Life Coach Certification ", 
    "price": "30.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673484_bbc7.jpg", 
    "course_url": "https://www.udemy.com/happiness-life-coach-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T16:23:56Z"
}