{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>UPDATE: Now with full English subtitles!</strong><br></p>\n\n<p>You're about to understand the simple things that can transform your happiness and sense of well-being. For centuries, people have been trying to figure out what it takes to live the good life. It might seem like a question that will always be up for debate among philosophers, <strong>but science has some answers.</strong></p>\n\n<p>Recent research in <strong>psychology and neuroscience</strong> have uncovered reliable strategies that people can use to be happier. We know way more about who's living a satisfying life and why. I'm a social psychologist, and I've done an extensive review of these research studies to show you what works.</p>\n\n\n\n\n\n<p>This course keeps things simple by highlighting <strong>5 simple things that you can do <em>today</em> to increase your happiness and well-being</strong>. Everything you're about to learn comes from documented, peer-reviewed research in psychological science.</p>\n\n\n\n\n\n<p>Happier people enjoy a bunch of other benefits ranging from workplace success to better social lives. So what do you have to lose? Enroll in this course now to get a quick introduction to this fascinating and valuable topic.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><em>This course is a special selection of lectures on the psychology of happiness. For a more advanced course, please check out “Be Happier with Positive Psychology,\" available here on Udemy.</em></p>", 
    "end_date": null, 
    "title": "Happiness Psychology: 5 Proven Tips", 
    "price": 0, 
    "instructors": "Andrew Luttrell", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/836302_3bc3.jpg", 
    "course_url": "https://www.udemy.com/psychology-happiness/", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-30T20:40:15Z"
}