{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is for any person who is now, or plans on, receiving therapy, hypnotherapy or psychotherapy services for any purpose. The course is delivered in a fashion analogous to your therapy sessions themselves: you will feel as though you are sitting across a hypnotherapist who is explaining to you how to maximize the benefits of each of your sessions, and the process as a whole.</p><p>For many years we noticed that not all students in our\nhypnotherapy classes intended to practice the profession. When asked, they said\nthat they wanted to improve their understanding of themselves or of the\nhypnotherapy process itself. Despite the obvious need for a course designed for\nthe current or prospective user, or consumer, of hypnotherapy, we could find\nnone.</p><p>This course therefore meets an important need. As\nhypnotherapy becomes more mainstream each day, and a more important tool used\nby millions in the improvement of their lives and the resolution of problems,\nit becomes imperative to maximize the utility of the clinical encounter and\nprocess. To that end, professional hypnotherapists all over the world are\nadvancing their skills to unprecedented levels.</p><p>When clients understand the process of therapy more\nclearly, they participate actively in the achievement of their goals and\nresolution of their problems. Therein lies the struggle for the client, however:\nfinding the right balance between surrendering to the process and micromanaging\neach aspects of it.</p><p>This is where this course excels, in giving you some broad\nideas to ponder upon, to reflect, to think about that will help you find that\ncenter for you. </p><p>This course is about what you can do to maximize the\nbenefit of any therapy for you. By taking this course you will be more likely to achieve your purpose for your therapy, feel good about yourself while in therapy, and absolutely save a whole lot of time, money and frustration. A must for anyone contemplating therapy, or currently in therapy.</p><p>Your instructor, since 1996, has done over 31000 therapy sessions with over 7000 clients and had over 3000 students.  </p>", 
    "end_date": null, 
    "title": "How to get what you want through therapy and hypnotherapy", 
    "price": "30.00", 
    "instructors": "Flavio Souza-Campos, Ph.D.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708766_469e_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-succeed-in-therapy-hypnotherapy-and-psychotherapy/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T17:57:38Z"
}