{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Think you can't buy happiness? Nonsense! If we can create misery by mismanaging money (and we all know that we can), then you can certainly enhance your life satisfaction by using money to create a better life for yourself. Learn how temptation and impulse often lead us astray, and how to use your own life history as a guide for the future. Implement concrete strategies to get out of debt, grow your disposable income, and create a cushion of life-enhancing savings. Then use these to make purchases that really count toward the enhancement of your mood and your life. Whatever your income level, you can create change that reduces your stress level, gives you more breathing room, and transports you toward your highest aspirations.</p><p>In order to buy happiness, though, you actually have to BUY HAPPINESS. You can't just spend a lot of money and expect to get happiness as a bonus, like a toy at the bottom of a cereal box. Join us on this journey and you will comb through your expenses, your bills, your debts, and your own past to develop a personalized plan for a better life. Along the way you'll work through a series of exercises in the accompanying 58-page workbook (included with the course). </p><p>One of your instructor's paths to happiness is providing courses that are worth far more in terms of life satisfaction than people pay. So please remember this site's guarantee: If within 30 days you think the course isn't worth what you've spent, you can get a complete refund - no questions asked. So get out your financial records, sharpen up your pencil, and let's get started!</p>", 
    "end_date": null, 
    "title": "How to Buy Happiness", 
    "price": "30.00", 
    "instructors": "Randy Paterson", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569482_8944.jpg", 
    "course_url": "https://www.udemy.com/how-to-buy-happiness/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T18:07:28Z"
}