{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hello and thank you for your interest in this course. I have seen, read, and watched a number of self-help books, shows, and videos from which none impacted my life. I was sadly disappointed that there is not much on genuinely transforming one's life. </p><p>This course explains happiness, without any monetary component. In fact money or no money, this course is geared to get your inner mind thinking, so that no matter what your physical state, or location, you can become happy all the time. </p><p>I have spent over 7 years, developing the material in this course. In fact over 20 years of experience, personally dealing with my own issues I was trying to solve. </p><p>I began a young kid, and though my parents, unintentionally had a number of bad patterns and beliefs installed in my head. It was not until I was in my late 20s, and early 30s when i started to even realize this. I was so good as discrediting myself, that I was rarely motivated to do anything, and sank into depression for months at a time. For me, happy to shutdown was only a matter of seconds, and any happiness that i experienced was quickly gone. </p><p>Initially I was not trying to find happiness, but a way to get past depression, and being shutdown. I wanted a way to get ahead in life, and to get away from the harsh self-critical life I had been living. Marriage for me, had not helped this, and when that marriage ended in unresolvable conflict, and divorce, I was forced to look inside myself, and start figuring out what went wrong, and who I was. </p><p>Over the next few years, I would spend an enormous amount of time in self-reflection, until I started learning these keys. The keys that I have presented here, took 7 years to discover. I learned them one by one, and applied them as soon as I learned them, Though that 7 year period, I got back control of my life, let go of depression, and turned around into the happy outlook that I have today.</p><p>I made a great change, and if you have struggled with depression, sadness, defeat, easily frustrated, and a number of other things, than my hope is for you, that you will be able to transform your life though these keys and lessons, and that you will experience real and genuine change. Just as I did, I believe you can do it too. </p><p>I did this course using video lessons. I did this because I wanted to convey to you exactly how it feels, and how it should feel when you reach the keys that I am talking about. When you read a book, and they say do this or do that, you never really know when you have accomplished what you were instructed to do. I made this course specifically so that you would know when you get to the key. You would know because I explain to you what it feels like, what you think like, how it changes you. I teach you what to look for and how to look for it. </p><p>Enroll now, and start transforming your life. I know you can do it. I remember I went through a long journey, a journey I never felt I would see the other side of. I know it looks daunting and overwhelming, but if you have a desire to become happy, then you have made the first steps to getting there. Enroll now, and I'll see you on the next lesson.<br></p>", 
    "end_date": null, 
    "title": "How to Be Happy All the Time", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/602000_f59b_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-happy-all-the-time/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T23:59:44Z"
}