{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Wingsuit skydiving is usually considered a high-risk activity, yet nowadays many people engage in it without being injured. While the motives for participating vary greatly, most of us love how flying enables us to participate intensely in the universal experience of being alive. Through flying we learn to manage risks, overcome our fears and build confidence. As a result of these enriching experiences, we expand our freedom and realize a great potential to achieve our wildest dreams.</p><p>Most people have seen thrill-seekers leaping off cliffs or jumping out of airplanes, but they may think this is something only a few people can achieve. That is not entirely true, and such a misconception may be caused by not knowing where to start and what steps to follow in order to become a wingsuit pilot.<strong style=\"\"> But with proper training and a step-by-step approach, flying a wingsuit becomes realistic and attainable for almost all of us.</strong> This step-by-step guide is designed to cover a range of subjects aimed to help you get into skydiving and wingsuit flying as fast and as safely as possible. </p><p>First, I'll show you how to prepare for your first jumps and which exercises you should perform before your skydiving course. <strong style=\"\">Practicing these exercises will help you tremendously in your skydiving activities and will increase the safety of the jumps because you'll have more control over your body during freefall.</strong> </p><p>After that, we'll look at the accelerated freefall course and go through all the levels of this course. Then we'll look at how to pack your own parachute and how to finance your skydives with simple packjobs.<strong style=\"\"> It's very easy to learn and you can earn up to $200 a day by packing parachutes.</strong> Finally, I will show you some more advanced exercises in order to prepare you for your first wingsuit flight.</p>I'm very excited for you to begin this amazing journey!", 
    "end_date": null, 
    "title": "How To Become a Wingsuit Skydiver", 
    "price": "20.00", 
    "instructors": "Ali Sina Alizay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512946_20ae_12.jpg", 
    "course_url": "https://www.udemy.com/wingsuit/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T17:00:19Z"
}