{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Hypnosis- Overcome Baldness Using Self Hypnosis' By Pradeep Aggarwal , you will learn -</p><p>Hair loss is one of the fastest growing problems all over the world. It affects both men and women of any age group. Hair loss or baldness can decrease self-esteem and confidence, and limit one's ability to enjoy life to the fullest.<br></p><p>There are many reasons behind hair loss and baldness like hormonal problems, aging and health conditions. Apart from the various physical reasons, there may be many psychological factors responsible for hair loss and baldness. This course is designed to help both men and women to overcome the problem of hair loss and baldness using Self Hypnosis, Imagery and Affirmations.</p><p><strong>Psychological Reasons for Baldness or Hair Loss</strong></p><ul><li>Stress<strong></strong></li> <li>Anxiety, Depression<strong></strong></li> <li>Tension<strong></strong></li> <li>Wrong programming of the subconscious mind</li></ul><div>By the end of the course you will overcome all the psychological barriers to baldness and feel more confident and happy. You will be able to give yourself positive vibes and suggestions and not let hair problems and baldness affect your personality.</div><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 9 lectures in English including a bonus E-book</p>", 
    "end_date": null, 
    "title": "Hypnosis- Overcome Baldness Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611466_714d_2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-overcome-baldness-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T08:30:19Z"
}