{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">In this course titled &#039;<strong style=\"\">Hypnosis- Control Your Anger With Self Hypnosis</strong>&#039;Pradeep Aggarwal , you will learn -</p><p style=\"\">Anger produces many dangerous effects on our body. The body reacts to anger by increasing respiratory rate, pulse rate and blood to the muscles that moves the body&#039;s bones. It also constricts the pupils of the eyes, pumps out hormones from the adrenal gland. Now, with so many adverse effects of anger, it is neither good to express the anger loudly nor to suppress the anger. With self hypnosis you can program your subconscious mind to change the negative programming to positive easily.</p><p style=\"\">Using self hypnosis and visualizations you can overcome any rage and anger from your mind which is causing you problems to achieve success and your goals by changing the negative and wrong programming in your mind.</p><p style=\"\">This course is ideal for people who have a short temper and are unable to control their anger and rage in important situations of life and are causing themselves mental and physical harm.</p><p style=\"\">It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p style=\"\">This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English and bonus material.</p>", 
    "end_date": null, 
    "title": "Hypnosis- Control Your Anger With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589148_122d.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-control-your-anger-with-self-hypnosis2/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T05:51:27Z"
}