{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p>\n\n<p>Hypnosis for Improving your world and life guided Hypnosis has been created to give you a stimulated results based experience of a private Hypnosis session here with me.</p><p><strong></strong></p>\n\n<p>Learn how to change how think and feel about life and live life more as if your life is half full this is the course for you and even though it is a simulated Hypnosis therapy experience you are going to learn how much your life will change by learning a new way to look at the world around you. Because you are changing your perception and to change your perception you have to teach your subconscious to change the filters it used to make sense of life around you.</p>\n\n\n\n<p>Hypnosis is natures gift that allows you to offer new positive ideas to your subconscious mind that will help to change your perception. But not only that in this course I am going to introduce you to a simple to learn and apply technique call EFT in the bonus section that will help you to overcome many of life's limitations.</p>\n\n\n\n<p><strong> <em>What I will teach you in this Hypnosis course</em></strong></p>\n\n\n\n<p><strong><em>1. Learn how to get the best results from hypnosis</em></strong></p>\n\n\n\n<p><strong><em>2. learn how your mind and body work together with a fun but important lesson that will improve the results of this hypnotherapy session.</em></strong></p>\n\n\n\n<p><strong><em>3.  Learn who can and cannot be hypnotized</em></strong></p>\n\n\n\n<p><strong><em>4.  Hypnosis course bonus section</em></strong></p>\n\n\n\n<p><em><strong>How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings that have been stopping you from feeling great</strong></em></p>", 
    "end_date": null, 
    "title": "Hypnosis for Improving your world and life guided Hypnosis", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433966_28f0.jpg", 
    "course_url": "https://www.udemy.com/improve-your-life-with-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T11:30:12Z"
}