{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis- Attract Love Using Powerful Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><li>Love,\nindeed, is one of the most beautiful experiences and life's greatest blessing. Everybody\nwants love and enjoy being loved. But many times it happens people fail to\nattract love. The reasons could be a pain from a past failed relationship, fear\nof rejection, loss of a loved one or loneliness. All these factors keep you\naway and separate from people you love. Pain, fear and loneliness are all state\nof mind and self hypnosis is one of the powerful tools to program our\nsubconscious mind and change our state of mind from negative to positive.\n\n\n\nThis video\ncourse is designed to help you to attract love including love to yourself.\nLearn how to create an atmosphere of love in your life. Program your mind to love\nyourself, be open to love and enjoy the feeling of being loved.</li></ul><p>This course is ideal for people who have gone through a heart break and are looking to attract love in their life to overcome the pain and loneliness they have suffered in their life.</p><p>By taking this course they will be able to psychologically attract the love of their life and live happily.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English.</p>", 
    "end_date": null, 
    "title": "Hypnosis- Attract Love Using Powerful Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582732_4a8e.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-attract-love-using-powerful-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T05:20:02Z"
}