{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>¿QUIERES SABER CÓMO DESARROLLAR UNA ACTITUD POSITIVA QUE TE AYUDE A ESTAR BIEN A PESAR DE LAS CIRCUNSTANCIAS QUE TE RODEAN Y CON ESTO, LA OPORTUNIDAD DE SER MÁS FELIZ?</strong>\n\n</p>\n\n<p>Todo el mundo nos dice constantemente que la vida es cuestión de actitud, pero nadie nos dice cómo obtenerla ¿verdad? Lo mismo es con la felicidad, sabemos que queremos ser felices, pero quizás no siempre tenemos claro que significa esto exactamente y mucho menos lo que hay que hacer para lograrlo.\n\n</p>\n\n\n\n\n\n<p>Con esto en mente y con el objetivo de darle un poco de forma a conceptos tan amplios y abstractos y poder transmitir esto de forma clara y sin tantos rollos y complicaciones, creé este curso. \n\n</p>\n\n\n\n\n\n<p>¿PARA QUIÉN ES ESTE CURSO?\n\n</p>\n\n\n\n\n\n<p>Es para todos aquellos que finalmente quieran tener claro esto de “todo en la vida es cuestión de actitud positiva” y aprender cómo desarrollar una actitud para que no solo les ayude a estar bien a pesar de las circunstancias que les rodean, sino que más importante aún, sea el camino que los llevará a ver y a entender de forma clara y concisa que es la felicidad para cada uno de ellos (todos somos diferentes) y lo que necesitan para obtenerla. \n\n</p>\n\n\n\n\n\n<p>Así mismo, este taller también es para todos aquellos que se sientan identificados con uno o más de los siguientes puntos:\n\n</p>\n\n\n\n\n\n<ul><li>Cansado de no lograr la felicidad que tanto deseas.\n\n</li><li>Tienes una actitud negativa de vida y/o estás \n\nrodeado de negatividad.\n\n</li><li>No avanzas y te cuesta lograr lo que quieres en tu \n\nvida.\n\n</li><li>No acabas de tener a ese alguien especial a tu lado.\n\n</li><li>Le falta algo a tu vida y no acabs de saber qué \n\nes.\n\n</li><li>El miedo y la indecisión controlan tu vida.\n\n</li><li>Necesitas mejorar tus relaciones (pareja, laboral, etc.) \n\npero no sabes cómo hacerlo.\n\n</li><li>Simplemente tan solo necesitas un empujoncito para \n\nsalir adelante.\n\n</li></ul>\n\n\n\n\n\n<p>Si has tomado la decisión de hacer algo al respecto, de tomar acciones para cambiar o potenciar tu vida y sobre todo controlarla, entonces te propongo que te apuntes a este taller, donde de una forma amena y con ejercicios prácticos sobre ti, te daré las sencillas pero poderosas recomendaciones que han logrado impactar positivamente a todas las personas que han asistido, por los resultados obtenidos. \n\n</p>\n\n\n\n\n\n<p>¿QUÉ VAS A APRENDER EN ESTE CURSO?<br></p>\n\n\n\n\n\n<ul><li>Autodescubrimiento de tu “Yo 1.0”. Un método sencillo con el que podrás descubrir lo que realmente necesitas y motiva.</li><li>El rol de tu subconsciente, los hábitos y cómo podemos reprogramarnos para el éxito.</li><li>Tu felicidad: dónde estás y adónde quieres llegar.</li><li>Significado de tener una actitud positiva de vida.</li><li>Tú y tus relaciones.</li><li>Lidiar con la adversidad.</li><li>Gestionar mejor tu tiempo.</li><li>Cómo ser más optimista.</li><li>Cómo vencer al miedo y la indecisión.</li><li>Cómo tener metas y proyectos para ganar más autoestima y confianza en ti mismo.</li><li>Cómo está tu actitud de vida HOY, qué tienes y qué te falta.</li></ul>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Hábitos para desarrollar una ACTITUD POSITIVA para siempre", 
    "price": "20.00", 
    "instructors": "Reinaldo Hoffman Lange", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833818_8dc7_5.jpg", 
    "course_url": "https://www.udemy.com/yo-estoy-bieny-tu/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T19:51:21Z"
}