{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Join over 1,000 students who are boosting the quality of their lives with gratitude.</strong>  </p>  <p style=\"\">  \t      I'm sure you have heard of gratitude, being thankful for what you have, but <strong style=\"\">are you aware of how powerful a thought or feeling of gratitude can be?</strong>  </p>  <p style=\"\">  \t      In this course we will <strong style=\"\">explore gratitude from a spiritual, energetic, and scientific perspective.</strong>  </p>  <p style=\"\">  \t            Whether you've been keeping a gratitude journal for years, once had a gratitude practice but have stopped, or even if you think the notion of gratitude having any effect on your life is utter nonsense I invite you to join me. <strong style=\"\">You will take part in a number of journaling exercises and learn simple rituals you can use on a daily basis to bring about an attitude of gratitude in your life</strong>. I'll share my story later, but let me say up front that everything I'll teach you is something I used to think was a ridiculous waste of time - that is until I tried it.  </p>  <p style=\"\">  \t<strong style=\"\">I will share with you scientific studies from the field of Positive Psychology proving the amazing power of gratitude on your health, happiness, relationships and well being.</strong> You don't have to believe I word I say, just be intrigued enough to put some of the practices I'll share with you to work and then decide for yourself.  </p>", 
    "end_date": null, 
    "title": "Improve Your Life and Happiness with the Power of Gratitude", 
    "price": "20.00", 
    "instructors": "Andy Grant", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/82940_dd86_7.jpg", 
    "course_url": "https://www.udemy.com/the-power-of-gratitude/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-23T23:56:41Z"
}