{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled ' <strong>Improve Your Personal Life With 15 Positive Techniques.'</strong> By Pradeep Aggarwal you will learn -</p><p>15 simple positive techniques to improve your personal life and open your mind to positive thinking.</p>You will learn the 15 positive techniques that are required to enhance and improve your personal life and give you the desired results and success in your life.<p><br></p><p>This course helps you to reshape your mindset and help you to look at life in a much healthier way without focusing on the negatives.<br></p><p>You will also learn how to carefully observe others and understand people around you.</p><p>You will learn how to ease up on yourself and start appreciating the positive aspects instead of focusing on the negative ones.</p><p>In this lesson, you will learn the importance of hypnosis and meditation in your life. Hypnosis and meditation have exercises, which are great for the mind, body and soul. </p><p>This course is ideal for people who are having a troubled life and are unable to cope up with negativity , stress, anxiety , fear of success , frustration etc. </p><p>By taking this course you will be happier and more positive than before and lead a very happy stress free life full of confidence and instant relaxation.</p><p>This course is in English and contains more than 15 live recorded videos.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Improve Your Personal Life With 15 Positive Techniques", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690882_4cd8_2.jpg", 
    "course_url": "https://www.udemy.com/improve-your-personal-life-with-15-positive-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T09:37:12Z"
}