{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t       When your personal energy levels are high, you can get things done, will feel good, sleep well, and it&#039;s easier to stay healthy.  </p>  <p>  \t  When your energy levels are low, you probably want to nap, find a rock to crawl under, will lose your car keys, and may even chronically struggle to get things done.  Worse, you&#039;ll wonder what happened to your life.  And your family life and relationships will also suffer.  </p>  <p>  \t       If your energy levels are low more often than you&#039;d like, you&#039;re not alone.  Over 80% of people tell their doctors that they are often tired.  You may even be one of them.  That&#039;s why there&#039;s already over 820 students who have already signed up for this course.  </p>  <p>  \t Yes, you can improve the food you eat, make lifestyle and career changes.  You may even stop hanging out with people who pull you down.  But it&#039;s not until you decide to change what you think about and how you feel that you are going to be able to increase your energy on an ongoing basis.  </p>  <p>  \t In this course, you&#039;re going to find out how to use small blocks of time over the course of your average day so that you can re-train the way you think and feel.  You will discover how you can actually stay positive for longer and longer periods of time.  The best part is that you will be able to reduce the amount of time that you might spend being negative.  And all you have to do is change your mind and decide to be happy more often.  </p>  <p>  \t Increase Energy for Your Life gives you practical, useful tools to change the quality of your feelings and thoughts so that you can recharge your personal battery.  It only takes 30 seconds to 2 minutes each time to change and improve your personal energy patterns, vibes, and your resulting energy levels.  This course covers:  </p>  <ul style=\"\">  \t<li>Why your current thoughts and emotions may cause you to &#039;leak&#039; energy.    </li>  \t<li>What you can do to &#039;pivot&#039; and upshift from negative mental chatter to a positive mindset in 3 to 60 seconds.</li>  \t<li>How to stop stealing your own energy from yourself.</li>  </ul>  <p>  \t This course helps you get into the habit of self-generating more positive thoughts and feelings.  And you will discover how to ask yourself the right questions to get positive answers so you can get your energy moving again.  </p>  <p>  \t Increase Energy&#039;s simple tips will help you remember to:  </p>  <ul style=\"\">  \t<li>Use positive self-talk to raise your vibes (a.k.a. vibratory frequency).</li>  \t<li>Increase the number of positive &#039;now&#039; moments you have daily.</li>  \t<li>And be able to stay in your personal paradise -- the one conveniently located in the 7-inch space between your ears -- more often.</li>  </ul>  <p>  \t       Increase Energy for Your Life was developed on the principles covered in my best selling book, Energy for Your Life.  My courses have already helped thousands of people in North America and Europe.  </p>  <ul style=\"\">  \t<li>Some people used the materials to stop being tired.  </li>  \t<li>Others improved their health.  </li>  \t<li>Most decided to use the insights they learned about themselves and the way they use their personal energy to improve their relationships.  </li>  </ul>  <p>  \t I&#039;ve even coached and consulted with elite athletes and a few CEO&#039;s and billionaires so they would get the results they wanted.  </p>  <p>  \t   In your own life, you&#039;ll be able to improve your energy  in small, manageable blocks of time.  You&#039;ll never get overwhelmed.  You don&#039;t ever have to get down on yourself because you &#039;forgot&#039; one day.  Or became too busy one week.  </p>  <p>  \t You&#039;ll always be able to find time to do this because it is now only simple but life changing - in a good way.  Every time you can improve the quality of your thoughts, you win.  Your family, friends, people you work and your community also win.  And you get to decide when, where, how and how much you can and will do.  So you never need to feel any pressure.  </p>  <p>  \t And here&#039;s why I know you will be able to remember how and what to do:  </p>  <ul style=\"\">  \t<li>You&#039;ll only need to remember three words to start to get yourself into a positive vibe.  </li>  \t<li>You already know the 5W&#039;s that Socrates used -- who, what, when, where why and how.  I&#039;ll simply give you a new spin on an old technique that will help lift you up and let you move your life forward in positive ways.  </li>  \t<li>You&#039;ll be able to get out of a negative situation whenever you want so you can create and live the life you want instead.  </li>  </ul>  <p>  \t Any and every day you want, you&#039;ll be able to use and benefit from this course and the supporting materials.  Plus, I&#039;m here to answer your questions.  </p>  <p>  \t Plus, if you are ready to be more positive, you&#039;ll find out how to:  </p>  <ul style=\"\">  \t<li>Use and stay in your now moments more often to access high octane, positively-charged energy.</li>  \t<li>Stop wasting as much time living in your past. </li>  \t<li>Stop thinking about your future and not doing anything about it.</li>  \t<li>Become and stay happy for longer periods of time.</li>  </ul>  <p>  \t Your desire to do this course is your only prerequisite.  You only need your computer, tablet or a mobile phone.  I recommend you keep a journal when you first start this course.  Sometimes, being able to write down what we did to release a negative thought or feeling can help us understand why we were having those experiences in the first place.  </p>  <p>  \t The course has two parts:  the lectures that you&#039;ll do online. Then, you get to apply what you&#039;ll explore here so you can experience 30 positive moments daily.  If you need to, you can access any one of the reminder lectures on your mobile phone.  </p>  <p>  \t What happened to me after doing this is that I&#039;ve been able to emotionally bounce back faster after a rough meeting.  If someone was rude or upset me, I could get out of their vibe and back into my own faster.  I was also be able to stay calm when dealing with people who were not very calm or kind.  It&#039;s also helped me stay in a good mood - even if things didn&#039;t work out as I&#039;d hoped.  </p>  <p>  \t You&#039;ll spend 20 seconds to one minute to two minutes spread out over your entire day. You won&#039;t have to &#039;squeeze&#039; in the time to do this course.  You can do it during most of the activities that you already do.  </p>  <p>  \t I&#039;ve done what I&#039;ll share with you in this course:  </p>  <ul style=\"\">  \t<li>at my desk, </li>  \t<li>during meetings, </li>  \t<li>while walking, </li>  \t<li>even while being on hold on the phone.  </li>  \t<li>curing commercial breaks at home, </li>  \t<li>while washing dishes, </li>  \t<li>waiting for buses, </li>  \t<li>and even standing in line waiting for my coffee or at baggage check.   </li>  </ul>  <p>  \t You can feel  more positive at any time during your day.  And you&#039;ll gain a usable way to shift your personal energy use habits so that you will feel good about what you can do in your life.  </p>  <p>  \t You&#039;ll want to take this course if you:  </p>  <ul style=\"\">  \t<li>feel tired more often than you&#039;d like.  </li>  \t<li>are still tired after you&#039;ve gone on vacation.</li>  \t<li>feel like you&#039;re stuck in negative patterns.</li>  \t<li>you don&#039;t like how you feel and the vibes you&#039;re experiencing in your life. </li>  \t<li>know that there&#039;s a better way to live and are ready to enjoy a new way of thinking and being.</li>  </ul>", 
    "end_date": null, 
    "title": "Increase Energy for Your Life: Be More Positive Daily", 
    "price": "20.00", 
    "instructors": "Julia Hidy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151702_83c2_3.jpg", 
    "course_url": "https://www.udemy.com/increase-energy-for-your-life-be-more-positive-daily/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T23:33:46Z"
}