{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t   Our 7 Mindsets MasterClass engages you through a series of short, empowering videos filled with inspirational and unconventional advice.  Each video is just 2-5 minutes long for <strong style=\"\">immediate application </strong>and<strong style=\"\"> long-term retention</strong>.  Each mindset is taught through 7 video modules, so you can learn a mindset and how to activate it in about 30 minutes.  </p>  <p>  \t  The 7 Mindsets MasterClass also includes <strong style=\"\">an editable Life Plan </strong>filled with activities to connect what you learn with your dreams and desires.  </p>  <p>  \t<strong style=\"\">Your Life Plan is the key to activating </strong><strong style=\"\">the 7 Mindsets in your daily life!</strong>  </p>  <p>  \t  The MasterClass is for <strong style=\"\">everyone in your immediate family</strong> – parents can share the information with young children, and teens and college students can watch the videos at their own pace and fill in their own custom Life Plans as well.  </p>  <p>  \t  - 55 short, empowering videos designed to teach you the 7 Mindsets and help you immediately implement them in your life  </p>  <p>  \t          - Our revolutionary 7 Mindsets Life Plan activity guide, which you can print out or fill in electronically as an editable PDF  </p>  <p>  \t          - Daily Morning Mindset emails with a thought to help center your day and activate the 7 Mindsets in your life  </p>  <p>  \t          - Weekly Mindset Message stories delivered via email every Wednesday to help inspire and empower your life with real examples of people living the 7 Mindsets all over the world  </p>  <p>  \t          - Engaging Podcasts featuring interviews with famous, successful individuals and leading thinkers on how to apply the 7 Mindsets in your life - listen online or download to your devices  </p>  <p>  \t          - A collection of the top 12 weekly stories that have inspired millions to join the Mindset Revolution  </p>  <p>  \t          - An extensive Resource section that includes a free Parent Guide containing 28 suggestions to help parents impart the 7 Mindsets to their children  </p>  <p>  \t          - Engagement with the worldwide 7 Mindsets community - Leave comments for others who&#039;ve also joined the Mindset Revolution, and post questions for the 7 Mindsets team.  You&#039;re not alone in this life-changing experience!  </p>  <p>  \t          - Special member pricing and invitations for other 7 Mindsets products, services and events like our annual Ultimate Life Summit.  </p>", 
    "end_date": null, 
    "title": "Learn the 7 Mindsets to live your Ultimate Life", 
    "price": "50.00", 
    "instructors": "Scott Shickler", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368290_09a6.jpg", 
    "course_url": "https://www.udemy.com/7mindsets/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T19:17:12Z"
}