{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn some easy techniques to increase your own self-love and watch your life improve. No matter where you are in your life right now, as you learn to respect, appreciate, and love yourself more and on a deeper level, other things in your life will make a positive shift too. </p><strong class=\"redactor-inline-converted\">Build Your Foundation To a Happier Life By Challenging Yourself To Take And Complete All The Actions In This Course</strong>         <br><ul><li>Understand that self-love is the foundation to happiness in your life</li><li>Identify areas that need your attention for you to feel emotionally free</li><li>Learn do-it-yourself tricks to quickly get yourself back on track</li><li>Find out how to love You the best</li><li>Recognize that love will grow exponentially and that you always must start with yourself</li></ul><p><strong class=\"redactor-inline-converted\"><br>LOVE THE REAL YOU<br></strong>In today's society we hear more and more about people being stressed out, depressed, and overwhelmed. More is expected of us with seemingly less time to do it. We are pressured to look a certain way and no matter how much we try we seem to fall short of these standards. This course will help You bypass all of this so that you can in fact love yourself just as you are today. Appreciate your uniqueness and be exactly who you were meant to be. <strong class=\"redactor-inline-converted\"><em>Know that you deserve love</em></strong>.   </p><p><strong class=\"redactor-inline-converted\">What you are getting in this course</strong><br>This course is divided into seven sections and includes <strong class=\"redactor-inline-converted\">lectures</strong> to go over specific topics related to the subject of love. Love isn't just a \"fluffy\" thing that people feel. Love has scientists and doctors engaged. Book after book have been written about the subject and there is more to love than just a feeling. This knowledge will help you understand why love is so important in your life and why it all starts with You. The lectures flows down into <strong class=\"redactor-inline-converted\">actions </strong>that will help you change your habits so that you can reap the benefits of love in your life as soon as possible. One important addition to this course is the <strong>EFT sections</strong>. EFT stands for 'Emotional Freedom Technique' and is an easy to learn technique I will teach you in order for you to get rid of blocks that may be holding you down. You see, if I tell you to look into the mirror and tell yourself that you are beautiful and nothing in you believes it; the exercise will most likely not work. With EFT we will change those beliefs and open ourselves up to love. In other words, with these combined techniques you will start to allow yourself to love yourself. </p><p>Not only will you walk away from this course with new knowledge about love but you will also feel the love inside and around you increase. </p><p>I can't wait to meet you and see you transform! <br>Much Love and Blessings<br>~Helena &lt;3     </p> ", 
    "end_date": null, 
    "title": "Learn to LOVE yourself and live a life of happiness", 
    "price": "35.00", 
    "instructors": "Helena Berggren", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729724_b9f5_2.jpg", 
    "course_url": "https://www.udemy.com/love-yourself-now/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-16T03:46:58Z"
}