{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Getting a life coach costs thousands of dollars every year. And the price is damn worth it.  </p>  <p>  \t      Having someone help you navigate your own mind with your best intentions in their heart is a beautiful exchange.  </p>  <p>  \t<strong style=\"\"><em style=\"\">But what if you could be your own coach?</em></strong>  </p>  <p>  \t      What if you knew the questions that could lead you into your most evolved, fulfilled and happy self?  </p>  <p>  \t      This course is designed to give you an edge in life. It is meant to pull you out of mindsets that aren’t working for you. It is to give you answers you may not have found otherwise.  </p>  <p>  \t<strong style=\"\">Discover your brain power!</strong>  </p>  <p>  \t      You have a whole other level of consciousness you may not be connecting with. You have a divine intelligence that you could tap into in order to grow exponentially and positively impact the world around you.  </p>  <p>  \t<strong style=\"\">Feel more empowered than ever!</strong>  </p>  <p>  \t      These questions will help you take all your power back! You will never feel ‘blamey’ again. But you <em style=\"\">will</em> feel like a <strong style=\"\">master creator</strong>.  </p>  <p>  \t<strong style=\"\"><em style=\"\">Plus, this course will always be growing!</em></strong>  </p>  <p>  \t      There are literally hundreds of questions that can help you transform your life. Over the years you will rediscover which ones you love the most and learn new ones that you had never considered.  </p>  <p>  \t<strong style=\"\"><em style=\"\">And guess what? </em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">You are not alone in this!</em></strong>  </p>  <p>  \t      Gain even more insights from me in the discussion thread or message me any issue that you are struggling with- even after applying the questions of this course.  </p>  <p>  \t      This course is <em style=\"\">high value</em> for little listening time. Trade a few hours of your time for a lifetime of mental clarity and wisdom.  </p>  <p>  \t      If you value yourself and your life…  </p>  <p>  \t      If you believe you have untapped potential…  </p>  <p>  \t      If you are curious about life coaching…  </p>  <p>  \t<strong style=\"\">Click the Take This Course Button at the top of the page and never look back!</strong>  </p>  <p>  \t      *30 Day Money-Back Guarantee*  </p>  <p>  \t<em style=\"\">Free access </em>to all updates and future courses by me!  </p>", 
    "end_date": null, 
    "title": "Life Coach Yourself with these Important Questions", 
    "price": "20.00", 
    "instructors": "Becky Shortt", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399666_9026_3.jpg", 
    "course_url": "https://www.udemy.com/life-coach-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T02:16:55Z"
}