{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h5>ARE YOU READY TO LIVE YOUR BEST LIFE ABROAD?</h5>\r\n<p>\r\n\t                  Expat life can be tough. We know. We&#039;ve been there. You&#039;ve left  behind your family, your friends, your job, your identity, your  everything.\r\n</p>\r\n<p>\r\n\t                  Expat life is also an amazing opportunity. With the right tools and  the right kind of support, you can discover joy, growth, and fulfillment  in your new life abroad. YOU can create success.\r\n</p>\r\n<p>\r\n\t                  Are you ready to make the most of your  expat experience? Are you ready to let go of negativity, release your  fears, and conquer culture shock? Are you ready to build your  confidence, uncover your talents, and rediscover your authentic self? <strong>Are you ready to live the life of your dreams?</strong>\r\n</p>\r\n<p>\r\n\t This is the first of Expat Partner&#039;s Live Your Happiest Life Abroad series. You can enrol in each course separately, they will be all on Udemy!\r\n</p>\r\n<p>\r\n\tIn this first part, you will discover who you really are and clarify the results you desire in life.  There is power and enjoyment in discovering what is driving you, what is holding you back and how you can move forward.\r\n</p>\r\n<p>\r\n\t My goal is to make sure that you find out what really matters in your life and that you will use this program as a trigger, to find out where you are, what tools will get you to the next level, to give you each day a little push over the edge, to focus on what matters and get you take some actions so you can make things work.\r\n</p>\r\n<p>\r\n\t   You can do the course on your own pace.\r\n</p>\r\n<p>\r\n\t                  We use, Video teaching, Audio, Assignments and worksheets. And you can become a member of our closed Facebook group, a place where you can share your experiences.\r\n</p>\r\n<p>\r\n\t                  You can contact us for life coaching sessions, where we will explore what’s working, what’s not, and why. These sessions allow you to dig deeper and better understand where you want to focus your development and change.\r\n</p>", 
    "end_date": null, 
    "title": "Live your Happiest Life (Abroad)", 
    "price": "50.00", 
    "instructors": "Karlijn De Broeck", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42074_28c7_8.jpg", 
    "course_url": "https://www.udemy.com/live-your-happiest-life-abroad/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-17T12:02:30Z"
}