{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Emotions are a vast area of learning and <strong>emotions have the UNIQUE power</strong> to shift how you show up in all of your interactions, situations, events and conversations in your life. When you learn to <strong>harness the power of emotions</strong>, you can CHOOSE how to show up in conversations and learn to declare satisfaction and happiness in your life!</p><p>Use the <strong>generative power of languag</strong>e and work with your emotions to help you <strong>declare satisfaction and happiness with the outcomes and results of your interactions in life.</strong></p><ul><li>Understand the foundation of emotions.</li><li>Learn what it means to interpret emotions</li><li>Discover the stories and narratives around emotions that cause you to take certain actions.</li><li>Apply linguistic skills to get to the heart of your emotions</li></ul><p><strong>Discover a 3-Step Framework of working with the whole human being you are by exploring the connections between Body, Emotions and Language!</strong></p><p>I want to offer you a framework, a new perspective of the holistic and integrated human being that you are! This perspective may help to incorporate several concepts that you have come across in your quest for personal transformation and development.</p><p>The underlying concept is that of language and the resultant, subjective expression of emotions and movement; movement through actions, movement through thoughts and ideas. </p><p><strong>Course Contents And Overview</strong></p><p>This course contains <strong>63+ lectures and 4+ hours of content</strong>! It is designed for you if you want to take control of your emotions in your life. It is designed for you if you want to move past potentially “destructive” emotions and learn to declare satisfaction and happiness in your life.</p><p>The material in this course is what I use with my coaching clients so if you are curious about learning to coach yourself from observing your thoughts, ideas and body while exploring emotions, this course is for you!</p><p>I strongly believe in 3 key ideas: <strong>#1) Education</strong> - learn about what matters to you; <strong>#2) Coaching</strong> - practice and embody that learning; and <strong>#3) Leadership</strong> - show up \"fully and in presence\" with others.</p><p>Every section in this course is connected and invites you to embody the learning. Each section has some “Action Steps” or “Activity” to help you notice what shows up for you as you to interpret and get to the story of the emotions that you experience.</p><p><strong>The more you can practice and apply what you learn in the sections determines the results you'll get.</strong></p><strong></strong><p><strong></strong></p><p><strong>Section #1</strong> – “Welcome To The Course” – Quickly get started in this section with this short introduction to “Emotional Intelligence And Emotional Mastery” and the two foundational models of the O-A-R and the B-E-L. You are the unique observer of your life. And the unique observer you are has a Body, experiences Emotions and interprets those emotions in Language. There is also an invitation to join the private Facebook group called, “Life Coaching And Vedic Counseling”.</p><p><strong>Section #2</strong> – “Before You Begin - A Brief Introduction To Emotions” – Emotions have been studied for as long as humans have been alive. It wasn’t until about 1649 and Descartes’, “Les Passions des l’Ame” that emotions have been reduced and classified into “basic” emotions. Other psychological studies include Dr. Paul Ekman’s “6 Basic Emotions” and Dr. Robert Plutchik’s “Wheel Of Emotions.” Learn to distinguish between what it means to “have emotions” versus “being emotional.” This skill is crucial for developing your emotional intelligence.</p><p><strong>Section #3</strong> – “Getting To Know Yourself - Part 1 - Your Emotional Inheritances” – The bulk of the worksheets and self-reflection exercises are in this section. This is where you are invited to spend as much time as possible to understand what makes up that “framework of belief” that your unique observer operates under. This framework was built throughout your life from ALL of the life experiences you had. What were those? Who were those individuals responsible? The more clearly you can articulate this, the greater your results.</p><p><strong>Section #4</strong> – “Getting To Know Yourself - Part 2 - Moods And Their Influence” – What is the difference between “moods” and “emotions”? Well, it’s mostly a matter of time! Emotions are triggered by events; they are mostly immediate. Moods, on the other hand, are emotions that persist for longer periods of time from hours to decades! What are the moods that you bring with you? Do you know the 4 basic moods? Learn to move from the moods of Resentment and Resignation to something more productive in your life.</p><p><strong>Section #5</strong> – \"Bust A Move - Learning To Give Yourself A Break From Mental “Chatter”\" – No matter if we keep our mouths shut or open, we are ALWAYS in conversation! We either have a chattering internal loop or we are interacting with others! STOP this noise by moving your body. Here you will learn about the 5 body dispositions and how they cause us to experience certain emotions. Once you learn to move your body in an appropriate way to get satisfactory results, then you have a powerful tool to work with your emotions. The activities in this section invite you to practise moving your body into these dispositions.</p><p><strong>Section #6</strong> – \"Declarations And How To Bring Joy And Satisfaction Into Your Life\" – Declarations are at the heart of creating a life of meaning, value and satisfaction. Declarations are a speech act and have certain properties that allow you to use the generative power of language to create that “hoped for future” in your life.</p><p><strong>Section #7 </strong>– “Approaching Resentment &amp; Resignation With Lightness And Curiosity” – The moods of Resentment and Resignation can be particularly “heavy.” This section is about introducing the emotions of lightness and curiosity to work with these moods. Each of lightness and curiosity allow you to work with these moods and look at them from different perspectives. Activities in this section invite you to visualise and imagine just what it would be like for you to be in “lightness” and “curiosity.”</p><p><strong>Section #8</strong> – “Looking Ahead To Create A Satisfactory And Joyous “Hoped For” Future” – Creating that “hoped for” future is at the heart of the coaching relationship. Just what is it that you want to create in your life? Which areas of family, friends, career, community and more do you want that “hoped for” future?</p><p><strong>Section #9</strong> – “Life Is Meant To Be Lived Joyously… Stepping Lightly And In Joy” – We wrap up this course with the invitation to consider that life is meant to be lived joyously. The action steps are summarised here which invite you to #1 notice and #2 keep practising the skill of noticing. Then you can move into the investigative part of understanding the linguistic foundations of emotions and the associated body shapes that will allow you to take control of the situations, events and conversations in your life!</p><p><strong>Section #10</strong> – “BONUS Offers And Special Coupon Codes For Students” – I leave you with a special offer to work with me as a leadership life coach. Give me a shout and let’s have a conversation about what creates satisfaction in your life! Also included are coupon codes for my other courses!</p><p><strong>Course Bonuses!</strong></p><p><strong>Bonus #1</strong> – PDF Worksheet \"List of Emotions\" – A 9-page and 3-page documents to help you identify the wide variety of emotions that are available to you. This is just the starting point! Only your curiosity and imagination will allow you to uncover more emotions!</p><p><strong>Bonus #2</strong> – PDF Worksheet \"Dr. Robert Plutchik’s Wheel of Emotions\" – In 1980 Dr. Plutchik theorized a set of 16 emotions based on combinations of 8 basic emotions. This worksheet will give you an idea of the spectrum of emotions that Dr. Plutchik works with.</p><p><strong>Bonus #3</strong> – PDF Worksheet “Emotional Inheritances” – A 3-page worksheet designed to give you insight into the individuals and groups that helped to create that framework of belief for your unique observer in the world.</p><p><strong>Bonus #4</strong> – PDF Worksheet “My Wardrobe Of Emotions” – A 3-page worksheet that allows you to determine your satisfaction in 26 different areas of life. The following invitation is to associate certain emotions with those life areas and take time for self-reflection and introspection.</p><p><strong>Bonus #5</strong> – PDF Worksheet “4 Basic Moods Of Resentment, Resignation, Acceptance, Ambition” – A 1-page worksheet to give you an idea of how the 4 basic moods are created from opposition or acceptance of the facticity of past/present and future events and possibilities.</p><p><strong>Bonus #6</strong> – MP3 Recordings to practise the 5 Body Dispositions of “Centre, Resolution, Openness, Stability and Flexibility.” Spend time to practise these short 4-8 minute physical activities to embody the body dispositions. You’ll be surprised at what you discover for yourself!</p><p><strong>Take Action &amp; Enroll</strong></p><p><strong>Click \"Take This Course\" now</strong> and make the commitment to jump straight into “Master Emotions - Declare Happiness And Satisfaction In Life” for yourself. I know that working with emotions created shifts within me and resulted in a rewarding personal and professional life.</p><p>See you on the inside!</p><p>Wishing you much success in your journeys,</p>Thushyanthan", 
    "end_date": null, 
    "title": "Master Emotions - Declare Happiness And Satisfaction In Life", 
    "price": "40.00", 
    "instructors": "Thushyanthan A", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625450_9a5a_2.jpg", 
    "course_url": "https://www.udemy.com/master-emotions/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T03:13:42Z"
}