{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you always envied people who seem consistently relaxed and happy, who just seem to joyfully breeze through life? </p><p>What if you could become one of them in a very short time?<br></p><p>Well, you're in luck because becoming more joyful is the mission of my latest course More Joy Now: Stop Struggling &amp; Start Thriving.</p><p>In \nthis course, I cover how to change the way you think about joy and the role joy plays in your everyday life. Once you open up to the possibility of bringing increasing amounts of joy into your daily, there is virtually no limit to how joyous you can feel.</p><p>And here's the deal: joy is your birthright. You should not have to wait for retirement, a raise, winning the lottery or any other external jackpots to allow more joy into your life.<br></p><p>You will learn how to integrate simple practices into your everyday life that will transform the way you feel all day long, no matter where you start on the happiness spectrum.<br></p><p>In this course you will learn how to:</p><ul><li>Experience more joy in your everyday life</li><li>Shift from have-to thinking to want-to living</li><li>Wake up happy and refreshed and ready to take on the day</li><li>Go to bed feeling happier and happier each day</li><li>Use your natural instincts to increase daily joy</li><li>Make the world a better place by increasing your joy</li></ul><p>This\n course will awaken your natural inclination for joy, even if it has been dormant for a long time. This course is perfect for folks coming out of a major life transition or grappling with situations that typically trigger old negative patterns of behavior. If you consistently struggle with negative thinking or self-sabotage, then this is the course for you.<br></p><p>Every time you take and retake this course, you will remember that having a more joyful life is easier than anyone ever led you to believe. And if you suffer from doubt, anxiety, or depression, this course will give you practical tools you may have never tried.</p><p>Are you ready to learn how to amplify feelings of joy in your life without stress or strain? \nThen jump into this course, which includes:</p><ul><li>45+ minutes of video coaching</li><li>Transcripts of all the key tips in the middle section of the course</li><li>Handouts to help you envision your more joyful life</li><li>Tips and tricks for increasing joy from a long-time coach</li><li>Methods to help you build on the joy you already have</li><li>Dozens of uplifting, colorful images</li><li>Cures for the can't-get-out-of-bed blues</li></ul><p>Once you take this class and practice \nthe techniques, you will understand the connection between joy and your life path. Let go of the idea that your joy is outside of you and uncover the power of joy flowing through you. Let the joy you uncover today lead you like a series of clues to a more joyful future.<br></p><p>For\n over fifteen years, author, journalist and coach Christina Katz \nhas been writing personal development articles that have uplifted thousands of readers. After taking this class, you \nwill tap into an increasing flow of joy you may not have known was possible.</p><p>Join Christina Katz is making the world a better place by committing to a personal practice of more joy now. Together we can make the world a better and brighter place.<br></p>", 
    "end_date": null, 
    "title": "More Joy Now: Stop Struggling & Start Thriving", 
    "price": "30.00", 
    "instructors": "Christina Katz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672434_5cf7.jpg", 
    "course_url": "https://www.udemy.com/more-joy-now-stop-struggling-start-thriving/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-17T17:01:58Z"
}