{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Experience yourself as \"in-control\" and confident. </strong></p><p>Learning to master internal states will empower you immensely.  The techniques you learn in this course will put you in control, and have you feeling confident, empowered, motivated, and fully alive - regardless of your circumstances.<br><strong>Applications:</strong></p>\n\n<ul><li>Ø Generate Instant feeling of confidence when feeling a bit \"shaky\"</li> <li>Ø Be dynamic during pivotal moments</li> <li>Ø Engage others with self-assuredness </li> <li>Ø Speak in Public without Anxiety, or Fear</li> <li>Ø Speak to a Camera and Make Powerful Videos with a Rock-Solid Demeanor </li> <li>Ø Experience happiness by re-creating past success events</li> <li>Ø Be seen as confident and capable by others </li></ul>\n\n<p>Learn proven NLP strategies and techniques that will eliminate your fear and enable you to Experience yourself as \"in-control\" and confident. <br></p><p> During this course you will be led through NLP exercise that when practiced correctly have been demonstrated to make a significant difference in quality of life.</p>\n\n<p>You'll discover how Harvard researchers are at the forefront of modeling...and you'll learn how to apply what they have found.  You'll practice time-tested and research-validated NLP techniques that will fill you with instant courage and make you poised and calm in front of groups. </p>\n\n<p>You'll also learn some of the most powerful NLP presuppositions. These foundational NLP principles are part of the advanced bonus section and will skyrocket your ability to be an effective communicator, and person!   </p>", 
    "end_date": null, 
    "title": "NLP: Master Your Emotions - Control Your Destiny", 
    "price": "20.00", 
    "instructors": "NLP, Positive Psychology Coach Patrick Howell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592064_bd98_4.jpg", 
    "course_url": "https://www.udemy.com/nlp-techniques-online-course-eliminate-fear-public-speaking-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T18:08:34Z"
}