{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t This is a course to help you to make the big decisions in life, such as:  </p>  <ul>  \t<li>what you should study</li>  \t<li>what career you should follow</li>  \t<li>is this person a suitable husband or wife</li>  </ul>  <p>  \t but it&#039;s also about what happens every day, it&#039;s about:  </p>  <ul>  \t<li>getting more done and being efficient</li>  \t<li>understanding and controlling your emotions</li>  \t<li>developing relationships and influencing others</li>  </ul>  <p>  \t This course will help you to play to your strengths and overcome your weaknesses. Ultimately it&#039;s a course about happiness and contentment ... and achieving the life that you want.  </p>  <p>  \t You are unique. There are no universal answers but there are perspectives which can help you to find the insights that will make you more effective and happier. In this course you will explore:  </p>  <ul>  \t<li>the three thinking systems in your brain: emotional, associative, rational</li>  \t<li>understanding intuition and gut-feelings</li>  \t<li>emotions - what are the primary triggers and how can you manage them</li>  \t<li>personality</li>  \t<li>unconscious drivers and schemas that determine your outlook</li>  \t<li>cognitive biases that affect perception, attention and decision-making</li>  \t<li>memory - the hidden flaws and how to improve your memory</li>  \t<li>irrational thinking and how to overcome it</li>  \t<li>intelligence - more than simply IQ</li>  </ul>  <p>  \t This is all based on rigorous research and I will share with you a comprehensive list of references. But let me stress - this is a PRACTICAL course. It is the distilled essence of my twenty years, in over 30 countries, helping managers to develop.  </p>  <p>  \t In addition to hours of video, you will gain access to questionnaires that provide insight into yourself, articles and links to other resources, including summary mindmaps.  </p>", 
    "end_date": null, 
    "title": "Personal Insight: the foundation of success and happiness", 
    "price": "50.00", 
    "instructors": "Paul Taylor", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144724_9fda_2.jpg", 
    "course_url": "https://www.udemy.com/personal-insight/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-09T19:33:44Z"
}