{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Prepare Yourself For Life's Uncertainties With Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><ul><li>Lots of uncertain events happen in our life; events which are beyond our control. We can neither stop the occurrence of the event nor can we alter it. This video course helps you to prepare yourself for life's uncertainties so that whenever and uncertain event happens you have the strength to bounce back again and re-establish yourself.</li> <li></li> <li>To prepare yourself for life's uncertainty, you have to be open to change. Change, no matter how big or small, can be challenging. Preparing yourself for change prepares you to face the life uncertainties by enabling you to reprogramming your subconscious mind. </li><li></li></ul>  <ul><li><b>1. </b><b>How Self Hypnosis Can Help?</b><b></b></li> <li>1) Self hypnosis increases your confidence levels<b></b></li> <li>2) Self hypnosis makes you more mentally alert<b></b></li> <li>3) Self Hypnosis helps you a great wave of relaxation refreshing your whole body<b></b></li> <li>4) Self hypnosis helps maintain positive attitude <b></b></li> <li>5) Self hypnosis treats stress, anxiety, nervousness and depression successfully<b></b></li></ul></ul><p>This course is ideal for people who want to prepare themselves for life's uncertainties so that whenever and uncertain event happens they have the strength to bounce back again and re-establish yourself.</p><p>It is for people who are willing to change themselves to adapt to life's challenges and uncertainties.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English.</p>", 
    "end_date": null, 
    "title": "Prepare Yourself For Life’s Uncertainties With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581886_866f.jpg", 
    "course_url": "https://www.udemy.com/prepare-yourself-for-lifes-uncertainties-with-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T06:21:04Z"
}