{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Una de las mejores noticias que nos ha brindado la Psicología Positiva es que la felicidad es una habilidad que se aprende y como tal podemos cultivarla y educarnos para ser cada día más y más felices.</p><p>Con este curso vas a obtener los primeros conocimientos sobre Psicología  Positiva la cual se le conoce también como la Ciencia de la Felicidad.</p><p>Descubrirás qué dice la ciencia respecto a la felicidad, distinguir las características que hacen a una persona feliz y seguir ejercicios que te ayudarán a ser una persona más feliz a través de actividades que han sido comprobadas científicamente.</p><p>Dirigido tanto a personas que buscan su desarrollo personal como para los que desean incursionar en el estudio y/o práctica de la Psicología Positiva. No es necesario tener conocimientos previos de Psicología, solamente las ganas de aprender y comprender los componentes básicos que hacen felices a las personas.</p><p>En este curso se explicarán los conceptos básicos para introducirte al tema de la Psicología Positiva, se presentarán a manera de introducción, los cinco grandes ejes que componen la Teoría del Bienestar, dicha teoría creada por un grupo de Psicólogos dirigidos por el Doctor Martin Seligman, es la de mayor aceptación a nivel mundial.</p><p>Al terminar las sesiones de introducción, abordaremos el primer eje de la felicidad que se enfoca en las Emociones Positivas, aprenderás el porqué es importante cultivarlas y hacerlas parte de tu vida. Conocerás las últimas investigaciones que se han hecho al respecto y las herramientas adecuadas para cultivar tus emociones positivas.</p><p>Como bien lo dijo Aristóteles, quizás el primer Psicólogo Positivo en la historia:</p><p>\"Solemos preguntarnos si es posible aprender a ser feliz, si se adquiere la felicidad por medio de ciertos hábitos; o si es, mas bien, efecto de algún favor divino o resultado del azar.</p><p>Yo sostengo que la felicidad, no nos la envían exclusivamente los dioses, sino que la obtenemos por la práctica de la virtud, mediante un largo aprendizaje y una lucha constante. Y añado que ella es, en cierta manera, accesible a todos.</p><p>Vale mas conquistar la felicidad a este precio que deberla al simple azar.\"</p><p>Espero sea de tu agrado.</p>", 
    "end_date": null, 
    "title": "Psicología Positiva: La Ciencia de la Felicidad", 
    "price": "20.00", 
    "instructors": "Walter Daniel Bustillos Balderrama", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525626_21c8.jpg", 
    "course_url": "https://www.udemy.com/psicologia-positiva/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T02:00:11Z"
}