{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Con este curso gratuito, aprenderás todo sobre la felicidad, desde qué es, hasta cómo ser feliz. Primero se define la felicidad, para dejar en claro lo que realmente es y corregir los conceptos equivocados de la misma que mucha gente tiene. </p><p>Debido a que la felicidad tiene una relación muy íntima con las emociones, también se define lo que es una emoción, y qué relación tiene con la felicidad.</p><p>En este curso he tomado las preguntas más comunes y cuyas respuestas dadas hasta ahora no han sido muy convincentes, para que de una vez por todas tengas las respuestas correctas. Sabrás:</p><ul><li>¿Qué es la felicidad?</li><li>¿En dónde reside?</li><li>Por qué está equivocada la idea de que la felicidad está en nuestro interior</li><li>Sabrás que la felicidad se produce por medio de un factor interno y uno externo</li><li>Tendrás la explicación exacta del por qué existe una cantidad ilimitada de emociones</li><li>Sabrás qué es lo que hace que la felicidad sea pasajera, y por qué tiene que ser así</li><li>Entenderás por qué no existe un estado neutral, en el que no se hes feliz, ni infeliz</li><li>Al final podrás ver un video práctico que te dirá lo que debes hacer para lograr ser más feliz de lo que actualmente eres</li></ul><span></span><span></span>La estructura básica de este curso consiste en explicar lo que realmente es la felicidad, en responder las preguntas que han surgido respecto a ella, y en darte seis consejos para que logres ser más feliz de lo que actualmente eres.<p>El objetivo de este curso es enseñarte lo que significa realmente ser feliz, y cómo se logra esto cambiando el enfoque de la percepción.</p><p>Todas las cosas que hacemos, y absolutamente todas las acciones que llevamos a cabo, son con el único fin de lograr nuestra felicidad, por eso es importante, y necesario, tomar este curso, para poder entender y lograr aquello que por naturaleza deseamos: ser felices</p>", 
    "end_date": null, 
    "title": "Qué es la felicidad y cómo ser más feliz", 
    "price": 0, 
    "instructors": "Marcos Morales", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569748_b031_3.jpg", 
    "course_url": "https://www.udemy.com/felicidad/", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T00:54:54Z"
}