{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>By taking this course you will have a powerful tool to not only help yourself, but you can also use it to create an income for yourself your earnings potential are limitless !</strong></p><p>This course is designed to help you come into energetic balance and a state of bliss by relaxing, deep breathing and clearing the 7 main chakras in the body</p><p><strong>You are a powerful energetic being, a spiritual being having a physical experience, everything and everyone you connect with impacts you energetically as you impact them. Reconnecting with this side of yourself is YOUR birthright.</strong></p><p>By clearing your energy field through a purified chakra system you can expect to: -</p><ul><li>Feel more alive !</li><li>Reduce stress levels</li><li>Be more alert</li><li>Sleep better</li><li>Feel more connected to those around you</li><li>Clear illnesses more quickly</li><li>Worry less</li><li>Reduce blood pressure</li><li>Be more creative</li><li>Feel less need to be in control</li><li>Be able to stand up for yourself</li><li> Be more in your heart</li><li> Be able to communicate more clearly</li><li> Open up dormant aspects of your psyche</li><li> Be more intuitive</li><li> Feel more at peace</li><li> Feel a total sense of universal connectedness and the wonders within.</li></ul><p><br><strong>What are you going to get from this course?</strong></p><p><strong>This is a certified course and you will receive your certificate on completion.</strong></p><p><strong>There are 3 hours of material with 36 videos, 2 quizzes and 3 bonus lectures and I am available as a guide throughout the course for any help you may need.</strong></p><p><strong>You will be able to run a chakra balancing healing on yourself as well as others, including children.</strong></p><div><strong>You will be able to run this healing on yourself as a personal tool, but you could also create an income for yourself by:</strong></div><ul><li>Running a weekly relaxation class in your area</li><li>Using it to offer workplaces a relaxation/meditation workshop</li><li>Offering it to schools as an extra-curricular activity.</li></ul><p><br>The opportunities are endless, if you have some more ideas please let me know and I will add it to the list!</p><p><strong>What will you need to take this course</strong></p><p>A comfy place to relax</p><p>A pair of headphones </p><p>A general interest in your own well-being</p><p><strong>Who can take this course ?</strong></p><p><strong>Anyone can take this course<span><strong>, all you need are ears !</strong></span></strong></p>", 
    "end_date": null, 
    "title": "Relax, Breathe,Come into Chakra Balance,your Path to Bliss", 
    "price": "20.00", 
    "instructors": "Tania Magdalene", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753402_46ab_5.jpg", 
    "course_url": "https://www.udemy.com/relax-breathe-and-come-into-chakra-balance60-mins-to-bliss/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T13:46:41Z"
}