{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Updated January 3rd.  </strong><strong></strong></p><p>JOIN MY <strong>12,900 SUCCESSFUL STUDENTS FROM 144 COUNTRIES</strong> WHO HAVE ALREADY TAKEN MY UDEMY COURSES AND GAVE ME <strong>OVER 200 5 STAR  REVIEWS</strong>! </p><p>About this course:</p><ul><li><em><strong>FREE 30 minutes personal coaching - $175 value -</strong> upon 100% course completion<strong></strong></em></li><li><em>FREE monthly scheduled webinars to discuss tools of Positive Psychology and how they can help you improve your life <strong>(almost $1,200 value per year</strong> - $99 each session)</em></li><li><em><strong>FREE Full lifetime access</strong></em></li><li><strong><em><em>FREE Interviews with the experts of Positive Psychology</em></em></strong></li><li><strong><em><em></em></em></strong><em>All<strong> future extra lectures and upgrades</strong> are always included for free</em></li><li><em></em><em>Unconditional Udemy and my own </em><strong>30 day money-back guarantee </strong><em>- that's my personal promise of your success!</em></li></ul><p><em>Regular </em><strong>free surprise bonuses </strong><em>to help you become even more <em>happier</em>!</em></p><p>The research shows that happy people are successful. Lets work on your success!! </p><p>In this course, you will learn:</p><ul><li>Apply the tools and secrets that are <strong>scientifically proven to increase our happiness level and improve overall wellbeing </strong></li><li>What Positive Psychology – <strong>Science of Happiness</strong> – is and what is not</li><li>What is <strong>happiness</strong> and how to become happier using the scientifically proven methods</li><li>How to <strong>start any new habit or change the existing</strong></li><li><strong>7 Tools to help you change any habit</strong></li><li><strong>Why and how gratitude can help you become happier and more successful</strong></li><li><strong>Empathy and Happiness – Mirror Neurons and how we are built to help others</strong></li></ul><p><strong>This </strong>Program combines years of research by experts in the field of habits, neuroscience, traditional and positive psychology, and teaches you how to apply this new information in a very simple and practical way. This program will help you understand your habits: why you have them, why you can or cannot change them, and how they can work to help you live a great life.</p><p>Implementing habitual behavior in accordance with this program<strong> will help you become happier and more successful, will improve your wellbeing, and will assist you in living the life you've always wanted to live.</strong></p><p><strong>Click the \"take this course\" button, top right, now ... Enroll NOW to become happier and more successful.</strong></p><p><strong>Every minute you delay is actually COSTING you...Happiness, Health, Success...</strong></p><p><strong>ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "Science of Happiness: Positive Psychology Research and Tools", 
    "price": "20.00", 
    "instructors": "Braco Pobric", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/106926_e940_5.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-science-of-happiness-theory-research-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-17T00:38:14Z"
}