{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>“Happiness is not something ready-made. It comes from your own actions.” - Dalai Lama</p><p></p><p><strong>Take your happiness in your own hands</strong></p><ul><li>learn about the myths of happiness</li><li>induce your life with positive emotions</li><li>use self-compassion and kindness to relate to your life in a new way</li><li>start finding happiness in the present moment</li><li>much more</li></ul><p> <strong>Get 30-day happiness program that leads you through a science-based process towards a happier life</strong></p><p>Psychologists and neuroscientists from all over the world have been researching happiness for decades. Thousands of experiments, case studies, analyses and rigorous research studies have been conducted to provide insights into what really makes our lives good and how people can live more happily. This 30 Days of Happiness program is<b> based on this research</b> and translates it into easily understandable steps that you can take to live a happier and more fulfilled life.</p><p>While many happiness programs provide only advice and anecdotes, this 30 Days of Happiness program will equip you with <b>proven exercises </b>and background information. Many scientific studies have been done to show that they work and have the potential to really transform your life for the better.</p><p></p><p>One more thing: You have a <b><i>totally unconditional money back guarantee</i>.</b> It allows you to study the course for 30 days and if you are in any way unhappy with it, you will get a full refund, no questions asked! Enrolling in the course is absolutely risk free.</p><p><i>Click the <b>\"Take This Course\"</b> button now and enroll in the 30 Days of Happiness program!</i></p>", 
    "end_date": null, 
    "title": "Science of Happiness - The 30 Days Happiness Program", 
    "price": "25.00", 
    "instructors": "Manuel Kraus", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325218_03e5_3.jpg", 
    "course_url": "https://www.udemy.com/science-of-happiness/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T21:04:43Z"
}