{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4>Du hast dein Glück in der Hand.</h4>\n\n<p>Genau für dich, der nicht einfach rumsitzt und auf sein Glück wartet, bis es dir in den Schoß fällt, habe ich dieses Seminar erstellt.</p><p>In diesem Seminar zeige ich dir den erfolgreichen Weg zu deinem nachhaltigen Wohlbefinden.</p><p>Hier gibt es effektive Übungen aus der Positiven Psychologie und dem Yoga.<br></p>\n\n<ul><li>Mehr Freude, mehr glücklich sein, mehr Wohlbefinden.</li><li>Entspannungstechniken für den Alltag.</li><li>Förderung der Achtsamkeit für Balance und Erfolg im Beruf nimmt zu.</li><li>Praktische Übungen aus der Positiven Psychologie, der Wissenschaft eines gelingenden Lebens.</li><li>Erfahre und übe, was du aktiv tun kannst, um glücklicher zu leben!</li></ul><p>Du lernst mit Achtsamkeits- und Yoga-Übungen, was Glück wirklich bedeutet und wie du es in deinem Leben beeinflussen kannst. Entdecke, wie du deine Stärken und Werte für dein Wohlbefinden gezielt einsetzen kannst.</p><p>Wie viele positiven Emotionen lebst du im Alltag? Wie oft bist du im Flow? Von welchen Zielen träumst du insgeheim? Möchtest du einfach du selbst sein und dich gut fühlen? Wie steht es um deinen Selbstwert und um deine Beziehungen? Wie oft kümmerst du dich nur um dich und dein Wohlbefinden?</p><p><br>Du bekommst bei uns die Möglichkeit, endlich mal etwas für deine Zufriedenheit zu tun! Du lernst im GlücksSeminar die 5 Säulen kennen, auf denen dein erfülltes Leben aufbaut. </p><h4>Positive Emotionen</h4>\n\n<p>Entdecke verschiedene positive Emotionen und ihre Quellen. Erfahre die angenehmen Auswirkungen auf dein Wohlbefinden sowie auf deine Gesundheit. Lerne viele verschiedene Möglichkeiten deine positiven Emotionen zu steigern und dein Leben zu genießen.</p><h4>Engagement, Flow</h4>\n\n<p>Schärfe deine 5 Sinne. Werde achtsamer mit Entspannungstechniken. Lerne Yoga-Übungen für Anfänger und Fortgeschrittene.</p><h4>Beziehungen</h4>\n\n<p>Lerne Selbstliebe und Akzeptanz für einen guten Umgang mit dir. Stärke dein Selbstvertrauen und deinen Selbstwert. Kreiere positive Beziehungen zu anderen Menschen.</p><h4>Sinn</h4>\n\n<p>Lerne deine Stärken und Werte kennen und optimal nutzen. Erlerne Sinn und Nutzen der Dankbarkeit, um ein erfülltes Leben zu führen. Reduziere Stress, löse negative Glaubenssätze auf und baue Ängste ab für ein freies Leben.</p><h4>Ziele</h4>\n\n<p>Erfahre welche Ziele dich wirklich glücklich machen. Lerne verschiedene Methoden um Ziele glücklich und erfolgreich zu meistern. Verwirkliche deine Träume!</p><p><br></p><p>Mit vielen Übungen wirst du eine positive Einstellung und Denkweise für deine Zukunft entwickeln. Die Videos, MP3s und PDFs helfen dir aktuelle Probleme zu meistern, eine grundsätzlich positive Veränderung zu bewirken und dich nachhaltig zu stärken.<br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Seelenschokolade Online GlücksSeminar", 
    "price": "50.00", 
    "instructors": "Julia Colella", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793836_3b3e_2.jpg", 
    "course_url": "https://www.udemy.com/online-gluecks-seminar/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T17:06:34Z"
}