{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>¡Domina la técnica de los sueños lúcidos en este curso!</strong><br></p><p>Llevo años enseñando sueños lúcidos a través de talleres y también a través de cursos online en algunas páginas prestigiosas de sueños lucidos. Aunque este sea un curso grabado, también tiene la opción de asesoría personal para sacarle aún mayor partido.</p><p>Este es un curso de sueños lúcidos a traves de videos. Llevo soñando lúcidamente toda mi vida y he hecho mucha investigación y estudios en lo largo de estos años para compilar un curso completo. Verá que dicho curso tiene técnica poderosas y si sigue todos los pasos, podrá inducir sueños lúcidos a su propia voluntad.</p><p>Este es un curso muy completo. De hecho, también tiene \"sueño-deberes\" que deberá seguir para mejorar su técnica.</p><p>En este curso sólo necesitas:</p><p>- Un cerebro.</p><p>- Un sitio donde dormir.</p><p>- Ganas de tener unos sueños increíbles.</p><p>- Ganas de explorar el mundo de los sueños conscientemente.</p><p>Aprende todo acerca de:</p><p>- Técnicas de inducción DILD, WILD, MILD, DEILD, L-DEILD, EILD y mas.</p><p>- Técnicas de apoyo de sueño como Incubación, WBTB.</p><p>- Aprende una técnica de relajación profunda de mente y cuerpo.</p><p>- Aprende a tener un diario de sueños que será la envidia de muchos.</p><p>Todo esto y mucho mas lo podrás describir aquí.</p>", 
    "end_date": null, 
    "title": "Sueños Lúcidos: Explora el mundo soñado conscientemente.", 
    "price": "30.00", 
    "instructors": "Fernando Albert", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792640_6e1b.jpg", 
    "course_url": "https://www.udemy.com/dominando-los-suenos-lucidos/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T17:48:05Z"
}