{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Description</strong>  </p>  <p>  \t  Educational comedy and creativity are combined in this amazing showcase of acting, instructing, and vocal talent; guaranteed to inspire, educate, and entertain! This program is a unique approach to looking at success &amp; happiness as expressed through dramatized personal stories inspired by our most beloved celebrities, historical figures, and fictional characters.  </p>  <p>  \t  An exciting 10-module video learning experience with 4 lesson units, 6 core concept reviews, and 2 major course summaries. Featuring 4 unique and entertaining “special interviews” plus more added surprises along the way!  </p>  <p>  \t<strong>Scenario</strong>  </p>  <p>  \t  Four guests are invited on a special talk show to speak about their life and how it relates to a keyword, which links to their personal story. One special celebrity guest “co-host” is selected and scheduled to appear on The Exceed Machine LIVE!  </p>  <p>  \t<strong>Your Role to Play</strong>  </p>  <p>  \t  You are a VIP audience member on a talk show! But not just any talk show… You’ve been gifted a VIP ticket (a $497 value) to the top-rated &amp; highest-grossing show of all time… The Exceed Machine LIVE!  </p>  <p>  \t  This show is enchanted! In this talk show anyone and everyone, real or make-believe, is fair game for an interview or a special appearance. You really never know what you are going to get on The Exceed Machine LIVE!  </p>  <p>  \t  You are here to witness and learn by listening straight through or taking notes as you go… either way, hold on to your seat… and enjoy the ride!  </p>", 
    "end_date": null, 
    "title": "The EXCEED Machine! How to be FUN, SUCCESSFUL, and WEALTHY!", 
    "price": "25.00", 
    "instructors": "Edward Lyles", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329750_12e1.jpg", 
    "course_url": "https://www.udemy.com/the-exceed-machine-how-to-be-fun-successful-and-wealthy/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T19:19:50Z"
}