{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong>This course teaches you the principles you need to thrive in your personal and professional life. This course </strong><strong>will help you:</strong>  </p>  <ul>  \t<li>Make more money</li>  \t<li>Conquer your weight and fitness goals (yes, you can shed that extra 10 lbs and fit into your high school clothes with my tips!)</li>  \t<li>Create and nurture AWESOME relationships</li>  \t<li>Be happy more often</li>  </ul>  <p style=\"\">  \t                Starting and maintaining a business can be stressful. Entrepreneurs who don't practice happiness principles are more likely to give up and fail. This can have a dramatic impact on your finances, health and relationships.  </p>  <p style=\"\">  \t<strong>By the end of this course, you will:</strong>  </p>  <ul>  \t<li>Understand the foundation of positive psychology</li>  \t<li>Have a roadmap to increase your earnings</li>  \t<li>Create a personalized exercise and nutrition plan that's tailored just for you</li>  \t<li>Have kick ass relationships</li>  </ul>  <p style=\"\">  \t            You will have valuable skills to help you cope with life challenges. You will also create a motivation portfolio that will act as a road map to take you from where you are to where you want to be. You'll also receive a bonus copy of Max's Amazon best selling ebook, \"Wealth, Health &amp; Happiness: 7 Secrets for Successful Millennials.\" </p><p style=\"\">These lessons will make you more motivated and inspired to accomplish your deepest desires and follow your life's purpose.</p>  <p style=\"\">  \t<strong>Contents and Overview</strong>  </p>  <p style=\"\">  \t                This course contains 27 lectures and over 2 hours of content. It's designed for entrepreneurs, business owners, and freelancers regardless of age, industry and mastery of personal development.  </p>", 
    "end_date": null, 
    "title": "The Entrepreneur's Complete Guide To Getting Noticed", 
    "price": "25.00", 
    "instructors": "Max DuBowy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359526_f3cb_3.jpg", 
    "course_url": "https://www.udemy.com/positive-psychology-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T02:01:45Z"
}