{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Getting more out of every opportunity, realizing one's potential and being happier and more successful are things we all want in life. And sometimes we stumble upon tips that sound really helpful. </p><p><strong>BUT</strong>, you know that situation where you hear an advice and try to follow it, you even see some results and after a short while... you find yourself back to where you were? <br></p><p>Get this: <strong><em>ONLY 5% </em></strong>of the various tips and tools for happiness and success work for people in the long run. </p><p><strong><em><span>Why does it happen, you ask??</span></em></strong></p><p><span>Well, there are two main reasons:</span></p><p><span><strong>1) Knowing is not enough. </strong><strong></strong>Your day-to-day environment will always be stronger than even the best advice you may get or the knowledge you may gain. </span></p><p><strong><span>2) Obsolete practices. </span></strong>Most of the practices you'll learn from various happiness and success gurus are no longer working in the long run because the world is going through a paradigm shift. </p><p>Take this free course to discover <strong><em>The Circles Method, </em></strong>which weaves together cutting-edge research that is in line with where the world is going today and the newly emerging conditions for happiness and success. </p><p>In less than 4 hours, you'll learn the newest practices and principles for how to use your environment to reduce stress, boost your well-being, supercharge your motivation, and ultimately make your life a natural habitat for happiness and success.</p>", 
    "end_date": null, 
    "title": "The Science of Happiness & Success", 
    "price": 0, 
    "instructors": "Circles University", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/511796_7475_2.jpg", 
    "course_url": "https://www.udemy.com/happiness-success/", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T14:19:47Z"
}