{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t <strong>Positive psychology is a new science dedicated to understanding what makes life worth living from an empirical, evidence based perspective</strong>. It&rsquo;s only in the last 20 years or so that science has formally started to grapple with the same questions that philosophers, mystics, poets, and teachers have tried to answer for thousands of years. Here&#039;s your chance to learn cutting edge research based strategies to living your most alive life.  </p>  <p>  \t<strong>Now you might find yourself saying, <em>positive psychology</em>, as opposed to <em>negative psychology</em>?</strong> Well, kind of. Traditional psychology, as we know it, has been a deficit model focusing mostly on mental illness and what&rsquo;s wrong with people; it&#039;s done a great job of figuring out how to fix problems and get individuals from a -10 to 0, or &ldquo;normal.&rdquo; Positive psychology, meanwhile, asks different questions and focuses on what&rsquo;s right with people, and how to go from 0 to +10!  </p>  <p>  \t<strong>Too many people today are struggling. Look at these facts about Americans:</strong>  </p>  <ul>  \t<li>Nearly 1 out of 10 is depressed and medicating</li>  \t<li>1 out of 5 reports feeling lonely and isolated</li>  \t<li>4 out 10 are struggling to figure out their life purpose</li>  \t<li>8 out of 10 visits to the doctor are due to stress at work</li>  </ul>  <p>  \t      Your life is way to precious. <strong>T</strong><strong>here&rsquo;s nothing more valuable than figuring out how to flourish. </strong>It&rsquo;s the biggest contribution you can make to the world. Some anonymous person said it best: &ldquo;<em>Because once you find your piece in the puzzle, you enable 10,000 others to find theirs.</em>&rdquo; Your living fully is not only good for you - but it&rsquo;s uplifting, inspiring, and contagious to those around you. If you want to change your world, start with yourself right now! If there are things you wish were different about your situation or the people surrounding you...take Ganhdi&#039;s advice: &ldquo;<em>Be the change you want to see in the world</em>.&rdquo;  </p>  <p>  \t<strong>So whatchya waiting for? </strong>Take this class if you want to really understand the key to flourishing through Applied Positive Psychology.  </p>  <ul>  \t<li>Figure out what levers you need to press in order to thrive.</li>  \t<li>Understand your emotions and how to shift shitty days around.</li>  \t<li>Never be bored again once you understand the mechanics of engagement.</li>  \t<li>Connect, really connect, with those around you.</li>  \t<li>Experience more meaning and purpose where before there may have been struggle and suffering.</li>  \t<li>And understand the psychology of motivation, grit, and achievement to amplify your productivity, performance and live your dreams.</li>  \t<li>Stop complaining and start doing something about it.</li>  </ul>  <p>  \t    PS Did I mention that I&#039;ll be holding regular conference calls with students? I&#039;m here with you every step of the way.  </p>  <p>  \t      See you on the other side :)  </p>  <p>  \t    -Stella  </p>", 
    "end_date": null, 
    "title": "The Science of Happiness: Hacks & Skills to Flourish", 
    "price": "50.00", 
    "instructors": "Stella Grizont", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121950_c4fa_8.jpg", 
    "course_url": "https://www.udemy.com/scienceofhappiness/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-18T23:37:40Z"
}