{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In the past 15 years cutting-edge innovations in neuroscience have led to one of the most powerful insights in human history…<strong>that within each and every one of us there are natural biological potentials for real happiness. </strong>In this course, you will learn how to harness your brain's own natural anti-depressants and uncover your true potential for joy!</p><p><strong>About Your Instructor</strong></p><p><strong>I'm Elisha Goldstein</strong>, author of <em>The Now Effect </em>and most recently <em>Uncovering Happiness: Overcoming Depression with Mindfulness and Self-Compassion</em>. For over 15 years I've been studying and teaching the psychology, neuroscience and practice of uncovering happiness in everyday life.</p><p>Along the way I've dug deep into a variety of disciplines and discovered some key natural anti-depressants that:</p><ol><li> turn the volume down on our negative thinking, </li><li>lower our stress, </li><li>heighten states of joy and </li><li>wire in the balance and confidence that we can all learn and attain. </li></ol><p>This has been my experience, the experience of thousands of people I've worked with and is also backed by the latest science. </p><p><strong>About The Symposium</strong></p><p>The <em>Uncovering Happiness Symposium </em>is a very personal project for me. It's been my life's work to uncover the potential in each and every one of us for uncovering happiness and I couldn't be more thrilled to bring it to you right now.</p>In this Symposium you'll learn:<span></span><p>· The key ingredients of lasting happiness </p><p>· How to practically bring them into your daily life </p><p>· And how to do it so you change your brain for the better</p><p>Ultimately you will learn how to take back control of your mind, your mood and your life, sewing the seeds for real lasting happiness.</p><p><strong>About Our Interviews</strong></p><p>I've interviewed some of the top scientists, neuroscientists, researchers and practitioners in the field of happiness and well-being for this Symposium. You'll hear from <strong>Byron Katie, Tara Brach, Kelly McGonigal, Sharon Salzberg, Dan Harris, Jack Kornfield and others - check out the curriculum below</strong></p><p>These are people from Harvard, UCLA and many of whom have written New York Times bestselling titles on the topics of happiness. Plus, as a bonus to you I've asked each speaker to give you a practice that makes happiness practical right now. You'll get over 20 practices to use at home and work. These are practices that help you:</p><ul><li> create a naturally anti-depressant brain, </li><li>reduce stress and anxiety, </li><li>have better relationships, </li><li>overcome negative habits with eating and </li><li>create confidence at home and at work.</li></ul><p>I want to spread the word about innate abilities to be happy worldwide <strong>so you can listen to each interview for free as it is airing right here</strong> - and after the “virtual symposium\" you'll have the opportunity to own the entire thing at a cost that is so low almost anyone can afford it.</p><p>Enrol today and learn how to harness your brain's own natural anti-depressants and uncover a real lasting happiness in your life.</p>", 
    "end_date": null, 
    "title": "Uncovering Happiness Symposium with Elisha Goldstein", 
    "price": "50.00", 
    "instructors": "Elisha Goldstein", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501542_8cd7_6.jpg", 
    "course_url": "https://www.udemy.com/uncovering-happiness-symposium-with-elisha-goldstein/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T01:21:18Z"
}