{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">  This course uncovers a 4-step formula to living a fulfilled life - the life you were always meant to have.</strong>  </p>  <p>  \t  We will do exercises that will help you activate your imagination and heart to truly understand what you want in life. I will help you <strong style=\"\">find what really makes you happy</strong> (and not what the society tells you should do). We&#039;re gonna dream big!  </p>  <p>  \t  And once you set your big goals, <strong style=\"\">you will be given the tools to turn them into reality</strong>.  </p>  <p>  \t  We will discuss how to plan your time so you always have enough of it for the things you love. Forget all the boring time management tools you studied. We&#039;re going to discuss a whole new way of managing your time. No more sacrificing anything you love for work you can&#039;t stand. We&#039;re going to shuffle your focus from things you should be doing to things you want to do.  </p>  <p>  \t  You will also learn how to manage your energy, so <strong style=\"\">you always feel energized</strong>. No more getting up tired and lethargic. We&#039;re going to discover ways to always having energy for whatever it is that you want or should be doing. And all that while <strong style=\"\">protecting you from feeling overwhelmed or burnt out.</strong>  </p>  <p>  \t You will learn how to take adequate care of yourself to be able to <strong style=\"\">create amazing things and make an impact.</strong>  </p>  <p>  \t  This course is very interactive. Throughout it, you will experience <strong style=\"\">over 16 exercises and learn over 70 tips</strong> on making your big dreams come true.  </p>", 
    "end_date": null, 
    "title": "Winning The Game Of Life", 
    "price": "45.00", 
    "instructors": "Magda Kay", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119172_e589_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-dream-big-and-make-it-happen/", 
    "currency": "USD", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-13T09:00:34Z"
}