{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Эмоции играют критическую роль во всех аспектах нашей жизни: отношениях, работе, обучении, принятии решений, физическом и умственном здоровье.</p><p>Концепция лидерства через эмоциональный интеллект прочно занимает свои позиции в современном менеджменте и постепенно вытесняет стандартные методы управления, основанные на материальном поощрении и карьерном росте. Эффективный лидер, управляющий командой (спортивной, студенческой или отделом продавцов - не важно) с позиции эмоционального интеллекта, руководствуется принципом \"вдохновление вместо  мотивации\". В результате отношения в коллективе выстраиваются на глубоком эмоциональном уровне. Этот принцип давно усвоен в таких компаниях как Google, Virgin Group и т.д. </p><p>\"Эффективное лидерство зависит от высоко развитого EQ (коэффициента эмоционального интеллекта), а не IQ, как принято считать\" сказал в своей книге Дэниэл Гоулман - автор и популяризатор идеи эмоционального интеллекта.</p><p>Эмоции - это инструмент, который всегда с нами и в нашем распоряжении. Как и любой инструмент, эмоции требуют навыка обращения с ним. Они работают даже в том случае, когда человек понятия не имеет о том как с ними обращаться. В таких случаях - во вред человеку, а если не во вред, то лишь по случайному стечению обстоятельств.</p><p>Этот курс - своеобразная инструкция по применению. Очень важно знать, что такое эмоции, из каких компонентов они состоят, какие им свойственны характеристики и в каком взаимодействии с окружающим миром они находятся.<br></p><p>Как быть в ситуациях, когда \"от тебя ничего не зависит\"? Что такое стресс и можно ли на самом деле с ним бороться? Как защитить себя от \"похитителей настроения\"? Что такое \"эмоциональная диета\" и как построить \"склад счастья\"? Как избавиться от головной боли, не прибегая к таблеткам? Почему все эффективные лидеры начинают утро с медитации и как вышло так, что в сильнейшей в мире баскетбольной команде появился тренер, занявшийся развитием эмоционального интеллекта игроков?</p><p>На эти и другие вопросы я отвечу в своем курсе. Или даже так: я отвечу лишь на некоторые из этих вопросов. На другие вопросы, в том числе и те, которыми вы в своей жизни задаетесь, вы сможете найти СВОИ собственные ответы.</p>\n\n<p>Эмоциональный интеллект - это о том, как понимать что с тобой происходит в данный момент, знать куда это может привести; если вам не нравится перспектива - иметь возможность изменить ситуацию; о том как знать и понимать, что в данный момент происходит с твоим собеседником и что с этим можно сделать.</p>\n\n<p>Эмоциональный интеллект позволит вам принимать решения, о которых вам никогда не придется сожалеть, жить полной жизнью \"здесь и сейчас\" и выстраивать эффективные отношения.<br></p>", 
    "end_date": null, 
    "title": "Эмоциональный интеллект.", 
    "price": 0, 
    "instructors": "Anna Gershenovich", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/846202_c55e.jpg", 
    "course_url": "https://www.udemy.com/emintlgnce/", 
    "subject_name": [
        "Happiness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-11T15:40:52Z"
}