{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    Do you ever struggle to manage your work and the rest of your life? You are not alone. This course is designed for those leading teams as well as for individuals who want to manage their own careers with flexible options. Men and women all over the world are trying to figure out how to get beyond the impossible work-life “balance” to achieve a new level of success in all parts of their lives. Join Catalyst experts to explore this topic and the importance of inclusive leadership in creating flexible—and productive—work environments. Through research and real-world examples from a variety of situations, you will learn strategies for managing workplace flexibility, and you will see how you have the power as an individual, as a member of a team, and as a manager to make positive change. You will understand the value of a flexible work environment and what sets successful flexible workers and leaders apart. With short quizzes, compelling case studies, and engaging videos, you will build your knowledge each week and share your experience with other learners on topics such as communication, technology, myth-busting, challenges, and solutions. Throughout the course you will develop a Personal Work-Life Plan to help apply the strategies taught in the course to your work and other parts of your life.\n\nBonus: Sign up for a Verified Certificate of Achievement to bolster your credentials on this topic in the workplace, and at the end of the course you will receive Managing Flex, a three-part interactive toolkit that helps individuals, managers, and organizations understand, navigate, and create flexible work arrangements.\n\n                                    ", "end_date": "2015-11-17T00:00:00Z", "title": " IL3x: Inclusive Leadership Training: Maximizing Work-Life for Your Success", "price": 0, "instructors": "Laura Sabattini, Ph.D., Liz Mulligan-Ferry and Amelia Costigan", "institution_name": ["Catalyst"], "commitment": "1-2 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/inclusive-leadership-training-maximizing-catalystx-il3x", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-10-13T00:00:00Z"}