{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    The goal of this course is to explore and develop plans of action for improving the job and career opportunities for today and tomorrow’s workforce. At this time, there aren’t enough good jobs or educational opportunities in the U.S. or globally to meet the aspirations and needs of all who want and need to work or to deliver on the expectation that every generation should achieve a higher standard of living for themselves and their families than their parent’s generation. This is a fundamental ideal that drives people all over the world. In the U.S. we call it the American Dream.\n\nIf we take the right actions we can shape the future of work in ways that meet the needs of workers, families, and their economies and societies. To do so we first have to understand how the world of work is changing, how firms can compete and prosper and support good jobs and careers, and how to update the policies and practices governing the world of work.\n\nIn this business and management course, we’ll start by tracing the history of work and employment that has made the economy work so well in the past. And we’ll uncover what’s gone wrong, in order to figure out new solutions that fit today’s workforce, economy, and society. We’ll also take you on a personal journey. You’ll learn what employers expect in today’s world of work – the skills, flexibility, and knowledge that are crucial for success in the contemporary workplace. We’ll examine what has to happen in order for employers, workers, governments, and regulators to come together to forge new policies, rules, and understandings for governing the world of work in the 21st century. We’ll make this all come alive by highlighting the experiences, contributions, and aspirations of real people who are working right now to address these challenges.\n\nSo join us, and let’s get started on shaping the future of work.\n\n                                    ", "end_date": "2016-05-16T00:00:00Z", "title": "15.662x: Shaping the Future of Work", "price": 0, "instructors": "", "institution_name": ["Massachusetts Institute of Technology"], "commitment": "3-5 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/shaping-future-work-mitx-15-662x", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-03-28T00:00:00Z"}