{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    In this course you will understand how firms are organized, what factors must be taken into account in making critical design decisions, and what role managers play in making these choices. In order to answer these questions, we will first develop a conceptual process model that links business models, external and internal contingencies, and organizational design. Second, we will focus on the fundamental principles of organization design and what alternative design choices are available for managers. Finally, we will apply these concepts and ideas to organizational situations to develop the critical insights and decision making skills to build effective organizations.\n \nLearners:\n•\tWill understand how managers create value through their organizations\n•\tWill have a good understanding of the fundamental principles and factors important to organizational design\n•\tWill be able to design the coordination, control, and performance measurement systems to manage an organization.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\n                                            Syllabus\n                        Course OrientationYou will become familiar with the course, your classmates, and our learning environment. The orientation will also help you obtain the technical skills required for the course.Module 1: Corporate Governance and the Role of Managers in Value CreationWhat is management and what role do managers play in creating economic value? These questions are critical in understanding corporate governance and defining managerial responsibilities.  Module 2:  Environment of Organizations: External and Internal ContingenciesWhat factors should be taken into account in designing organizations? This is the fundamental question in understanding the role of external and internal contingencies in developing organizational design alternatives.Module 3: Organization Design – DifferentiationWhat are the critical building blocks of organization design? This central question helps us focus on how the allocation of resources, authority, and tasks provide the managers the choices for structuring the organization.Module 4:  Elements of Organization Design – IntegrationHow is organizational integration achieved with the use of coordination and control tools?  Coordination and control are the essential parts of organization design, and we need to describe how these tools are used to design the organization.\n                                    ", "end_date": "2016-06-27T00:00:00Z", "title": "Designing the Organization: From Strategy to Organizational Structure", "price": 0, "instructors": "Huseyin Leblebici", "institution_name": ["University of Illinois at Urbana-Champaign"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/designing-organization", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}