{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    In this course you will learn about the “head and heart” of everyday leadership, individual decision making, group decision making, and managing motivation. The objectives are to understand why and how leadership skills are so critical to organizational success, and learn the foundations of effective leadership skills.\n\nLearners:\n•\tUnderstand why and how leadership skills are so critical to organizational success\n•\tKnow how to use leadership skills to work more effectively with others, and are able to organize teams to work more effectively together\n•\tWill be able to apply the foundations of effective leadership skills to everyday situations faced by leaders.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\n                                            Syllabus\n                        Course OrientationYou will become familiar with the course, your classmates, and our learning environment. The orientation will also help you obtain the technical skills required for the course.Module 1: Head and Heart of Everyday LeadershipThis module will examine what critical levers an everyday leader has available (the management of information and the management of motivation) to accomplish a leader’s core tasks (making and implementing decisions), and why inclusiveness may be the most important skill in a leader’s toolbox.  \nModule 2: Individual Decision MakingThis module will focus on the management of information (head) side of everyday leadership.  We will examine decision analysis as a systematic approach to using information to make decisions, as well as the weaknesses and limitations of decision analysis.\nModule 3: Group Decision MakingThis module will focus on group decision making as a vehicle for helping an everyday leader address some of the limitations of individual decision making. We will also consider the three key determinants of process loss in group decision making that need to be overcome for group decision making to be effective.  \nModule 4: Managing MotivationThis module will focus on the managing motivation (heart) side of everyday leadership.  We will examine how leaders can best manage motivation, and the importance for individual motivation of a leader's management of interdependence among group members.\n\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "Foundations of Everyday Leadership", "price": 0, "instructors": "Gregory Northcraft", "institution_name": ["University of Illinois at Urbana-Champaign"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/everyday-leadership-foundation", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}