{"selfpaced": true, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    Human Capital Management (HCM) and Human Resources (HR) are key to running any business. That’s why SAP SuccessFactors includes a full suite of cloud-based solutions to support the entire HR lifecycle including recruiting, onboarding, performance management, payroll, and much more.\r\nBut where should you start and how do you implement and integrate SAP SuccessFactors into your current systems? That’s where SAP SuccessFactors rapid-deployment solutions (RDS) come into play. SAP SuccessFactors RDS packages are best practices for implementing SuccessFactors and consist of proven and tested configurations, presentations, test scripts, offline demos, and other tools to help you get up and running with SuccessFactors both quickly and predictably.\r\nThis course is all about taking those best practices and showing you how to apply them to your own unique business needs. The goal of the course is to walk you through the tools and guides included in the RDS best practices content for an “implementation made simple” for each of the SuccessFactors solutions including core HR, payroll, talent, and more.\n\n                                            Syllabus\n                        Week 1: Get Started with Rapid ImplementationWeek 2: Implement Core HR and PayrollWeek 3: Implement Talent SolutionsWeek 4: Integrate and Extend SuccessFactorsWeek 5: Final Exam\n                                    ", "end_date": "2016-04-06T00:00:00Z", "title": "Implementation Made Simple for SAP SuccessFactors Solutions", "price": 0, "instructors": "Marise Sfeir, Friederike Buettner and Bob Caswell", "institution_name": [], "commitment": "3-4 hours", "subject_name": ["Business & Management"], "course_url": "https://open.sap.com/courses/sf3", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["openSAP"], "start_date": "2016-03-09T00:00:00Z"}