{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    Are you a business executive or a manager who uses English in your career? Then you know that good business communication in English requires focus, vocabulary, and specific linguistic structures. In this course, you will follow along a recently promoted manager as she builds and leads her team to success. Together, you will practice the language and styles of communication  needed in English for: \n•\tRecruiting and training a professional team to work together with integrity and respect\n•\tManaging and participating in well-organized meetings\n•\tMaking telephone conferences more efficient\n•\tWriting professional emails that are easy to read\nThe activities in this course will give you the opportunity to share your experience and receive immediate feedback from other business professionals around the world.\n\n¿Es usted un ejecutivo de negocios o gerente que utiliza inglés en su profesión? Entonces Ud. sabe que la buena comunicación empresarial en inglés exige los enfoques, el vocabulario y las estructuras lingüísticas específicas. En este curso, Ud. seguirá, a lo largo con un gerente recién promovido, como ella construye y conduce a su equipo hacia el éxito. Juntos, ustedes practicarán el lenguaje y los estilos de comunicación en inglés necesarios para:\n·       Reclutar y el entrenar a un equipo profesional a trabajar juntos con integridad y respeto\n·       Manejar y participar en las reuniones bien organizadas\n·       Hacer que las conferencias telefónicas sean más eficaz\n·       Escribir correos electrónicos profesionales que sean fáciles de leer\nLas actividades en este curso le dan la oportunidad de compartir su experiencia y recibir retroalimentación inmediata de otros profesionales empresariales en todo el mundo.\n\n                                            Syllabus\n                        Decisiones para dotación y contratación de personal / Staffing and Hiring Decisions En este módulo, seguiremos a Elizabeth en el proceso de armar su propio equipo. Veremos la manera como ella se comunica con su equipo y colegas dependiendo de cada situación. Esto le ayudará a prepararse para hacer solicitudes de forma directa o indirecta. Usted podrá usar como ejemplo, la forma que en que ella aplica modelos de comunicación con su equipo, y como usa el idioma. Por medio de la interacción con sus compañeros, podrá sintetizar sus nuevas habilidades en conversaciones y actividades en la vida real....In this module, you’ll follow Elizabeth through the process of building her team. You’ll look at the way she communicates depending on the situation. From this observation, you’ll be better equipped to make requests using direct and indirect approaches. by analyzing her interactions with her team, her language choices, and the communication patterns she follows. Through the discussion boards and peer reviewed assignment you will synthesize your new skills in real life conversations and activities.Gestión de reuniones / Meeting ManagementReuniones eficaces de negocio requieren la planificación, liderazgo, y habilidades comunicacionales. Sin estas habilidades, las reuniones pueden ser improductivas o peor aún, aburridas. Observando a Elizabeth y su equipo, usted será capaz de planificar y facilitar una reunión eficaz. Ademas, usted podrá crear una agenda efectiva con los puntos claves para una reunión....Effective business meetings require planning, leadership, and language skills and without these skills, meetings can be unproductive or even boring. Although this module covers topics related to meeting management, it’s definitely not boring because we we have Elizabeth and her team to guide us through the learning process. In this module, you’ll watch and learn from Elizabeth and her team. After completing Meeting Management, you’ll be able to plan and facilitate an effective meeting; summarize key points of an agenda item; and begin to develop strategies to help you to be better understood.Liderazgo y trabajo en equipo / Leading and TeamingInterrumpir con confianza, pedir clarificación, y conseguir la respuesta que se quiere, serán algunas habilidades que usted aprenderá y aplicara en este modulo. ..Interrupt with confidence, ask for clarification and get the answer you want; hold the floor and keep it: these are some of the skills you’ll learn and apply in Leading and Teaming.Planificar, organizar, y delegar / Planning, Organizing, and DelegatingEl cuidado del negocio o el proyecto que se quiere controlar, requiere planificación. Esto requiere que la información sea organizada de manera conveniente con informes periódicos de estado de resultados. Después de completar este módulo, usted será capaz de usar el lenguaje adecuado en correos electrónicos comunicandose efectivamente....Keeping the business or project running as projected requires planning. This requires information to be organized in convenient packages, like status reports and emails. Planning, Organizing, and Delegating focuses on the language of both. After completing this module, you’ll be able to use concise language to summarize key pieces of information into smaller packages.Dirigir y entrenar / Managing and CoachingPara que un empleado tenga éxito, es importante la guía que le entrega su jefe. Esto es un desafío mayor si esta guía debe hacerse en otro idioma. Después de completar el modulo \"Dirigir y entrenar\", usted será capaz de usar frases claves para tener una audiencia participativa lo que facilitara el proceso de dirección y entrenamiento....Facilitating employee success is a management skill that can be even more challenging when communicating in a second language.  After completing Managing and Coaching, you’ll be able to recognize the importance of active listening, use key phrases and language to facilitate the coaching and mentoring process.Revisión  /  ReviewEste módulo le ayudará a completar el panel de discusión exitosamente.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Inglés Empresarial: Gestión y Liderazgo ", "price": 0, "instructors": "Jenny Young, Andrea Haraway and Wanda Huber", "institution_name": ["Arizona State University"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/ingles-empresarial-gestion-liderazgo", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}