{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    This course introduces you to the nonprofit sector, nonprofit organizations, and the concepts of leadership and governance. While this course has been developed with North American culture in mind, we do appreciate that in other parts of the world the nature of the nonprofit sector, nonprofit organizations, nonprofit leadership and governance may not be the same. Nevertheless, it is our hope that much of the course content will still be of value to those in other parts of the world. \n\nTo learn more about this course, please watch the overview video by copying and pasting the following link into your web browser: https://goo.gl/Lvhdqi.\n\nKeywords: Nonprofit; Nonprofit Sector; Voluntary Sector; Nonprofit Organizations, Non-Governmental Organizations, Volunteer Organizations, Leadership, Management, Governance, Board, Board of Directors, Performance, Effectiveness\n\nCourse 1 Overview: \n\nWeek 1: Some of the questions you will explore this week are: What is the nonprofit sector and why does it exist?  What are the unique characteristics of nonprofit organizations? What are the trends and emerging issues facing organizations in the nonprofit sector?\n\nWeek 2: Questions to be explored this week are: What is leadership at the governance level and how is it different from management?  What is good governance and why does it matter? What is a board of directors?\n\nWeek 3: This week's questions: What roles do board members play in nonprofit organizations? Broadly speaking, what are boards responsible for and how do they go about their work? What are some of the issues that challenge the board's ability to go its work?\n\nWeek 4: At this stage, you are asked to review the course content, submit a written assignment (known lightheartedly as a BEAR (Board Effectiveness Readiness Assessment), and take two multiple choice Readiness Assurance Tests (known similarly as RATs). One RAT will assess knowledge and reading comprehension and the other will test application of knowledge within a practical case.  \n\nWeek 5: We will encourage you to discuss the RATs in the discussion forums and take them again should you wish to change any of your answers based on the information exchanged.\n\n                                            Syllabus\n                        The Nonprofit Sector, Nonprofit Organizations, Leadership and GovernanceWelcome to the first course in the series of three courses on developing leadership and improving governance in nonprofit organizations. We encourage you to dive right in--watch the lecture and guest interview videos, participate in the discussion forums, take the practice quiz, post a commentary in the forum, analyze the Board cases, and start working on the course project!  Nonprofit Management and Leadership, Organizational Governance and Boards of DirectorsHello and welcome to Week 2 of the first course on Leadership and Governance of Nonprofit Organizations! The goal of this week is to introduce you to the concept of nonprofit leadership and governance and the function of boards in organizational governance. Details can be found on the week 2 course pages below. As usual, we encourage you to engage in the content and with each other on this online teaching and learning journey!The Board's Role and ResponsibilitiesHello and welcome to Week 3! The goal of this week is to address a number of important questions related to how boards operate: What roles do board members play in nonprofit organizations, what are boards responsible for, What is the role and responsibilities of boards of directors and What are the elements of board behavior that shape how effective a board will be. These elements form the basis of the content of the second and third courses in this series on Developing Leadership and Improving Governance in Nonprofit Organizations. They also underlie the structure of our course text, Improving the Effectiveness of Boards of Directors AND the tool used to facilitate assessments of board performance in the Course 2 project. Two videos relating to these topics can be found on the week 3 course page.Concept Testing and ApplicationHello and welcome to Week 4! The goal of this week is to assess course learning. The end of Course 1 assessment of learning begins with the requirement that you to take two Readiness Assurance Tests (RATs) and submit your first Board Effectiveness Assessment Reflection (BEAR).  During the testing process, don't forget to bring a piece of paper and pen to make a note of your answers to the RAT and RAT Application Exercise questions. You will need them to vote and discuss your responses in the RAT forums next week.  \nAssessment of Learning: BEAR Peer Review and RAT Discussion ForumsHello, and Welcome to Week 5! The goal of this week is to discuss and complete the end of Course 1 assessment of learning. It begins with peer discussion of the individual Readiness Assurance Test (RAT) and RAT Application Exercise (case) you took last week plus peer review of the three BEAR assignments you have been assigned to evaluate this week.  It concludes with re-taking the RAT and RAT Application Exercise Tests and returning the three BEAR assignments you peer-reviewed last week. \n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Introduction to the Nonprofit Sector, Nonprofit Organizations, Nonprofit Leadership and Governance", "price": 0, "instructors": "Vic Murray and Prof. Yvonne D. Harrison, PhD", "institution_name": ["State University of New York"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/nonprofit-organizations", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}