{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    Meet Jim Barton, the new CEO of Santa Monica Aerospace. Jim's job won't be easy: the company's hemorrhaging cash, struggling to regain investors' trust after an accounting scandal, and striving to transform its culture to become a more global competitor. In this course, you’ll travel with Jim as he takes on leadership challenges ranging from strategy execution, to inspiring people, to maintaining an ethical approach. Experts agree that twentieth-century leadership practices are inadequate for the stormy twenty-first-century present. This provocative course equips you with the insights you'll need to rise with the occasion of a rapidly shifting business landscape.\n\nThe course is based on a book, Harder Than I Thought: Adventures of a 21st Century Leader, by Robert D. Austin, Richard L. Nolan, and Shannon O'Donnell, published by Harvard Business Review Press. Purchase of the book is optional. If you want more information about the book or wish to buy it, see https://hbr.org/product/harder-than-i-thought-adventures-of-a-twenty-first/an/10332-HBK-ENG or http://www.amazon.com/Harder-Than-Thought-Adventures-Twenty-First/dp/1422162591 \n\nAfter taking the course, you'll be able to:\no   Enact your own personal leadership approach, derived from your ongoing evaluation of how Jim Barton has handled his leadership situation, as well as from established leadership concepts and frameworks;\no   Avoid leadership actions that might have worked in the past, but are not suited to a newly challenging 21st century world;\no   Navigate treacherous new 21st century leadership challenges, such as greater reliance on specialized workers or the need to respond to external scrutiny in an increasingly transparent world (and many more);\no   Avoid \"slippery slope\" ethical failures, and think more clearly about the separation between public and private life for a 21st century leader.\n\n                                            Syllabus\n                        Course Preview and IntroJoin Jim Barton on a leadership journey...that quickly becomes tougher than expected!Taking on a New Leadership RoleSo you've been presented with a new leadership \"opportunity\"...should you accept it? Should Jim Barton have taken this job? How would YOU decide?Getting Oriented and Assessing Your TeamAs a new leader, the first order of business is to survey the landscape, get your bearings, and figure out what's really going on. Perhaps the most crucial part of that is assessing the team you've inherited. Who will be an ally in what you need to accomplish? Who will be an obstacle? Who should stay, and who should go? How will YOU decide?Communication in an Age of Super TransparencyIn an age of social media and super hackers, leaders have to worry more than ever about secrets getting out, making hard decisions under scrutiny, and people misinterpreting what the company and its leaders are doing. Thanks primarily to the advance of technology, the organizational activities have never been more transparent. How should a leader take this new 21st century reality into account? Do past communications and PR approaches need to change? How would YOU do it?Leading CollaborationWhen you're building something as complicated as an airplane, people have to work together. As a leader, it's a part of your job to populate teams, develop relationships, orchestrate process, and set up conducive environments to maximize the effectiveness of collaborative work. How is this done? How would YOU accomplish it?Motivating and InspiringA leader must be able to move other people -- potentially in directions those others do not wish to go. A very important part of a leader's role, then, is to motivate people -- to somehow provide the impulse to move others in a particular direction. Indeed, a leader often needs to get people moving together, in a similar direction. But there are different ways of doing this. Incentives, for example, operate differently than inspiration, and the two might not work equally well in a particular circumstance. How should the 21st century leader motivate people? What would YOU do?Effective GovernanceA leader operates within a framework that outlines her or his responsibilities, range of authority, and access to resources -- we call such frameworks \"governance.\" Governance empowers a leader but also looks over her or his shoulder. A precondition for effectiveness as a leader is having a foundation of sound governance. And although it can be rather tricky, leaders sometimes have to try to make changes to the governance framework within which they work. If you're a CEO and you decide you have an ineffective board of directors -- to whom you report -- what would YOU do?Leading Change Convincing people to change their ways might be THE hardest job a leader has to do. And if getting people to change is hard, getting groups -- who work together in the old ways and reinforce each other's sense of \"the way it's always been\" -- is even harder. But if you're going to transform a company, you're going to have to change things, in a big way. How would YOU go about it?Managing TalentIn the 21st century, the biggest assets an organization has are its people what they can do. The evidence of this? Apple, Google, and Microsoft all have market values higher than Exxon (a company with vastly more physical assets). A very important job of a 21st century leader, then, is to attract, retain, and continue to develop the talents and skills of the people within the organization. Talent is a success multiplier, and an organization's leader is its talent-developer-in-chief. How should this be done? How would you do it? Leading in CrisisNo matter how effective you are as a leader, sometimes things go wrong. In a crisis, a leader must make tough decision under the pressure of a ticking clock. That's really hard, partly because crises are (thankfully) rare and few people have a lot of experience with them. And yet, you need to get it right. The stakes, in a crisis, are often very, very high, for the organization and for a leader's career. As a leader, sooner or later you will have to deal with a crisis. How will YOU measure up?  Leading InnovationThanks to mature communications and transportation networks, it has never been easier for low cost producers to market low priced products and services all over the world. Because of this, companies -- especially those not located in low cost regions -- need to innovate, in order to keep offering products and services that are better, even if they aren't cheaper. In the 21st century, the capacity to innovate has become extremely important to business success. And it's the leader's job to create the conditions in which her or his people can innovate effectively. A leader must espouse principles, processes, and practices that allow the organization to innovation better than its rivals. How to do this? How would YOU do it? Leading ExecutionIt's \"where the rubber hits the road.\" Execution. If you can't execute, it doesn't matter how well you strategize or how visionary you are. Execution is the art and science of getting it done. But how should a leader do that? How would YOU? Public Life, Private LifeYou've seen it all too often in the newspaper headlines: a prominent leader called on to resign, not because of failure to perform on the job, but because of something troubling (at least to some) that has transpired in their so-called \"private life\" that has become public. Where is the boundary between public life and private life for a leader? Indeed, is there a boundary? Why do so many leaders have problems with this? How does it bear on notions of leadership character and integrity? What is YOUR personal philosophy in this important area? Vision and the Role of CultureThe eminent management thinker Peter Drucker once said that \"Culture eats strategy for breakfast.\" Lou Gerstner, after he turned around IBM, often said that the importance of culture was the one thing he seriously underestimated. What is culture? According to the simplest definition, widely used, culture is \"the way we do things around here.\" But how should the leader influence that? What would YOU do?  Modern Theories of LeadershipLeadership is an active, if fragmented, field of management research. In this module, you'll encounter some of the ideas researchers have come up with to describe and improve the practice of leadership. Some of these theories have had more influence than others. Some have had less influence on the practice of leadership than many of the ideas we've already seen in the course (e.g., economic agency theory). We offer these here to raise the possibility that some of these ideas might help YOU as you synthesize a personal approach to leadership in the 21st century.  A Study in Leadership Failure: The Financial Crisis (Part 1)The early 21st century has seen some spectacular failures of leadership. From the BP Deepwater Horizon explosion and oil spill, to the Fukushima Daiichi nuclear disaster, to the 2008 financial crisis, we've seen a lot of major things go wrong with leadership. You could argue that these are examples of 20th century leadership applied to 21st century challenges...and that resulting failures demonstrate the need for a new leadership approach. In this module, we'll begin trying to understand some of the things that went wrong in the extremely complicated 2008 financial crisis.A Study in Leadership Failure: The Financial Crisis (Part 2)We continue our examination of the inner complexities of the 2008 financial crisis. Real Leadership Case Study: Lord John Browne, British Petroleum We've met Jim Barton and followed him on his journey. In this module, we turn the ideas we've discussed and developed in the course so far to the case of a real leader. What is YOUR assessment of the leadership of Lord John Browne, former CEO of BP Synthesis - Leadership in 21st Century OrganizationsPutting it all together. Last thoughts and attempts to synthesize thoughts about 21st century leadership.\n                                    ", "end_date": "2015-12-03T00:00:00Z", "title": "Leadership in 21st Century Organizations", "price": 0, "instructors": "Robert Austin, Shannon Hessel and Richard Nolan", "institution_name": ["Copenhagen Business School"], "commitment": "4-6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/leadership-21st-century", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-09-24T00:00:00Z"}