{"selfpaced": false, "topic_name": ["Management & Leadership"], "description": "\n\n                    \n                    \n                    En este curso, aprenderás los principios fundamentales de la gestión del tiempo y costo en las etapas de planificación.  Se identificarán las actividades del proyecto a partir de la EDT, se establecerá la secuencia, recursos y duración necesarios para finalmente desarrollar el cronograma detallado del proyecto. De igual manera, aprenderás a estimar los costos de los recursos, para desarrollar un presupuesto detallado y flujo de efectivo a lo largo del proyecto. Después de este curso, podrás explicar los principios fundamentales del seguimiento y control del proyecto en aspectos de tiempo y costo, así cómo el cálculo de indicadores de desempeño para determinar si el proyecto va conforme a lo planeado o esta fuera de la linea base acordado y aprobada.\n\n                                            Syllabus\n                        ¿Cómo se hace la programación de un proyecto?En este módulo, vamos a conocer los procesos necesarios para gestionar el tiempo en un proyecto, los cronogramas de trabajo y el concepto de ruta crítica. Además, calcularemos los tiempos tempranos y tardíos de cada actividad, así como las holguras totales y libres de las actividades.¿Cómo se estiman los recursos en el proyecto?Al finalizar este módulo, conocerás el tipo de recursos que se deben considerar en las tareas de un proyecto, así como los métodos de estimación de recursos.¿Cómo se determina el presupuesto del proyecto?En este módulo, vamos a conocer los procesos necesarios para gestionar el costo en un proyecto, qué se hace en el plan de gestión del costo y los métodos de estimación de costos.Monitoreo y control del proyectoAl finalizar este módulo, conocerás el método del valor ganado para el seguimiento y control de proyectos y cómo se aplica en un caso de estudio.\n                                    ", "end_date": "2016-06-27T00:00:00Z", "title": "Programación y presupuesto del proyecto", "price": 0, "instructors": "Filiberto González Hernández", "institution_name": ["University of California, Irvine", "Tecnológico de Monterrey"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/riesgos-cambios-proyectos", "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}