{
    "selfpaced": false, 
    "topic_name": [
        "Online Education"
    ], 
    "description": "\n\n                    \n                    \n                    Courses, credits, certificates, credentials -- will badges be added to this list as professionally valued ''currency''? A badge is a symbol or indicator of an accomplishment, skill, competency or interest. Badges provide evidence of learning that happens in and beyond the classroom. Badges give prospective employers, professional groups, community groups, schools, collaborators and other learners a more complete picture of knowledge, skills and abilities. Please join WCET, the Mozilla Foundation, Blackboard, Inc., and Sage Road Solutions LLC – and an array of influencers from education, business/industry, government, veterans’ affairs, accreditation and key foundations – for this 6-week, interactive, Open Online Course exploring badges as the emerging currency of exchange for creating high value post-secondary and professional credentials. This course is appropriate for participants with different levels of expectation and time commitment, including:\r\n(1) Learners who want a general understanding of the topic;\r\n(2) Those who need to report back to their organizations about what badges are, how they work, and what opportunities they present;\r\n(3) Leaders who want to guide teams and peer groups in designing and implementing badge systems;\r\n(4) Teams and peer groups who want to work together to develop and implement badge systems;\r\n(5) Individuals who want to define badge systems for their own purposes.\r\nThere are no pre-requisites for this course, and no prior knowledge of the topic is necessary. Participants from all backgrounds are welcome, including but not limited to education, business, industry/trade associations, standards bodies, accreditation organizations, foundations, and government.\r\n\"Badges: New Currency for Professional Credentials\" by Blackboard, Mozilla, Sage Road Solutions, and WCET is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License. We encourage sharing, reuse, and remix of these course materials, in whole or in part, with attribution, for non-commercial purposes.\n\n                                    ", 
    "end_date": "2013-10-21T00:00:00Z", 
    "title": "Badges: New Currency for Professional Credentials", 
    "price": 0, 
    "instructors": "Deborah Everhart, Erin Knight and Anne Derryberry", 
    "institution_name": [
        "WICHE Cooperative for Educational Technologies"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursesites.com/webapps/Bb-sites-course-creation-BBLEARN/courseHomepage.htmlx?course_id=_264998_1", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open Education by Blackboard"
    ], 
    "start_date": "2013-09-09T00:00:00Z"
}