{
    "selfpaced": false, 
    "topic_name": [
        "Online Education"
    ], 
    "description": "\n\n                    \n                    \n                    Deze Massive Open Online Course (MOOC) is bedoeld voor docenten die een (bestaande) cursus (opnieuw) willen ontwerpen, en daarbij online leren willen afwisselen met face-to-face bijeenkomsten. Tijdens deze MOOC analyseren we verschillende voorbeelden van blended learning. U kunt daarnaast via een extra opdracht aan de slag gaan met het maken van een ontwerp van een cursus waarbij sprake is van een effectief en aantrekkelijk gebruik van internettechnologie. U bent in staat keuzes aan de hand van literatuur te onderbouwen.\r\nDe MOOC heeft een doorlooptijd van 7 weken. De onderwerpen die aan bod komen, zijn: toetsen, beoordelen en feedback geven, communiceren en samenwerkend leren, communiceren en individueel leren, en ontwikkelen van leerstof, allen uiteraard met behulp van internettechnologie.\r\nIedere studietaak bevat opdrachten die u voorlegt aan de andere deelnemers. Daarnaast kunt u zich verder verdiepen in blended learning door te kiezen voor verdiepingsopdrachten of door een herontwerp te maken.\r\nWe vragen van u om actief mee te doen en te reageren op uitwerkingen van de overige deelnemers.\r\nDe studiebelasting bedraagt ongeveer 3 uur per week. Deelname aan deze cursus is gratis.\r\nDe materialen binnen deze cursus hebben de licentievoorwaarden CC BY-NC-SA van Creative Commons http://creativecommons.org/licenses/by-nc-sa/4.0/, tenzij anders vermeld.\n\n                                    ", 
    "end_date": "2015-05-25T00:00:00Z", 
    "title": "Blended learning ontwikkelen", 
    "price": 0, 
    "instructors": "Francis Brouns", 
    "institution_name": [
        "Open Universiteit Nederland"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://platform.europeanmoocs.eu/course_blended_learning_ontwikkelen", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "EMMA"
    ], 
    "start_date": "2015-04-06T00:00:00Z"
}