{
    "selfpaced": true, 
    "topic_name": [
        "Online Education"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Education &amp; Teaching\n                                                                                                    &gt; Online Education\n                                                            \n                            \n                                                \n                    \n                    \n                    What constitutes learning in the 21st century? Should reading, watching, memorizing facts, and then taking exams be the only way to learn? Or could technology (used effectively) make learning more interactive, collaborative, and constructive? Could learning be more engaging and fun? We construct, access, visualize, and share information and knowledge in very different ways than we did decades ago. The amount and types of information created, shared, and critiqued every day is growing exponentially, and many skills required in today’s working environment are not taught in formal school systems. In this more complex and highly-connected world, we need new training and competency development—we need to design a new learning environment. The ultimate goal of this project-based course is to promote systematic design thinking that will cause a paradigm shift in the learning environments of today and tomorrow. Participants are not required to have computer programming skills, but must have 1) a commitment to working in a virtual team and 2) the motivation to help people learn better. All of us have been involved in the learning process at some point in our lives; in this course we invite educators, school leaders, researchers, students, parents, entrepreneurs, computer programmers, illustrators, interface designers, and all those who are interested in working together, to create a new learning environment. After the completion of this course, students will be able to: - Identify advantages, disadvantages, limitations, and potentials of at least 10 interactive learning models and solutions. - Describe how online communication, collaboration, and visualization technology play a role in the behavioral, cognitive, constructivist, and social dimensions of learning. - Describe the major components and processes involved in development of interactive education systems. - Communicate rationales of learning technology design approaches through team-oriented collaborations. - Evaluate the value of ideas, principles, and techniques used in educational media or systems. As a Final Team Project, students will design a new learning model catering to 21st century environments and learners. Each self-formed team will design and develop an application or system that combines team interaction activities and learning support features in ways that are effective and appropriate for today's computing and communication devices. Students must consider potential idiosyncrasies with various learning devices (e.g., tablet, phone, PC), infrastructure requirements (e.g., cellular network, wi-fi, Bluetooth), and any special hypothetical circumstances if relevant. In addition, each team must create and defend a business model (non-profit, for-profit, or hybrid) for the launch and scale up their solution. Additional consideration will be given to teams that come up with system feature ideas presenting meaningful learning interaction and performance analytics.\n\n                                    ", 
    "end_date": "2012-12-24T00:00:00Z", 
    "title": "Designing A New Learning Environment", 
    "price": 0, 
    "instructors": "Paul Kim", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://novoed.com/education", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2012-10-22T00:00:00Z"
}