{
    "selfpaced": true, 
    "topic_name": [
        "Online Education"
    ], 
    "description": "\n\n                    \n                    \n                    In October 2014, millions of young people across the nation—like you—will become scientists for the day during the seventh annual 4-H National Youth Science Day (NYSD).\r\nNYSD is the premiere national rallying event for 4-H Science year-round programming. It brings together thousands of youth, volunteers and educators from the nation’s 109 land-grant colleges and universities to simultaneously complete the National Science Experiment.\r\nThe 2014 National Science Experiment, Rockets to the Rescue, provides the opportunity to explore firsthand how aerospace engineering can be used to solve real world challenges—such as food distribution in emergency situations—to make a positive impact in our world.\r\nThe 2014 NYSD experiment is an offline activity that is typically conducted by a 4-H club, school group, or any other youth group. Guidelines for the activity can be obtained in the course. The activity is an experiment that requires creativity and imagination in solving a problem. The problem presented is how to move food and supplies in an emergency situation to where they are needed. The exercise leads to utilizing aerospace engineering to design a solution. And the solution is, Rockets to the Rescue!\r\nThe group will divide into teams that will work through an engineering design process in developing the solution. Each team's Challenge will be to design, build and test a propulsion system and prototype Food Transportation Device (FTD) that can accurately deliver its food payload to a specific target. The team will then test their launch system and FTD. Launch data will be recorded.\r\nTo earn the 2014 NYSD Rockets to the Rescue Digital Badge, each individual member of the group will register with the course and respond to a brief survey. Upon completion of the survey the digital badge will be issued.\r\nTo learn more about digital badges in 4-H and the 2014 NYSD experiment please visit the For Youth, For Life Learning Network.\n\n                                    ", 
    "end_date": null, 
    "title": "Digital Badge: Rockets to the Rescue!", 
    "price": 0, 
    "instructors": "John A. (Tony) Cook", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.canvas.net/courses/digital-badge-rockets-to-the-rescue", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2014-10-01T00:00:00Z"
}