{
    "selfpaced": false, 
    "topic_name": [
        "Online Education"
    ], 
    "description": "\n\n                    \n                    \n                    El avance tecnológico ha permitido una nueva manera de adquirir conocimientos.  Así, hoy, hablamos de una educación a distancia, que aprovechando  las plataformas digitales e interactivas (foros, chats, uso de videos explicativos, videoconferencias, etc.), permite que los docentes puedan desarrollar sus clases. \r\n \r\nEste curso preparará a los docentes en el manejo de estrategias metodológicas aplicadas a cursos virtuales, tales como, la búsqueda, selección y organización de recursos educativos para la enseñanza virtual, el diseño de actividades virtuales utilizando las herramientas que ofrece el aula virtual y la implementación de actividades de la Web 2.0 en plataformas virtuales. Así como, el uso de las redes sociales con fines pedagógicos y la creación de páginas Web.\n\n                                            Syllabus\n                        Módulo 0. Presentación\r\nMódulo 1. ¿Qué es el E-learning?\r\nMódulo 2. Búsqueda y Criterios de Selección de Recursos Digitales para Entornos Virtuales de Aprendizaje\r\nMódulo 3. Diseño de actividades para el E-learning\r\nMódulo 4. Creación de páginas web educativas e incorporación de las redes sociales\n                                    ", 
    "end_date": "2015-12-14T00:00:00Z", 
    "title": "Estrategias Metodológicas para el Docente E-learning", 
    "price": 0, 
    "instructors": "Nathaly Barrios Salinas", 
    "institution_name": [
        "Universidad de San Martín de Porres"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://miriadax.net/web/estrategias-metodologicas-para-el-docente-e-learning-5-edicion-", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Miríada X"
    ], 
    "start_date": "2015-11-16T00:00:00Z"
}