{
    "selfpaced": false, 
    "topic_name": [
        "Online Education"
    ], 
    "description": "\n\n                    \n                    \n                    O curso \"Explorando os recursos educacionais da Khan Academy\" tem como objetivo ajudar todos aqueles que desejam utilizar a plataforma como um recurso pedagógico. No decorrer do curso, você terá a oportunidade de conhecer a plataforma do ponto de vista do estudante e do ponto de vista do tutor, sabendo exatamente como utilizá-la em favor da aprendizagem. Ao longo do curso, você terá todas as orientações de que precisa para utilizar a plataforma com seus alunos.\n\nA plataforma Khan Academy foi concebida para oferecer aprendizado personalizado para todas as idades, com exercícios, vídeos e um painel de acompanhamento que habilita os estudantes a aprender no seu próprio ritmo. Para o professor, a Khan Academy é uma poderosa ferramenta pedagógica que possibilita personalizar o percurso de aprendizagem dos alunos, dinamizar a experiência educacional com recursos de gamificação e monitorar o progresso de todos e de cada um, com relatórios simples e objetivos.\n\nEste curso é autoinstrucional, ou seja, a aprendizagem acontece na interação com o conteúdo, com outros participantes e por meio da realização das atividades propostas. Assim, o cursista tem mais flexibilidade para estudar no seu próprio ritmo, de acordo com a sua disponibilidade de tempo.\n\nComo material didático, disponibilizamos textos, links, vídeo tutoriais, quizzes e uma proposta de atividade final, que envolve a sistematização da experiência de uso da plataforma como recurso pedagógico.\n\nPara ser certificado, o cursista deve obter 100% de aproveitamento nas avaliações ofertadas ao longo do curso, que são apresentadas em formato de teste, com possibilidade de mais de uma tentativa. \n\n\nInstituições envolvidas no projeto Khan Academy no Brasil:\n\nA Fundação Lemann é parceira internacional da Khan Academy no Brasil e tem experiência na implementação da plataforma em diferentes contextos educacionais, incluindo ONGs, instituições de ensino públicas e privadas.\n\nComo instituições parceiras do projeto no Brasil, temos o Instituto Península, o Instituto Natura e o Ismart. Ainda, agradecemos o apoio do Instituto Singularidades no desenvolvimento deste programa de formação.\n\nParticipe de outros cursos da Fundação Lemann no Coursera - https://www.coursera.org/lemann\n\n                                            Syllabus\n                        AquecimentoConheça a proposta do curso e os outros cursistasConheça a Khan AcademyConheça o conceito de plataformas adaptativas, a história da Khan Academy -  a maior plataforma adaptativa do mundo - e inicie a exploração guiada de seus recursos, como a criação de login, avatar e a realização do \"aquecimento para a missão\"Recursos da Khan Academy para aprenderConheça os elementos de gamificação da Khan Academy e seus mecanismos que refletem o conceito de 'aprendizagem para o domínio'. Vivencie a imersão do ponto de vista do aluno, compreendendo o funcionamento da plataforma, sua organização e experimentando os recursos voltados para a aprendizagemRecursos da Khan Academy para ensinarConheça os diferentes tipos de relatórios disponíveis na plataforma, saiba utilizá-los segundo os seus objetivos pedagógicos e, ainda, entenda como você pode recomendar conteúdos para seus alunos ou para um grupo deles. Comece simples, mas comeceColoque a mão na massa! Saiba quais são os primeiros passos para começar a utilizar a plataforma com seus alunos e reflita sobre as possibilidades de uso, de acordo com os recursos disponíveis e suas intenções pedagógicas. O importante é começar!Acompanhando o progresso e dinamizando a aprendizagemAprimore suas experiências de uso da plataforma, realizando desafios de análise dos dados a partir das informações das suas turmas. Conheça a experiência de professores brasileiros que, como você, ousaram inovar!Quer saber mais?Referências para conhecer mais sobre a Khan Academy, sobre o uso de tecnologias na aprendizagem e sobre nosso trabalho\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Explorando os recursos educacionais da Khan Academy", 
    "price": 0, 
    "instructors": "Julciane Rocha and Ana Paula Manzalli ", 
    "institution_name": [
        "Fundação Lemann"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/learn/khanacademy", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}