{
    "selfpaced": false, 
    "topic_name": [
        "Online Education"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    ltto-001\n                                                                    ltto-002\n                                                                    ltto-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Are you an educator? Have you ever wanted to understand more about how \nto design your course to make better use of educational technology – \nwhether fully online or in blended contexts? Would you like to learn \nfrom those who have extensive practical experience with online \ntechnologies? This course is designed to help you develop a working \nunderstanding of successful online teaching strategies that you can \napply in your own practice. Integrating online technologies into\n your teaching can be a challenging prospect, and it can be difficult to\n know how to approach it effectively for the benefit of both students \nand yourself. No one knows your own content and teaching strengths \nbetter than you, and the “one size fits all” formula doesn’t always suit\n everyone. No matter what type of technology you are interested in \nexploring or your level of experience, this course will help you draw on\n your teaching strengths and find the approach that is right for you, \nyour students and your educational context. To allow both for breadth in\n personalization and depth in key areas that interest you, this course \nwill guide you through your journey of understanding how online \ntechnologies can enhance your course design. Watch interviews with the Course Instructors Simon McIntyre and Negin Mirriahi discussing the motivations behind the course.Announcement for US based teachers:Coursera and its partners are proud to offer eligible teachers in the United States free Verified Certificates for this course and other high-quality teacher professional development courses, through the ConnectED effort announced by President Obama.\nTo participate in this opportunity, U.S. district leaders should approve Coursera MOOCs as teacher professional development by completing a brief form at: www.coursera.org/tpd. U.S. teachers who are interested in this opportunity are also encouraged to follow the link to learn more and complete the form.\n\nOnce a district’s form has been verified, the district leader will be notified and teachers in the district will receive access to free verified certificates for Coursera professional development. Coursera and UNSW thank educators for the hard work they do every day and hope this opportunity will assist US teachers to continue developing their craft in a meaningful and flexible way.\n\n                                            Syllabus\n                        The course runs for 6 weeks. However, those wishing to \nachieve a pass grade can complete the course as quickly as they wish, \nwhile those wishing to achieve a distinction grade must complete two \noptional peer reviewed assessments over the duration of the course.The\n course consists of 8 modules that can be completed in any order - \nparticipants can choose which ones they engage in based on their \ninterest and experience:Module 1 What is online teaching and why is it important? An overview of online ethnographies and technologies and their place in contemporary education.Module 2 Open and closed technologies:\n An examination of the pros and cons of the use of open web 2.0 tools \nvs. institutionally supported systems in educational contexts, and an \nexamination of relevant activities.Module 3 Planning online learning: Understand\n how to define your learning outcomes, develop appropriate online \nactivities and assessment strategies, and to choose the right technology\n to use. These themes are continually revisited throughout the remainder\n of the course.Module 4 Online learning activities: Types\n of online activities and teaching scenarios. An overview and \nexemplification of a range of fully online, blended and mobile learning \nscenarios, online resources and activities. Issues concerning \naccessibility and inclusivity are also explored.Module 5 Online assessment strategies: An\n explanation of aligning assessment with learning outcomes and designing\n assessments for learning. Considerations of using technology to enhance\n assessments – benefits to the instructor and the students are \ndiscussed. Design and purpose of standards-based assessment and rubrics,\n and issues concerning assessment feedback and practical affordances \nprovided by technologies are also explored.Module 6 Online resources: What\n role can online resources play in effectively supporting student \nlearning? Understand how to find and use a range of Open Educational \nResources (OER) in your class, and explore options for creating and your\n own online resources. Issues of Creative Commons and Copyright in \nonline education are also discussed.Module 7 Engaging and motivating students: How\n to manage your time online as an instructor. Best practices are \ndiscussed and identified for building an online community of learners. Module 8 Evaluation strategies:\n What are some evaluation methods for determining whether your course \ndesign change has been effective? How can learning analytics from the \nuse of online technologies help you identify that your course design is \nhelping meet your intended aims and outcomes? Suggestions are offered \nfor ways of gaining feedback from students to inform your continued \nteaching practice and pedagogical decisions.\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Learning to Teach Online", 
    "price": 0, 
    "instructors": "Simon  McIntyre", 
    "institution_name": [
        "University of New South Wales"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/course/ltto", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-07-06T00:00:00Z"
}