{
    "selfpaced": false, 
    "topic_name": [
        "Online Education"
    ], 
    "description": "\n\n                    \n                    \n                    L’objectif de cette formation est d’appréhender les principaux aspects de la conception d’un MOOC : de la propriété intellectuelle à l’ingénierie pédagogique en passant par la gestion de projet. La formation est essentiellement axée autour de problèmes pratiques ; elle s’adresse à toute personne s’intéressant aux MOOC, que l’objectif soit d’en créer un ou simplement de s'informer. Les objectifs de la formation sont multiples :\r\n\r\nComprendre la diversité des formats de MOOC\r\nAppréhender les principaux problèmes de propriété intellectuelle\r\nScénariser un cours dans son ensemble et concevoir des activités adaptées\r\nSavoir concevoir des vidéos pédagogiques\r\nPouvoir animer et piloter un MOOC\r\nFaire l'analyse et le bilan du projet\r\n\r\nUn tronc commun d’environ six heures de vidéos permet de se familiariser avec ces différentes thématiques. Pour ceux qui souhaiteraient approfondir ces questions, nous vous proposons quatre parcours distincts permettant de répondre à la diversité des attentes et des besoins des uns et des autres. Les charges de travail et les attendus pour chaque parcours sont variables.\r\n\r\nUn premier parcours, intitulé Analyse, vous permet de faire l’analyse du MOOC de votre choix. Basé sur un travail individuel, il réclame un investissement modéré.\r\n\r\nLes trois autres parcours sont basés sur votre propre idée de MOOC. Si le format des rendus est dans une certaine mesure contraint, le sujet est en revanche libre. Vous pourrez proposer votre propre projet, ou bien rejoindre le projet d’un autre participant. Les différents livrables peuvent être réalisés de manière individuelle ou collective.\r\n\r\nLe parcours Initiation vous permettra de cadrer votre projet et d’en faire une analyse stratégique. C’est également l’occasion de travailler sur votre bande-annonce et sur la page de présentation du projet.\r\nLe parcours Scénarisation est consacré à la structuration de votre MOOC, aux ressources et aux activités que vous souhaitez mettre en place, avec une attention toute particulière sur la faisabilité du projet.\r\nLe parcours Vidéo pédagogique est dédié à ceux qui souhaitent se consacrer exclusivement à la réalisation de vidéos éducatives.\r\n\r\nLes apprenants ayant réalisé intégralement un parcours, c'est-à-dire qui auront rendu les travaux requis dans les délais impartis et participé aux évaluations pourront obtenir une attestation en fin de MOOC.Pour ceux qui souhaitent rejoindre la communauté en amont du lancement du cours, deux groupes ont été créés dans les réseaux sociaux : un groupe Google+ et un groupe Facebook. Ils rassemblent d’ores et déjà plusieurs centaines de participants. Vous pouvez également nous retrouver sur Twitter via le hashtag #MOOCAZ.\n\n                                    ", 
    "end_date": "2015-12-14T00:00:00Z", 
    "title": "Monter un MOOC de A à Z", 
    "price": 0, 
    "instructors": "Matthieu Cisel", 
    "institution_name": [
        "Université Paris-Saclay"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/ENSCachan/20002S04/session04/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-11-02T00:00:00Z"
}