{
    "selfpaced": false, 
    "topic_name": [
        "K12"
    ], 
    "description": "\n\n                    \n                    \n                    The Common Core State Standards and Next Generation Science Standards emphasize improving the quality of student-to-student discourse as a major feature of instruction. The new standards specifically describe the importance of students understanding the reasoning of others and engaging in meaningful conversations using evidence for claims. Yet this type of student-to-student interaction tends to be rare in classrooms. Common classroom teaching activities such as whole class discussions, jigsaws, and think-pair-shares can have the appearance of constructive interactions, but they often do not provide adequate opportunities for all students to engage in back-and-forth dialog. This short course looks closely at student-to-student conversations and addresses ways to improve students' abilities to engage in the types of interactions described in the new standards.\r\nThis course consists of four main sessions with three weeks between each session in order to provide extra time for application and reflection. The learning in this course relies heavily on participant contributions and comments, especially in the team collaboration setting. Participants will be expected to complete both team and individual assignments for all sessions. The sessions and assignments are designed for participants who teach or have access to classrooms in which they can gather samples of students’ conversation during lessons. Finally, we include resources and tasks for instructional coaches and others who support teachers and build school-wide capacity. Please note that this is a slightly modified version of a previous course offered in Spring, 2014. This course is targeted towards secondary school teachers.\r\nWe hope you will join us on this exciting journey.\n\n                                    ", 
    "end_date": "2015-01-07T00:00:00Z", 
    "title": "Constructive Classroom Conversations: Mastering Language for College and Career Readiness (Secondary)", 
    "price": 0, 
    "instructors": "Sara Rutherford-Quach, Jeff Zwiers and Kenji Hakuta", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://novoed.com/classroom-conversations-secondary", 
    "duration": "14 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2014-10-01T00:00:00Z"
}