{
    "selfpaced": false, 
    "topic_name": [
        "K12"
    ], 
    "description": "\n\n                    \n                    \n                    Given their emphasis on complex and sophisticated disciplinary skills and understandings, the Common Core State Standards and Next Generation Science Standards require ways of assessing that go beyond routine multiple-choice tests. Whether students are learning to select, use, and explain evidence to support a claim or to analyze data to evaluate a hypothesis, tests that require that students only bubble in a scantron are inadequate to measure (or support) students’ learning and growth. Performance assessments are more suited to this task. Performance-based tasks require that students create and produce rather than recall and regurgitate. While performance assessments vary along multiple dimensions, including duration and focus, they all demand that students use and apply critical skills and knowledge to demonstrate understanding.\r\nThis nine-week course will focus on building educators’ capacity to use, develop, and implement curriculum-embedded performance assessments that fit local contexts. Course activities include evaluating sample performance tasks and developing and implementing a performance task that is aligned with a specific curricular unit and performance outcomes. We will use a learning-centered approach where assessments are not only about measuring learning, but are also events for learning.\r\nThis MOOC is designed for grade 6-12 teachers working in the core disciplines of mathematics, language arts, history/social studies, and science. It is recommended that participants currently teach or have access to a classroom for which they can design a performance assessment and then implement that assessment. Participants will work collaboratively with other educators in their discipline to accomplish course learning goals and assignments.\r\nThe four main objectives of this course are for participants to:\r\n\r\nUnderstand and identify features of high quality performance assessments;\r\nDevelop a grade-level, course-specific, practical, performance task that is aligned with (and embedded within) a curricular unit of study;\r\nBegin to use data from performance tasks to tailor and improve instruction and curriculum;\r\nContribute to building an online community of educators focused on using performance-based assessments to identify and develop students’ abilities.\r\n\n\n                                    ", 
    "end_date": "2016-06-14T00:00:00Z", 
    "title": "Designing for Deeper Learning: How to Develop Performance Tasks for the Common Core", 
    "price": 0, 
    "instructors": "Ruth Chung Wei, Daisy Martin and Raymond L. Pecheone", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://novoed.com/designing-performance-tasks-2-0", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2016-04-12T00:00:00Z"
}