{
    "selfpaced": false, 
    "topic_name": [
        "K12"
    ], 
    "description": "\n\n                    \n                    \n                    You will discover the world of children in the early years. Though child development patterns are reasonably universal, every child is unique, has individual potential and will learn differently from their peers.\r\nBy exploring many aspects of child development and learning you will gain insight into how to support infants, toddlers and pre-schoolers during this critical stage of life.\r\nWhat will I learn?\r\n\r\nThe stages of child development from birth to five years and some important milestones\r\nThe different domains in which children develop, and how care givers can support the development in each domain\r\nLaws and regulations that guide the care and education of children in Australia and internationally\r\nThe belonging, being and becoming framework for understanding children’s developmental needs\r\nHow children’s brains develop, and the importance of interactions with care givers in this process\r\nThe importance of play in child development and learning\r\nThe concepts of attachment and reciprocity, and their importance in early childhood education\r\nWhy taking risks is a essential part of children’s learning and development\r\nPositive forms of behaviour guidance, especially for toddlers\r\n\r\nThis course requires approximately 2 - 4 hours of study per week, but can vary depending on the student. This includes watching videos, and taking quizzes and assessments.\r\nIf you pass this course you'll receive a Certificate of Achievement. While this certificate isn't a formal qualification or credit, you can use it to demonstrate your interest in learning about this area to potential employers or educational institutions.\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nEarly childhood teacher\r\nChild care coordinator\r\nChild care worker\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: THE WORLD OF THE CHILD\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: BELONGING\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: BEING\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: BECOMING\r\n\r\n\r\n\r\n\n                                    ", 
    "end_date": "2016-02-08T00:00:00Z", 
    "title": "Early Childhood Education", 
    "price": 0, 
    "instructors": "Helen Lawrence and Caitlin O’Connell", 
    "institution_name": [
        "Gowrie Victoria"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.open2study.com//node/1768", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open2Study"
    ], 
    "start_date": "2016-01-11T00:00:00Z"
}