{
    "selfpaced": false, 
    "topic_name": [
        "K12"
    ], 
    "description": "\n\n                    \n                    \n                    The Digital Learning Transition in K-12 Schools massive online open course for educators (DLT MOOC-Ed) will help you:\r\n\r\nUnderstand the potential of digital learning in K-12 schools;\r\nAssess progress and set future goals for your school or district; and\r\nPlan to achieve those goals.\r\n\r\nThe DLT MOOC-Ed is designed for school and district leaders, such as superintendents, principals, curriculum directors, technology directors, financial officers, instructional coaches, library media specialists, and lead teachers, as well as university faculty, consultants, parents and any others involved in planning and implementing K-12 digital learning initiatives.\r\nWe invite participation from public, charter and private schools. While the course materials are U.S. focused, we invite educators from around the world and found that international perspectives enriched the experience for everyone in prior courses. There is no cost for participating in the DLT MOOC-Ed.\r\nWe recommend, when possible, participation by teams from schools, districts or other organizations, since having local colleagues work together to relate the lessons from the DLT MOOC-Ed to their own context makes the course even more valuable. If a team is not available, individuals are welcome to participate on their own.\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\n\r\nUnit 1 - Envisioning Schools in the Year 2020 \r\n\r\n\r\nUnit 2 - Changing the Culture of Teaching and Learning \r\n\r\n\r\nUnit 3 - Digital Learning Transitions: Goals and Challenges \r\n\r\n\r\nUnit 4 - Wrap Up of Part I \r\n\r\n\r\nUnit 5 - Teaching and Professional Learning \r\n\r\n\r\nUnit 6 - Planning for Selected DLT Elements \r\n\r\n\r\nUnit 7 - Leading a Successful Digital Learning Initiative \r\n\r\n\r\nUnit 8 - Wrap Up and Next Steps \r\n\r\n\r\n\r\n\r\n\n                                    ", 
    "end_date": "2015-11-30T00:00:00Z", 
    "title": "Leading the Digital Learning Transition", 
    "price": 0, 
    "instructors": "Mary Ann Wolf and Glenn Kleiman", 
    "institution_name": [
        "Friday Institute", 
        "North Carolina State College of Education"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://place.fi.ncsu.edu/course/view.php?id=11", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "MOOC-ED"
    ], 
    "start_date": "2015-09-28T00:00:00Z"
}