{
    "selfpaced": false, 
    "topic_name": [
        "K12"
    ], 
    "description": "\n\n                    \n                    \n                    The Common Core State Standards for Mathematics are notable for raising the rigor of student language demands during math instruction. Students are expected to understand complex problems, engage in constructive classroom conversations about math, and clearly support their reasoning with evidence.\r\nIn this course teachers will be provided with a range of practical tools for gathering and analyzing language samples that show how students learn and what supports they need in elementary math classrooms. These tools can support formative assessment and instructional planning. Focal topics include developing students' language for engaging in the eight Common Core mathematical practices, fostering constructive conversations, and communicating evidence and reasoning. This course will also enable teachers to collaborate with other educators and build professional relationships that result in an online community focused on improving students’ abilities to use rich academic language to learn and show learning of mathematical skills and concepts.\r\nWhile the course is intended specifically for those who teach English learners and students with disabilities, the content of this course is equally applicable to teaching all students who are challenged by the academic uses of language in math instruction.\n\n                                    ", 
    "end_date": "2014-04-30T00:00:00Z", 
    "title": "Mastering Language for the Common Core State Standards: Focus on Mathematics in Elementary Grades", 
    "price": 0, 
    "instructors": "Sara Rutherford-Quach, Jeff Zwiers and Kenji Hakuta", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://novoed.com/mastering-language-common-core-2", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2014-03-26T00:00:00Z"
}