{
    "selfpaced": false, 
    "topic_name": [
        "K12"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    digitalstorytelling-001\n                                                                    digitalstorytelling-002\n                                                                    digitalstorytelling-003\n                                                                    digitalstorytelling-004\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Powerful\nTools for Teaching and Learning: Digital Storytelling introduces educators to\ndigital storytelling and explores ways to use digital stories to enhance\nstudents’ learning experience. The course is designed to be comprehensive yet\nfundamental. By comprehensive we mean that the course provides a solid foundation to all of the components of a digital story and illustrates these components with tutorials,\nexample stories and links to additional readings. The course also provides a hands-on\nopportunity for learners to create their own digital stories. The course is\nfundamental because it covers the basic process of creating a digital story starting\nwith just a simple script and as little as one still image. This course is intended for K-12 teachers in all\ndisciplines, although it is open to anyone with an interest in digital storytelling. Course participants will use WeVideo, a free web-based video editing program to create a digital story that could be shared online and with students in the classroom. Teachers in the state of Texas may be eligible to receive Continuing Education\nUnits if they complete the major requirements of the course.\n\n                                            Syllabus\n                        Over the course of eight weeks, we will cover the following topics:\n\nTopic 1: Choosing a topic and purpose\nTopic 1 introduces you to the basics of digital storytelling. You will learn to identify the fundamental elements of a good digital story and review examples used by educators across a varied curriculum. By the end of topic 1, you will be able to choose a topic and define the purpose of the story you will create for your classroom.\n\nTopic 2: Writing an effective script and creating a storyboard\nTopic 2 focuses on scriptwriting as you learn the steps in developing and writing a script for a digital story. You will explore the basic elements of a script, such as introduction, character development, tension and resolution that are necessary in developing a useful script. By the end of this topic, you will begin to understand the important steps and elements of scriptwriting. You will also learn to recognize the importance of selecting appropriate images and the value of creating a storyboard. During topic 2, you will also explore several useful ways to choose images for your digital story, including taking your own photos with a digital camera, using software applications to create charts, graphs and other images, and finding and downloading images from the web based on size, quality, type and usage rights. A step-by-step approach will be used to illustrate how these images will be used to support your script as a part of creating a digital story. By the end of this topic you will be able to envision your story's script in a visually interesting and useful storyboard.\n\nTopic 3: Recording audio narration\nIn topic 3, you will learn to record audio narration using digital devices so that your voice can be added to the digital story you will create. You will gain hands-on experience using some of the most common features of audio recording software to create high quality audio\nnarration. In addition, you will explore ways to improve your audio recording with basic editing tools. You will also learn how to find and download appropriate background music for your digital story that is in the public domain or is free of copyright restrictions. \n\nTopic 4: Using technology to build a digital story \nIn topic 4, you will learn to use WeVideo, a free online video editing application to assemble all of the elements (text, images, narration, music) to create the full version of your digital story. In addition, you will learn to use basic editing techniques to improve your digital story so that all of the components of your story fit together and look and sound good.\n\nTopic 5: Revising, publishing and sharing the final digital story for use in the classroom\nIn topic 5, you will revise the final version of your digital story, publish it online and discuss how it might be used in the classroom to support teaching and learning. You will also have an opportunity to reflect on the digital storytelling process and discuss the challenges you faced, how you dealt with these challenges, the most significant things you learned during the course and how you think you might use digital storytelling in the future.\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Powerful Tools for Teaching and Learning: Digital Storytelling", 
    "price": 0, 
    "instructors": "Bernard Robin and Sara Mcneil", 
    "institution_name": [
        "University of Houston System"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/course/digitalstorytelling", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-01-18T00:00:00Z"
}