{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to <strong>Administering Windows Server 2012 (70-411)</strong> from LearnSmart.</p><p>This course provides foundational knowledge of the principles, techniques, and tools needed to successfully prepare for the <strong>Microsoft Exam 70-411</strong> that is key to earning your <em>MCSA Solutions Associate </em>or <em>MCSE Solutions Expert</em><em> </em>Certifications. Once in our course review our course map to see just how we align and partner with Microsoft in providing this training.</p><p>This is the 2nd Course in our 5 Course Windows Sever 2012 Series including:<br></p><ol><li>Installing and Configuring Windows Server 2012 (70-410)</li><li><em><strong>Administering Windows Server 2012 (70-411)</strong></em></li><li>\t\tConfiguring Server 2012 (70-412)</li><li>Designing Server 2012 (70-413)</li><li>Implementing Server 2012 (70-414)</li></ol><p><strong>Course Overview:</strong><strong></strong></p><p>This course is designed to prepare the student for the <em>Microsoft Windows Server 2012 Exam 70-411</em>. Students will like a look at how to administer, deploy, configure, &amp; monitor network servers as well as various advanced files. Learn the main exam objectives by learning these key concepts we cover:</p><ul><li>Deploy, manage, and maintain servers </li><li>Configure File and Print Services </li><li>Configure network services and access</li><li>Configure a Network Policy Server (NPS) infrastructure</li><li>Configure and manage Active Directory</li><li>Configure and manage Group Policy </li></ul><p>Our lectures are paired with a variety of demonstrations and quizzes giving visual example  and real world look of the concepts that will be talked about.</p><p>Our sections listed below are can be taken in any order, as a review of a particular concept or exam domain. However, if you are just becoming familiar with the sever operating systems and basic networking, it is recommended that you view the courses sequentially.</p><p><strong>Course Breakdown:</strong></p><p><strong>Section 1</strong>: Learn how to deploy, maintain and monitor Windows Server 2012. Utilize the deployment services, windows server update services and how the main monitoring solutions in Server 2012</p><p><strong>Section 2:</strong> Know how to appropriately assign access rights to users, securely track access to resources, and how to provide up to date and efficient access to those resources.</p><p><strong>Section 3:</strong> Look at the configuration of network access and services in Windows Server 2012 by become familiar with the components of DNS, how to configure and maintain DNS, and how to use remote access.</p><p><strong>Section 4</strong>: Gain a thorough understanding of the network policy server infrastructure and how to properly configure one to benefit an organization.</p><p><strong>Section 5</strong>: Review the enhancements and features of the Active Directory Domain Services and walk through the process of hosting a domain database and providing security-related services throughout an enterprise.</p><p><strong>Section 6</strong>: Learn the skills needed to work within the Group Policy Management Console, how to configure and control Group Policy settings, and about the resourcefulness of Group Policy templates.</p><p><strong>Section 7</strong>: Cover virtualization of Windows Server 2012 R2 domain controllers, updates to remote access in Windows Server 2012 R2, and updates to distributed file system in Windows Server 2012 R2.</p><p><strong>Recommendations:</strong><br></p><p>Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul><li><em>Great Material - This course is a great reference and way to refresh your skills for the new Net+ exam! I needed a good refresh before taking the exam and this course is clearly laid out and copiously covers the material for the exam. Great course, well worth the money! -- M.B.</em></li><li><em>Perfect Course - Not only do you get great lectures that are pretty much PowerPoints with an instructor teaching you the concepts, there are also Demo lectures that show you how each of the concepts works in real life. This is such valuable information to have when taking the test. I feel very confident that this course is the best Network+ course on Udemy. -- D.R. Jr.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul>", 
    "end_date": null, 
    "title": "Administering Windows Server 2012 (70-411)", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "21 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636184_f1c8.jpg", 
    "course_url": "https://www.udemy.com/administering-windows-server-2012-70-411/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T20:55:57Z"
}