{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong style=\"\">Advanced Excel 2007 </strong>is a course aimed at the excel user who is fairly competent on the software but is just looking for a few more handy tips and tricks to really get to know what this software can do. If you are handling data, or have the responsibility for analyzing data or presenting information in a useful format - reports for your team, or managers etc., then this course will be very handy.</p><p>We don&#039;t want you to spend a day of your life in the classroom... learn 4 useful, practical things which you can apply on your job or on your projects.</p><p><strong style=\"\"><em style=\"\">1. Goal seek and &#039;what if&#039; analysis</em></strong></p><p>When working with worksheet models - do you have the answer you want, but must work backward to find the input value that gives you that answer? Goal seek will help you. If you have to analyse scenarios for forecasting - what if X happens, instead of Y? The &#039;what if&#039; section will help you.</p><p><strong style=\"\"><em style=\"\">2. Data Tables</em></strong></p><p>Data can be confusing and difficult to interpret or understand if it&#039;s not presented in logical format. Data tables can really help.</p><p><strong style=\"\"><em style=\"\">3. Using Pivot Tables</em></strong></p><p>A pivot table is an interactive worksheet table that quickly summarizes large amounts of data using a format and calculation methods that you may choose yourself.</p><p><strong style=\"\"><em style=\"\">4. Extended graphics</em></strong></p><p>Analyse the trends that are apparent and create charts to present information clearly for work reports, essays and assignments.</p><p>The target audience is those who are at an intermediate level with Excel and want to learn other handy functions and features. We use Excel 2007 only in this course. If you have Excel 2003, this course will be difficult to follow as although the functions and features exist in 2003, the layout changed very dramatically between the two versions. Excel 2007 isn&#039;t too dissimilar from 2010.</p><p>A booklet with screen shots is given in lecture one, so that you can follow step by step what we do in each lecture. We also provide a spreadsheet with each lecture - for you to practice what was done in that lecture/</p><p>The course will take approx 2-3 hours to complete.</p><p>Take this course if you want to take your intermediate-level understanding of Excel to an advanced level.</p>", 
    "end_date": null, 
    "title": "Advanced Excel 2007", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371826_77a4_3.jpg", 
    "course_url": "https://www.udemy.com/advanced-excel-2007/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T22:21:26Z"
}