{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Dans ce cours, vous allez découvrir l'application Terminal de votre Mac.</p><p><strong>Zéro connaissance requise</strong></p><p>Cette formation est pour ceux qui <strong><em>débutent</em></strong>. Pas pour les administrateurs système et les responsables réseaux!</p><p>Le cours est conçu pour ceux qui veulent mieux contrôler leur Mac et apprendre comment devenir un \"power user\".</p><p><strong>Plus rapide, plus efficace, plus puissant</strong></p><p>A la fin de cette formation, vous serez plus productif que n'importe quel utilisateur de Mac: vous écrirez une ligne de commande qui remplacera 12 \"clics\" de souris!</p><p>En moyenne, un utilisateur du clavier et du Terminal passe <strong>6 fois moins de temps</strong> sur ses dossiers et fichiers qu'un utilisateur de la souris dans l'interface graphique de Mac OS X.</p><p><strong>Comment suivre ce cours?</strong></p><p>Il est conseillé de refaire les manipulations de la vidéo depuis <strong>votre propre Terminal</strong>: c'est ainsi que vous apprendrez rapidement et que vous vous habituerez à l'utilisation de l'interface \"ligne de commande\".</p><p>Quand c'est possible, <strong>comparez </strong>l'utilisation d'une commande dans le Terminal avec la manipulation nécessaire dans le Finder (à la souris et au clavier): <em>au bout des deux premières leçons, vous serez convaincu du gain de temps grâce au Terminal...</em></p><p><strong>Des questions?</strong></p><p>Le Terminal est un apprentissage permanent.</p><p>Commencez par une utilisation de base et appliquez vos connaissances avancées petit à petit.</p><p>Il n'est jamais nécessaire de tout connaître: si vous avez des questions dans le cadre de ce cours, je vous répondrai.</p><p>Pour cela, il vous suffit de la poser dans le fil de la discussion du cours.</p>", 
    "end_date": null, 
    "title": "Apprendre le Terminal de Mac OS X", 
    "price": "25.00", 
    "instructors": "Vincent Krief", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644596_70a1_4.jpg", 
    "course_url": "https://www.udemy.com/apprendre-le-terminal-sur-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T10:45:11Z"
}