{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t <strong style=\"\">DESCRIÇÃO:</strong>  </p>  <p>  \t O mundo está mudando muito rápido. É chegada a hora de você mudar a maneira de aprender e ficar atualizado com as mais recentes tecnologias de virtualização de Desktops (VDI) e entrega de aplicativos (Application Delivery).  </p>  <p>  \t Com o novo curso Citrix XenApp 6.5 a um preço muito competitivo e disponibilidade de qualquer lugar e a qualquer hora em múltiplas plataformas, incluindo o iPad e Windows, você pode sempre escolher o seu melhor horário, onde quer que você vá.  </p>  <p>  \t Além disso, você pode economizar tempo e dinheiro como você pode se inscrever para estes cursos e estudar em qualquer lugar, ao mesmo tempo premiar-se com a flexibilidade, luxo e estudar em seu próprio ritmo, ao mesmo tempo. As habilidades que você deve adquirir vai ajudá-lo com a fomentar as relações de longo prazo com os colegas e parceiros, conhecer pessoas interessantes e aproveitando as ideias para o futuro.  </p>  <p>  \t <strong style=\"\">A quem se destina?</strong>  </p>  <li> Para aqueles que querem aprender Citrix XenApp 6.5</li>  <li> Cursos on-line de qualidade que podem ajudá-los a impulsionar o seu conjunto de habilidades</li>  <li> Aspire para uma carreira de sucesso por ter conhecimento holístico sobre a sua área de especialização</li>  <li> estão ansiosos para aprender, mas são limitados pelo tempo e condicionalismos geográficos</li>   <strong style=\"\">Por que nos Escolher?</strong>  <p>  \t Com mais de 15 anos de experiência no gerenciamento e implementação de servidores e virtualização de desktop, temos a certeza de que somos capaz de contribuir com o seu aprendizado na arte de virtualizar e entregar aplicativos sob demanda para qualquer dispositivo a qualquer hora e em qualquer lugar.  </p>", 
    "end_date": null, 
    "title": "Aprenda Citrix XenApp 6.5", 
    "price": "50.00", 
    "instructors": "Cleriston Cardoso Cabral", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/178038_7e99.jpg", 
    "course_url": "https://www.udemy.com/xenapp65/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T19:03:26Z"
}