{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t <strong style=\"\">* Um certificado de conclusão digital válido é oferecido para os estudantes que completarem o curso. </strong><strong style=\"\">O seu certificado tem um código de verificação para autenticidade.</strong>  </p>  <p>  \t<strong style=\"\">Parabéns pela sua decisão em se aventurar pela linha de comando do Linux</strong>. O objetivo do nosso curso é te ajudar a entender principais comandos de manipulação de textos/arquivos dentro do terminal Linux.  </p>  <p>  \t      O curso foi criado com o objetivo de levar um aprendizado descomplicado e empolgante. Através de videoaulas diretas e rápidas você utilizará comandos linux já nos primeiros 5 minutos. A abordagem é &quot;hands-on&quot;, ou seja, sempre focado em obter um resultado para o comando desenvolvido. O importante é despertar em você o interesse e aguçar a curiosidade pelo trabalho na CLI (command line interface).  </p>  <p>  \t  Além das videoaulas completas e diaticamente elaboradas (com a experiência de já ter ministrado esses mesmos ensinamentos presencialmente dezenas de vezes) você ainda contará com:  </p>  <ul style=\"\">  \t<li>Máquina virtual prontinha para você apenas baixar e começar a fazer o curso no mesmo dia;</li>  \t<li>Apostila de exercícios contendo todas as atividades desenvolvidas nas video-aulas;</li>  \t<li>Listas de exercícios extras que são disponibilizadas na última seção do curso para que você sedimente tudo que foi ensinado e praticado durante o curso;</li>  \t<li>Perguntas teste de fixação ao final de cada sessão. Nada chato e tedioso! Mas sim perguntas diretas para reforçar seu aprendizado.</li>  </ul>  <p>  \t  Em quanto tempo você consegue terminar esse curso?  </p>  <p>  \t  Bom, você pode realizá-lo até mesmo em um único dia! Mas te aconselho quebrar o aprendizado em pelo menos 2 ou 3 dias e o mais importante: PRATIQUE AS ATIVIDADES!  </p>  <p>  \t  Mas quais os benefícios que você como aluno irá obter a partir desse curso?  </p>  <ul style=\"\">  \t<li>Você aprenderá conceitos básicos de uso da linha de comando do terminal Linux</li>  \t<li>Conhecerá os principais comandos de manipulação de textos e arquivos do sistema operacional</li>  \t<li>Entenderá conceitos fundamentais para melhor utilização do &quot;poder de fogo&quot; do Linux, como por exemplo o conceito de piping de comandos</li>  \t<li>Descobrirá como criar e apagar pastas a partir da linha de comando.</li>  \t<li>Vai ainda descobrir porque o Linux possui um comando para mostrar um arquivo de trás pra frente e outro para mostrar o conteúdo da forma tradicional</li>  </ul>  <p>  \t  Ou seja, ao concluir esse curso você será capaz de manipular conteúdo de arquivos, copiar, apagar e criar arquivos e diretórios além de ter uma noção melhor de como o sistema operacional funciona &quot;sob o capô&quot;.  </p>  <p>  \t      O escopo do curso é linha de comando, letras brancas e fundo preto. São poucos analistas e profissionais da área de tecnologia que se enveredam pela linha de comando pois preferem o caminho mais fácil com janelas e ícones coloridos ;-). Quer um diferencial no mercado de trabalho? Aprenda BASH!  </p>  <p>  \t      O objetivo do curso é ainda, te apresentar os comandos de forma rápida e então trazer problemas para serem resolvidos com a utilização do que aprendeu. A abordagem pedagógica é de experimentação onde você deverá buscar/procurar/testar/fuçar/descobrir a utilização dos comandos. Use a ajuda do próprio shell!  </p>  <p>  \t      Ao invés de analisar as toneladas de opções de cada comando, iremos USÁ-LOS para resolver problemas.  </p>  <p>  \t  O instrutor desse treinamento possui vasta experiência no assunto tendo trabalhado diretamente com essa tecnologia e hoje é professor do curso de sistemas de informação ensinando há vários anos analistas, programadores e estudantes a trabalharem mais de perto com o sistema operacional.  </p>", 
    "end_date": null, 
    "title": "Aprendendo terminal Linux pondo a mão na massa!", 
    "price": "20.00", 
    "instructors": "Tiago Baciotti Moreira", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/205994_3f27_3.jpg", 
    "course_url": "https://www.udemy.com/aprendalinux/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-27T14:28:57Z"
}