{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong></strong>Welcome to <strong>Building and Optimizing a SQL Server Database: Microsoft 70-464 </strong>with LearnSmart.</p><p>The following lectures will prepare you for <u>Microsoft SQL Server 70-464 exam</u>, which goes toward the Microsoft Certified &amp; Professional (<u>MCP</u>) and <u>MCSE: Data Platform Solutions Expert</u> certification. These lectures teach the principles, techniques, and tools needed to successfully prepare for and pass the “Developing Microsoft SQL Server Databases” exam.</p><p>This is the 1st Course in our 2 Course SQL Server 2012 Database Series including:<br></p><ol><li><em><strong>Building and Optimizing a SQL Server Database: Microsoft 70-464 </strong></em></li><li>Designing a SQL Server Database and Storage Solution: Microsoft 70-465</li></ol><p><strong>Course Overview:</strong></p><p>This course is designed to prepare the student for the <em>Microsoft SQL Server 2012 Exam 70-464</em> Students will like a look at how to best build and implement databases. This course covers a majority of topics that you will find on the exam, including: creating tables, maintaining indexes, implementing data types, and working with XML data. Learn the main exam objectives by learning these key concepts we cover:</p><ul><li>Implement database objects</li><li>Implement programming objects</li><li>Design database objects</li><li>Optimize and troubleshoot queries</li></ul>\n<p>Our lectures are paired with a variety of demonstrations and quizzes giving visual example and real world look of the concepts that will be talked about.</p><p>Our sections listed below are can be taken in any order, as a review of a particular concept or exam domain. However, if you are just becoming familiar with SQL Server 2012 and it’s database, it is recommended that you view the sections sequentially.</p><p><strong>Course Breakdown:</strong></p><p><strong>Section 1</strong>: Gain a thorough overview of the various tools and services that are available for you to administer the SQL Server or develop applications.</p><p><strong>Section 2</strong>: Start writing SQL statements to define tables, insert data into tables, and update data in tables. </p><p><strong>Section 3</strong>: Best design &amp; implementing your tables and views by reviewing tables, normalization, denormalization, schemas, temporary tables and computed columns. Also be able to store the data in appropriate table structure and with appropriate attributes for each column.</p><p><strong>Section 4</strong>: Ensure data integrity and constraint considerations by learning about how to enforce data integrity at the application level, the types of data integrity, and the available options for enforcing data integrity with identity property and sequences.</p><p><strong>Section 5</strong>: Go over how to design and implement views in SQL Server, and will also talk about partitioned and indexed views<span></span><br></p><p><strong>Section 6</strong>: Within database development be able to monitor query performance, and how to optimize both further.<span></span><br></p><p><strong>Section 7</strong>: Review the core concepts related to the use of execution plans and learn how to read SQL Server Execution Plans.</p><p><strong>Section 8</strong>: Take a look at how to determine the outcomes of the decisions that SQL Server makes. We will cover the core concepts related to the use of execution plans, the roles of the most common execution plan elements, and how to work with execution plans.<span></span></p><p><strong>Section 9</strong>: Review stored procedures and all its potential benefits. We cover how to pass parameters to stored procedures and receive output, as well as how to control the execution context of a stored procedure. <span></span></p><p><strong>Section 10</strong>: Compare the user-defined functions in SQL Server to functions in high-level languages and become familiar with will be functions, procedures, and reusable components. This course will be paired with several demos that offer a real world example at the concepts that we will discuss.<br></p><p><strong>Section 11</strong>: Learn about the different options that SQL Server provides for manipulating data with triggers. Be able to determine when to use constraints and when to use triggers.<br></p><p><strong>Section 12</strong>: Meet complex business requirements by implementing managed code in SQL server and review importing and cataloging assemblies and choosing between managed code and T-SQL for your situation.</p><p><strong>Section 13</strong>: Understand locking mechanisms, isolation levels, and transactions to increase physical integrity of data for every transaction.</p><p><strong>Section 14</strong>: Learn about Transact-SQL error handling, how it has traditionally been implemented, and how to implement structured exception handling in T-SQL.<br></p><p><strong>Section 15</strong>: Go indepth into storing and querying Extensible Markup Languages (XML) data in SQL Server.<br></p><p><strong>Section 16</strong>: Review how to work with SQL Server Spatial Data by looking into types of spatial data, spatial reference identifiers,  spatial data in applications, and more</p><p><strong>Recommendations:</strong><br></p><p>Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul><li><em>Great Material - This course is a great reference and way to refresh your skills for the new Net+ exam! I needed a good refresh before taking the exam and this course is clearly laid out and copiously covers the material for the exam. Great course, well worth the money! -- M.B.</em></li><li><em>Perfect Course - Not only do you get great lectures that are pretty much PowerPoints with an instructor teaching you the concepts, there are also Demo lectures that show you how each of the concepts works in real life. This is such valuable information to have when taking the test. I feel very confident that this course is the best Network+ course on Udemy. -- D.R. Jr.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul>", 
    "end_date": null, 
    "title": "Building and Optimizing a SQL Server Database (70-464)", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653868_3fab_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-sql-server-70-464/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T21:10:05Z"
}