{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Hadoop is an Apache top-level project that allows the distributed processing of large data sets across clusters of computers using simple programming models. It allows you to deliver a highly available service on top of a cluster of computers, each of which may be prone to failures. While Big Data and Hadoop have seen a massive surge in popularity over the last few years, many companies still struggle with trying to set up their own computing clusters.</p><p style=\"\">This video series will turn you from a faltering first-timer into a Hadoop pro through clear, concise descriptions that are easy to follow.</p><p style=\"\">We&#039;ll begin this course with an overview of Amazon&#039;s cloud service and its use. We&#039;ll then deploy Linux compute instances and you&#039;ll see how to connect your client machine to Linux hosts and configure your systems to run Hadoop. Finally, you&#039;ll install Hadoop, download data, and examine how to run a query.</p><p style=\"\">This video series will go beyond just Hadoop; it will cover everything you need to get your own clusters up and running. You will learn how to make network configuration changes as well as modify Linux services. After you&#039;ve installed Hadoop, we&#039;ll then go over installing HUE—Hadoop&#039;s UI. Using HUE, you will learn how to download data to your Hadoop clusters, move it to HDFS, and finally query that data with Hive.</p><p style=\"\">Learn everything you need to deploy Hadoop clusters to the Cloud through these videos. You&#039;ll grasp all you need to know about handling large data sets over multiple nodes.</p><p style=\"\"><strong style=\"\">About the Author</strong></p><p style=\"\"><strong style=\"\">Sean Mikha</strong> is a technical architect who specializes in implementing large-scale data warehouses using Massively Parallel Processing (MPP) technologies. Sean has held roles at multiple companies that specialize in MPP technologies, where he was a part of implementing one of the largest commercial clinical data warehouses in the world. Sean is currently a solution architect, focusing on architecting Big Data solutions while also educating customers on Hadoop technologies. Sean graduated from UCLA with a BS in Computer Engineering, and currently lives in Southern California.</p>", 
    "end_date": null, 
    "title": "Building Hadoop Clusters", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546440_e99a_2.jpg", 
    "course_url": "https://www.udemy.com/building-hadoop-clusters/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T07:40:23Z"
}