{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong></strong><strong>APRIL 4, 2016 UPDATE: </strong>Udemy has introduced a new pricing structure today. Please message me with any questions you may have regarding this.<br><strong></strong></p><p><strong>Linux is the fastest growing operating system </strong><em><strong>in the world</strong></em><strong>. Get the CentOS Server skills you need to succeed with this comprehensive course.</strong></p>\n\n<p>Let's be honest; technical books are boring. Sure, you could learn CentOS 7 server administration from some long-winded encyclopedia, but why waste all that time?</p>\n\n<p><strong>Udemy's video content delivery system will have you operating your own CentOS sever in minutes.</strong></p>\n\n<p>If you want to increase your IT skills, this course is a great place to start. More and more companies are utilizing Linux servers in their day-to-day operations. <strong>So, don't be left behind!</strong></p>\n\n<p><strong>Inside, you'll learn:</strong></p>\n\n<ul><li><strong>What a computer server is and how it works</strong></li><li><strong>How to download and install CentOS 7 (it's FREE!)</strong></li><li><strong>To master getting around in a shell/command-line environment</strong></li><li><strong>How to connect to your server remotely with SSH</strong></li><li><strong>Basic Apache web server configuration and implementation</strong></li><li><strong>The process for creating basic Samba shares</strong></li><li><strong>How to configure 'mdadm' and form software RAID arrays</strong></li><li><strong>and so much more!<br><br></strong></li></ul>\n\n<p><strong>All course updates are 100% FREE. </strong>Buy this course one time and you own it for life. Not only that, but you will also gain lifetime access to me as your personal instructor. Have a question about CentOS? Just ask! You, as my student, will always be my #1 priority.</p>\n\n<p><strong>Wait, are you still reading this?! </strong>The course comes with a genuine 30 day, no hassles, money-back guarantee. So, there is absolutely nothing to risk here. <strong>Enroll today!</strong></p>", 
    "end_date": null, 
    "title": "CentOS 7 Linux Server: Alternative to Red Hat Enterprise", 
    "price": "25.00", 
    "instructors": "Cody Ray Miller", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513776_578b_5.jpg", 
    "course_url": "https://www.udemy.com/centos-7-linux-server-administration-alternative-to-red-hat-enterprise/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T16:21:27Z"
}