{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong style=\"\"></strong><strong style=\"\">Command Line Essentials: Git Bash on Windows</strong></p><p>This course is designed to cut academic theory to just the key concepts and focus on basics tasks in the <em style=\"\">Bash </em>command line in order to be productive quickly. Students can expect to learn the minimum needed to start using the Bash shell in less than an hour.</p><p><strong style=\"\">Course Outline</strong></p><p><em style=\"\">Course Introduction and Overview</em> provides an introduction to this course and the Bash shell environment.</p><p><em style=\"\">Installation </em>provides step-by-step instructions on how to setup Git for Windows and the Notepad++ text editor.</p><p>The real meat of the course is the <em style=\"\">Basic Commands</em> section, where we step through many of the common Bash commands and uses. Towards the end, we start putting the commands together to build a simple Bash script, which we also execute.</p><p>Finally, I share some final thoughts in the <em style=\"\">Conclusion</em>.</p><p><strong style=\"\">Course Features</strong></p><p>Presentations provide audio/video training of conceptual ideas. Since few like slide-ware presentations, slide-presentations are kept to a minimum.</p><p>Screencasts provide a video of the instructor&#039;s computer system with any actions, commands, or screens displayed and narrated -- this is the majority of the course.</p><p>Following the Basic Commands section, there is a downloadable reference of all the commands used in this course.</p><p>The quizzes reinforce the key concepts by testing your newly learned knowledge throughout the course.</p>", 
    "end_date": null, 
    "title": "Command Line Essentials: Git Bash for Windows", 
    "price": 0, 
    "instructors": "Jason Taylor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470424_5521.jpg", 
    "course_url": "https://www.udemy.com/git-bash/", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T02:35:15Z"
}