{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>***Course Content Updated as of November 5, 2015***</strong></p><p><strong></strong>Learn the skills and strategies used by professionals to <strong>repair computers</strong>. This beginner's course will empower you to <strong>fix your computer</strong> yourself and save a ton of money too. I have been <strong>repairing computers</strong> for 10+ years and am now ready to release these methods to the public.<br></p><p><strong>Repair Computers Using the Same Methods the Tech Repair Industry Charges $100/hr For.</strong></p><ul><li>Repair the 5 Most Common Computer Issues</li><li>Professional Secrets for Speeding Up Your Computer</li><li>Make Money by Fixing Other People's Computers</li></ul><p><strong></strong><strong>Valuable Skills That Can Save/Make You Lots of Money</strong></p><p>After learning these skills, you will wonder why you ever paid so much for getting your computer repaired. The methods you will learn are so simple to understand that you can follow along with the lectures and fix your computer in real-time.</p><p>The skills you will learn are commonly used by computer repair technicians. Since everything  today revolves around technology, technicians charge a ridiculous amount to fix our computers. I will teach you the skills they themselves use and much more.</p><p><strong>Content and Overview</strong></p><p>Created for beginners, this course will empower you to solve the 5 most common computer repair problems including: Computer is running slow, viruses and malware, Internet isn't working, computer is freezing, and annoying pop-up/banner ads.</p><p>After learning to solve these various problems, I get into the 'good stuff'. I will unveil the dirty secrets of the computer repair industry – the ones they want to charge you for! You will learn to optimize your computer to get it running at full speed, boost your web browser for uninterrupted browsing, and free up disk space using exclusive tools featured only in this course.</p><p>With these basics mastered, you will learn to fix other people's computers as well – no matter how specific the problem. An added benefit of this is that you can use these new skills to generate income by repairing other people's computers and devices. I expose the easiest way to learn to fix iPhones, video game consoles, and more.</p><p><strong>Still not sure?</strong></p><p>If you are still not sure about taking this course, maybe these stories of what the students before you experienced will be more useful than anything I can say about this course. Maybe you can relate with where they were when they took the course and what they got out of it.</p><p>\"<em>I'm really enjoying this course, it's so good and so easy to comprehend, it is one of the best thing I have seen, thank you for giving me this opportunity to get a job now I'm able to do a lot of stuff that I didn't know before. And this teacher explain things so easily.</em>\" - Roliveira, a student who moved to Cape Verde for 2 years on mission and upon returning home had no marketable skills.<br></p><p>\"<em>This is a great class that all people can use to make their computer use experience a lot more pleasurable and when issues come up give them some options on how to figure it out themselves.</em>\" - Mirko<br></p><p>\"<em>Great course for the fearful. Excellent video quality with engaging instructor. Great for those that are intimidated by tech stuff. Very clear instruction with over the shoulder examples. Simple and basic. Good resource links. Anyone can do it. Highly recommend course.</em>\" - Bill</p><p><strong>See how you can save money and make money by repairing computers!</strong></p>", 
    "end_date": null, 
    "title": "Computer Repair: Fix Your Own Computer At Home", 
    "price": "20.00", 
    "instructors": "Caleb Stultz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627464_dda8_7.jpg", 
    "course_url": "https://www.udemy.com/computer-repair/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T22:16:07Z"
}