{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "\n\n<p><em>Basically this course is designed for those students who have interest in computers , Especially computer science students . Because in this course they will be able to know the History of computers , Types , Classifications of computers , input , output devices and will learn about the various functions , system softwares and many more things they will learn . Quizzes are added for additional help .As we know computer science is the study of \"computing, programming, and computation in correspondence with computer systems\". This field of study utilizes theories on how computers work to design, test, and analyze concepts. Computer science usually has a stronger mathematical foundation than a scientific one. Computer science resonates as being vital for any industry to succeed in this day and age.</em><em>You will gain the knowledge that you need for academic and professional development and to learn that how computer science is playing important role in our professional and educational life.</em></p>\n\n<p><em>At the end of this course, I hope that you will have the material to meet your educational goals . </em><em>I  hope that this course will enhance your appreciation for the study of computer systems and aspects in our world . </em><em>Pictures are attached to explore the aspects briefly. Tables of symbols and actions with  short keys are also inserted in lectures.</em></p><ul><li><em></em></li></ul>\n\n<p><em>\n</em></p>", 
    "end_date": null, 
    "title": "Complete Understanding on  Computer - For Computer Users", 
    "price": "20.00", 
    "instructors": "Alia Mubashir", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/838222_55cf_2.jpg", 
    "course_url": "https://www.udemy.com/orientation-of-computers-a-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-03T07:03:45Z"
}