{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to the <strong>Configuring Windows 10</strong> <br></p>Welcome to the configuring windows 10. One of the fastest Microsoft windows at this moment is windows 10. You will learn about all features that you need in windows 10. And use these futures everywhere that you want<p>It is the best way to learn features inside of windows 10 plus networks of windows 10 together. and this course help you to learn both of them together<br></p><p><strong>Course Overview</strong>:</p><p>This course is different course with other windows 10 courses that you find in internet because I explained and show you all features inside of windows10 plus network of windows 10 and it is important how to use windows 10 in offices and companies that network computers with each other<br></p><p>By\n the end of this course you will be expert in windows 10 learning all features of windows 10 and you can use these features easily.<br></p><p><strong>Course Breakdown:</strong></p><p><br><strong>Session 1</strong>:\n You will learn  about what is windows 10 and hardware requirement for installing windows 10 on PC and Mobile<br></p><p><strong>Session 2</strong>: You will learn all features inside of windows 10 such as:</p><ul><li>how to use Microsoft edge that replace with Internet explorer</li><li>how to set picture password this is very useful in windows 10 that you can log in to windows 10 with your favorite photo</li><li>how to give backup from your files</li><li>how to create password USB drive</li><li>how to create shortcut Boot to access advance startup options quickly</li></ul><p><strong>Session 3</strong>:\n from this section i talk about network of windows 10.You will learn  about network concepts and devices such as Routers, \nSwitches and hubs. You learn about network addresses such as MAC Address\n and IP Address</p><p><strong>Session 4</strong>: the goal of this section includes features of windows 10 in networks such as:</p><ul><li>how to access other computers </li><li>how to share your internet with other Computers</li><li>how to share items</li><li>create VPN username and Connection then connect to the VPN</li><li>How to connect to the other computers via Remote Desktop</li><li>how to set NTFS Permission, Share Permission</li></ul><strong>Session 5</strong>:You will learn about how to set policy for users and groups such as:<ul><li>Set password policy</li><li>Restrict running software for users </li><li>Auditing</li></ul><p><strong>Session 6</strong>:In this section i talk about printers and how to install printers.  show you how to configure printers and set permission for printers</p><p><strong>Session </strong>7:In this section i talk about disk management. what is disk management, how to create different types of volumes in windows 10 and via command line<span></span><br></p>", 
    "end_date": null, 
    "title": "Configuring Windows 10", 
    "price": "20.00", 
    "instructors": "Aatef Jaberi", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792914_2e8d.jpg", 
    "course_url": "https://www.udemy.com/configuring-windows10/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T22:07:09Z"
}