{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>APRIL 4, 2016 UPDATE: </strong>Udemy has introduced a new pricing structure today. Please message me with any questions you may have regarding this.<br><strong></strong></p><p><strong>Would you like to build your own DVR for use with over-the-air, digital TV? Are you looking to learn (or increase your knowledge of) Linux with a hands-on, do-it-yourself project?</strong></p>\n\n<p><strong>Look no further! </strong>This practical course for beginners will teach you everything you need to know about building your own DVR. You don't need any previous experience with Linux or DVR systems; I'll show you how to install a powerful operating system called <strong>Mythbuntu</strong>. It's a fusion of <strong>Ubuntu Linux</strong> and a popular, open-source DVR program called <strong>MythTV</strong>.</p>\n\n<p><strong>PLEASE NOTE: This course requires that you have a spare computer (to use as the DVR) with a TV tuner card. You'll also need a digital TV antenna. The course will not teach you how to build a computer, but I will help you install your tuner card if necessary.</strong></p>\n\n<p><strong></strong>Once you have the necessary hardware, installing Mythbuntu will be quick and easy with my step-by-step instructions. You'll be watching TV in no time!</p>\n\n<p>If you have questions about anything, I am here to help you. So, just ask! Creating your own DVR may sound complicated, but it's relatively simple once you know how to configure MythTV. Once everything is configured, you'll have a reliable DVR system that will run for years, is fully customizable, and easy to upgrade!</p>\n\n<p><strong>You can also play DVD movies, view picture slideshows, listen to internet radio, and watch videos with MythTV!</strong></p>\n\n<p><strong>IMPORTANT: This course covers digital (over-the-air) television capture and streaming ONLY. Cable and satellite signals are encrypted and it is illegal in many locations to even attempt to decrypt them. I will NOT teach you how to do this, as it is against the law where I live and I do not condone illegal behavior.</strong></p>\n\n<p><strong>Get started today! </strong>With Udemy's 100% moneyback guarantee, you have absolutely nothing to lose... and something super cool to learn! All course updates are included and 100% FREE. Access to the instructor is also included at no additional charge.</p>", 
    "end_date": null, 
    "title": "Create Your Own DVR with Mythbuntu (Ubuntu + MythTV)", 
    "price": "20.00", 
    "instructors": "Cody Ray Miller", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625098_66c2_2.jpg", 
    "course_url": "https://www.udemy.com/create-your-own-dvr-with-mythbuntu-ubuntu-mythtv/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T20:14:14Z"
}