{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to <strong>Designing a SQL Server Database &amp; Storage Solution: Microsoft 70-465 </strong>with LearnSmart.</p><p>The following lectures will prepare you for <u>Microsoft SQL Server 70-465 exam</u>, which goes toward the Microsoft Certified &amp; Professional (<u>MCP</u>) and <u>MCSE: Data Platform Solutions Expert</u> certification. These lectures teach the principles, techniques, and tools needed to successfully prepare for and pass the “Developing Microsoft SQL Server Databases” exam.</p><p>This is the 2nd Course in our 2 Course SQL Server 2012 Database Series including:<br></p><ol><li>Building and Optimizing a SQL Server Database: Microsoft 70-464<em></em></li><li><em></em><em><strong>Designing a SQL Server Database and Storage Solution: Microsoft 70-465</strong></em></li></ol><p><strong>Course Overview:</strong></p><p>This course is designed to prepare the student for the <em>Microsoft SQL Server 2012 Exam 70-465</em></p><p>Students will learn how to best learn how to design and build database solutions in the organization. This course covers a majority of topics that you will find on the exam, including: the creation of plans and designs for database structure, storage, objects, and servers, and how to create the plan for the environment in which the database solution runs. Learn the main exam objectives by learning these key concepts we cover:</p><ul><li>Design a database structure</li><li>Design databases and database objects</li><li>Design database security</li><li>Design a troubleshooting and optimization solution</li></ul><p>Our lectures are paired with a variety of demonstrations and quizzes giving visual example and real world look of the concepts that will be talked about.</p><p>Our sections listed below are can be taken in any order, as a review of a particular concept or exam domain. However, if you are just becoming familiar with SQL Server 2012 and it’s database, it is recommended that you view the sections sequentially.</p><p><strong>Course Breakdown:</strong></p><p><strong>Section 1</strong>: Learn how to design an infrastructure and the options you have to plan and implement along with what you have to consider when you plan your database server infrastructure.</p><p><strong>Section 2</strong>: Be able to create a logical model of the database. Generalize the database design and how to specialize it in hand with the concept of normalization and denormalization and when to use them.</p><p><strong>Section 3</strong>: Utilize important tools to help you map the progress of requirements from the business and technical teams to a physical storage and your data and your future database options.</p><p><strong>Section 4</strong>: Discuss factors that could potentially impact performance, how you can use indexes to improve performance, and how to use query plans generated by SQL Server.</p><p><strong>Section 5</strong>:<strong> </strong>Covers how you can secure servers, meet the statutory obligations, protect the organization’s assets, and maintain the expected confidentiality.</p><p><strong>Section 6</strong>: Learn how to use SQL Server to set up rules and configuration settings in one server, then roll them onto every other SQL Server, database, etc.<br></p><p><strong>Section 7</strong>: We cover several measures and policies which are used to improve the performance of SQL Server and how the impact changes have to the SQL Server.</p><p><strong>Section 8</strong>: Utilize Windows PowerShell and how it can be used to manage SQL Server and make the administrators’ jobs much easier and more efficient.</p><p><strong>Section 9</strong>: We will discuss how replication can help, how you can plan and set up replication, how you may establish security for the replication, and more.</p><p><strong>Section 10</strong>: Ensure business continuity by using Sql Server features for high availability and disaster recovery solutions as well as Microsoft Azure services and applications.</p><p><strong>Recommendations:</strong><br></p><p>Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul><li><em>Great Material - This course is a great reference and way to refresh your skills for the new Net+ exam! I needed a good refresh before taking the exam and this course is clearly laid out and copiously covers the material for the exam. Great course, well worth the money! -- M.B.</em></li><li><em>Perfect Course - Not only do you get great lectures that are pretty much PowerPoints with an instructor teaching you the concepts, there are also Demo lectures that show you how each of the concepts works in real life. This is such valuable information to have when taking the test. I feel very confident that this course is the best Network+ course on Udemy. -- D.R. Jr.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul>", 
    "end_date": null, 
    "title": "Designing a SQL Server Database & Storage Solution (70-465)", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665144_860a.jpg", 
    "course_url": "https://www.udemy.com/designing-a-sql-server-database-storage-solution-70-465/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T20:53:22Z"
}