{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<ul>  \t<li><strong><em>More than 15 minutes of free preview material available below!</em></strong></li>  \t<li><strong><em>Full 30-day money back guarantee (no questions asked!)</em></strong></li>  </ul>  <p>  \t<strong>Who is this course for?</strong>  </p>  <p>  \t                        Are you an occasional user of the linux terminal or just learned it, and wondering how some people can be almost flying around on the command line, navigating around the file system, switching between applications, browsing and finding files and content etc, while you yourself is just fully occupied with all the tedious typing?  </p>  <p>  \t          Or are you using the command line quite a lot, but feeling that your usage gives you strain in your wrists, and wondering how you can minimize strain in hands and wrists, so that those very important body parts can stay healthy and usable for many years to come?  </p>  <p>  \t                          Then this course is for you!  </p>  <p>  \t<strong>Why did I create this course?</strong>  </p>  <p>  \t                        The creator of this course course spent years as a systems administrator at a super computing center in Sweden where he spent most of his time in the terminal. The author had a special interest in finding out the top techniques that with the least effort can give the biggest saving in time, and started implementing these techniques over the years.  </p>  <p>  \t                          All these years of hard-learned techniques are now distilled into this compact course, so that anyone with basic familiarity with the terminal get to the productivity and efficiency like a professional linux sysadmin!  </p>  <p>  \t<strong>What previous skills are required?</strong>  </p>  <p>  \t                          The course starts from a fairly basic level (you need to know how to execute some basic commands), and goes up to a rather advanced level, about using tools such as screen to manage multiple windows in the command line, and all the steps build consequently on each other. This means that regardless of your existing skill level, chances are high that you can chime in at a suitable place in the course, and start gaining new knowledge by working your way forward.  </p>  <p>  \t    Finally, remember that you have a full 30 days money-back guarantee - no questions asked - so if you (against our conviction) find that the course does not live up to the promises, you can always return it within 30 days, and get your money back!  </p>  <p>  \t<em>This means, we have made everything we can to ensure that you can confidently enroll in the course right away, and be sure not to be dissatisfied!</em>  </p>  <p>  \t                          Kind Regards<br>  \t                          Samuel Lampa, Linux Systems Administrator and Developer  </p>", 
    "end_date": null, 
    "title": "Drastically improve your speed on the Linux Commandline", 
    "price": "30.00", 
    "instructors": "Samuel Lampa", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251226_fea3_5.jpg", 
    "course_url": "https://www.udemy.com/command-line-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T23:54:54Z"
}