{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Learn how to use El Capitan to it's full potential.</p><p><strong>Master a strong method to use your mac to help you with every day queries.</strong></p> <ul> <li>Use spotlight search with native language.</li> <li>Improve you note taking with the updates to notes.</li> </ul> <p><strong>A different perspective on your Mac</strong></p><p>Learning the fundamentals of OSX El Capitan puts an advanced level skill right on your computer for you to learn. This could be used for people that have a mac and are thinking about upgrading to El Capitan or people who have already and want to learn more. Anyone can participate in this course, it will help if you have some background knowledge with using a mac.</p><p><strong>90% of the course in captured in beautiful 2K 60 FPS</strong></p><p><strong>Content and Overview</strong></p><p>Suitable for anyone this course features 22 lectures and over 30 minutes of content this will certainly teach you the advanced knowledge. My course is split in to several sections:</p><ol><li><strong>Spotlight Search </strong>- Lecture 1 is all about the ability to know type in commands in native language. Native Language is meant by where you talk like to a real person. It's a great feature which makes searching for files a lot easier. In lecture 2 you will learn how to search for emails from a specific person or about a specific topic. In lecture 3 you will learn about how to find the weather for your current location. In lecture 4 I will teach you how to move and resize the spotlight search window, this is great if you have several screens. At the end of this section there is a quiz which will test your basic knowledge on Spotlight Search.</li><li><strong>Safari </strong>- In lecture 5 you will learn about pinning tabs this means you can exit safari and the pinned tabs will reappear, this is great if you want to always have your emails open. In Lecture 6 you will learn how to mute audio from just one tab or several at a time, this is brilliant for when you open several webpages and an ad starts playing sound.</li><li><strong>Notes </strong>- In lecture 7 I will teach you about how you can now get back the notes that you have deleted. In lecture 8 I will teach you all about the ability to put your notes in to folders this makes it much easier to find a specific notes. In lecture 9 I will teach you how to edit your notes, before notes where just plain text now you can change the font and even the colour. In lecture 10 I will teach about how to add a checklist, this is basically a simpler way of adding bullet points but give you the ability to check something of with one tap. In lecture 11 you will learn how to insert photos in to your notes, this is great for anyone who wants to make their notes stand out more. In lecture 12 I will show how you can glance at attachments, this basically shows all the attachments either in a folder or note. This is then followed by a quiz which will test your knowledge.</li><li><strong>Miscellaneous </strong>- In lecture 13 you will learn how to use split screen view, this is a feature that has been available in windows for a while know but it's amazing to see mac have finally started using it. In lecture 14 you will learn a little trick to never loose your cursor again. In lecture 15 I will show you how to use Disk Utility, this enables you to control the space you have on your mac. In lecture 16 I will teach you how to know share things to the notes app and the reminders app. In lecture 17 I will teach you how to hide or show the menu bar. In lecture 18 I show you the updated colours windows, this is great for anyone creative because it give lots of colour options. In Lecture 19 I show you the new font spread across all of Apple's devices. In lecture 20 I show you a simple way to change each window size with two clicks. In lecture 21 I show you the new quick look transitions and how to use quick look to its full ability.</li><li><strong>Should You Upgrade </strong>- In the final lecture I talk about the pros and cons of upgrading, and wether I think you should or not.</li></ol><p>If you complete this course you will be able to use your mac to help you with every day needs along with some extra bonus'. Extremely handy.</p>", 
    "end_date": null, 
    "title": "El Capitan - A Complete Guide", 
    "price": "20.00", 
    "instructors": "Christopher Young", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616486_8395.jpg", 
    "course_url": "https://www.udemy.com/el-capitan/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T08:35:23Z"
}