{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>There are two ways of exhibiting your expertise at designing and developing fast and fluid Windows 8 apps. They are—using HTML5 or C#. For someone who has excelled in the existing web programming skills in JavaScript or is starting from scratch on a new website, the HTML5 path is your best bet. But if you‘re a .NET developer and planning to create Windows 8 apps, choose the C# path.  In this course, we’ll be looking into the C# path.</p>  <p>The ‘Essentials of Developing Windows Store Apps Using C#” Exam 70-484 helps to demonstrate your programming skills with real-world mastery of programming Windows Store apps using C#. It is a course architectured for skilled software developers who are ready to advance their status. The focus of the course is on the horizons of critical-thinking and decision-making acumen, important ingredients for the MCSD level success.</p>  <p>In this course we will discuss many major concepts of the new WinRT API, give a lead to the changes in the development models for this platform, and also, demonstrate the various technologies and codes necessary to add exceptional features to an app.</p>  <p>We have provided with 15 hours (approx.) high quality video content with 11 lessons.</p>  <p>This course and certification will increase your visibility in your organization.  This certification will help you stand tall amongst your colleagues and recognize your knowledge and skill.</p>  <p>Windows Store Apps certification will qualify you for jobs like software developer, web developer, and quality engineer.</p>", 
    "end_date": null, 
    "title": "Essentials of Developing Windows Store Apps Using C# ", 
    "price": "20.00", 
    "instructors": "Compaq learning", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/509454_0373.jpg", 
    "course_url": "https://www.udemy.com/essentials-of-developing-windows-store-apps-using-c/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-23T06:23:50Z"
}