{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Web developers build the client-side web sites and web applications that all businesses require as a part of their everyday operations.  This course teaches you how to get started with one of the core elements of web development - JavaScript. You will learn the essentials of the JavaScript language and how to create dynamic web pages. In addition you will work with tools that help you to create run and debug JavaScript. </p><p><span></span><strong>Learn everything you need to read, understand and write JavaScript:</strong> </p><ul><li>Learn about text editors that work great for JavaScript</li><li>Utilize hidden browser features to create and debug JavaScript code.</li><li>Understand language basics like  variables, arrays, statements, operators and objects. </li><li>Be exposed to essential techniques like looping, functions and debugging.</li><li>See how to create buttons and dialogs</li><li>Learn how to modify web page elements programmatically</li><li>Run code when a page first loads</li><li>Run code based on mouse events</li></ul><p><strong>An indispensable skill for web site design</strong><br></p><p>Every corporate website today requires JavaScript professionals to create, run and maintain them. Type the term \"JavaScript\" into any job search engine and you will find thousands of positions available. </p><p><strong>JavaScript is the fundamental technology behind powerful JavaScript </strong><strong>frameworks.</strong> </p><p><span></span>When you know JavaScript you'll know the language used by frameworks such as jQuery, jQuery Mobile, Dojo, Backbone and AngularJS. Before you can work with these cutting edge development frameworks you'll need a course like this so that you can understand how to read and make sense of their code, to see how they work and to know how to use them effectively.</p><p><strong>Content and Overview</strong> </p><p>Designed for beginners the course contains 45 lectures, 25 hands on exercises and over 5 hours of content. You'll learn how JavaScript works as a programming language and how it is used to enable common web page features like buttons, drop down menus, pop-up dialogs and AJAX network transfers. The hands-on exercises included with each topic make sure that you not only understand JavaScript but that you can actually use it for practical purposes.</p><p>The first sections provide you with background knowledge that helps you to understand how JavaScript works in the context of web pages and browsers. After that comes language basics, coding fundamentals and common JavaScript techniques. Finally you put your JavaScript knowledge and skills to work with 5 complete projects. </p><p>The instructor introduces you to concepts and walks you through code so that you understand the big picture and also see it in action. After completing this course you understand what JavaScript can do and how to use it to create dynamic web sites.</p><p><strong>What am I going to get from this course?</strong></p><ul><li>45 lectures and 5 hours of content!</li><li>Learn JavaScript Programming from a seasoned and knowledgable instructor. </li><li>Access course material via Desktop, Laptop or your even your mobile device.</li><li>Learn concepts, work at the JavaScript console, watch code reviews and do hands-on exercises.</li><li>Designed for individuals who know a little about HTML and CSS but want to move on to program dynamic web sites.</li><li>Simple instructor-led lectures and step by step exercises.</li></ul>", 
    "end_date": null, 
    "title": "Essential JavaScript for Beginners", 
    "price": "30.00", 
    "instructors": "Mark Pawlowski, Jan Ross", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/509684_292e_18.jpg", 
    "course_url": "https://www.udemy.com/essential-javascript-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-23T16:52:10Z"
}