{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">¡Hola! Me llamo Sergio Vicente Gómez, soy el creador del curso &quot;</span><strong style=\"\">Iniciación al mundo Ubuntu 14.04</strong><span style=\"\">&quot;, con este curso pretendo que todos los alumnos aprendan a instalar y configurar su sistema de una manera profesional, además de aprender a usar los programas más interesantes que contiene.</span>  </p>  <p style=\"\">  \tEn los últimos años, la situación económica de la población (en rasgos generales) se ha visto empeorada debido a la crisis en la que estamos sumidos. Por esta razón la mayoría no pueden permitirse pagar una licencia de un Sistema Operativo privativo (Windows, MacOs…), gracias a esto (y al gran potencial que tiene), los S.O basados en Linux (Ubuntu, Debian, Kubuntu, Mint…) han obtenido un aumento en su cuota de mercado.  </p>  <p style=\"\">  \tPuede que muchos administradores de redes, programadores y demás personal informático conozca a la perfección como exprimir el potencial de un sistema Unix, pero para los nuevos usuarios que quieren sumergirse en este mundo les puede resultar un poco caótico (ya que, al ser más especializado no es pulsar “Siguiente” hasta que acabe todo), con lo que se ven necesarios cursos (como este) para iniciarse en este Sistema Operativo.  </p>  <p style=\"\">  \t-No se necesita ningún requisito especial: Basta con un <strong style=\"\">PC de gama “Media” </strong>(ya que los sistemas basados en Linux pueden trabajar con muy pocos requisitos), y sobre todo <strong style=\"\">ganas de aprender.</strong>  </p>  <p style=\"\">  \tEste curso está estructurado en 7 clases muy sencillas de seguir y aptas para cualquier alumno (desdeexpertos hasta gente que instala un sistema Linux por primera vez).  </p>  <p style=\"\">  \tAl acabar el curso contarás con material extra para sacar mayor provecho a tu Ubuntu.  </p>  <p style=\"\">  \tTodas las clases son impartidas mediante videos cortos y claros, para que puedas trabar a tu ritmo, 0 presiones.  </p>  <p style=\"\">  \tPor supuesto siempre contarás con mi ayuda (en cualquier momento) para resolverte las dudas que te surjan, o para pedirme material extra, <strong style=\"\">estaré encantado de ayudarte.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Si quieres aprender a instalar y gestionar un sistema operativo totalmente gratuito, y desarrollar su potencial, no dudes en inscribirte en este curso.</strong>  </p>", 
    "end_date": null, 
    "title": "Iniciación al mundo Ubuntu (14.04)", 
    "price": "20.00", 
    "instructors": "Sergio Vicente Gómez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322250_614b_4.jpg", 
    "course_url": "https://www.udemy.com/iniciacion-al-mundo-ubuntu-1404/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T19:23:32Z"
}