{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to <strong>Installing and Configuring Windows Server 2012 (70-410)</strong> from LearnSmart.</p><p>This course provides foundational knowledge of the principles, techniques, and tools needed to successfully prepare for the Microsoft Exam 70-410 that is key to earning your <em>MCSA Solutions Associate </em>or <em>MCSE Solutions Expert</em><em> </em>Certifications. Once in our course review our course map to see just how we align and partner with Microsoft in providing this training.</p><p>This is the 1st Course in our 5 Course Windows Sever 2012 Series including:<br></p><ol><li><strong><em>Installing and Configuring Windows Server 2012 (70-410)</em></strong></li><li>Administering Windows Server 2012 (70-411)</li><li>Configuring Server 2012 (70-412)</li><li>Designing Server 2012 (70-413)</li><li>Implementing Server 2012 (70-414)</li></ol><p><strong>Course Overview:</strong></p><p>This course is designed to prepare the student for the <em>Microsoft Windows Server 2012 Exam 70-401</em>. Students will like a look at how to install, configure, and monitor servers and local storage. Learn the main exam objectives by learning these key concepts we cover:</p><ul><li>Install and configure servers</li><li>Configure server roles and features </li><li>Configure Hyper-V</li><li>Deploy and configure core network services</li><li>Install and administer Active Directory</li><li>Create and manage Group Policy</li></ul><p><span></span>Our lectures are paired with a variety of demonstrations and quizzes giving visual example  and real world look of the concepts that will be talked about.</p><p>Our sections listed below are can be taken in any order, as a review of a particular concept or exam domain. However, if you are just becoming familiar with the sever operating systems and basic networking, it is recommended that you view the courses sequentially.</p><p><strong>Course Breakdown:</strong></p><p><strong>Section 1</strong>: Gain the necessary information and skills needed to successfully install and configure Windows Server 2012 servers, perform basic administration tasks, &amp; manage data storage systems</p><p><strong>Section 2</strong>: Focus on configuring access to files and folders in Windows Server 2012, utilizing the Print and Document Services role, and managing remote access using MMC. </p><p><strong>Section 3</strong>: Learn the skills required to configure and manage the Hyper-V role when deploying virtual machines along with the components, technologies, and server configurations associated with virtualization.</p><p><strong>Section 4</strong>: Learn the skills to deploy and configure core network services, gain a better understanding about the difference between IPv4 and IPv6, and how to install DHCP and DNS.</p><p><strong>Section 5</strong>: Gain the knowledge and skills necessary to begin implementing Active Directory in various environments including the domain controller's role in Active Directory, and how to install it.</p><p><strong>Section 6</strong>: By the end of this section know what Group Policy is and how it operates by look at the different abilities of Group Policy in an Active Directory environment.</p><p><strong>Section 7</strong>: Cover management and changes that relate to the Windows PowerShell version 4.0, directory services, networking services, &amp; the Hyper-V virtualization platform in relation to the Windows R2 system.</p><p><strong>Recommendations:</strong><br></p><p>Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul><li><em>Great Material - This course is a great reference and way to refresh your skills for the new Net+ exam! I needed a good refresh before taking the exam and this course is clearly laid out and copiously covers the material for the exam. Great course, well worth the money! -- M.B.</em></li><li><em>Perfect Course - Not only do you get great lectures that are pretty much PowerPoints with an instructor teaching you the concepts, there are also Demo lectures that show you how each of the concepts works in real life. This is such valuable information to have when taking the test. I feel very confident that this course is the best course on Udemy. -- D.R. Jr.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul>", 
    "end_date": null, 
    "title": "Installing and Configuring Windows Server 2012 (70-410)", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631827_c2a2.jpg", 
    "course_url": "https://www.udemy.com/installing-and-configuring-windows-server-2012-70-410/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T00:00:00Z"
}