{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>The first videos about Apple's mobile operating system iOS 8 are now online and can be watched on udemy. Each and every video shows you one or even more features of iOS 8. With the help of the videos a beginner can learn step by step how to really get the most out of Apple's operating system. And even those who have used iOS 8 for years will also be able to make numerous new discoveries, as Apple constantly updates its operating systems with new features.</p><p>You may think that your iPhone or your iPad are mostly communication devices or gadgets used for surfing the internet. However, they are so much more. Over the last couple of years Apple has added a multitude of helpful new features - so many that it is nearly impossible for one person to know them all. If you watch our collection of more than 100 videos about iOS 8 features and our tips and tricks, you can delve into this diverse collection of features, discovering one feature any time at your own pace. If you find a feature you like and want to use, our 20-180 second-long interactive, animated videos provide you with replayable instructions while you try out the feature yourself on our own device.</p><p>No video is longer than three minutes – perfect for when you have a little spare time on your hands in which you can learn a new trick about your iPhone or iPad – in this way studying is broken down into manageable time frames, can be squeezed in around your busy time schedule and can actually be a lot of fun.</p><p>Each video is professionally produced and all dialogues spoken by an excellent and professional speaker. The knowledge stems from our wealth of experice as editiorial staff for different magazines and websites that all revolve around different Apple devices, including the iOS 8 operating system. Both, beginners and experts, will benefit from the content.</p><p>The tips are sorted into several categories: Basics, Handling, Everyday, Camera &amp; Fotos, Messages, Mail Homescreen, Settings, Safari, Telephone, Siri and Apple's Earpods. With the exception of the category Basics, the videos in each and every category can help beginners and experts in their daily life when using and getting the most out of their iOS-8-device.</p><p>You can expect new videos about iOS 8 and OS X 10.10 Yosemite in the near future. We are also currently working on a whole new set of videos about the upcoming operation system iOS 9.</p>", 
    "end_date": null, 
    "title": "iOS 8: How to become an Apple iPhone & iPad Expert", 
    "price": "20.00", 
    "instructors": "Pocket Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563492_ae31_3.jpg", 
    "course_url": "https://www.udemy.com/ios8videos/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T08:29:24Z"
}