{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">This course is perfect for anyone what wants to get more out of their iPhone with best practices. From beginners to intermediate users, you will learn how to use every part of the iPhone and it&#039;s iOS 8 software. </p><p style=\"\">Content and Overview</p><p style=\"\">The course is designed so you do not have to know anything about the iPhone before getting started. The course is broken down to help backup your information, update your phone, then explain all the features on the iPhone.</p><p style=\"\">The sections are broken down, so we can review one part of the phone at a time, before moving onto something that builds on top of it. Such as connecting the iPhone to the internet, then backing up the iPhone, to updating, to exploring new features of iOS 8.</p><p style=\"\">We start with explaining the basics of the iPhone and the iOS 8 software in the first few lectures. Then we move into backing up the phone. It&#039;s important to have your iPhone backed up, so you do not lose any information on your device.</p><p style=\"\">Move into how to update your device, so in the future lectures, you will have the same features and changes to be able to follow along on your own iPhone.</p><p style=\"\">We will cover how to find a lost/stolen iPhone, and best practices to prevent any loss of information.</p><p style=\"\">I will explain all of the different built in apps and features on the iPhone, so you will have a better understanding of how to use your iPhone overall.</p>", 
    "end_date": null, 
    "title": "iPhone and iOS 8 Complete Guide, Useful Tips/Tricks", 
    "price": "20.00", 
    "instructors": "Jeff Toomey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476216_2006_2.jpg", 
    "course_url": "https://www.udemy.com/iphoneios8/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T17:17:24Z"
}