{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Gelişen Bilişim sektöründe her geçen gün linux sistem yöneticileri ihtiyacı daha da artmakta ve önem arz etmektedir. Linux İşletim sistemleri ücretsiz olması nedeniyle daha az maliyet oluşturduğu için sunucu olarak tercih edilmektedir. Linux'un tercih edilme nedenlerinden biri de Üreteceğiniz her hangi bir çözüm için ekstra herhangi bir lisans kısıtlaması ile uğraşmak zorunda kalmazsınız ve çalışan uygulamaların kaynak kodlarını inceleyebilirsiniz.</p><p>Linux Yöneticisi olmak için bilinmesi gereken olmazsa olmaz konuları bu kurs içerisinde bulabilirsiniz. Anlartılan Tüm Konular videolarda bizzat uygulanmıştır. Ayrıca bütün konuların ayrıntılı dökümantasyonu mevcuttur. Bu kursu Aldığınıza kurstaki anlatılan konularla ilgili sorularınız cevaplanacaktır. Ayrıca Kursta işlenen konularla ilgili alıştırmalar cevapları ile birlikte eklidir.</p><p>Tüm detaylı dökümanların bulunduğu forum sitemizden dökümanları inceleyebilirisiz.</p><p>İLERİ SEVİYE LINUX EĞİTİMİ  ile aşağıdaki konu başlıklarını öğrenebilirsiniz ve sorulara yanıt bulabilirsiniz.</p><p>Yum Repo sunucusu Kurulumu</p><p>Pixe Boot ve KickStart ile Çoklu Sunucuların Otamatik Kurulumu</p><p>Diskless Remote Boot Linux(DRBL) :Thin client Server Kurulumu</p><p>(DRBL Sunucusu ile bilgisayarlarınızı diskleri olmadan thin client olarak çalıştırabilirsiniz.)</p><p>Incremental Yedek Alma İşlemleri</p><p>Grub Önyükleyici Kurulumu ve Konfigurasyonu</p><p>Kök Dosya SitemininTaşınması</p><p>DRBD(Distirubuted Replicated Block Devices)</p><p>Shell Programming(Kabuk Programlama)</p><p>Init Scripting</p><p>Systemd Scripting</p><p>Uzman Linux Yöneticiliği</p>", 
    "end_date": null, 
    "title": "İleri Seviye Linux Eğitimi", 
    "price": "20.00", 
    "instructors": "OS Information Security", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506072_8152.jpg", 
    "course_url": "https://www.udemy.com/ileri-seviye-linux-egitimi/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T12:19:20Z"
}