{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "Learn Linux NOW!<br><p><br>This is your Linux 1 course inspired by all the good hackers on the Internet. You will learn everything you need to know in order to understand the operating system, do most of what you want to do with the command line, and be ready to learn more advanced techniques.</p><p><br>If you think to learn Linux will be too hard, or you're just not sure where to start with Linux, don't worry, I've made this course simple and easy to learn. Once you're done with Learn Linux: Become An Unix Master you will definitely have the knowledge and confidence to do any foundation command!<br><br>You will know how to setup your own Apache web server, and how to change your system's configuration (even if you need to find what you're looking for) as just a couple of the many examples of things you will be able to do once you learn these foundation commands.<br><br>Learn Linux: Become an Unix Master is right to the point, and not full of filler content, giving you the information you need to get things done now. This course is broken up into multiple sections allowing you to sit down and learn part of the course or be fluent with Linux right away!<br><br>If you are a computer enthusiast like myself, or you just want to know how to do the things you want to do using the command line, then you need to learn Linux from this course. I'm offering you the fastest way for a savvy computer user to get up to speed into what you need and want to do in Linux.</p><p><br>Don't keep waiting around wishing you knew Linux. Buy this course now, and start doing all the things you've dreamed about doing in Linux today!<br><br>Once purchased, you will have life time access to contents and course updates, which will be updated according to student feedback and needs. Ask questions within the course for any clarifications or new requested information to be recorded and added to the course.</p><p><br>30 day money back guarantee.</p><p><br><br><br></p>", 
    "end_date": null, 
    "title": "Learn Linux: Become an Unix Master", 
    "price": "20.00", 
    "instructors": "Alex Bylund", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428500_3bf9_3.jpg", 
    "course_url": "https://www.udemy.com/learn-linux-become-a-unix-master/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T15:21:35Z"
}