{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong>JOIN THE OTHER 20,000 SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE</strong>  </p>    <p>  \t<strong>If you want to learn how to use Linux and level up your career but are pressed for time, read on.</strong>  \t  \t                                    Hello.  My name is Jason Cannon and I'm the author of Linux for Beginners as well as the founder of the Linux Training Academy.  When I ask people to tell me what their biggest challenge is to learning Linux, they all say the same thing: Time.  </p>  <p>  \t                                    That's why I've created this course. Give me just 45 minutes a day for the next 5 days and I will teach you exactly what you need to know about the Linux operating system. You'll learn the most important concepts and commands, and I'll even guide you step-by-step through several practical and real-world examples.  </p>  <p>  \t                                    So, if you can spare a few minutes a day and want to learn the ins-and-outs of the Linux Operating System, join me and the other students in this course today.  </p><p><strong>Free Bonus - How to Install WordPress on Your Very Own Linux System</strong></p>  <p>  \t                                    As an added bonus for enrolling in the <em>Learn Linux in 5 Days </em>video  training course, you'll receive a step-by-step checklist and video that  teaches you how to install WordPress on an Ubuntu Linux system. First,  you'll learn what software is required for WordPress to run on a Linux  system. Next, you'll be given the exact commands to type that install  all the required software and WordPress.  </p>  <p>  \t                                    You'll learn how to install a web server, how to install a database  server, how to create database users, and how to configure WordPress.  Before you know it, you'll have a fully functioning blog on your hands.  This is a great way to put your new-found Linux skills to good use.  Totally optional, but very cool: If you want to host your blog on the  internet on your very own installation of Linux, I'll show you were you  can get hosting for just $5 a month.  </p>  <p>  \t                                 ____________________  </p>  <p>  \t<em>Learn Linux in 5 Days </em>doesn't make any assumptions about your background or knowledge of Linux. You need no prior knowledge to benefit from this course. You will be guided step by step using a logical and systematic approach. As new concepts, commands, or jargon are encountered they are explained in plain language, making it easy for anyone to understand.  \t  \t                                    Here is what you will learn by taking <em>Learn Linux in 5 Days</em>:  </p>  <ul>  \t<em>  \t<li>How to get access to a Linux server if you don't already.</li>  \t<li>What a Linux distribution is and which one to choose.</li>  \t<li>What software is needed to connect to Linux from Mac and Windows computers.</li>  \t<li>What SSH is and how to use it.</li>  \t<li>The file system layout of Linux systems and where to find programs, configurations, and documentation.</li>  \t<li>The basic Linux commands you'll use most often.</li>  \t<li>Creating, renaming, moving, and deleting directories.</li>  \t<li>Listing, reading, creating, editing, copying, and deleting files.</li>  \t<li>Exactly how permissions work and how to decipher the most cryptic Linux permissions with ease.</li>  \t<li>How to use the nano, vi, and emacs editors.</li>  \t<li>Two methods to search for files and directories.</li>  \t<li>How to compare the contents of files.</li>  \t<li>What pipes are, why they are useful, and how to use them.</li>  \t<li>How to compress files to save space and make transferring data easy.</li>  \t<li>How and why to redirect input and output from applications.</li>  \t<li>How to customize your shell prompt.</li>  \t<li>How to be efficient at the command line by using aliases, tab completion, and your shell history.</li>  \t<li>How to schedule and automate jobs using cron.</li>  \t<li>How to switch users and run processes as others.</li>  \t<li>How to find and install software.  \t</li>  \t<em>  \t<li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li>  \t</em></em>  </ul>  <p>  \t                                    What you learn in<em> Learn Linux in 5 Days </em>applies to any Linux environment including Ubuntu, Debian, Linux Mint, RedHat, Fedora, OpenSUSE, Slackware, and more.  </p>  <p>  \t<strong>Enroll now and start learning the skills you need to level up your career!</strong></p>", 
    "end_date": null, 
    "title": "Learn Linux in 5 Days and Level Up Your Career", 
    "price": "25.00", 
    "instructors": "Jason Cannon", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256758_e35d_4.jpg", 
    "course_url": "https://www.udemy.com/learn-linux-in-5-days/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-07T01:08:38Z"
}