{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>In 2001, when I started my career as Telecom Professional, I could barely manage MS Windows. All I knew was how to Power it on and do basic tasks like making Presentation, Word Document and take print outs. Oh Yea! I could also make my way into putting on Video CDs and playing occasional games (NFS, FIFA). Since then, <strong>a lot has changed in the world of Operating Systems</strong> and in turn for me as well. After my first interaction with Linux in 2002, I've continued on this path and every day, <strong>my passion for Linux just gets deeper</strong>.</p>\n\n<p>If you are also searching for an alternate <strong>Operating System with decades of developments</strong>, a system that does not do funny things (read annoying), where ending a process really mean killing it, which is <strong>extremely fast to boot and shutdown</strong>, <strong>which does not invite world of malwares, viruses and Trojans</strong>, a system that has got a highly thriving and vibrant community,  and which is Free to use and distribute, then my friends <strong>Welcome! to the World of Linux</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course, I will show you two major flavors (distributions) of Linux, <strong>Ubuntu and CentOS.</strong> You will be able to:</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>1. Install and Manage Ubuntu</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>2. Install and Manage CentOS</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>3. How to update your system</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>4. Use everyday / common applications</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>5. Become a NIX user in just couple of hours</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>6. Just have fun with your new OS</strong></p>\n\n\n\n\n\n<p><strong>((First step towards LPIC-1 certification training course that I've uploaded here on Udemy ))</strong><br><strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is general purpose and is <strong>suitable for anyone and everyone</strong>. Whether you are a student, a techie or a businessman with little to nil knowledge of Operating Systems, I will take your hand and help you in your journey to the <strong>Awesome World of Linux</strong> that operates “From wristwatches to supercomputers,”. So, without further delay, click on take this course and join the ride.</p>", 
    "end_date": null, 
    "title": "Learning Linux with Ubuntu and CentOS: The Easy Way", 
    "price": 0, 
    "instructors": "Ahmad Nadeem, Mehreen Kamran", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801688_f773.jpg", 
    "course_url": "https://www.udemy.com/learning-linux-with-ubuntu-and-centos-the-easy-way/", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T07:35:16Z"
}