{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Do you feel lost when you have to open the Terminal window?</p>  <p>  \t                                                  Are you tired of copy pasting commands from the web without knowing what they do?</p><p>  \t                                                     The Terminal window can be intimidating. Instructions are cryptic, commands are hard to find and it's rarely obvious what they do.  \t  \t                                                     The reality is that using the Os X Command Line effectively will make you a much better programmer and Mac power user. Not only will learning the command line let you complete many tasks more quickly and easily, but you'll be able to do things you simply couldn't otherwise. </p><p>In this course you'll learn the essential tools for feeling comfortable and getting stuff done:</p>  <ul>  \t<li>Navigating around your hard drive</li>  \t<li>Reading and writing files</li>  \t<li>Moving, copying and deleting files and directories</li>  \t<li>Terminal window customization</li>  \t<li>Keyboard shortcuts</li>  \t<li>Searching</li>  \t<li>Productivity Tips &amp; Tricks</li>  </ul>  <p>  \t                                                     If you're a Mac power user or an aspiring developer you owe it to yourself to learn the command line. A programmer who doesn't know the command line is like a writer who can't use a pen. Knowing the command line is essential for really applying almost any programming language today.  \t  \t                                                     Sign up for the course and give it a shot. A full refund awaits you if you don't feel more confident and powerful inside of that Terminal window.</p><p>I look forward to seeing you inside.</p>", 
    "end_date": null, 
    "title": "Learn the Mac Terminal Today", 
    "price": "20.00", 
    "instructors": "Dustin Laverick", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338998_d9b9_2.jpg", 
    "course_url": "https://www.udemy.com/mac-terminal/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T03:40:35Z"
}