{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>JOIN THE OTHER 40,000 SUCCESSFUL STUDENTS WHO HAVE ALREADY MASTERED THE LINUX OPERATING SYSTEM WITH ONE OF MY TOP RATED COURSES!</strong></p><p>If you want to learn Linux system administration and supercharge your career, read on. </p><p>Hello. My name is Jason Cannon and I'm the author of <em>Linux for Beginners,</em> the founder of the Linux Training Academy, and an instructor to thousands of satisfied students.  I started my IT career in the late 1990's as a Unix and Linux System Engineer and I'll be sharing my real-world Linux experience with you throughout this course.</p><p>By the end of this course you will fully understand the most important and fundamental concepts of Linux server administration. More importantly, you will be able to put those concepts to use in practical real-world situations. You'll be able to configure, maintain, and support a variety of Linux systems. You can even use the skills you learned to become a Linux System Engineer or Linux System Administrator.</p><p><strong>What People Are Saying About Jason and his Courses:</strong></p><p><em>\"Excellent course on Linux! It is the best way to get started using Linux that I have come across.\"</em> <strong>--Chris Bischoff, Udemy student</strong></p><p><em>\"This class was a great review of the 2 Linux classes I took in school. I learned plenty of new stuff and got a great refresher on things I haven't used in some time. I did well on my interview and got the job I was looking for. Thanks!\" </em><strong>--Alan Derrick, Udemy student</strong><strong></strong><br></p><p><em>\"This was a great course! Learned a lot from it!\"</em> <strong>--Ricardo José Crosara Junior, Udemy </strong><strong>student</strong></p><p><em>\"Excellent starter course. Very good and complete guide to get you started on working on Linux.\"</em> <strong>--Brian Mulder, Udemy student</strong></p><p><em>\"Great course! Easy to understand for beginners and a great refresher for experienced users!\"</em> <strong>--Spencer Ball, Udemy student</strong></p><p><em>\"Very well laid out course. Thanks Jason!\"</em> <strong>--Eric Etheredge, Udemy student</strong></p><p><em>\"Love it... it's absolutely one of the best courses I've taken here on Udemy.\"</em> <strong>--Idriss N, Udemy student</strong></p><p><em>\"Awesome Course! Another great one. Thanks Jason!\"</em> <strong>--John Wilmont, Udemy student</strong></p><p><em>\"Excellent Course! Having come from a moderate understanding of Linux, this course has given me a deeper and more streamlined understanding of Linux. Definitely worth the money.\"</em> <strong>--Armando Cabrera, Udemy student</strong></p><p><em>\"Fantastic course and very beautifully explained.\"</em> <strong>--S John, Udemy student</strong></p><p><em>\"Great course, great instructor. I enjoyed every minute of it. I recommend this course 100%.\" </em><strong>--Alfredo, Udemy student</strong></p><p><em>\"I am lovin' it. Nice way to begin one's journey into Linux.\"</em> <strong>--Rohit Gupta, Udemy student</strong></p><p>____________________</p><p>Here is what you will learn by taking this <strong>Linux Administration </strong>course:</p><ul><em><li>How the the boot process works on Linux servers and what you can do to control it.</li><li>The various types of messages generated by a Linux system, where they're stored, and how to automatically prevent them from filling up your disks.</li><li>Disk management, partitioning, and file system creation.<em></em></li><li><em><em><em>Managing Linux users and groups.</em></em></em></li><li><em><em><em>Exactly how permissions work and how to decipher the most cryptic Linux permissions with ease.</em></em></em></li><li>Networking concepts that apply to system administration and specifically how to configure Linux network interfaces.</li><li>How to use the nano, vi, and emacs editors.</li><li>How to schedule and automate jobs using cron.</li><li>How to switch users and run processes as others.</li><li>How to configure sudo.</li><li>How to find and install software.</li><li>Managing process and jobs.</li><li>Linux shell scripting</li><em><li><em><strong>Unconditional Udemy 30 day money-back guarantee</strong> - that's my personal promise of your success!</em></li></em></em></ul><p>What you learn in course applies to any Linux environment including Ubuntu, Debian, Linux Mint, RedHat, CentOS, Fedora, OpenSUSE, Slackware, and more.</p><p>____________________</p><p><span></span><strong>Free Bonus #1 - Video Demonstrations from my <em>Command Line Kung-Fu</em> book.</strong></p><p>In this series of videos I'll be sharing with you some of my favorite Linux command line tricks.  These tips will make your life easier at the command line, speed up your work flow, and make you feel like a certified Linux command line Ninja!  If you want to see the pages of <em>Command Line Kung-Fu <strong></strong></em>come to life, then you have to watch these videos!</p><p><strong>Free Bonus #2 - PDFs of All the Material Covered</strong></p><p>As an added bonus for enrolling in this <em>Linux Administration </em>video training course, you'll receive access to all the slides used in the lessons.  You can download them and refer to them when you want to jog your memory or double-check your work.</p><p><strong>Enroll now and start learning the skills you need to level up your career!</strong></p>", 
    "end_date": null, 
    "title": "Learn Linux Administration and Supercharge Your Career", 
    "price": "20.00", 
    "instructors": "Jason Cannon", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442254_faba_4.jpg", 
    "course_url": "https://www.udemy.com/linux-administration/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T22:33:13Z"
}