{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Mit nur 55 Min pro Tag</strong><strong class=\"redactor-inline-converted\"> lernen Sie Linux. kennen und erhöhen Ihre Karrierechancen!<br></strong><br>Jason Cannon, Gründer der Linux Training Academy in Amerika und Rene Fürst unterrichten gemeinsam mehr als 52.000 Teilnehmer auf Udemy, mit dem Fokus Linux und IT Security.<br><br>Sie benötigen nur 55 Minuten für 5 Tage und lernen exakt das was Sie für einen Betrieb von Linux wissen müssen. Die lernen die wichtigsten Linux Konzepte und Befehle kennen mit einer Schritt-für-Schritt Anleitung und Beispielen.<br><br>Mit nur ein paar Minuten pro Tag und dem willen zu lernen schaffen auch Sie es mit Linux umzugehen und Ihre Erfahrungen mit anderen Teilnehmern auszutauschen.</p>\n\n<p><strong class=\"redactor-inline-converted\">Gratis Bonus - Wie Installieren Sie Wordpress auf Ihrem eigenen Linux System</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Zusätzlich zu den wichtigsten Linux Grundlagen in diesem Kurs, geben wir Ihnen als Bonus eine Schritt-für-Schritt Anleitung hinzu wie man ein Wordpress auf Ihren eigenen Linux System Installiert. Sie lernen dazu welche Software benötigt wird um Wordpress überhaupt zum laufen zu bringen und wie man diese einsetzt.</p>\n\n\n\n\n\n\n\n\n\n<p>Lernen Sie wie man einen Web Server installieren, wie man einen MySQL Datenbank Server installieren, einen Datenbank benutzter anlegt und wie man Wordpress konfiguriert für die Installation. In Handumdrehen haben wir dann schon einen Blog installiert und können diese gleich einsetzen. \u0010Das ist eine tolle Möglichkeit Ihre neuen Fähigkeiten gleich einzusetzen in einer echten Umgebung. Optional aber nicht nötig: Wenn Sie Ihren Blog auf einen Webhosting i Internet auf Ihrer eigenen Linux Maschine betreiben wollen, zeige ich Ihnen wo Sie günstig gutes Hosting bekommen.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Dieser Kurs richtet sich an Anfänger und interessierte welche <strong class=\"redactor-inline-converted\">wenig oder kein wissen</strong> über Linux haben. Sie werden Schritt-für-Schritt durch diesen Kurs geführt um alles zu verstehen. <strong>Und das beste: Bei Fragen stehen wir jederzeit Bereit</strong>!</p>\n\n\n\n\n\n<p>Überblick was Sie in diesem Kurs erwartet:</p>\n\n\n\n\n\n<ul><li>Wie man Zugriff auf ein Linux System erlangt</li><li>Was eine Linux Distribution ist und welche man anwenden soll</li><li>Welche Software zum Verbinden auf Linux benötigt wird von Mac und Windows PC's</li><li>Was SSH ist und wie man es verwendet</li><li>Wie die Dateistruktur ausgebaut ist und was man benötigt um Dateien, Programme, Konfigurationen und Dokumentationen zu finden.</li><li>Die am häufig benutzten Befehle in Linux</li><li>Erstellen, Umbenennen, Verschieben und Löschen von Ordnern</li><li>Anzeigen, Kopieren, Erstellen und Löschen von Dateien</li><li>Wie man Berechtigungen für Ordner und Dateien setzen kann und wie diese Funktionieren</li><li>Wie man Datei-Editoren benutzt wie Nano, Vi, Emacs</li><li>Lernen Sie zwei Methoden zum Suchen für Dateien und Ordner</li><li>Wie man zwei Dateien miteinander Vergleichen kann</li><li>Wofür man Pipes benutzt und warum diese sehr nützlich sind</li><li>Wie man die Shell Prompt anpassen kann</li><li>Wie man effizient die Eingabeaufforderung nutzen kann mit Aliases, Tab-Vervollsständigung und Shell History</li><li>Wie man Wiederkehrende Aufgaben verwaltet</li><li>Wie man Benutzer wechselt und Programme als einen bestimmten Benutzer ausführt</li><li>Wie man neue Software Installiert und findet</li><li>30-Tage Geld-Zurück Garantie durch Udemy, unser persönliches Versprechen führ Ihren Erfolg!</li></ul>\n\n\n\n\n\n<p>Dieser Kurs richtet sich an allgemeine Linux Distributionen wie Ubuntu, Debian, Linux Mint, RedHat, Fedora, OpenSUSE, Slackware und mehr.<br></p>", 
    "end_date": null, 
    "title": "Lerne Linux in 5 Tagen und steigere deine Karrierechancen", 
    "price": "25.00", 
    "instructors": "René Fürst, Jason Cannon", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842454_31ac_2.jpg", 
    "course_url": "https://www.udemy.com/linux-in-5-tagen/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-08T01:35:39Z"
}