{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong>JOIN THE OTHER 40,000 SUCCESSFUL STUDENTS WHO HAVE ALREADY MASTERED THE LINUX OPERATING SYSTEM WITH ONE OF MY TOP RATED COURSES!</strong>  </p>    <p>  \t<strong>If you want to learn how to use Linux, but don't know where to start read on.</strong>  \t  \t                                   Knowing  where to start when learning a new skill can be a challenge, especially  when the topic seems so vast.  There can be so much information  available that you can't even decide where to start.  Or worse, you  start down the path of learning and quickly discover too many concepts,  commands, and nuances that aren't explained.  This kind of experience is  frustrating and leaves you with more questions than answers.  \t<em>  \t                                   Linux for Beginners</em>  doesn't make any assumptions about your background or knowledge of  Linux.  You need no prior knowledge to benefit from this course.  You will  be guided step by step using a logical and systematic approach.  As new  concepts, commands, or jargon are encountered they are explained in  plain language, making it easy for anyone to understand.  </p><p><strong>Here's What People Are Saying About Jason and His Courses:</strong></p><p><em>\"Excellent course on Linux! It is the best way to get started using Linux that I have come across.\"</em> <strong>--Chris Bischoff, Udemy student</strong></p><p><em>\"This class was a great review of the 2 Linux classes I took in school. I learned plenty of new stuff and got a great refresher on things I haven't used in some time. I did well on my interview and got the job I was looking for. Thanks!\" </em><strong>--Alan Derrick, Udemy student</strong><strong></strong><br></p><p><em>\"This was a great course! Learned a lot from it!\"</em><strong> --Ricardo José Crosara Junior, Udemy student</strong></p><p><em>\"Excellent starter course. Very good and complete guide to get you started on working on Linux.\"</em> <strong>--Brian Mulder, Udemy student</strong></p><p><em>\"Great course! Easy to understand for beginners and a great refresher for experienced users!\"</em><strong> --Spencer Ball, Udemy student</strong></p><p><em>\"Very well laid out course. Thanks Jason!\"</em> <strong>--Eric Etheredge, Udemy student</strong></p><p><em>\"Love it... it's absolutely one of the best courses I've taken here on Udemy.\"</em> <strong>--Idriss N, Udemy student</strong></p><p><em>\"Awesome Course! Another great one. Thanks Jason!\"</em> <strong>--John Wilmont, Udemy student</strong></p><p><em>\"Excellent Course! Having come from a moderate understanding of Linux, this course has given me a deeper and more streamlined understanding of Linux. Definitely worth the money.\"</em><strong> --Armando Cabrera, Udemy student</strong></p><p><em>\"Fantastic course and very beautifully explained.\"</em><strong> --S John, Udemy student</strong></p><p><em>\"Great course, great instructor. I enjoyed every minute of it. I recommend this course 100%.\" </em><strong>--Alfredo, Udemy student</strong></p><p><em>\"I am lovin' it. Nice way to begin one's journey into Linux.\"</em><strong> --Rohit Gupta, Udemy student</strong></p><p><strong>____________________<br></strong></p>  <p>  \t<strong>Free Bonus - How to Install WordPress on Your Very Own Linux System</strong>  </p>  <p>  \t                                    As an added bonus for enrolling in the <em>Learn Linux in 5 Days </em>video   training course, you'll receive a step-by-step checklist and video  that  teaches you how to install WordPress on an Ubuntu Linux system.  First,  you'll learn what software is required for WordPress to run on a  Linux  system. Next, you'll be given the exact commands to type that  install  all the required software and WordPress.  </p>  <p>  \t                                    You'll learn how to install a  web server, how to install a database  server, how to create database  users, and how to configure WordPress.  Before you know it, you'll have a  fully functioning blog on your hands.  This is a great way to put your  new-found Linux skills to good use.  Totally optional, but very cool: If  you want to host your blog on the  internet on your very own  installation of Linux, I'll show you were you  can get hosting for just  $5 a month.  </p>  <p>  \t  ____________________  </p>  <p>  \t  \t                                   Here is what you will learn by taking <em>Linux for Beginners</em>:  </p>  <ul>  \t<em>  \t<li>How to get access to a Linux server if you don't already.</li>  \t<li>What a Linux distribution is and which one to choose.</li>  \t<li>What software is needed to connect to Linux from Mac and Windows computers.</li>  \t<li>What SSH is and how to use it.</li>  \t<li>The file system layout of Linux systems and where to find programs, configurations, and documentation.</li>  \t<li>The basic Linux commands you'll use most often.</li>  \t<li>Creating, renaming, moving, and deleting directories.</li>  \t<li>Listing, reading, creating, editing, copying, and deleting files.</li>  \t<li>Exactly how permissions work and how to decipher the most cryptic Linux permissions with ease.</li>  \t<li>How to use the nano, vi, and emacs editors.</li>  \t<li>Two methods to search for files and directories.</li>  \t<li>How to compare the contents of files.</li>  \t<li>What pipes are, why they are useful, and how to use them.</li>  \t<li>How to compress files to save space and make transferring data easy.</li>  \t<li>How and why to redirect input and output from applications.</li>  \t<li>How to customize your shell prompt.</li>  \t<li>How to be efficient at the command line by using aliases, tab completion, and your shell history.</li>  \t<li>How to schedule and automate jobs using cron.</li>  \t<li>How to switch users and run processes as others.</li>  \t<li>How to find and install software.</li>  \t<li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li>  \t</em>  </ul>  <p>  \t                                  What  you learn in <em>Linux for Beginners</em> applies to any Linux environment  including Ubuntu, Debian, Linux Mint, RedHat, Fedora, OpenSUSE,  Slackware, and more.  </p>  <p>  \t<strong>Enroll now and start learning the Linux skills you need to level up your career!</strong>  </p>", 
    "end_date": null, 
    "title": "Linux for Beginners", 
    "price": "20.00", 
    "instructors": "Jason Cannon", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/149910_25f7_6.jpg", 
    "course_url": "https://www.udemy.com/linuxforbeginners/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-21T03:51:41Z"
}