{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong style=\"\">If you ever wanted to try Linux, but were afraid you wouldn&#039;t  be able to use your favorite software, programs, or applications, take  this course.</strong>  </p>  <p>  \t      If you have applications that you rely on every day, you want to be sure those applications or equivalent ones are available on Linux before you invest any time learning about it.  </p>  <p>  \t  In this course you will be introduced to some of the most popular applications available for Linux.  These applications allow you to browse the web, watch movies, listen to music, create presentations, and more.  If you are curious about what Linux has to offer, enroll in this course today.  </p>  <p>  \t<strong style=\"\">Bonus Video - Learn How to Install Ubuntu Linux without Overwriting Your Current OS or Losing Any Data</strong>  </p>  <p>  \t<strong style=\"\"></strong>If  you don’t have dedicated hardware to run Linux, that’s totally fine.  There’s no need to buy another computer or wipe your current one just so  you can take Linux out for a test drive. Using this bonus video, you  will learn how to install virtualization software so you can run Linux  on your current system without having to delete your current operating  system or lose any of your precious data. Don’t worry — the  virtualization software works on both Windows and Mac computers.<br style=\"\">  \t<br style=\"\">  \t        You’ll  also be guided step-by-step through an installation of Ubuntu. Along  the way you’ll learn the differences between installing Linux in a  virtual environment and a physical environment. That way you’ll be able  to install Linux anywhere you want.  </p>  <p>  \t <strong style=\"\">Click &quot;Start Learning Now&quot; to discover what applications are available for the Linux Operating System.</strong>  </p>", 
    "end_date": null, 
    "title": "Linux Alternatives to Windows Applications", 
    "price": 0, 
    "instructors": "Jason Cannon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/262212_a903_3.jpg", 
    "course_url": "https://www.udemy.com/linux-alternatives-for-windows-applications/", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-16T03:04:24Z"
}