{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Linux can be found in many places today – from phones to desktops, gaming platforms to even embedded systems. Linux has become one of the most important software systems for building technologies.</p>\n\n<p>What is Linux? Linux is an open source computer operating system that offers users and developers a lot of room for modifications with the software. Although, originally designed as a free operating system for personal computers, it has now grown to become one of the dominantly used as an operating system for hardware platforms. </p>\n\n\n\n\n\n<p>In its original form, Linux is the leading operating system for servers and big supercomputers, because of its speed and room for modifications. </p>\n\n\n\n\n\n<p><strong>Now that you have finally decided to learn about Linux, where can you get started? Right here, of course.</strong></p>\n\n\n\n\n\n<p>This Linux course has been designed to help you learn Linux from scratch. Don’t have any experience with Linux or Linux programming? No problem.</p>\n\n\n\n\n\n<p>In this course, you will learn everything from scratch including a detailed introduction into operating systems and why Linux trumps the lot as an incredible operating system. Learn about the many different Linux distributions that are available and how to select the perfect one for you.</p>\n\n\n\n\n\n<p>The course will also cover open sources in detail including what is open source, understanding software licensing, the Free Software Foundation, The Open Source Initiative, etc.</p>\n\n\n\n\n\n<p>Equipped with adequate background information, you will then learn how to install a Linux system (Ubuntu) from scratch and how to work with the system. From important aspects of the desktop environment to adding and updating packages, you will cover it all.</p>\n\n\n\n\n\n<p>After all of this, you will then go on to understand the command terminal in Linux programming and how to start coding using the command terminal. You will also be familiarized with the file management system within Linux, the shells and how to use shells in a Linux framework.</p>\n\n\n\n\n\n<p>The perfect zero to hero Linux course awaits you. What are you waiting for? Let’s make you into a Linux guru.</p>", 
    "end_date": null, 
    "title": "Linux For Absolute Beginners", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/874226_95d8.jpg", 
    "course_url": "https://www.udemy.com/linux-for-absolute-beginners-master-linux-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-10T06:56:11Z"
}