{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">FREE FREE FREE FREE FREE FREE WEEKEND ONLY!!!!!!!</em></strong>  </p>  <p>  \t    **These are the strategies I use daily to get the most performance while using Yosemite everyday while I work and perform task with my Mac.  Give it three video lessons and if you aren&#039;t learning simply ask for a refund.  </p>  <p>  \t                 Learn how to increase your productivity 10x using Yosemite on Mac. Learn from a Professional Educator and Entrepreneur that knows how to get a point across which anyone can understand.  We share some of the best overall tips for improving performance. Being a teacher for almost 20 years has definitely helped me learn the best strategies for teaching others new content.  I have applied that experience and knowledge while building this course so every student understands and has fun while learning.  Users will be amazed just how much more productive they can be using Yosemite after taking this course.  </p>  <p>  \t     Apple has finally allowed iOS devices and Macs to communicate with each other which increases performance and overall usability.  Let us show you how to be part of this Apple ecosystem to be the most productive.  We share some of the best hidden features Yosemite offers in our course, hands down.  </p>  <p>  \t                 We have broken the course into categories so its easiest to learn and apply our techniques right away.  In this course we share techniques and strategies that takes a long while to grasp alone.  This course will immediately eliminate the learning curve for Mac and Yosemite.  This isn&#039;t just a course for Yosemite but we share tips for OS X as a whole too.  </p>  <p>  \t               It&#039;s a scientific fact we comprehend more by seeing as opposed to just reading.  We will share some of our best Mac apps as well as sites where you can find useful resourses for your Mac.  </p>", 
    "end_date": null, 
    "title": "Mac OS X Yosemite 10.10 Course: Quick Start Success", 
    "price": "20.00", 
    "instructors": "Mitch Stevens", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329828_f7c1.jpg", 
    "course_url": "https://www.udemy.com/learn-yosemite-plus-tips-for-mac-users-to-be-10x-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T20:37:53Z"
}