{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tDo you get frustrated with your computer from time to time? Have you ever wondered if there was a better way to manage multiple windows, apps, or documents all fighting for precious screen space? Are simple yet repetitive tasks taking up a great deal of time?  </p>  <p>  \tI know the feeling - which is why I took the time to <em>learn the best practices </em>for my computer. The results were amazing.  </p>  <p>  \tTasks that took minutes suddenly took only a few seconds. I felt <strong>in control </strong>of my computer for the first time. Windows, apps, and documents didn't <strong>stack up and make me feel unorganized </strong>because I <em>knew </em>how to navigate and use my computer the <em>right way</em>.  </p>  <p>  \tThat's exactly why I created this course. I <em>know </em>that you can benefit from the many techniques, tips, and tricks packed into the 14-page eBook Course Pack and over <strong>2.5 hours </strong>of video lessons.  </p>  <p>  \tHere are just a few of the things we'll cover in this course:  </p>  <ul>  \t<li><span>The secret weapon <em>all </em>computers have that you should be using constantly</span></li>  \t<li>How to navigate your OS so that you can quickly get from one window to the next</li>  \t<li>How to use multiple web browsers to increase productivity on the web</li>  \t<li>Ways to speed up simple yet repetitive tasks</li>  \t<li>An in-depth look at the tools you use every day, including Web Browsers, Mail Apps, and Calendars</li>  \t<li>and much, much more!</li>  </ul>  <p>  \tNo matter what your level or understanding of computers is, you <em>will </em>benefit from this course. The course is designed to be accessible to all levels of understanding - from complete computer beginners to power users.  </p>  <p>  \tJust think of the time you'll save by putting these techniques into practice. I was amazed at how efficient I was when I started using them - which is why I wanted to share them with you!  </p>  <p>  \tJoin today and start saving time and money by being extremely productive on your Mac!  </p>", 
    "end_date": null, 
    "title": "Mac OSX Productivity: How To Save Time Using OSX Yosemite", 
    "price": "30.00", 
    "instructors": "Dean Palya", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339448_9bc4_2.jpg", 
    "course_url": "https://www.udemy.com/mac-osx-productivity-yosemite/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T20:01:30Z"
}