{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t    If you just switched from Windows to Mac or even if you have your Mac for quiet some time now - you know it is great. You can handle it easily and you get everything you need from the Mac App Store if the software you already comes with your Mac is not enough. But you have the feeling that you do not really get to work with all the features and functions your Mac has to offer.  </p>  <p>  \t    And here the <strong>Mac OS X Yosemite Quicktips</strong> come into play! We put together a fantastic collection of all the things you need to make you work smarter, not harder. In 50 videos we get into the deeper functions and features of your Mac computer. All our <strong>Mac OS X Quicktips</strong> are highly actionable. You can try them out right away and you&#039;ll see how much of a time save your Mac becomes.  </p>  <p>  \t  We will not just show you how to handle and sort your files better, how to search your files easier with Spotlight and how to use all the different views for your files the Finder has to offer but we will go deeper: We will show you how to make your Mac more secure, how to use parental control and how to use all the every day Apps such as Reminders and Notes effectively. But in <strong>50 Mac OS X Yosemite Tips</strong> we have much more for you!  </p>  <p>  \t    Learn more about all the hidden gems of the Mac OS and learn how to implement your Mac into your work and your every day life. You can use your Mac for more things than you can imagine!  </p>  <p>  \tAll our tips are really short so you can learn on the go and even use the course as your own personal video dictionary. You do not need to watch them all at once to get more knowledge of your Mac but, of course, you can do so if you want to learn more about a particular section.  </p>  <p>  \tWe also keep it simple for you. We leave out all the techie stuff and just get to the basics. Learn what you can do to improve your workflow right away with not much time you need to spend on the course!  </p>", 
    "end_date": null, 
    "title": "Mac OS Quicktips", 
    "price": "20.00", 
    "instructors": "Monja Wessel, Markus Korsten", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350824_e591_2.jpg", 
    "course_url": "https://www.udemy.com/mac-os-x-yosemite-quicktips/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T12:54:42Z"
}