{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>In this Microsoft Windows Server 2016 - First Look training course, expert author  will teach you everything you need to know about the new features in Windows Server 2016. This course is designed for the absolute beginner, meaning no experience with Microsoft Windows Server is required.</p>\n\n<p>You will start by learning about configuration levels, then jump into learning about containers and Docker. From there, you  will learn about Storage Spaces Direct, Storage Replica, network virtualization, and failover clustering. Also Windows Server 2016 includes a new edition called Nano Server. Nano Server is a dramatically scaled down version of Windows Serve 2016, effectively taking the concept of Sever Core to a whole new level.</p>\n\n<p><strong>Nested virtualization</strong></p>\n\n<p>Have you ever needed to virtualize a Hyper-V host? I have! I am a trainer and use demo environments with virtualized servers every day, but building a lab to demonstrate concepts of a Hyper-V host meant we had to pull together some physical hardware. This is no more. Using \"meta\" virtualization we can virtualize a Hyper-V hypervisor through nested virtualization!</p>\n\n<p><strong class=\"redactor-inline-converted\">Containers</strong></p>\n\n<p>With the meteoric rise of container darling Docker, containers were a hot topic in 2015 and show no signs of slowing down for 2016. Although Linux containers have been around since 2008, it wasn't until 2015 that Docker made them cool. As an answer to containers, Microsoft has released Hyper-V and Windows Server containers -- and provides Docker support in Windows Server 2016. I'm looking forward to seeing where Microsoft-supported containers go in 2016.</p>\n\n\n\n<p>Finally, you will learn about Hyper-V, remote desktop services, and active directory. <br>In general, Windows Server 2016 incorporates tighter integration with cloud services by adding Microsoft Azure Services and Connect this server to cloud services to Server Manager. Windows Server 2016 also includes significant enhancements to network and storage virtualization.</p>\n\n<p>Once you have completed this computer based training course, you will have learned everything you need to know about the features in Microsoft Windows Server 2016.</p>", 
    "end_date": null, 
    "title": "Microsoft Windows Server 2016 - First Look", 
    "price": "30.00", 
    "instructors": "24 Directlearning", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682238_a370_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-windows-server-2016-first-look/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T08:39:21Z"
}