{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t                            Statistics on the Microsoft Certification website indicate that <strong style=\"\">91% of hiring managers consider certification</strong> as part of their hiring criteria  </p>  <p>  \t                            Microsoft Technology Associate (MTA) is <strong style=\"\">a recommended entry point</strong> into IT certification. Pass just one exam and you’ll earn a certification!  </p>  <p>  \t                            The main benefit of earning a Microsoft Certification is that it shows potential employers/hiring managers that you have the necessary requirements and skills to be the perfect candidate for the job.  </p>  <p>  \t                            In this course you will learn <strong style=\"\">all you need to know to pass the exam and apply your skills in real world</strong> scenarios.  </p>  <ul style=\"\">  \t<li>Overview of Windows Operating System </li>  \t<li>Windows 7, Windows 8 and Windows 8.1</li>  \t<li>Real-world examples</li>  \t<li>Labs with step-by-step      instructions</li>  \t<li>Detailed lectures on installation, folders and shares</li>  \t<li>Troubleshooting tools and tips</li>  \t<li>Quizzes to help you pass the      exam</li>  </ul>  <p>  \t                            The course is perfect for anyone who seeks to learn the fundamentals of Windows Operating System concepts.  </p>  <p>  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p>  \t                        In over 4 hours of content including more than 30 lectures this course covers the basics of Windows Operating System Fundamentals. Each chapter closes with a quiz to make sure you can practice exam questions and test your knowledge before moving to the next section.  </p>  <p>  \t                        We start from scratch discussing managing applications, files and folders, how to install and upgrade Client Systems and manage devices. This course discusses security, malware protection, remote access and visualization.  </p>  <p>  \t                      Join now!.  </p>", 
    "end_date": null, 
    "title": "Microsoft MTA Windows OS Fundamentals 98-349", 
    "price": "20.00", 
    "instructors": "Marious Kuriata", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329746_0b8a_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-mta-windows-os-fundamentals-98-349/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T19:17:04Z"
}