{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t                                Do you use Microsoft Windows every day? You can improve the way you work and play by using tools and tips. The problem is that there are thousands of applications and articles on the Internet. That&#039;s why I decided to record<strong style=\"\"> a series gathering all interesting and unique tools and tips</strong> for Windows XP, 7 and 8.  </p>  <p style=\"\">  \t                      More than <strong style=\"\">5 hours of videos</strong> showing you hundreds of tools and tips for Microsoft Windows. You will see most applications in action and some additional tips you can try out later on by yourself!  </p>  <p style=\"\">  \t                                You will find not only <strong style=\"\">videos</strong> but <strong style=\"\">pdf files with links</strong> to download all tools discussed. Most things are free to download from the Internet.  </p>  <p style=\"\">  \t      I suggest <strong style=\"\">alternatives</strong> to most applications, which means that you can find even more tools and tips.  </p>  <p style=\"\">  \t      Everything is designed in a nice and neat way. Videos are short to help you focus on a tool you like. It is all divided into eleven sections including some bonus applications and tips.  </p>  <p style=\"\">  \t                                I discuss security, on-line applications, passwords, benchmarks, hard drive tools, tips to improve performance, hidden system options, application to view images and videos. There are some really nice &#039;old-school&#039; tools I show you!  </p>  <p style=\"\">  \t                              Take this course to learn that you can improve the way you play and work every single day. Enjoy!  </p>", 
    "end_date": null, 
    "title": "Microsoft Windows: 99 programs and tips you may not know of", 
    "price": "20.00", 
    "instructors": "Marious Kuriata", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273830_ab9f_7.jpg", 
    "course_url": "https://www.udemy.com/99-microsoft-windows-programs-and-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-03T11:45:14Z"
}