{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong style=\"\">Master the adventurous world of Minecraft with this video course, e-books, cheat sheets, an interactive quiz, and and 1-Year Access to the LearnToMod and Minecraft Simulator platform! </strong>  </p>  <p>  \t    The Minecraft video training course will have you not only surviving, but excelling, in the open-ended nature of Minecraft. This training course includes over 30 videos that will start you off by showing the tasks you need to complete right away, survive your first night, collect inventory, and set up a farm. After you&#039;ve mastered the basics, you can really shine in Minecraft by using redstone to power items and building houses and transportation — everything that makes your time in Minecraft easier.  </p>  <p>  \t    You also have access to a Minecraft For Dummies Personal Library, which includes access to four Minecraft e-books, cheat sheets to download and keep handy for reference during game play, and a Parent&#039;s Guide to Minecraft.  You will also be able to test your knowledge by taking the Minecraft For Dummies quiz. In no time, you&#039;ll be a Minecraft expert!  </p><p>Then continue your creative Minecraft journey by learning to make your very own Minecraft Mods! With a 1-Year Free Access to LearnToMod and Minecraft Simulator, you will learn coding basics and learn how to make a two-player game in Minecraft!  Instructions for the 1-Year Access and the LearnToMod and Minecraft Simulator platform is available in Lecture 2, Section 2.  Follow the directions to learning how to Mod Minecraft and begin earning badges today!</p>  <p>  \t<strong style=\"\">The Minecraft For Dummies Personal Library includes:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Minecraft For Dummies, Portable Edition (160 pages)</li>  \t<li style=\"\">Minecraft Recipes For Dummies, Portable Edition (216 pages)</li>  \t<li style=\"\">Minecraft Redstone For Dummies, Portable Edition (216 pages)</li>  \t<li style=\"\">Minecraft Construction For Dummies, Portable Edition (216 pages)</li>  \t<li style=\"\">Cheat Sheet from Minecraft For Dummies (2 pages)</li>  \t<li style=\"\">Cheat Sheet from Minecraft Modding For Dummies (2 pages)</li>  \t<li style=\"\">Part of Tens Chapters from Minecraft For Dummies (40 pages)</li>  \t<li style=\"\">Parent&#039;s Guide to Minecraft from Minecraft For Dummies Bonus (14 pages)</li>  </ul>", 
    "end_date": null, 
    "title": "Minecraft For Dummies Premium Video, eBooks & Modding Bundle", 
    "price": "50.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "19.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440906_aa97_2.jpg", 
    "course_url": "https://www.udemy.com/minecraft-for-dummies-premium-video-ebooks-modding-bundle/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T01:21:42Z"
}