{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">    WHY HAVE A LOOK ON THIS COURSE AT ALL?</strong><br style=\"\">  \t                    I worked with several software tools for different tasks within several companies.(Most of them were clients of my own company - a digital business consultancy). Most corporations are facing the same challenges - the better the business, the more employees and the faster the growth; but at the same time processes &amp; internal organization become increasingly complex.</p><p style=\"\">Due to organic growth all companies face one moment in their history, where they realize, that their digital structure, they once started with causes more problems, than it solves, because it is too static - too small. Or they find themselves in the middle of 30 insular software tools for certain tasks, that need to be connected via APIs to have a useful information flow within the company. This way of building a digital infrastructure is expensive, not transparent, complicated and far away from being stabile. </p><p style=\"\"><span></span><strong style=\"\">Odoo is one of the first All-In-One solutions, which is affordable &amp; still easy to use. The best thing: It can be tailored to meet your company´s needs.<br style=\"\"></strong><em style=\"\">2.000.000 Odoo users have the same opinion.</em></p>  <p style=\"\">  \t<strong style=\"\">WHY BUY EXACTLY THIS COURSE?</strong><br style=\"\">  \t    In 2014 I was in charge of finding a new ERP for a German, fast growing company. The solution should include warehouse management, accounting, website &amp; shop plus a smart CRM.  I guided the whole process of month of research, data transfer (databank mapping), establishing the system &amp; new workflows in the daily business plus educating the other employees. Today I am working with Odoo on a daily basis a<em style=\"\">nd (unbelievable, but true) I still love it.</em>  </p>  <p style=\"\">  \t    With well structured video tutorials I will teach you how to work with this amazing ERP by showing you the straight functionality of Odoo plus giving you advices on how to apply your knowledge for your own business.  </p>  <p style=\"\">  \t    I hope this course will support you to become a good Odoo user within 14 days. But even more important: You can easily look up functions, you forgot about. You can do so much with Odoo, that it is impossible to keep everything in mind. This course will help you:  </p>  <ul style=\"\">  \t<li>to make a profound decision, if you want work with this system in the future.</li>  \t<li>to avoid stress &amp; save time (for yourself or your employees) working with Odoo, if your company is already using it.</li>  \t<li>save money, you would normally spend on training sessions &amp; consultancy.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">WHY BUY NOW?</strong><br style=\"\">  \t      The will never again be cheaper, than now. The more material I add, the higher the price.</p>  <p style=\"\">  \t      My first goal is to compile a solid course with more than 7 hours of compact, effective video coaching sessions. But from that point on I won´t stop enhancing the course.</p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">The earlier you buy, the less you pay.</strong></em>  </p>", 
    "end_date": null, 
    "title": "Odoo (Open ERP) Basics", 
    "price": 0, 
    "instructors": "Patrick Körting", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416748_9aea_6.jpg", 
    "course_url": "https://www.udemy.com/odoo-open-erp-basic-course/", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T20:57:20Z"
}