{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t <em>¡Matricúlate ya y empieza hoy mismo a optimizar y solucionar los problemas de rendimiento de tu entorno VMware vSphere!</em></p>\n\n<p>Usa este código <strong>THANKS</strong> al comprar el curso y consigue un 2% de descuento.</p>\n\n\n\n\n\n\n\n<p>  \t     Tras completar el curso avanzado de virtualización con VMware vSphere el alumno habrá adquirido los siguientes conocimientos:  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Entender el propósito de la linea de comandos</li>  \t<li>Instalar y configurar vSphere Management Assistant</li>  \t<li>Operar con VMs via comandos con vmware-cmd</li>  \t<li>Entender los componentes de arquitectura de VMware vSphere</li>  \t<li>Definir un problema de rendimiento</li>  \t<li>Entender la metodologia de troubleshooting de VMware</li>  \t<li>Entender los conceptos de virtualización de red</li>  \t<li>Monitorizar el I/O de red</li>  \t<li>Hacer troubleshoting del rendimiento de red</li>  \t<li>Entender los conceptos de virtualización en almacenamiento</li>  \t<li>Describir que es y para que sirve VAAI</li>  \t<li>Describir la arquitectura PSA de almacenamiento</li>  \t<li>Describir y optimizar el multipathing en VMware ESXi</li>  \t<li>Monitorizar y optimizar la actividad de disco</li>  \t<li>Gestionar el almacenamiento vía comandos</li>  \t<li>Troubleshooting el rendimiento de la capa de almacenamiento</li>  \t<li>Entender los conceptos de virtualización de la CPU</li>  \t<li>Monitorizar y optimizar la actividad de CPU</li>  \t<li>Troubleshooting el rendimiento de la capa de CPU</li>  \t<li>Entender los conceptos de virtualización de la memoria</li>  \t<li>Monitorizar y optimizar la actividad de la memoria</li>  \t<li>Troubleshooting el rendimiento de la capa de la memoria</li>  </ul>\n\n\n\n\n\n\n\n\n\n<p>Este curso avanzado de VMware vSphere ha sido diseñado precisamente para facilitar el arranque inicial, proporcionando bases muy sólidas que permiten al alumno abordar la optimización y el troubleshooting de rendimiento de un entorno de producción VMware vSphere.</p>\n\n\n\n\n\n\n\n<p>  \t     El curso también ayuda a profesionales de TI a alcanzar la calificación de profesional certificado de VMware® en vSphere 5  y 6 (VCP6-DCV y VCAP5-DCA). Aprenderás las opciones avanzadas de VMware vSphere® y ha optimizar tu entorno de una forma entretenida, practica y eficaz.</p>\n\n\n\n\n\n\n\n<p>  \tGracias a vuestra acogida, <em>¡estamos en la prensa internacional!</em> Informationweek, Businesswire, IT Users Magazine, Udemy y Marketwired  </p>", 
    "end_date": null, 
    "title": "Optimiza y soluciona problemas de rendimiento en VMware", 
    "price": "50.00", 
    "instructors": "Jose Maria Gonzalez, JMG Virtual Consulting S.L", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/210770_6701_2.jpg", 
    "course_url": "https://www.udemy.com/curso-online-avanzado-virtualizacion-vmware-vsphere/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-05T09:09:05Z"
}