{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>      Apple release OS X El Capitan with new exciting features. We would take a look at some tips for Mail, Notes, Safari, Spotlight and more. OS El Capitan helps you manage multiple windows, have a more powerful Spotlight and fast performance in your computer. Apple decided to focus on the overall user experience and improving performance rather than jam packing the update full of brand new features. Mac computers can do a lot of things, some of those awesome cool stuff we will take a look in this course.</p><ol><li>The Course includes 4 PDF Book's that will help you follow though the videos.</li><li>Keyboard shortcuts, Spotlight Shortcuts, 4 Useful OS X Apps and 5 apps to download to your mac PDF's</li><li>Easy to Follow Videos</li></ol><p>Making this course main purpose is to bring new exciting information to new Mac users with the new OS El Capita. Being more productive is really important and OS X El Capitan has those features that everyone wants. With time and patience you will learn new things in a fast and easy follow videos. Easy to follow.  I am teaching this course because I believe learning new things in a new exciting way and step by step would allow you to be more productive, and allow you to and have more information. This course would allow you to know about OS X El Capitan. We would learn new features of the new OS, go in deep look at the main apps of OS X.  Like Safari, Mission Control,  Mail, The new Notes.  In this course you will learn new public transit option in maps, mute tabs in safari or have an awesome heading in notes,  spotlight shortcuts and el Capitan shortcuts.  This is an step by step course and easy to follow. At the end students will be able to learn OS X EL Capitan new features and some really awesome tricks.</p><p><br></p><p>Get the course for free with the code START</p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "OS X El Capitan Tips and Tricks", 
    "price": 0, 
    "instructors": "Christian Figueroa", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631434_1d9e_3.jpg", 
    "course_url": "https://www.udemy.com/os-x-el-capitan-tips-and-tricks/", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T15:37:16Z"
}