{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>O curso irá preparar você com a base necessária para efetivamente instalar, configurar e administrar o Elastix, um dos produtos que está revolucionando as comunicações via Internet, utilizando os sistemas PBX IP baseados no Asterisk, sendo a distribuição mais recomendada atualmente, devido as grandes funcionalidades e facilidades na configuração e utilização.</strong></p><p><strong>* Um certificado de conclusão digital válido é oferecido para os estudantes que completarem o curso. </strong><strong>O seu certificado tem um código de verificação para autenticidade.</strong><br></p><p><strong>O aluno realizará na prática a criação e configuração de uma Central Telefônica IP a partir do zero, criando os ramais, troncos, gravações de chamadas, relatórios, URAs, conferências, gerenciamento de filas, etc. O curso é 100% prático.</strong><br></p>  <p>  \t  Através de laboratórios práticos, você poderá adquirir experiência em:  </p>  <ul>  \t<li>Gravação de chamadas com interface vía Web</li><li>Call Center com Discador Automático</li><li>IVR(<em>resposta interativa de voz</em>) configurável e bastante flexível</li>  \t<li>Provisionador de telefones via Web. Isto permite instalar números de telefones em curto tempo.</li><li>Interface de detecção de hardware de telefonia</li>  \t<li>Painel de operador. Onde o operador pode ver toda a atividade telefônica de maneira gráfica e realizar ações simples como como transferências, estacionar chamadas, etc</li>  \t<li>Relatórios de Chamadas detalhadas (CDRs) com apoio para a pesquisa por data, dimensão e outros critérios</li>  \t<li>Tarifação informando o consumo por destino</li>  \t<li>Informação sobre o uso dos canais de tecnologia (SIP, ZAP, IAX, Local, H323)</li><li>Suporte protocolo SIP, IAX, H323, MGCP entre outros.</li>  \t<li>Codecs suportados: G.711 (A-Law &amp; μ-Law), G.722, G.723.1 (pass through), G.726, G.729 (sem comprar licença comercial), GSM, iLBC</li>  \t<li>Suporte para interfaces analógicas FXS/FXO</li><li>Troncalização</li>  \t<li>Rotas de entrada e saída pelas quais poderá ser configurada por marcação correspondência padrão, que dá grande flexibilidade</li><li>Editor Web de arquivos de configuração</li>  \t<li>Acesso interativo via Web ao console</li><li>Virtualização com VirtualBox</li><li>Configuração e instalação de telefones IP e Softphone</li><li>Plano de discagem para categoria dos ramais</li>  </ul>  <p>  \t<strong>Conteúdos</strong>  </p>  <p>  \t           Este curso é destinado a qualquer pessoa interessada em aprender sobre Telefonia IP. Não é necessária experiência, e tudo que você precisa é de um micro ou notebook, onde iremos virtualizar uma instalação do zero e utilizaremos alguns software livre durante o curso.  </p>  <p>  \t           Com mais de 8 horas de conteúdo em 80 aulas divididas em tópicos, este curso irá levá-lo a partir de zero de experiência em estar apto a administrar a plataforma Elastix PBX..  </p>", 
    "end_date": null, 
    "title": "Passo a Passo com Elastix PBX: Seu PBX IP na Prática", 
    "price": "50.00", 
    "instructors": "Hamilton Oliveira Batista", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401332_97ae_10.jpg", 
    "course_url": "https://www.udemy.com/passo-a-passo-com-elastix-pbx-seu-pbx-ip-na-pratica/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T17:16:46Z"
}