{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Hello, and thank you for you interest in this course. I have been programming PHP since 2000. I have also been a Linux/Unix Administrator since 2000. I have worked with PHP in Shell script applications and Web-Based applications since 2000 as well. </p><p>I have written many tools, and managed over 600 servers, and built Linux environments from 2 servers to over 200, in less than 2 years. I have a lot of industry experience, and now I want to share this knowledge with you, so that it can help your career. </p><p>In my early days, I was in-between C and Java, and I choose C, and even C over C++, because I was more interested in the systems language that Linux was written in. I grew found of PHP mostly due to its C-like syntax. In fact it is like C, but much easier to pick up. There are no type declarations, or linking, or compiling. It is very easy to go from C to PHP, since most of the functions and operators work the same. </p><p>However PHP is even better, since you can write it inline with Web-Based HTML. It makes sys admin work, and web-based reports, only needing to know one language to do both jobs. </p><p>With the helper functions that I show you in the course, you will learn how easy it is to turn command line tools, into objects PHP can easily harness. With this you will be able to write scripts fast and quick. </p><p>My largest installation of PHP grown scripts, was at a company, where I scripted so much through PHP, that it would have taken 3 full-time people to replace what I had written. </p><p>Never fear running out of work, I was always busy at that job, and I never ran out of work, that is why I had scripted so much, just to get ahead and stay afloat. PHP is a powerful language. You can hardness data, and send it right into a database, in fact PHP libraries work with just about every database on the market, making it great glue code to import and export between different platforms. </p><p>Enroll now, and let's get started putting PHP to work for you, and letting it enhance and move your career forward. </p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "PHP Shell Scripting for Linux/Unix Administrators", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635564_8557_2.jpg", 
    "course_url": "https://www.udemy.com/php-shell-scripting-for-linux-unix-administrators/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T04:50:03Z"
}