{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course will teach you the best time-saving tips and tricks on <strong>Apple Watch</strong> to maximize your daily productivity and focus, so you can spend more time on doing what you want.<br></p><p><strong>Over 1,000 Students Saving Tons of Time with Apple Watch</strong><br></p><p>\"<em>I took the course the day I purchased my Apple Watch. The course was easy to follow and understand. It is a great course for a beginner like me. I would like to see Caleb Stultz create a next level course.</em><em></em>\" - Shaun, student<br></p><p>\"<em>This course was even easy for someone like me to understand and that's saying a lot. I love my Apple Watch but felt I was missing so much because I couldn't understand how to use it. Thank you Caleb for all the great information I could actually understand you and now I know how to use my watch.\" - </em>Rhonda, student</p><p><strong>If you had an extra hour of free time, how would you spend it?</strong></p><p>Many people don't know how to answer this question because they are so incredibly busy. We have so much that we have to do, that we never get time to do what we want to do. Spending time with family, resting, hobbies, and more get thrown out the door when we are busy.</p><p>In this course, instructed by Caleb Stultz – author of \"Apple Watch and watchOS 2: Power User in an Hour!\" (available on Amazon) – you learn how to gain those precious minutes back and more with your Apple Watch.<br></p><p><strong>Who is your instructor?</strong></p><p>For the past 5 years, your instructor Caleb has experienced a variety of challenges and learned how to use technology as a valuable productivity assistant. From working full-time while completing a Bachelor's degree to getting married and moving across the world, Caleb has had to embrace change and undergo immense stress. He didn't let that stop him from accomplishing his goals and staying productive. Instead, he created this course to teach you the ways he uses technology, like the Apple Watch, to maximize productivity.</p><p>You will dive right in to the content and begin learning immediately with no wasted time. The lecture videos you will watch are meant for you to follow along with. In addition, there are various activities to apply your learning throughout the course.</p><p>This course will arm Apple Watch owners with the skills to get more done and have more time for the things that <em>really</em> matter in life. With that in mind, this course will grow and improve, based on student reviews, as time goes on making room for new skills and strategies that help you to maintain productivity. </p><p><strong>See just how much time you can gain back with Apple Watch!</strong></p>", 
    "end_date": null, 
    "title": "Productivity Essentials: Work Smarter With Apple Watch", 
    "price": "20.00", 
    "instructors": "Caleb Stultz", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620456_5b43_7.jpg", 
    "course_url": "https://www.udemy.com/watchos2/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T16:29:12Z"
}