{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">A principios de los años 90, apareció el término<strong style=\"\">&quot;Realidad Aumentada (AR)&quot;</strong>, nombre que se aplicaba a una tecnología que ha mantenido desde entonces una evolución imparable, muy de cerca del desarrollo de la realidad virtual, con la que tiene algunas cosas en común. Ahora estamos en el<strong style=\"\"> momento álgido en de la evolución de esta tecnología</strong>, siendo imparable su ascensión como <strong style=\"\">herramienta de apoyo al conocimiento en muchas y variadas áreas profesionales y de la educación</strong>. La maduración de esta herramienta tecnológica en estos últimos años la ha aproximado a la sociedad como un bien común cada vez más extendido en sus aplicaciones. La <strong style=\"\">Realidad Aumentada</strong> se ha desarrollado en diferentes áreas del conocimiento, entre las que se encuentran la medicina, la arquitectura, el diseño, la publicidad y la educación, por citar solo algunas.<strong style=\"\"> Nuevas posibilidades y perspectivas</strong> se están dando ya en aquellas áreas en las que ha ido prosperando gracias a las investigaciones aplicadas poniendo de manifiesto todos los recursos que ofrece como herramienta. La comunicación ha sido una de estas áreas, especialmente ahora, donde ya se está comenzando a aplicar para que ejecute diferentes funciones. Tanta es su importancia actual que el<strong style=\"\"> International Symposium on Mixed and Augmented Reality (ISMAR)</strong>, que es el congreso más importante sobre Realidad Aumentada a nivel internacional, ha creado una sección especial denominada <strong style=\"\">&quot;Arte, media y humanidades&quot;</strong>, en sus últimos congresos con especial protagonismo de la RA en la comunicación cultural.</p><p style=\"\">Podemos considerar la <strong style=\"\">Realidad Aumentada </strong>con un <strong style=\"\">instrumento de enorme proyección para la puesta en valor del conocimiento, contenidos y difusión audiovisual</strong>, que puede dar respuesta a necesidades funcionales en todo tipo de entornos, transformando completamente la forma de difundir el conocimiento generando valiosas experiencias didácticas.<strong style=\"\"> Dentro de nuestra área profesional, sea cual sea, seguro que los usos de la Realidad Aumentada se multiplican</strong>, algunos de ellos aun por llegar y muchas son las soluciones que deberán aun ser desarrolladas de manera práctica, bajo la asociación de arte-ciencia que se viene dando a lo largo de la historia. Por esta razón se hace tan importante la <strong style=\"\">incorporación de profesionales y estudiantes al desarrollo tecnológico</strong> en diferentes ámbitos de acoplamiento de la tecnología a la difusión multimedia. También, los <strong style=\"\">profesionales de la educación, medicina, arquitectura, ingeniería, diseño, estudiantes y de la gestión cultural</strong>, debemos propiciar la relación necesaria y adecuada con las empresas dedicadas al desarrollo de estas herramientas avanzadas para que se utilicen cada vez más en la difusión audiovisual tecnologicamente más avanzada, y también con los centros e instituciones encargadas de la difusión de los contenidos.</p>", 
    "end_date": null, 
    "title": "Realidad Aumentada Aplicada", 
    "price": "50.00", 
    "instructors": "Prof. Ricardo  Cano", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444898_f7ca_3.jpg", 
    "course_url": "https://www.udemy.com/realidad-aumentada-aplicada/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T15:38:39Z"
}