{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Learn the basic concepts, tools, and functions that you will need to run Windows, Mac, and Linux on your current computer with the popular virtualization application, VirtualBox.<br></p><p><strong>Learn to use VirtualBox for iOS development or testing with this tutorial for beginners.</strong></p><ul><li>VirtualBox installation and setup</li><li><span></span>Optimization and best options for each operating system you will run (and some older ones too)</li><li>Install Windows 7,8,8.1, 10, and XP</li><li>Install Mac OS X Mavericks (El Capitan will be uploaded soon)</li><li>Install the latest version of Ubuntu Linux (14.04) and any other Linux variant</li><li><span></span>Fixing common networking problems</li><li><span></span>Learn how to share folders between the host and the guest</li><li><span></span>Setup XCode &amp; Swift on your virtual environment to develop iOS apps on Windows or Linux</li><li>Save yourself tons of money on a new Mac</li><li>Save yourself time trying random ideas from YouTube that don't work</li></ul><p><strong>Powerful Skills You'll Need on the Job</strong></p><p>Many development and IT jobs require that you understand virtualization, from DevOps to programming to IT/Help-Desk. Learning VirtualBox will give you a strong background in how virtualization works and what you can do with it. </p><p><strong>Content and Overview </strong></p><p>Suitable for beginners, through this course of 28 lectures and 2+ hours of content (more being filmed right now), you’ll learn all of the VirtualBox fundamentals and establish a strong understanding of the concept behind virtualization. Each chapter focuses on a specific use case for virtual computing allowing you to put your new learned skills into practical use immediately.</p><p>Starting with the installation of the latest version of VirtualBox, this course will take you through all the pertinent details of the program, and help you get setup correctly the first time.</p><p>Students completing the course will have the knowledge to create a number of virtual computers to use however you see fit. Typical uses are to develop iOS or android applications on Mac OS X, Learn Linux (Ubuntu and other versions), test websites and other applications, as well as run old software on outdated operating systems. </p><p>You’ll be able to work alongside the instructor as you work through each concept, and will receive a verifiable certificate of completion upon finishing the course.</p><p><strong>What am I going to get from this course?</strong></p><ul><li>Over 28 lectures and 2+ hours of content! (more in the works)</li><li><span></span>Learn VirtualBox from a professional trainer from your own desk.</li><li><span></span>Suitable for beginners and ideal for users who learn faster by doing.</li><li><span></span>Visual training method, offering users increased retention and accelerated learning.</li><li>An active connected instructor who will assist you with anything you need. </li><li>All discussion posts answered within 24 hours, most within a few hours.</li></ul><p><strong>Here's what others have said about this course<br><br></strong><em>\" I have tried many vm tutorials and yours is the only one that works.</em><em>\" - Will</em></p><p>\"<em>The course is very straight forward, short, fun and Ryan is a great instructor, taking care of any questions you might have.</em>\" - Gabriel</p><p><em><strong>Over 4000 students have already taken this course with many 5-star reviews! Why?</strong></em><strong></strong><br></p><p>The most important thing you can get in a course <strong>is an instructor that cares about what you need </strong>and will help you get it. Until you have the <em>support of someone who has been through what you're attempting, that will show you the steps you need to take in order you aren't going to get anywhere</em>.</p><p><strong>Mac OS X Mavericks &amp; Xcode (including Swift)</strong></p><ul><li>Learn to install Mac OS X Mavericks on a Windows computer</li><li>Learn to install Xcode 6 and Swift on a Windows computer (using a Virtual Machine)</li><li>Learn to fix the display resolution on Mavericks for best results</li><li>Finally mobile app developers can develop Android and iOS apps on the same computer without paying a ton of money for two computers. No more being locked into one operating system.</li></ul><p>This course contains 2+ hours of HD video lectures on how to get the most out of VirtualBox. including all the details on fixes and best practices you'll need to run any operating system you want without buying an expensive computer to do it. You really have nothing to lose! Enroll today and get started with VirtualBox. Don't spend $1000 or more on a new computer without at least trying this method first.</p><p>This course is so popular because it can potentially save you $1000 or more on buying a new computer to be able to do iOS development on Windows, install Linux, or Mac.</p><p><strong>5-Star Instructor Support</strong></p><p>I personally assist every student with any issues that come up. If you aren't satisfied for any reason, you have Udemy's 30 day money back guarantee, no joke. I want you to succeed, so I am here to help with anything you need, and if I can't help you then there is no reason to be stuck with this course. Reaching your goals and learning new skills is what really matters.</p><p>Enroll Today! Thank You!</p>", 
    "end_date": null, 
    "title": "Save on a Computer: Run Windows, Mac, & Linux w/ VirtualBox", 
    "price": "20.00", 
    "instructors": "Ryan Carter", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414752_edfa_2.jpg", 
    "course_url": "https://www.udemy.com/virtualbox-run-other-os-without-buying-a-computer/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T04:36:54Z"
}