{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Do you only use the terminal when copying and pasting commands from the internet but really want to understand what you are doing?</p><p>Do you look at the terminal window and feel lost or confused; not sure what to type to do anything?</p><p>The Mac OS X terminal is a very under used but powerful tool on the Mac but can seem confusing. Commands can seem like cryptic code but the reality is its a very powerful tool and can be used with ease. </p><p>The Term will also give you greater control over your computer and can make you a better programmer when you understand how everything fits together.</p><p>i've been using Unix terminals (Mac OS X terminal originated from Unix) for over 20 years now and in that time I have found they are very powerful. You can use to simply create files or you can use them for complex script programs.</p><p>In this course you'll learn essential tools in term to get stuff done and to get a more comfortable feeling while using term. You will learn: </p><ul><li>How to start and customise the terminal</li><li>How to navigate around your hard drive</li><li>How to create, copy and delete files and directories</li><li>How to edit and view files</li><li>How to link commands together to form more complex command</li><li>How to Search your hard drive for files and use this output to further the command </li><li>Productivity Tips &amp; Tricks</li><li>And how to use term to further you learning in term...</li></ul><p>If your looking to become a Mac developer or want to become a Mac power user then you owe it to yourself to learn and understand the terminal</p>", 
    "end_date": null, 
    "title": "Start Using The Mac OS X Terminal", 
    "price": "20.00", 
    "instructors": "Sean McCammon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497824_80c2_4.jpg", 
    "course_url": "https://www.udemy.com/mastering-the-mac-os-x-terminal/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T21:40:25Z"
}