{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>You've gotten a new web development client and you are totally psyched!</p>\n\n<p><em>Wait, what's that? You need to access the server through a terminal and ssh?</em></p>\n\n\n\n<p><strong>Have no fear! You can do it!</strong></p>\n\n\n\n<p>Don't fear the terminal! Whatever you can do through a graphical (S)FTP interface you can also do on the command line.<br></p>\n\n\n\n<p>This course will quickly get you up to speed on all the typical commands you will use to:</p>\n\n\n\n<ol><li>Create a key pair</li><li>Connect to a remote computer</li><li>Navigate the through the directory structure</li><li>Perform file managements tasks like creating directories; copying and moving files; setting permissions on directories and files</li><li>Create and manage databases and database users</li></ol>\n\n\n\n<p>Just follow sequentially through the lectures and all of the above and more will become clear.</p>\n\n\n\n<p><strong>Course Structure</strong></p>\n\n\n\n<p>Each command is presented in a separate lecture to make it easy to digest and easy to find again when you want to use the course like a reference guide.</p>\n\n\n\n<p>Each command is fully demonstrated in a High Definition screen cast.</p>\n\n\n\n<p><strong>Satisfaction Guarantee</strong></p>\n\n\n\n<p>I personally guarantee that after you take this course you will be able to complete all the tasks you were formerly able to do only through a graphical interface. If you find that you are not able to do the things you could have otherwise done with a graphical interface, I will work one-on-one with you to help you through your challenge and will add that information to the course.</p>\n\n\n\n<p><strong><em>Click the \"Take This Course\" button now and get ready to level up your command line skills!</em></strong></p>", 
    "end_date": null, 
    "title": "Terminal / Command Line Skills", 
    "price": "20.00", 
    "instructors": "Marc Isaacson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548426_463e_7.jpg", 
    "course_url": "https://www.udemy.com/command-line-survival-transfer-and-manage-files-with-ease/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-07T22:02:28Z"
}