{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Whats New for the Course </strong></p>\n\n<p><strong>Whoops ... We are over 400 lectures now and are the biggest tutorial on Android on Udemy. Check out what's in store.</strong></p><p><strong>May 2016</strong></p>\n\n\n\n<p><strong>Added New Section on Palette API. Now dynamically select colors from Bitmaps in an exciting way. </strong></p><p><strong>New Section on New Material Design Widgets like NavigationView, Snackbar ,AppbarLayout, CoordinatorLayout, CollapsibleToolbar and more ... . Are you planning to use them in your App. Check out the Section now.</strong></p>\n\n\n\n<p><strong>April 2016</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Whats more this month ???? </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Not stopping at Google Sign In .Added the Google Geofences Tutorial with a Geofencing App to monitor your kids movement. Have you checked up the same. Check out the Geofences Section and see how you can create and monitor Geofences and how to create Notifications or SMS when such Geofences are triggered. Also added Captions to the Google SignIn Section. Now language is not a barrier.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Check out the new Section on logging in with Google Account - the new way to get users log in alongside logging in with Facebook. We have added Captions to lectures in this Section for people who find difficulty in understanding English as the primary language. Get started with Logging in with Google Sing In API.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>March 2016</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Added the New Google Maps API with StreetView and a Sample App as to how you can use Street View in your Application . Learn creating Maps, Markers , InfoWindows, handling events on Maps, Markers and more with a Path Sketching Application . Check out the section now. Added how to customize Google Info Windows with your own UI. Now no more boring Maps but Interactive Data Maps.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>UPDATED FEBRUARY 2016:</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Added the New Facebook API - 4.6.0 for integrating with your Android App. Now get updated to the new Facebook API . Now add Login with Facebook and Share with Facebook to your App using the new updated Facebook API.</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Over 35hrs of content and 350 lectures and still adding.....</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Join the amazing list of over 2000+ happy and satisfied students and learn Android Lollipop App Development from the best course available in Udemy marketplace.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The No. 1 Android Development Tutorial that teaches you how you could develop a Professional Android App yourself - YES YOURSELF - using the latest Android Lollipop APIs. To Create a great App you must be sound with how to program with Android APIs.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Covers all the Key Elements you shall need to build a great Commercial App like UI with Android Lollipop, Drawer Layouts, Social Media Integration, Broadcast Receivers, Google Cloud Messaging, AQuery Library and much more.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tThe course that contains more Android Lollipop content than you would find on any other course .  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t      THE COURSE REQUIRES NO PREVIOUS KNOWLEDGE OF ANDROID PROGRAMMING ,BUT A BASIC KNOWLEDGE OF JAVA LANGUAGE IS REQUIRED. TO LEARN JAVA ,  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>USE OUR JAVA COURSE TO GET YOUR JAVA BASICS IN ORDER.</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>JAVA - MAKE IT YOUR CUP OF COFFEE</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t      SO GET STARTED !!!!!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t            Our dedicated Team provides support to all your queries at our Email id  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>\"learningkartcourses@gmail.com\"</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t    So if you are held up at any Lecture ,just drop us a mail and we are there to support you.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                                                                                ONCE YOU ENROLL FOR THE COURSE YOU SHALL BE ENTITLED FOR ALL UPDATES FOR THE COURSE DURING THE ENTIRE LIFETIME OF THE COURSE. SO HURRY AS WITH EVERY UPDATE THE PAYMENT SHALL BE REVISED.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                                                              What the course will entail -  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<ol>  \t\t                                                                                                                                                                                                                The Tutorial shall cover the basics of Android Development to using Google Cloud Messaging for sending Notifications. We endeavor to cover majority of components added till Android KitKat 4.4 and added in Android Lollipop 5.0 that are commonly employed by professionally developed Apps.  \t\t<p>  \t\t\t                                                                                                                                                                                                          Integration of Social Media Facebook, Twitter ,Pinterest etc shall find a place in the tutorial as they are now Integral part of every Application.  \t\t</p>  \t</ol>  \t<ol>  \t\t                                                                                                                                                                                                          Third party libraries like Aquery etc shall also be dealt with in detail to support Application Development .  \t</ol>  \t<ol>  \t\t                                                                                                                                                                                                                  Every stage shall come with a project to test you in the knowledge gained in that stage.  \t</ol>  \t<ol>  \t\t                                                                                                                                                                                                                If you are thinking of a commercial Android App and cannot look for resources around the Internet for help, this one is for you. We endeavor to make it the best tutorial you would encounter for Android.  \t</ol>  \t<ol>  \t\t                                                                                                                                                                                                               Every Section shall have a small development project to test your grasp of the Section.  \t</ol>  \t<p>  \t\t                                                                                                                                                                                                                Keep Androiding .....  \t</p>  </ul>", 
    "end_date": null, 
    "title": "The Ultimate Android Marshmallow Tutorial-learn by practice", 
    "price": "20.00", 
    "instructors": "Learning Kart", 
    "commitment": "41.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235584_393c_8.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-android-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T13:51:00Z"
}