{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>iOS 9.2 is packed with improvements!  Everything from Siri \"Always On\", to quick access to the most commonly used features within control panel that can be accessed quicker than ever before.  The more you explore all the new advanced features with iOS 9.2, the more you'll wonder about what new and interesting thing your going to discover today!</p><p>My name is <em><strong>Scott Beowulf Kaine</strong></em> and I'm proud to bring you this course, \"<strong><em>The Complete Guide to iOS 9.2 - iPhone Edition</em></strong>\".  For the duration of this course, my goal is to walk you through step by step all of the fascinating apps and new features that have been implemented within iOS 9.2 and how they can make your life easier and in many cases, more efficient.</p><p><strong><em>Who is this course for?</em></strong></p><ul><li>This course is designed primarily for beginners new to iOS or those whom are migrating from Android OS, though anyone can benefit from a refresher at any level!  I've designed each of the videos to be short and to the point in an effort to minimize any confusion or put you to sleep! I believe that learning should be fun and support a fundamental purpose in achieving our goals and aspirations, thus the reason for this course!</li></ul><p><strong><em>What will I get from this course when I am 100% done?</em></strong></p><ul><li>Once you have completed the course to 100%, you will have a clear and unrivaled understanding of your iOS iPhone, and to great extent, your iPad as well as much carries over since they share the same operating system!</li><li>You will no longer be fumbling around on your iPhone wondering where things are or how to do things.</li><li>You will be the envy of all your friends because now <strong>YOU</strong> are the iPhone <strong>genius</strong>.</li><li>You will have the satisfaction of knowing that you accomplished this course!</li></ul><p><br></p><p><strong><em>So what are you waiting for? Sign up now and start learning!</em></strong></p><ul><li><strong><em></em></strong></li></ul>", 
    "end_date": null, 
    "title": "The Complete Guide to iOS 9.2 - iPhone Edition", 
    "price": "20.00", 
    "instructors": "Scott Kaine", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748554_777e_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-guide-to-ios-9-iphone-edition/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T06:16:35Z"
}