{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This is a very basic absolute beginners introductory course to  Unix.</p>  <p>The course introduces you to how to use a Unix terminal and commands .</p>  <p>You will be exposed to terminologies like Unix Kernel, Unix Shell and Terminal.</p>  <p>The only material you will need for this course is a modern web browser and the course is less than one hour long.</p>    <p>The course is structured in the following way:</p>    <ul><li>Introduction to Unix</li><li>Flavours of Unix</li><li>Parts of Unix</li><li>The Kernel</li><li>The Shell</li><li>Unix Terminal</li><li>Basic Unix Commands</li><li>Summary</li></ul>                  <p> Unix is an operating system that is known for multi user and multitasking.</p>  <p>It was created in the 1960's by group of engineers who worked at AT&amp;T Bell research labs.</p>    <p>UNIX has become kind of open source with different companies ,organisations and even individuals creating their own versions from the open source versions. Although there are different flavors of Unix they also</p>  <p>share common similarities hence knowing one flavor of Unix makes it easy to learn or pick up another variant of the operating system fairy quickly.</p>    <p>Some of the popular  variants of Unix operating system available include Solaris, Red Hat, Fedora ,Ubuntu,and Linux. There are several more this is just a brief mention of the varieties available. some of these variants can be installed both on servers and desktops or workstations.</p>    <p>Unix operations are usually done using UNIX commands through a Unix terminal ,however there are some variants of Unix that has a friendly graphical user interface (GUI) like Microsoft windows operating system</p>    <p> In this course we will be using a free web based Unix terminal to perform some very basic Unix commands to get you acquainted with Unix Operating system.</p>    <p>Taking this course will give you a basic Unix skill that you can develop further.</p>    <p>Welcome to the course .</p>", 
    "end_date": null, 
    "title": "Unix For Beginners", 
    "price": "20.00", 
    "instructors": "Skill Tree", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/98434_d5d1_3.jpg", 
    "course_url": "https://www.udemy.com/unix-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-27T16:49:44Z"
}