{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t  Wenn du gerne Computer Magazine liest oder dir die Nachrichten am Fernsehen anschaust, lernst du schnell, dass dein Computer und damit die Sicherheit deiner Daten in Gefahr sind: Computerangriffe, Viren, Trojaner und Malware sind überall! Es scheint fast so, dass du eines Tages an deinem Computer sitzt und alle deine Daten weg sind, weil sich ein Virus, den du noch nicht einmal wahrgenommen hast, auf deinem Computer eingenistet hat und sich tief in dein System eingräbt.  </p>  <p style=\"\">  \t  Aber keine Sorge! Wir zeigen euch, wie Ihr Viren und Co. los werdet oder gleich dafür sorgt, dass Euer Computer gar keine abbekommt.  </p>  <p style=\"\">  \t  Wir zeigen euch den Unterschied zwischen den verschiedenen Virenarten und wie du deinen Computer kostenlos sicherst. Mit einem Backup Programm, einem Antiviren Programm und einem Malware Killer werden wir deinen Computer sicher aufsetzen und frei von Viren und Co. halten.  </p>  <p style=\"\">  \t  Aber warte, das ist nicht alles, was du in diesem Mini-Kurs lernen kannst! Wir zeigen dir auch, was du tun musst, wenn du bereits mit einem Virenproblem zu kämpfen hast.  </p>  <p style=\"\">  \tMit unserem Kurs benötigst du keinen PC Experten mehr, der zu dir kommt und deinen Computer wieder auf Vordermann bringt. Du kannst das selber machen, ohne große Anstrengung.  </p>  <p style=\"\">  \tWir zeigen dir, wie du die Notfall-CD nutzen kannst, wenn dein Computer nicht mehr startet und bereits infiziert ist. Und dann werden wir die Viren gemeinsam los!  </p>  <p style=\"\">  \t<strong style=\"\">Bitte beachte: </strong>Es ist gut etwas für die Sicherheit deines Computers zu tun, bevor dieser infiziert ist. Wenn dein Computer noch nicht befallen ist, ist es eine gute Idee, dir diese Videos anzusehen und den Computer sicher zu machen.  </p>", 
    "end_date": null, 
    "title": "Virenbeseitigung auf dem Windows Computer", 
    "price": 0, 
    "instructors": "Monja Wessel, Markus Korsten, Online Lernen SimpleLife Stories", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420194_8b6c_3.jpg", 
    "course_url": "https://www.udemy.com/virenbeseitigung-auf-dem-windows-computer/", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T13:44:41Z"
}