{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>VMware vSphere 6.0 is the platform businesses depend on to deploy, \nmanage and run their virtualized Windows and Linux workloads. </p><p>In this course \nyou will learn how to <strong></strong>connect to and use shared <strong><strong>SAN Storage </strong></strong>including Fibre and iSCSI storage, to <strong>Format and Expand VMFS</strong> volumes, how to <strong>Resource Tune</strong> Virtual Machines, how to create and tune <strong>Resource Pools</strong>, and how to perform cold, <strong>VMotion </strong>and <strong>Storage VMotion</strong> migrations.<strong><strong></strong></strong><strong></strong></p><p><strong>Learn Storage, VMFS, Resource Management and VM Migrations<br></strong></p><p><strong><strong></strong></strong>This course covers four major topics that all vSphere 6 vCenter administrators must know:<br></p><ul><li>First, we look at shared <strong>Fibre </strong>and <strong>iSCSI </strong>shared storage. We start with an overview of features and capabilities of suitable SANs. We move on to discuss storage network design for <strong>redundancy and performance</strong>, SAN security with <strong>Zoning and Authentication</strong>, <strong>iSCSI hardware and Software initiators</strong>, how to scan and review <strong>SAN LUNs</strong> and various Storage views. We complete the section with a presentation of <strong>NFS v4.1 file shares</strong> (new to vSphere 6.).</li><li>Next we look at VMware's cluster file system - <strong>VMFS</strong>. We learn how to create VMFS partitions and their properties. We look at basic capacity management (and what can go wrong) and offer two strategies for <strong>managing VMFS capacity</strong>. We go on to talk about <strong>Path Selection Policies</strong> (PSPs) and explain the trade offs of VMware's three provided PSPs. We show you how to select the <strong>optimal PSP</strong> based on your storage network design and your SAN's capabilities.</li><li>We move on to discuss <strong>Resource Managemen</strong>t and <strong>Resource Pools</strong>. Effectively managing CPU and Memory is critical to host and VM scalability. VMware provides three tunables - <strong>Reservations</strong>, <strong>Shares </strong>and <strong>Limits</strong>, to help you delegate resources as you require. We show you how to assess resource needs and how to create/use Resource Pools. Finally, we explain <strong>Expandable Reservations</strong> and show you how to use them safely.</li><li>Finally, we look at VM migrations. VMware supports cold (powered off) migrations to a new ESXi host or datastore. Next we look at <strong>VMotion hot VM migration</strong> - where we hot move a running VM to a second ESXi host. We look at <strong>CPU compatibility requirements</strong> and show you how to tell if your physical host CPUs are VMotion compatible. Finally, you will learn how to perform <strong>Storage VMotion</strong> (hot move a VM from one datastore to another) and the Use Cases for Storage VMotion.</li></ul><p>The skills you will acquire in this course will help make you a more effective vSphere 6 administrator.</p>", 
    "end_date": null, 
    "title": "VMware vSphere 6.0 Part 3 - Storage, Resources, VM Migration", 
    "price": "20.00", 
    "instructors": "Larry Karnis", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/727108_3b50_2.jpg", 
    "course_url": "https://www.udemy.com/vmware-vsphere-60-part-3-storage-vmfs-resources-vm-migration/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T18:08:56Z"
}