{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>VMware vSphere 6.0 is the platform businesses depend on to deploy, \nmanage and run their virtualized Windows and Linux workloads. </p><p>In this course \nyou will learn how to migrate source Windows and Linux workloads (installed operating systems on physical or virtual machines) to VMware vSphere infrastructure (ESXi hosts managed by vCenter Server) using <strong>VMware vCenter Converter</strong>.<br></p><p><strong>P2V and V2V Migrations with vCenter Converter<br></strong></p><p><strong><strong></strong></strong>This course covers one topic that all vSphere 6 vCenter administrators must know:<br></p><ul><li>One of the primary reasons for adding VMware vSphere virtualization to your IT infrastructure is to reduce capital costs. You do this by running many Virtual Machines on a small number of physical machines by running ESXi (and managed by vCenter). But, how do you get your existing Windows and Linux servers migrated over to your new vSphere environment? The answer is <strong>VMware vCenter Converter</strong>.</li><li><strong>vCenter Converter</strong> can reach out to source <strong>Physical Machines</strong> (Windows or Linux installed on a PC Server) and clone-and-migrate the entire hardware state (CPU, Memory, Disk, Networking) to a new Virtual machine. This is called a <strong>P2V</strong> (physical to virtual) migration.</li><li><strong>vCenter Converter</strong> can also reach out to source <strong>Virtual Machines</strong> (Windows or Linux running in a virtual machine) and clone-and-migrate the entire hardware state (CPU, Memory, Disk, Networking) to a new Virtual machine. This is called <strong>V2V</strong> (virtual to virtual) migration. Converter can migrate most virtual machine sources including VMs running on Hyper-V, VirtualBox, Parallels, VMware Player/Fusion/Workstation, etc.</li><li>You will learn how to install and configure <strong>vCenter Converter</strong>, how to reach out to a source machine and profile it, to locate and size a target VM to hold the converted source machine, to monitor the conversion process and what to watch out for as you conduct conversions. You will also learn <strong>VMware Converter Best Practices</strong> to help ensure a successful conversion - every time!</li></ul><p>The skills you will acquire in this course will help you complete your <strong>server consolidation project</strong> and make you a more effective vSphere 6 administrator.</p>", 
    "end_date": null, 
    "title": "VMware vSphere 6.0 Part 6 - P2V Migrations With Converter", 
    "price": "20.00", 
    "instructors": "Larry Karnis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749044_87f9.jpg", 
    "course_url": "https://www.udemy.com/vmware-vsphere-60-part-6-p2v-v2v-vm-migrations-with-vcenter-converter/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T16:10:52Z"
}