{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong>Windows 10 overview</strong>  </p>  <p>\n  \tWindows 10 is Microsoft's latest installment of their operating system.\n  In the latest update from Windows 8, Windows 10 offers many new \nfeatures. The biggest of all being the new UI overhaul. Windows is now \nsplit in both the classic desktop UI along with the modern/metro UI. The\n new user interface offers a whole new way to browse windows. Not only \nis windows built for mouse &amp; keyboard but now touch based computers \nas well. It retains the popular aero interface with some noticeable \nchanges like the removal of the windows start menu. On top of everything\n windows 8 is a lighter, faster, and more efficient OS. Despite the UI \nchanges its under the hood tweaks provide a cleaner and faster \nexperience.  </p>  <p><strong><u> </u></strong></p>  <p><strong></strong>This course is designed to help users new &amp; experience get an understanding of Windows 10 Microsoft all new OS. Taking you through the basics of the OS &amp; whats changed and how to navigate all those new features. Starting from the interface itself moving into a variety of topics such as privacy control, configuring &amp; using certain, and the all new Edge Browser. The goal being you walk away a more experienced &amp; informed Windows 10 user whether your on the home or pro edition.</p>  <p><strong><u> </u></strong></p>  <p><strong>Module 1: Navigating the Start Menu</strong></p>  <p>Windows 10 features an all new start menu &amp; this video dives into the details behind it. How to navigate &amp; adjust your start menu depending on your preferences. The new start menu brings the best of the modern UI &amp; classic start menu your used to.</p>    <p><strong>Module 2: Navigating the Settings Menu</strong></p>  <p>While the control panel still exists in Windows 10 its a bit buried &amp; replaced with an all new modern settings app. This allows you adjust settings from everything on your PC from hardware to software. It features privacy controls, account data, and much more.</p>    <p><strong>Module 3: Windows 10 Interface Tips</strong></p>  <p>The new Windows sports a new look &amp; replaces some things you may have been used to. This video looks at all the new implementations &amp; how you can start to customize Windows to your personal liking. Color schemes, virtual desktops, and more.</p>    <p><strong>Module 4: Overview Edge Browser</strong></p>  <p>Microsoft has packed a totally separate browser from Internet Explorer. The Edge Browser is great for browsing the web either on a touch screen interface or the classic desktop mode that your used to. Edge brings new features like the ability to annotate the web with highlighter tools &amp; pens to make it easy to research &amp; share information. Additionally the Edge Browser sports an all new simple UI that we show you around.</p>    <p><strong>Module 5: Install/Uninstalling Apps</strong></p>  <p>This simply focuses on how to install some of the default Windows apps back in the even you deleted them &amp; also uninstall unnecessary or unwanted apps from your computer.</p>    <p><strong>Module 6: Overview Windows Store</strong></p>  <p>The Windows store serves as a hub for all your application &amp; entertainment needs. We show you how to navigate &amp; download apps directly from the windows store. This is much more useful &amp; safe as all apps are verified directly form Microsoft.</p>    <p><strong>Module 7: Configure &amp; Use Cortana</strong></p>  <p>One of the staple features of Windows 10 is the all new Cortana based assistant. This personal assistant can help you with a series of commands &amp; day to day tasks. We show you how to enable &amp; better configure Cortana to work for you in the long run.</p>    <p><strong>Module 8: Configuring Parental Controls</strong></p>  <p>Surely some of the users out there will have children using their Windows 10 based devices. We show you the parental control menus &amp; how you can configure the OS for a safer experience.</p>    <p><strong>Module 9: Configuring Privacy Controls</strong></p>  <p>Privacy is important to every user we show you how to toggle certain settings to ensure you know exactly whats going on with your data in Windows 10.</p>      <p><strong>Module 10: Overview Action Center</strong></p>  <p>The Action Center is Windows notification hub. Its where you see all the new updates &amp; reminders on your PC. We show you how to navigate &amp; customize your notifications area to your liking.</p>    <p><strong>Module 11: Windows </strong><strong>“Hello</strong><strong>”</strong></p>  <p>Windows Hello is a series of new features to make your lockscreen more appealing &amp; the overall log in experience that much more easier with facial recognition &amp; fingerprint readings.</p>  <p>We take a tour into the settings &amp; how to set it up.</p>    <p><strong>Module 12:Maps</strong></p>  <p>One of the new default apps in Windows 10 is their mapping solution based off Bing. Whether your looking for directions or a new restaurant in the area this app has you covered.</p>    <p><strong>Module 13: Clean Up Your Windows 10 Install</strong></p>  <p>Whether you upgrade or clean install we examine some tweaks &amp; tasks you can run to free up hard drive space &amp; reclaim data that Windows 10 takes up. Taking a look at the Disk Cleaner utility in detail to help you ensure your Windows 10 device runs optimally.</p>    <p><strong>Module 14: Windows 10 Keyboard Shortcuts</strong></p>  <p>To round up the course we felt it was best to highlight useful shortcuts to help you around all of Windows 10. These important shortcuts save you a lot of time &amp; hassle and make browsing through the OS a breeze.</p><p>Join this course today!<br></p>", 
    "end_date": null, 
    "title": "Windows 10 Crash Course", 
    "price": "25.00", 
    "instructors": "Earners Classroom", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628914_b814_4.jpg", 
    "course_url": "https://www.udemy.com/windows-10-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T15:48:51Z"
}