{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Windows Deployment Services (WDS) server is no longer optional for any highly qualified IT administrator, if you manage many PCs in your place, you should consider using WDS as a primary service for Windows deployments.</p>\n\n<p>Why? Good question. And the answer is clearly visible if you check the curriculum of this course, you can see the benefits of having WDS to help you manage and maintain all your Windows images in one store, your server.</p>\n\n\n\n<p>So what makes WDS that useful for us? WDS works as a multi-purpose service, if you only said it's used to deploy images, you are telling a part of the truth, a minor part to be honest, with WDS, you can maintain your images, meaning that you can keep all your images updated periodically to include latest updates and service packs, you can have a WinPE images that help you troubleshoot problematic machines, you can automate installing drivers for your hardware whenever you deploy an image to a machine, you can create your reference image which will save you tens of wasted hours in getting your machines ready to be used, you can also automate the deployment process using XML answer files! Let's get a little deeper and see what this course covers...</p>\n\n\n\n<p>We will start from scratch, with a brand new server, so if you're totally new to this technology, that's absolutely fine, we will learn how to add WDS role to the server, complete the initial configuration, and explore the WDS console to have an idea about what we are going to discuss in the course.</p>\n\n\n\n<p>In the second section, we will see a common case that causes some kind of problems for system admins, having WDS with DHCP in the same server, why it causes a problem, and how to configure WDS &amp; DHCP properly so you don't get yourself in trouble doing that.</p>\n\n\n\n<p>After that, the real stuff will begin, we will start adding our images to the server, we will cover different types of images and what's the difference between them, boot, install and discover images, we will see how to add hardware drivers to our WDS so they get installed automatically to our deployed machines, and we will see if our configuration will work when we boot a machine to network? (Hopefully!)</p>\n\n\n\n<p>The following section will dedicated to cover creating reference images (they refer to it as: standard, master, golden, etc.), you can call it an \"ideal image\", it will have your operating system, applications, updates, files, and settings included in one image, maybe you're thinking now, so what should I do after installing that image to a machine to make it ready-to-use?! Nothing.</p>\n\n\n\n<p>There will be some different minor topics that are going to be covered in the extra section, and in the bonus section, we will see how to create XML answer files to automate the installation process (And yes, you can add this automation file to your reference image, so you get a ready-to-use device with zero human intervention)!</p><p>To get the best learning experience, every single step we mentioned here is applied practically, all the videos are recordings of my screen, where we will apply what we are discussing, boring read texts have no place here in the course.</p>\n\n\n\n<p>So if you have read all that, you are now confident that you need to learn all these stuff, along with many tips included in the lectures to make it very beneficial for you, enroll now, and let's start.</p>", 
    "end_date": null, 
    "title": "Windows Deployment Services: Build Your Server From Scratch", 
    "price": "20.00", 
    "instructors": "Omar Dabbas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/836656_927d_2.jpg", 
    "course_url": "https://www.udemy.com/wds-server/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-01T12:02:11Z"
}