{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><em>Note: Join the 4,000+ students who have already enrolled and over 250 <strong class=\"redactor-inline-converted\">five</strong><strong class=\"redactor-inline-converted\"> star </strong>reviews.  Every day I interact with students and help them on their journey and I can help you too! Check out the reviews for your self below...</em></p>\n\n\n\n<p><em>----<em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em></em></p>\n\n\n\n<p>If you want to get a Help Desk, Systems Admin, IT Support Specialist, or other IT releated job, this is the course you have been looking for!  This course will give you the critical skills necessary to succeed in the Information Technology field.</p>\n\n\n\n<p>Companies everywhere are looking for people who have real job skills and not simply certifications or degrees! Many people are graduating college and looking for an job but are unable to secure a position because <strong>they don't have any practical experience</strong>.</p>\n\n\n\n<p>This course will give you the skills you need in order to get into the IT field. I will be covering a myriad of topics including how to setup Windows Server 2012, how to build a domain controller, and how to work in Active Directory and Group Policy.</p>\n\n\n\n<p>If you are looking to get <strong class=\"redactor-inline-converted\">hands-on experience</strong> THIS IS the course for you. Stop waiting and <strong class=\"redactor-inline-converted\">enroll now!</strong></p>\n\n\n\n<p><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><em>----</em><br></p>\n\n\n\n<p>Here are some of the course reviews (see more below):</p>\n\n\n\n<p>by Willie Beale, (5/5) <strong class=\"redactor-inline-converted\">GREAT COURSE HIGHLY RECOMMENDED</strong></p>\n\n\n\n<p>Truly one of the best course on udemy. For months after getting my A+, MCITP and MCTS windows 7 I could not get an interview anywhere but after taking this course and using the resume template within a week after submitting my resume to several companies I got 3 interviews. Highly recommended. Instructor is great I've watched this course 5 times already.</p>\n\n\n\n<p>by Kurt Schmucker, (5/5) <strong class=\"redactor-inline-converted\">Excellent course</strong></p>\n\n\n\n<p>A very good course, with excellent hands-on configuration of virtual machines (VMs). I can only imagine how tough it must have been to learn these IT skills before VMs became prevalent and so easy to install, configure, throw away, etc. I am learning exactly the items I needed.</p>\n\n\n\n<p>by Robert Martin, (5/5) <strong class=\"redactor-inline-converted\">Nothing that you don't need to sift through to get the gems!</strong></p>\n\n\n\n<p>I love this course! It is concise and to the point giving students the luxury of not having to figure out what the \"important\" tidbits of information are. It ALL is, and that's a refreshing difference from most other online tutorials I've waded through. Thanks for good design and lesson planning!</p>\n\n\n\n<p>by Corey Carter, (5/5) <strong class=\"redactor-inline-converted\">Invaluable</strong></p>\n\n\n\n<p>There are a lot of courses on udemy with regard to Windows System Administration but I am glad I chose this one. I about 175 days left on my eval copy of windows server and plan to use it to really practice all the things I learned in this course. It is a beginner course and feels like one so if you're at all wondering if you should take it, stop wondering and take it!</p>\n\n\n\n<p>by Travis Coles, (5/5) <strong class=\"redactor-inline-converted\">Great Instruction</strong></p>\n\n\n\n<p>Very practical, easy to understand lectures. The quality is excellent and the instructor's delivery was spot on. I can't wait for the next course.</p>\n\n\n\n<p>by Roshan Ally, (5/5) <strong class=\"redactor-inline-converted\">Awesome course</strong></p>\n\n\n\n<p>This is an excellent beginner`s course in Windows Server 2012 R2. William explain and demonstrated some important and useful tasks that the sys admin will do. I learn a few things about virtualbox as well. I enjoy following along and do the tasks as well. I now feel more cofident about the Windows Server Operating System. I do hope that William will follow up with intermediate and advanced level courses.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">See more reviews for yourself below!</strong><br></p>", 
    "end_date": null, 
    "title": "Windows Server 2012 System Administration: Get an IT Job!", 
    "price": "20.00", 
    "instructors": "Paul Hill", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687586_bbd0_2.jpg", 
    "course_url": "https://www.udemy.com/systems-administration-101-active-directory/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T00:42:25Z"
}