{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\"><span style=\"\"><strong style=\"\">5 star reviews!</strong></span></p><p style=\"\">**Read the entire summary for extra bonuses you can&#039;t do without!**</p>  <p style=\"\">  \t              Do you want to have your own website or blog? Would you love to enter a website name like this?  </p>  <p style=\"\">  \t                                                                yournamehere dot com  </p>  <p style=\"\">  \t                  You can with the WordPress platform and this course.  </p>  <p style=\"\">  \t                  By the end of this 30 minute course, you&#039;ll have your own domain name, web hosting account, and WordPress blog ready for your new future!  </p>  <p style=\"\">  \t                  Due to the ease of use and creative options, the WordPress platform is by and far the most widely used website building platform on the market today.  </p>  <p style=\"\">  \t                  This course is designed for the beginner entrepreneur interested in starting their first blog or online website, but don&#039;t know how to begin.  </p>  <p style=\"\">  \t                  This course will show you exactly how to set up your WordPress site through video and step by step, follow along instruction.  </p>  <p style=\"\">  \t                  That means you can watch the video, pause the video, purchase a domain name, purchase a hosting account, and set up your WordPress site, all while watching the step by step instruction.  </p>  <p style=\"\">  \t              <strong style=\"\">And if that isn&#039;t enough, you&#039;ll also receive three extra bonuses!</strong></p><p style=\"\"><strong style=\"\">UnSlappable SEO Ebook </strong>- You need people to find you online right? This ebook will give you the tools to make sure your website or blog has a high ranking on Google!</p><p style=\"\"><span style=\"\"></span><strong style=\"\">WordPress Security Guard Ebook </strong>- Hackers are after you! That&#039;s right, given the chance, hackers will slip into your site and take it over ruining everything you&#039;re worked so hard to build. This ebook will show you exactly how to protect yourself from the enemy!</p><p style=\"\"><span style=\"\"></span><strong style=\"\">How to Set Up Your Blog (bonus video) </strong>- Did you know as great as WordPress is, there are things you need to change right away to get a blog started in the right direction? This bonus video will show you exactly what you should do to get your blog ready for it&#039;s first post.</p>  <p style=\"\">  \t          So, if you&#039;re ready to start a new direction and new adventure in life, enroll in this course and start your website today!  </p>", 
    "end_date": null, 
    "title": "Wordpress for Beginners: Domain, Hosting, Install in 30 Min!", 
    "price": "20.00", 
    "instructors": "Mike Dickson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396304_df6b_2.jpg", 
    "course_url": "https://www.udemy.com/learnwordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T04:35:24Z"
}