{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<table>  <tbody>  <tr>  \t<td>  \t\t  Master WordPress   CMS on your terms with this one-of-a-kind video training course.<br>  \t\t<p>  \t\t\t  WordPress is the largest self-hosted   blogging tool and is renowned and revered for its ease of use and robust   toolset. Now, you can learn the ins and outs of maximizing WordPress CMS   tools - from installing the blogging software to creating your own fully   customizable blog - with WordPress CMS Essentials.  \t\t</p>  \t\t<p>  \t\t\t   Our instructors provide expert, straight-forward,   user-friendly training to help you tackle new topics the way you want to   learn. Master basic skills, boost your creativity, and challenge yourself in   bold new directions.  Get to know   WordPress basics, familiarize yourself with its platform and tools, and set   up your profile  Select existing   templates or get creative and customize your own WordPress theme  Add video, audio, images, and other media   to your posts and work with widgets to provide a dynamic reader experience on   your blog.   Assign user permissions, use   scheduling tools, and optimize your site for performance, security, and   discoverability.  \t\t</p>  \t\t<p>  \t\t\t  Includes over 6 hours   of WordPress CMS video training  If   you&#039;re looking for real-world WordPress CMS instruction, you&#039;ll find it   here.  \t\t</p>  \t</td>  </tr>  </tbody>  </table>", 
    "end_date": null, 
    "title": "WordPress CMS Essentials", 
    "price": "20.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343650_f029.jpg", 
    "course_url": "https://www.udemy.com/wordpress-cms-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T21:03:19Z"
}