{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Learn advanced techniques to use your Mac to increase workflow and productivity.</p><p style=\"\"><strong style=\"\">Master a strong method to using your Mac to help you with everyday queries taught in a very easy to understand way.</strong></p><ul style=\"\"><li style=\"\">Help the environment with Energy Saver.</li><li style=\"\">Keep your Mac safe</li></ul><p style=\"\"><strong style=\"\">A different perspective on your Mac</strong></p><p style=\"\">Learning the fundamentals of OSX Yosemite puts an advanced level skill right on your computer for you to learn. This could be used for people that have a mac of are thinking about getting one and what to know lots of tips and tricks. Anyone can use OSX Yosemite as long as they have the current version on their mac. </p><p style=\"\"><strong style=\"\">90% of the course in captured in beautiful 2K 60 FPS</strong></p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">Suitable for anyone this course features 11 lectures and over 30 minutes of content this will certainly teach you the advanced knowledge. The first lecture is about Spotlight Search this can be used for anything from finding when films are showing to searching for files on your Mac. In the second lecture I will teach you about the different types of finder views, this is what your files look like when you see them. In lecture 3 I will teach you how to take 3 different types of screenshots. The 4th lecture teaches you all about Hot Corners, this controls what happens when you put your cursor in a corner of the screen. Lecture 5 teaches a simple thing on windows that is harder on mac removing applications. In lecture 6 I will show you how to transfer files between IOS and OSX devices in a feature call AirDrop. In lecture 7 I will show you how to remove Adware, you will know if you have this because you home page might have changed or you will be getting lots of pop ups. In lecture 8 I will show you how to personalise your dock. In lecture 9 I will show you how to Batch file rename, this is great for when you have 1000 photos and you want each photo to have a specific name, I show you this with only a few clicks. In lecture 10 I will teach you how to record you IOS screen wether its you iPhone or iPad or iPod. In lecture 11 I will teach you how to use energy saver, this is great if you want your computer to wake, sleep, boot or restart at certain time. Energy saver is also great for setting your screen and mac to sleep. In the final lecture I show you how to put your computer in to dark mode, this is supposed to boost concentration.</p><p style=\"\">If you complete this course you will be able to use your mac to help you with every day needs along with some extra bonus&#039;. Extremely handy.</p>", 
    "end_date": null, 
    "title": "Yosemite - Advanced Tips and Tricks", 
    "price": "20.00", 
    "instructors": "Christopher Young", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579958_dd91.jpg", 
    "course_url": "https://www.udemy.com/yosemite-advanced-tips-and-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Operating Systems"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T09:09:46Z"
}