{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Interested in analyzing big data sets? You should be - according to CareerCast, \"data scientist\" is the 8th most highly paid profession in the United States! If you have some coding or scripting background, you can make your experience even more valuable by understanding how to use <strong>Hadoop, MapReduce, Hive, Pig, and Spark</strong> to crunch huge data sets in parallel.</p><p>These techniques are used by some of the largest and most prestigious tech employers, including Google, Facebook, Twitter, Amazon, EBay, Yahoo, and many more. After this course, you'll speak their language!</p><p>What We'll Cover:</p><ul><li>What is <strong>MapReduce </strong>and <strong>Hadoop</strong>?</li><li>What are some real-world applications of these technologies?</li><li>A walk-through of <strong>designing, coding, and running a real example</strong> of MapReduce using <strong>real data</strong>.</li><li>How Hadoop <strong>distributes computing</strong> across a cluster of machines</li><li>An overview of <strong>Hive, Pig, and Spark </strong>along with a couple of small examples.</li></ul><p>This <strong>free</strong> video-based course offers over <strong>50 minutes of video</strong> over <strong>10 lectures</strong>! I'll talk with you about these topics, and we'll look at some slides and some code to make them real.</p><p>I hope this course whets your appetite to learn even more about Hadoop and MapReduce! They are valuable and interesting skills to have.</p>", 
    "end_date": null, 
    "title": "Big Data Basics: Hadoop, MapReduce, Hive, Pig, & Spark", 
    "price": 0, 
    "instructors": "Frank Kane", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594194_78c3_2.jpg", 
    "course_url": "https://www.udemy.com/big-data-basics-hadoop-mapreduce-hive-pig-spark/", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T17:14:53Z"
}