{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t         Are you interested in the world of Big data technologies, but find it a little cryptic and see the whole thing as a big puzzle.  </p>  <p style=\"\">  \t         Are you looking to understand how Big Data impact large and small<span class=\"Apple-converted-space\" style=\"\"><strong style=\"\"> </strong></span>business and people like you and me?  </p>  <p style=\"\">  \t         Do you feel many people talk about Big Data and Hadoop, and even do not know the basics like history of Hadoop, major players and vendors of Hadoop. Then this is the course just for you!  </p>  <p style=\"\">  \t         This course builds a essential fundamental understanding of Big Data problems and Hadoop as a solution. This course takes you through:  </p>  <ol style=\"\">  \t<li style=\"\">Understanding of Big Data problems with easy to understand examples.</li>  \t<li style=\"\">History and advent of Hadoop right from when Hadoop wasn’t even named Hadoop.</li>  \t<li style=\"\">What is Hadoop Magic which makes it so unique and powerful.</li>  \t<li style=\"\">Understanding the difference between Data science and data engineering, which is one of the big confusions in selecting a carrier or understanding a job role.</li>  \t<li style=\"\">And most importantly, demystifying Hadoop vendors like Cloudera, MapR and Hortonworks by understanding about them.</li>  </ol>  <p style=\"\">  \t         Unlock the world of Big Data!!!  </p>  <p style=\"\">  \t         Best part is that this course is Free of cost!!! (Best things is life are free :))  </p>", 
    "end_date": null, 
    "title": "Big Data and Hadoop Essentials", 
    "price": 0, 
    "instructors": "Nitesh Jain", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/225796_adf7_2.jpg", 
    "course_url": "https://www.udemy.com/big-data-and-hadoop-essentials-free-tutorial/", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T03:54:33Z"
}