{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t    If you have ever wanted to build a data driven website and don&#039;t know PHP, this course if for you. We will use the tools that come with Dreamweaver and your hosting account to build a database, connect to the database, insert, update and delete data as well as call information out of the data base; all without writing any PHP.  </p>  <p style=\"\">  \t    There are third party Dreamweaver Extensions that you can use to get even more creative with database connectivity, however, what you will learn in this course is what Dreamweaver can do right out of the box.  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Lecture 1: Creating a Database</strong> Learn how to use tools like phpMyAdmin to create and administer a database.</li>  \t<li style=\"\"><strong style=\"\">Lecture 2: Connecting to the Database with Dreamweaver</strong> Learn how to use simple server behaviors and connection tools that come with Dreamweaver.</li>  \t<li style=\"\"><strong style=\"\">Lecture 3: Inserting Data</strong> Create a form using the dropdown menus that come with Dreamweaver and then use server behaviors to Insert data into the database you created!</li>  \t<li style=\"\"><strong style=\"\">Lecture 4: Creating a Login Page</strong> Using a simple form, you can log visitors into your website with a username and password.</li>  \t<li style=\"\"><strong style=\"\">Lecture 5: Restrict Access to page</strong> Only let visitors that have registered and logged in access content.</li>  \t<li style=\"\"><strong style=\"\">Lecture 6: Pulling data out of the database</strong> You have the data in there...now learn how to act on it and show it to the user.</li>  \t<li style=\"\"><strong style=\"\">Lecture 7: Updating the database</strong> Learn how to make changes to data you have already inserted into the database.</li>  \t<li style=\"\"><strong style=\"\">Lecture 8: Deleting Data</strong> You got it in there...learn how to remove records from the database.</li>  </ul>  <p style=\"\">  \tWhen you are done with Easy Databases with Dreamweaver, you should be able to build a basic data driven website that users can register for and log into and access restricted content intended only for members of your site.  </p>", 
    "end_date": null, 
    "title": "Build a data driven website with no PHP!", 
    "price": "50.00", 
    "instructors": "Robin Aletras", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/277786_52e4_20.jpg", 
    "course_url": "https://www.udemy.com/easy-databases/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-09T16:00:39Z"
}