{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tThis video course provides you with the necessary know-how to effectively administrate and perform operations in Cassandra. You will also get to know, from an architecture perspective, how Cassandra differs from traditional databases and other popular NoSQL databases.  </p>  <p>  \tThe course starts off by showing you the steps to build your own cluster, and introduces you to the different use cases for Cassandra. Along the way, you will encounter caveats based on scenarios that may not be a good fit. After learning how to install Cassandra, you will learn how to use different monitoring tools and methods to import and export large amount of data. Next, primary and secondary indexes are explained to help you select the appropriate indexing that enables fast and efficient data lookup to respond to search and retrieval requests. Finally, you will use various tools to facilitate performance tuning, and conduct a stress test on a cluster, and interpret the performance results.  </p>  <p>  \tBy the end of this course, you will have developed the required skills to install and set up any Cassandra cluster, along with administrating and managing daily operations easily.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t <strong style=\"\">C Y Kan</strong> is an expert in information technology system integration and enterprise application development. He has over 20 years of IT experience, including 12 years of project management and application architecture design in many large-scale distributed systems. He is a specialist in various technologies such as Java, JEE, Spring, Mule, Hadoop, Cassandra, and Oracle.  </p>  <p>  \t He received a Bachelor’s degree in electrical and electronic engineering from the University of Hong Kong and a Master’s degree in engineering management from the University of Technology, Sydney. He also holds many professional qualifications such as PMP, PRINCE2 Practitioner, PMI Agile Certified Practitioner, Scrum Master, CISSP, TOGAF9, SOA Certified Architect, ITIL, and Certified Six Sigma Black Belt.  </p>", 
    "end_date": null, 
    "title": "Cassandra Administration", 
    "price": "40.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368018_6418_2.jpg", 
    "course_url": "https://www.udemy.com/cassandra-administration/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T11:38:41Z"
}