{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t This course is over 6 hours in length and will cover all aspects of IPv4. Students will learn IP addressing, Subnetting, VLSM, Route Summarization, and Wildcard Masking. The course will also show students how to assign IP addresses to PC’s and Routers. Students will gain an understanding of the TCP/IP properties such as gateways, DNS, WINS, and the use of alternate addresses.  </p><p><strong>DISCLAIMER:   </strong><strong>Please note that the simulators/emulators used in this course are not part of the course. It is the students responsibility to have these to practice with. The Cisco Packet Tracer and/or VIRAL (Virtual Internet Routing Lab) are Cisco proprietary software and can only be obtained through Cisco. It is up to each student to obtain the simulator/emulator of their choice to study along with this course.</strong><br></p>\n\n<p>  \t This is a lecture based course using a whiteboard and hands on labs using Cisco’s Packet Tracer. My method will make you feel like you are sitting in a classroom environment and give you some hands on experience.  </p>\n\n<p>  \t Handouts and labs will be available to facilitate learning and practice.  </p>\n\n<p>  \t My IP course will help you in becoming comfortable with, not only IPv4, but it will also help you in preparing for any networking certification and Computer Science Degrees; not to mention the fact, that for those that are already working in the field, it will help you in calculating IP addresses without a calculator. This method should expedite the way you convert in order to make you faster, better and stronger!  </p>\n\n<p>  \t (Please always check the ANNOUNCEMENTS section for new updates and events, since I am always letting you guys know of my newest and latest endeavors!)  </p>", 
    "end_date": null, 
    "title": "Cisco CCNA IPv4 Tutorial: Everything You Need!", 
    "price": "25.00", 
    "instructors": "Lazaro Diaz", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42317_8152_11.jpg", 
    "course_url": "https://www.udemy.com/everything-you-need-to-know-about-ipv4-and-its-configuration/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-19T02:57:53Z"
}