{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "Want to learn how to QUICKLY extract data from websites and other sources into useable, useful formats?    <ul>  \t<li><em><strong>Save time and resources</strong> by learning these helpful data extraction tools and techniques!</em></li></ul><p>  \t        In this course, we'll review a variety of data extraction methods in a series of short tutorials aimed at beginner and intermediate-level computer users.  </p>  <p>  \t          By the end of this course, you'll be able to use these tools and techniques with confidence, so you can <strong>get the data you need more quickly and with less effort</strong>!  </p><p><strong>HOW IS THIS COURSE DIFFERENT?</strong>    </p><p>  \t                              My name is Kathleen, and I've been teaching technology to beginners under the moniker <strong><em>Robobunnyattack!</em></strong> since 2009. I believe that with the right approach, anyone can learn anything.  </p>  <ul>  \t<li><strong>My goal in this course is to help you learn how to easily collect and extract data from websites and other sources into useable, useful formats.</strong></li>  </ul>  <p>  \t                              In this course, we'll walk through a series of helpful and practical data extraction tools and techniques. As we work together, I'll explain WHICH tools to use WHEN, so you can <strong>learn more quickly and with more confidence</strong>.  </p>  <p>  \t                              As we review several real-world examples, we'll cover:  </p>  <ul>  \t<li>How to create full-page screenshots and print-friendly PDFs from ANY website</li>  \t<li>Using free OCR (Optical Character Recognition) tools to extract text out of scanned documents and other images</li>  \t<li>How to QUICKLY extract useful information out of webpages and into your spreadsheet</li>  \t<li>Strategies for converting hard-to-extract web data into organized tables</li>  \t<li>How to automate online data retrieval tasks and other processes WITHOUT writing a single line of code!</li>  </ul>  <p>  \t<strong>    By the end of this course, you'll be able to use a variety of data extraction tools with confidence, so you can save time and be more productive!</strong>  </p>  <p>  \t                              Here's just a sample of what my (awesome!) students have to say about this course:  </p>  <p>  \t<em>\"WOW — A definite favorite. Really helpful tools and tips to get information off your computer that is usable and more easily accessed. I'm incredibly grateful.\" —Kathleen B.</em>  </p>  <p>  \t<em>\"This course opened lots of opportunity. I usually use desktop software or [web browser] plugins to do data extraction and this course added lots of knowledge. Recommended.\" —Arif N.</em>  </p>  <p>  \t<em>\"Kathleen is brilliant teacher. She made this course so simple to follow. I loved the IFTTT method.\" —Sukh B.</em>  </p>  <p>  \t<em>\"This is a really cool course. Everything is easy to understand and to follow.\" —Bronwyn W.</em></p><p><em></em><strong>WHAT'S INCLUDED?</strong>    </p><ul>  \t<li>This course includes lifetime access to over 1½ hours of step-by-step videos.</li>  \t<li>You'll also get supplementary text lectures and links to helpful resources.</li></ul><p><strong>HOW LONG WILL IT TAKE ME?</strong>    </p><ul>  \t<li>This completely depends on your availability and learning preference. You can work through all the video lectures in one afternoon, or pace yourself over several days or weeks — it's up to you!</li></ul><p><strong>WHAT IF THIS COURSE ISN'T FOR ME?</strong>    </p><ul>  \t<li>This course comes with an <strong>unconditional 30-day Udemy-backed guarantee</strong>. Try out this course for 30 days and see for yourself if these data extraction tools are right for you. If you're not 100% satisfied with this course, simply request a full refund within 30 days — no conditions, no questions asked!</li>  </ul>  <p>  \t                              I'm confident you'll LOVE this course, and I'm excited to help you learn. <strong>Enrol now and you can start using these data extraction tricks to save time and effort today!  </strong>  </p>  <p>  \t<em>—Kathleen Farley (aka Robobunnyattack!)</em></p>", 
    "end_date": null, 
    "title": "Collect, Extract and Use Online Data Quickly and More Easily", 
    "price": "20.00", 
    "instructors": "Kathleen Farley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/106140_baa1_5.jpg", 
    "course_url": "https://www.udemy.com/data-extraction-tips-and-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-15T13:44:59Z"
}