{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Ciao, io sono <strong>Alberto Olla</strong> per Mongodb Italia<strong></strong>, benvenuto o benvenuta nel primo corso online in italiano completamente gratuito per imparare mongodb! </p><p>Ah la prima cosa che bisogna sapere è che il suo nome tecnicamente è mongodb ma per gli amici basta mongo.</p><p>Ha delle similitudini con i database relazionali quindi è l’ideale se vi state avvicinando al mondo nosql per la prima volta e non fatevi ingannare dal fatto che sia un databsae giovane perchè è molto performante, facilmente scalabile, ma sopratutto facile da usare ed è molto apprezzato anche dai più esperti, non per nulla è utilizzato da grandi aziende come Ebay, Expedia e anche il new york times!</p><p>Penso però, che la vera bellezza di mongo non stia nel fatto che è performante e quant’altro ma invece nel fatto che aiuti a vedere le cose in maniera diversa, a pensare in modo più creativo</p><p>Premetto che non mi reputo un esperto o un guru e non sono stato pagato da nessuno per fare questi video, sono semplicemente un appassionato, ho completato con successo 3 corsi nell’university online di mongodb e volevo condividere con voi le cose che ho imparato.</p><p>Non aspettatevi un corso formale tra insegnante e studente, è più una sorta di chiacchierata tra amici quindi non mancheranno considerazioni personali e un pizzico di ironia. </p><p>Uno dei motivi che mi ha spinto a realizzare questo corso è la possibilità di far conoscere e apprezzare mongo a più persone possibili sopratutto a chi ha difficoltà nell’inglese dal momento che la totalità dei corsi presenti sull’internet è in inglese e in italiano non esiste praticamente nulla, neanche un vero libro.</p><p>Qui sotto troverai un bel pò di video che rappresentano tutto il percorso da fare per conoscere mongo. Ti consiglio di seguirli in ordine anche se alcuni potrebbero sembrare più interessanti di altri. Precisiamo che i video non sono di ottima qualità ma ho fatto del mio meglio per renderli il più professionale possibile.</p><p>Spero che questo vi aiuti ad apprezzare veramente mongo, e che vi faccia venire la voglia, la curiosità, di saperne di più e di seguire quindi i veri corsi direttamente sull’university online di mongodb.</p>Ci vediamo online ;)", 
    "end_date": null, 
    "title": "Corso MongoDB: basi del database no-sql più usato al mondo", 
    "price": 0, 
    "instructors": "Alberto Olla", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678084_52ff_2.jpg", 
    "course_url": "https://www.udemy.com/corso-mongodb-basi-del-database-no-sql-piu-usato-al-mondo/", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T10:28:26Z"
}