{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This MS Access 2013 course was designed to be easily understood by absolute beginners and at the same time offer value to somewhat proficient users of Microsoft Access.</p><p>The course focuses on equipping you with the hands-on skills required to develop database applications with MS Access in as little time as possible. </p><p>By the end of the course, you'll have the confidence required to get you started with developing your own database applications.</p><p><strong>What's in it for you?</strong></p><p>In this course, you will learn how to:</p><ul><li><strong>Develop database applications</strong> by <strong>solving a real world problem</strong>.</li><li><strong>Create MS Access objects: </strong>tables, forms, queries, macros and reports</li><li><strong>Develop SQL Queries</strong> to retrieve and manipulate data from your tables</li><li>Easily <strong>import data from Microsoft Excel to MS Access</strong></li><li>Quickly<strong> format forms, and restrict data that is entered into your tables.</strong></li><li><strong>Create a switchboard </strong>for easy navigation around your database<span></span></li></ul><p><br></p><p><strong>Course Structure</strong></p><p>This course was structured to first teach you the fundamentals of database design and then guide you on a step-by-step basis on how to design and create your own database applications <br></p><p><strong>You do not need any prior technical or programming experience</strong> to fully participate in this course, you just need the patience and willingness to learn.</p><p>You'll have access to the<strong> detailed step-by-step Lab Exercises </strong>that will guide you through developing the various application components.</p><p>There are <strong>quizzes</strong> at the end of each new concept learnt to validate the knowledge and skills you would have gained.</p><p><strong><br></strong></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Create Database Applications Using MS Access 2013", 
    "price": "45.00", 
    "instructors": "Kelvin Mbatu", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417034_7883_7.jpg", 
    "course_url": "https://www.udemy.com/create-db-apps-using-ms-access-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T06:44:26Z"
}