{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course teaches you Hadoop, Pig, Hive and Apache Mahout from scratch with an example based and hands on approach.</p><p>Master the Fundamental Concepts of Data Analysis using Hive &amp; Pig.</p><ul style=\"\"><li>Understand the Big Data &amp; Apache Hadoop landscape</li><li>Understand Analytics with Hadoop using Pig and Hive</li><li>Get hands on on Hive and Pig with step by step examples of data querying and mining</li></ul><p>Big Data &amp; Data Analysis</p><p>No Prior knowledge of Hadoop, Hive or Pig is expected. A little bit if procedural programming and querying experience will go a long way in deriving real value out of this amazing course. Learn the easy to use Hive and Pig technologies and land up with prestigious and well-paying Big Data Analyst jobs.</p><p>Contents &amp; Overview</p><p>Through 19 lectures and 3 hours of content, we will take a step-by step approach to understanding &amp; learning Data Analysis using Hive &amp; Pig.</p><p>The first few topics will focus on the rise of Big Data and how Apache Hadoop fits in. We will focus on the fundamentals of Hadoop and its core components: HDFS and Map Reduce. </p><p>Once we have a solid foundation of Hadoop and the ecosystem, we will dive into the crux of this course - higher level components of the Hadoop ecosystem: Hive and Pig. We will go into the details of both Hive and Pig by installing them and working with examples. Hive and Pig can make your life easy by shielding you from the complexity of writing MR jobs and yet leveraging the parallel processing ability of the Hadoop framework.</p><p>After taking this course, which includes slides, examples, code and data sets, you will be at ease with  analyzing data with Hive and Pig. So go ahead and enroll to crack that Big Data Analyst interview.</p>", 
    "end_date": null, 
    "title": "Data Analysis Made Easy - Learn Hive & Pig", 
    "price": "20.00", 
    "instructors": "Abhishek Roy", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506686_9cf2_2.jpg", 
    "course_url": "https://www.udemy.com/data-analysis-made-easy-learn-hive-pig/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T23:51:39Z"
}