{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>During this course, you will learn what is a DataGuard, what are the different settings and usage examples.</span>  </p>  <p>  \tWe will settup together active DataGuard using 2 separate virtual machines. This set allows us to simulate  </p>  <p>  \ta real case as much as possible because we will have 2 physical separate servers. We&#039;ll use advanced installation  </p>  <p>  \ttechniques with rman duplicate for standby and the Oracle broker to manage the dataguard.  </p>  <p>  \tCome to this course you&#039;ll love it, not to be missed.  </p>  <p>  \tDuring the course you will see the folowing key words:  </p>  <p>  \tDataguard (DG)  </p>  <p>  \tRman duplicate  </p>  <p>  \tListener  </p>  <p>  \tOracle net  </p>  <p>  \tBroker  </p>  <p>  \tPassword file  </p>  <p>  \tswitchover  </p>  <p>  \tThe course consists on videos, you will find the road map for the creation of DataGuard, in a txt file with all  </p>  <p>  \tthe querys and useful commands.  </p>  <p>  \tThe course is about four hours and a half and it&#039;s splited in 4 blocks. Each block with different chapters.  </p>  <p>  \tThe 1st block is the description of the Primary set, and then the settup it self. We will use 2 virtual machines  </p>  <p>  \tto obtain a more realistic simulation, since each virtual machine will represent a diferent site.  </p>  <p>  \tWe&#039;ll simulate a base in Madrid and another in Barcelona.  </p>  <p>  \tThen we&#039;ll create the standby database setting up Rman duplicate.  </p>  <p>  \tThen we&#039;ll speack about how the broker is configured and used. The broker is a tool that allows an easy and  </p>  <p>  \tintuitive management of DataGuard.  </p>  <p>  \tThe last block is monitoring and managing backups and more specifically the archivers.  </p>  <p>  \tThis course is a luxury ally for all DBA who want to set up a high availability system.  </p>  <p>  \tThanks to this course you&#039;ll forget the doubts.  </p>", 
    "end_date": null, 
    "title": "Easy way to set Oracle Active Dataguard", 
    "price": "20.00", 
    "instructors": "Luis Diaz", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/345262_0cae_3.jpg", 
    "course_url": "https://www.udemy.com/easy-way-to-set-oracle-active-dataguard/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-15T14:57:36Z"
}