{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tIn this video tutorial, we will follow a fictive company called “The Company”, as it implements a complete Identity Management solution, helping you to understand the implementation of an IdM solution based on FIM 2010 R2. We will go the whole nine yards, from installing FIM 2010 R2 to implementing synchronization, workflows, and self-service features.<br style=\"\">  \t<br style=\"\">  \t         Using FIM 2010 R2, The Company will help guide your efforts to modernize your Identity Management solution by showing you how to implement both automation and self-service functionality.<br style=\"\">  \t<br style=\"\">  \t         Using the HR system as a master system for users, The Company will be able to automate account management in their Active Directory. Adding self-service will help people help themselves by enabling them to be productive again, for example, if users forget their password or want to join groups without the need to call the helpdesk.<br style=\"\">  \t<br style=\"\">  \t         This video course will open your mind to the possibilities of FIM 2010 R2.  </p>  <p><h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  \t<strong style=\"\">Kent Nordström</strong> wrote his first lines of code in the late 70s so he’s  been working with IT for quite some time now. When Microsoft released  its Windows 2000 operating system he started a close relationship with  them that has continued since. For many years Kent has been working part  time as a sub-contractor to Microsoft Consulting Services and has been  doing many of the implementations of FIM and its predecessors for  multinational companies and large organizations in Sweden. Apart from  FIM, Kent is also well known within the community for his knowledge  around Forefront TMG, Forefront UAG and PKI.  </p>", 
    "end_date": null, 
    "title": "Enterprise Identity Management with Microsoft Forefront ", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370588_128c_2.jpg", 
    "course_url": "https://www.udemy.com/enterprise-identity-management-with-microsoft-forefront/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T09:48:09Z"
}