{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Develop professional database information solutions!</strong>  </p>  <p style=\"\">  \t      Ask yourself this question? &quot;Have I ever used a database&quot;? You may be surprised to realize that the internet is a database! Just about every part of your day to day activity is dependent upon databases. Your smartphones contain many databases.  </p>  <p style=\"\">  \t      You don&#039;t need to be a Information Technology Professional to get into database development. This course has 12 hours of video and hands on labs where you learn to be a professional database designer. It has 65 lessons covering FileMaker Pro usage.  </p>  <p style=\"\">  \t      In 2008, I designed database solutions for the iTunes Store. This resulted in a four-year gross sales of $150,000, and sales of over 5000+ databases sold worldwide. I also developed custom applications using FileMaker Pro for over 1200 custom databases for clients.  </p>  <p style=\"\">  \t      This course is unique in that it provides top to bottom knowledge to become a FileMaker Pro developer. There are no other courses that provide as thorough step-by-step and hands-on labs to instruct you in all aspects of the design of FileMaker database solutions.  </p>  <p style=\"\">  \t      Sections in this Course:  </p>  <p style=\"\">  \t      1: Master the basics of working with your clients to develop a database project.  </p>  <p style=\"\">  \t      2: Learn the FileMaker RIDE (Rapid Interface Design Engine) interface step by step.  </p>  <p style=\"\">  \t      3: Learn the &quot;Data Inspector&quot; to manage the appearance, style, and position of layout objects.  </p>  <p style=\"\">  \t      4: Add Tables, Fields, and prepare linking of tables in relationships.  </p>  <p style=\"\">  \t      5: Learn the basic to understanding how to work with the tables to connect the relational links.  </p>  <p style=\"\">  \t      6: Use labs to make the individual layouts used for the user interface.  </p>  <p style=\"\">  \t      7: Advanced user interface design is the last labs where you will cover the more advanced elements used in the My Codebook Pro interface design  </p>", 
    "end_date": null, 
    "title": "FileMaker Pro 13 for beginners", 
    "price": "25.00", 
    "instructors": "Vaughn Clement", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351998_eed3_6.jpg", 
    "course_url": "https://www.udemy.com/filemaker-pro-13-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T15:39:45Z"
}