{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">El curso, que es el segundo de una serie de cursos sobre MongoDB, nos permite profundizar en las tareas de gestión de datos. Vamos a ver:</span>  </p>  <ul style=\"\">  \t<li style=\"\">qué tipos índices soporta MongoDB</li>  \t<li style=\"\">cómo se usan los índices</li>  \t<li style=\"\">cómo se evalúa el uso de los índices</li>  \t<li style=\"\">qué criterios seguir a la hora de definir la estructura de datos de nuestra aplicación</li>  \t<li style=\"\">qué otras posibilidades de almacenamiento nos ofrece MongoDB (colecciones limitadas, GridFS,...)</li>  \t<li style=\"\">cómo realizamos operaciones de agregación en MongoDB</li>  \t<li style=\"\">cómo utilizamos MapReduce en MongoDB</li>  </ul>  <p style=\"\">  \tMongoDB cuenta con varios tipos de índices para mejorar el rendimiento de las operaciones de lectura. Los índices geoespaciales nos permiten trabajar con datos de geolocalización, por ejemplo filtrando la información por la distancia a la que se encuentra de un punto sobre la superficie de la Tierra. Los índices de texto, definitivamente incluidos en MongoDB a partir de la versión 2.6, nos permiten realizar búsquedas sobre textos.  </p>  <p style=\"\">  \tTambién veremos cómo diseñar la estructura de datos en la que almacenaremos la información de nuestra aplicación. Aunque MongoDB no es una base de datos relacional, y no impone una estructura rígida a los datos de nuestra aplicación, es conveniente tener en cuenta las implicaciones de rendimiento que las decisiones sobre esta estructura pudieran ocasionar.  </p>  <p style=\"\">  \tMongoDB cuenta con varias alternativas para llevar a cabo operaciones de agregación de los datos (medias, máximas, sumas,...). En este curso nos ocuparemos principalmente del sistema de agregación de MongoDB, y de la implementación MapReduce realizada por MongoDB.  </p>  <p style=\"\">  \tEl curso consta de una serie de lecciones en formato vídeo, que constan tanto de contenidos teóricos cómo prácticos. La longitud de los vídeos suele ser inferior a los diez minutos, aunque en ocasiones alguno de ellos se acerca a los quince minutos.  </p>  <p style=\"\">  \tVeremos cómo replicar en vuestros equipos los ejemplos incluidos en los vídeos, para que hagáis con vuestras propias manos las operaciones que os muestro. <span style=\"\">Cada cierto número de lecciones se incluye un grupo de preguntas para comprobar el grado de compresión de los temas tratados. En ocasiones, se incluye algún ejercicio práctico entre las preguntas, que requiere la descarga de algún archivo y el manejo de un servidor MongoDB. También se incluyen diversos ejemplos de código NodeJS, para ver cómo se trabaja con MongoDB desde una aplicación.</span>  </p>  <p style=\"\">  \tEl curso puede ser completado en unas seis semanas, dedicando unas 8 - 12 horas a la semana. En todo caso, elige el ritmo que más se adapte a tu disponibilidad.  </p>", 
    "end_date": null, 
    "title": "Gestión avanzada de datos con MongoDB", 
    "price": "30.00", 
    "instructors": "José Antonio Sánchez Ortiz", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231138_78dc_3.jpg", 
    "course_url": "https://www.udemy.com/gestion-avanzada-de-datos-con-mongodb/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T19:15:29Z"
}