{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>*This is a course designed to help you with the legacy application</strong></p>\n\n<p><strong>For help documents relating to the new tool then please check out the help pages on our homepage*</strong></p>\n\n\n\n<p>This course is all about web scraping and extracting data from the web without using any code whatsoever. Data is stuck within webpages making it unusable. You can't analyse it and visualise it when it's stuck in a website. By taking this course, I'll show you how to scrape the web to extract this data and use it to make decisions, do analysis and make cool visualisations.</p>\n\n\n\n<p>I'm going to show you how to become a data extraction master within an hour without having to have any prior knowledge of coding at all.</p>\n\n\n\n\n\n<ul><li>Learn how to extract data from thousands of pages</li><li>Learn how to extract data from pages that require clicks to see the data</li><li>Build a Google sheet with live data inside it</li><li>Discover cool visualisation tools</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This series will tell you all you need to know about doing data extraction</strong></p>\n\n\n\n\n\n<p>Having taught web scraping and data extraction around the world, I have now decided to upload the ultimate online course. I have been extracting data from the web for years and have never come across an easier tool to use than import. Join in the footsteps of the biggest companies in the world and learn techniques in data extraction and manipulation.</p>\n\n\n\n\n\n<p>Whether your technical or just starting out, this is the course for you. Within an hour, you will be able to extract, analyse and manipulate data from the web.</p>", 
    "end_date": null, 
    "title": "How to extract data from the web using import io", 
    "price": 0, 
    "instructors": "Alex Gimson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477338_4f8b_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-extract-data-from-the-web/", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T17:47:00Z"
}