{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tIBM Cognos Report Studio is a powerful web-based business report writing tool. It gives you a simple drag-n-drop interface to quickly create data-based reports without worrying about how it connects to the database and pulls data. This course exposes you to the unlimited possibilities of extending your simple business reports to advanced levels using HTML &amp; JavaScript and Macros.<br style=\"\">  \t <br style=\"\">  \t <em style=\"\">IBM Cognos 10 Report Studio Fundamentals </em>covers the basic and advanced features of report authoring. It helps you understand and use all the features provided by Report Studio to generate impressive deliverables to take you from being a beginner to a professional report author. Develop excellent reports using dimensional data sources by following best practices in this course.<br style=\"\">  \t <br style=\"\">  \t Starting with an overview of high-level architecture and installation of Cognos 10 Report Studio , you will progress from building simple to advanced List and Crosstab reports and much more. Each topic is shown with working examples, in a clear and concise way to enable you to quickly grasp and practice these.<br style=\"\">  \t You will see how to add data formatting, conditional layouts, and filters to your reports to use them effectively. You define how to format numbers, present data into charts or matrix, and link the reports together. You will learn how to stay in control by examining underlying queries and pick up best practices like using layout component references, templates and code comments.<br style=\"\">  \t In short, <em style=\"\">Cognos 10 Report Studio Fundamentals</em> will help you get the best out of Cognos 10 Report Studio. The main focus is on the practical use of various powerful features that Report Studio has to offer to suit your business requirements and enable you to start building professional reports on your own.  </p>", 
    "end_date": null, 
    "title": "IBM Cognos 10 Report Studio Fundamentals", 
    "price": "35.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400028_e710_2.jpg", 
    "course_url": "https://www.udemy.com/ibm-cognos-10-report-studio-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T12:00:28Z"
}