{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Oracle Databases are among the most widely used in the world. You will find oracle databases in large to medium size organizations to store various types of information. This course will teach you how to install an oracle database step by step from scratch with no steps skipped. You will also be getting access to a sample schema object and database tables. But before you can access the tables in the schema it has to be unlocked. I will show you the special code used to unlock that in this course.</p>  <p>Once the database is installed you will need a tool to connect to it and perform data manipulation. The tool you will need to install is Oracle SQL developer developed by oracle. This is a free tool that can sometimes be tricky to install. I will show you how to install it step by step.</p>  <p>You will be using SQL (Structured Query Language) to talk to and give instructions to the database to perform various types of data manipulation.</p>  <p>This course is for those who have some very basic knowledge of database fundamentals as well as basic SQL knowledge. However the course is also easy enough for anyone who just has a basic knowledge of how to use a computer.</p>  <p>This format of this course is video based and the duration of the course is under 2hours long</p>  <p>The examples are practical hands on easy to follow and resembles a real life environment.</p>  <p>.<strong>What You Learn in this course:</strong></p>  <ul><li>How to add new data into a database</li><li>How to remove data from a database</li><li>How to update existing data in a database</li><li>How to get data from a database and create a report from it</li><li>How to Get Unique Data Values from a database</li></ul>        ", 
    "end_date": null, 
    "title": "Installing and Manipulating Oracle Database Using SQL", 
    "price": "20.00", 
    "instructors": "Skill Tree", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693944_0368_2.jpg", 
    "course_url": "https://www.udemy.com/installing-and-manipulating-oracle-database-using-sql/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T13:03:36Z"
}