{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Master SQL in less than 3 Hours :</p><ul><li><strong>Do You Want to Become a professional Software / Web Application Developer and increase your income Exponentially ?<br></strong></li><li><strong>Are you a Marketing Professional Who wants to use SQL for making Better Marketing Decisions ?<br></strong></li><li><strong>Are you a University Student Working Towards a Computer Science or Information Technology Degree ?</strong></li></ul><p>Then look no further as you have come to the right place. I have been working with SQL for more than 7 Years now and am currently working as an Application developer.  This in-depth course on SQL taught by me covers everything from the very basic definitions to very complex concepts of RELATIONAL DATABASES , FOREIGN KEYS  and JOINS so that by the time this course ends, You will have an excellent understanding of all the important concepts of SQL to get things rolling for you. </p><p>SQL can be used in almost all fields in today's technology driven world whether you are into your own business or into marketing or into development of  Web / Mobile applications. You can use SQL to Analyze tons and tons of data within milliseconds and use the results of analysis to make better fact and data based decision thereby increasing the chances of arriving at a correct decision. </p><p>I can assure you that you will enjoy this course and hope that you would make the most of the knowledge you would have gained by the end of this course. Thanks and hope to see you in Lectures.</p>", 
    "end_date": null, 
    "title": "Learn SQL and MySQL in 3 Hours", 
    "price": "20.00", 
    "instructors": "Umang Shah", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610968_74e1_2.jpg", 
    "course_url": "https://www.udemy.com/learn-sql-mysql-in-less-than-3-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T19:10:31Z"
}