{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the advanced SQL skills   necessary to design and code complex queries against Oracle databases.   Design, code and test the most efficient query to solve a given business   problem.</p>        <p>In this course you will have a choice of either using Toad or SQL developer to connect to the oracle database. The course will show you how to setup connection to the database. <br> <span>This advanced Oracle SQL course covers the  design of more complex SQL statements and the strategies available for implementing them, it covers topics like SET operators and Analytic functions. It also introduces you to views because these are useful for hiding the complexity of queries and also can act as a security mechanism</span></p><p><strong>Who is This Course For?</strong><br></p><p><span>This course is designed for anyone who has some basic SQL knowledge and can write and understand simple SQL Queries. Also knowing the basics of relational database management systems (RDBMS) would be an advantage.</span></p><p><strong>What You Will Learn:</strong><br></p>  <ul><li>How to Create Views</li><li>How to check the structure of a table</li><li>How to use Flashback to Rollback Data</li><li>How to use Analytic Functions</li><li>How to use SET operators to query data</li><li>How to set database environment</li><li>How to connect to the database</li><li>How to write advanced SQL queries</li></ul>                <p><br></p>", 
    "end_date": null, 
    "title": "Learn Advanced SQL For Oracle Databases", 
    "price": "20.00", 
    "instructors": "Bluelime Learning Solutions", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653954_81bd_2.jpg", 
    "course_url": "https://www.udemy.com/learn-advanced-sql-for-oracle-databases/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T22:50:31Z"
}