{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t    PostgreSQL is arguably the most advance and powerful opensource enterprise class relational database system. It is the object relational database system and provides the most standard compliant system for the Database designers. It provides the complete support for reliable transactions that is (ACID complaint) where ACID stands for Atomicity, Consistency, Isolation and Durability.  </p>  <p style=\"\">  \t    Its advance underlying technology makes it extremely powerful and programmable. Support for concurrency is one of its key feature. It is one of the most important technology you will learn and will greatly affect the way you work with Databases. It is the ultimate RDBM system which will allow you to create complex web apps which works flawlessly even for very large number of users.  </p>  <p style=\"\">  \t    PostgreSQL is the fastest growing RDBMS and with a large and thriving community it is a great asset to learn this amazing technology.  </p>  <p style=\"\">  \t    Our course will teach you this complex system in the easiest of ways. It will start with basic intro to RDBMS system with a emphasis on PostgreSQL. We will also discuss the main differences between MySQL and PostGreSQL the two most popular open source RDBMS. By the end of this course you will be able to...  </p>  <p style=\"\">  \t    Use PostgreSQL in your projects  </p>  <p style=\"\">  \t    Understand the important features of Postgres  </p>  <p style=\"\">  \t    Understand the Object Relational model  </p>  <p style=\"\">  \t    Master SQL which can be used across DB systems  </p>  <p style=\"\">  \t    Build actual web apps using PostgreSQL  </p>  <p style=\"\">  \t    So hop on and be the master of one of the hottest RDBM system  </p>", 
    "end_date": null, 
    "title": "Learn Database Design using PostgreSQL", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270814_7036_6.jpg", 
    "course_url": "https://www.udemy.com/learn-database-design-using-postgresql/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-29T06:39:19Z"
}