{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Have you ever felt like you would get SQL for good, if you could just practice it more? While learning SQL, I've felt this way on many occasions. The only problem is, there aren't that many problems out there for practicing. It seems like the only place to get a large amount of query practice in is at a job, but how are you supposed to get that job if you don't know your SQL? </p><p>This course aims to solve that problem by exposing you to the volume of practice you need to become proficient. In it, we cover 10 different SQL challenges in depth, showing you the thinking that goes into finding the right answers, as well as common mistakes and how to avoid them. </p><p>There are two parts to this course - the videos, and the actual hands-on practice. The Udemy course only gets you access to the video overview of each query challenge - to actually try your hand at the query challenges, you need to sign up on our website (this is free, we show you how to do it in the first lecture). Once you finish a challenge (or if you get stuck), check back on the Udemy videos to see how we did it.<br></p><p>This is an basic level course for people who already have a general understanding of how SQL works. Now don't let that scare you away if you are a gung-ho beginner - just know that if that is you, you are going to have to learn quick and be willing to search terms if you don't recognize them. </p>", 
    "end_date": null, 
    "title": "Learn SQL Fundamentals Through 10 Practice Problems", 
    "price": "50.00", 
    "instructors": "Taylor Chiu", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544388_a306_2.jpg", 
    "course_url": "https://www.udemy.com/10-queries/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T21:15:06Z"
}