{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This database course teaches you everything you need to know about databases! You'll learn SQL and Database Design. </p>\n\n<p>You'll learn all the necessary skills that prepare you for a high salary database job. In this course, I share my database expertise with you and give you the key to database industry! This course prepares to start your database career like a pro. Whatever you learn in this database course is applicable to Oracle, MySQL, Access, DB2, or the like. I testify this is the most comprehensive database course for beginners in udemy.</p>\n\n<p><em>Don't miss the course! Start Now!</em><br></p>\n\n<p> <strong>What are your price models?</strong></p>\n\n<p>The course costs $50 USD.</p>\n\n<p>Please note section 4 is highly dependent on previous sections. Once you get familiar with previous sections, you can watch and practice section 4.</p>\n\n<p>**** You can download the powerpoint slides from lecture #4 ********<br></p>\n\n<p><strong><em></em></strong><strong>Important note:</strong> section 1 includes very generic information. Feel free to skip it.<em></em><strong><em></em></strong><br></p>\n\n<p><strong>Warning:</strong> <strong><em>this database course is quite intensive and you have to watch them in sequence. I broke the course into many short videos to make it easier for you to understand the topics</em></strong>; however, whatever you learn in this course will remain with you for the rest of your life! You'll gain a priceless MUST-HAVE valuable database skills. Spend good time learning this course IN and OUT because this course PAYS OFF really well if you grasp it well.</p>\n\n<p><strong></strong><br></p><p><em><em>Don't miss the course! Start Now!</em><br></em><strong></strong>   </p>", 
    "end_date": null, 
    "title": "Learn SQL Database from A to Z ", 
    "price": "50.00", 
    "instructors": "Fahmi Eshaq", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452010_8693_5.jpg", 
    "course_url": "https://www.udemy.com/sql-database-course/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T06:19:31Z"
}