{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em></em>If you are new to databases MariaDB might be a good place to start learning about them. MariaDB is a free and open source relational database management system. By open source it means people can contribute and make it even better.It was developed by some of the original developers that created another famous database management system known as MySQL which has since been acquired by the database giant oracle.</p>\n\n<p>MariaDB is used by some very famous internet juggernauts like Facebook, Google and Wikipedia just to mention a few.It has a lot of similarities with MySQL .</p>\n\n\n\n<p>  The current version of MariaDB is 10.1 and it can be installed on several platforms like windows ,Mac os and Linux.</p>\n\n\n\n<p>When MariaDB IS installed it also installs HeidiSQL which is a useful administrative tool that you can use to communicate with the MariaDB databases .</p>\n\n\n\n<p>Some of the tasks that can be performed using HeidiSQL includes the following:</p>\n\n\n\n<ul><li>Creating new databases</li><li>Creating Tables</li><li>Creating Views</li><li>Creating stored procedures</li><li>Creating user accounts and managing access</li><li>Generating queries</li><li>Generating reports</li><li>Providing an editor for queries to be written</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this very basic beginners course you will learn:</p>\n\n\n\n<ul><li>How to download and install MariaDB on a windows 7 operating system</li><li>How to create a session and connect to the MariaDB database using HeidiSQL</li><li>How to use HeidiSQL</li><li>How to create a Table</li><li>How to populate a Table</li><li>How to update a table </li><li>How to delete rows</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This is a video based course with easy to follow examples.</p>\n\n\n\n<p>I look forward to welcoming you on the course.</p>\n\n\n\n<p>Thank You</p>", 
    "end_date": null, 
    "title": "Learn MariaDB From Scratch", 
    "price": "20.00", 
    "instructors": "Bluelime Learning Solutions", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/713596_66ca_2.jpg", 
    "course_url": "https://www.udemy.com/learn-mariadb-from-scratch-with-easy-to-follow-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-02T19:32:58Z"
}