{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>A database is the backbone of any application, and for developers working with varied and sizable data sets, selecting an appropriate data store is a critical development consideration. Redis, an in-memory, key-value data store offers simplified, rapid data access, valuable in a range of situations where instant access is necessary, for example with data caching.</p><p>Learning Redis is an example-based introduction which demonstrates how to work with the data store by creating a playable word game, written in NodeJs. Fundamental topics of Redis are covered along the way.</p><p>You’ll see how simple it is to install the database on your own machine or use a database provider in the cloud. Together we will discover the basic native data types of Redis and how to use them as we write a real game using JavaScript in a NodeJs environment. We’ll store and retrieve data using the Redis CLI and understand the basic NoSQL data keys and storage techniques.</p><p>Whether you’re writing a game or any other application, you need a place to store data. Learning Redis will demonstrate why you should implement Redis.</p><p>Throughout the course, we will put to use the important concepts of Redis such as keys, values, sets, and hashes, which will help us build a solid application that works on some of the most important app requirements such as information storage, validation, pub/sub, notifications, and sorting.</p><p>By the end of the course, you will understand how to make use of all of Redis’ features so you can design applications with rapid, efficiently managed data access.</p><p><strong>About The Author</strong><strong></strong><br></p><p><strong>Scott Ganyo</strong> is a prolific software developer with 20 years of hands-on expertise in development, architecture, research, and leadership. His strikingly broad and successful technical background includes founding a large web service software company and two consulting companies, product and project leadership in enterprise and consulting environments, research and development for some of America’s most prestigious firms, 24x7 operations planning and management, and open source software development and leadership. A Renaissance Man, Scott is also an accomplished actor, writer, singer, improviser, and award-winning producer.<br></p><p>Scott is currently employed with Apigee Corporation and contributes to several open source projects including Apache Usergrid and Apigee 127 utilizing Java, NodeJs, Ruby, and Redis.</p>", 
    "end_date": null, 
    "title": "Learning Redis", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690986_4ed6_2.jpg", 
    "course_url": "https://www.udemy.com/learning-redis/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T12:02:38Z"
}