{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Updates:</strong></p>\n\n<ul><li><strong>Course last updated: May 2016</strong></li><li><strong>Over 60 happy students<br></strong></li><li><strong>Most complete course on SQL Language on Udemy and growing</strong></li><li><strong>Full, Free lifetime access</strong></li><li><strong>All future extra lectures and upgrades are always included for FREE</strong></li><li><strong> Unconditional Udemy 30 money-back guarantee</strong></li></ul>\n\n<p>  \t         Learn SQL language from scratch, the easy way, is designed to give a detailed introduction to using and understanding structured query language (SQL) for manipulating business data. This is the second part of a 2 parts course which covers the following topics:  </p>\n\n<p><strong>  \t         • More ways of getting data from multiple tables  </strong></p>\n\n<p><strong>  \t         • Common SQL Functions  </strong></p>\n\n<p><strong>  \t         • Transactions  </strong></p>\n\n<p><strong>  \t         • Data Definitions  </strong></p>\n\n<p><strong>  \t          • Relational Data  </strong></p>\n\n<p><strong>  \t          • Indexes  </strong></p>\n\n<p><strong>  \t         • Tools for working with SQL  </strong></p>\n\n<p><strong>  \t          • Pointers  </strong></p>\n\n<p><strong>  \t          • Data Normalization</strong>  </p>\n\n<p>  \t  For the most part, the SQL learned in the course is applicable to all major databases. In the few cases in which there are differences between the databases, these differences will be pointed out. There are 2 sample databases provided with this course. SQLMain is used throughout the demonstrations. The second one is a Microsoft developed sample database that you can have fun with after you finish the course.</p>\n\n<p> Besides the video tutorials and sample databases, this course includes a 186 pages PDF book about SQL that I have written. Some of the concepts covered in the book will be demonstrated in this course. I myself started learning on my own with no mentor and no place where to get the exact information that I needed. This is one of the reasons this course is structured in such a way that you can start writing SQL code in hours with ease.</p>\n\n<p><br></p>\n\n<p> I recommend taking one lecture once every 2 or 3 days. This way you will have time to get used with the terminology and also have time to practice what you learned on your own. </p>\n\n<p>This course is not going to make you a SQL guru overnight. It takes practice and patience to get there. </p>\n\n<p><strong>Let's get started and learn SQL language together. The easy way.</strong>  </p>\n\n<p><strong>Good to know:</strong></p>\n\n<ul><li><strong>In order to have a better learning experience please watch the videos in HD.</strong></li><li><strong>30 days money back guarantee. No questions asked.</strong></li></ul>", 
    "end_date": null, 
    "title": "Learn SQL from scratch and become a database developer-Part2", 
    "price": "20.00", 
    "instructors": "Cristian Astalos", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/233310_d31b_2.jpg", 
    "course_url": "https://www.udemy.com/learn-sql-language-from-scratch-the-easy-way-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-29T21:16:33Z"
}