{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>\"This course was <strong>simple enough</strong> so that everyone can learn about Windows Forms and using SQLite to connect to app. Lecturer <strong>responses</strong> to <strong>problems quickly</strong>, so you can ask for help and get help in 24 hours period. Expecting some advanced topics soon! \"<br></p><p><em>\"Great Job of explaining some <strong>extremely useful and powerful</strong>. So, I trully enjoyed this course. Content is presented in a <strong>clear and concise</strong>.Alireza is an excellent instructor. He is so <strong>responsible</strong> for the course and problems. I would highly recommend this to anyone learning <strong>C# and SQL easily</strong>.</em><em> \"</em><br></p><p><em>\"It is a excelent course for <strong>beginners</strong>. Easy to understand and well documented. The teacher's input interesting motivating.\"</em></p><p><em>\"This class was great. The instructor was very knowledgeable and presented the course in an <strong>easy to follow</strong> way. The quality of the video was great and I recommend this course to anyone who wants to learn about <strong>database connectivity</strong> within an application</em><em> \"</em><br></p><p>C# developers with database designing skill are some of the highest paid programmers throughout the world right now. There couldn't be a better time to join the world of database developers. <br></p><p><strong>About the course</strong></p><p>If you are going to learn programming and get a job, this is the right course. This course is designed totally for the beginners. It helps you to learn database programming by using SQLite as a database engine and C# as application development language. Even if you aren't interested in a career change this course will give you the necessary skills to build database application and store and retrieve your data from it.</p><p>At the end of this course, you build the fully functional application with C# and SQL. There couldn't be better to build an application in less than hour. It's so fast as you can imagine. By this course, you start to learn and do it at the same time. you can see the result in your code.</p><p><strong>What am I going to get from this course?</strong><br></p>  <p>You will learn how to design simple SQL database and then how you can manage data from your application that you will make in C#. This course is well enough to encourage you to continue database programming.</p>  <p>\t We will be using some simple code and easy steps to do these works. I provided the source code I'm using during the course. You can download it and test it to learn it.</p>  <p>\t You can complete this course in a day and after that you can continue this type of programming by attending in similar courses in the intermediate level.</p><p>I'm here to help you to go further to change and be a success! Don't hesitate to tell me about your problems, feedbacks and etc.</p>", 
    "end_date": null, 
    "title": "Learn C# & SQLite Programming from basic to advanced", 
    "price": "20.00", 
    "instructors": "Alireza Chegini", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176626_ef0e_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-application-with-c-sqlite-for-beginnerss/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T13:22:15Z"
}