{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tAtualmente, a informação tornou-se um dos ativos mais importantes nas organizações. Organizar a informação é de vital importância para as empresas manterem-se competitivas. Entre as tecnologias mais utilizadas para a armazenagem da informação de maneira organizada estão os bancos de dados relacionais. Então, tornou-se de vital importância, não só, ser capaz de desenvolver aplicações de banco de dados relacionais, mas também, entender o paradigma relacional, independente da área de formação.  </p>  <p style=\"\">  \t  Durante esse curso nós percorreremos de maneira didática as etapas para a criação de uma base de dados relacional simples, desde o levantamento dos requisitos até a criação das tabelas em um Sistema Gerenciador de Banco de Dados (SGBD) relacional. </p><p style=\"\">Ao término do curso, você será capaz de montar uma base de dados no SGBD MySQL, entendendo passo a passo, como os requisitos iniciais são transformados em tabelas nesse SGBD.  </p>  <p style=\"\">  \t  Apesar de não se tratar de um curso da linguagem SQL nem sobre o SGBD MySQL, serão apresentados os comandos básicos do SQL para a criação de tabelas utilizando as ferramentas do MySQL. </p><p style=\"\">Esse curso é apropriado para pessoas interessados em entender e montar bases de dados relacionais, independente da área de formação.  </p>", 
    "end_date": null, 
    "title": "Modelagem de Dados em Banco de Dados Relacional", 
    "price": "25.00", 
    "instructors": "Marcio Victorino", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375728_5ab6_6.jpg", 
    "course_url": "https://www.udemy.com/modelagem-de-dados-em-banco-de-dados-relacional/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T18:06:53Z"
}