{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The MySQL relational database is used to store data that can be manipulated using queries. It is used a lot in web development and other areas. In this course we are only covering the basics which should enable you write your own queries to get data from a database.</p><p>MySQL is currently owned and supported by the database giant Oracle. There is a commercial licensed version of MySQL that can be purchased that comes with premium support.<br>MySQL is a popular ,reliable and scalable relational database management system that is used by lots of companies and establishments all over the world. For example the social networking site Pinterest and The Space company Nasa just to mention a couple.<br> In this basic beginners course, we'll introduce the concepts of relational database management systems in general, and how they relate to MySQL in particular.<br>This is a practical hands on course where I strongly encourage you to type along with me as I write some basic MySQL queries using the SELECT statement. At the end of this short course you will have the confidence and skill to write your own MySQL basic SELECT statements.</p>\n\n<p>Here is what you will learn:<br></p>\n\n<ul><li>How to download and Install MySQL</li><li>What is MySQL</li><li>What are Database Concepts </li><li>What is MySQL Workbench</li><li>How to write syntax for SELECT Statement</li><li>How to write your own basic MySQL SELECT Statement</li></ul>\n\n<p>I look forward to welcoming you to this MySQL for beginners course.</p>", 
    "end_date": null, 
    "title": "MySQL Made Simple  For Beginners : Learn to  query MySQL DB", 
    "price": "20.00", 
    "instructors": "Bluelime Learning Solutions", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757122_2b71_2.jpg", 
    "course_url": "https://www.udemy.com/mysql-for-beginners-k/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T12:45:44Z"
}