{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">MySQL</strong> is a great place to get started with <strong style=\"\">database</strong>. Many experienced programmers recommend to beginners to get your dirty with MySQL first as it is considered as basic element in database world. This MySQL 101 is one of the ideal <strong style=\"\">practical</strong> <strong style=\"\">training</strong> that will help you to learn quickly about databases. After completing this training you will be able to create back end of web as well as <strong style=\"\">mobile application</strong>.  </p>  <p>  \t  MySQL, the world&#039;s second most extensively used open-source relational database management system (RDBMS). It is named behind co-founder Michael Widenius&#039;s daughter, MyThe SQL contraction stands for <strong style=\"\">Structured Query Language</strong>.  </p>  <p>  \t  The MySQL development project has made its source code accessible under the terms of the GNU General Public License, as well as under a diversity of proprietary agreements. MySQL was owned and sponsored by a solitary for-profit firm, the Swedish corporation MySQL AB, now owned by Oracle Corporation.  </p>  <p>  \t<strong style=\"\">MySQL</strong> is a fashionable preference of database for use in web applications, and is a fundamental factor of the extensively used LAMP open source web application software stack (and other &#039;AMP&#039; stacks). LAMP is an acronym for &quot;Linux, Apache, MySQL, Perl/PHP/Python.&quot; Free-software-open source projects that oblige a full-featured database management system often use <strong style=\"\">MySQL</strong>.  </p>  <p>  \t  Features of <strong style=\"\">MySQL</strong>:  </p>  <p>  \t  Because of its exclusive storage engine architecture <strong style=\"\">MySQL</strong> performance is very high.  </p>  <p>  \t  Supports large amount of embedded applications which makes <strong style=\"\">MySql</strong> very supple.  </p>  <p>  \t  Use of Triggers, Stored procedures and views which allows the developer to provide a advanced efficiency.  </p>  <p>  \t  Allows transactions to be rolled back, commit and crash recovery.  </p>  <p>  \t  We hope that this training will be valuable to you, to put into practice the knowledge gained in this course, to your dream project.  </p>  <p>  \t  This course will have <strong style=\"\">future updates</strong> to make sure that course remains updated in future. Students are requested to discuss so that we can understand their problems and create more videos to address their problems.  </p>", 
    "end_date": null, 
    "title": "MySQL 101 for beginners", 
    "price": "20.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360418_9c9f_2.jpg", 
    "course_url": "https://www.udemy.com/mysql-101-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T10:40:44Z"
}