{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">*********************************************************************************************************<br style=\"\"></strong></p><p><strong style=\"\">This Course is FREE for Limited Time GRAB IT before offer closes</strong><br style=\"\"></p><p style=\"\"><strong style=\"\">*********************************************************************************************************<br style=\"\"></strong></p><p style=\"\">MySQL Database Being the Second most widely used Relational Database makes it one of the database to learn if you are looking forward to develop a database driven application.</p><p style=\"\">Are you a Web Developer? An Application Developer? or A Programmer? Then MySQL Database should be one of the Mandatory Database in your &quot;To Learn&quot; list. If you don&#039;t know MySQL yet or if you are new to any database then this is your go to course to learn SQL and also MySQL Database.</p><p style=\"\">If you are learning or want to learn PHP, PYTHON, PEARL or RUBY then you should learn MySQL as well as this is the Database that is used by most of the developer who prefer the previously mentioned programming languages. If you are Web Developer and you don&#039;t know MySQL yet then most won&#039;t recommend you to call yourself as a Web Developer yet.</p><p style=\"\">MySQL is one of the most used and go to database for pretty much all the web developer who pick PHP, PEARL or Python without a second thought.</p><p style=\"\"><strong style=\"\">What does this Course cover?</strong></p><ul style=\"\"><li>Installation of MySQL Server in your Local System</li><li>Setting up and Configuring MySQL Database Server</li><li>Creating a Database with data</li><li>Maintaining the Database</li><li>Designing a better database</li><li>Covers all the basic you should know to create a complex database driven application</li></ul><p style=\"\"><strong style=\"\">Materials Included with this Course:</strong><br style=\"\"></p><ul style=\"\"><li><span class=\"redactor-invisible-space\" style=\"\">Course has around 50 Videos and will grow with time</span></li><li><span class=\"redactor-invisible-space\" style=\"\">Materials will be updated regularly</span></li><li><span class=\"redactor-invisible-space\" style=\"\">Sectional wrap up with a document containing all the Query Syntax</span></li><li><span class=\"redactor-invisible-space\" style=\"\">Instructor Help when needed by student (Discussion Board)</span></li></ul><p style=\"\"><strong style=\"\">Why should you take this course?</strong></p><ul style=\"\"><li>If you don&#039;t have any idea about SQL or Database this course is for you as it starts from scratch</li><li>You want to create a database driven application? All you need to create the database and write queries for the same will be covered</li><li>Maintaining you database with Ease even if you have no experience</li><li>Some concepts are taught in such a way you will learn them as you practice them and implement in your own way for better involvement and learning.</li></ul><p style=\"\"><strong style=\"\">The course follows a typical flow of topic which is considered best for learning the MySQL Database. The learning curve of SQL is also a part of this course.</strong><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "MySQL for Beginners", 
    "price": 0, 
    "instructors": "Vasandkumar Kunasekaran", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438552_478d.jpg", 
    "course_url": "https://www.udemy.com/mysql-db-for-beginners/", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T13:14:05Z"
}