{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Welcome to this Real Application Cluster couse</p><p style=\"\">During these moments that we spend together, I have only one goal, that you enjoy setting a professional high-tech environment. Grid Infrastructure 12c, data base 11gR2 both products were installed in graphic and silent mode.</p><p style=\"\">All these products involve the execution of different tasks defined below.</p><p style=\"\">The course have been produced with videos, you&#039;ll also listen my voice. I will give all explanations and examples relevant to the successfull anderstanding of this course.</p><p style=\"\">In addition, I will make available the &quot;roadmap&quot; that I used throughout the course with all the querys and operating system commands, this way you can use it to copy and paste into your environment.</p><p style=\"\">The course is about 4 hours and you&#039;ll find the following chapters:</p><p style=\"\">1 Installation and setting of Oracle VirtualBox, creation of RAC1 Virtual Machine (VM)</p><p style=\"\">2 Installation of Oracle linux 64 bits operating system</p><p style=\"\">3 Setting network cards and the /etc/hosts file</p><p style=\"\">4 Tune RAC1 with yum: Kernel parameters, packages dependencies, user and groups</p><p style=\"\">5 Clone RAC1 to RAC2, the second node of our Oracle RAC cluster</p><p style=\"\">6 Creation of the shared disks from virtual box and present them to both racs</p><p style=\"\">7 Creation of ASM disk for subsequent creation of diskgroups</p><p style=\"\">8 Installation of the binaries GI 12c</p><p style=\"\"> Set the ssh connectivity between node 1 and node 2</p><p style=\"\"> Run runcluvfy to get all the check results</p><p style=\"\">At this step if all is good, you have your first cluster 12c !</p><p style=\"\">9 Installation of GI 12c silent mode</p><p style=\"\">10 Installing Oracle 11gR2 binaries (graphic and silent)</p><p style=\"\">11 Creating Database 11gR2 data (graphic and silent)</p><p style=\"\">12 Learn all the command available to manage your cluster</p><p style=\"\">With this course, you have in your hand a powerful environment, created with the last version of Oracle products and for a very low cost. You can simulate a production environment at home with your personal computer.</p>", 
    "end_date": null, 
    "title": "Oracle Real Application Cluster", 
    "price": "20.00", 
    "instructors": "Luis Diaz", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467628_b94f_2.jpg", 
    "course_url": "https://www.udemy.com/oracle-real-application-cluster/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T20:54:55Z"
}