{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>One of the main reasons for using back end code is to have database interaction.  When it comes to using MySQL, PHP code is perfect for providing capabilities to achieve that interaction easily. </p><p>MySQL database are used to store information for websites!  Having a database is extremely useful for any website.  Some websites are entirely database driven.  Knowing how to make and connect databases to your web content creates a huge opportunity.</p><p>This course is taught by an instructor with over 15 years of real world experience.  Having developed hundreds of web applications and websites.  Using PHP and MySQL on a regular basis, let us show you how to start using MySQL and PHP together.</p><p>This course covers  </p><ul><li>How to setup localhost to use PHP and MySQL on your computer</li><li>How to access PHPmyAdmin</li><li>How to create databases</li><li>how to add tables</li><li>working with data selecting, adding, updating, deleting and more</li><li>Working with database content</li></ul><p>All of the source code and resources used within the course are provided, so that you can get started quickly.  </p><p>I am here to help you learn PHP and MySQL and ready to answer any questions you may have.</p><p><strong>MySQL is an in demand skill.</strong></p><p>Nothing to lose, there is a 100% Money Back if you don't like it</p><p>Want to know more, what are you waiting for take the first step. Join now to start learning PHP MySQL today.</p>", 
    "end_date": null, 
    "title": "PHP Database Connections to MYSQL", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/798032_f846.jpg", 
    "course_url": "https://www.udemy.com/php-database-connection-to-mysql/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-19T15:38:37Z"
}