{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn how to use a MySQL database and access data within your PHP code.  MySQL is the most popular database used by PHP.  Its works really well and smoothly with PHP code and is an ideal solution for storing information and utilising that data within your web projects. </p>\n\n<p>Do you need a database within you website? Database can help with information management and run as a the data source for dynamic websites.   MySQL is the perfect solution for any size application.   Its fast and reliable and best of all easy to use.   </p>\n\n\n\n\n\n<p>This course covers multiple methods of connecting to a MySQL database.  Avoid the confusion of only one way, we show you three ways to connect to a MySQL database via PHP code.</p>\n\n\n\n\n\n<p>Top resources, source code and more is provided to get you started quickly.</p>\n\n\n\n\n\n<ul><li>Learn how to connect to a database</li><li>Create databases</li><li>Create tables</li><li>Insert records into a MySQL database</li><li>Return ids of inserted records</li><li>Delete records </li><li>Update records</li><li>Create queries to interact with database content</li><li>phpmyadmin and how to use it</li></ul>\n\n\n\n\n\n<p>By the end of the course we show how to use a database within your PHP code</p>\n\n\n\n\n\n<p>I am here to help you learn how to create your own websites and ready to answer any questions you may have.</p>\n\n\n\n\n\n\n\n<p>Want to know more, what are you waiting for take the first step.  Join now to<strong> start learning how you too can add a database to your website today.</strong><br></p>", 
    "end_date": null, 
    "title": "PHP MySQL database connections", 
    "price": 0, 
    "instructors": "Laurence Svekis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/887396_fcad_2.jpg", 
    "course_url": "https://www.udemy.com/php-mysql-database-connections/", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-24T16:59:11Z"
}