{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Python 3 Database Programming with MySQL is a learn by doing course. It will teach you how to set up a web centric client server based development environment on your computer.  </p>  <p>  \t  The course teaches  you how to set up and work in the XAMPP environment - which is a web server environment that runs on Windows, Macintosh and Linux based computers that comes complete with MySQL and a variety of tools that make it an ideal platform for developing web sites on your personal computer.  </p>  <p>  \t  The course will then teach you how to create a web based MySQL application in Python by guiding you through the development of a basic inventory management and customer purchase system.  </p>  <p>  \t  This project will teach  you how to use the Python Database API and a wide variety of MySQL statements - enough to develop pretty sophisticated database centric Python programs.  </p>  <p>  \t<strong>Notes: </strong>  </p>  <ul>  \t<li>Even though the course and code is presented in Python 3, the actual Python Database API works in both Python 2.7 and Python 3. Also, the API is generic across databases. So once you learn the API by withing with MySQL, you will know how to use it with other database platforms.  </li>  \t<li>We use PMySQL as our Python DBI adapter module. If you use another adapter, the interface to MySQL will be the same.</li>  \t<li>We use XAMPP as our development environment. Feel free to use another environment or even a web server it you have the ability to install Python modules on it.</li>  </ul>", 
    "end_date": null, 
    "title": "Python 3 Database Programming with MySQL", 
    "price": "20.00", 
    "instructors": "Steven Chabotte", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309188_c7d9_2.jpg", 
    "course_url": "https://www.udemy.com/python-3-database-programming-with-mysql/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-27T21:35:21Z"
}