{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  This course will teach you how to create an effective relational database design using proven concepts and industry knowledge.  </p>  <p>  \t  Effective database designs will help make systems faster, improve data quality, and ensure future changes are easier.  </p>  <p>  \t  If you want to improve your software development career, get into database admin or design, or are just curious on this topic, this course is for you.  </p>  <p>  \t  You don&#039;t need to know SQL or have any programming experience to be able to take this course.  </p>  <p>  \t  Almost three hours of video lessons and included PDF files of the database diagrams at keys steps will help you learn all about database design. The topics covered include normalisation and the normal forms, identifying tables and columns, primary and foreign keys, and setting up relationships.  </p>  <p>  \tThe videos include explanations of the key topics in the process, as well as demonstrations on how to set up a database using an Entity Relationship Diagram. I also show you how to download and install the software that is being used for this.  </p>  <p>  \tWe&#039;ll walk through a sample database, starting with the reason or why the database is needed, some advantages of relational databases, identify entities for the tables and attributes, create tables and columns, and most importantly, reorganise them to make the layout and design more efficient.  </p>  <p>  \tIf you want to know how to design a database and improve the overall quality of your databases and software, then this is the course for you.  </p>  <p>  \t  You&#039;ll learn all you need to be able to design an effective database.  </p>", 
    "end_date": null, 
    "title": "Relational Database Design", 
    "price": "20.00", 
    "instructors": "Ben Brumm", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299398_1a2c_2.jpg", 
    "course_url": "https://www.udemy.com/relational-database-design/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T00:28:28Z"
}