{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">SQL Server Reporting Services 101 covers everything you need to get started using SSRS. This course is designed to teach the basics of SQL Reporting thoroughly in a practical and efficient manner.</p><p style=\"\"><strong style=\"\">Get up to Speed Developing Professional Reports Quickly.</strong></p> <ul style=\"\"> <li style=\"\">Configure SQL and SSRS</li> <li style=\"\">Learn to Write SQL Queries</li> <li style=\"\">Develop Professional Reports</li> <li style=\"\">Deploy Reports to Shareholders</li> </ul> <p style=\"\"><strong style=\"\">Build Reports Using SQL Server Reporting Services</strong></p><p style=\"\">SSRS has been one of the top reporting platforms since its debut in 2004 and continues to be a leader in the market. Many fortune 500 companies rely on SSRS Developers to continually analyze and provide data in meaningful ways. </p><p style=\"\">In this course, we will be getting you up to speed on configuring the tools and creating reports in a timely manner. We will cover everything you need to get started feeling comfortable using the software and making professional reports.</p><p style=\"\">I designed this course to be accessible to anybody that is wanting to learn new skills in reporting. After taking this course, you will have all the skills you need to be able to create professional reports and deploy them to your customers.</p>", 
    "end_date": null, 
    "title": "SQL Server Reporting Services (SSRS) 101", 
    "price": "25.00", 
    "instructors": "Andy Swinford", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472154_0818_6.jpg", 
    "course_url": "https://www.udemy.com/sql-server-reporting-services-101/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T19:21:54Z"
}