{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Becoming a database administrator (DBA) can be a very rewarding and fulfilling career.</p>\n\n<p>The path is relatively easy compared to other technical careers.</p>\n\n<p>Microsoft SQL Server is among the top 3 relational database management systems in the world<br>and getting the skills to becoming an SQL Server DBA will serve you well and open many job opportunities .</p>\n\n\n\n<p>Microsoft SQL Server Database Administrators (DBA) can earn $700 or more a day depending<br>on their experience and skills. It is also possible for a new DBA to start earning from $300 - $400 a day with the skills they will gain from this course in combination with their determination.</p>\n\n\n\n<p>The advantage of this course is the amazing virtual labs facilities that is available for free from Microsoft. The virtual labs comes with Microsoft Server 2012 and also Microsoft SQL Server 2016 and various instances of SQL Server like SQL Server Analysis Server (SSAS), SQL Server Reporting Service (SSRS),SQL Server Integration service  (SSIS). The virtual labs is ideal because it is free and gives you an environment that mirrors a real world production SQL Server environment. I strongly urge you to take advantage of this opportunity as I do not know how long Microsoft will have these virtual labs available for. All you require to access the virtual labs is a web browser . It does not matter if you are using a mac , Pc or Linux and there is absolutely nothing for you to install. The lab exercise you will perform in this course using the virtual labs are similar to a real world SQL Server production environment.</p>\n\n\n\n<p>What you will learn in this course includes:</p><ul><li>How to use Microsoft TechNet MSDN Virtual Labs</li><li>T-SQL  quick Guide</li><li>Importing and Exporting Data</li><li>How to use Activity monitor</li><li>How to use Performance monitor</li><li>How to backup database</li><li>How to restore database</li><li>How to monitor database </li><li>How to improve performance</li><li>How to Authenticate users and groups</li><li>How to set up Permissions</li><li>How to setup Auditing</li></ul><p><br><br></p>\n\n\n\n<p>I look forward to seeing on the course.</p>\n\n\n\n<p>Thank You</p>", 
    "end_date": null, 
    "title": "SQL Server Database Administrator: Learn SQL DBA Skills", 
    "price": "20.00", 
    "instructors": "Bluelime Learning Solutions", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756832_983b_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-sql-server-dba-some-dba-can-earn-700-a-day/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T05:16:43Z"
}