{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><span class=\"PIN_1373316065906_hazClick\" style=\"\">Have you started learning about SQL Databases, only to get stuck while trying to teach yourself? Or are you a developer whose never felt totally at ease with database work? Have you been looking for an easy and comprehensive way to go beyond the basics and start using SQL Databases in a professional and efficient way? Perhaps, you just want to get your SQL queries to work the first time!<br style=\"\"><br style=\"\">In this thorough and easy-to-follow course, LearnToProgram&#039;s database expert Martin Holzke shows you how to achieve success. From the very first lesson, you&#039;ll learn how to correctly structure your database, how to author efficient SQL statesments and clauses, and how to manage your SQL database for scalable growth. This course gives you all the information you need to successfully start working with SQL databases and make use of the database in your applications. <br style=\"\"><br style=\"\">Martin will invite you to work along with him as he demonstrates the ins and outs of database management and database for application development. If you&#039;re developing web or mobile apps-- or even games-- there is much to be learned about this important facet of development.  If you&#039;re brand new to SQL Database work, or a professional developer looking to learn the best practices, then SQL Database for Beginners is the perfect course for you!&nbsp;</span><br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "SQL Database for Beginners", 
    "price": "20.00", 
    "instructors": "LearnToProgram, Inc., Martin Holzke", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63202_53d4_7.jpg", 
    "course_url": "https://www.udemy.com/sql-database-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-01T15:16:55Z"
}