{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t <strong style=\"\">Get ready to kick some software project butt.</strong>  </p>  <p>  \t                Enter the world of the Agile Samurai, where the most dire of software projects are dispatched with ease and grace. By learning the ways of the Agile Samurai you will discover:  </p>  <p>  \t- what Agile is, how it works, and the mindset necessary for working iteratively  </p>  <p>  \t- common myths and pitfalls and how to choose the right Agile method for you  </p>  <p>  \t- how to build a good Agile team  </p>  <p>  \t- how from traditional waterfall roles (like developer, analyst, tester, and project manager) change on Agile project  </p>  <p>  \t- how to create a plan you and your customer can believe in  </p>  <p>  \t- how to gather requirements in a fraction of the time using Agile User Stories  </p>  <p>  \t- how to deliver something of value every week  </p>  <p>  \t- what to do when the schedule is wrong, and how to look like a pro correcting it, and  </p>  <p>  \t- the four essential Agile Engineering practices, and why they are so important for Agility.  </p>  <p>  \tBy the end of this course you’ll have everything you need to successfully set up, execute, and deliver your own Agile project.  </p>  <h5> Course Outline </h5>  <h5>Agile In a Nutshell</h5>  <p>  \t     What Agile is, how it works, and how to choose the right Agile method for you.  </p>  <h5>Agile Teams</h5>  <p>  \t                What makes the Agile team tick. Characteristics of good Agile teams. And how to find quality players.  </p>  <h5>User Stories</h5>  <p>  \t                In this session we break down what user stories are, how they work, what effective user stories look like for your project, and how to host great story gathering work shops.  </p>  <h5>Estimation</h5>  <p>  \t                By learning how to estimate the Agile way, you’ll stop trying to get something your up-front estimates can’t give (precision and accuracy) and instead focus on what really matters—building a plan you and your customer can believe in.  </p>  <h5>Planning</h5>  <p>  \t                In this session, you’re going to learn how to create plans you can believe in and follow through on commitments you and your team make.  </p>  <h5>Iteration Mechanics</h5>  <p>  \t                This session shows teams how to set the iterations up for success, breaks down what actually occurs during an iteration, and how to setup an agile communication plan for you and your team.  </p>  <h5>Visible Workspaces</h5>  <p>  \t                By learning how to create a visual workspace, you and the team will never be at a loss for what to do next or where you can add the greatest value.  </p>  <p>  \t<strong style=\"\">    Engineering</strong>  </p>  <p>  \t                Agile doesn’t work on planning alone. That would be wishful thinking. Only by apply these core software engineering practices can you reduce the time it takes to test, ensure you always have a good design, and confidently make necessary changes with speed.  </p>  <p>  \t            Unit Testing - Automated tests proving your software works  </p>  <p>  \t            Refactoring - Paying down technical debt, while continuously improving your design  </p>  <p>  \t            Test-Driven Development - Write the tests first to help improve your design  </p>  <p>  \t            Continuous Integration - Maintaining a culture of production readiness, and deploying at a moments notice  </p>  <h5>Intended Audience</h5>  <p>  \t                This is an introductory level course on Agile software delivery.  </p>  <h5>Course Requirements</h5>  <p>  \t                No previous experience with Agile expected or necessary.  </p>  <h5>Instructional Level</h5>  <p>  \t                All Levels  </p>", 
    "end_date": null, 
    "title": "The Agile Samurai Bootcamp", 
    "price": "25.00", 
    "instructors": "Jonathan Rasmusson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131816_9683_10.jpg", 
    "course_url": "https://www.udemy.com/the-agile-samurai-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-10T12:30:07Z"
}