{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>Novice to professional database developer in 4 weeks!</em></p>\n\n<p>Establish the strongest possible foundation in database development by learning how to use MySQL - <em class=\"redactor-inline-converted\">the most popular open source database in the world</em> - write queries, create reports at will, build web applications, incorporate MySQL as the database layer - make your development dreams a reality by taking this course and putting a check mark next to your growing development skillset.</p>\n\n<p>Database development with MySQL is one of the most fundamental skills that a technology professional needs to thrive in today's workplace. This course gives you that skill. You'll start with the absolute basics of installing and creating databases and work your way through building web applications with MySQL as the database, by the end of this course you'll be able to apply what you have learnt and do virtually anything you want with databases.</p>\n\n<p>Regardless of whether you have experience with flashy new frameworks which try (and fail) to abstract the core of database queries, understanding and having the ability to manipulate these abstractions at will is fundamental to becoming a professional developer - which learning MySQL accomplishes! </p>\n\n<p>This course has it all -</p>\n\n<p>- Setting up MySQL, working with online IDE's</p>\n\n<p>- Creating Databases and Queries</p>\n\n<p>- Using logical operators, manipulating tables/rows/data</p>\n\n<p>- Learning how joins work and using them at will</p>\n\n<p>- Building web applications with PHP, HTML and CSS along with MySQL as the database layer</p>\n\n<p>- Performing CRUD and authentication from web applications</p>\n\n<p>- Creating admin features and deploying to production</p>\n\n<p>- Responsive support in Q &amp; A and FREE LIVE HELP chatline!</p>\n\n<p>I'm so confident that you'll enjoy what you learn in this course that there is a no-questions asked 30-day money back guarantee (from the date of purchase). So what are you waiting for? Join today and I'll see you in the course!</p>", 
    "end_date": null, 
    "title": "The Complete MySQL Developer Course", 
    "price": "20.00", 
    "instructors": "Rob Percival, Mashrur Hossain", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785066_3966_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-mysql-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T15:08:36Z"
}