{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<ul><li><strong>Do you want to <em>SKY ROCKET </em>your Income?<br></strong></li><li><strong>Do you want to master the skill of SQL. <br></strong></li><li><strong>Do you have an Interview coming up where you know SQL would look amazing on your resume?</strong></li></ul><p>Low pay SQL developers make $60,000 per year. In this course you will learn the skills necessary to rock out SQL Statements, Views, Stored Procedures and more.</p><p>In this course you will Design a database from scratch so that you understand the thought process that goes into such a design. We will then bring in the basic skills of SQL and give you example upon example of how to use this skill while building on those basic skills adding in more technique and more difficulty until they become more advanced. You will learn skills that even you average DBA doesn't do properly.</p><ul><li><strong>SQL Statements</strong></li><li><strong>Views</strong></li><li><strong>Stored Procedures</strong></li><li><strong>Triggers</strong></li><li><strong>User Defined Functions</strong></li><li><strong>and a lot more!</strong></li></ul><p>When you are done with this course, you will be able to walk into a interview with a calm confidence and show them that you know what you are doing and apply these skills to build the database back end for an application that will stand the test of time.</p><p>If you want a better career take this course you will not be disappointed.</p><p>Enroll with confidence! Your enrollment is backed by Udemy's 30-day, no-questions-asked, money-back guarantee!</p>", 
    "end_date": null, 
    "title": "WAMP + MySql  = Awesome ", 
    "price": "20.00", 
    "instructors": "Rico Rodriguez", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650816_eceb_2.jpg", 
    "course_url": "https://www.udemy.com/wamp-mysql-awesome/", 
    "currency": "USD", 
    "subject_name": [
        "Databases"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T01:51:34Z"
}