{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/functionalanalysis\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/functionalanalysis-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    functionalanalysis-001\n                                                                    functionalanalysis-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Functional analysis is the branch of mathematics dealing with spaces of\nfunctions. It is a valuable tool in theoretical mathematics as well as\nengineering. It is at the very core of numerical simulation.\n\nIn this class, I will explain the concepts of convergence and talk about\ntopology. You will understand the difference between strong convergence\nand weak convergence. You will also see how these two concepts can be used.\n\nYou will learn about different types of spaces including metric spaces,\nBanach Spaces, Hilbert Spaces and what property can be expected. You will\nsee beautiful lemmas and theorems such as Riesz and Lax-Milgram and I will\nalso describe Lp spaces, Sobolev spaces and provide a few details about\nPDEs, or Partial Differential Equations.\n\n\n\n                                            Syllabus\n                        Week 1: Topology; continuity and convergence of a sequence in a topological space.Week 2: Metric and normed spaces; completenessWeek 3: Banach spaces; linear continuous functions; weak topologyWeek 4: Hilbert spaces; The Riesz representation theoremWeek 5: The Lax-Milgram LemmaWeek 6: Properties of the Lp spacesWeek 7: Distributions and Sobolev SpacesWeek 8: Application: simulating a membrane\n                                    ", 
    "end_date": "2014-11-07T00:00:00Z", 
    "title": "An Introduction to Functional Analysis", 
    "price": 0, 
    "instructors": "John Cagnol", 
    "institution_name": [
        "École Centrale Paris"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/course/functionalanalysis", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-09-12T00:00:00Z"
}