{
    "selfpaced": true, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    Calculus Two: Sequences and Series is an introduction to sequences, infinite series, convergence tests, and Taylor series.  The course emphasizes not just getting answers, but asking the question \"why is this true?\"\n\n                                            Syllabus\n                        SequencesWelcome to the course!  My name is Jim Fowler, and I am very glad that you are here.  \n\nIn this first module, we introduce the first topic of study:\nsequences.  Briefly, a sequence is an unending list of numbers; since a sequence \"goes on forever,\" it isn't enough to just list a few terms: instead, we usually give a rule or a recursive formula.\n\nThere are many interesting questions to ask about sequences.  One question is whether our list of numbers is getting close to anything in particular; this is the idea behind the limit of a sequence. SeriesIn this second module, we introduce the second main topic of study: series.  Intuitively, a \"series\" is what you get when you add up the terms of a sequence, in the order that they are presented.  A key example is a \"geometric series\" like the sum of one-half, one-fourth, one-eighth, one-sixteenth, and so on.\n\nWe'll be focusing on series for the rest of the course, so if you find things confusing, there is a lot of time to catch up.  Let me also warn you that the material may feel rather abstract.  If you ever feel lost, let me reassure you by pointing out that the next module will present additional concrete examples.Convergence TestsIn this third module, we study various convergence tests to determine whether or not a series converges: in particular, we will consider the ratio test, the root test, and the integral test.  Alternating SeriesIn this fourth module, we consider absolute and conditional convergence, alternating series and the alternating series test, as well as the limit comparison test.  In short, this module considers convergence for series with some negative and some positive terms.  Up until now, we had been considering series with nonnegative terms; it is much easier to determine convergence when the terms are nonnegative so in this module, when we consider series with both negative and positive terms, there will definitely be some new complications.  In a certain sense, this module is the end of \"Does it converge?\"  In the final two modules, we consider power series and Taylor series.  Those last two topics will move us away from questions of mere convergence, so if you have been eager for new material, stay tuned!Power SeriesIn this fifth module, we study power series.  Up until now, we had been considering series one at a time; with power series, we are considering a whole family of series which depend on a parameter x.  They are like polynomials, so they are easy to work with.  And yet, lots of functions we care about, like e^x, can be represented as power series, so power series bring the relaxed atmosphere of polynomials to the trickier realm of functions like e^x.Taylor SeriesIn this last module, we introduce Taylor series.  Instead of starting with a power series and finding a nice description of the function it represents, we will start with a function, and try to find a power series for it.  There is no guarantee of success!  But incredibly, many of our favorite functions will have power series representations.  Sometimes dreams come true.  Like many dreams, much will be left unsaid.  I hope this brief introduction to Taylor series whets your appetite to learn more calculus.FinalThe final exam is your opportunity to demonstrate everything you have learned in our time together.  You have nearly reached the end of the course.  Let me tell you that it has been my honor and my pleasure to be one of your guides through mathematics.  I very much enjoyed putting this course together, and I look forward to more.  I hope we will meet again.\n                                    ", 
    "end_date": "2014-04-19T00:00:00Z", 
    "title": "Calculus Two: Sequences and Series", 
    "price": 0, 
    "instructors": "Jim Fowler", 
    "institution_name": [
        "Ohio State University"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/advanced-calculus", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-03-01T00:00:00Z"
}