{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include: 1) the introduction and use of Taylor series and approximations from the beginning; 2) a novel synthesis of discrete and continuous forms of Calculus; 3) an emphasis on the conceptual over the computational; and 4) a clear, dynamic, unified approach.\n\nIn this third part--part three of five--we cover integrating differential equations, techniques of integration, the fundamental theorem of integral calculus, and difficult integrals.\n\n                                            Syllabus\n                        Integrating Differential EquationsOur first look at integrals will be motivated by differential equations. Describing how things evolve over time leads naturally to anti-differentiation, and we'll see a new application for derivatives in the form of stability criteria for equilibrium solutions.Techniques of IntegrationSince indefinite integrals are really anti-derivatives, it makes sense that the rules for integration are inverses of the rules for differentiation. Using this perspective, we will learn the most basic and important integration techniques. The Fundamental Theorem of Integral CalculusIndefinite integrals are just half the story: the other half concerns definite integrals, thought of as limits of sums. The all-important *FTIC* [Fundamental Theorem of Integral Calculus] provides a bridge between the definite and indefinite worlds, and permits the power of integration techniques to bear on applications of definite integrals. Dealing with Difficult IntegralsThe simple story we have presented is, well, simple. In the real world, integrals are not always so well-behaved. This last module will survey what things can go wrong and how to overcome these complications. Once again, we find the language of big-O to be an ever-present help in time of need. \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Calculus: Single Variable Part 3 - Integration", 
    "price": 0, 
    "instructors": "Robert Ghrist", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/integration-calculus", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}