{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include: 1) the introduction and use of Taylor series and approximations from the beginning; 2) a novel synthesis of discrete and continuous forms of Calculus; 3) an emphasis on the conceptual over the computational; and 4) a clear, dynamic, unified approach.\n\nIn this first part--part one of five--you will extend your understanding of Taylor series, review limits, learn the *why* behind l'Hopital's rule, and, most importantly, learn a new language for describing growth and decay of functions: the BIG O.\n\n                                            Syllabus\n                        IntroductionWelcome to Calculus: Single Variable!  below you will find the course's diagnostic exam.   if you like, please take the exam.  you don't need to score a minimal amount on the diagnostic in order to take the course.  but if you do get a low score, you might want to readjust your expectations:  this is a very hard class...A Review of FunctionsThis module will review the basics of your (pre-)calculus background and set the stage for the rest of the course by considering the question: just what is the exponential function?Taylor SeriesThis module gets at the heart of the entire course: the Taylor series, which provides an approximation to a function as a series, or \"long polynomial\".  You will learn what a Taylor series is and how to compute it. Don't worry! The notation may be unfamiliar, but it's all just working with polynomials....Limits and AsymptoticsA Taylor series may or may not converge, depending on its limiting (or \"asymptotic\") properties. Indeed, Taylor series are a perfect tool for understanding limits, both large and small, making sense of such methods as that of l'Hopital.  To solidify these newfound skills, we introduce the language of \"big-O\" as a means of bounding the size of asymptotic terms.  This language will be put to use in future Chapters on Calculus.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Calculus: Single Variable Part 1 - Functions", 
    "price": 0, 
    "instructors": "Robert Ghrist", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/single-variable-calculus", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}