{
    "selfpaced": true, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Mathematics\n                                                                                            \n                            \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Mathematics\n                                                                                                    &gt; Calculus &amp; Mathematical Analysis\n                                                            \n                            \n                                                \n                    \n                    \n                    Calculus is about the very large, the very small, and how things change. The surprise is that something seemingly so abstract ends up explaining the real world.  Calculus plays a starring role in the biological, physical, and social sciences.  By focusing outside of the classroom, we will see examples of calculus appearing in daily life.\n This course is a first and friendly introduction to calculus, suitable for someone who has never seen the subject before, or for someone who has seen some calculus but wants to review the concepts and practice applying those concepts to solve problems.\n\n                                            Syllabus\n                        Welcome to Calculus OneWelcome to Calculus!  Join me on this journey through one of the great triumphs of human thought.Functions and LimitsFunctions are the main star of our journey.  Calculus isn't numbers: it's relationships between things, and  how one thing changing affects something else.The End of LimitsPeople have thought about infinity for thousands of years; limits provide one way to make such ponderings precise.  Continuity makes precise the idea that small changes in the input don't affect the output much.The Beginning of DerivativesIt is time to change topics, or rather, to study change itself!  When we wiggle the input, the output value changes, and that ratio of output change to input change is the derivative.Techniques of DifferentiationWith the product rule and the quotient rule, we can differentiate products and quotients.  And since the derivative is a function, we can differentiate the derivative to get the second derivative.\nChain RuleThe chain rule lets us differentiate the composition of two functions.  The chain rule can be used to compute the derivative of inverse functions, too.\nDerivatives of Transcendental (Trigonometric) FunctionsSo far, we can differentiate polynomials, exponential functions, and logarithms.  Let's learn how to differentiate trigonometric functions.Derivatives in the Real WorldDerivatives can be used to calculate limits via l'Hôpital's rule.  Given a real-world equation involving two changing quantities, differentiating yields \"related rates.\"\nOptimizationIn the real world, we must makes choices, and wouldn't it be great if we could make the best choice?  Such optimization is made possible with calculus.\nLinear ApproximationReplacing the curved graph by a straight line approximation helps us to estimate values and roots.AntidifferentiationAntidifferentiation is the process of untaking derivatives, of finding a function whose derivatives is a given function.  Since it involves working backwards, antidifferentiation feels like \"unbreaking a vase\" and can be just as challenging.\nIntegrationBy cutting up a curved region into thin rectangles and taking a limit of the sum of the areas of those rectangles, we compute (define!) the area of a curved region.Fundamental Theorem of CalculusArmed with the Fundamental Theorem of Calculus, evaluating a definite integral amounts to finding an antiderivative.\nSubstitution RuleSubstitution systematizes the process of using the chain rule in reverse.  Considering how often we used the chain rule when differentiating, we will often want to use it in reverse to antidifferentiate.\nTechniques of IntegrationIntegration by parts is the product rule in reverse.  Integrals of powers of trigonometric functions can be evaluated.\nApplications of IntegrationWe have already used integrals to compute area; integration can also be used to compute volumes.\n\n                                    ", 
    "end_date": "2014-05-16T00:00:00Z", 
    "title": "Calculus One", 
    "price": 0, 
    "instructors": "Jim Fowler", 
    "institution_name": [
        "Ohio State University"
    ], 
    "commitment": "6-10 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/calculus1", 
    "duration": "16 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-01-24T00:00:00Z"
}