{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include: 1) the introduction and use of Taylor series and approximations from the beginning; 2) a novel synthesis of discrete and continuous forms of Calculus; 3) an emphasis on the conceptual over the computational; and 4) a clear, dynamic, unified approach.\n\nIn this second part--part two of five--we cover derivatives, differentiation rules, linearization, higher derivatives, optimization, differentials, and differentiation operators.\n\n                                            Syllabus\n                        A New Look at DifferentiationThink derivatives mean \"slopes\"? Not anymore... In this module, we will reconsider what a derivative is and means in terms of the asymptotic (or big-O) notation from the previous chapter. This will give us a new language for describing and understanding rates of change and the rules that govern them. Putting Derivatives to WorkWhy exactly are derivatives so central to calculus? In part, it is because they are so ubiquitously useful! In this module, we will recall a few core applications of derivatives. In so doing, we'll see exactly how having an understanding of the asymptotics assists in building applications of the derivative.Differentials and OperatorsThere is much more to derivatives than simply their computation and applications. So much of how they arise is calculus is in the mysterious guise of *differentials*.  These arise from implicit differentiation, which in turn reveals a deeper level of understanding of what differentiation means.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Calculus: Single Variable Part 2 - Differentiation", 
    "price": 0, 
    "instructors": "Robert Ghrist", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/differentiation-calculus", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}