{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    Los cursos de Cálculo Diferencial y Cálculo Integral tradicionalmente se ofrecen separados y respetando ese orden. El primero estudia la derivada, y el segundo, la integral, siendo este momento en el que aparece el Teorema Fundamental del Cálculo (TFC) para establecer la relación entre ambos conceptos. En el presente curso vamos a hacer una diferencia: introduciremos la derivada y la integral como conceptos relacionados desde un principio. \n\nVamos a iniciar con la interpretación del Teorema Fundamental del Cálculo, con esto nos referimos a descubrir su significado real en la solución de problemas. Llegaremos a asociar con él la actividad práctica de calcular el valor de una magnitud que está cambiando. Habiendo realizado esta interpretación, los conceptos de derivada e integral se verán relacionados desde un principio, lo que te permitirá predecir el valor de una magnitud que está cambiando. Las nociones fundamentales de derivada e integral las identificaremos con las ideas de “razón de cambio” y de “acumulación del cambio”, y el TFC nos proveerá de la estrategia de solución.\n \nRecordarás que la Matemática Elemental incluye el Álgebra, la Geometría y la Geometría Analítica. Podemos decir que éstas son Matemáticas que estudian lo estático. En cambio, la Matemática Superior, que incluye el Cálculo, estudia lo dinámico. Con el Cálculo se inicia el estudio del cambio, una realidad presente en nuestro entorno cotidiano sin duda alguna. Costos, temperaturas, poblaciones, velocidades, energías, capitales de inversión, longitudes, etc., son algunos ejemplos de esto. En este curso podrás entender al Cálculo como una estrategia de solución para el estudio del cambio y diferenciarlo de las Matemáticas Elementales, aunque utilice de ellas bastante información.\n \nAl finalizar este curso podrás:\n\nDescribir de qué manera los modelos matemáticos polinomial, exponencial natural, y trigonométricos (seno y coseno), son una construcción que responde a esta práctica de predicción. Los verás a todos ellos surgir de esta práctica cuando una magnitud real particular cumple ciertas condiciones en su “razón de cambio” con respecto a la magnitud de la que depende. \n\nUtilizar la introducción de procesos infinitos (¡no imposibles!) en la construcción de la respuesta de predicción, con ello entenderás por qué se habla de Matemática Superior y de un pensamiento matemático avanzado.\n\nValorar una forma de pensar diferente, donde nuestro razonamiento matemático trascienda la sola manipulación de fórmulas algebraicas.\n\n                                            Syllabus\n                        Inicio e introducción al curso y a la tecnologíaAbordaremos aspectos relacionados con el diseño y desarrollo del curso. Plantearemos las razones por las cuales ofrecemos un acercamiento a los contenidos del Cálculo Diferencial e Integral bajo una perspectiva que no ha sido contemplada en la enseñanza y aprendizaje tradicional de estos temas. Además, nos familiarizaremos con el uso de diferentes tecnologías digitales como medio para apoyar esta propuesta didáctica.Modelo LinealComenzaremos este curso presentando la problemática que hemos planteado en nuestro prefacio: la predicción del valor de una magnitud que está cambiando. Estudiamos el caso más simple de variación posible, y con esto daremos lugar al establecimiento del Modelo Lineal.Valor Aproximado Del Cambio Acumulado La problemática de predecir el valor de una magnitud que está cambiando nos permitirá dar un significado a nuestro estudio del Cálculo y apreciar la utilidad de sus nociones y procedimientos. En este Módulo construiremos una estrategia numérica para tratar con dicha problemática motivando su obtención con el análisis de una situación real en particular.Estrategia Numérica: Método De EulerUtilizaremos la estrategia numérica desarrollada en el módulo anterior y la aplicaremos “hasta sus últimas consecuencias”, es decir, considerando procesos infinitos. El recurso digital de la hoja de cálculo nos permitirá apoyar nuestro pensamiento para concretar el aprendizaje al representarlo con la simbología matemática adecuada. Valor Exacto Del Cambio Acumulado: Modelo PolinomialLa práctica de predicción de valores de una magnitud que está cambiando a través de la estrategia numérica del Método de Euler nos permitirá reconocer los modelos matemáticos polinomiales. Asociaremos con ellos los procesos de derivación e integración desde una perspectiva teórica y también algebraica.Modelo CuadráticoAbordaremos el estudio del Modelo Cuadrático al interpretarle como el modelo polinomial cuya razón de cambio se asocia con un modelo lineal. El análisis de sus gráficas nos permitirá identificar ciertas relaciones compartidas entre función y derivada, y con ellas podremos interpretar visualmente el comportamiento de la magnitud que está cambiando.Modelo CúbicoAbordaremos el estudio del Modelo Cúbico como el modelo polinomial en el cual la razón de cambio se representa con un modelo cuadrático. A través del análisis de sus gráficas podremos ampliar nuestro conocimiento incluyendo un nuevo tipo de comportamiento. El conocimiento de modelo cúbico se integra con el del cuadrático y del lineal, y con esto apreciaremos en el Cálculo el estudio del cambio, posible a través de las sucesivas derivadas de una función. Modelo ExponencialLa estrategia numérica del Método de Euler será aplicada para construir el Modelo Exponencial. Para esto, asociaremos la problemática de predicción con situaciones reales cuya particularidad se establece en términos de la relación entre la magnitud y su razón de cambio, lo que matemáticamente se conoce como una ecuación diferencial.Modelo TrigonométricoEl análisis de una nueva situación real cuyo comportamiento se asocia con la periodicidad, nos permitirá reconocer los nuevos modelos matemáticos: seno y coseno. Recordaremos aspectos de trigonometría para utilizarlos en el establecimiento de estos modelos, y analizaremos particularidades de su comportamiento gráfico asociado con diferentes aplicaciones.Derivada - Diferencial / Antiderivada - IntegralEn este Módulo retomaremos los conceptos fundamentales del Cálculo desde una perspectiva teórica.  Haremos énfasis en los diferentes acercamientos para su establecimiento como teoría científica, uno Newtoniano y uno Leibniziano. Hablaremos de las ventajas de los mismos para el tratamiento de la problemática de predicción que hemos establecido en este curso.Derivando e IntegrandoEste Módulo será dedicado al reforzamiento de aspectos algorítmicos en el cálculo de derivadas e integrales. El énfasis en la manipulación de la simbología algebraica permitirá minimizar dificultades. El uso de tecnologías digitales actuales permitirá valorar su potencial como herramienta en el proceso.Nuevos ModelosEn este módulo abordaremos diferentes modelos matemáticos obtenidos a partir de los modelos básicos que ya han sido estudiados en este curso. Reconoceremos cada nuevo modelo asociándolo con su derivada/antiderivada. El análisis de su comportamiento gráfico será una herramienta visual para reconocer su utilidad en la representación de diferentes comportamientos de variación.Y muchas más aplicacionesEste último módulo se retoma la problemática original de predicción aplicada a nuevas situaciones reales en las que la aplicación de los procesos de derivación e integración en Cálculo resultan de utilidad para analizar el comportamiento de las magnitudes involucradas. \n                                    ", 
    "end_date": "2016-08-29T00:00:00Z", 
    "title": "Cálculo Diferencial e Integral unidos por el Teorema Fundamental del Cálculo", 
    "price": 0, 
    "instructors": "Dra. Patricia Salinas Martínez", 
    "institution_name": [
        "Tecnológico de Monterrey"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/calculo-diferencial", 
    "duration": "11 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}