{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Mathematics\n                                                                                                    &gt; Calculus &amp; Mathematical Analysis\n                                                            \n                            \n                                                \n                    \n                    \n                    In this course you'll gain an introduction to the modern study of dynamical systems, the interdisciplinary field of applied mathematics that studies systems that change over time. \r\nTopics to be covered include: phase space, bifurcations, chaos, the butterfly effect, strange attractors, and pattern formation.  The course will focus on some of the realizations from the study of dynamical systems that are of particular relevance to complex systems:\r\n1.  Dynamical systems undergo bifurcations, where a small change in a system parameter such as the temperature or the harvest rate in a fishery leads to a large and qualitative change in the system'sbehavior.\r\n2.  Deterministic dynamical systems can behave randomly.  This property, known as sensitive dependence or the butterfly effect, places strong limits on our ability to predict some phenomena.\r\n3.  Disordered behavior can be stable.  Non-periodic systems with the butterfly effect can have stable average properties.  So the average or statistical properties of a system can be predictable, even if its details are not.\r\n4.  Complex behavior can arise from simple rules.  Simple dynamical systems do not necessarily lead to simple results.  In particular, we will see that simple rules can produce patterns and structures of surprising complexity.\n\n                                    ", 
    "end_date": "2016-09-13T00:00:00Z", 
    "title": "Introduction to Dynamical Systems and Chaos", 
    "price": 0, 
    "instructors": "David Feldman", 
    "institution_name": [
        "Santa Fe Institute"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "http://chaos.complexityexplorer.org/", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Complexity Explorer"
    ], 
    "start_date": "2016-07-05T00:00:00Z"
}