{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    Curso diseñado para facilitar la entrada del estudiante en los cursos de cálculo de primer semestre de prácticamente cualquier grado universitario, con especial énfasis en Ciencias e Ingeniería.\n\n                                            Syllabus\n                        Comprueba tu nivel de conocimientos matemáticosTres cuestionarios, de dificultad creciente, para evaluar el nivel mínimo de conocimientos matemáticos que se exige para seguir cómodamente el curso.\n\nLa realización de estas pruebas es opcional y se pueden realizar tantas veces como sea necesario. La puntuación obtenida en ellas no formará parte de la evaluación final del curso.Números y funcionesConjuntos de números, el conjunto de los números reales, valor absoluto, subconjuntos de números, el plano real y distancias en el plano, funciones reales y su representación gráfica, la función inversa, comportamiento de una función.Funciones lineales, cuadráticas y polinomialesRectas en el plano, pendiente de una recta, funciones constantes y funciones lineales, funciones cuadráticas,  ceros de funciones, funciones polinomiales, ceros de funciones polinomiales, representación gráfica de funciones polinomiales.Funciones exponenciales y logarítmicasLa función exponencial, representación gráfica, las funciones logarítmicas, representación gráfica, ecuaciones exponenciales, conversión entre expresiones exponenciales y logarítmicas, cambio de base en expresiones logarítmicas, ecuaciones logarítmicas, aplicaciones.Funciones trigonométricasFunciones trigonométricas, identidades fundamentales, representaciones gráficas, resolución de triángulos rectángulos, resolución de ecuaciones trigonométricas, resolución de triángulos cualesquiera.DerivaciónLa tasa de variación de una función, derivada de una función en un punto, interpretación geométrica, función derivada, cálculo de derivadas, máximos y mínimos de una función, aplicaciones.IntegraciónLa función primitiva o antiderivada. Cálculo de primitivas. Técnicas de integración. El área limitada por una función, la integral definida, Teorema fundamental del cálculo y aplicaciones al cálculo de áreas.Números complejosLos ceros de la función f(x)=x^2+1, los números complejos, operaciones con números complejos, formas trigonométrica y polar de un número complejo, potenciación y radicación de números complejos.\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "Pre-Calculus", 
    "price": 0, 
    "instructors": "Jaume Pujol and Mercè Villanueva", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/introduccion-al-calculo", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}