{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    Ders çok değişkenli fonksiyonlardaki iki derslik dizinin ikincisidir. Birinci ders türev ve entegral kavramlarını geliştirmekte ve bu konulardaki problemleri temel çözme yöntemlerini sunmaktadır. Bu ders, birinci derste geliştirilen temeller üzerine daha ileri konuları işlemekte ve daha kapsamlı uygulamalar ve çözümlü örnekler sunmaktadır. Ders gerçek yaşamdan gelen uygulamaları da tanıtmaya önem veren “içerikli yaklaşımla” tasarlanmıştır. \n\nBölümler\nBölüm 1: Multivar 1'in Özeti, Dairesel Koordinatlarda Entegraller\nBölüm 2: Türev Uygulamalarından Seçme Konular\nBölüm 3: Çok Değişkenle Zincirleme Türev ve Jakobiyan\nBölüm 4: Uzayda Yüzey ve Hacım Entegralleri\nBölüm 5: Düzlemde Akı Entegralleri\nBölüm 6: Düzlemde Green, Uzayda Stokes ve Green-Gauss Teoremleri\nBölüm 7: Stokes ve Green-Gauss Teoremleri ve Doğanın Korunum Yasaları\n-----------\nThe course is the second of the two course sequence of calculus of multivariable functions. The first course develops the concepts of derivatives and integrals of functions of several variables, and the basic tools for doing the relevant calculations. This course builds on the foundations of the first course and introduces more advanced topics along with more advanced applications and solved problems. The course is designed with a “content-based” approach, i. e. by solving examples, as many as possible from real life situations.\n\nBölümler\nBölüm 1: Summary of Multivar I, Integral in Circular Coordinates\nBölüm 2: Topics of Derivative Applications\nBölüm 3: Chain Derivatives with Multi Variables and Jacobian\nBölüm 4: Surface and Volume Integrals in Space\nBölüm 5: Flux Integrals in the Plane\nBölüm 6: Green in Plane, Stokes in Space and Green-Gauss Theorems\nBölüm 7:  Stokes and Green-Gauss Theorem and Nature Conservation Laws\n-----------\nKaynak: Attila Aşkar, “Çok değişkenli fonksiyonlarda türev ve entegral”. Bu kitap dört ciltlik dizinin ikinci cildidir. Dizinin diğer kitapları Cilt 1 “Tek değişkenli fonksiyonlarda türev ve entegral”, Cilt 3: “Doğrusal cebir” ve Cilt 4: “Diferansiyel denklemler” dir.\n\nSource: Attila Aşkar, Calculus of Multivariable Functions, Volume 2 of the set of Vol1: Calculus of Single Variable Functions, Volume 3: Linear Algebra and Volume 4: Differential Equations. All available online starting on January 6, 2014\n\n                                            Syllabus\n                        Multivar 1'in Özeti, Dairesel Koordinatlarda Entegrallerİki değişkenli fonksiyonlardan hatırlatmalar: ikinci derece fonksiyonlar, kısmi türev ve iki katlı entegrallerdeki temel tanımlar ve geometrideki anlamları; iki değişkenli fonksiyonlarda türev ve entegrallerdeki temel hesaplama yöntemleri, iki katlı entegral hesaplamasında sıranın öneminin örneklerle hatırlatılması; teğet düzlem ve diferansiyel; tam türev ve zincirleme türev. Yöne göre türev. Gradyan, Bu sonuçların üç ve “n” değişkenli fonksiyonlara genellenmesi.Türev Uygulamalarından Seçme Konularİki değişkenli fonksiyonlarda Koordinat dönüşümleri ve Jakobiyan. Diverjans, Rotasyonel ve Laplasyen. Dairesel koordinatlarda gradyan. Doğanın dört temel kısmi türevli denklemi: dalga, sızma, Laplace denklemleriyle Schrödinger denkleminin tanıtılması. İki değişkenli sonuçların üç değişkene ve mümkün olan durumlarda “n” değişkene genellenmesi. Karmaşık değerli fonksiyonların özel yapısıyla kısmi türevler ve tam türev.Çok Değişkenle Zincirleme Türev ve JakobiyanEn büyük ve en küçük değerler: yerel, mutlak ve kısıtlama altında. Kısıtlama altında en iyiyi arama (optimizasyon) ve Lagrange çarpanı yöntemi. Kısmi türevlerin uygulaması ile değişimler hesabına giriş.Uzayda Yüzey ve Hacım EntegralleriUzayda yüzeylerin açık, kapalı ve parametrik fonksiyonlarla gösterilmeleri ve eğrisel koordinatlar. sonsuz küçük yüzey alanları seçeneklerinin birleştirilmiş bir yaklaşımla elde edilmesi. Uzayda küre, koni, paraboloitler gibi temel yüzeylerin tanıtılması ve bunları içeren alanlarla hesaplar.Düzlemde Akı EntegralleriUzayda kapalı yüzeylerle tanımlanan hacımlar; sonsuz küçük hacımların birleştirilmiş yaklaşımla elde edilmesi. Jakobiyan ve sonsuz küçük hacım. Kartezyen, silindir ve küresel koordinatlarla uzaydaki yüzey ve cisimlerde üç katlı entegral hesaplamaları. Uzayda küre, koni, paraboloitler gibi temel yüzeylerle tanımlanan hacımlardan örnekler ve bunları içeren hacım hesapları.Düzlemde Green, Uzayda Stokes ve Green-Gauss TeoremleriVektör alanlarının tanıtılması; vektör alanlarıyla türev ve entegral. Düzlem eğrilerinde entegraller. Entegralin yörüngeye bağlı ve yörüngeden bağımsız olması. Düzlem eğrilerinde birinci ve ikinci Green teoremleri. Düzlemdeki Green teoremlerinin vektörler, rotasyonel ve diverjansla gösterimi.Stokes ve Green-Gauss  teoremleri ve doğanın korunum yasalarıDüzlemdeki Green teoremlerinden uzayda Stokes ve Green – Gauss teoremlerine geçiş. Uzayda Green – Gauss ve Stokes teoremleriyle yüzey ve hacım entegralleri. Diverjans, rotasyonel ve Laplasyen’in anlamı. Uzayda Green – Gauss ve Stokes teoremleriyle doğadan temel korunum denklemlerinin elde edilmesi. Kütle, elektrik yükü ve ısı enerjisinin korunmasında uygulamalar.Dönem Sonu Sınavı\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Çok değişkenli Fonksiyon II: Uygulamalar / Multivariable Calculus II: Applications", 
    "price": 0, 
    "instructors": "Attila Aşkar", 
    "institution_name": [
        "Koç University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/calculus-diferansiyel-hesap", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}