{
    "selfpaced": true, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    Ders çok değişkenli fonksiyonlardaki ikili dizinin birincisidir. Burada çok değişkenli fonksiyonlardaki temel türev ve entegral kavramlarını geliştirmek ve bu konulardaki problemleri çözmekteki temel yöntemleri sunmaktadır. Ders gerçek yaşamdan gelen uygulamaları da tanıtmaya önem veren “içerikli yaklaşımla” tasarlanmıştır.\n\nBölümler\nBölüm 1: Genel Konular ve Düzlemdeki Vektörler\nBölüm 2: Uzayda Vektörler, Doğrular ve Düzlemler; Vektör Fonksiyonları\nBölüm 3: Düzlem Eğrilerinden Hatırlatmalar ve Uzay Eğrileri, İki Değişkenli ve İkinci Derece Fonksiyonlar ve Karşıt Gelen Yüzeyler\nBölüm 4: Özel Yapıdaki İki Değişkenli Olarak Karmaşık Fonksiyonlar, İki Değişkenli Fonksiyonlarda Kısmi Türev ve İki Katlı Entegralin Temel Tanımları; Limit Kavramının Gerekliliği ve Anlatımı\nBölüm 5: Türev Hesaplama Yöntemleri\nBölüm 6: Türev Uygulamaları\nBölüm 7: İki Katlı Entegraller ve Uygulamaları\n-----------\nThe course is the first of the sequence of calculus of multivariable functions. It develops the fundamental concepts of derivatives and integrals of functions of several variables, and the basic tools for doing the relevant calculations. The course is designed with a “content-based” approach, i. e. by solving examples, as many as possible from real life situations. \n\nChapters\nChapters 1:  General Topics and Vectors in the Plane\nChapters 2: Vectors in Space, Lines and Planes; Vector Functions\nChapters 3: Reminders of Plane Curves and Space Curves, Quadratic Functions and Variables, Surfaces\nChapters 4: Special Two Variables Complex Functions, the Basic Definition of Partial Derivatives and Two Storey Integrals in Two Unknown Functions ; Necessity and Details of Limits\nChapters 5: Methods of Derivative Calculations\nChapters 6: Application of Derivatives\nChapters 7:  Two Storey Integrals and Applications\n-----------\nKaynak: Attila Aşkar, “Çok değişkenli fonksiyonlarda türev ve entegral”. Bu kitap dört ciltlik dizinin ikinci cildidir. Dizinin diğer kitapları Cilt 1 “Tek değişkenli fonksiyonlarda türev ve entegral”, Cilt 3: “Doğrusal cebir” ve Cilt 4: “Diferansiyel denklemler” dir.\n\nSource: Attila Aşkar, Calculus of Multivariable Functions, Volume 2 of the set of Vol1: Calculus of Single Variable Functions, Volume 3: Linear Algebra and Volume 4: Differential Equations. All available online starting on January 6, 2014\n\n                                            Syllabus\n                        Genel Konular ve Düzlemdeki VektörlerFonksiyon kavramı: girdi – çıktı, bir değerin diğerine gönderimi, çizit, ve dönüşüm gösterimleri. Çok değişkenli fonksiyonların sınıflandırılması: uzayda eğriler, yüzeyler ve vektör alanları. Düzlemde karteziyen ve dairesel koordinatların, uzayda karteziyen, silindir ve küresel koordinatların tanıtılması. Fonksiyonların açık, kapalı ve parametrelerle gösterilmesi. Vektörler: düzlemde geometriden cebire. Düzlemde toplama, bir sayıyla çarpma, iç çarpım ve vektör çarpımı. Bu işlemlerin üç boyuta genellenmesi ve üçlü vektör çarpımları. Bu kavramların geometrideki anlamları ve uygulamaları. Uzayda doğrular ve düzlemler. Uzayda Vektörler, Doğrular ve Düzlemler; Vektör FonksiyonlarıUzayda eğriler: tek bağımsız ve üç bağımlı değişkenle vektör fonksiyonları. Düzlemdeki temel eğrilerin hatırlatılması ve uzaydaki bazı önemli eğrilerin tanıtılması. Düzlemde yay uzunluğu, eğrilik ile teğet ve dik vektörlerin hatırlatılması. Uzayda yay uzunluğu, teğet, dik ve ikinci dik (binormal) vektörleriyle eğrilik ve burulmanın tanımlanması. Uzaydaki yörüngelerde hız ve ivme.Düzlem Eğrilerinden Hatırlatmalar ve Uzay Eğrileri, İki Değişkenli ve İkinci Derece Fonksiyonlar ve Karşıt Gelen YüzeylerUzayda yüzeyler: iki bağımsız ve tek bağımlı değişkenle tanımlanan sayısal fonksiyonlar. Yüzeylerin anlaşılması ve temel yüzeylerde çizimler: perspektif görünüm, eşit değer eğrileri ve kesitlerin çizimi. İki değişkenli ikinci derece kuvvet fonksiyonlarıyla verilen temel yüzeyler. Silindir yüzeyleri ve dönel yüzeyler. İki değişkenli özel bir yapı olarak karmaşık değerli fonksiyonlar. Mathematica, Mathlab, Ghostview… gibi yazılımlarla bilgisayarda çizimlerden örnekler.Özel Yapıdaki İki Değişkenli Olarak Karmaşık Fonksiyonlar, İki Değişkenli Fonksiyonlarda Kısmi Türev ve İki Katlı Entegralin Temel Tanımları; Limit Kavramının Gerekliliği ve AnlatımıTek değişkenli fonksiyonlarda türev ve entegralin hatırlatılması. Buradaki ana kavramların İki değişkenli fonksiyonlarda “kısmi türev” ve “iki katlı entegral” olarak genellenmesi. Kısmi türev ve iki katlı entegralin geometrideki anlamları. Temel tanımları pekiştiren az sayıda kısmi türev ve iki katlı entegrallerin hesabı. Türev Hesaplama Yöntemleriİki değişkenli sayısal açık fonksiyonlarla tanımlanan yüzeyde teğet düzlem ve diferansiyel. Zincirleme türev yöntemi ve tam türev. Yöne göre türev. Gradyan. Koordinat dönüşümü ve Jakobiyan. Taylor serileri. Kritik noktalar, en büyük ve en küçük değerler. Türev hesaplamalarının üç ve “n” değişkenli fonksiyonlara genellenmesi.Türev Uygulamalarıİki değişkenli sayısal açık fonksiyonlarla tanımlanan yüzeyde teğet düzlem ve diferansiyel. Zincirleme türev yöntemi ve tam türev. Yöne göre türev. Gradyan. Koordinat dönüşümü ve Jakobiyan. Taylor serileri. Kritik noktalar, en büyük ve en küçük değerler. Türev hesaplamalarının üç ve “n” değişkenli fonksiyonlara genellenmesi.İki Katlı Entegraller ve Uygulamalarıİki katlı entegrallerde hesaplama örnekleri. Kartezyen ve dairesel koordinatlarda hesaplamalar, uygulamalardan örnekler.Dönem Sonu Sınavı (Final Exam) \n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Çok değişkenli Fonksiyon I: Kavramlar / Multivariable Calculus I:  Concepts", 
    "price": 0, 
    "instructors": "Attila Aşkar", 
    "institution_name": [
        "Koç University"
    ], 
    "commitment": "6-9 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/hesap-calculus-dersi", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}