{
    "selfpaced": false, 
    "topic_name": [
        "Calculus & Mathematical Analysis"
    ], 
    "description": "\n\n                    \n                    \n                    التفاضل والتكامل 3 هو جزء من سلسلة التفاضل والتكامل. سيغطي هذا المساق العديد من المواضيع وهي الاقترانات الأسية والاقترانات اللوغاريتمية وتطبيقاتها.\r\nتعد سلسلة التفاضل والتكامل مقدمة لجميع الطلبة من التخصصات التي تتطلب دراسة الرياضيات مثل إدارة الأعمال والهندسة والعلوم وغيرها من التخصصات. تقدم سلسلة مساقات التفاضل والتكامل شرحاً مبسطاً لأهم المفاهيم والمهارات والتعميمات الأساسية الخاصة بالاقترانات والعمليات عليها. كما تقدم شرحا مبسطا ومدعّما بالأمثلة والتكنولوجيا والرسم التوضيحي للمفاهيم والمهارات والتعميمات الخاصة بالتفاضل والتكامل. تتناول السلسلة شرحاً مفصلاً ومبسطاً لطيْف واسع من الاقترانات من مثل: الاقتران الخطي، والاقتران التربيعي، وكثيرات الحدود، والاقترانات النسبية، واقتران أكبر عدد صحيح، واقتران القيمة المطلقة وغيرها من الاقترنات. وقد استخدمت برمجية جيوجبرا كوسيلة تعليمية لرسم الاقترنات وتوضيح سلوكها. كما استخدمت البرمجية كوسيلة محاكاة لتمثيل الأفكار الرياضية بصور متعددة. تتناول هذه السلسلة شرحا للعديد من الموضوعات من مثل: الفترات، النهايات، الاتصال، الاشتقاق وقواعده، التكامل وتعريفه، طرق التكامل، التكامل المحدود، تطبيقات التفاضل، القيم القصوى، حل المسائل العملية، حساب المساحة، حساب الحجم الدوراني. كما تتناول أيضاً العديد من الأمثلة التوضيحية والتمارين والمسائل التي تربط بين المفهوم الرياضي والحياة العملية. توفر هذه السلسلة العديد من أوراق العمل التي تساعد المتعلم على التدرب على المفاهيم والمهارات والنظريات التي يتم طرحها في الفيديوهات الشارحة.\r\n \n\n                                    ", 
    "end_date": "2016-08-02T00:00:00Z", 
    "title": "التفاضل والتكامل 3", 
    "price": 0, 
    "instructors": "Reem Qawasma, Mahmoud Youssef Sayel and Mufid Ahmed Abu Musa", 
    "institution_name": [
        "Arab Open University"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.edraak.org/course/course-v1%3AAOU%2BCALC3%2BT2_2016/enroll", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Edraak"
    ], 
    "start_date": "2016-07-05T00:00:00Z"
}