{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Join 4800++ students and start learning amazing world of Beauty retouching!</strong></p>\n\n<p><em>Latest: New bonus lecture added! Learn Dodge and Burn technique!</em><br></p>\n\n\n\n\n\n\n\n<p>This course is designed to give you all necessary tips and tools to start making great portraits retouching. You may be completely beginner in Adobe Photoshop – we will discuss all tools and commands you need to know without any excessive information. If you are already familiar with Photoshop, but you are not sure how to use it to retouch portraits, this course will give you all clues you need.</p>\n\n\n\n\n\n\n\n<p>You may watch the entire course step by step, or you may watch lectures in any order. I built this course so that you can watch lectures independently from each other, starting with those you need the most. You may quickly return to any lecture in case you forgot something and would like to refresh it in your memory.</p>\n\n\n\n\n\n\n\n<p>After you finish this course you will be able to retouch portraits in Photoshop and start selling your photos to your clients. Don’t forget to do a lot of practice and master your skills. There will be still a lot to learn. This course does not cover more advanced topics. But it is better to get information gradually. Once you achieve the best result with techniques I gave you, you will be ready to move on, and we will continue this wonderful journey of beauty retouch with more advanced course.</p>", 
    "end_date": null, 
    "title": "Adobe Photoshop Beauty Retouching for Beginners", 
    "price": "25.00", 
    "instructors": "Diana Kot", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/591202_3710.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-beauty-retouch-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-23T18:44:49Z"
}