{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t        More than 1700 students have enrolled and have left over 45 5-star, rave reviews.  </p>    <p>After taking my photography course, your kids and perhaps even their friends will be <strong>begging </strong>you to take their portraits too!  </p>  <p>  \t What You'll Learn:  </p>  <ul>  \t<li>How to position your subject indoors and outdoors for the best lighting. </li>  \t<li> Posing ideas for women, men, teens and younger children. </li>  \t<li> How to choose the right camera settings for more attractive, professional looking portraits. </li>  \t<li> The best types of lenses for portrait photography (for DSLR users). </li>  \t<li> Background ideas </li>  </ul>  <p>  \t This course will show you how to use the available light, without special lighting set-ups, to take amazing portraits of your kids. Outdoors, you'll learn where to position your subject and yourself in relation to the sun for the best lighting. You'll also get tips on taking indoor portraits without using your flash.  </p>  <p>  \tYou'll learn a basic formula for your camera settings  that will help you take better portraits. You'll also get a general  understanding of exposure and how aperture, shutter speed and ISO work  together.  </p>  <p>  \tWe've all taken those photos where the background looks great but your subject's face is so dark you can barely recognize them, or maybe you want to know how pros get the background to look all blurry in portraits. Many people are intimidated by using their DSLR or compact camera's manual settings and just don't know where to start. That Auto Mode is so tempting and easy. But getting out of the Auto Mode will open the door to more creative, professional looking photos of your kids.  </p>  <p>  \t        What you <em>won't get</em> is a lot of super technical stuff. <strong>This is a non-technical photography course designed to get you up and going quickly. It's created for parents and others who want to go beyond taking ordinary snapshots and learn how to take better portraits and family photos without a lot of equipment. </strong>  </p>  <p>  \t        You can go a step further and watch over my shoulder as I import and edit photos in Adobe Photoshop Lightroom. Lightroom is a popular, relatively inexpensive software program designed specifically for photographers. If you enjoy taking photos, you may want to consider this software. You can get a free trial at Adobe.  </p>  <p>  \t <strong>With my course you get:</strong>  </p>  <ul>  \t<li>Over <strong>1700 happy students </strong>have already taken this course</li>  \t<li>Over three dozen <strong>glowing, 5-star Reviews</strong></li>  \t<li><strong>Unlimited lifetime course acces</strong><strong>s at no extra cost</strong></li>  \t<li><strong>All</strong> future additional lectures and supplementary material <strong>included for free, always</strong></li>  \t<li>Unconditional, no questions asked, Udemy <strong>30-day money-back guarantee</strong></li>  </ul>  <p>  \t <strong>Your children are growing fast.</strong> You don't want another day to go by without capturing memorable photos of them, not just quick smartphone snapshots. <strong></strong>  </p>", 
    "end_date": null, 
    "title": "Beginning Family Portrait Photography: Shoot Like a Pro", 
    "price": "20.00", 
    "instructors": "Valerie Goettsch", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/291896_da4c_4.jpg", 
    "course_url": "https://www.udemy.com/taking-family-portraits-using-natural-light/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-01T19:24:41Z"
}