{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Ever hear the saying &quot;Don&#039;t work with kids and animals&quot;?</strong></p><p style=\"\">There is a reason for that saying, because when you first attempt to work with kids, they can be very&nbsp;difficult&nbsp;to photograph. They never sit still, don&#039;t want to do what you suggest, have temper tantrums and how do you get them to smile properly - not that fake smile?</p><p style=\"\"><strong style=\"\">Photographing Kids can be Frustrating</strong></p><p style=\"\">Are you frustrated with the average-looking kids photos you are getting with you digital SLR camera? Do you have problems controlling kids, getting them to do what you want &amp; keeping their attention throughout photo shoot?</p>    <p style=\"\"><p style=\"\"><em style=\"\">&quot;Where is the best place to shoot kids, what  camera settings are best &amp; how do I edit these images so that they look  awesome?&quot; If you have ever asked any of these questions then this Kids Photography:  Mastering Photography for  Kids course is definitely for you.</em></p>&lt;/p&gt;    <p style=\"\"></p><h5 style=\"\">Brent will teach you how to photograph kids in a natural &amp; fun way - creating the most amazing, visually stunning images every single time.</h5> His portrait photography business depends on capturing great images of kids on every shoot.<p style=\"\"></p>    <p style=\"\"><strong style=\"\">Brents&#039; Unique Photography System</strong></p><p style=\"\">Come along with him on real photo shoots where he shows you what works and what doesn&#039;t when it comes to photographing children. Use his unique system to create a playful environment where it&#039;s really easy to capture great child photos.</p>    <p style=\"\"><strong style=\"\">Short &amp; Sweet Videos Lessons</strong></p><p style=\"\">Included are 23 short videos (average length 4-5 minutes), quiz&#039;s and original images that you can edit step by step with Brent.</p>    <p style=\"\"><strong style=\"\">Easy Self-Paced Learning</strong></p><p style=\"\"><p style=\"\">Take this Kids Photography: Mastering Photography for Kids  course at your own pace, come back and re-watch sections if you like, or watch  the entire course in one-go. It&#039;s recommended that you watch one section at a  time and then go out and practice what you have learned.</p>&lt;/p&gt;    <p style=\"\"><span style=\"\"><strong style=\"\">If you have ever wanted to know the secrets to capturing amazing kids images, then this course is for you. Brent reveals all of his techniques here - nothing has been left out.</strong></span><br style=\"\">  </p>    <p style=\"\"><span style=\"\">Recommend taking his <a href=\"http://www.udemy.com/essential-photography-skills-beginner-digital-slr-training\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Essential Photography Skills Course</a><span style=\"\">&nbsp;(Introduction to digital SLR photography) before taking this course, unless you already know the basics of how your camera works.</span></span></p>    <p style=\"\"><span style=\"\"><strong style=\"\">Who is Brent?</strong></span></p><p style=\"\"><span style=\"\">Brent is an award winning photographer who runs a very successful portrait photography studio near the beach in Australia, that focus&#039;s on kids &amp; family photography.</span></p><p style=\"\"><p style=\"\">Take this ultimate Photography for Kids course right now  and master your Kids  Photography skills.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "How to Photograph Kids - Naturally", 
    "price": "50.00", 
    "instructors": "Brent Mail", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40429_3c55_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-photograph-kids-naturally/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-07T01:01:44Z"
}