{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Here&#039;s what you&#039;ll learn in this video series</strong></p>  <ul style=\"\">  <li style=\"\">Learn how you can <strong style=\"\">save money and take amazing photos</strong><em style=\"\">&nbsp;</em>with off-camera flash&mdash;the new, easy, inexpensive, portable way to take professional photos without expensive studio gear!</li>  <li style=\"\">Discover the <strong style=\"\">four crucial, inexpensive pieces of equipment</strong> you need to get the flash off your camera (and don&#039;t worry, if you don&#039;t have a flash yet, I&#039;ll tell you which kind to buy to avoid over-spending)</li>  <li style=\"\">Watch me go through <strong style=\"\">4 photo shoots with live models</strong>, revealing all my off-camera flash secrets.</li>  <li style=\"\">Learn <strong style=\"\">advanced techniques</strong> using multiple flashes, colored filters, reflectors, and other optional equipment, for creating photos that make viewers say &quot;Wow!&quot;</li>  <li style=\"\">Watch over my shoulder as I edit the photos in <strong style=\"\">post-production</strong>, adjusting them to look their best.</li>  <li style=\"\"><strong style=\"\">Learn from my mistakes!</strong> I show you the reality of each shoot, including what goes right and what goes wrong and how to fix it.</li>  <li style=\"\">Discover the <strong style=\"\">foolproof 4-Step-Formula</strong> for choosing the perfect ISO, Shutter, and Aperture for your flash photos. Never wonder what to do in &quot;M&quot; mode again!</li>  </ul>  <p style=\"\"><strong style=\"\">Plus you get two additional bonus videos if you sign up right now</strong></p>  <ul style=\"\">  <li style=\"\">Outdoor Portriaits Using a Reflector</li>  <li style=\"\">The Glam-Blur Technique for Portrait Retouching</li>  </ul>  <p style=\"\">These bonuses are offered for a limited time and can&#039;t be guaranteed if you wait until later to register.</p>  <p style=\"\">RECENT CUSTOMER COMMENTS</p>  <p style=\"\"><em style=\"\">&quot;Your videos are fantastic&mdash;<strong style=\"\">the perfect balance between technical detail and simple explanation</strong>. I especially appreciate your shopping tips and reviews of the various products that are available, as that can be pretty overwhelming. Thanks so much!&quot; &mdash; </em>Beth M., Olympia Washington</p>  <p style=\"\"><em style=\"\">&quot;I&#039;ve been a pro landscape photographer for around 5 years now and am moving into the portrait and wedding market. I soon realized that my knowledge of flash and how to best utilise it was pretty none existant. Until i came accross your videos! <strong style=\"\">I&#039;ve learned more in 4 or 5 videos than all the photography books i&#039;ve read.</strong> Thanks, Phil, for advancing my photography in a matter of minutes which would normally have taken weeks!&quot; &mdash;</em>Martin Sanderson, Carlisle, England</p>  <p style=\"\"><em style=\"\">&quot;I just finished watching your speedlight class and I had to tell you how much I enjoyed it! As an instructor, I see a lot of this sort of material, and so much of it misses the mark. But yours offers <strong style=\"\">useful, real-world information without the useful fluff</strong>. It&#039;s great to see such a clear and concise discussion. Home run, Phil! &mdash;&nbsp;</em>Michael Corsentino&mdash;Award Winning Photographer and Author of the Canon Speedlite Digital Field Guide</p>", 
    "end_date": null, 
    "title": "How to Shoot Portraits on a Budget with Off-Camera Flash", 
    "price": "45.00", 
    "instructors": "Phil Steele", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20725_f6f4_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-shoot-portraits-on-a-budget-with-off-camera-flash/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-05T23:29:28Z"
}