{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Who Am I?</strong></p>\n\n<p>Hi, my name is Mark Timberlake and I have been a commercial photographer for over 6 years and in this course I will share the simple techniques that commercial photographers use in demanding, high pressure environments, to get portraits that tell a story using the light they have available… fast!</p>\n\n<p><strong class=\"redactor-inline-converted\">Beautiful Portraits</strong></p>\n\n<p>We are going to show you how to take beautiful portraits just using the light available, so it does not matter where you are and no matter what the conditions are, you will be able to take compelling images that will wow your family and friends.</p><p><strong>Use Natural &amp; Artificial Light</strong></p>\n\n\n\n\n\n<p>That is both natural light and artificial light outdoors and indoors, so you will learn how to use any light source in your photography and still get interesting and powerful images.</p>\n\n\n\n\n\n<p>Once you have been through this course you will be able to create compelling and powerful portraits quickly and easily and will understand why you are getting the images that you are capturing and why they work so well.</p>\n\n<p><strong class=\"redactor-inline-converted\">No Mumbo Jumbo</strong></p>\n\n\n\n\n\n<p>All of this with as little technical mumbo jumbo as is humanly possible, you can take this course with any camera, so it does not matter if you have a mobile phone, a compact camera or DSLR, this course will help you get the best out of your camera.</p>\n\n<p><strong class=\"redactor-inline-converted\">Elements Covered:</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Here are the elements that will be covered in the course:<br>Learn what equipment you will need for this course.<br>Understand the difference between hard light and soft light.<br>Learn how to use soft light outdoors and soft light indoors.<br>You will also learn how to use hard light outdoors and soft light indoors.<br>We will cover how to choose your backgrounds and how to pose your subjects.</p>\n\n<p>All of this in as simple language as possible!</p>\n\n<p><strong class=\"redactor-inline-converted\">Enroll Now</strong></p>\n\n\n\n<p>So enroll now and learn how to take compelling and engaging portraits using just your camera and the light available in your environment and amaze your friends and family with your new found skills!</p>", 
    "end_date": null, 
    "title": "Natural Light Portrait Photography With Any Camera", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/837414_0c2a.jpg", 
    "course_url": "https://www.udemy.com/natural-light-portrait-photography-with-any-camera/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-02T11:31:58Z"
}