{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t         This course was created for all newborn photography enthusiasts and in it I share the methodology that I have built in 8 years of expertise and over 2000 sessions. Through <strong>25 classes</strong>, and <strong>more than 4 hours of content</strong>, you will realize all the details of the strategy I use to develop my photography sessions. <strong>This course is subtitled to English.</strong>  </p>  <p>  \t<strong>WHY SHOULD I SIGN UP?</strong>  </p>  <p>  \t         If you sign up for this course, you will benefit from all the processes my experience has led me to create and you will be able to accelerate your learning process and to avoid many of the most common obstacles and frustrations.  </p>  <p>  \t<strong>ALL YOU NEED TO KNOW</strong>  </p>  <ul>  \t<li><strong>Before the session</strong>: client contact, studio and equipment preparation, hygiene and safety care, session plan;</li>  \t<li><strong>During the session</strong>: calming the baby, posing preparation, session sequences;</li>  \t<li><strong>After the session</strong>: image post-production, delivery strategy.</li>  </ul>  <p>  \t<strong>VARIETY OF CONTENT</strong>  </p>  <p>  \t        These contents are presented throughout a sequence of videos recorded during one of the latest workshops I had the opportunity of organize and every class is complemented with informative slides.  </p>", 
    "end_date": null, 
    "title": "Newborn Photography Secrets", 
    "price": "30.00", 
    "instructors": "José Cruz", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255664_057e_2.jpg", 
    "course_url": "https://www.udemy.com/newborn-photography-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-04T14:38:18Z"
}