{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em>LATEST: Course Update - February 2016</em></p><p>Photographing people in love has been a passion of mine since getting started in the business of photography. The Outdoor Engagement \"Love Story\" Portrait is my favorite portrait session and can also be a lucrative part of your business. The same principals also apply to doing \"Lifestyle\" portraits.</p><p>This course covers my approach to documenting this important part of their lives. While too many photographers think of an Engagement Portrait as a single portrait from a session, I think of it as a \"Love Story\". It is a story of romance at a special time and needs to be told in a storybook fashion.</p><p>This course reveals the techniques that I used in the many years of my photography career. I would like to share these techniques with you, so that you may be able to not only enjoy the passion of photography but also earn a good income as you do something you truly love.</p><p>If photographing people is your passion, this style of portraiture can be a huge market for you. Not only does this course cover the photography aspects that helps you build the foundation for creating beautiful portraits but also includes a \"Bonus Section\" on how you can properly sell your portraits.</p><p>With over 5 hours of instruction, here's some of what is covered:</p><p>Course Introduction - An introduction to what the course will cover along with a detailed slide show of many engagement portrait sessions that shows the variety and some of the possibilities you can implement when planning your session.</p><p>Why the Engagement \"Love Story\" Portrait Session - Several good reasons why making an engagement portrait a \"Love Story\" and how this can benefit your business. I also reveal several different ways for you to offer this session to your top clients.</p><p>Show Passion in Posing Techniques - Part 1 - There are several things you can do to add and show passion in your photographs. Learn how posing techniques can be refined to add that romantic touch.</p><p>Show Passion in Posing Techniques - Part 2 - Part 2 continues with more examples on how to add even more passion when couple is kissing. A close-up technique is also revealed.</p><p>Use Fun &amp; Variety to Tell Your Story - Part 1 - Learn how you can use variety to not only make the engagement portrait an adventure resulting in a fun experience for the couple but also how you can create a story of beautiful images that they will end up wanting just about all the images that you present to them.</p><p>Fun &amp; Variety in Using Special Techniques - Part 2 - Here I show several more techniques you can use to set you apart from your competition. One of these techniques is known and used by top professional photographers.</p><p>Fun &amp; Variety with Different Focal Length Lens Techniques - Part 3 - See the different effects you can achieve using different focal lengths and lenses, plus important information in techniques on focusing that I use to get sharp subjects while getting nice background blur.</p><p>Fun &amp; Variety When the Sun Goes Down - Part 4 - When the sun sets, don't put your camera down. Here we look at several ways you can add even more variety for an exciting addition to their engagement story.</p><p>Impact, the Number 1 Element in Outstanding Photography - Part 1 - Learn several ways you can add \"impact\" to dramatically make your photos stand out from the competition.</p><p>Impact, Using B&amp;W Infrared Photography - Part 2 - Black &amp; white infrared photography is a sure way of adding impact while creating images having surreal effects. Another way to add dramatic impact is with post processing. In this segment, I discuss how using both of these methods can drastically make your images stand out.</p><p>Best Use of Lighting - Part 1 - If there were only 1 lighting accessory that I could use, this would be it.</p><p>The Art of Posing Without Posing - Using this technique, you'll learn of ways to take many images in a short amount of time.</p><p>Finding The Light - Look for This First - Part 1 - As soon as you arrive at your outdoor destination, you need to know how to find the best lighting for the time of day you are shooting. This segment starts with what I look for and how to enhance the light even more.</p><p>Camera Settings Part 1 - Save Time &amp; Get Sharp - Here we start by taking a look at the one setting that can save you a bunch of time when getting the images ready for post production. Also discussed are the \"Guidelines\" on shutter settings that can help get you sharper images.</p><p>Telephoto Zoom Lens of Choice - In this segment I discuss my favorite lens for engagement portraits and how to get the most from this lens.</p><p>Budget Lens of Choice - Anyone on a tight budget should take a look at this lens. Then, I end this segment with a look at what I think is the best prime lens to use for outdoor engagement \"Love Story\" portraits.</p><p>Final Touches &amp; Enhancement - What are some of the different enhancing techniques used by professional photographers in producing their images? Here I show you several techniques that you can also use to help improve your final images and take them to the professional level.</p><p>Preparing For The Sales Process - Preparing for the sales process begins with having the belief in yourself that you can sell. Learning proper sales techniques can make the difference between a photo enthusiast that remains a hobbyist or someone being able to derive an income from their photography.</p><p>Bonus Section - Portrait Selling Techniques</p><p>Bonus Section - Step by Step Sales Process</p><p>And much more. Enroll in this course today, it could possibly move you from hobbyist status to pro level photography and earnings.</p>", 
    "end_date": null, 
    "title": "Outdoor Engagement \"Love Story\" Portrait Secrets", 
    "price": "25.00", 
    "instructors": "Photofonz Media", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617732_f472_2.jpg", 
    "course_url": "https://www.udemy.com/outdoor-engagement-love-story-portrait-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T03:24:40Z"
}