{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Der exklusive Blick hinter die Kulissen der Profi-Fotostudios! DomQuichotte zeigt Ihnen, wie Sie bereits beim Fotoshoot Ihr Model perfekt inszenieren, vorteilhaftes Licht setzen sowie Make-up und Styling aufeinander abstimmen. Lernen Sie die menschliche Anatomie richtig kennen und erfahren Sie, welche Bereiche bei der High-End-Retusche mit besonderen Techniken bearbeitet werden. Profitieren Sie von Photoshop-Tricks der Extraklasse, mit denen Sie Gesicht, Körper, Kleidung und Haare bis in die Spitzen verfeinern. Dieses Training schärft den Blick für das Schöne im Menschen und hilft Ihnen, Ihre Fotos zu veredeln.</p><p>- So inszenieren Sie Körper, Gesicht und Kleidung wie ein Profifotograf</p><p>- Retuschetechniken vom Feinsten mit »Mr. Photoshop« DomQuichotte</p><p>- Drei Komplettworkshops: Beauty-Porträt, Fashion-Aufnahme, Editorial-Shoot</p><p>- Geeignet für Photoshop-Versionen ab CS6 – auch für erfahrene Fotografen!</p><p>DomQuichotte arbeitet als Digital Artist, Retoucher und Art Director und produziert für »FX-Ray« professionelle Video-Tutorials. Die Traumfabrik Hollywood kennt er aus erster Hand: Einige Jahre hat der Photoshop-Künstler für renommierte Design-Agenturen und Fotografen in Los Angeles gearbeitet und kennt die Profi-Tricks der Retouching-Agenturen.</p>", 
    "end_date": null, 
    "title": "Perfekte Schönheit – High-end-Retusche mit Photoshop & Co.", 
    "price": "50.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535346_6197.jpg", 
    "course_url": "https://www.udemy.com/perfekte-schoenheit-styling-make-up-high-end-retusche/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T18:15:19Z"
}