{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong></strong><strong>Photographer That Wants To Start A Business</strong></p><p>Are you a photographer that wants to build a home based portrait photography studio and start your own home based business?</p><p><strong>Start Your Own Photography Business</strong></p><p>Are you ready to to take your photography to the next level?</p><p>Maybe you want to earn some additional income with your own studio?</p><p>Do you want to know how to create a home based studio on a very small budget?</p><p><strong>Home Based Studio:</strong></p><p>Studio photography is a great way to earn additional income.</p><p>A home based studio allows you to set up fast and with very low cost!</p><p>But how do you set up a photography studio on a very small budget?</p><p><strong>Equipment Choices:</strong></p><p>Buying the wrong equipment for the wrong room can be very expensive.</p><p>Knowing what to buy saves you time and money!</p><p><strong>What You Will Learn:</strong></p><ul><li>In this course you will learn how to set up a studio and how to choose a suitable room.</li><li>What equipment you need to buy on a tight budget.</li><li>Some simple lighting setups for portraiture that will get you taking good images fast.</li><li>Camera purchasing decisions.</li><li>Lens choices for portraiture.</li><li>What is a good budget flash kit to get you started.</li><li>Lighting terminology.</li></ul><p><strong>Who Am I:</strong></p><p>I am commercial photographer that has ran his own photography business from a small home based studio for over 5 years.</p><p>In this course I will share all the shortcuts and knowledge I have gained from my own experiences and mistakes so that you can start your own studio simply and easily.</p><p>I will also show you how to do this all on a budget, where to spend your money and where to save your money!</p><p><strong>100% Money Back Guarantee:</strong></p><p>Before we go any further, I do not want you to be disappointed in the course.</p><p>If you are unhappy with the course for any reason whatsoever, you can claim a full refund - no questions asked.</p><p><strong>Join Me On The Other Side:</strong> </p><p>So join me on the other side and learn how to set up your own home based photography studio on a budget and start your own business!</p>", 
    "end_date": null, 
    "title": "Photography - Build A Home Based Studio Business On A Budget", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563782_4321_3.jpg", 
    "course_url": "https://www.udemy.com/home-based-photography-studio-start-your-own-business/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T16:12:45Z"
}