{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong></strong><strong>Photography - Classic Portrait Photography</strong></p><p>Learn the classic studio lighting photography styles and skills that a professional portrait photographer uses. </p><p><strong>Portrait Photography:</strong></p><p>Do you want to take beautiful images of people?</p><p>Portrait photography is one of least understand disciplines in photography…</p><p>Because most photographers have never been taught the basics...</p><p><strong>Good Portrait Photography:</strong></p><p>Good portraiture is as much science as it is an art form!</p><p>Once you understand a few simple principles you will be able to take classic beautiful portraits of your subjects!</p><p>These principles will move you away from amatuer portraiture and move you towards professional portraiture where you will understand how lighting patterns work and what the classic lighting conventions are.</p><p><strong>State Of The Art Virtual Studio:</strong></p><p>This course was created using a virtual photography studio.</p><p>All elements are designed to be simple and easy to visually comprehend and understand using a virtual 3d environment.</p><p>You will instantly be able to see the lighting patterns we are teaching and how the lights create those patterns.</p><p>All the virtual studio sets come with PDF downloads so you can set your own lighting to match the lesson sets!</p><p><strong>What You Will Learn:</strong></p><p>In this course you will learn the basic lighting techniques that professional portrait photographers use and the basic equipment required.</p><p>You will learn the difference between a soft light source and a hard light source and how that affects your images.</p><p>You will learn the classic lighting patterns professional portrait photographers use and the correct lighting terminology for portraiture.</p><p>You will learn how to create beautiful yet simple portraits with simple flash photography on a tight budget.</p><p>We will also teach you how to prepare your subjects, how to pose their bodies and how to pose their faces.</p><p>We will also discuss the basics of choosing a lens for portraiture.</p><p><strong>Full 100% Money Back Guarantee:</strong></p><p>Before we go any further, let me just say, I don't want you to be disappointed.</p><p>If you don't like the course for any reason, you can request a full refund in the first 30 days, no questions asked.</p><p><strong>Join Me:</strong></p><p>So join me on the other side and learn how to create simple yet beautiful portraits with your DSLR camera...</p>", 
    "end_date": null, 
    "title": "Photography - Classic Portrait Photography ", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563740_d5d5_3.jpg", 
    "course_url": "https://www.udemy.com/portrait-photography-classic-studio-lighting-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T15:18:43Z"
}