{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>This is an ongoing photography course: New work and assignments will be added to this workshop as it becomes available or as needed for explanations. If you have something you want to see, or a lighting idea that you would want me to explore, let me know.</strong><br></p><p><strong>(Two New courses added May, 2013. Location Portraiture)</strong></p><p>Once purchased, you may access the class and lectures whenever you want. There is no limit or time frame to access.&nbsp;</p><p>This is a class that can be started at any time, by nearly any level of photographer.&nbsp;</p><p>This course is created for the beginning to early intermediate photographer who wants to use simple gear to make much better portraits. We will examine fresh ways to use natural light, augmented natural light, strobes with both natural light and as the main lights only and how to create our own reality with only a single speedlight.&nbsp;<br></p><p><strong>Over Seven and a half full hours of video tutorial on creative portrait photography:</strong> shooting, explaining, shooting and Photoshopping. <strong>Fourteen + downloadable PSD files</strong> in layers to see exactly what we did with the Photoshop work... and use them to understand the Photoshop videos you are watching.<br><br>With over <strong>three and a half hours of bonus material</strong>, including class webinars, this course continues to grow. All members are welcome to our webinars that feature ideas, Photoshop tips, lighting schemes and more.&nbsp;</p><p>We show the setup and how the image is put together, adding fill cards and additional tools as necessary to make the images WE want to see.</p><p>Follow along as I set the lights, find the exposure, work with the models and build the image to what I want it to be.&nbsp;</p><p>Understanding how to use light to make the portraits you want means you can make creative portraits at almost any time you want.</p><p>Some of the things you will learn are:</p><p></p><ul><li><span>Using the small flash for lighting portraits</span></li><li><span>How to make traditional &#039;Beauty&quot; portraits</span></li><li><span>Using a single light to produce extraordinary results</span></li><li><span>Working with models and subjects</span></li><li><span>How to blend ambient daylight with your strobes - and do it easily</span></li><li><span>Using modifiers like umbrellas and softboxes and knowing which you want to use</span></li><li><span>Adding strobe to bring the subject into a very contrasty situation</span></li><li><span>Adding contrast with a wink of strobe in very flat lighting</span></li><li><span>Creating your own reality with lighting</span></li><li><span>Methods for making the most beautiful natural light headshots you can</span></li></ul><p></p><p>In addition we show the post production of the images in Photoshop so you can learn to use some basic, and yet very useful tools in post to make the shots pop even more. We include the PSD files in layers for you do download and view as we are doing the Photoshop demonstrations in the videos.</p><p></p><ul><li><span>Learn how to add small amounts of &quot;light&quot; to an image</span></li><li><span>Simple moves with the Curves Adjustment can make so much difference</span></li><li><span>How to simply retouch faces to eliminate blemishes</span></li><li><span>Using layers for more control</span></li><li><span>Adding depth with contrast and attention to detail</span></li></ul>There will be several scheduled live sessions to discuss your images, and to answer any questions you may have. In addition, there will be additional shoots added one per month until 12/31/2012.<p></p><p>If you are familiar with your camera, and would like to be able to make better portraits without spending a ton of money on gear, check out this set portrait photography tutorials.</p>  ", 
    "end_date": null, 
    "title": "Portrait Photography with Simple Gear", 
    "price": "30.00", 
    "instructors": "Don Giannatti", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23887_a82a_4.jpg", 
    "course_url": "https://www.udemy.com/portrait-photography-with-simple-gear/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-30T15:10:15Z"
}