{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">Do the other photographers in your area charge really low prices?</em></strong><br style=\"\"></p><p style=\"\"><strong style=\"\"><em style=\"\">Are there dozens of new photographers starting businesses in your area every month?</em></strong></p><p style=\"\"><strong style=\"\"><em style=\"\">Do you struggle to get your clients focused on your art instead of on price?</em></strong></p><p style=\"\">In a world where every other person you meet is a professional photographer, it's harder than ever to earn a decent income with photography.</p><p style=\"\">Many photographers struggle to compete, and as a result, end up dropping their prices to poverty-level wages.</p><p style=\"\"><strong style=\"\"><em style=\"\">It doesn't have to be this way!</em></strong></p><p style=\"\">I've done the research. I've incorporated my years of corporate sales and business experience into the photography world. And I've painstakingly tested pricing and sales methods over the course of dozens of actual portrait sessions.</p><p style=\"\">The result is the Portrait Photography Sales System that you'll learn in this course.</p><p style=\"\">I'll hold your hand and lead you step-by-step through the entire sales process, including:</p><ul style=\"\"><li style=\"\">building an effective and profitable price list</li><li style=\"\">what products to offer - and what products to ditch</li><li style=\"\">what to say when the client first calls or emails you</li><li style=\"\">how to run a pre-portrait consultation that will result in big sales - before you've taken a single picture!</li><li style=\"\">how to shoot for the big order</li><li style=\"\">running an efficient and effective sales session</li></ul><div style=\"\">There are NO aggressive sales techniques in this system - you'll sell big by building an emotional connection between your client and your art.</div><div style=\"\">Will you make $1,500 on every shoot? Maybe yes, maybe no - a lot of it depends on where you live and the quality of your photography. But if you follow the steps outlined in the course you'll be on your way to making the most money you possibly can with your portrait photography business.</div><div style=\"\"><strong style=\"\">Here's what some students have said about my other photography business courses:</strong></div><div style=\"\"><em style=\"\"><strong style=\"\">The best explanation of pricing ever!!!!!</strong></em></div><div style=\"\"><em style=\"\"><strong style=\"\">Excellent! After several years of wedding photography, this really exposed my weaknesses in marketing of my wares and made my business side a lot simpler!</strong></em></div><div style=\"\"><em style=\"\"><strong style=\"\">Excellent, valuable information! Laurence adds clarity to the very difficult topic of wedding package pricing. The class is broken into very manageable pieces, so you always know exactly what it is you are dealing with. The explanations are clear and precise, and full of real world examples. Highly recommended!</strong></em></div><div style=\"\"><br style=\"\"></div>", 
    "end_date": null, 
    "title": "Pro Photography: Make the Most of Every Portrait Session", 
    "price": "25.00", 
    "instructors": "Laurence Kim", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595878_494f.jpg", 
    "course_url": "https://www.udemy.com/pro-photography-make-the-most-of-every-portrait-session/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T12:45:28Z"
}