{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t                                                  Acclaimed photographer <strong style=\"\">Jason Cole</strong> takes you on a journey into the world of the <strong style=\"\">Professional Glamour &amp; Magazine Photographer</strong>.  </p>  <p style=\"\">  \t                                                  Jason Cole has photographed models for some of the biggest and most popular Glamour Magazines in Australia and the world. Jason now brings his extensive experience to this instructional course highlighting professional techniques, equipment and location considerations <strong style=\"\">never before captured in a course like this</strong>.  </p>  <p style=\"\">  \t                        This course <strong style=\"\">contains over 2 hrs</strong> of behind-the-scenes live video... showing you every aspect of photographing models so you can build a portfolio or sell your work to magazines.  </p>  <hr style=\"\">  <strong style=\"\">Warning!</strong>  <p style=\"\">  \t                                    This course is not like any other photography course you have seen before. <strong style=\"\">It&#039;s definitely not</strong> just a bunch of PowerPoint slides with bullet points and a voiceover!  </p>  <p style=\"\">  \t                                 All the lessons are shot live... <strong style=\"\">right on location with real models</strong> using multiple camera angles and a full production team.  </p>  <p style=\"\">  \t                                 It&#039;s like being right there at the photo shoot, looking over Jason&#039;s shoulder as he demonstrates exactly <strong style=\"\">how to achieve the photographic results</strong> that publishers want for their magazines.  </p>  <p style=\"\">  \t                              This is your ticket to see the tips and techniques that <strong style=\"\">only industry insiders would ever see</strong>... allowing you to progress from taking your usual average photos... to photos that are in demand and can be <strong style=\"\">sold to magazine publishers</strong> all over the world.  </p>  <p style=\"\">  \t                     Use the knowledge in this course to <strong style=\"\">start making money with your passion</strong>... whilst having fun at the same time.  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\">Topics covered include:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Equipment that professional photographers use and why they use it.</li>  \t<li style=\"\"><strong style=\"\">Shoot #1: Theme shoot based in a workshop garage.</strong></li>  \t<li style=\"\">Shoot #2: Beach scene with harsh bright sunlight.</li>  \t<li style=\"\"><strong style=\"\">Shoot #3: Beach scene with overcast lighting.</strong></li>  \t<li style=\"\">Shoot #4: Fashion studio shoot.</li>  \t<li style=\"\"><strong style=\"\">Tips about shooting models from his vast experience in this field.</strong></li>  </ul>  <p style=\"\">  \t                                                  This course was <strong style=\"\">six months in the making</strong>, using professional lighting with some of <strong style=\"\">Australia&#039;s hottest models</strong>.  </p>  <p style=\"\">  \t                                                  Creative multi-angle videography and <strong style=\"\">magazine grade photography</strong> makes this a must have visual and informational feast.  </p>  <p style=\"\">  \t<strong style=\"\">You will learn how to:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Prepare your model for your photo shoot.</li>  \t<li style=\"\"><strong style=\"\">Correct use of main lighting, rim lighting and how to use a scrim.</strong></li>  \t<li style=\"\">Coloring backgrounds and isolating your model.</li>  \t<li style=\"\"><strong style=\"\">Use a light meter to set your studio lighting for perfect results.</strong></li>  \t<li style=\"\">How to shoot a DPS (Double Page Spread).</li>  \t<li style=\"\"><strong style=\"\">Exposing for a rich vibrant sky.</strong></li>  \t<li style=\"\">Posing your model and controlling squinting in bright sunlight.</li>  \t<li style=\"\"><strong style=\"\">Posing an inexperienced model.</strong></li>  \t<li style=\"\">Avoid any issues when shooting models under 18 years of age.</li>  \t<li style=\"\"><strong style=\"\">And lots more tips from photography pros so you can achieve images that you never thought were possible!</strong></li>  </ul>  <p style=\"\">  \t <strong style=\"\">Interactive Online Help</strong>  </p>  <p style=\"\">  \t                         Jason Cole and the team at Learn Photography HQ are here to <strong style=\"\">answer all your photography questions</strong>. We want you to be a success in your chosen career as a professional model photographer.  </p>  <p style=\"\">  \t                          No matter if you are just starting out and creating your first glamour portfolio, or whether you are a seasoned professional, we are here to <strong style=\"\">answer any questions you may have in a timely manner</strong>.  </p>  <p style=\"\">  \t <strong style=\"\">Having access to a team of professional photographers</strong> is invaluable whilst you learn and perfect your craft.  </p>  <hr style=\"\">   <strong style=\"\"> Meet your Course Instructor</strong>  <p style=\"\">  \t<em style=\"\">As a visual artist, it has always been my passion to produce a course like this. Another one of my personal goals can now be ticked off my list. This production has been six months in the filming and over twelve months in the planning with an entire professional design and production team. Enormous effort been put into making sure this course is the best of its kind. I sincerely hope you enjoy watching this course as much as we did creating it for you.</em>  </p>  <p style=\"\">  \t<em style=\"\">  Kind regards,<br style=\"\">  \t                                                  Jason Cole</em>  </p>", 
    "end_date": null, 
    "title": "Secrets of Magazine Model Photography", 
    "price": "20.00", 
    "instructors": "Learn Photography HQ", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99800_097f_8.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-magazine-model-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Portraits"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-01T03:12:55Z"
}