{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t      In diesem Lehrgang lernen Sie <strong style=\"\">alle hebräischen und altgriechischen Buchstaben</strong> kennen. Schon nach etwas über einer Stunde kennen Sie nicht nur sämtliche Buchstaben der beiden uralten Alphabete, sondern wissen schon vieles über die Besonderheiten dieser antiken Schriften, die für viele klassische Werke der <strong style=\"\">Weltliteratur</strong> verwendet wurden.  </p>  <p style=\"\">  \t      Das gilt insbesondere für die <strong style=\"\">Bibel</strong>, die in hebräischer, aramäischer und altgriechischer Sprache abgefasst wurde, wobei die aramäischen Teile mit denselben Buchstaben wie die hebräischen Schriften geschrieben wurden. Doch auch die berühmten <strong style=\"\">Schriften der griechischen Philosophen</strong> wurden in der altgriechischen Schrift abgefasst, die Sie hier lernen können. Diese Schriftzeichen sind seit Tausenden von Jahren in Gebrauch und werden auch heute noch in Israel und Griechenland verwendet, wenngleich sich die Aussprache an manchen Stellen ein wenig verändert hat.  </p>  <p style=\"\">  \t      Denken Sie daran: <strong style=\"\">Sie können die Lektionen jederzeit anhalten und so oft abspielen, wie Sie möchten.</strong> Nutzen Sie die Wiederholung, um die Buchstabenfolgen auswendig zu lernen und die Zeichen selbst von Hand zu schreiben. Alle Schriftzeichen werden nicht nur am Bildschirm angezeigt, sondern Sie lernen auch, wie Sie sie am besten <strong style=\"\">von Hand schreiben</strong> können. Sie benötigen dazu nicht mehr als einen beliebigen Stift und etwas Papier.  </p>  <p style=\"\">  \t      Die Kenntnis dieser Alphabete steigert nicht nur Ihr <strong style=\"\">Allgemeinwissen</strong> und hilft bei <strong style=\"\">Rätseln</strong> oder bei <strong style=\"\">Fachliteratur</strong>, die hebräische oder griechische Wörter oder Sätze anführt. Sie werden auch bei Ihrem nächsten <strong style=\"\">Urlaub in Griechenland oder Israel</strong> merken, dass die Tafeln und <strong style=\"\">Inschriften</strong> viel vertrauter wirken. Auch wenn Sie mit der Kenntnis der Buchstaben die Wörter nicht automatisch verstehen können, werden Sie doch Klänge entdecken, die Ihnen bereits vertraut sind. Nutzen Sie Ihr neu erworbenes Wissen auch dazu, hebräische und griechische Wörter beispielsweise <strong style=\"\">in theologischen Lexika</strong> nachzuschlagen.  </p>  <p style=\"\">  \t      Dieser Lehrgang eignet sich auch zur Vorbereitung auf Hebräisch- oder Altgriechischkurse auf Universitätsniveau zum Erwerb des <strong style=\"\">Hebraicum</strong> und des <strong style=\"\">Graecum</strong>. Wenn Sie die Buchstaben bereits lesen und schreiben können, bevor Sie solch einen prüfungsvorbereitenden Kurs belegen, haben Sie einen großen Vorsprung vor anderen Studenten und können sich früher auf Vokabeln und Grammatik konzentrieren.  </p>  <p style=\"\">  \t      Nutzen Sie die <strong style=\"\">Übersichtslektionen</strong> und die <strong style=\"\">PDF-Überblickstafel</strong> der letzten Lektion, um beide Alphabete <strong style=\"\">auswendig zu lernen</strong>. Da viele Nachschlagewerke für hebräische und griechische Wörter nach diesen alten Alphabeten geordnet sind, werden Sie sich leichter und schneller zurechtfinden, wenn Sie auch diese antiken Alphabete wie das deutsche ABC aufsagen können.  </p>", 
    "end_date": null, 
    "title": "Das hebräische Alephbet und das griechische Alphabet", 
    "price": "20.00", 
    "instructors": "Oliver Roman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436422_cd19_3.jpg", 
    "course_url": "https://www.udemy.com/alephbet-und-alphabet/", 
    "currency": "USD", 
    "subject_name": [
        "Hebrew"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T11:18:07Z"
}