{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t                      This course teaches how to successfully use any biblical Hebrew lexicon. You don&#039;t need to be in possession of a Hebrew lexicon, because included in the course price are 5 digital copies of Hebrew lexicons. Before we actually start using them, I will give you an introduction to the principles of Hebrew word formation. I will explain what roots and patterns are, how to identify prefixes and suffixes on Hebrew words and how to parse. You will receive colorful charts and many examples to illustrate how Hebrew word formation works. This section of the course serves as introduction/ review to the morphological (form of words) analysis of Hebrew words which is essential for successfully using a biblical Hebrew lexicon.  </p>  <p>  \t                      The next section of the course focuses on the practical use of the lexicons. Each lexicon will be introduced briefly. After that I will provide a lot of clear examples and exercises that help you to get familiar and comfortable with using any biblical Hebrew lexicon.  </p>  <p>  \t                      The individual lessons of this section are packed with background information, reference tools, easy-to-understand exercises, and examples from the Hebrew bible that will help you to approach any biblical Hebrew lexicon and make the best use of it.  </p>  <p>  \t                      You will receive tips and tricks at the end of the course, e.g.helpful web services. You will be invited to a vibrant online community of students and instructors that will help you with all your future questions on biblical Hebrew.  </p>  <p>  \t<strong>On completing this course:</strong>  </p>  <ul>  \t<p>  \t\t                      -<strong>you will be able to use any biblical Hebrew lexicon on your own</strong>  \t</p>  \t<p>  \t\t                      -<strong>you will be in possession of 5 biblical Hebrew Lexicons</strong>  \t</p>  \t<p>  \t\t                      -<strong>you will learn about free-of-charge web services</strong>  \t</p>  \t<p>  \t\t                      -<strong>you will be connected to an online community that answers all your questions even after the end of the course</strong>  \t</p>  </ul>", 
    "end_date": null, 
    "title": "How to use a Biblical Hebrew Lexicon?", 
    "price": "20.00", 
    "instructors": "Michal Shmuel", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297612_3397_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-a-biblical-hebrew-lexicon/", 
    "currency": "USD", 
    "subject_name": [
        "Hebrew"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-10T09:53:35Z"
}