{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t                      This course takes a non-academic approach to guide  you through your journey into Biblical Hebrew teaching you to recognize \"sight words\" in bible verses as you learn Hebrew letters.  Start to learn the Biblical Hebrew language using cutting-edge methods. Start to learn Biblical Hebrew as a living language. </p><p><strong>Learn how to Start Reading the Hebrew Bible.</strong></p><ul><li>Learn the names of the Hebrew letters and what their names mean.</li><li>Recognize Biblical and Modern Hebrew vocabulary from words you know in English.</li><li>Learn how to write each Hebrew letter</li><li>Learn over 100 Hebrew sight words as you learn the Hebrew letters</li><li>Recognize these sight words in Bible verses and learn how to write them.</li><li>Make sentences from the words you have learned.</li><li>Learn why some Hebrew letters don't always have the same sound.</li><li>Learn about the way Hebrew works through E-Vreet's English translation</li><li>Prepare to take a course in Modern Hebrew</li><li>Prepare for a traditional Biblical Hebrew course with the niqqud (vowel points).</li></ul>  <p><strong>At the End of the Course: You'll Open a Hebrew Bible and Start Picking Out Words.</strong></p><p><strong><strong></strong></strong>Sight words, often also called high frequency sight words, are \ncommonly used words in the Bible that you can automatically recognize without having to use any strategies to decode.<strong></strong><br></p><p>There are no lectures or talking heads in this course. Instead, E-Vreet helps you study,  engaging you in activities that help you practice what you have learned.  It is carefully designed to guide you in a step-by-step process from recognizing the Hebrew letters to being able to actually read simple sentences.  It builds on what you just learned, so you are always reviewing previous lessons.  This course is great for home-school as well as college.</p><p>This course does not cover the vowel points but contextualized the letters in meaningful sight words and sentences. </p><p><strong>At the end of the second lesson, you can read and write a simple sentence in Hebrew. </strong><br></p>  <p>  \t                      <strong>1. Introducing the letter</strong><br></p><p>Each lesson focuses on one Hebrew letter. Find out the name, meaning, and English letter equivalent. The names and place that you already know like Adam, Bethlehem, and David, will help you learn how to recognize the target letter. </p><p>You will also see how a words that have been borrowed from English--avocado, banana, and guitar--look in Hebrew.  </p>  <p>  \t                      <strong>2. Treasure Hunt in Scriptures</strong></p><p>Go on a treasure hunt with the help of our friend, Ben Abraham, (not unlike Bart Simpson).  Your mission, (if you choose to accept it), is to find the target letter on signs on roads and shops all over Israel.  </p>  <p>  \t          Then, like Indiana Jones, you will search the ancient scriptures for the target letter.  Usually, the verses come from the book of Genesis. The scriptures have been carefully selected for simplicity and to inspire you.  </p><p><strong>3.  The English translation mirrors the Hebrew structure</strong><br></p>  <p>  \t                      To help you get familiar on how Hebrew makes sentences, the English translation of the verses will reflect the Hebrew format. </p><p>For instance, the English translation will hyphenate words that are one word in Hebrew:  \"In-the-beginning.\"  In later units, it will show you how Hebrew changes the verb: \"And-said-David.\" <br></p><p>Take time to read the verses in English. By familiarizing yourself with the Hebrew format through English, you will be prepared learn the grammatical principles in a more advanced course.  </p>  <p>  \t<strong>4. Special Features</strong></p><p> Find out about the Special Features of the target letter--its extra sounds, weird sounds or if it is sticky! Find out how sticky letters help you put sentences together.<br>  </p>  <p>  \t                      <strong>5. Learn the write the target letter</strong></p><p>Get video instructions on every stroke that you need to make in order to create each Hebrew letter.  You will also be given instructions on how to write words and sentences.<br>  \t</p><p><strong>6. Snap together the letters</strong><br>  \t          </p><p>As soon as you learn the first  letters of the Hebrew alphabet, you will learn how snap together the letters--like lego blocks--to make simple words. <br></p><p>Just as you did with the letters, you will travel through Israel and locate these words on signs in Israel and in Hebrew verses of scripture.<br>  \t                        </p><p>Finally, you snap together the words and that you have learned to form sentences.  </p>  <p><strong>7. Listening to Biblical Hebrew</strong><br></p><p>In order that you can get used to hearing Hebrew, there is even an extra video of the target letter's section of Psalm 119 where you can follow along.  Some of the verses are also in mp3 format.  </p><p><strong> 8. Understanding Ancient Isreal's Culture is key to the language</strong></p><ul><li>Click on links that cover ancient Hebrew traditions and major Jewish Holidays.  </li><li>  \t                        Each lesson or lecture is about ten minutes long. </li><li>Some letters have two to three lectures, depending on their special features. </li><li>Try to schedule at least 15 minutes a day for the course. </li><li>Little and often is the key for people with busy schedules.  </li></ul><p><strong>9. The course studies for you.</strong></p><p> The course does a lot of the work for you: it has be especially designed to constantly review material--it helps you study and retain the material. <br></p><p><strong>10. PDF files</strong></p><p>All of the videos have PDF documents in order that you can go over what you learned and also to meditate and study the scriptures provided.<br></p><p>  \t              Try to find someone else with whom you can study--this is the traditional way.  You can even have a class at your home with a few like-minded friends. We encourage you to join other students for discussions and to ask questions to learn from each other at our Facebook group called E-Vreet.  And I am always available.  Don't hesitate to message me on Udemy. Students are encouraged to join our Facebook group to discuss what they have learned.</p><p>When you say E-Vreet, you are saying Hebrew...in Hebrew.<br></p>  <p>  \t          Rachel Levy  </p><p>P.S. Please not that we do not teach Biblical Hebrew using the vowel pointings or nikkud. The E-Vreet method teaches Hebrew using context, words and sentences. After completing the E-Vreet courses, the student is ready for the traditional courses that teach the nikkud.<br></p>", 
    "end_date": null, 
    "title": "Learn Hebrew from the Bible", 
    "price": "50.00", 
    "instructors": "Rachel Levy", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131044_79a7_6.jpg", 
    "course_url": "https://www.udemy.com/aleph-bait-soup-read-biblical-hebrew-a-letter-at-a-time/", 
    "currency": "USD", 
    "subject_name": [
        "Hebrew"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-08T21:05:51Z"
}