{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>THE NEWEST COURSE ON THE MARKET WITH ALREADY HEAPS OF 5 STAR REVIEWS AND HUNDREDS OF HAPPY STUDENTS!!!</p><p><strong>Students wrote:</strong></p><p><em>\"Daniel, you are a natural! everything was very clear, the resources are great (downloadable MP3’s, printable exercise sheets etc), the curriculum is properly structured. Unlike some other online courses I took that are too complicated and confusing, this was the perfect balance between reaching the course goals and yet keeping it simple.\"    </em><em></em></p><p><em>Chelsea Lynn</em></p><p><em>\"I have taken a few online Hebrew courses, and this is definitely the best online course I have taken.\"       </em></p><p><em>Nicole Hope<span></span></em></p><p><strong>Come with me on a journey to learn the basics of Hebrew in just a few hours.</strong><br></p><p>Hebrew is and has always been a sacred language - the language of the Bible. Since a few thousand years back it has become a modern language useful for many. If you want to follow the Bible or prayer book reading, if you are thinking of visiting Israel, if you simply want to learn one of the most ancient languages around this course is for you.</p><p>This course was created with over 10 years of Hebrew teaching experience and tailored specifically for you, the online learner to make you Hebrew learning experience interactive, interesting and fun!!!</p><p><strong>What is the Course About?</strong></p><ul><li>It's your first step to learning the Hebrew language</li><li>You will deeply learn the 22 letters of the Hebrew Alphabet</li><li>You will also learn the 5 <em>Final Letters</em> in the Hebrew Alphabet</li><li>Through learning the different letters we will also jump start your Hebrew vocabulary.</li><li>You will learn your first 100 Hebrew words including names of different foods, animals and biblical figures</li><li>The course can be taken in just a few hours (if you want a quick crash course) or it can be taken in a deeper manner including exercises that will give you everything you need to take the first steps in reading and writing Hebrew</li></ul><strong>How is the course structured?</strong><p>At first a few different learning options suited for different lifestyles and learning goals will be given. Following, we will review each letter individually and teach you how to pronounces it, write it and identify it. You will also find downloadable exercises to perfect your writing skills. Finally to completely master the letter we will build different words based on the letters you already know. </p><p><strong>What Materials are included?</strong></p><ul><li>Downloadable exercise sheets for those who want to learn how to write Hebrew</li><li>PDF's with words in Hebrew (and English)</li><li>Downloadable MP3's so you can learn Hebrew even when you are on the go! </li></ul>", 
    "end_date": null, 
    "title": "Learn Hebrew From Scratch", 
    "price": "20.00", 
    "instructors": "Ivrit - Simply Learn Hebrew", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541388_13b4_6.jpg", 
    "course_url": "https://www.udemy.com/learn-hebrew-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Hebrew"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T16:19:27Z"
}