{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>UPDATE: PER STUDENTS REQUEST, THERE HAVE BEEN ADDITIONS AND IMPROVEMENTS TO THE COURSE. </strong></p><p>1. A QUIZ AFTER EVERY 4 LETTERS SO YOU CAN PRACTICE WHAT YOU HAVE LEARNED.</p><p>2. A WHOLE NEW SECTION - INTRODUCTION TO VOWELS WHERE YOU WILL LEARN THE HEBREW VOWELS AND PRACTICE READING.</p><p><strong></strong><strong></strong></p><p><strong></strong><strong></strong><strong></strong><strong></strong><strong></strong></p><p><strong>Learn The Hebrew Alphabet in Under 30 minutes!</strong></p><p>Thinking of learning Hebrew? Want to get a quick taste of it to decide if it's for you? This course is for you!</p><p>Learning Hebrew can be difficult, and before you start you should first get a taste of it. We have carefully selected only what you must know to learn the Hebrew alphabet. </p><p>This course was created with over 10 years of Hebrew teaching experience and tailored specifically for you, the online learner to make you Hebrew learning experience interactive, interesting and fun!!!</p><p><strong>What is the Course About?</strong></p><ul><li>It's your first step to learning the Hebrew language</li><li>You will learn the 22 letters of the Hebrew Alphabet</li><li>You will also learn the 5 <em>Final Letters</em> in the Hebrew Alphabet</li><li>All letters are visualized and shown how to be correctly written </li><li>The course can be taken in under 30 minutes! </li></ul><p><strong><br></strong></p><p><strong>How is the Course Structured?</strong></p><p><strong></strong>We will review each letter individually and teach you how to pronounces it, identify it and write it. You will also find a bonus section at the end where new materials will be added on a regular basis. </p><p><strong>What Materials are included?</strong></p><ul><li>Downloadable MP3 audio file so you can learn the alphabet even when you are on the go!</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Learn the Hebrew Alphabet - Crash Course", 
    "price": 0, 
    "instructors": "Ivrit - Simply Learn Hebrew", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655440_e09e_6.jpg", 
    "course_url": "https://www.udemy.com/learn-the-hebrew-alphabet-in-less-than-30-min/", 
    "subject_name": [
        "Hebrew"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T11:56:13Z"
}