{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Meet the Hebrew Alphabet through their five families of shapes. Then learn the sounds of the letters through Hebrew words that you already know. </p><p><strong>Learn the Hebrew Alphabet by Learning the Five Basic Shapes and Sounds.</strong></p><p><strong></strong>Goals of this course:</p><ul><li>Recognize the 22 Hebrew letters through 5 families of shapes.</li><li>Recognize the 5 Hebrew letters that are modified when they are at the end of words</li><li>Learn over 22 Hebrew vocabulary words. </li><li>Learn sounds of the Hebrew Alphabet through English words that are Hebrew words too.</li><li>Prepare for the E-Vreet reading course or a traditional Biblical Hebrew course.</li></ul><p>When you first look at the Hebrew alphabet, they don't even look like letters--they look like 22 weird shapes. Well, E-Vreet discovered that each letter belongs to one of the Five Families of shapes.</p><p>Instead of trying to learn 22 shapes all at one time, meet the Five Families of the Hebrew Alphabet. Each family has  special a family traits. Every letter has that family resemblance. The purpose of this section is to help you get used to the shapes of the letters in order that you can recognize them in later courses.<strong></strong></p>    <p>  \t     <strong>SECTION 1:      S H A P E S </strong><br></p><p> Meet the Five Families: </p><ol><li>The Horns</li><li>The Circles</li><li>The Staffs</li><li>The Squares</li><li>and finally, the Uniques</li></ol><p>Oh, and find out about the Endings: 5 letters from these families that do something different.</p><p style=\"\"><strong>VISUAL STIMULUS:</strong> You'll meet the five families flying through Israel.  They are so big that you feel like you can touch them, and that's the whole point--to actually feel like you can feel them--it helps imprint them in the language center of the brain.</p><p style=\"\"><strong>AURAL STIMULUS:</strong> Why is Music so important in learning? Music also helps calm the brain to learn new things as well as helping it to focus--so E-Vreet has carefully selected different kinds of music to go with each family to help you learn as you watch the videos.</p><p><strong>BRAIN EXERCISES: </strong>E-vreet doesn't just present you with the material--like in the gym, it gives you different exercises for your brain in order that you will be able to subconsciously recognize the Hebrew letters.<strong></strong></p>  <p><strong>SECTION 2:      S O U N D S</strong></p><p><strong><strong></strong></strong>Now that you have met the Hebrew letters, you are ready to learn about how they sound. E-Vreet has a special methodology to help you match the Hebrew letter with the sound.<strong><strong></strong></strong><br><strong></strong></p><p><strong>VOCABULARY</strong></p><p style=\"\">There are many Hebrew words that you know--but you just don't know what they are.  The first thing E-Vreet does is uncover 22 of these key words for you.  <strong>Like magic, you know 22 Hebrew words that you didn't know before and you didn't have to study!</strong></p><p style=\"\">Why 22 words?  Because each of these key words begins with one of the 22 Hebrew letters.  You already have these key words in your brain.  You know what they sound like. E-vreet matches the first letter or sound of each word to a Hebrew letter.</p><p style=\"\"> By associating the key word with the corresponding Hebrew letter, your brain can build on what you already know by grasping the Hebrew letter and cement it to the key word.<strong> </strong></p><p><strong>IMAGES</strong></p><p style=\"\">From the beginning, E-Vreet uses an image with the key word and Hebrew letter.  For instance,  Adam's letter has a painting of Adam next to it. Once your brain has started to recognize the Hebrew letter with the key word, E-vreet only uses the  image to stimulate your brain to remember the Hebrew letter.  </p><p style=\"\"><strong>Imaging is an important step in learning how to read Hebrew. </strong> Since you only have an image to help you with the sound, your brain is beginning to rely more on the Hebrew letter to register the sound.</p><p><strong>NOT LEARNING THE NAMES OF THE LETTERS<br></strong></p><p style=\"\"><strong></strong>Why doesn't E-vreet teach you the names of the letters?  Because at this crucial point, <strong>E-Vreet wants your brain to focus on processing the letter only with the target sound.  </strong>Learning the names of 22 letters entails another learning process which E-Vreet uses in the next course, \"Learn Hebrew through the Bible.\"</p><p><strong>GAMES</strong></p><p style=\"\">Each section has games after the lessons in order to help you remember what your brain just received. You get to reinforce what you have learned and help the letters stick in the language part of you brain.</p><p><strong>PDF </strong></p><p style=\"\">There is a pdf file on each lesson in which you can review the lessons to prepare for the games at the end of each section.  Print them out and have a hard copy  so you can look at the letters when you are not at your computer.<br></p><p>This is a quick course to map your brain and get it used to seeing the Hebrew letters. It is based on the principles of semiotics and neuro-linquistics. So don't try to memorize anything. Just enjoy! </p><p>This course prepares you for E-Vreet's next course that will teach you how to read called \"Learn Hebrew through the Bible.\" </p><p>And remember, when you say E-Vreet, you are saying Hebrew--in Hebrew.<strong></strong><br></p><br>", 
    "end_date": null, 
    "title": "Meet the Hebrew Alphabet", 
    "price": "30.00", 
    "instructors": "Rachel Levy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121316_604c_19.jpg", 
    "course_url": "https://www.udemy.com/hebrew-alphabet-evreet/", 
    "currency": "USD", 
    "subject_name": [
        "Hebrew"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-17T20:43:29Z"
}