{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>***** NOTA: Hasta el fin de Febrero de 2016, este curso está rebajado un 80% por comienzo de un nuevo año *****</strong><br></p><p>Si te encuentras en <strong>una</strong> de las siguientes situaciones:</p><ul><li>Has oído hablar de<em> League of Legends</em> (LoL) y quieres <strong>empezar </strong>a jugar <strong>sin saber</strong> mucho sobre este juego.</li><li>Ya tienes el juego e incluso lo has probado, pero aunque sepas los controles básicos, quieres una buena <strong>base de conocimientos</strong> para aprender mucho más <strong>deprisa</strong>.</li><li>Nunca habías oído hablar de<em> League of Legends</em> pero tienes <strong>curiosidad </strong>para saber si te gustará. Ya te garantizo que si te inscribes al curso<strong> te gustará</strong> porque lo conocerás todo y<strong> sabrás cómo jugar</strong>.</li></ul><p><br></p><p>Entonces necesitas <strong>inscribirte </strong>en este magnífico curso de Udemy, un curso en el que aprenderás cómo jugar <strong>bien </strong>a<em> League of Legends </em>partiendo de <strong>ninguna </strong>base de conocimientos (o muy pequeña) de cómo jugar a este juego.</p><p>Esta guía está muy bien <strong>estructurada </strong>para que te sea <strong>imposible </strong>perderte en tu aprendizaje. Está dividido en 7 grandes temas y una conclusión (un total de <strong>8 secciones</strong> con <strong>39 clases </strong>y <strong>3 exámenes</strong>). En cada sección trataremos un <strong>aspecto general </strong>del juego, y en cada clase, un<strong> aspecto particular </strong>de la sección. Te aseguro que<strong> no</strong> te perderás en ningún momento.</p><p>La mayoría de las clases son <strong>vídeos </strong>que te ayudarán mucho más que una simple guía de texto, ya que podrás ver <strong>ejemplos prácticos</strong> continuamente. Además, si en alguna clase o sección no acabas de captarlo todo, ¡no te preocupes! Puedes <strong>repetir </strong>cualquier <strong>clase</strong>, <strong>sección </strong>e incluso el <strong>curso </strong>entero<strong> cuantas veces quieras </strong>sin tener que pagar absolutamente nada. En cualquier caso, yo estoy aquí para <strong>solucionarte </strong>cualquier duda que tengas sobre <strong>cualquier </strong><strong>tema </strong>trabajado.</p><p>Así que... <strong>¿a qué esperas?</strong> ¡<strong>Inscríbete </strong>ya mismo en el curso y aprende a ser un jugador <strong>excepcional </strong>de<em> League of Legends</em> en tan solo unas pocas horas! Créeme, <strong>vale mucho la pena</strong>.</p><p><strong><em>¡Próximamente en inglés! - Coming soon in English!</em></strong><br></p>", 
    "end_date": null, 
    "title": "Aprende los primeros pasos de League of Legends (LoL)", 
    "price": "20.00", 
    "instructors": "Gamer Xavi Gombau", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603462_f7b7.jpg", 
    "course_url": "https://www.udemy.com/aprende-los-primeros-pasos-de-league-of-legends-lol/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-05T18:17:06Z"
}