{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t          Te cuento que <strong>siempre perdía</strong> los partidos en el Pes, ya sea por falta de trucos; la formación, las tácticas o por estrategias de juego.  </p>  <p>  \t<em>Ante esto, <strong>me dediqué a recopilar</strong> todos los secretos de los mejores jugadores y expertos en el Pes. </em>  </p>  <p>  \t          Así, descubrí cosas increíbles, cosas guardadas bajo 7 llaves, trucos de Pes, habilidades, cosas que jamás pensé que podían existir...  </p>  <p>  \t<em><strong>Al fin; los secretos y trucos de pes mejor guardados de los profesionales estaban descubiertos.</strong></em>  </p>  <p>  \t  Por último, puedo decir que investigué un poco más de la cuenta y reuní toda la información en este curso:  </p>  <p>  \t<em><strong>&quot;Aumenta tu nivel y mejora tus habilidades en el PES&quot;.</strong></em>  </p>  <p>  \t<strong>    Donde garantizo que aprenderás lo siguiente:  </strong>  </p>  <ol>  \t<li>A cómo mantener la concentración en un juego de Pes, </li>  \t<li>A cómo no dejarte ganar los partidos, </li>  \t<li>A tener aumentar tus reflejos y a tomar buenas decisiones, </li>  \t<li>A usar las estrategias y alineaciones de equipo, </li>  \t<li>A jugar con un hombre menos, </li>  \t<li>A jugar ante alguien que es defensivo u ofensivo, </li>  \t<li>A usar las tácticas y el fuera de juego (offside), </li>  \t<li>A estudiar al adversario, </li>  \t<li>A crear tácticas de formaciones,</li>  \t<li>A descifrar el Efecto Konami,</li>  \t<li>A mantener un ritmo de entrenamiento,</li>  \t<li>A grabar nuestros partido de Pes y aprender de nuestros errores.</li>  \t<li>Y mucho más...</li>  </ol>  <p>  \t          Voy a ofrecerte <strong><em>mi garantía 100%</em></strong> de que aprenderás mucho con este curso y te volverás un experto en Pes. O al menos, <strong>ya no te ganarán tan fácil</strong>.  </p>  <p>  \t<strong>¡VENTAJAS AL OBTENER EL CURSO!</strong>  </p>  <p>  \t          Accedes a un grupo selecto de alumnos a los cuales respondemos sus preguntas y dudas de inmediato. Además, te enviaremos actualizaciones y lecciones por 1 año.  </p>  <p>  \t          La asesoría es personalizada pues responderé tus dudas y preguntas de manera personal.  </p>  <p>  \t<strong>¡ESTRUCTURA DEL CURSO!</strong>  </p>  <p>  \t              El curso está estructurado en secciones de estudio para un mejor entendimiento. Y es interesante para cualquier persona que lo realice pues ayuda a mejorar tu fortaleza mental y una parte de tu cuerpo.  </p>  <p>  \t              En cuanto a los materiales utilizados, podrás disponer de lecciones en vídeo y descarga (resumen de cada lección). Así mismo, tendrás un espacio para ejercicios y tareas en cada sección.  </p>  <p>  \t            Vas a divertirte, vas a jugar al Pes, vas a conocer a gente nueva, vas a hacer amigos y vas mejorar tu juego.  </p>", 
    "end_date": null, 
    "title": "Aumenta tu nivel y mejora tus habilidades en el Pes 2015.", 
    "price": "25.00", 
    "instructors": "Beto Rivera Leiva", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354202_a8ff_3.jpg", 
    "course_url": "https://www.udemy.com/aumenta-tu-nivel-y-mejora-tus-habilidades-en-pes-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T03:20:40Z"
}