{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>The course is created with the intent of enabling an absolute beginner to learn the game in a very structured manner and be able to reach a level of tournament participation at the completion of the course. Ideal for beginners aged 5 years onwards and expects parental participation.</em></p><p>At the end of the course, students would be familiar with:</p><p><em>1. Introduction to chess board and arranging the pieces</em></p><p><em>2. Introduction to pieces, their value and movements</em></p><p><em>3. Check, checkmate and stalemate </em></p><p><em>4. Special moves - Castling, Pawn promotion ( Queening and underpromotion), En Passant</em></p><p><em>5. Introduction to basic tactical themes like pin, fork, skewer, double attack, back rank mate, discovered attack, Destroying the defender, Mate in one </em></p><p><em>6. Basic opening tips. Standard tricks and traps !!</em></p><p><em>7. Basic ending techniques. Checkmate with queen and Rook</em></p><p><em>8. Basic introduction to FIDE tournament rules</em></p><p><em>9. Expert tips on self study and self improvement</em></p><p><em><br></em></p><p><strong>Benefits:</strong></p><p><strong>1. Learn the basics of the game in structured manner. </strong></p><p><strong>2. Focus of developing a method of thinking in the beginner. Give the right beginning to your young genius.</strong></p><p><strong>3. Learn at the comfort of your home. Only requirement is a broadband connection.</strong></p><p><strong>4. Pace yourself at your own comfort level.</strong></p><p><strong>5. Learn at a comfortable time of your choosing.</strong></p><p><strong>6. Ideal for students not able to attend a live class due to time/ logistics concerns or unable to find a professional coach. </strong></p>", 
    "end_date": null, 
    "title": "Chess for Beginners", 
    "price": "20.00", 
    "instructors": "Mr. Vedant Goswami", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582860_be18_2.jpg", 
    "course_url": "https://www.udemy.com/chess-for-beginners-foundation/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T09:18:11Z"
}