{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t      Are you a beginning or hobby chess player who wants to start winning a LOT more games?  </p>  <p style=\"\">  \t<em style=\"\">&quot;Chess is 99 percent  tactics.&quot;</em> - Richard Teichmann  </p>  <p style=\"\">  \t      This course breaks down the most frequent (yet powerful!) chess tactics so that <em style=\"\">anybody </em>can pick them up and employ them against their opponents.  </p>  <p style=\"\">  \t      You will be learning these powerful chess tactics from a professional chess coach of more than 10 years who truly takes his students results seriously.  </p>  <p style=\"\">  \tEach lecture has a companion PDF<span style=\"\"> in the supplementary materials section which is highly recommended to be studied with the lecture over-the-board.</span>  </p>  <p style=\"\">  \tStudents who use both the video lecture and its PDF companion will reap the best rewards in terms of their playing level and tactical ability but simply watching the lectures alone will still substantially boost any chess player&#039;s tactical level and practical results.  </p>  <p style=\"\">  \tIf you need an extra nudge into the course, just listen to some of my wonderful student&#039;s kind words! :)  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">“By the way you give great lessons, my elo raised by 50 in 2 days of following your videos and posts, great stuff, keep it up!” -  </em>N. Tomasevic (Serbia)  </strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">“You are a wonderful chess coach. Your passion for the game and dedication to your students’ improvement are only some of the factors as to why more people need such great guidance.<br style=\"\">  \t    I only had like 10 lessons with you and in less than 3 weeks my rating jumped 200-300 points on chess dot com.” - </em>E. Franca (Australia)  </strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">“To have a one on one conversation with Brendan is like having my mind open tenfold.<br style=\"\">  \t    His patience, knowledge, enthusiasm, perseverance, speed of thought have me in awe.<br style=\"\">  \t    You’re not playing chess if you haven’t talked to Brendan. I have regained speed of thought through his coaching, and, yes, points too.” - </em>T. Kaufman (France)  </strong>  </p>  <p style=\"\">  \tReady to get started? Click <strong style=\"\">&quot;Take this course&quot; </strong>now and we&#039;ll begin!  </p>", 
    "end_date": null, 
    "title": "Chess Tactics Essentials", 
    "price": 0, 
    "instructors": "Brendan J. Norman", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298466_872f_3.jpg", 
    "course_url": "https://www.udemy.com/chess-tactics-101/", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-11T16:04:12Z"
}