{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong>***New Course Launched March 18th with Already 700+ Students Happily Enrolled***</strong></em></p>\n\n<p><strong>ACTUAL STUDENT REVIEWS</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"This course will improve your winrate if you have already started working on a foundation of poker knowledge. This course touches up on things like squeezing, constructing 3bet ranges, how to conduct a hand review, and tips for moving up in stakes. I took three of Alton's poker courses while playing 5nl almost a year ago. Since then I have used the knowledge from these courses to get to 200nl. If you want to move up from the microstakes this course if for you.\"</em> - Aaron</p>\n\n<p><em>\"Good, solid poker advice\"</em> - Mark<br></p>\n\n\n\n<p><strong>LEARN TO CONQUER THE MICRO STAKES JUST LIKE ME</strong></p>\n\n\n\n\n\n\n\n<p>Are you a good micro stakes poker player looking to conquer the micro stakes? Do you want to move up in stakes and escape the micro stakes? </p>\n\n\n\n\n\n\n\n<p>If so, this course is for you!</p>\n\n\n\n\n\n\n\n<p>This course will teach your intermediate and advanced No Limit Hold’em poker strategies you need to know to conquer the micro stakes!</p>\n\n\n\n\n\n\n\n<p>You’ll learn the intermediate and advanced strategies you need to master and escape the micro stakes!</p>\n\n\n\n\n\n\n\n<p>I have<strong> won over $1,000</strong> at the micro stakes <strong>playing $5nl and $10nl micro stakes cash games</strong> in my spare time…</p>\n\n\n\n\n\n\n\n<p>Building up a $5nl bankroll to a $25nl bankroll numerous times over…</p>\n\n\n\n\n\n\n\n<p>At a 12BB/100 win rate…</p>\n\n\n\n\n\n\n\n<p> And I'm going to show you how to do so as well!</p>\n\n\n\n\n\n\n\n<p><strong>BECOME A MASTER OF MICRO STAKES ONLINE POKER</strong></p>\n\n\n\n\n\n\n\n<p>In this course you'll learn everything you need to know to conquer the micro stakes and move up to higher stakes:</p>\n\n\n\n\n\n\n\n<ul><li>Master <strong>Range-Based Thinking</strong> to become an effective hand reader</li><li>Learn <strong>Combinatorics</strong> to bring your hand reading game to the next level</li><li>Understand the importance of <strong>Widening your Ranges</strong>  </li><li>Learn to <strong>Steal</strong> and <strong>Defend</strong> more</li><li>Master the <strong>Squeeze Play</strong>, <strong>Isolation Raising</strong> and <strong>Floating</strong></li><li>Learn the Art &amp; Science of the<strong> Polarized 3-Betting Ranges</strong></li><li>Learn to<strong> Bluff with a Purpose</strong></li><li>Learn to<strong> Capitalize on Dead Money</strong></li><li>Learn to utilize<strong> Hand History Reviews </strong>to improve your game</li><li>Learn effective strategies for <strong>Moving Up in Stakes</strong></li></ul>\n\n\n\n\n\n\n\n<p><strong>WHAT YOU WILL GET OUT OF THIS COURSE</strong></p>\n\n\n\n\n\n\n\n<p>Once you complete this course, <strong>you will be a fierce adversary and feared opponent</strong> at the poker table and will easily be able to crush micro stakes online poker. </p>\n\n\n\n\n\n\n\n<p>You will not only <strong>win a lot more money</strong> at the poker tables, but you'll have a HUGE edge over your fellow micro stakes opponents!</p>\n\n\n\n\n\n\n\n<p>Most importantly, you will <strong>be a much happier poker player</strong> as you <strong>see your profits skyrocket</strong> and as you <strong>move up in stakes</strong> throughout the year!</p>\n\n\n\n\n\n\n\n<p><strong>SO WHAT ARE YOU WAITING FOR? </strong></p>\n\n\n\n\n\n\n\n<p><strong>ENROLL TODAY, YOUR 100% RISK-FREE ENROLLMENT IS BACKED BY UDEMY'S 30-DAY, NO QUESTIONS ASKED, MONEY BACK GUARANTEE!</strong></p>\n\n\n\n\n\n\n\n<p><strong>TO PREVIEW SELECT LECTURES FROM THIS COURSE, JUST SCROLL DOWN BELOW AND CLICK THE BLUE PREVIEW BUTTONS.</strong></p>", 
    "end_date": null, 
    "title": "Conquer Micro Stakes Poker: Serious Poker for Good Players", 
    "price": "20.00", 
    "instructors": "Alton Hardin", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792693_a626_2.jpg", 
    "course_url": "https://www.udemy.com/conquer-micro-stakes-poker/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T18:30:11Z"
}