{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>ACTUAL STUDENT REVIEW<em> </em></strong></p>\n\n<p><strong><em>“Amazing Tips:</em></strong><em> This course is perfect for anyone who has been struggling to beat the micro stakes. It is applicable to full ring players or 6-max and goes over the basic skill set needed to beat these games. This course is well organized from start to finish which makes it easy to follow.\" – Samuel </em></p>\n\n<p><strong>LEARN TO CRUSH THE MICRO STAKES JUST LIKE ME</strong></p>\n\n<p>Are you new to poker or a struggling poker player? Do you want to be a profitable poker player? Do you want to learn how to crush the micro stakes? If so, this course is for you. This course will teach you everything you need to know to crush micro stakes online poker and turn nickels, dimes and quarters into hundreds of dollars of profit.</p>\n\n<p>I have<strong> won over $800</strong> in the past year <strong>only playing $2, $5, and $10 buy-in micro stakes cash games</strong> in my spare time and I'm going to show you how to do so as well!</p>\n\n<p><strong>BECOME A MASTER OF MICRO STAKES ONLINE POKER</strong><strong></strong></p>\n\n<p>In this course you'll learn everything you need to know to crush online micro stakes poker. I will teach you how a tight-aggressive approach to the game that yields tons of profits through a fundamental understanding of poker strategy and tactics.</p>\n\n<ul><li>Master <strong>Fundamental Poker Concepts</strong> necessary to crush the micro stakes</li><li>Understand <strong>Essential Poker HUD Stats and Player Types</strong> that will allow you to outplay your opponents and attack their weaknesses</li><li>Master <strong>Pre-Flop Strategies</strong> that to learn what cards you should and can play profitably </li><li> Learn essential and easy-to-learn <strong>Poker Math</strong> all poker players should know</li><li>Understand <strong>Post-Flop Basics</strong> that will allow you to win more pots</li><li>Learn the secrets to profitable <strong>Flop Play and Continuation Betting</strong></li><li>Learn to successfully <strong>Bluff and Semi-Bluff</strong> your opponents out of the pot</li><li>Learn to navigate <strong>Playing the Turns and Rivers</strong> to make more money doing so</li><li>Watch and learn from my <strong>Live Play Session Reviews</strong> and <strong>Hand</strong> <strong>History Analyses</strong> to see your course curriculum and winning poker play in action</li></ul>\n\n<p>If you are a beginning poker player who wants to maximize your winnings or even if you are an experienced and struggling poker player that doesn't feel you are doing the best you can, this course is for you! Through over 100 High Definition (HD) video lectures and 12 hours of learning material, you'll learn everything you need to know to crush micro stakes online poker. </p>\n\n<p><strong>WHAT YOU WILL GET OUT OF THIS COURSE</strong></p>\n\n<p>Once you complete this course, <strong>you will be a fierce adversary and feared opponent</strong> at the poker table and will easily be able to crush micro stakes online poker. You will not only <strong>win a lot more money</strong> at the poker tables, but you'll also <strong>be a much happier poker player</strong> as you <strong>see your profits skyrocket</strong> throughout the year!</p>\n\n<p><strong>MORE AMAZING STUDENT REVIEWS</strong></p>\n\n<p><em>“<strong>Highly Recommended</strong>: If you are currently a solid micro or small stakes tournament player considering moving up or loosening your style pull the trigger and buy “Crush Online Micro Stakes Poker\". This course is absolutely what every Hold'em player are looking for. Highly recommended!\" – Ben</em></p>\n\n<p><em>\"<strong>One of the Best Courses</strong>: This course is perfect for anyone who has been struggling to beat the micro stakes. It is applicable to full ring players or 6-max and goes over the basic skill set needed to beat these games. This course is well organized from start to finish which makes it easy to follow.\" – Max </em></p>\n\n<p><strong>SO WHAT ARE YOU WAITING FOR? JOIN 1000+ STUDENTS LEARNING HOW TO CRUSH THE MICRO STAKES AND BECOME A WINNING POKER PLAYER!</strong></p>\n\n<p><strong>ENROLL TODAY, YOUR 100% RISK-FREE ENROLLMENT IS BACKED BY UDEMY'S 30-DAY, NO QUESTIONS ASKED, MONEY BACK GUARANTEE!</strong></p>\n\n<p><strong>PREVIEW 2 HOURS OF THIS COURSE THROUGH MY 15 FREE LECTURES, JUST SCROLL DOWN BELOW AND CLICK THE BLUE PREVIEW BUTTONS.</strong></p>", 
    "end_date": null, 
    "title": "Crush Micro Stakes Online Poker: The Complete Mastery Guide", 
    "price": "20.00", 
    "instructors": "Alton Hardin", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496960_716a_5.jpg", 
    "course_url": "https://www.udemy.com/crush-online-micro-stakes-poker/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T17:42:06Z"
}