{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>Do you want to start playing fantasy basketball with friends, co-workers, and online competitors? </em></p><p><em>Do you want to learn how to play fantasy basketball?</em></p><p><em>Do you want to learn strategies to help you win?</em></p><p><span><span>If so, then you should definitely enroll in this course.</span></span></p><p><span><span><strong>Welcome to the Fantasy Basketball (Season) Course!</strong><br></span></span></p><p><span><span><span>This course is for anyone that wants to learn to how to play fantasy basketball for the whole NBA basketball season.  When you take this course, you will gain a better understanding of how to play fantasy basketball and how you can give yourself a better chance to win.</span></span></span></p><p><span><span><span><strong>Expectations from this course.</strong><br></span></span></span></p><p><span><span><span><span>You can expect to learn the basic rules of how to play fantasy basketball which will be helpful for those that are just starting off.  In addition, you will also learn some strategies that can put you in a position where you can win on a consistent basis.</span></span></span></span></p><p><span><span><span><span><strong>Why take this course?!</strong><br></span></span></span></span></p><p><span><span><span><span><span>You should definitely take this course because you will learn a tremendous amount about the game of fantasy basketball.  If you want to be a winner in your league, then you will be provided with strategies that will definitely give you a better chance of winning.</span></span></span></span></span></p><p><span><span><span><span><span>DISCLAIMER: THIS FANTASY BASKETBALL COURSE IS FOR THOSE THAT WANT TO LEARN HOW TO PLAY SEASON LONG FANTASY BASKETBALL, NOT DAILY SPORTS FANTASY.  IF YOU JUST WANT TO LEARN DAILY FANTASY SPORTS, THEN THIS IS NOT THE COURSE FOR YOU.</span></span></span></span></span></p><p><span><span><span><span><span><br></span></span></span></span></span></p>", 
    "end_date": null, 
    "title": "Fantasy Basketball (Season): Tips to Winning Your League", 
    "price": "20.00", 
    "instructors": "Daniel Yoo", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754024_25a8_3.jpg", 
    "course_url": "https://www.udemy.com/fantasy-basketball-season-tips-to-winning-your-league/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T03:21:26Z"
}