{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong></strong><strong>Fantasy Football – How to Play and How to Win </strong>is the first Udemy course that teaches you how to play the complex and rewarding game of Fantasy Football.  Through <strong>15 lectures</strong>, <em>more than 4 full hours of content</em>, you'll learn the basics of playing fantasy sports and gain a thorough understanding of the strategy and management you'll need to run your franchise successfully.</p><p>Fantasy Football is a game that more than 10% of the US is actively involved in, <em>and it is a fantastic way to earn a steady profit</em>, year after year, if you're good.  In 2014, I earned over $12,000 playing this game,<strong> and every minute of it was a joy</strong>.  </p><p>You can easily learn the same skills I've used to dominate my fantasy leagues.  I'll show you <em>a sure-fire winning strategy</em>, as well as <strong>one of the easiest types of leagues to play in</strong>. Following the strategy that is set out in this guide practically guarantees success.  </p><p>I'll share all my secrets, from where to play and how to draft, to how to maintain your team throughout the year.  I use real-life examples, current players and real statistics to help you float to the top of your league's standings. </p><p>Read some of the reviews below to see what others are saying.  Here are some highlights:</p><ul><li>\"<em>I have been playing fantasy football for many years and I learned some new ways at looking at the game and different type leagues.</em> I highly recommend this course to anyone wanting to learn more about fantasy football or the beginner.\"</li><li>\"Robert organized the course very well. His command on the subject is very good. <em>He knows what he is talking.</em><em> He provided excellent information.</em>\"</li><li>\" <strong>always wanted to play fantasy football but don't know where to start</strong> but this course definitely helps to move forward. I am waiting for the 2015 season <strong>so that I can show my skills that I learned through this course </strong>to my colleagues, friends<span>\"</span></li></ul><p>Also, don't forget Udemy's 30-day money back guarantee. You have nothing to lose, except your fantasy football trophies.  Enroll now!</p>", 
    "end_date": null, 
    "title": "Fantasy Football - How to Play, and How to Win", 
    "price": "50.00", 
    "instructors": "Robert Watson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305036_cf2c_4.jpg", 
    "course_url": "https://www.udemy.com/fantasy-footbal/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-21T23:56:17Z"
}