{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t         Considering the application of a free-2-play (F2P) monetization model to your game? This course will get you up to speed on the dos and don&#039;ts of free-2-play. Tap into the experience of somebody who has worked with free-2-play for over 10 years.  </p>  <p>  \t         This online Free-2-Play Game Monetization course is an exact copy of the Free-2-Play Game Monetization course that I teach at several universities as part of a broader game business curriculum. It is designed to give a broad and complete understanding of how the F2P can be deployed to monetize your game, regardless of whether you are a seasoned game designer, or a beginner.  </p>  <p>  \t         The course consists of 11 lectures.  </p>  <p>  \t       In the first lecture, we will start with defining what free-2-play really means, so that we all have the same understanding of the term before we get in deeper.  </p>  <p>  \t       A good way to explain free-2-play monetization is by showcasing its role in the user revenue funnel. We will visualize this role in relation to player acquisition and player retention.  </p>  <p>  \t       In the next 8 lectures, we will spend significant time on the two main business objectives in free-2-play game monetization.  </p>  <p>  \t       Lectures 2 through 5 will focus on the first objective, which is to get more players to pay.  </p>  <p>  \t       We will present a pallet of ways in which you can increase the percentage of players that will pay in your game.  </p>  <p>  \t       Lectures 6 through 9 will focus on the second objective, which is to have the players that pay purchase more.  </p>  <p>  \t       Similar as with the first objective, we will provide a variety of methods to increase the so-called ARPPU, the average revenue per paying user.  </p>  <p>  \t       In the tenth lecture, we will present several hybrid monetization models, which are a combination of free-2-play and one or more other monetization methods.  </p>  <p>  \t       And finally, in the last lecture of this course, we will discuss some of the criticism that the free-2-play game monetization model has received and we will present for methods to avoid the negative effects of free-2-play.  </p>  <p>  \t       I believe in practical education, so all lectures contain real-life examples.  </p>  <p>  \t     FYI: any and all proceeds of the sales of this course will go directly  towards further development of Perfect Earth, so effectively you are helping me &#039;crowd fund&#039; a game that teaches children about the impact of their actions on the environment.  </p>", 
    "end_date": null, 
    "title": "Free-2-Play Game Monetization", 
    "price": "20.00", 
    "instructors": "Christian Batist", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/186958_16fc_6.jpg", 
    "course_url": "https://www.udemy.com/free-2-play-game-monetization/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-22T17:04:25Z"
}