{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t        I have been around online sports betting for more than 10 years now, and I share you now step-by-step instructions that helps you to gain an edge over bookmakers and start making good money with sports betting online.  </p>  <p>  \tEvery ideas are explained in detail, I'm not talking about general  concepts here, but specific examples you can copy rightaway with evidences  regarding the strategies. I'm sure you'll be surprised by some of the methods I uncover here.  </p>  <p>  \t        This course covers the followings;  </p>  <ul>  \t<li><strong>The reason behind the fact that winning on the long run is so hard through sports betting</strong></li>  \t<strong></strong>  \t<li><strong>Techniques to follow to beat the bookies though</strong></li>  \t<strong></strong>  \t<li><strong>Basic math behind the strategies</strong></li>  \t<strong></strong>  \t<li><strong>Evidence that these tricks really work</strong></li>  \t<strong></strong>  \t<li><strong>Bet sizing (bankroll management)</strong></li><li><strong>Instructions for US customers - how and where to register</strong></li>  </ul>  <p>  \t        Anyone following this course can be a winning bettor without any serious background. If you know the basics (what is a bookmaker, how to choose events, how to place a bet) you're ready to go.  </p>  <p>  \t    Please be aware that the course covers soccer (european football) related material only, however the strategies can be applied to other sports as well of course with little modifications.  </p><p>US students will be able to make use of two out of five strategies explained, because the rest three of them needs logging into a sports betting exchange site which is - as far as I know - not available for US residents at the moment.<br></p>", 
    "end_date": null, 
    "title": "Guide to Profit from Sports Betting with Real Life Examples", 
    "price": "20.00", 
    "instructors": "Balint Groll", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389004_e638_5.jpg", 
    "course_url": "https://www.udemy.com/profitable-sports-betting-with-real-life-examples/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-08T23:12:10Z"
}