{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong><strong>THIS Udemy course has over 400 students enrolled in less than 24 HOURS and already has multiple 5 STAR reviews!</strong></strong></p><p><strong>WHO WANTS TO START EARNING MONEY WITH POKER? </strong><strong>DO YOU WANT TO W</strong><strong>I</strong><strong>N POKER TOURNAMENTS, BUT YOU DON'T HAVE TIME TO PLAY THE LONG HOURS REQUIRED TO DO SO?</strong></p><p>Many poker players worldwide fail to bring in a consistent winning, and many fail to bring in any winnings at all! The spend and spend to no avail, not realizing their faults and lacking motivation to improve. This course is not for those kind of people.</p><p>If you are reading this, you are already a few steps ahead of the losers in the gambling world, especially if you are a beginner! I want to show you the steps and present the skills required to start <strong>winning money</strong> with <strong>turbo poker tournaments</strong>. What are the benefits of turbo poker tournaments?</p><ul><li>They <strong>TAKE MUCH LESS TIME THAN TYPICAL TOURNAMENTS.</strong></li><li>There are a lot of other beginners that play these (especially at the lowest stakes) which means the competition is <strong>NOT AS FIERCE.</strong></li><li>They are much simpler in structure compared to their more lengthy counterparts, which makes them <strong>IDEAL FOR BEGINNERS!</strong></li></ul>If you are looking to make some extra money playing poker and enjoying your time doing so, then this course is one you will want to try!I want to remind you that you have <strong>NOTHING TO LOSE!</strong> If you choose at some point within the next <strong>30 days</strong> of purchasing this course that this wasn't quite the material you were looking for, you have the ability to <strong>GET A FULL REFUND. NO QUESTIONS ASKED!</strong>I would encourage you to message me personally before taking such action, as I would be more than happy and willing to assist you with any concerns or questions, and would love to hear ways to improve this course! Don't hesitate on helping your poker goals and aspirations come true! Try this course out with nothing to lose! <strong>This will help you on your way to financial and poker success!</strong><p>This course will guide you through the stages of any given turbo poker tournament, grouped together in the following layout:</p><ul><li>Early Stage Play - What should you be doing at the beginning of the tournament? What hands should you be playing? What should you look out for?</li><li>Mid Stage Play - With the dynamics now changing a bit, how should you adjust your strategy? What should your goals be for this stage of the game?</li><li>Late Stage Play - From here until 1st place, what are you going to need to do? What should you aim for? How will you keep yourself on track with so few people left to beat?</li></ul>It's all explained in clear, concise detail for a beginner or novice to pick up and understand. I'm confident you will enjoy this learning experience, and I'm practically certain you will enjoy the rewards these skills can bring!", 
    "end_date": null, 
    "title": "Guide to Winning Turbo Poker Tournaments for Beginners", 
    "price": "20.00", 
    "instructors": "Eric Korber", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557368_6788_2.jpg", 
    "course_url": "https://www.udemy.com/guide-to-winning-turbo-poker-tournaments-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T17:24:14Z"
}