{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Daily </strong><strong>Fantasy Sports – How to Make A Living Playing Daily Fantasy Sports </strong>is the first Udemy course that teaches you how to play the complex and rewarding game of Daily Fantasy Football. Through <strong>numerous lectures</strong>, you'll learn the basics of playing daily fantasy sports and gain a complete understanding of the strategy and analysis you'll need to successfully win throughout the season.</p><p>We've all seen the commercials and advertisements talking about daily fantasy sports. With sites like DraftKings and FanDuels making more millionaires each week than the lottery in some states, it's time that you capitalized on these emerging platforms.  </p><p>Daily Fantasy Football is a game that more than 5% of the US is actively involved in, <em>and it is a fabulous way to earn a steady profit</em>, season after season, if you're good. In 2014, I earned over $25,000 playing this game,<strong> and every minute of it was pure joy</strong>.</p><p>You can easily learn the same skills that I have used to dominate my daily fantasy leagues across numerous sports. I'll show you the <em>sure-fire winning strategy</em>, as well as <strong>the best types of leagues to join and play in</strong>. Following the strategy that is set out in this course practically <em>guarantees</em> success.</p><p>I will share all of my secrets, from which leagues to play in and how to select players each week, to how to maintain your bankroll to have a profitable season. I use real-life examples, current players and real statistics to provide you concrete samples on how you can profit from these platforms.</p><p>Read some of the reviews below from others whom I have helped in the past. Here are some of the highlights:</p> <ul> <li>\"<em>I have been playing daily fantasy football for a year and I finally learned some awesome ways to look at the game. I never looked at the leagues and the games this way, but as soon as I was opened up to this strategy, it all made sense.</em> I really recommend this course to anyone wanting to seriously make money playing daily fantasy football.\"</li> <li>\"Marcus organized the information in this lecture very well. His knowledge on the subject is absolutely solid. <em>He knows what he is talking about and he provided excellent information.</em>\"</li> </ul><div><br></div> <p>Also, don't forget about Udemy's 30-day money back guarantee. You have nothing to lose, except more of your daily fantasy football leagues. Join now and start winning!</p>", 
    "end_date": null, 
    "title": "How To Make A Living Playing Daily Fantasy Sports", 
    "price": "20.00", 
    "instructors": "Marcus Hayne", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619508_d2c1.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-living-playing-daily-fantasy-sports/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T17:19:00Z"
}