{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>What determines your WIN/LOSS in a chess game?</strong> Whether or not you win or lose is determined by your <u>opening preparation</u>, your <u>middlegame skills</u>, and your <u>endgame technique</u>.</p><p>At the same time, the opening phase is MORE important because <strong>if you don’t play it well, you will lose sooner than you can demonstrate your middlegame/endgame skills</strong>. </p><p><strong>How do you play an opening successfully?</strong></p><p>1) You need to choose the right opening variations (your opening repertoire), and learn the NECESSARY lines within them.</p><p>2) You need to know the general rules/principles of\n opening play, and how you can find correct moves in unknown opening \npositions.</p><p>Regarding the 1<sup>st</sup> item – <strong><u>opening variations</u></strong>\n – there are a lot of existing chess books/DVDs about virtually any \nopening that you can think of. Some of these tutorials are even pretty \ngood. However, there are still some problems here:</p><p>- Studying various opening variations takes a lot of your time.</p><p>- As we’ve already discussed, you can’t learn <em>everything</em> anyway.</p><p>- Your opponents have access to the same tutorials that you have.</p><p>- There are opening tutorials about all possible opening variations, and you don’t know what will work best for YOU.</p><p>As for the 2<sup>nd</sup> item – <strong><u>the general rules/principles of an opening play </u></strong>– this topic is almost completely missing!</p><p>By studying the course \"How to play chess with black pieces\" you'll acquire a solid weapon against 1.d4 move. You'll learn everything that you need in 1 neat course. The opening variations are analyzed deeply yet they are easy to digest. Finally, the detailed explanations will help you understand the opening moves and remember them flawlessly.</p><p>The course contains 6 main sections - each one is dedicated to one of the main lines of the Nimzo-Indian Defense. Firstly, you'll learn a video lesson that will guide you through the main plans, ideas and variations of a particular line. Next, you'll find extensive analysis of the lines in the practical part. <br></p>", 
    "end_date": null, 
    "title": "How to play chess with black pieces (Nimzo-Indian Defense)", 
    "price": "25.00", 
    "instructors": "Igor Smirnov, Chess Grandmaster from Georgia Levan Aroshidze", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616666_f944.jpg", 
    "course_url": "https://www.udemy.com/nimzo-indian/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T15:49:10Z"
}