{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  This course features an extremely easy to follow animated presentation covering the basics of chess. You will learn the absolute essentials of the game including how to set up the board, how the pieces move and how to play. This course is great for beginners and will guide you through the basics of how to properly play the game.  </p>  <p>  \t<strong>BENEFITS OF THIS COURSE</strong>  </p>  <p>  \t  In this course you will learn how to properly set up the chess board and where to place the pieces. We will go over where the pieces are positioned on the board, how the pieces move including how they capture other pieces and their basic powers.  </p>  <p>  \t<strong>  WHO IS THIS COURSE FOR?</strong>  </p>  <p>  \t  This course is perfect for anyone interested in learning how to play chess and has zero to minimal knowledge. The course is organized in a structure that is easy to follow and review if needed. The course is great for children ages seven and above. The course is also great for senior citizens including grandparents.  </p>  <p>  \t<strong>  WHY TAKE THIS COURSE?</strong>  </p>  <p>  \t  Chess does not have to be a hard game to learn to play you just need proper instruction. This course is designed to explain the absolute basics of chess to anyone interested in learning how to play the game.  </p>  <p>  \t<strong>  WHAT YOU WILL LEARN</strong>  </p>  <ul>  \t<li>How to set up the board and the pieces</li>  \t<li>Learn each piece and how they move</li>  \t<li>How to capture other pieces</li>  \t<li>How to win the game</li>  \t<li>Exceptions and basic rules of the game</li>  \t<li>The benefits of chess</li>  \t<li>Common myths and misperceptions about chess</li>  </ul>  <p>  \t  Thanks for your interest! I hope you enjoy the course.  </p>", 
    "end_date": null, 
    "title": "Learn Chess from a Nut!", 
    "price": "35.00", 
    "instructors": "Andy Smith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/194712_4d4e_3.jpg", 
    "course_url": "https://www.udemy.com/learn-chess-from-a-nut/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-06T20:22:59Z"
}