{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>CREATE UNIQUE LEGO CUSTOM SETS USING SIMPLE PIECES VIDEO TUTORIALS</strong></p><p>In this course you will learn how to master building simple yet challenging creations using LEGO bricks. Most LEGO collectors should be able to complete this challenge as the elements used in this course are easy to find or can be substituted with simpler yet same function pieces. </p><p>This is a an awesome course to challenge a geek, nerd, a kid or any lego fan into trying to build every one of those creations featured in this course. The level of difficulty  goes up from newbie to professional and so does the fun. In the videos I explain the different methods and tricks I used to create those awesome creations.</p><p><strong>FEATURING</strong></p><p>16 Video lectures</p><p>Unique and different custom creations for yourself or to resale on eBay </p><p>Easy to follow video instructions with voice over or relaxing music</p><p><strong>Great to give this course as a gift has many unique ideas </strong><strong>that every geek will love</strong></p><p><strong><em></em></strong><em>Note</em><em>: Purchase of this course only gives you access to a digital product no LEGO are included you must have your own pieces to create featured custom sets</em></p><p><em>Disclaimer: LEGO® is a trademark of the LEGO Group of companies which does not sponsor, authorize or endorse this product.</em> </p>", 
    "end_date": null, 
    "title": "LEGO Create your own custom sets video tutorials", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455244_59c3_5.jpg", 
    "course_url": "https://www.udemy.com/legocustoms/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T23:34:39Z"
}