{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \tThis course is about getting you to solve the most famous puzzle in the world, Rubik&#039;s cube. If you tried to solve it in the past and failed, worry not...I am here to guide you step by step through my unique method.  </p>  <p style=\"\">  \tI will be using 3D model software in most of my lectures instead of a real cube. I found out that it makes you see the moves far better, than if I used a real one.  </p>  <p style=\"\">  \tThe good news that <strong style=\"\"><em style=\"\">I will not be using notes</em>!</strong> Yes, that&#039;s right… I did not learn with it, so I will not teach it. Instead, I will show you the moves with arrows and shapes.  </p>  <p style=\"\">  \tI believe anyone can solve the cube if he learned it like I did, that is learn a few moves and then practice it for a day, and then a few moves and so on, and that&#039;s exactly what I will be doing with you.  </p>  <p style=\"\">  \tAs the title says, you will learn to solve the cube in 4 days... but that does not mean you will be FAST in a week! NO, it will take you some time depends on how much you practice, to solve the cube in 3 minutes or less,and you will learn in a way that will enable you to memorize all the steps in 4 to 7 day.  </p>  <p style=\"\">  \tSo why take this course? Because it&#039;s unique, it&#039;s simple, and I don&#039;t use the cube&#039;s notes.  </p>", 
    "end_date": null, 
    "title": "Master Rubik's Cube in 4 days!", 
    "price": "20.00", 
    "instructors": "Hani Gamal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/213744_4abc_4.jpg", 
    "course_url": "https://www.udemy.com/master-rubiks-cube-in-just-4-days/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-09T08:56:58Z"
}