{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">What in the world is Minecraft anyway?</strong></p><p>You’ve heard of Minecraft. The game has taken over the world, and captured every kid’s imagination. Maybe you don’t have any clue what it is, but you don’t want to ask the kids to explain it, because they will give you THAT look (like you’re dumb or something) not to mention, they aren’t the best with details. Yeah, we’ve all been there. I’ll give you the scoop, step by step on what Minecraft is, what it is good for, and how to get started, so you can try it out for yourself if you want. I’ll treat you like an adult and show you what the kids are up to.<br></p><p><strong class=\"redactor-inline-converted\">Why this course?</strong> <strong>Here's what you get:</strong></p><p>Instead of listening to high-pitched 12 year olds on YouTube talk for hours on end and never get to the point, I’ll give you everything you need to know about finding diamonds in a concise, useful format that allows you to pause the video, and try it out yourself. This is the de facto crash course in video game awesomeness from a parent of 5 and veteran Minecrafter. Whether you are a parent, a teacher, an aunt, uncle, grandparent or godparent I’ve got you covered.</p><p><strong class=\"redactor-inline-converted\">You'll be able to save the day, in game and out:</strong></p>\n\n<p>If you’re too busy to sit down and play -- totally understandable, we all work for a living -- you still won’t be in the dark (where the bad guys are), because you’ll have a great reference for later when you need it. I’ll even show you how to fix problems, repair corrupted files in seconds, and even beat the game. Don't worry, you can do it with my help. You'll be the Minecraft hero and you won’t even have to wear a cape. Unless you’re into that or whatever.</p><p><br></p><p><strong class=\"redactor-inline-converted\">Here's what you get from this course?</strong></p>\n\n<ul><li>4.5+ hours of HD Video, taught in a conversational style by an expert that will help you learn by experience</li><li>The help and support of a responsive instructor who can answer questions and help with problems at any point</li><li>Good for a parents, teachers, aunts, uncles, grandparents, godparents or anyone who wants to know what Minecraft is about and why the kids can’t get enough.</li></ul>", 
    "end_date": null, 
    "title": "Minecraft 101: Learn to Play, Craft, Build, & Save the Day", 
    "price": "30.00", 
    "instructors": "Ryan Carter", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448994_f361_6.jpg", 
    "course_url": "https://www.udemy.com/minecraft-basics-for-parents-teachers-educators/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T23:28:33Z"
}