{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<ul>\r\n\t<li>Learn the Skills You MUST Have to be a Successful Online Poker Player</li>\r\n\t<li>Know the Ways Poker is Changing - Stay Ahead of Your Competition!</li>\r\n\t<li>Learn How to Study Effectively, Efficiently and Improve Faster than Ever Before</li>\r\n\t<li>Easy to Follow Step-by-Step Format Fosters Personal Review and Long-term Improvement</li>\r\n</ul>\r\n<p>\r\n\t    This poker course is the result of years of personal study, hundreds of hours of student development, and has been compared and tested on more than 50 students internationally.  The material is taught by a multi-game professional player and international poker coach, covers a significant number of topics regarding the strategy, pitfalls and mindset needed to be successful playing online super-turbo poker. The course is structured in an information-rich, step-by-step approach to mastering your mistakes and beating the game. Taught by a significantly winning player who has developed simple strategies and coaching techniques that will help you improve your play.   A novice can become a winning player by implementing this invaluable information.\r\n</p>\r\n<p>\r\n\t    You&#039;ll learn from lectures covering critical terminology, in-game examples, strategy techniques, tool usage and complete analysis of a full sit-n-go tourney.  After you&#039;ve completed the course, you&#039;ll be armed with new skills to combat your specific poker weaknesses. You&#039;ll not only have a deeper understanding of the game, you&#039;ll have increased confidence in your abilities.\r\n</p>", 
    "end_date": null, 
    "title": "Online Poker: Learn to Beat the Super-turbos", 
    "price": "20.00", 
    "instructors": "Colin Gilliland", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147976_4cf3.jpg", 
    "course_url": "https://www.udemy.com/onlinepoker-beatsuperturbos/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-16T19:26:21Z"
}