{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>TradeUp Today brings you another way to improve your life with this course. This course is designed to teach you the best way to Blackjack. If you have played and lost at Blackjack before you will learn strategies which will dramatically increase your probabilities of winning and allow you to play for a long time with little money.</p><p>This course is short enough to watch on your flight to Vegas or if you have minimal time just download the handouts and take them with you to the casino!</p><p>If you are intimidated by table games and spend most of your time at the slots this course will take away that intimidation and let you play with confidence.</p><p>Through a series of video lectures and self quizzes you will learn everything about playing Blackjack in Vegas including:</p><ul style=\"\"><li>choosing where to play in Vegas</li><li>deciding which table to play at in the casino</li><li>bring the right amount of money to play</li><li>assessing your hand against the dealers to make the best move possible</li><li>using side bets to increase your profits</li><li>using card counting to improve your probabilities of profit</li><li>correctly exiting the table casino</li></ul>Each section of this course come complete with handouts you can print out and take with you to the casino as well as self quizzes to assess your knowledge of the material.<p>So many people walk up to the Blackjack table and walk away a few minutes later having lost all their money. For the price of a couple of losing Blackjack hands you can finally turn that losing streak around, have a lot more fun and spend a lot less money at the Casino</p><p>Enroll now and TradeUp your Blackjack playing experience today!</p>", 
    "end_date": null, 
    "title": "Play Blackjack for Fun and Profit in Vegas or any Casino", 
    "price": "20.00", 
    "instructors": "Mark Radcliffe", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535466_8d6e_2.jpg", 
    "course_url": "https://www.udemy.com/play-blackjack-for-fun-and-profit-in-vegas-or-any-casino/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T20:18:48Z"
}