{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><span></span><strong><em>“Awesome Strategies:</em></strong><em> This course is perfect for anyone who struggles at the poker tables. Poker has always been a hobby for me, but I still hated the idea of losing. This course changed everything for me and it is applicable to players of all different skill levels. This course is well organized from beginning to end which makes it easy to follow.\" – Doug </em><br></p><p><strong>LEARN TO CRUSH THE POKER GAMES JUST LIKE ME</strong></p><p>Are you new to poker or a struggling poker player? Do you want to be a profitable poker player? Do you want to learn to crush tournaments and cash games either offline or online? Do you want to learn how to crush the poker tables? If so, this course is for YOU. This course will teach you everything that you must know to crush the poker tables to turn your buy-ins into tons of profit. </p><p>I have<strong> won over $100,000</strong> in the past year <strong>only playing $1/3, $2/5, and $5/10 tables</strong> in my spare time and I'm going to show you how to do just as well!</p><p><strong>BECOME A MASTER OF POKER</strong></p><p>In this course you'll learn everything you need to know to crush the poker tables. I will teach you how a tight-aggressive approach to the game that will get you tons of profits through a fundamental understanding of psychology, poker strategy and tactics.</p><ul>\n<li>Master <strong>Fundamental Poker Strategies</strong> necessary to crush the poker tables</li>\n<li>Understand <strong>Poker Psychology</strong> that will allow you to outplay your opponents and attack their weaknesses</li>\n<li>Master <strong>Pre-Flop Strategies</strong> that to learn which hands you should and can play profitably</li>\n<li>Learn the essential <strong>Poker Math</strong> all poker players MUST know</li>\n<li>Understand <strong>Post-Flop Basics</strong> that will allow you to win more pots</li>\n<li>Learn the secrets to profitable <strong>Continuation Betting and Flop Betting </strong></li>\n<li>Learn to successfully <strong>Bluff and Semi-Bluff</strong> your opponents out of pots at the right time</li>\n<li>Learn to navigate so you can <strong>play the turn and rivers</strong> like a professional to make more money doing so</li>\n<li>And much more...</li>\n</ul><p>If you are a beginner who simply wants to maximize their winnings or even if you are a veteran who is also struggling as a poker player that doesn't feel that you are doing the best you can, this course is JUST for you! Through this course, you'll learn everything you need to know to crush the poker tables. </p><p><strong>WHAT YOU WILL GET OUT OF THIS COURSE</strong></p><p>Once you finish this course, <strong>you will be a dominant player and feared opponent</strong> at the poker table who will easily be able to crush any game of poker. You will not only <strong>win a lot more money</strong> at the poker tables, but you will also <strong>be a much happier poker player</strong> as you watch<strong> your profits skyrocket</strong> throughout your career!</p><p><em></em></p><p><strong>SO WHAT ARE YOU WAITING FOR? CHANGE YOUR FORTUNES AND START CASHING OUT ON THE POKER TABLES TODAY!</strong></p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Poker Strategy: How to Win Playing Poker Online & Offline", 
    "price": "20.00", 
    "instructors": "Marcus Hayne", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638908_1d22.jpg", 
    "course_url": "https://www.udemy.com/hold-em-poker-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T04:51:09Z"
}