{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">What is this course about?</strong></p><p>This is one of the most comprehensive poker courses that you can take on Poker Psychology and it goes to the core of Psychology to help you win. I am the author of \"Secrets of Poker Pros, Psychology, Tilt and Stress Relief For Aspiring Poker Players\" and you get a lot of psychology primer from this book. I explain in depth a lot of psychological factors why most players never become the winning players they could. </p><p><strong class=\"redactor-inline-converted\">Freebies</strong></p><p>You get this awesome book as a course add-on resource and I give a video introduction of the important parts of this book. For all the die hard fans on poker who want to explore much much more and go over a lot more sections apart from psychology like tilt, stress or game technical's this course is a must buy. </p><p><strong class=\"redactor-inline-converted\">What this course can help you achieve?</strong></p><p>I believe this course has the potential to unlock the real poker player inside you. There was an average guy and he achieved the impossible and won the Olympic gold medal and he wrote a book on it, and I share you a lot of secrets from it as well as a real poker psychology written by Robert A Barron and I have gone into a lot of depth into several psychological aspects for winning in poker that you won't find anywhere and I believe this course will help you ultimately win more and every poker player from newbie to expert high stakes player should take this. </p>", 
    "end_date": null, 
    "title": "Psychology Of Winning Poker", 
    "price": "20.00", 
    "instructors": "Vaibhav Jain", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/824834_8bd2_3.jpg", 
    "course_url": "https://www.udemy.com/pokerpsychology/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-18T08:26:49Z"
}