{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>James is the author of the book series Fly Me To the Moon Visual Roulette Prediction Series (MiNi,MeGa &amp; GeGa),Also the Developer and owner of The Roulette GeGa mobile application which the world's first and only unique app that explains the Visual Roulette Prediction proven and tested winning Roulette Strategy. Based on 30 years Casino experience working as a roulette Dealer i will provide you with an insider knowledge on how the game of Roulette works and how it is Designed.I will reveal the only Design flaw that was made on the American wheel layout that made the American wheel harder to beat for all bets yet easier to beat for only one type of bets that is rarely used and hard to notice.</p><p>Taking this course will help you reach financial stability and have a fixed income without worrying anymore about paying your bills,you mortgage,your loans or even helping friends and family members.I travel to Las Vegas each weekend and average <strong>$ per weekend </strong>playing Roulette,It helped me start my real estate investment business as well as other technology investments. </p><p>I personally promise you this with an additional 30 days money back guarantee not from me but from Udemy too,Once you purchase the course ,you become a family and i treat every student like a family,you are my responsibility and i will not rest assured before you reach your financial goals,I can proudly brag and say that i am the only person in the whole world that could beat Roulette and made consistent money off of playing Roulette </p><p>Every single technique which I reveal in this course is easy to put into place in minutes - and can give you instant returns.</p><p>Nothing is kept secret - I reveal all I know ... and as I test even more things, those that are successful are added to the course - at no extra cost to you! This is a course that will continue to grow and grow.</p><p>As well as the Udemy 30 day guarantee, you have my personal promise that you will be wowed and delighted by what you'll learn in the next 1 hour ... and you'll be kicking yourself that you have been missing out on fabulous potential earnings.</p><p><em>What this course is not:</em></p><p><em>I won't teach you anything that in any way breaks Udemy's terms, rules, conditions etc, whether they are written or implied - I value my Udemy earnings too much!</em></p><p><em>This course is not backed or produced by Udemy - it's all my own work ... but the excellent Udemy staff are there to help you, too, of course!</em></p><p><em>This Course does not guarantee you income or any winnings,It is just to help you have better odds walking out a winner playing Roulette.</em></p><p><em>We are not liable of any loses you may incur.</em></p><p><em>Gambling is at your own risk.</em></p>", 
    "end_date": null, 
    "title": "Roulette Flaw: Guide to Playing Roulette Anywhere", 
    "price": "20.00", 
    "instructors": "James McArthur", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543656_5d77_2.jpg", 
    "course_url": "https://www.udemy.com/roulette-flaw-guide-to-playing-roulette-anywhere/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T00:40:54Z"
}