{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t <em style=\"\">Did you get a Rubik&#039;s cube but it is on the shelf since you first shuffled and then never managed to solve it? Dust it off, I&#039;ll show you how to solve it.</em>  </p>  <p>  \t I learned to solve the cube when I was 8, though my sister decided not to teach me the very last step and I had to figure that out myself. Since then, I taught a dozen of my friends how to solve the Rubik&#039;s cube with the very same method, and we challenge each other to see who&#039;s the quickest. My best time is 1 minute 23 seconds. Are you up to the challenge, too?  </p>  <p>  \t I&#039;m not good at 3D modelling or high-tech video editing, but I learned to create good quality videos and added what I lacked from Rubik&#039;s cube tutorials: just a few easy steps that would be understandable even for an 8-year old and a bit of personal touch. So let me sit down next to you and show you how to solve the cube with my 6 super-easy steps. You&#039;ll see the videos as if the cube was in your hand, I&#039;ll point out the shortcuts, and mistakes, and well... I&#039;ll help you practice as long as you master the Rubik&#039;s cube!  </p>  <p>  \t I also added some extra content about how to choose the proper cube if you don&#039;t have one, do fun patterns once the cube is solved, do some basic maintenance (please-please, do not remove the stickers, ever), and what to do if you&#039;re facing a cube with nothing but  mirror-like sides...  </p>  <p>  \t <em style=\"\">So are you up to my challenge?</em>  </p>", 
    "end_date": null, 
    "title": "Solve Rubik's cube in 6 easy steps", 
    "price": "20.00", 
    "instructors": "Noemi Balazsik", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/247704_fd4f_3.jpg", 
    "course_url": "https://www.udemy.com/solve-rubiks-cube-in-6-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-21T16:20:50Z"
}