{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>STREET MAGIC: The ultimate magic tricks show</strong></p><p><em>The purpose of this course is purely for entertainment a good magician does not revel his tricks. I want you to experience real street magic at the end of the show I want you to say how in the world did he do that! Prepare to see a show like no other on Udemy see you inside...</em></p><p><em></em><strong>What is this course about...</strong></p><p>Years of working as a teacher gave me time to perfect this craft during lunch breaks kids loved to watch the magic tricks so I have decided to bring you into the street magic show.</p><p>This course will teach you the act of stage performance and show you tricks done which are mind-blowing. You will see how story telling is important to getting the act across and how to perform it accurately without reveling the tricks. A good magician does not revel his tricks if you are curious watch the videos a few times over and see if you can catch how I did those tricks. </p><p>No video editing done to create the magic, the act would have been made exactly the same if you watched me performed this in front of you. </p><p><strong>This course is for...</strong></p><ol><li>Learn how to tell a story for magic performance</li><li>Kids and adults want to watch a magic show</li><li>Watch mind-blowing tricks performed</li></ol><p><strong>Do not take this course if...</strong></p><ul><li>You do not believe in magic</li><li>Want to learn magician secrets</li></ul><p>All tricks done are created with the purpose of giving the audience how did he do it reaction! by giving out the tricks it takes away the magic of the act. I want you to enjoy the show and try to figure out how each trick was actually done. All those tricks can be bought in a magic shop online or offline links are NOT going to be included. </p><p><br></p>", 
    "end_date": null, 
    "title": "street magic: The ultimate magic tricks show", 
    "price": 0, 
    "instructors": "Sergey Kasimov", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584744_258c_2.jpg", 
    "course_url": "https://www.udemy.com/streetmagic/", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-16T18:30:20Z"
}