{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>What This Course Will Help You Achieve?</strong>\n\n  </p>\n\n<p>This course will help you become the poker player that you desire to be, a player who has a positive win rate and one that pulls of money from the tables by having the necessary skill and expertise in the game. This course is completely unique in a lot of aspects and goes in depth to some of the core issues that prevent players from winning. </p>\n\n\n\n<p><strong>How This Course Came About</strong></p>\n\n\n\n<p>I had a dream of switching to become a professional poker player and I had a decent job on Times Square being the IT analyst of one of the largest financial firms. I started reading out and of course I read all the material on the market by the best pros but something was lacking and over the years I learnt a lot by experience, then I finally quit my job, I had already been playing live successfully in various card rooms in USA like Ameristar Kansas City, Harrah’s Kansas City, Atlantic City, Vegas and over several years I found out that bookish knowledge is not enough to win in this game. I also then started to help a lot of people on the circuit and I taught several players how to win who were astounded by my results. I also started writing books because I have affection for writing. Over the last several years I sold books over 25 in number through Amazon and I achieved success in this regard and finally I brought out a course on Udemy seeing that there is a good demand for poker courses on Udemy. \n\n  </p>\n\n\n\n<p><strong>The Power Points Of This Course</strong>\n\n  </p>\n\n\n\n<p>Along with the video lessons I am giving you two books free which are selling on Amazon the first book is “Texas No Limit Hold’em Quiz With Answers” and 2<sup>nd</sup> book is “New Concepts For Texas No Limit Hold’em” These are written by my pen name Viktor and I also discuss few concepts and also give away these books for free. \n\n  </p>\n\n\n\n<p>Then I wrote another book “Secrets of Poker Pros, Psychology, Tilt and Stress Relief for Aspiring Poker Players” this book has been bought by players around the globe and they have liked it, some readers have emailed me and said that I explain the concepts better than several North American writers. \n\n  </p>\n\n\n\n<p>I know how life is like after switching from a Corporate Job To A Professional Cash Game Player and the tips that I will give to you are priceless. I also will give you a lot of tips not on just Poker but other life tips as well. \n\n  </p>\n\n\n\n<p>I go in depth as to why poker players will lose in this game and what you need to do to win in this tough game that keeps getting tougher every day. \n\n  </p>\n\n\n\n<p><strong>Why Readers Of My Poker Books Too Should Buy This Course</strong>\n\n  </p>\n\n\n\n<p>I have written thousands of pages of Poker Courses and to digests all this information will take a very long time, and of course a lot of points will be scattered and I believe that with this 2-3 hours of video series I will be able to give you the gist of my knowledge and tell you everything that I feel is necessary. This is the fastest way to learn, plus I also give out two books so those that are really hungry to improve. \n\n  </p>\n\n\n\n<p>I also plan to keep adding more videos and more knowledge to this course and maybe down the line I will add other books too for free for my students and fellow poker players. </p>", 
    "end_date": null, 
    "title": "Texas No Limit Hold'em Cash Game Professional", 
    "price": "20.00", 
    "instructors": "Vaibhav Jain", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/816052_0590_2.jpg", 
    "course_url": "https://www.udemy.com/pokercashgames/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-08T03:24:43Z"
}