{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Este curso é uma versão online do curso presencial ministrado na Dealer Pro, a primeira escola de dealers de poker do Brasil; a Dealer Pro é uma empresa pioneira neste vibrante mercado, e o curso online conta com a metodologia consagrada que nossos alunos encontram em nossas aulas, mas com a objetividade do formato digital.<br style=\"\"><br style=\"\">O curso é apresentado por André Schuartz, o fundador da Dealer Pro, que tem experiência de anos de trabalho em cassinos nos exterior. Em lições breves e objetivas, ele explica todos os conceitos que envolvem a profissão do dealer, desde as melhores práticas de conduta e comportamento, como anunciar apostas, e técnicas de embaralhamento. <br style=\"\"><br style=\"\">O curso também proporciona um aprofundamento nas regras do poker, explorando confrontos de mãos, sinais dos jogadores, e estruturas de apostas (entre elas o Limit, o Pot Limit e o Side Pot), através de animações e segmentos visuais dinâmicos que complementam as lições apresentadas.<br style=\"\"></p><p style=\"\">O curso contém 16 videoaulas dividas em dois módulos: o primeiro é dedicado a apresentar e fixar os essenciais do poker, e o segundo sobre o Texas Hold&#039;em, suas particularidades e sistemas de apostas. Ao término do curso, o aluno estará totalmente capacitado para poder começar a exercer a função de dealer num ambiente profissional.<br style=\"\"><br style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Torne-se um Dealer de Poker na Modalidade Texas Hold'em", 
    "price": "50.00", 
    "instructors": "Dealer Pro", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473170_aea4_4.jpg", 
    "course_url": "https://www.udemy.com/curso-online-dealer/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T22:50:25Z"
}