{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"> Beat Craps by Controlling the Dice!     </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Proper betting to exploit your edge over the casinos </li>  \t<li style=\"\">How to bet on random rollers and the proper bet spreading techniques </li>  \t<li style=\"\">How to get more comps for less risk and the proper bankroll </li>  </ul>  <p style=\"\">  \t        Become the casinos&#039; worst nightmare! Beat casino craps by using a  controlled dice throw! This video will show you how to develop a Golden  Touch at craps.  </p>  <p style=\"\">  \t        Frank Scoblete, gaming&#039;s #1 best-selling author, and Dominator, the world&#039;s greatest dice controller, along with Golden Touch dice control instructors, gaming columnist &quot;Stickman,&quot; and best-selling author Bill Burton teach you the Golden Touch dice control method to beat the game of craps! Dominator was divine&mdash;a hint: he was so good that no one will believe what he did - except we had nine witnesses to it thankfully and also filmed it! You will see their shots from every angle. From start to finish. Also complete statistics of their throws.  </p>  <p style=\"\">  \t<strong style=\"\">The Golden Touch&trade; Dice Control Online Course</strong> is a superior, professional product in every way. It&#039;s <strong style=\"\">loaded with visuals and insider information</strong>.  </p>  <p style=\"\">  \t        There are <strong style=\"\">over 200 shots shown</strong> in the course from all angles - front, side, back, tabletop; plus landings, bounces, back-wall hits. There is also excellent <strong style=\"\">slow motion footage</strong> too so you can actually see how the dice hit the back wall and land. Some shots go right into the camera from head on. Wow! <br style=\"\">  \t <br style=\"\">  \t <strong style=\"\">We did not edit any shots</strong> -  you&#039;ll see an actual practice session with dozens of shots. Plus all  the shots throughout the rest of this online course.  This is a professional, high quality video course&mdash;not a homemade one.<br style=\"\">  \t <br style=\"\">  \t         The visuals are remarkable. This online course can be used over and  over when you are concerned that your form or throw is somewhat off.  </p>  <p style=\"\">  \t        Spend around two hours with the pros!  </p>", 
    "end_date": null, 
    "title": "Win at Craps with Golden Touch", 
    "price": "20.00", 
    "instructors": "Dom LoRiggio", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/122424_ba40_6.jpg", 
    "course_url": "https://www.udemy.com/win-at-craps-with-golden-touch/", 
    "currency": "USD", 
    "subject_name": [
        "Gaming"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-19T21:32:31Z"
}