{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    Have you ever wondered about planets in other solar systems? Have you ever thought about the possibility of life elsewhere in the Universe? For the first time in human history, we know that planets around other stars not only exist, but are common!\n\nAlien Worlds focuses on the search and characterization of planets orbiting other stars (called extrasolar planets or “exoplanets”). Over the course of nine modules, we will learn some of the techniques used to discover the thousands of known exoplanets and will discuss how we can use basic scientific tools to characterize the sizes, masses, compositions, and atmospheres of exoplanets. We will also learn about the diversity of stars in the Galaxy to understand how stellar properties affect exoplanet detection techniques and influence planetary formation and habitability.\n\nIn addition to the exploration of exoplanets, students in Alien Worlds will gain a basic understanding of light, gravity and motion, and be introduced to some of the most extreme life on planet Earth. We will hear from experts at the forefront of exoplanet science and interact with other participants and instructors through social media and online tools. Students will leave Alien Worlds with a better understanding of their place in the Universe and the skills to comprehend the wealth of new discoveries surrounding the countless worlds around distant stars.\n\n                                    ", 
    "end_date": "2015-08-04T00:00:00Z", 
    "title": "ASTR105x: Alien Worlds: The Science of Exoplanet Discovery and Characterization", 
    "price": 0, 
    "instructors": "Andrew West", 
    "institution_name": [
        "Boston University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/alien-worlds-science-exoplanet-discovery-bux-astr105x-0", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-06-02T00:00:00Z"
}