{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    Quels sont les constituants élémentaires de notre univers ? Comment s’organisent-ils pour former la matière ? Comment l’univers s’est-il formé ? Comment évolue-t-il depuis le Big-Bang, il y a environ 14 milliards d’années ?\r\nLe MOOC «des particules aux étoiles» vous conduira dans un fantastique voyage vers l'infiniment petit et l'infiniment grand. Près de 70 chercheurs de l'université Paris-Saclay vous présenteront les grandes découvertes récentes et les nombreux défis scientifiques et technologiques auxquels ils sont confrontés.\r\nNous verrons également comment ces travaux peuvent trouver des applications sociétales et quelles sont les compétences que peuvent acquérir les doctorants de nos disciplines ainsi que les débouchés possibles après la thèse.\r\nWhat are the elementary constituents of our universe? How do they organize themselves to form matter? How was the universe formed? How has it evolved since the Big-Bang about 14 billion years ago?\r\nIn the MOOC “from particles to stars”, we invite you to a fantastic journey into the infinitely small and the infinitely large, along with nearly 70 scientists from the university Paris-Saclay, who will present the scientific and technological challenges they face.\r\nWe will also see how this research may leads to societal applications and what are the experiences and skills that can acquire doctoral students doing a thesis in our disciplines and the potential opportunities after the thesis.\n\n                                    ", 
    "end_date": "2016-01-25T00:00:00Z", 
    "title": "Des particules aux étoiles", 
    "price": 0, 
    "instructors": "Frédéric Fleuret and Frédéric Déliot", 
    "institution_name": [
        "Université Paris-Saclay"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/ParisSaclay/71001/session01/about", 
    "duration": "10 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-11-16T00:00:00Z"
}