{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    Earth observation (EO) encompasses a series of techniques that use remote sensing to monitor changes to our climate, and natural and built environment.\n\nGet an introduction to optical Earth observation\n\nThis free online course will provide an introduction to optical Earth observation - monitoring our planet from satellites, using photography, imaging in various wavelengths, lidar and other optical sensing technologies.\n\nYou’ll find out how satellite data is acquired and used, the range of data types available, and the terminology and techniques involved. The course will also provide detailed case studies of how this data is used in diverse fields, from climate science to humanitarian relief, monitoring of urban change to agriculture, and many other areas.\n\nLearn with ESA - Europe’s Earth observation leader\n\nThe course has been developed by the European Space Agency (ESA) - the leading enabler of satellite Earth observation science and technology in Europe.\n\nIt will use case studies, real-world applications, and data from ESA and other Earth observation programmes, to help you discover:\n\n\n  how we observe and measure the Earth with optical sensors\n  how satellite data is used alongside other forms of measurement\n  the main types of data acquired through Copernicus and other satellites\n  how to conduct simple analysis using a range of different types of optical Earth observation data\n  how optical EO data is used in a range of scientific, policy and decision-making areas, in conjunction with models\n\n\nAlongside articles and videos, interactive visualisation tools, additional resources and discussions with other learners will provide you with the opportunity to understand Earth observation in depth.\n\n\n                                    ", 
    "end_date": "2016-10-17T00:00:00Z", 
    "title": "Earth Observation from Space: The Optical View", 
    "price": 0, 
    "instructors": "Martin Wooster", 
    "institution_name": [
        "European Space Agency"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/optical-earth-observation?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-12T00:00:00Z"
}