{
    "selfpaced": true, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    We have learned a lot recently about how the Universe evolved in 13.7 billion years since the Big Bang. More than 80% of matter in the Universe is mysterious Dark Matter, which made stars and galaxies to form. The newly discovered Higgs-boson became frozen into the Universe a trillionth of a second after the Big Bang and brought order to the Universe. Yet we still do not know how ordinary matter (atoms) survived against total annihilation by Anti-Matter. The expansion of the Universe started acceleration about 7 billion years ago and the Universe is being ripped apart. The culprit is Dark Energy, a mysterious energy multiplying in vacuum. I will present evidence behind these startling discoveries and discuss what we may learn in the near future.\n\nThis course is offered in English.\n\n                                            Syllabus\n                        From Daily Life to the Big BangUnderstanding the Universe in which we live and how to probe it can begin with simple daily life experiences such as night and day and the four seasons. Starting from these observations, we will take a journey from our local Earth at the present time all the way to the edge of the universe and back to its birth, learning the techniques and findings in modern physics that provide us this understanding.Birth of Elements and Higgs BosonWe are made of chemical elements. So one of the fundamental questions “where do we come from?” leads to another question: “how were elements born?”. This is related to the Higgs Boson, an important particle in answering this question which remained elusive until its discovery was recently announced on July 4, 2012. In this module, we will learn recent research outcomes on these topics.Dark Matter and Anti-MatterIn this module, we will learn about dark matter and anti-matter -- some of the more mysterious sides of the Universe. We know dark matter played an important role in the formation of stars and galaxies, but much of properties are still unknown to us. In another strange mystery, we will see how the beginning of the universe started with equal amounts of matter and anti-matter, yet somehow only matter (which we are composed of!) survived.Inflation and Dark EnergyAt the very beginning, the Universe exponentially expanded during a period known as the cosmic inflation. Recent studies suggested that the Universe has entered into another stage of expansion, considered to be caused by 'mysterious' dark energy. In this module, we will learn about inflation, dark energy, and the possible fates of our Universe.Extras\n                                    ", 
    "end_date": "2015-12-21T00:00:00Z", 
    "title": "From the Big Bang to Dark Energy", 
    "price": 0, 
    "instructors": "Hitoshi Murayama", 
    "institution_name": [
        "The University of Tokyo"
    ], 
    "commitment": "4-7 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/big-bang", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-11-16T00:00:00Z"
}