{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/cosmo\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/cosmo-005/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    cosmo-2012-001\n                                                                    cosmo-002\n                                                                    cosmo-003\n                                                                    cosmo-004\n                                                                    cosmo-005\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This class is an introduction to the modern extragalactic astronomy and cosmology, i.e., the part of astrophysics that deals with the structure and evolution of the universe as a whole, and its major constituents: dark matter, dark energy, galaxies, quasars, large-scale structure, and intergalactic gas.  It will cover the subjects including: relativistic cosmological models and their parameters, extragalactic distance scale, cosmological tests, composition of the universe, dark matter, and dark energy; the hot big bang, cosmic nucleosynthesis, recombination, and cosmic microwave background; formation and evolution of structure in the universe; galaxy clusters, large-scale structure and its evolution; galaxies, their properties and fundamental correlations; formation and evolution of galaxies; star formation history of the universe; quasars and other active galactic nuclei, and their evolution; structure and evolution of the intergalactic medium; diffuse extragalactic backgrounds; the first stars, galaxies, and the reionization era.  It corresponds to the Ay 21 class taught at Caltech.\n\n                                            Syllabus\n                        Galaxies and CosmologyThe lecture schedule and topics covered by this class are given below. There is no midterm or final for this class, but there are graded quizzes at the end of each week based on lecture material.Week 1 Chapter 1: IntroductionCosmology as a scienceAn overview of the modern cosmology and its historyUnits, fluxes, and magnitudesChapter 2: Basics of Relativistic CosmologyBasic concepts of General RelativitySymmetry assumptions: homogeneity and isotropyMetric, Robertson-WalkerThe cosmological redshiftComoving and proper coordinatesFriedmann equationDefinitions of cosmological parametersWeek 2 Chapter 3: Cosmological ModelsComputing cosmological modelsDistances in cosmologyBasics of cosmological testsThe cosmic horizonsChapter 4: Distance Scale, Age of the Universe, and the Universal ExpansionDistance scale and the Hubble constantThe age of the universeTests of the universal expansionWeek 3Chapter 5: Cosmological TestsClassical cosmological tests and their problemsModern tests (non-CMBR)Tests using CMBR fluctuationsChapter 6: The hot Big Bang and the Thermal History of the UniversePlanck era and beyondInflationBaryosynthesisNucleosynthesisRecombinationReionizationWeek 4 Chapter 7: Contents of the UniverseLuminous matter, M/L ratiosBaryonsDark mattersGravitational lensingDark energy, cosmological constant and quintessenceChapter 8: Structure Formation: TheoryDensity fluctuations, power spectrum, growth, dampingDark matter dependence of cosmogony; Cold Dark MatterPost-recombination growthCollapse of density fluctuationsThe role of cooling; galaxies vs. clusters and LSSNumerical simulationsGalaxy mergingWeek 5 Chapter 9: Observations of Large Scale StructureMeasurements of galaxy clustering and LSSRedshift surveysChapter 10: Large Scale Structure and Clusters of GalaxiesPeculiar motionsEvolution of clusteringBiasingGalaxy clusters and their propertiesWeek 6 Chapter 11: Galaxies, Their Structure and Properties (I)Galaxy catalogs, morphological classification, Hubble sequenceVariation of galaxy properties along the Hubble SequenceStellar populations and galaxian subsystemsGalaxy luminosity and mass functionsProperties of spiral galaxies, density wave theoryChapter 12: Galaxies, Their Structure and Properties (II)Properties of elliptical galaxiesSupermassive black holes in nearby galaxiesProperties of dwarf galaxy familiesFundamental correlations, scaling relations, and their usesWeek 7 Chapter 13: Galaxy EvolutionBasic processes of galaxy evolution: merging, stellar pop. modelingDeep surveys (imaging and redshift)Selection effects and obscured star formationStar formation history, assembly of the massThe Olbers paradoxOptical/NIR and FIR/sub-mm diffuse backgroundsChapter 14: Chemical Evolution, Intergalactic Medium and its EvolutionChemical evolution of galaxiesBasic phenomenology of absorbersLyA forest, Lyman limit systems, Damped LyA systemsEvolution of IGM and its chemical enrichmentFeedback processes and the cosmic webWeek 8 Chapter 15: Galaxy FormationBasics of galaxy formationThe first galaxies and early stages of galaxy evolutionReionization eraThe first starsThe origins of black holes in the early universeChapter 16: Quasars and Active Galactic Nuclei: Phenomenology and PhysicsAGN properties, basics, classification, spectraSupermassive black holes and their fuelingEmission mechanismsAGN unificationWeek 9 Chapter 17: Quasars and AGN: Unification, Evolution, High-Energy BackgroundsJets and beamingQuasar surveys and evolutionX-ray, gamma-ray, and AGN-generated backgroundsThe origin of first quasars and supermassive black holes\n                                    ", 
    "end_date": "2016-03-16T00:00:00Z", 
    "title": "Galaxies and Cosmology", 
    "price": 0, 
    "instructors": "S. George Djorgovski", 
    "institution_name": [
        "California Institute of Technology"
    ], 
    "commitment": "6-9 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/course/cosmo", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-01-06T00:00:00Z"
}