{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    La gravité, qu’est-ce que c’est ? Le thème, si présent ces temps derniers dans les films d’Hollywood, est le fil rouge entre des concepts aussi intrigants que le Big Bang, les trous noirs, l’énergie sombre, l’espace-temps, les ondes gravitationnelles, l’expansion de l’Univers.\r\nSi ces questions vous intéressent, ce cours vous est destiné. Il ne demande pas de connaissances particulières en physique, juste de la curiosité pour comprendre notre Univers et la place que nous y occupons.\r\nLa théorie de la gravité, la relativité générale d’Einstein, a tout juste 100 ans. Ce cours vous présentera de façon simple les principales idées derrière cette théorie avant de vous expliquer pourquoi la gravité « est le moteur de l’Univers ». Les notions de base seront ensuite introduites pour comprendre pourquoi l’Univers est en expansion, pourquoi voir loin c’est voir dans le passé, comment peut-on bien savoir ce qui s’est passé juste après le Big Bang, ce que sont les composantes sombres de l’Univers, pourquoi attend-on impatiemment la découverte des ondes gravitationnelles, et ce qui se passe quand on traverse l’horizon d’un trou noir.\r\nLe cours est assuré par Pierre Binétruy de l’Université Paris Diderot. Le cosmologue George Smoot participe à ce cours et vous expliquera les découvertes pour lesquelles on lui a décerné le Prix Nobel. Marie-Odile Monchicourt, journaliste scientifique posera chaque semaine les questions que vous aviez sur les lèvres.\r\n \n\n                                    ", 
    "end_date": "2016-04-19T00:00:00Z", 
    "title": "Gravité! Du Big Bang aux Trous Noirs", 
    "price": 0, 
    "instructors": "George F. Smoot and Pierre Binétruy", 
    "institution_name": [
        "Paris Diderot University"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.fun-mooc.fr/courses/parisdiderot/56001S02/session02/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-03-08T00:00:00Z"
}