{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    Satellite Earth Observation technology provides a powerful and compelling insight into climate change which can help to underpin climate policy, scientific research and public engagement. But how does this technology work, and how can it achieve the essential detail and comprehensive worldwide view that we need?\n\nJoin Lead Educator Professor Martin Wooster and leading climate experts such as Professor Konrad Steffen, Professor Anny Cazenave, Dr Stephen Briggs and Dr Emily Shuckburgh as they reveal the perspective provided by satellite Earth observation. The course is free and fully flexible - you can progress in step with other learners week by week, or take the course entirely at your own pace, with all materials available indefinitely once you have registered.\n\nThe ‘live run’ of the course, allowing you to interact with experts and other learners, will continue until 28th August 2016, and you can register any time up to that date. You can also view and share some ‘highlights’ from the course without registering, using the links at the bottom of this page. This film, the course trailer above and a small selection of other videos are also available with Spanish and Chinese subtitles. Just click on the small pink square in the video controls to select your preferred language.\n\nIntroducing Earth observation\n\nSeeing the Earth from space allows us to gain this global perspective. By using Earth observation techniques, we can now monitor global environmental change on a scale that has never before been possible.\n\nEarth observation has not only revolutionised the way we perceive our home, but changed the way we understand our profound impact on the environment. This technology has brought on a transformation in the way we observe, monitor and study our planet.\n\nLearn with  experts from ESA and leading European research centres\n\nIn this free online course, you will join leading experts and scientists from ESA and key European research centres, to explore the science that underpins Earth observation.\n\nWe will look at recent and current satellite missions that are providing an archive of essential data; and find out how this data is used in local and international policy and planning.\n\nThe course consists of five themed weeks:\n\nWeek 1 - Observing Climate Change from Space\n\nWhat is Earth observation? How do we observe the Earth with satellites? And what role does Earth observation play in climate policy and planning?\n\nWeeks 2 &amp; 3 - Earth Observation Techniques and Technology\n\nHow do we use different types of mission, instrumentation and data to study changes to our atmosphere, land, oceans and ice?\n\nWeek 4 - Earth Observation in Action\n\nHow does Earth observation help us set policy; plan for climate risk, resilience and adaptation; and manage resources and biodiversity?\n\nWeek 5 - Managing Earth Observation Data\n\nHow do we make sense of the large amount of data produced by Earth observation? Can crowdsourcing and citizen science play a role in developing climate change models?\n\nThe lead presenters on this course are: Professor Martin Wooster, King’s College London; Dr Mathias Disney, University College London; Dr Emily Shuckburgh, British Antarctic Survey; Professor Andy Shepherd, University of Leeds. Further expert insight is provided by Professor Alan O’Neill, University of Reading.\n\nOther contributors for the course include: Professor Konrad Steffen, WSL; Professor Anny Cazenave, LEGOS &amp; ISSI; Dr Pierre-Philippe Mathieu, ESA; Dr Stephen Briggs, ESA; Dr Angela Benedetti, ECMWF; Dr Nathalie Pettorelli, ZSL; Professor Chris Merchant, University of Reading; Dr Melanie Ades, University of Reading; Dr Helen Snaith, BODC (NOC); Dr Stephanie Henson, NOC; Dr Simon Boxall, University of Southampton; Dr Paolo Cipollini, NOC; Professor Chris Lintott, University of Oxford; Dr Kirsten Barrett, University of Leicester.\n\n\n                                    ", 
    "end_date": "2016-08-29T00:00:00Z", 
    "title": "Monitoring Climate from Space", 
    "price": 0, 
    "instructors": "Andrew Shepherd and Martin Wooster", 
    "institution_name": [
        "European Space Agency"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/climate-from-space?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-07-25T00:00:00Z"
}