{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    The Origins course tracks the origin of all things – from the Big Bang to the origin of the Solar System and the Earth. The course follows the evolution of life on our planet through deep geological time to present life forms.\n\n                                            Syllabus\n                        Origin of the Elements, the Solar System and the PlanetsIn the first module of Origins Jim Connelly and Henning Haack go through the evolution that resulted in the Solar System with the planets that we know today. Jim will actually go even deeper than that -- he will tell you about how the elements of the periodic table formed. Without these elements there would be no Solar System, no planets and no life at all. We have added a couple of more videos that we hope you will also find interesting. One gives you an introduction to Geological time -- this should prove very useful to those of you not familiar with Geological time. Also, I have added a couple of videos where I show you some of our most interesting meteorites from the collections here at the Natural History Museum of Denmark. The story you are about to hear is mainly based on evidence from meteorites and we would therefore like to show you some particularly interesting examples.Once again, welcome to the course! We really hope that you will like it and that you will be active during the course. The course will give you plenty of opportunity to discuss interesting topics, related to the course, with students from all over the world. The discussion forums in the origins course include lots of interesting discussions and answers to common questions. Please participate in the discussions and use the opportunity to ask any questions that you may have. Your active participation will help making the course forums an interesting place to meet for anybody interested in our common origin. \n\nIf you have not done so already, you may also want to take a look at the course Facebook page: https://www.facebook.com/originscourse, where many of you have posted interesting pictures and stories from around the world. Add a story and/or an interesting picture from your country to the Origins Facebook page and help making it an interesting place to visit to learn more about the nature that surround us. Please take the opportunity and enjoy being part of a global community of students interested in one of the biggest questions that we can ask: Why are we here!?  The early Earth and origin of lifeThe first lecture described the origin of the elements, the Solar System and the planets. This time we are going to have a look at our own planet, just after it formed. Emily Pope from the Natural History Museum of Denmark will take you on a tour back in deep geological time and tell you about the earliest evolution of our planet and the oldest evidence for life on Earth. We will also take you on a trip to Greenland where Prof. Minik Rosing will show you a very famous rock in which he found the oldest evidence for life on Earth. Emily will also introduce you to the most important geological processes. We hope that this will make it easier for you to understand how we can use geology to reconstruct the evolution of our planet and the life forms that exist on it today. I hope that you enjoy Emily’s lecture and the Origins course! Origin of the microbial world / The Cambrian Explosion and Exceptional PreservationIn the last lecture Emily Pope told you about the early evolution of Earth and the oldest evidence of life.This time Jan Audun Rasmussen and Danny Eibye-Jacobsen will show you how life evolved during the first 4 billion years of the Earth evolution. As you will see, it is very challenging to study the oldest life forms of our planet. During this enormous time span – which covers about 80% of the Earth’s history – microbial life slowly evolved as crucial components of the history of the early Earth. Toward the end of the period the deepest foundations of the different groups of animals were made. \n\nAll of the life forms surrounding us today can be traced back to this time. By this time you are probably familiar with the technicalities of online courses at Coursera - but let me give you two useful hints:I have enjoyed watching your discussion in the forums! If you haven't checked the forums out I would encourage you to do so! You will find lots of great questions, great answers and a lively debate about lots of topics related to the course. If you are challenged understanding what the lecturers are trying to explain, it may help you to turn on the English subtitles (that are available when you watch the videos directly at coursera.org). It may also help you to watch the videos at reduced speed - or alternatively at enhanced speed if you are already familiar with the topic. Welcome to the lecture – I hope that you will enjoy it!Transition from Microbial to Macrobial Life: Snowball Earth and the Ediacara Biota / Eukaryotic Evolution and the Phylogeny of All LifeIn the last module Jan Audun Rasmussen and Danny Eibye-Jacobsen lectured on the early evolution of microbial life, leading up to the Cambrian Explosion of higher life forms. You may have wondered why it took almost 4 billion years before the higher life forms evolved. One of the answers is that a key component of life had to evolve, before higher life forms could form. Another factor could be changing environmental conditions.In the first lectures Svend Stouge will tell you about the dramatic consequences of climate changes seen toward the end of the Precambrian. Geological evidence supports the idea that the Earth was completely covered in ice during periods that we, for obvious reasons, refer to as Snowball Earth. In the next lectures Martin Sørensen will tell you about one of the most significant building blocks of life on Earth – the cell – and how the early bacterial cells evolved and became capable of forming the huge variety of life that we see today. Martin Sørensen will also show how different evolutionary trends of cells resulted in six major organism groups, of which several gave rise to multicellular life.  I hope that you will enjoy learning about how microscopic details control much of the amazing diversity of life forms surrounding us today!Origin of the marine Cambrian and Palaeozoic Evolutionary Faunas / Diversity in deep time / Origin of predation and the Mesozoic Arms raceIn the module 5, Arne Thorshøj Nielsen and Jan Audun Rasmussen will show you how the higher life forms, particularly the marine animals, evolved in the oceans, after the sudden appearance of a hard skeleton in many different animal groups some 540 My ago. You will be introduced to the changing major evolutionary faunas through time, and also see how clever strategies to kill or avoid being killed, major extinction events and many other factors controlled the evolution that eventually resulted in the modern marine faunas.Oxygenation and AnimalsIn module 6 Tais Wittchen Dahl will take a detailed look at one of the most important factors controlling the evolution of life - oxygen. In the previous lectures you have already heard that the oxygen levels have changed in the past, but Tais will show you how it works, how we know, what were driving oxygen levels up and what were some of the most important consequences. One of the amazing consequences was that during the Carboniferous, dragon flies had wing spans of up to 75 cm! Higher oxygen levels not only allowed for the evolution of higher life forms, it may also have limited the size of insects and predatory fish, and ultimately the evolution of intelligent life. Without the increase in oxygen, it would be impossible for us to understand the lectures in this course!Origins and Early Development of Plants / The Origin and Diversification of Flowering PlantsIn module 6 Tais Witchen Dahl explained how the oxygen levels in the atmosphere and the oceans are linked with the evolution of life. In module 7 we will have a close look at the biggest source of oxygen -- the plants. Up till now we have heard a lot about the evolution of higher life forms in the oceans. While evolution took a giant step forward in the oceans, the continents remained totally barren for another ~100 million years. Vivi Vajda from nearby Lund University in Sweden and Gitte Petersen from the Natural History Museum will tell you how the plants began to inhabit the continents, thus paving the way for other life forms living on land. They will show you how plants managed to adapt to a totally different environment, with new challenges and possibilities. Some of the early plants have survived as fossils -- whereas others are still alive! Vivi Vajda and Gitte Petersen will show you examples of living fossils in the Botanical Garden here at the Museum. Until very recently some of these were believed to be extinct long ago. We will also have a close look at the biggest group of plants -- which has evolved in close collaboration with insects, birds and even some mammals -- the flowering plants. Please listen and enjoy the lecture -- visiting a botanical garden will never be the same after you have listened to what Vivi Vajda and Gitte Petersen have to say!The Evolution of Insects and their Role in Terrestrial EcosystemsIn module 8 Lars Vilhelmsen will take a close look at the insects which account for more than 50% of today’s biodiversity and biomass. Part of the story behind the success of the insects is their remarkable adaption to a wide range of environments. Insects mastered powered flight early in their evolution, and also developed highly specialized relationships with land plants almost from the start. Different insects feed on almost everything: various plant parts, nectar, blood from vertebrates, or other insects. Other remarkable types of specializations are found in social insects that act as a single organism, capable of performing highly complex tasks, such as farming! On another issue I continue to be amazed about all of the fantastic discussions taking place in the discussion forums – if you have not already explored the forums you should do so now! Please listen and enjoy this weeks lecture  - insects are all around us and this lecture will give you some amazing details about their world and originColonization of the continents and the Origin of the Dinosaurs and Birds/Mass Extinction Events and Their CausesIn the ninth module we will explore how our ancestors colonized dry land. Jesper Milan will tell you about how this happened and give you examples of some of the first vertebrates that gradually adapted to a life on land. Vertebrates are animals with backbones such as fish, reptiles, dinosaurs (including birds), and mammals. In the following lecture Gilles Cuny will tell you about how the early primitive vertebrates evolved into the highly diverse species that we see today. He will not only show you many interesting examples of our distant relatives but also discuss many of the processes, which we believe controlled their evolution and diversification. Today we see vertebrates everywhere – in the air, under the ground, in the oceans, and walking the Earth like ourselves. One of the important factors driving evolution is mass extinction events. Gilles will introduce you to the topic and Bent Lindow will give you a detailed look at mass extinction events. What were the causes, what happened and what were the consequences? Many questions remain unanswered but one thing is certain – mass extinctions have had a great impact on the evolution of life on Earth. Without mass extinctions life would have evolved in a completely different way and we, like most other recent species, would not be here. If you have not done so already, you may also want to take a look at the course facebook page https://www.facebook.com/originscourse, where many of you have posted interesting pictures and stories from around the world. If you have something interesting to share from your country please feel free to do so!I hope that you will enjoy the new lecture where Gilles Cuny and Bent Lindow will take you one important step closer to an understanding of the familiar life forms, that we see around us today.Origin of Recent Climate Change / The Molecular ClockIn the tenth module we will tell you about two very different topics - recent climate changes and the molecular clock. Michael Houmark will tell you about the most important factor controlling the evolution of modern life – the changes in global climate over the past 50 million years. During this period the warm temperatures in the Eocene were gradually replaced by the much lower, present day temperatures. Several of the previous lectures have discussed other dramatic changes in climate, but since those events happened in deep geological time, our knowledge of the controlling factors and consequences is incomplete. Michael Houmark will show you how our much better records of sea level, temperature, CO2, volcanic activity, and continental drift in the recent past, allow us to piece together a detailed picture of these dramatic changes in Earth’s climate. Our records of recent climate change also allow us to better understand the processes controlling the climate on short, medium, and long time scales. Ole Seberg, who is a molecular biologist and botanist here at the Museum, will tell you about the molecular clock, which has already been mentioned in a couple of the previous lectures. The molecular clock is a very good example of a new technique, which has significantly improved our understanding of the evolution of life on our planet. Looking at molecular data of present species, we cannot only determine how closely the species are related to each other, we can also estimate how far back in time we need to go, to find a common ancestor of two distinct modern species. Ole Seberg will tell you how the molecular clock works and how we can use it. The molecular clock is a fascinating tool, but it works very differently from a chronometer. You have to understand the principles behind it before you can utilize the information it provides. I hope that you will enjoy the lectures that will show you how the Earth’s climate changed from “Green House” to “Ice House” and how we can use the molecular clock to explore the evolution of life on Earth.Primate Origins and Evolution / Human Origins and EvolutionOne group of animals emerging during this period is the primates - the group to which we also belong. In the first videos of this week Bent Lindow comes back and tells you about the evolution of primates, leading up to the early humans. Bent will also introduce you to a web-based exercise called “The Human Animal”. In this exercise you will explore skulls of living as well as extinct hominids. Apart from the exercise itself the “Human animal” includes some background reading material and some interesting videos, where you get to see the characteristics of primates first hand. Be warned though, the videos shows a dissection of a chimpanzee here at the Natural History Museum. The chimpanzee came from the Zoo in Copenhagen where it died of natural causes after a long life. The video was originally made for Danish School children and is perhaps more dramatic than it would have been, if we had made it for an international audience. If this makes you uncomfortable, don't watch it, you will still be able to follow the course! In order to do the exercise you need a computer with a mouse (since you need to measure distances in 3D between different parts of the skulls that you will be studying). The system is flash-based, which unfortunately makes it impossible to run on Ipads and Iphones. If you do not have a computer equipped with a mouse yourself, I hope that you know somebody who does – it will be worth the effort! After Bent has introduced you to primates, Tom Gilbert will focus on a particular primate – Homo sapiens! Tom Gilbert is a genomics expert. Among many other projects he is one of the leaders behind a huge project aiming at mapping out the genome of birds. An entire issue of Science was devoted to the project in December 2014. Tom Gilbert uses genomics to study many different species, including humans. He will tell you about how the early humans managed to colonize almost every land mass of our planet. Although many details of our own evolution still remain obscure, recent advances in genomics have given us a much better understanding of how extant humans colonized the entire planet after leaving their original continent of Africa. I hope that you will enjoy this weeks lectures. They will not only take us one step closer to modern times, but also allow you to understand the prehistory of the particular organism on the planet that you are most familiar with – yourself.Modern DiversityIn the last set of lectures we will look the modern biodiversity, which is perhaps the most remarkable result of the evolution, which we have described throughout the course.There is an enormous difference between the biodiversity of different types of habitats on our planet – from the equator to the arctic, from deserts to rainforests, and from isolated islands like the Galapagos to large continents. Jon Fjeldså will take you on a trip around the planet and give you many interesting examples of these variations. He will explain how we can use them to get a better understanding of how evolution works. Very appropriately, Jon will give part of the lecture in a replica of Darwin’s office, which is part of the evolution exhibit here at the museum in Copenhagen. Sadly, this lecture brings the course to an end. It has been a great pleasure to share the origins’ story with all of you! In particular, I am overwhelmed and very surprised of the enthusiasm, marvelous discussions and great feedback that you have provided us and your fellow students with through the discussion forums. On behalf of the teachers here at the Natural History Museum of Denmark, I would like you to thank you for being part of the course. I hope that you have enjoyed the Origins course and learned many new things about our origin – but first and foremost, I hope that the course has sparked your curiosity to learn more about the incredible nature that surrounds us. It is the very same curiosity that drives us here at the museum to explore nature. I hope that the course will inspire you to look at nature with fresh and more curious eyes each time you stop to look at one of our planet’s lifeforms or one of the rocks that can help us reconstruct our origin somewhere among the stars that illuminate the night sky.\n                                    ", 
    "end_date": "2016-08-22T00:00:00Z", 
    "title": "Origins - Formation of the Universe, Solar System, Earth and Life", 
    "price": 0, 
    "instructors": "Henning Haack", 
    "institution_name": [
        "University of Copenhagen"
    ], 
    "commitment": "5-7 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/origins-universe-solarsystem", 
    "duration": "12 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}