{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    Planetary Boundaries and Human Opportunities: The Quest for Safe and Just Development on a Resilient Planet helps students to explore and apply a range of emerging concepts within sustainability science. These concepts include: the Anthropocene, planetary boundaries, the social-ecological systems approach and resilience thinking. Such concepts are at the core of contemporary research and debates in the arena of global sustainability.\r\nThey are key to frame and understand rapidly changing trends in global environmental change caused by humans, and to assess responses that aim at addressing the consequences and impacts of these changes. They are also helpful in exploring pathways for ensuring safe and just human development for present and future generations.\r\nA thriving global society, now and in the future, depends on the stable functioning of all interacting components of the Earth System – including; the atmosphere, oceans, forests, waterways, biodiversity and biogeochemical cycles. Unfortunately, scientific evidence indicates that human influence has altered Earth System processes to a point that we have begun transgressing planetary boundaries that have kept civilization safe for the past 10,000 years.\r\nHumans are now the most significant driver of global change, potentially propelling the planet into a new geological epoch, the Anthropocene. In this new situation, unsustainable patterns of production, consumption, and population growth are challenging the resilience of the planet to support human activity. The fundamental question is how our societies can develop in a just and safe way within the planet’s boundaries. \r\nThis course aims at expanding and updating participant’s ‘conceptual toolbox’ in matters of global sustainability. Upon successful completion, a participant will be able to demonstrate a clear understanding of key concepts on global environmental change and their theoretical underpinning, as well as an up-to-date understanding of current debates in the global sustainability arena and emerging examples of approaches and solutions currently being developed.\r\nThroughout the course, Professor Rockström and along with colleagues from the Stockholm Resilience Centre will hold live hangouts to answer your questions about the course and sustainable development issues, in addition to discussion forums where you can engage with fellow students and course staff. The course is also rich in activities that will illustrate the application of these concepts, connecting global and local contexts. \r\nThe success of the course depends on an active student base representing a diversity of experiences, cultures, and perspectives, so add your voice to the global discussion by registering today.\n\n                                            Syllabus\n                        Week 1 - Introduction and the Big Picture\r\nIntroductionThe big picture\r\n \r\nWeek 2 - Welcome to the Anthropocene\r\nThe Holocene and the AnthropoceneVisions of the Anthropocene\r\n \r\nWeek 3 - Social-ecological systems and Resilience thinking\r\nSocial-ecological resilienceUnderstanding complexity in a turbulent world\r\n \r\nWeek 4 - Planetary Boundaries Framework – Part 1\r\nA new framework for human developmentThe big three boundaries: processes with global scale tipping points\r\n \r\nWeek 5 - Planetary Boundaries Framework – Part 2\r\nThe four slow boundariesHuman-made planetary boundaries processes\r\n \r\nWeek 6 - Planetary Boundaries and Global Equity\r\nNatural resources and interactions between boundariesA safe and just operating space for humanity\r\n \r\nWeek 7 - Moving towards Global Sustainability within Biophysical and Social Boundaries\r\nGlobal governancePromising pathways to success\r\n \r\nWeek 8 - Conclusion\r\nScience in the Anthropocene and the Sustainable Development Goals\r\nConclusions\n                                    ", 
    "end_date": "2015-11-09T00:00:00Z", 
    "title": "Planetary Boundaries and Human Opportunities", 
    "price": 0, 
    "instructors": "Lisa Deutsch and Johan Rockström", 
    "institution_name": [
        "SDSN.Edu"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.sdsnedu.org/learn/planetary-boundaries-and-human-opportunities-september-2015", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "EdCast"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}