{
    "selfpaced": false, 
    "topic_name": [
        "Astronomy"
    ], 
    "description": "\n\n                    \n                    \n                    Super-Earths And Life is a course about alien life, how we search for it, and what this teaches us about our place in the universe.\n\nIn the past decade astronomers have made incredible advances in the discovery of planets outside our solar system. Thirty years ago, we knew only of the planets in our own solar system. Now we know of thousands circling nearby stars.\n\nMeanwhile, biologists have gained a strong understanding of how life evolved on our own planet, all the way back to the earliest cells. We can describe how simple molecules can assemble themselves into the building blocks of life, and how those building blocks might have become the cells that make up our bodies today.\n\nSuper-Earths And Life is all about how these two fields together - astronomy and biology - can answer one of our most powerful and primal questions: are we alone in the universe?\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code : https://www.edx.org/edx-terms-service. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement : http://harvardx.harvard.edu/research-statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form : https://www.edx.org/contact-us.\n\n                                    ", 
    "end_date": "2015-11-24T00:00:00Z", 
    "title": "SPU30x: Super-Earths And Life", 
    "price": 0, 
    "instructors": "Dimitar Sasselov and Colin Fredericks", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/super-earths-life-harvardx-spu30x-0", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-10-13T00:00:00Z"
}