{
    "selfpaced": true, 
    "topic_name": [
        "Self Improvement"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Personal Development\n                                                                                            \n                            \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Personal Development\n                                                                                                    &gt; Self Improvement\n                                                            \n                            \n                                                \n                    \n                    \n                    ¿Quieres conocer tus recursos y niveles de desempeño relacionadas con tu proceso de aprender? ¿Te interesa desarrollar habilidades para aprender más y mejor? \n\nEn APRENDER conocerás y pondrás en práctica, de forma sencilla y práctica, resultados de investigación recientes sobre los procesos de lectura, almacenamiento de información, recuperación de recuerdos y velocidad de procesamiento. Así, podrás utilizar, de forma eficiente, estrategias y técnicas muy útiles en tu vida académica, profesional y cotidiana.\n\n                                            Syllabus\n                        Cómo aprendemosEl proceso de aprender incluye una variedad de elementos que interactúan para definir la cantidad, calidad y accesibilidad de lo aprendido. En este módulo conocerás los tipos y características del aprendizaje, así como el procesamiento que tienen los recuerdos duraderos, y la influencia de la inteligencia, la atención, la motivación y la emoción. Manejarás estrategias para mejorar tus procesos de atención y para promover la motivación intrínseca necesaria para comprometerte con la tarea. Cómo procesamos los materiales escritos de aprendizajeMucho de lo que aprendemos nos llega a través de la lectura. En este módulo identificarás tu nivel de velocidad y comprensión lectoras, y podrás desarrollar habilidades para leer más rápido y para lograr mayor comprensión.Cómo pensamos cuando pensamosLa capacidad de aprender rápido y de forma profunda tiene mucho que ver con el control que ejercemos sobre los procesos de pensamiento. En este módulo comprenderás qué significa pensar sobre el pensamiento y desarrollarás habilidades para diagnosticar tus fortalezas y áreas de oportunidad al pensar, así como para administrar eficientemente tus recursos de pensamiento.Cómo aprendemos de acuerdo a los materiales y contextosEl contexto en el que aprendemos marca restricciones y necesidades específicas. En este módulo aprenderás algunos trucos y ajustes que te permitirán enfrentar más exitosamente los procesos de aprender así como los de evaluación.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Aprender", 
    "price": 0, 
    "instructors": "Guadalupe Vadillo", 
    "institution_name": [
        "Universidad Nacional Autónoma de México"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/aprendo", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}