{
    "selfpaced": false, 
    "topic_name": [
        "Self Improvement"
    ], 
    "description": "\n\n                    \n                    \n                    Uncertainty and endless debate can inhibit our ability to make good decisions. Many of us squander our best opportunities to create value through better decisions. What if we could judge the quality of our decisions at the time we make them, rather than waiting for their outcome? What if we could turn uncertainty to our advantage? Decision Quality (DQ) is a practical and systematic approach that methodically breaks down barriers and improves the quality and timeliness of important decisions.\r\nDecision Quality has proven to be an invaluable business tool for some of the largest corporations in the world. Companies that have adopted DQ for all their major decisions, like Chevron, are significantly outperforming their peer group of companies.\r\nNow you can learn to make smarter decisions. In this five-week introductory course, you’ll work in teams to learn the DQ approach, which draws from the disciplines of business, engineering, psychology, organizational behavior, and decision science. Whether you’re an executive, a manager, an analyst, or a small-business owner, you’ll learn to improve your decision-making process, generate better alternatives, focus on relevant information without getting bogged down, apply sound reasoning, and take timely action more effectively and efficiently. By the end of this course, you will be able to:\r\n\r\nUnderstand the six requirements of Decision Quality\r\nRecognize the quality of a decision before you make it (not just in hindsight)\r\nIdentify gaps in Decision Quality and focus your attention where it matters\r\nReach DQ in significant decisions in a timely and efficient way\r\nGain awareness of strategic Decision Quality, decision \"power tools,\" and the role of decision professionals.\r\n\r\nIn a recent offering of this course, 88% of participants said it was relevant to their job, and 90% said they would recommend it to a colleague! This course will focus on DQ as it is used in business, but the principles of DQ apply to personal decisions as well.\n\n                                            Syllabus\n                        Week 1: The Power of Decisions in Shaping our Lives and Business FortunesWeek 2: Appropriate Frame; Creative and Doable Alternatives; Clear Values and Trade-offs Week 3: Relevant and Reliable Information Week 4: Sound ReasoningWeek 5: Gaining Commitment to Action; Bringing it All Together\n                                    ", 
    "end_date": "2015-11-19T00:00:00Z", 
    "title": "DQ 101: Introduction to Decision Quality", 
    "price": 0, 
    "instructors": "Carl Spetzler", 
    "institution_name": [
        "Strategic Decisions Group"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://novoed.com/DQ101-7-2015", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2015-10-15T00:00:00Z"
}