{
    "selfpaced": false, 
    "topic_name": [
        "Self Improvement"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Personal Development\n                                                                                            \n                            \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Personal Development\n                                                                                                    &gt; Self Improvement\n                                                            \n                            \n                                                \n                    \n                    \n                    This course gives you easy access to the invaluable learning techniques used by experts in art, music, literature, math, science, sports, and many other disciplines. We’ll learn about the how the brain uses two very different learning modes and how it encapsulates (“chunks”) information. We’ll also cover illusions of learning, memory techniques, dealing with procrastination, and best practices shown by research to be most effective in helping you master tough subjects.  \n\nUsing these approaches, no matter what your skill levels in topics you would like to master, you can change your thinking and change your life. If you’re already an expert, this peep under the mental hood will give you ideas for: turbocharging successful learning, including counter-intuitive test-taking tips and insights that will help you make the best use of your time on homework and problem sets. If you’re struggling, you’ll see a structured treasure trove of practical techniques that walk you through what you need to do to get on track. If you’ve ever wanted to become better at anything, this course will help serve as your guide.\n\n To join the fully translated Portuguese version of the course, visit: https://www.coursera.org/learn/aprender\n To join the fully translated Spanish version of the course, visit: https://www.coursera.org/learn/aprendiendo-a-aprender\n To join the fully translated Chinese version of the course, visit: https://www.coursera.org/learn/ruhe-xuexi\n\n                                            Syllabus\n                        What is Learning?Although living brains are very complex, this module uses metaphor and analogy to help simplify matters.  You will discover several fundamentally different modes of thinking, and how you can use these modes to improve your learning.  You will also be introduced to a tool for tackling procrastination, be given some practical information about memory, and discover surprisingly useful insights about learning and sleep. ChunkingIn this module, we’re going to be talking about chunks. Chunks are compact packages of information that your mind can easily access.  We’ll talk about how you can form chunks, how you can use them to improve your understanding and creativity with the material, and how chunks can help you to do better on tests.  We’ll also explore illusions of competence in learning, the challenges of overlearning, and the advantages of interleaving.Procrastination and MemoryIn this module, we talk about two intimately connected ideas—procrastination and memory.  Building solid chunks in long term memory--chunks that are easily accessible by your short term memory—takes time.  This is why learning to handle procrastination is so important.  Finally, we talk about some of the best ways to access your brain’s most powerful long term memory systems.Renaissance Learning  and Unlocking Your PotentialIn this module we’re going to talk more about important ideas and techniques that will enhance your ability to learn.  You’ll also discover how to more profitably interact with fellow learners, how to recognize your own strengths, and how to avoid the “imposter syndrome.”  Fighter pilots and surgeons use checklists to help them with their critical duties—you can use a similar checklist to help you prepare for tests.  Ultimately, you will learn more about the joys of living a life filled with learning!\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Learning How to Learn: Powerful mental tools to help you master tough subjects", 
    "price": 0, 
    "instructors": "Terrence Sejnowski and Barbara Oakley", 
    "institution_name": [
        "University of California, San Diego "
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/learning-how-to-learn", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}