{
    "selfpaced": false, 
    "topic_name": [
        "Self Improvement"
    ], 
    "description": "\n\n                    \n                    \n                    The only constant in our lives is change. Sometimes, we consciously decide to make a change in our lives (eg. when we change jobs, or when we move to a new city); at other times the environment changes around us, forcing us to adapt to new conditions. Sometimes change is a moment of joy and curiosity for new things, at others it represents a period of grief and mourning for what we leave behind. Sometimes change is evident, profound and irreversible, sometimes it takes place in a more subtle way, via a long and inexorable process. But in any situation, change represents the end of one state and the beginning of another. Change often means abandoning old habits and certainties to open up to the new and unexplored. Each period of learning in our lives is based on this concept: only thanks to courage and the will to get out of your zone of comfort, can you learn new skills and abilities. It is not the change in itself that scares us, but the idea that we create of it. We rush to label the new situation as good or bad luck, but it is our subjective interpretation of the facts that will impact how we experience the moment of change. How many times have we cried in front of a door that is closed to us, regardless of the door that was opening up somewhere else? In this course, you will learn the main dynamics related to personal and professional individual moments of change. Knowing the dynamics, it will be easier to be aware of emotions (your own and of others) that any change brings. You will learn to how face resistance more effectively and develop specific skills for managing the process of change with increased awareness and self-confidence\n\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "MANCHAN101 - Managing Changes", 
    "price": 0, 
    "instructors": "Ingrid Hollweck", 
    "institution_name": [
        "Politecnico di Milano"
    ], 
    "commitment": "1-3 hours", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.pok.polimi.it/courses/course-v1:Polimi+MANCHAN101+2016_M6/about", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Polimi OPEN KNOWLEDGE"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}