{
    "selfpaced": false, 
    "topic_name": [
        "Self Improvement"
    ], 
    "description": "\n\n                    \n                    \n                    When you think of networking, do you envision awkward mingling at cocktail parties and self-promotional pitches? This doesn't have to be the case. At Acumen, we believe leaders should have the audacity to imagine the world as it could be AND the humility to recognize that they cannot change the world alone. To tackle the world’s toughest problems, you need collaboration from people across your network and across sectors.\r\nIn this 2.5 hour On Demand course from +Acumen and theCenter for Creative Leadership, you’ll complete interactive diagnostic activities that will help you and your team unearth the social capital &amp; relationships that you bring to the table. You’ll be exposed to new data visualization tools for mapping your network; learn about 5 network traps to avoid that are particularly common to the social sector; and, most importantly, gain concrete strategies for building genuinely collaborative relationships.\r\n \r\nKey Learning Outcomes:\r\nBy the end of this course, you will:\r\n\r\nUnderstand the 3 key characteristics of effective networks and 5 network “traps” to avoid\r\nMap and diagnose your individual network using the Leadership Diagnostic tool and other visualization platforms\r\nVisualize and collaboratively assess your organizational or team network to see key trends and gaps\r\nPlot 3 specific ways you can cross a network boundary, make a new introduction, and deepen an existing relationship\r\n\r\nThis Course Is For You If:\r\n\r\nA team member looking to uncover and build upon your team’s network, particularly around a common challenge or goal\r\nAn individual looking to diagnose the strengths and gaps in your own personal network\r\nAnyone who wants to work more collaboratively to tackle the world’s toughest problems\r\n\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Networking for Change Makers", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "+Acumen"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://novoed.com/networking-changemakers", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2015-02-04T00:00:00Z"
}