{
    "selfpaced": true, 
    "topic_name": [
        "Self Improvement"
    ], 
    "description": "\n\n                    \n                    \n                    In this workshop we discuss the emergence of social media, how the concept gained popularity and has now become the axle in collaborative communication on the Internet. We follow this with a presentation of basic approaches that you can use to protect your data and more importantly your privacy on these platforms.Have you ever accepted a friendship request from the guy or girl you met at the corner store only to regret it the minute you clicked on “ACCEPT”? Or have you ever mistakenly allocated a “friend” to the wrong category and spent endless hours going through your list of 75,000 friends in order to find and reallocate your friend to the correct category? If you have, then you probably know about the nagging feeling of discomfort that you try to ignore or comfort yourself by telling yourself that it does not matter. We discuss examples of cyber-attackers to illustrate to you that this feeling should be taken seriously. If you feel concerned that something is not quite right, it most likely is the case.Finally, we consider users like your Great Grandma who probably don’t use the Internet. If you have drifted away envying that peaceful time when social media did not exist, you could not be more mistaken. Privacy is still a concern for users who do not actively use the Internet!\n\n                                    ", 
    "end_date": "2016-02-22T00:00:00Z", 
    "title": "Social Media - What No One has Told You about Privacy", 
    "price": 0, 
    "instructors": "Anne Kayem", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://open.hpi.de/courses/ws-privacy2016", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openHPI"
    ], 
    "start_date": "2016-01-18T00:00:00Z"
}