{
    "selfpaced": true, 
    "topic_name": [
        "Self Improvement"
    ], 
    "description": "\n\n                    \n                    \n                    This is a hands-on four chapter course to learn how to better understand and act when faced with complex situations. By the end of the course students will be able to take a story from the news, describe what makes the situation complex and identify opportunities for effective action or change. We will draw on systems theory and complexity theory for our teachings and learn to use proven data collection and modelling techniques from systems thinking and system dynamics.\n\n                                            Syllabus\n                        Chapter 1: Introducing complexity\r\nWe will define complexity and explore how complex situations require changes to the way we apprehend the world.\r\nChapter 2: Thinking in systems\r\nWe will describe and model how different factors, such as people, ideas or things interact over time and generate the complexity in a specific problem situation.\r\nChapter 3: Mapping the dynamics of complexity\r\nWe will learn the role of accumulations and nonlinearities in complex systems and observe how they contribute to both the changes over time and the unexpected and often frustrating behaviours we observe. We will learn to use free online software to simulate complex situations.\r\nChapter 4: Living with complexity\r\nWe will learn a number of tools and techniques that will accelerate our understanding of real world situations and help us to act with impact when faced with complexity. We will also consider the implications of complexity for management, social change and sustainability.\n                                    ", 
    "end_date": null, 
    "title": "Thinking Complexity", 
    "price": 0, 
    "instructors": "Cameron Guthrie", 
    "institution_name": [
        "Toulouse Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://iversity.org/en/courses/thinking-complexity", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2016-05-01T00:00:00Z"
}