{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    This is a 6-week introductory course that will take you through a variety of materials Acumen has designed to train leaders who wish to change the way the world tackles poverty, and build a world based on dignity. Acumen’s definition of leadership starts with moral imagination: the humility to see the world as it is, and the audacity to imagine the world as it could be. Course participants will begin by further developing their personal leadership skills, cultivate more self-awareness, and discover their own style to leadership, through the lens of moral imagination. This includes exercises that ask you to dig deep and share personal stories, experiences and opinions. While we’ll touch on the Acumen investment model, this isn’t an in-depth course on Acumen’s investment work. We’ll be providing a variety of material intended to make you think, question, discuss, and debate what it means to lead positive change. This is a course based on discovery, so we’ll be scratching the surface on new concepts, with the opportunity to go more in-depth in some of our other courses. And while there are no ‘right answers’, prepare to be challenged! The course is free and you must work through it with a group (min: 2 people; max: 6). Form groups on your own, or once the course begins you can find a group.\n\n                                            Syllabus\n                        The course is designed to run for 6-weeks; each week covers a different Acumen leadership module, except for Lab 4 which takes 2 weeks.\r\nLAB 1: FOUNDATIONS OF LEADERSHIP &amp; MORAL IMAGINATION\r\nObjectives: Become familiar with the lab format for this course, get to know your lab group, dive deeper into your personal values, motivation and purpose for taking this course as well as Acumen’s view on leadership.\r\nPrep time: 1 hourLab time: 1.5 hours\r\nLAB 2: HOW TO DO GOOD?\r\nObjectives: Discuss and reflect on the different perspectives and complexities around “doing good”.\r\nPrep time: 1.5 hoursLab time: 2 hours\r\nLAB 3: ACUMEN IN CONTEXT\r\nObjectives: Understand Acumen’s investment model and where it stands in the international development discourse of the past, present and future.\r\nPrep time: 2 hoursLab time: 2 hours\r\nLAB 4: EVERYDAY BARRIERS\r\nObjectives: Exercise empathy and experience what it takes to put yourself in someone else’s shoes and understand their situation, feelings and motives.\r\nPrep time: 4 hoursLab time: 1 hour\r\nLAB 5: ADAPTIVE LEADERSHIP AND YOU\r\nObjectives: Understand the difference between adaptive and technical challenges; begin to get a feel for what it takes to face internal resistance while implementing changes; reflect on a personal adaptive challenge and the over-all course.\r\nPrep time: 1 hourLab time: 2 hours\n                                    ", 
    "end_date": "2015-03-03T00:00:00Z", 
    "title": "Acumen Essentials I: Intro to Moral Imagination and Challenges in Poverty Alleviation", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "+Acumen"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://plusacumen.org/courses/acumen-leadership-essentials/", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-01-20T00:00:00Z"
}