{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Adaptive Leadership is a practical leadership framework developed by Ron Heifetz and Marty Linsky at Harvard University’s John F. Kennedy School of Government. The Adaptive Leadership course is designed to help individuals and organizations through consequential change in times of uncertainty when there are no clear answers. It teaches leaders to identify and tackle systemic change through a process of confronting the status quo and identifying technical and adaptive challenges.\r\nA technical challenge is solved through addition expertise and information. Adaptive Challenges are the problems that require change at the core of what people are doing, feeling, and thinking and require a tailored approach, beyond calling in an expert. It requires adaptive leadership.\r\nAt Acumen we believe that Adaptive Leadership is a critical skill. Changing the way the world tackles poverty is an adaptive challenge. We are thrilled to be working with the Cambridge Leadership Associates (CLA) to offer this free introductory course.\r\nThe world needs you to lead. This is your invitation.\n\n                                            Syllabus\n                        Week 1: Purpose and Possibility Identifying Your Challenge\r\n\r\nBegin to define a challenge that you will use during the course\r\nForm a peer consulting group and use it to gain feedback on your challenge\r\n\r\nWeek 2: Identify Your Challenge – Diagnose the System\r\n\r\nUnderstand the distinction between the technical and adaptive aspects of your challenge\r\nRefine your challenge with your peer group\r\n\r\nWeek 3: Map Your Stakeholders – Mobilize the System\r\n\r\nDefine the various stakeholder factions relevant to your challenge and identify their values, loyalties and potential losses\r\nBrainstorm ways in which you may begin to mobilize these stakeholders in order to make progress on your challenge\r\nUse your peer consulting group gain feedback on your stakeholder analysis\r\n\r\nWeek 4: Practicing Courageous Conversations – Deploy Yourself\r\n\r\nLearn how courageous conversations can be a tool for moving people\r\nIdentify an opportunity where a courageous conversation could help you make progress on your challenge\r\nPrep and practice a courageous conversation with your peer group\r\n\n                                    ", 
    "end_date": "2015-11-11T00:00:00Z", 
    "title": "Adaptive Leadership: Mobilizing for Change", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Cambridge Leadership Associates", 
        "+Acumen"
    ], 
    "commitment": "5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://plusacumen.org/courses/adaptive-leadership/", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-10-14T00:00:00Z"
}