{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Whatever the type or scale of your project, delivering great results, on time and within budget, is always a challenge. This free online course introduces you to the essential skills and processes which support successful project management in a way that allows you to apply them to your own context.\n\nVisualise, plan, manage and evaluate projects successfully\n\nYou will learn techniques to help you visualise, plan and manage key activities and events in your project, and make links between project management and related theories of innovation, change and people management.\n\nYou will be introduced to essential tools which support project management, as well as the fundamental personal skills of team selection, management and evaluation. The course will also cover the stage of evaluating project performance and learning for the future.\n\nWhile other courses on project management may propose complex methods and techniques, this course aims to provide participants with the skill-set to play an active role in a project environment right away. Along with the fundamental technical notions, you will gain confidence with project document templates in Word, Excel and Powerpoint, as well as some web tools for project management.\n\nDevelop fundamental business and finance skills\n\nThis course has been developed by The Open University Business School – a pioneering institution that is triple accredited by AMBA, EQUIS and AACSB.\n\nIt is one of eight from The Open University, designed to help you gain fundamental business and financial skills, including communication, networking, relationship building, project management, personal financial planning and management, investment and financial services.\n\nYou can complete this course as part of one of these two programs:\n\nBusiness Fundamentals: four courses, which will boost your employability and effectiveness at work, and enable you to earn a FutureLearn Award.\n\nBusiness and Finance Fundamentals: eight courses; holders of FutureLearn Certificates of Achievement for all eight courses can earn 30 UK credits towards The Open University Business School’s BA in Business Management by passing a linked Open University assessment module (requiring separate OU registration and fee).\n\nFor further information about registration, the final assessment course and the BA in Business Management, visit the Open University website.\n\n\n                                    ", 
    "end_date": "2017-06-12T00:00:00Z", 
    "title": "Business Fundamentals: Project Management", 
    "price": 0, 
    "instructors": "Giacomo Carli", 
    "institution_name": [
        "+Acumen", 
        "The Open University"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/project-management?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2017-05-15T00:00:00Z"
}