{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    By the end of this course, you will be able to demonstrate effective coaching practices that you can immediately put into place within your organization in order to create a culture of accountability.  After going through the course materials and completing the assessments, you will be able to establish consistent and effective one-on one-coaching meetings with those you manage.  In addition you will explore common performance scenarios managers’ face, and be able to determine the causes of poor performance and develop am appropriate coaching response.\n\n                                            Syllabus\n                        Course Overview &amp; How to Create a Culture of Coaching and AccountabilityIn this first module, you will reflect on all of the key elements of the coaching process we've talked about thus far in the specialization - mission, purpose, vision, accountability, key performance indicators, and expectations. After completing this module, you should be able to describe techniques for coaching different types of employees, and be able to start establishing an effective coaching practice that will work for you and all the employees that make up your team.Designing a 1:1 Coaching Practice for Those You LeadThis module is an invitation to think about how you manage your face-to-face or one-on-one time with the employees you manage. We'll discuss the importance of having 1:1 meetings as well as ensuring consistency in your coaching with all of the employees you supervise by creating a coaching agenda. By the end of this module, you should be able to explain the importance of KPIs and goals in coaching practices, create a coaching agenda, and use common and effective coaching tools when having conversations with those you supervise.Applying Coaching Algebra to Typical Performance ScenariosThis module will discuss how to handle performance scenarios that all managers will likely deal with when coaching employees. After completing this module, you will be able to apply Coaching Algebra to diagnose the performance gap, describe some basic techniques when having the conversations, and apply either tactical or developmental accountability coaching for each of the common situations listed below.Coaching the CoachThis final module is all about issues related to coaching managers who lead, and therefore coach, other employees. By the end of this module, you will be able to demonstrate how to coach managers effectively in order to drive performance of the employees who report to them, ultimately ensuring a culture of coaching and accountability at all levels of an organization.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Coaching Practices", 
    "price": 0, 
    "instructors": "Kris Plachy", 
    "institution_name": [
        "University of California, Davis"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/coaching-practices", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}