{
    "selfpaced": true, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Business &amp; Management\n                                                                                                    &gt; Management &amp; Leadership\n                                                            \n                            \n                                                \n                    \n                    \n                    This course is designed for students of all backgrounds who have an interest in how firms are governed, the forces that have helped define modern management practice, and the outcomes of that practice not only for the firm itself, but also for the societies in which they operate. For students who are thinking of a career in management, it may also prove useful as a basic introduction to some of the conceptual vocabulary and ideas behind modern theories of management. \n\nUsing a wide disciplinary approach - from economics and history to social theory and even a smattering of biblical criticism - the course will invite students to consider several core management strategies and priorities from often unexpected perspectives in order to judge their success or failure. The key objective of the course is to bring into critical focus how we think about the function and culture of management, how managers understand their role within a firm, how they take decisions, set priorities and benchmark success and failure. \n\nTopics include: the function of the firm; the role of incentive; the ways in which narrative forces shape decision making, and how market relationships define the managerial culture in ways that can lead to sub-optimal outcomes.\n\n                                            Syllabus\n                        The Lessons from Rome Part IIn Ancient Rome, merchant organisations very similar to modern firms were critical to capitalising key markets and to solving serious logistical problems to enable a vibrant trading network across the Mediterranean, including, critically, supplying the city of Rome itself with the food its citizens needed to survive. We will examine the Roman grain market and the organisations that operated within that market to ask: what, exactly, is a firm? What led to the firm's evolution? And what is the issue of agency that a firm inevitably entails?The Lessons from Rome Part IIThis lecture expands upon the first discussion, drawing from the insights gained about firm organisation in the Ancient world to ask about the effectiveness of the Forced Distribution Ranking Scheme (also known as \"stack and rank\", \"up and out\", etc...) to evaluate and promote or terminate employees, widely used by many of today's leading corporations.What is Innovation?We live in the innovation economy. Firms have chief innovation officers. Innovation is, so we are told, the key to securing the future. And there are quite literally millions of books on the subject of innovation. So, what does it mean? And is it a useful idea for management? We'll consider both questions. The Power of NarrativeWhat do Hollywood movies, the Synoptic gospels, housing bubbles, Alan Greenspan's monetary policy, and the world's worst merger have in common? This week's lecture will develop a reading of narrative in order to explore a common pitfall that affects many managerial decisions.Is Shareholder Value a Good Idea?Perhaps the most important lecture of the course. Almost all publicly traded firms are beholden, either explicitly or implicitly, to the principle of creating shareholder value. This week, we look at the history of this idea, how it has become widespread as a principle of corporate governance and how it has changed fundamentally the nature of the firm over the last 40 years. We will look at who the shareholders are, where their interests lie and what they have gained from this development. We will consider the wider and long-term consequences both for the firm and society. And we will ask - is this the kind of capitalism we really want? Case StudiesWe look at the examples of two companies whose recent experiences encapsulate many of the core ideas of the course. The first is Apple, which, in the context of reporting their quarterly earnings in the Spring of 2013, committed an unprecedented amount of its capital reserves to a share repurchase scheme and dividend increase. We will look at the motivation and logic for this move. The second is Nokia (which has subsequently sold off its mobile phone business to Microsoft). We will look at how the company rose - and then dramatically fell - from its position as market leader in mobile communications.\n                                    ", 
    "end_date": "2016-03-07T00:00:00Z", 
    "title": "Critical Perspectives on Management", 
    "price": 0, 
    "instructors": "Rolf  Strom-Olsen", 
    "institution_name": [
        "IE Business School"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/critical-management", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-01-25T00:00:00Z"
}