{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    In this course you will explore:\n\n\n  \n    What it means to be a ‘digital leader’;\n  \n  \n    how aligning business and IT strategies and capabilities will enhance competiveness;\n  \n  \n    and the role that digital technologies can play in empowering business.\n  \n\n\nWho is this course for?\n\nDigital Leadership is aimed at top and middle management in any type and size of organisation, and in any industry.\n\nWhether you’re a CEO or someone involved in improving business competitiveness through digital technologies, this course is for you. We don’t expect you to have any prior knowledge of management theory or hands-on technology skills to get started.\n\nRepresentatives of both profit and non-for-profit organisations will benefit through better understanding of how to plan, manage and implement new digital technologies.\n\nDigital Leadership is an ideal taster course if you’re thinking of pursuing an executive education, Master’s degree or MBA.\n\nWhat will be expected of you?\n\nThis free online course consists of a variety of videos, articles, case studies, discussions, quizzes and activities based on your own experiences.\n\nYou will be encouraged to share examples of the role that new technologies play in your organisation and how they strengthen competitiveness, enabling you to benefit from other learners’ experience and to reflect on more effective approaches.\n\n\n  ‘One of the unexpected benefits of a MOOC is the opportunity to share conversations with a range of people I would be unlikely to meet normally. I was delighted to find that my assignments were being peer-reviewed and my ideas were being seen by some real professionals - a global partner at a big four global accountancy firm and the head of IT for a major international manufacturer. The different cultural and business perspectives really enriched the experience and provided something no bricks and mortar course could match.’ Richard Sullivan, Senior Leadership Development Manager, The Co-Op\n\n\nDelivered by the Henley Business School\n\nDigital Leadership will be delivered by Henley Business School - a triple accredited, world-renowned business school that is part of the University of Reading. Henley offers a full suite of business education from undergraduate and postgraduate study, to executive education and the Henley MBA.\n\nOur European partners\n\nThis course is based on Henley’s collaborative research with the European Commission and partners including: Aarhus University, INSEAD, IE Business school, Antwerp School of Management, New Bulgarian University, European Foundation for Management Development, PIN-SME, IDC Europe and Empirica.\n\n\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Digital Leadership: Creating Value Through Technology", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "University of Reading"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/digital-leadership?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}