{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Le MOOC éléments de santé au travail pour les ingénieurs et managers, ne vise pas à former des spécialistes de la santé au travail. Son but est de fournir des éléments permettant aux cadres ou futurs cadres d’intégrer cette dimension dans leur pratique professionnelle. Pour cela, le contenu du cours s’articule autour de trois axes.\r\nLe premier est de fournir aux cadres des éléments leur permettant de réfléchir à leur pratique, de leur permettre de comprendre le réseau de contraintes dans lequel ils se situent. Le deuxième est de développer des compétences managériales pour favoriser une relation entre le travail et la santé qui soit profitable tant pour les équipes que pour la performance globale des entreprises.\r\nLe deuxième est de développer des compétences managériales pour favoriser une relation entre le travail et la santé qui soit profitable tant pour les équipes que pour la performance globale des entreprises.\r\nLe troisième est de présenter le cadre juridique et institutionnel de la santé au travail et les responsabilités qui incombent aux employeurs ainsi que les grands pièges à éviter. Pour transmettre ces connaissances et ces compétences, un cours en ligne offre de nombreux atouts. Il permet de conjuguer des séquences de cours classiques, des témoignages d’acteurs et des outils d’auto apprentissage. En quelques heures d’étude, il permet de comprendre les enjeux de la santé au travail d’une façon plus dynamique et pratique que les formes d’enseignement traditionnelles.\r\nEnfin, il est particulièrement adapté à un large public qu’il serait impossible de rejoindre autrement.\n\n                                    ", 
    "end_date": "2016-05-02T00:00:00Z", 
    "title": "Eléments de santé au travail pour les ingénieurs et managers", 
    "price": 0, 
    "instructors": "William Dab", 
    "institution_name": [
        "CNAM"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/CNAM/01003S03/session03/about", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-03-14T00:00:00Z"
}