{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Projects are all around us. Virtually every organization runs projects, either formally or informally. We are engaged in projects at home and at work. Across settings, planning principles and execution methodologies can offer ways in which projects can be run more effectively and efficiently. Project management provides organizations (and individuals) with the language and the frameworks for scoping projects, sequencing activities, utilizing resources, and minimizing risks.\n\nThis is an introductory course on the key concepts of planning and executing projects. We will identify factors that lead to project success, and learn how to plan, analyze, and manage projects. Learners will be exposed to state-of-the-art methodologies and to considering the challenges of various types of projects.\n\n                                            Syllabus\n                        Welcome to the World of ProjectsWelcome to the course -- we're excited you're here! In our first week, we will gain an understanding of what a project is, what it isn't, and why that matters. We'll consider how projects are defined and a project’s three objectives. We will look at a model for examining a project’s organization and its stakeholders, and then analyze those stakeholders using a power/interest grid. We'll look at the main reasons why many projects fail and then learn how to measure success. Finally, we will review the key stages in the project life cycle and highlight the important features of each stage.  The Ins and Outs of Project PlanningDuring our second week, we will start digging into the details, focusing on how to develop a project plan. We'll understand why we plan and what a plan should or should not include. We will discuss the process of scoping out a project and see tools that can help us identify what should be included in our project. We'll learn about sequencing project tasks and the nature of the dependencies among project activates. We will learn how to determine a project’s duration and critical path, how it is determined, and why it is useful. We'll see how we should schedule a project and, finally, we’ll review how you can make changes to a plan to support your overall project objectives.It’s a Risky World and Then the Unexpected HappenedIn our third week, we will consider the risk and uncertainties projects face. We'll understand what is risky about projects. We will identify and assess project risks and prioritize these risks in order to focus our attention on those most impactful to the project. We’ll consider schedule risks in detail and ask, \"What is the likelihood of finishing on time? What are the drivers that may cause delays in my project?\" We will see how a project budget can be set to include a contingency. Finally, we'll consider situations with a high degree of ambiguity and identify methods than can useful in these situations.Ready, Set, Go: Project ExecutionIn our final week, we will move from plan to action and consider the execution phase of a project. We'll learn about the earned value approach for monitoring and controlling progress. We will consider the individuals who are executing the project and how their habits impact project progress. We'll discuss some alternative methods for project execution such as Agile, Scrum, and Kanban. Finally, we will review and summarize the course and our journey from project definition through execution and completion.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Fundamentals of Project Planning and Management", 
    "price": 0, 
    "instructors": "Yael Grushka-Cockayne", 
    "institution_name": [
        "University of Virginia"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/project-management", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}