{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Los factores que determinan el éxito de una organización cambian en el tiempo. Para muchas organizaciones estos cambios significan una oportunidad y para otras significan su fin por no poder adaptarse. \n\nEn los primeros tres módulos de este curso, ustedes aprenderán a identificar las principales amenazas del entorno organizacional. En particular, como cambios tecnológicos, económicos, sociales y políticos afectan el entorno de los negocios. En función de estos cambios, ustedes serán capaces de analizar el proyecto estratégico de la firma y sugerir cambios estratégicos. \n\nLos últimos tres módulos se enfocan en la implementación del cambio a nivel organizacional. Ustedes serán capaces de definir elementos clave del diseño organizacional y evaluar qué elementos son necesarios modificar para alinear la estructura con la estrategia de la firma. También serán capaces de formular estrategias de aprendizaje organizacional y cómo utilizar el poder y los procesos políticos para la transformación de su organización.\n\n                                            Syllabus\n                        Bienvenida al curso¡Bienvenidos al curso \"Gestión de Organizaciones efectivas”! Empiece por ver el video de bienvenida del curso y a responder un cuestionario inicial que nos ayudará a entender mejor cuáles son sus necesidades e inquietudes. Deseamos que disfruten del curso y ¡mucha suerte!Organizaciones en Entornos CambiantesEn este módulo describiremos cómo los factores de éxito de una organización cambian en el tiempo. En particular, proveeremos una visión sistémica de las fuerzas que moldean el contexto organizacional, advirtiendo que las organizaciones fallan por no saber o no poder adaptarse a estos cambios (concepto de inercia organizacional). Presentaremos dos formas de evolución organizacional, una basada en cambios graduales y otra basada en cambios revolucionarios (teoría del equilibrio puntuado). Finalmente, definiremos las implicaciones de estos procesos de cambio, tanto para las organizaciones como sus ejecutivos.El Entorno Tecnológico y Su Impacto OrganizacionalEn este módulo explicaremos cómo evoluciona la tecnología y las dinámicas de los cambios tecnológicos en las organizaciones. Definiremos una tipología de innovaciones tecnológicas: (1) incrementales, (2) disruptivas, y (3) arquitectónicas. Entenderemos por qué buenas compañías fallan en adaptarse a estas innovaciones tecnológicas, y explicaremos cuál es el impacto organizacional del entorno tecnológico.El Proyecto Estratégico de la OrganizaciónEn este módulo presentaremos distintos modelos para conceptualizar la estrategia de una organización, en particular: (1) el diseño estratégico, (2) la planificación estratégica, (3) el posicionamiento estratégico, y (4) los recursos estratégicos de la organización. Explicaremos de dónde surgen estos modelos y cuáles son sus limitaciones. Finalmente, advertiremos que no existe una única fórmula para analizar la estrategia de una firma, sino que hay que definir esta estrategia en función del entorno y del contexto de la organización.Diseño de Organizaciones EfectivasEn este módulo presentaremos distintos arquetipos organizacionales, definiendo los elementos clave del diseño organizacional. Explicaremos que estos arquetipos son consecuencia de la estrategia de la organización, advirtiendo que la estructura organizacional cambia como resultado de fuerzas internas y externas a la organización. Finalmente, explicaremos cómo evolucionan las estructuras organizacionales.Las Claves del Aprendizaje OrganizacionalEn este módulo definiremos los conceptos básicos del aprendizaje organizacional. En particular, los distintos tipos de conocimiento que adquieren las organizaciones, las habilidades necesarias para adquirir conocimiento, las rutinas organizacionales como una forma de almacenar conocimientos y las capacidades dinámicas de la firma. Explicaremos cómo como las organizaciones aprenden, seleccionan, almacenan y difunden conocimientos y mostraremos cómo estos procesos evolucionan en el tiempo.Poder y Procesos Políticos en OrganizacionesEn este módulo definiremos qué son los procesos políticos y por qué son útiles para la organización. Enumeraremos los atributos del poder, explicando las bases del poder social y organizacional. Finalmente, describiremos distintos tipos de poder que influencian nuestras decisiones.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Gestión de organizaciones efectivas", 
    "price": 0, 
    "instructors": "Julio Pertuzé, PhD", 
    "institution_name": [
        "Pontificia Universidad Católica de Chile"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/gestion-organizaciones-efectivas", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}