{
    "selfpaced": true, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    La administración de una empresa de alimentación y bebidas es una tarea fascinante.\n\nLos productos de alimentación y bebidas están tan profundamente arraigados en la cultura de la mayoría de los países, que la fabricación y venta de ellos no es sólo una cuestión de hacer y vender productos buenos y sabrosos, sino hacer productos que nutran el cuerpo, el alma y el corazón de las personas. Teniendo en cuenta lo anteriormente expuesto, no es difícil ver que la tarea se convierte rápidamente compleja.\n\nEste curso tiene un doble objetivo: en primer lugar, vamos a centrarnos en los desafíos contemporáneos que los gerentes y empresarios de las empresas de alimentos y bebidas deben ser capaces de enfrentar; en segundo lugar, vamos a ofrecer modelos y herramientas para planificar e implementar procesos apropiados para satisfacer a los clientes y construir una ventaja sobre la competencia.\n\nEl curso está compuesto por cuatro módulos y una introducción, cada uno explora uno de los dilemas que las empresas de alimentación y bebidas se enfrentan. Te será proporcionado un set de video lecciones y tendremos oradores invitados. En estas lecciones se hará una introducción accesible a temas específicos que será integrada con entrevistas a gerentes y expertos que darán ideas valiosas y ejemplos a los participantes.\n\nPara mejorar tu experiencia de aprendizaje con nosotros, pondremos a tu disposición un documental sobre las excelencias del Distrito de Módena que estará en un formato específicamente desarrollado para este curso con el fin de darles la oportunidad de experimentar en primera persona lo que los estudiantes de nuestro campus experimentan durante los viajes de estudio en las empresas italianas y europeas.\n\nA cada módulo le corresponde una prueba y la posibilidad de discutir con tus pares en los “discussion forums” que te darán la oportunidad de reflexionar sobre la variedad del mundo de alimentación y bebidas, sobre su complejidad, y sobre el poder de la red que construiremos juntos durante el curso.\n\nOradores Invitados:\n\nBarilla - Giuseppe Morici, Presidente de la Región Europa - www.barilla.com\nHeineken - Floris Cobelens, Director de Marketing - www.heineken.com\nMasterchef Italia Sky - Nils Hartmann, Director de Producciones Originales en Sky Italia - www.masterchef.sky.it\nTRDN - Martin Oetting, Director Ejecutivo - www.trnd.com\nEataly - Paolo Bongiovanni, Director de Marketing - www.eataly.it\nBranca - Nicolò Branca, Propietario - www.branca.it\nBerlucchi - Paolo Ziliani, Propietario - www.berlucchi.it\nGROM - Federico Grom, Fundador y Propietario - www.grom.it/en \nWinery Il Cavallante - Sergio Morpurgo, Propietario\nJoia Restaurant - Alta Cucina Naturale - Pietro Leemann, Propietario y Chef - www.joia.it\nManpowerGroup Italia - Elena Gelosa, Director de Marketing y Comunicación -www.manpower.it\nProyecto Expo 2015 Chile - Guillermo Ariztía, Director del Pabellón chileno - www.expomilan.cl\nTetra Pak - Matthew Hatton, Director de Inteligencia del competidor - www.tetrapak.com\nBioHombre - Matteo Panini, CEO - www.hombre.it\nAcetaia Maletti - Carmen &amp; Claudio Maletti\nCantine Riunite y CIV - Vanni Lusetti, CEO; Francesca Benini, Gerente de Ventas y Marketing; Elena Lottici, Gerente de Exportaciones; Mario Vandi, Director de Marketing - www.riunite.it\nGlemGas - Marco Guerzoni, Gerente de Proyectos - www.glemgas.com\nBibendum Catering - LaFranceschetta58 - Sabrina Lazzereschi y Marta Pulini, Propietarios y Fundadores - www.bibendumcatering.it, www.franceschetta58.it\n\n                                            Syllabus\n                        Información sobre el cursoAprender acerca de las complejidades de las empresas de alimentación y bebidas, y adquirir las competencias necesarias para trabajar en tal industria.\nProducto vs. MercadoCómo los productos generan valor para el cliente y cómo los clientes valoran los productos y su calidad.Tradición vs. InnovaciónEl papel de la tradición y la innovación a lo largo de la experiencia del cliente en la industria de alimentos y bebidas. El valor de las marcas en el dilema entre la tradición y la innovación.Local vs. GlobalHay un valor en ser local en un mercado global y un valor en ser global en un mercado local. La función de las redes de distribución de alimentos y bebidas en los mercados internacionales.\nPequeño vs. GrandeAprovechar la dimensión de una empresa y usarla como ventaja competitiva en los mercados de alimentos y bebidas. Planificar estrategias de crecimiento en diferentes mercados.Nuevas perspectivas desde el mundo de la alimentación y bebidasEn esta sección puedes encontrar algunos materiales addicionales para descubrir algunas nuevas y interesantes perspectivas del mundo de la alimentación y bebidas\n                                    ", 
    "end_date": "2015-11-12T00:00:00Z", 
    "title": "Gestión de las empresas de alimentación y bebidas", 
    "price": 0, 
    "instructors": "Gabriele Troilo", 
    "institution_name": [
        "Università Bocconi"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/empresas-alimentos-bebidas", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-10-01T00:00:00Z"
}