{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    This course teaches you the simple principles expert managers use to improve and motivate employee performance. You’ll never have to avoid telling an employee “the truth” again, because the seven techniques we teach will not make employees defensive or afraid. As a manager, or someone who would like to be a manager, you’ll also learn specifically what feedback is, how negative feedback is weighed more heavily than positive, and how positive feedback can super-charge behaviors such as creativity and teamwork.\n\nGiving feedback is a skill which develops over time. We give you a process you can use to improve your feedback skills and deliver it with confidence. You will find that there is a scientific basis for many of your observations and intuitions about feedback—such as, it is hard to give correctly, people don’t like it, and more. This will be reassuring as you learn how to overcome these difficulties. We hope you have a fantastic time becoming a better manager!\n\n                                            Syllabus\n                        Introduction to Giving Helpful Feedback and Positive FeedbackThe goal of this course is to give you the confidence to deliver both negative and positive feedback successfully and to leave the person receiving feedback with their dignity.   To boost your motivation, in the first week we outline specific benefits of mastering feedback skills and provide examples of people whose careers changed because of timely feedback.  We also discuss positive feedback and expectations, powerful tools to help people learn at work.   You will be able to define both and know how they improve employee performance.   You will learn how positive feedback can be delivered in many situations and appreciate the power of positive feedback to enhance employee creativity and teaming skills.  We hope that you’ll be able to use this new knowledge immediately.    Negative Feedback:  Use With CautionNegative Feedback is a specialized learning tool.  We all know that negative feedback feels punishing.  Our goal this week is for you to understand why it is punishing, why we hesitate to use it, and when it can be used effectively without negative consequences.   You will be able to identify specific situations where negative feedback is given more weight than positive feedback and learn a technique that can overcome some of negative feedback’s harmful side effects.   Armed with a clearer concept of the pluses and minuses of negative feedback, you can be more confident that you are using it appropriately at work.The Seven Essential Feedback Skills - Part IBased on your work in the first two weeks, you can now describe negative and positive feedback and appreciate the power of these tools to change behavior.  In the next two weeks, we take the next step towards building your feedback skills by teaching you seven specific skills to use when delivering professional feedback.  At the end these two weeks you will know how to deliver work-related feedback that is effective at changing an employee’s behavior while still preserving their dignity. The Seven Essential Feedback Skills - Part IIThis week we continue building on your knowledge of the seven essential feedback skills.Giving Helpful Feedback:  Turn Your Knowledge Into Long-Term ChangeYou now know the fundamentals of positive and negative feedback and the skills necessary to deliver both.  In this module we begin by describing situations where no matter how talented you are, your feedback will not “get through” to your employee.  These situations can be discouraging and we point them out so you can diagnose why your feedback may not have worked.  We then describe a process to enable you to continue practicing and improving your new skills. True change takes time, but the journey is worth it.Helpful Class Resources\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Giving Helpful Feedback", 
    "price": 0, 
    "instructors": "Tracy Jennings", 
    "institution_name": [
        "University of Colorado Boulder"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/feedback", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}