{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    *** This course will be offered in English ***\n\nPublic institutions, non-governmental organizations, development agencies, and others who promote economic and social development in Latin America and the Caribbean often struggle to turn proposals into concrete realities that increase social well-being and achieve results within the available time with scarce resources.\n\nThis course provides concepts and tools to apply in project management that can generate a substantial change in the way objectives are being met. This MOOC seeks to strengthen participants' capacities in project management for development so that projects can be effectively and efficiently executed.\n\nThis project management MOOC includes case studies that will help you better understand key project management concepts and tools; presentations from Project Management Professional (PMP)® certified with ample experience in the topic; discussion forums; and selected readings.\n\nThe Project Management for Results (PM4R) methodology, developed by IDB's Inter-American Institute for Economic and Social Development (INDES), serves as a conceptual base for this course. PM4R's contents are based on A Guide to the Project Management Body of Knowledge (PMBOK® Guide) - Fifth Edition, Project Management Institute, Inc., 2013.\n\nAlthough these best practices have been present for many years in corporate projects, the IDB has led its progressive inclusion in the public sector and in development projects, contributing to the construction of realities that improve lives.\n\nINDES as a Registered Education Provider (R.E.P.) has been approved by the Project Management Institute (PMI)® to issue 30 professional development units (PDUs) if you earn the verified certificate in this course.\n\nIf you have any questions, please contact us at idbx@iadb.org.\n\nThe preparation of this course was financed by the Institutional Capacity Strengthening Fund (ICSF), thanks to the contribution of the Government of the People's Republic of China.\n\nPMBOK is a registered mark of the Project Management Institute, Inc.\n\n                                    ", 
    "end_date": "2016-05-31T00:00:00Z", 
    "title": "IDB6.1x: Project Management Techniques for Development Professionals", 
    "price": 0, 
    "instructors": "Ernesto Mondelo, Roberto Toledo Rodriguez and Vanessa Sayos del Castillo", 
    "institution_name": [
        "IDB ( Inter-American Development Bank )"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/project-management-techniques-idbx-idb6-1x", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-04-26T00:00:00Z"
}