{
    "selfpaced": true, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Successful projects require careful upfront planning. In this course, you’ll learn the key roles and responsibilities of the project manager and project team. You’ll also learn to answer some key questions upfront to help you meet project objectives: What will this project accomplish? Why is this project important? Who benefits from this project? How will we plan for successful outcomes?\n\n                                            Syllabus\n                        Get Started!Get started in this module by reviewing the course overview and participating in the course survey.What is a Project?In this module, we will identify the key characteristics of a project, identify primary project constraints, define the role and responsibilities of the project manager, and identify Project Organizational Structures.Get to Know your StakeholdersIn this module, we will understand the definition of a project stakeholder, identify who they are, identify their information needs, and define responsibility for managing stakeholders and controlling their engagement.Scope MattersIn this module, we will define the purpose of using a project charter, summarize the key elements of a project plan, and discuss the scope statement and the Work Breakdown Structure (WBS).Authority vs. InfluenceIn this module, we will describe the difference between authority and influence and identify common sources of conflict within a project environment.Wrap UpWrap up this course by meeting our industry expert panelists, taking the final exam, and participating in our post course survey.\n                                    ", 
    "end_date": "2015-06-30T00:00:00Z", 
    "title": "Initiating and Planning Projects", 
    "price": 0, 
    "instructors": "Margaret  Meloni", 
    "institution_name": [
        "University of California, Irvine"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/project-planning", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-05-19T00:00:00Z"
}