{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    This short free online course, which benefits from CPD accreditation, is designed for anyone interested in commercial innovation.\n\nWhether you run your own business or are a cog in a bigger wheel, work on your own or are part of a large multinational organisation, this course will help you see how you can be an agent for change and help push forward innovation.\n\nLearn how innovative ideas emerge and become reality\n\nYou will see that very few innovative ideas are new; the vast majority take something that is already working and improve it. This may be a product, service or process. Those who are closest to the business often have the most innovative ideas.\n\nAt the end of the course you will have a better understanding of:\n\n\n  how to encourage and contribute to innovation in your business;\n  how to turn ideas into reality (for the benefit of the business);\n  the role of people in successful innovation.\n\n\nExplore case studies from major high street retailer, Marks &amp; Spencer\nUsing case studies from the University of Leeds and major high street retailer, Marks &amp; Spencer, we connect theory and practice to demonstrate the importance of innovation in growing and sustaining a business.\n\nYou will explore a range of important innovations, including the introduction of chilled foods and the development of man-made fibres. You will look at how ideas emerge and develop, and their impact not only on the business, but on how we live our lives today.\n\nThrough the course you will see that innovation can take many forms and that innovation needs people and organisations with a willingness to embrace change, to wonder “‘what if’,” to challenge the status quo and most importantly to work together.\n\nSuccessful innovations need both determined individuals and a collaborative approach. Join this course to start your journey of innovation.\n\nWhat other learners say\n\nThis course first ran in September 2014. Here is a small selection of comments from learners who took it:\n\n\n  “This has been a fascinating and engaging course…interactive, great content, interesting presentation of information….well done to all involved.”\n\n\n\n  “Thank you for a wonderful and thought provoking course that has made me look at my own business in a new light.”\n\n\n\n  “Thank you for a well laid out journey of innovation discovery. This course has helped me improve my knowledge and more importantly how I can apply this in my day to day work environment.”\n\n\n\n                                    ", 
    "end_date": "2015-06-29T00:00:00Z", 
    "title": "Innovation: the Key to Business Success", 
    "price": 0, 
    "instructors": "Dan Trowsdale", 
    "institution_name": [
        "University of Leeds"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/innovation-the-key-to-business-success?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-06-08T00:00:00Z"
}