{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    La única característica inalterable de las personas y las organizaciones es, paradójicamente, el continuo cambio. Y, sin embargo, ¿crees estar preparado para gestionarlo?En Universitas Telefónica entendemos los cambios como oportunidades… Oportunidades que pueden convertirse en éxitos si se afrontan de la manera adecuada. Con esta filosofía y nuestra experiencia hemos diseñado el MOOC Leadership for change.Un curso gratuito y en castellano donde compartimos el modelo de gestión del cambio que está guiando a Telefónica en su proceso de transformación. Cuenta con un claustro formado por expertos en gestión del cambio de Telefónica y con Nando Parrado, el superviviente de la tragedia aérea de los Andes en 1972. Su historia es el perfecto ejemplo de liderazgo ante los cambios en momentos decisivos.Leadership for change supondrá un viaje revelador para sus alumnos y todos los aprendizajes adquiridos serán de inmediata aplicación en el entorno laboral y personal.La primera edición del curso contó con casi 15.000 inscritos. Estos son algunos de sus comentarios:“Ha sido un curso que sin duda me ha dejado gran enseñanza en el proceso de liderazgo que ejecuto día a día con mi equipo” Wilfredo Rubio.    “Uno de los mejores MOOC que he tomado. Es increíble las lecciones de liderazgo, adaptación al cambio, lucha y perseverancia que nos dejan el testimonio de esos héroes” Ginette Chong.“Hay algo que estoy absolutamente seguro que puedo cambiar: yo mismo!!! Si yo cambio, entonces seré capaz de transformar al mundo!!!” Jesús Caballero.¡Bienvenidos al cambio!\n\n                                    ", 
    "end_date": "2015-12-04T00:00:00Z", 
    "title": "Leadership for Change / Liderazgo en tiempos de cambio", 
    "price": 0, 
    "instructors": "Bernardo Quinn and David Freire", 
    "institution_name": [
        "Universitas Telefónica"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://miriadax.net/web/liderazgo-tiempos-cambio-3-ed", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Miríada X"
    ], 
    "start_date": "2015-10-30T00:00:00Z"
}