{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Today’s workplace calls for a new style of leadership to embolden and accelerate innovation. Design offers a novel way of discovering opportunities and bringing new approaches to life in ways that benefit all stakeholders. Learn how to engage with end users, effectively frame problems, identify potential solutions, and build prototypes to test assumptions and learn what works (and doesn’t). Then dive into a range of ways large and small to bring design innovation into your organization.\n\n                                            Syllabus\n                        Using Design Principles to Innovate and Find OpportunitiesYou will learn that the first step in the design process is finding opportunities. Human-centered designers do so by immersing themselves in a particular user context to identify areas of focus for design innovation.Exploring IdeasHow do we take the opportunities that we've uncovered and turn them into new possibilities? In this module we'll explore ideation, sketching, and storyboarding as tools to generate and communicate ideas.Prototyping to LearnIt is easy to think of prototypes as “drafts” of the final design, but in this module we’ll teach you to think of prototypes a bit differently:  as tools for learning.  We will discuss approaches for maximizing the amount that you learn from prototypes, and iterating your way rapidly toward outstanding results.Leading Design InnovationHow do you bring design innovation to your organization and sustain it over time? In this module we will learn theory and practical techniques to help you lead an organization that routinely produces innovative products, services, and systems.\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Leadership Through Design Innovation", 
    "price": 0, 
    "instructors": "Elizabeth Gerber, Pam Daniels, Edward Colgate and Greg Holderfield", 
    "institution_name": [
        "Northwestern University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/leadership-design-innovation", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}