{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Developed by David Owens at Vanderbilt University and customized for the cultural sector with National Arts Strategies, this course is designed to help arts and culture leaders create an environment where new ideas are constantly created, shared, evaluated and the best ones are successfully put to work.\n\nOne of the toughest challenges for any leader is getting traction for new ideas. Winning support can be a struggle. As a result, powerful new ideas often get stuck. This is especially true in the cultural sector. People involved in arts and culture often have little time and even less money for experimentation and risks. This course will help those in the performing arts, museums, zoos, libraries and other cultural organizations build environments where new management and program ideas flourish.\n\nLeading Innovation in Arts &amp; Culture will teach you how to make an \"innovation strategy\" a fundamental component of your organization's overall strategy. In this seminar you will learn to:\n\n- Analyze constraints on innovation in your organization, foresee obstacles and opportunities, and develop a shared vision\n- Develop a process to manage the demands of multiple stakeholders, shifting priorities and the uncertainty inherent in new initiatives\n- Create a culture for innovation and risk-taking that generates new perspectives and challenges existing practice\n- Create a strong customer focus within your organization that anticipates customer needs\n\nNational Arts Strategies worked with David Owens to customize this course for those working in the cultural sector. They based their work on David Owens’ Leading Strategic Innovation in Organizations course. This highly interactive 8-week course will engage you in a series of class discussions and exercises.\n\n                                            Syllabus\n                        Context of InnovationWe are in creative fields, so this stuff should be easy, right? But we hear all the time from people in the field that it really isn't. Conversations keep circling the same old ideas, while exciting possibilities languish. Our first module introduces the course by examining the context within which innovation takes place. We start by exploring the question of why innovation fails. The proposition is that it is more effective (and probably easier) to stop stopping innovation, than it is to get better at it. We'll look at a 6-level framework for understanding innovation constraints. Your goal is to gain a high-level overview of the course content.  Individual Level ConstraintsOur second week starts our in-depth examination of the framework at the individual level.  Everyone in arts and culture is creative, right? Well, probably more creative - or more comfortable with creativity - than the average person. But people in arts and culture also understand better than the average person that creativity is a process, and you can get better at that process. In our model of individual constraints we will look carefully at Perception Constraints, which are failures to gain access to new and relevant information;  Intellection Constraints, which are failures in thinking strategies to expose new insights and relationships; and finally, Expression Constraints which represent failures in our ability to express or articulate our ideas in ways that allow us to test our thinking or convey them to others. Our goals this week are 1) to diagnose our susceptibility to these constraints, 2) to develop strategies for overcoming them, and 3) to recognize how others may experience these constraints as we share our ideas with them. Group ConstraintsThe lone genius hard at work in her garret is, we know, not exactly how the world of art and culture really works. This week's topic is Group Innovation Constraints and is grounded in the research and insights of the field of social psychology.  We will be exploring the way that group dynamics affect the problem of innovation.  Our basic premise is that in order to move from a creative idea to an innovation, you will need the cooperation and collaboration of others.  We will take critical looks at emotion processing in groups, at group cultural norms, at group processes, and even at the environments within which groups function.Organizational Constraints This week's topic is Organizational Innovation Constraints.  We are interested in understanding how organizations function in ways that can facilitate or constrain innovation in terms of their Strategy, Structure, or their Resources.  This perspective is grounded in the idea that to develop and execute an innovative idea, you are going to need some form of organization, and the choices you make in terms of its functioning are consequential to its ability to innovate. \nIndustry / Sector ConstraintsThis week's topic is Industry/Sector Innovation Constraints. We are interested in understanding how the dynamics in a sector will facilitate or constrain innovation. We start with the story of Kodak's invention of the digital camera, trying to understand why they were unable to be successful at commercializing it.  While there are some organizational innovation constraints that apply, we'll see that taking the perspective of economics and strategy, looking at competition constraints, supplier constraints, and market constraints, can provide a much more powerful analysis and explanation. We end with a brief overview of the \"Disruptive Technology\" (aka Innovator's Dilemma) work of C. Christensen, showing it's place within and consistency with the innovation constraints framework.Societal ConstraintsThis week's session explores the perspective of the sociologist and anthropologist. People who adopt this view argue that innovation is likely to be constrained by (1) the views that a society holds of itself, (2) how it enforces those views, and (3) the history by which it came to hold and share those views. In more basic terms, this view suggests that innovation will fail when a society does not see how a proposition for change can make it become more of what it wants to be. Society will oppose changes that are antithetical to the ideals that it holds for itself. This constraint should feel familiar to arts and culture, where so much work challenges how we as individuals, groups and societies see and understand ourselves and our world.\n\nAs in other sessions, in addition to the watching the lectures, you are asked to do the diagnostic survey and reflection essay, and participate in the forum discussions. As an additional exercise (All Students), this week will also require you to analyze a case study.Technological ConstraintsThis week takes the perspective on innovation of the scientist and engineer.  This view holds that innovation is constrained by the laws of nature and our ability to manipulate them.  It focuses on the physical limits we hit when we try to do things like improve acoustics, present light-sensitive artifacts in an engaging and immediate way, or bring together thousands of people in one place for a festival.  We will develop a model of these \"technological constraints\" by understanding the roles of 1) our knowledge of physics, chemistry and biology, 2) the nature of time and sequencing, and 3) the natural environment and ecology that form the context for our innovation.  The perspective is that innovation will fail when the proposed change does not function or functions in unanticipated ways. Leading an Innovation StrategyOur final week takes on the problem of innovating as if it really mattered.  We start with the story of Apollo 13, a life-or-death situation that required intense creative problem-solving, and consider the leadership behaviors that made successful innovation possible.  Next, since our focus so far has been on improving our own ability to innovate, we discuss how to use the innovation constraint model to drive adoption by those people who are the targets of our change. We then revisit the question of process, and look at the role of the leader during each phase of a team's innovation journey.  Moving to the organization-level of analysis we explore innovation portfolios and their ability to help us manage risk.  Finally, by way of conclusion in the course, we talk about the nature of YOUR constraints and the ways that you can continue to identify them and find ways to work around them.\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "Leading Innovation in Arts and Culture", 
    "price": 0, 
    "instructors": "David  Owens and Jim Rosenberg", 
    "institution_name": [
        "Vanderbilt University", 
        "National Arts Strategies"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/arts-culture-innovation", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}