{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, you will learn how to build your team, improve teamwork and collaboration, and sustain team performance through continuous learning and improvement. Specifically, you will learn best practices for composing a team and aligning individual and team goals. You will also learn how to establish roles, build structures, and manage decision making so that your team excels. This course will also help you manage critical team processes such as conflict resolution and building trust that have a profound impact on your team’s performance. You will discuss some of the best ways to harness the productive potential of teams while mitigating the risks and traps of teamwork.\n\nIn modern organization, most of work is done in teams, yet the results of teamwork are exceptionally mixed. Many teams are poorly designed and structured, fraught with dysfunctional conflict, experience coordination breakdowns and serious motivation challenges. As a result, many teams fail to realize their potential and frequently underperform even individuals working on similar tasks. After completing this course, you will acquire a set of tools and practices that enable you to effectively set up, run, evaluate, and continuously improve your team. Such insights will both make you a more effective team leader but also a standout contributor in team settings.\n\n                                            Syllabus\n                        Designing Your Team for ExcellenceAs a team leader, you must determine how best to compose and structure your team. You will need to determine the optimal team size, diversity of team members, values, and goals for the team -- all of which will have a big impact on team dynamics and performance. In this module, you will learn strategies and tactics to design your team effectively.Structuring Your Team for ExcellenceIn the first module of the course, we discussed your role as a team leader in designing your team's size, composition, diversity of personalities and values, and goals. In addition, you must determine how best to structure your team, specifically how you will structure decision making, rewards, and roles. You must also ensure the team has a clear set of norms that guide its behavior. In this module, you will learn strategies and tactics to structure your team effectively.Managing Team DynamicsIt is common to see teams working on identical tasks and having similar access to organizational resources and talent produce systematically different performance outcomes. This occurs because we mismanage team processes, or how teammates work on the task and interact with one another during teamwork. In this module, you will learn how to recognize most typically process hurdles in teamwork and how to overcome them, thus creating high-performing teams. Creating Sustainable Team Performance and LearningThis module is focused on creating sustainable levels of high-performance in teams. In this module you will therefore learn how to evaluate team performance and how to ensure this high performance is sustainable in your teams. Relatedly, we will discuss how to ensure team learning and effective flow of new ideas in your teams.  \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Leading Teams", 
    "price": 0, 
    "instructors": "Scott DeRue, Ph.D. and Maxim Sytch, Ph.D.", 
    "institution_name": [
        "University of Michigan"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/leading-teams", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}