{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    All of us we are engaged in organizations. Indeed, we participate in a family, a team, a sports club, group of parents in school our children. Therefore, daily experience as players or as witness the exercise of influence, some of which have very specific objectives.\r\nIndeed, if we consider leadership as an influence process that someone makes on others in pursuit of a wish shared goal, we are witnessing the exercise of leadership, which sometimes it meets expectations and is effective, that is, when the results are true and others ineffective when that expectation is not met.\r\nThis course aims to deliver a distinctly experiential approach some fundamentals and conceptual tools that allow the participant to learn and improve their exercise of leadership, because we are convinced that at some point should do it and when prepared will increase your chances of success.\r\nWe are convinced that everyone is encouraged to exercise leadership because although it is a complex process that depends on who holds it, upon whom it is exercised and the context of the relationship, it is not subject to a particular personality profile and at least one particular position in an organization.\r\nWe invite you to merge the course, with this, your first decision as leader.\r\n \n\n                                    ", 
    "end_date": "2014-11-05T00:00:00Z", 
    "title": "Liderazgo Real: liderar desde la experiencia", 
    "price": 0, 
    "instructors": "Rodrigo Jordan", 
    "institution_name": [
        "Universidad del Desarrollo"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/liderazgo-real", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2014-10-01T00:00:00Z"
}