{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, you will learn best practices for selecting, recruiting, and onboarding talent. You will also learn about the key approaches to measuring performance and evaluating your employees. In addition, you will learn how to develop and coach your talent so that they can realize their full potential at work. Altogether, you will gain a thorough understanding of the complete cycle of managing talent and creating a robust talent pipeline for your team and organization.\n\nManaging and developing talent is one of the top 3 issues on the minds of CEOs from around the world. In fact, CEOs cite managing and developing their leadership talent as the issue that is most important to the future success of their business but that their organizations are least capable of addressing effectively. This course will provide you with the insights, frameworks and tools to effectively manage and develop talent in your teams and organizations.\n\n                                            Syllabus\n                        The Talent PipelineIn this module, you will be introduced to the concept of the talent pipeline. Without amazing people to execute your team, division or company strategy, you will be unable to create value and move forward. Following this module, you will understand that the concept of strategy is first, followed by the positions or organization structure. Once designed, your recruitment brand will attract people to you. Through your recruitment strategies, you will recruit and select the best of the best that fit your team. On-boarding is critical to bringing them into your team and this module will help you to implement superb on-boarding processes.    Managing Performance Evaluation and FeedbackIn this module, you will learn about the central approaches for measuring and evaluating performance and behaviors and understand the implications of different evaluation systems for employees. You will also learn how to collect, assess, and use 360 degree feedback. In addition, you will learn how to recognize and mitigate key errors raters make in evaluating the performance of others. Finally, you will gain awareness of the stereotypes that can affect the accuracy of performance evaluations. Developing and Coaching Your PeopleAs a leader, it is essential that you develop, coach and prepare your team for success. When you help your team members learn and grow, their motivation and engagement increases, their performance improves, and they become more committed to the team. In this module, you will learn how to develop and coach your people to realize their potential and improve their performance.Creating and Building a Robust Talent PipelineTrue Talent to lead your team, division or company is a requirement in our world. But will you know Talent when you see it? In this module, you will be given a model to help to assess those who will be able to lead into the future. Once selected as a Talent, you will have to continue to develop the individual and engage them continuously. How do we best develop talent? By the end of this module, you will be able to create a talent development plan and begin its execution.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Managing Talent", 
    "price": 0, 
    "instructors": "Scott DeRue, Ph.D., Maxim Sytch, Ph.D. and Cheri Alexander", 
    "institution_name": [
        "University of Michigan"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/managing-talent", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}