{
    "selfpaced": true, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Business &amp; Management\n                                                                                                    &gt; Management &amp; Leadership\n                                                            \n                            \n                                                \n                    \n                    \n                    This course will help you manage project risk effectively by identifying, analyzing, and communicating inevitable changes to project scope and objectives. You will understand and practice the elements needed to measure and report on project scope, schedule, and cost performance. You will be equipped with the tools to manage change in the least disruptive way possible for your team and other project stakeholders.\n\n                                            Syllabus\n                        Get Started!Get started in this module by reviewing the course overview and participating in the course survey.Project CommunicationIn this module, we will define components of a communications management plan, understand the importance of communications channels, and define the key elements needed to measure and report project scope, schedule, and cost performance.Managing Project RisksIn this module, we will identify project risk events, discuss a risk statement for a specific event, prioritize identified risks, and develop responses for a high priority risks.Change HappensIn this module, we will identify and analyze changes to project scope, describe causes and effects of project changes, and define the purpose of conducting an lessons learned session.Wrap UpWrap up this course by meeting our industry expert panelists, taking the final exam, and participating in our post course survey.  Plus, review the bonus lesson on Project Procurement Management.\n                                    ", 
    "end_date": "2015-06-23T00:00:00Z", 
    "title": "Managing Project Risks and Changes", 
    "price": 0, 
    "instructors": "Margaret  Meloni", 
    "institution_name": [
        "University of California, Irvine"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/project-risk-management", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-05-19T00:00:00Z"
}