{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    This course is all about what’s core to leading and managing in organisations. Understanding who is important to an organisation – and that’s everybody who has a stake in it in some way – is a really good starting point. Building relationships with interested groups and people is time well spent. So too is time spent on planning. As someone once said ‘To fail to plan is to plan to fail’. If there’s no plan, how do organisations get people on board? If there’s no plan, what’s the difference between success and failure?  How do you know when things are going off track? Or going well?\n\nPlans are one thing. The people who can make the plans a reality are those with the right knowledge, skills and experience. Without the right person, performing as well as they can in the right job, plans don’t get off the ground. So building, supporting, growing and developing a team is much of what leading and managing is all about.   And sometimes that’s about tackling poor performance, which can be uncomfortable.\n\nDevelop a business plan and build an effective team\n\nThis four-week course will guide you through the some key aspects of leadership and management. You will:\n\n\n  Find out about stakeholders – the people and groups who have an interest in an organisation – and how to analyse them, communicate with them and build effective relationships with them.\n  Examine what is involved in making plans and implementing them at different levels in organisations.\n  Explore what makes for best practice in recruiting and selecting the right people for a team.\n  Look at how good induction can help to settle a new employee in so that they can perform well and enjoy their new role.\n  Find out how understanding what motivates people at work and managing performance can support individuals, teams and organisations as a whole.\n\n\nAt the end of the course you will have gained an insight into leadership and management and how you can develop the skills and knowledge to make you more effective in leading and managing in your organisation.\n\nLearn with The Open University Business School and CMI\n\nThe course has been developed by The Open University Business School – a pioneering institution that is triple accredited by AMBA, EQUIS and AACSB – and the Chartered Management Institute (CMI) – the leading authority on management and leadership in the UK.\n\nAs such, it will give you the opportunity to learn from both academic experts and experienced practitioners, who have achieved the CMI’s prestigious Chartered Manager status.\n\nTake your first step to becoming a Chartered Manager\n\nThe course is one of two in the Management and Leadership program on FutureLearn. When you complete both courses, buy a Certificate of Achievement for each and pass a final assessment, you will earn a CMI Level 5 Award in Management and Leadership - the first step to Chartered Manager status.\n\n\n\n                                    ", 
    "end_date": "2016-09-05T00:00:00Z", 
    "title": "Management and Leadership: Leading a Team", 
    "price": 0, 
    "instructors": "Angela Lilley", 
    "institution_name": [
        "The Open University"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/leading-a-team?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-08-08T00:00:00Z"
}