{
    "selfpaced": true, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    In the expression “creative thinking”, the keyword is not creativity; the keyword is thinking. With the help of great philosophers, you will rediscover the art of thinking.\n\nTo help leaders to be rigorous even without figures, great philosophers have lots of ideas. Managers are invited to rediscover the art of thinking. They should understand the role of mental models, realize the importance of cognitive bias, agree on clear definitions and efficient criteria etc. \n\nCreativity demands the ability to unshackle ourselves from conventional ways of thinking, to \"think outside the box\". But we need to go a step further. Once outside the box, we need to construct a new box or boxes (that is, new intellectual frameworks or models) to help us structure our thinking. Only once we have done so can we generate truly game-changing ideas.\n\n                                            Syllabus\n                        The Forgotten Half of ChangeThis lecture will discuss how strategy is mostly about leading change. New ideas are required because the world of tomorrow will be, again, different.\nAnd we need to remember change has two faces : perception and reality.\nHow do we Think ?In the first lecture, we’ve seen that if we want to change the world, we have to act.\nAnd if we want to change our perception of the world, we have to think.\nSo now… it is time to think about the way we think ! \n On the Shoulders of GiantsFor this third lecture, I invite you on a journey in the world of past ideas.\nSix guides will show us how they shaped this incredible world where everything is connected.Mental Models and PerceptionAfter a short recap, we will agree on four key definitions necessary to understand the rules of  thinking. \nThanks to a lot of examples, optical illusions and brain treasers, we will see how we build and how we use mental models.\nEureka or Caramba ?Heraclites is definitely right, status quo is not an option, change is a must. The only alternative is either to lead the process, or to be a victim of the process. We will also understand why paradoxically creativity and rigor are good friends…\nThinking in New BoxesAs I told you from the very first minute, philosophers don't claim to be right, they hope to be helpful. This sixth and last lecture is dedicated to you, strategists. We will see how to build the five \"new boxes\" we need to achieve the next big thing. \nThe Essence of ChangeIs technology making us stupid?Become a corporate philosopher!\n                                    ", 
    "end_date": "2015-01-06T00:00:00Z", 
    "title": "On Strategy : What Managers Can Learn from Philosophy - PART 1", 
    "price": 0, 
    "instructors": "Luc de Brabandere", 
    "institution_name": [
        "École Centrale Paris"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/management-philosophy", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-11-04T00:00:00Z"
}