{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Business &amp; Management\n                                                                                            \n                            \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Business &amp; Management\n                                                                                                    &gt; Management &amp; Leadership\n                                                            \n                            \n                                                \n                    \n                    \n                    One way or another, all employees are managed. But approaches to managing employees varying from employee-to-employee, job-to-job, manager-to-manager, organization-to-organization, and country-to-country. This course provides a foundation for developing your own approach to skillfully managing employees by illustrating alternative human resource management (HRM) strategies, introducing the importance of the legal context, and thinking about what motivates employees. This will then give you the factual and conceptual basis for developing specific, critical HRM skills in subsequent courses on hiring employees, managing performance, and rewarding employees. Don't know anything about HRM? That's OK! Leave this course with a new-found understanding of the range of options available for managing employees, a grasp of what makes workers tick, and the readiness to develop your own HRM skills.\n\n                                            Syllabus\n                        Alternative Approaches to Managing Human ResourcesWelcome to the first week of this course! This section starts with an introduction to the course, and then we'll spend two lessons looking at alternative ways of managing human resources. After completing this module, you will be able to… • Explain why managing people is important. • Compare strategies for managing human resources. • Evaluate the fit between an organization’s HR strategy, a manager’s style(s), and the business environment. • Recommend strategies and styles for managing people in a particular situation.  What Makes Employees Work? Money, Of Course!Welcome to the second module of this course! We'll be focusing on the monetary reasons for working, and the lessons for managers that result. After completing this module, you will be able to… • Explain how money can motivate some workers. • Identify key managerial concerns if workers are self-interested and view work economically. • Develop strategies for addressing these key concerns using insights from economics.What Makes Employees Work Revisited...Non-Monetary MotivationsWelcome to the third module of this course! We'll be focusing on the non-monetary reasons for working, and the lessons for managers that result. After completing this module, you will be able to… • Explain  at least four different reasons that people work not related to money. • Identify key managerial concerns when workers work for different  non-monetary reasons.•\tDevelop strategies for addressing these key concerns using insights from psychology and sociology. • Justify the (in)application of insights from economics, psychology, and sociology in different situations.  The People Manager as Part of a Complex SystemWelcome to the fourth and final module of this course! In this section, we'll finish laying a foundation for managing human resources by looking at the constraints faced by managers, especially the legal environment. After completing this module, you will be able to… • Explain at least four constraints that influence how human resources are managed in a particular organization. • Compare the ways in which the law does and does not see employment as a typical contractual relationship. • Create a list of legal and illegal HRM practices in your country. • Judge when to use strategies for managing people that go beyond what the law requires.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Preparing to Manage Human Resources", 
    "price": 0, 
    "instructors": "John W. Budd", 
    "institution_name": [
        "University of Minnesota"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/managing-human-resources", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}