{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    Avoid the pitfalls of strategy planning and execution with the tools and skills from this course. You'll learn the pillars of strategy execution--analysis, formulation, and implementation--and how to use the 4A model to effectively approach strategy execution. Finally, a panel of leaders from entrepreneurs, nonprofits, and industry, share their expertise gleaned from years of successful strategy planning and execution.\n\n                                            Syllabus\n                        Strategy AnalysisThis week, you'll connect strategic analysis to strategy execution. You'll walk through a series of questions to frame your analysis and ground your approach using the strategist's toolkit--and you'll learn a new tool, Hypothesis Testing, to unearth key assumptions related to choosing a strategy and assessing the validity of those assumptions. You'll also review data sources and how to \"make the data speak\" to guide your strategy decisions.Strategy FormulationThis week you'll learn about how strategy gets set and implemented in organizations. You'll discuss factors key to effective strategy formulation--and common challenges and pitfalls of strategy execution. You'll explore four different approaches to strategy formulation and how governance ties into effective strategy formulation.Strategy ImplementationWe welcome Professor Scott Snell to the course this week! He's a global specialist in strategy execution, and he shares his 4A Model for effective strategy execution: alignment, ability, agility, and architecture. This framework will help you ensure the human and organizational resources are in place to effectively execute your strategy.Practical PerspectivesThis week we welcome guest speakers from a range of industries, from startups to nonprofits, to share their expertise from years of successful strategy development and execution. They'll communicate their best tips to help you develop your strategist's toolkit. We're also fortunate to be joined by Darden's Dean Scott Beardsley, whose 26 years with McKinsey informs the concrete tips he shares to improve strategy development and execution.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Strategic Planning and Execution", 
    "price": 0, 
    "instructors": "Michael J. Lenox and Jared Harris", 
    "institution_name": [
        "University of Virginia"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/strategic-planning-execution", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}