{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    This course examines the ways nonprofit boards and the volunteers that serve on them add positive value to their organizations. It also examines common issues that challenge nonprofit board effectiveness in the governance process. The course covers the governance environment in which boards and leadership volunteers operate.  The aspect of the course that covers the “what” is the formal roles and responsibilities of boards whereas the “how” refers to the formal and non-formal approaches taken to carry out their roles vis a vis management of the organization. In addition to what and how, the course covers who, including leadership volunteers, board chairs, and chief executive officers (CEOs) with particular emphasis on developing leadership competency within the governance process.\n\n                                            Syllabus\n                        Preview Week: Course OverviewModule 1: Nonprofit Organizations and GovernanceWeek 1: The Nonprofit Sector and ResearchWeek 2: Nonprofit Organizations and Governance   Week 3: Board Authority and Role in Organizational Governance  Week 4-5: Concept Testing, Assignment Submission, and Peer Learning ForumsModule 2: Nonprofit Boards and the Governance ProcessWeek 6: The Board's Role in Strategic Planning  Week 7: The Board's Role in Performance AssessmentWeek 8: The Board's Role in Fundraising and Resource DevelopmentWeek 9-10: Concept Testing, Assignment Submission, and Peer Learning ForumsModule 3: Factors that Influence the Effectiveness of the Governance ProcessWeek 11: Board Meetings, Structures and Procedures  Week 12: Composition and Development of the BoardWeek 13: The Informal Culture and Leadership of the BoardWeek 14-15: Concept Testing, Assignment Submission, and Peer Learning ForumsConcluding Week 16: Board Effectiveness Semester Project Report Submission and Review  \n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "The Governance of Nonprofit Organizations", 
    "price": 0, 
    "instructors": "Yvonne Harrison and Vic Murray", 
    "institution_name": [
        "State University of New York"
    ], 
    "commitment": "5-7 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/course/nonprofitgov", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-01-26T00:00:00Z"
}