{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    We are in constant relationship with many organizations. Our world is submitted to regular changes as organizations evolve, come and go. Understanding your memberships and attachments to organizations will help you act on your world. You'll learn how to evaluate the influence of organizations around you and how to transform your relationships to reach a stronger coherence.\n\nDo you feel sometime that the world around you is disorganized? Can you make sense of all the information at your reach and have an impact on this situation? Have you ever thought that this conundrum may be due to all the organizations that emerge, strive or wane, and disappear every day? \n\nOrganizations are ubiquitous, from clubs and associations to firms and public agencies. Organizations confer meaning to all of us, and our attachment and membership to organizations have a profound effect on all areas of our lives. But in our increasingly turbulent world, these organizations run the risk of disappearing or losing their legitimacy, steering a sense of pointlessness and absurdity.\n\nThis course develops an integrative approach to understanding organizations and their behaviors, termed ‘orgology’. It explains that organizations can act strategically to protect and renew the sense of membership and attachment of individuals. So doing, organizations that survive and thrive impose their logics of action onto society, thereby influencing what is legitimate or not.  \n\nIn turn, individuals, you, all of us, must reinterpret our multiple associations with organizations and contribute to reinforce or inhibit social evolutions. This new way of understanding organizations’ relationships with society results in reconsidering management and the role of individuals in building their future.\n\nThere is no prerequisite to this course, you are all welcome ! Students and people interested in the fields of management, sociology, strategy, economics leadership etc… will benefit a lot from this course.\n\nFor the session of this course starting on January 11th, Professor Rodolphe Durand will actively be participating and interacting with learners. He will be offering \"office hours\" sessions through google hangouts and answering learner questions from the forums. We hope this direct interaction will add to your learner experience! Please enroll today!\n\n                                            Syllabus\n                        Our World is “Organizational”We present and study how organizations influence our own identities and analyze the means by which we, as individuals, are taking part into this process.When an Organizations-based World Gets DisorganizedLet's explore the public space that is where we meet organizations and where they interact. Organizations follow sets of rules and practices that are of prime concern to them, to us, and to society: the logics of actions. Competition and Competitive AdvantageCompetition among and between organizations leads to regular occurrences of disorganization. We’ll present and discuss the sources of competitive advantage, and the meaning of performance and competition.Understanding Change: Time to ReorganizeHow to define your attachments and memberships in this organizational world? What are the various paths of actions that are opened to you following different situations? What is and how to use management? Final Article Quizzes and Final ExamDescription goes here\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Time to Reorganize! Understand Organizations, Act, and Build a Meaningful World.", 
    "price": 0, 
    "instructors": "Rodolphe Durand", 
    "institution_name": [
        "HEC Paris"
    ], 
    "commitment": "1-3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/orgology", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}