{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    إنّ طبيعة العمل وبيئة الأعمال تتغيّر بشكل كبير في كل يوم. في العقود الماضية، كانت الشركات التي تتمتّع بالميّزة التنافسية الكُبرى هي تلك الشركات التي تُقدّم أفضل المنتجات أو أحدث التقنيات أو الأكبر من حيث رأس المال. ولكن الآن، الأمر الوحيد الذي من شأنه أن يُعزز من ميّزة شركة ما هو مستوى الأشخاص العاملين لديها. حيث يكمن النجاح الدائم في العمل والميّزة الإستراتيجية الحقيقية في تلك الشركات الأقدر على استقطاب وتنمية والحفاظ على المواهب البشرية اللامعة في سوق العمل. إلا أن إدارة القوى العاملة في الشركة والعلاقة المتجددة ما بين الموظف وصاحب العمل، عادةً ما تكون المهمّة الأصعب والأكثر تعقيداً. الهدف من هذا المساق هو فهم المبادئ الأساسية لإدراة الموارد البشرية في شركات العصر الحديث لإطلاق ميّزتها التنافسية. وفهم أكبر لكيفية قيام الشركات بتوظيف ومكافأة وتحفيز واستخدام وإدراة العاملين لديها بفعالية. بالإضافة إلى تقديم إطار مفاهيم بسيط حول الوظائف والأدوار في إدراة الموارد البشرية، سيعمل المساق على تقديم ممارسات وأساليب رئيسية لك تتعلّق بالتخطيط للموارد البشرية وتحليل الوظائف وتصميمها، والتعيين والاختيار والتدريب والتطوير، وإدراة الأداء وأخيراً المكافآت والأجور. نحن نأمل بأن تتعلّم معنا في هذا المساق ما من شأنه أن يُغيّر طريقة التقدّم في حياتك المهنية وما تُخبّأه لك. سواءً أكنت صاحب عمل أو متخصصاً في إدارة الموارد البشرية أو طالباً تُفكر في دخول مجال الموارد البشرية أو حتى موظفاً في أي من مجالات العمل المختلفة، ما سنناقشه في هذا المساق سينعكس على تصوُّرك وسلوكك لأية علاقة توظيف تكون أنت جزءاً منها.\n\n                                    ", 
    "end_date": "2015-10-25T00:00:00Z", 
    "title": "مبادئ إدارة الموارد البشرية", 
    "price": 0, 
    "instructors": "We Zaki and Ahmed Alterani", 
    "institution_name": [
        "Bayt"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edraak.org/course/course-v1%3ABayt.com%2BBA_106%2BBA2015-2/", 
    "duration": "3 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Edraak"
    ], 
    "start_date": "2015-10-04T00:00:00Z"
}