{
    "selfpaced": false, 
    "topic_name": [
        "Management & Leadership"
    ], 
    "description": "\n\n                    \n                    \n                    رغم أنَّ الانطباعات الأولى في غاية الأهمية في العالم المهني إلا أن المحافظة على صورتك المهنية الرصينة هو العنصر الأساسي الذي يُمكِّنك من التطور وتحقيق الإنجازات في وظيفتك. الكثير منَّا يعتقدون بأنَّهم يدركون جيداً آداب العمل، ولكن في الحقيقة هناك المزيد لمعرفته واستكشافه في هذا المجال وليس فقط القدرة على تقديم أنفسنا إلى الآخرين واجراء محادثة. سوف نستثمر المهارات الوظيفية الأساسية لتوضيح ومناقشة مجموعة متنوعة من المبادئ التوجيهية والاستراتيجيات والنصائح المناسبة لمساعدتك في اتقان مجموعة واسعة من الآداب المعمول بها داخل وخارج بيئة العمل الخاصة بك، بما في ذلك السلوك الشخصي والتواصل والنزاهة والالتزام تجاه التميُّز المهني. علاوةً على ذلك، سنستعين في هذا المساق بخبرات مختصين في مجال الموارد البشرية والتوظيف لنتعرف على السمات التي يتمتع بها الموظفون الذين تمكَّنوا من خلال آداب العمل المتقنة من التأثير على أصحاب العمل، وسيزودك ذلك بنقاط القوة والشغف اللازم لتحقيق النجاح. هل أنت على استعداد لاكتشاف أسرار آداب العمل الرائعة التي من شأنها مساعدتك في جلب انتباه الآخرين نحو مهاراتك كرائد وعضو فريق مؤثر؟ سوف يتناول هذا المساق مجموعة متنوعة من المواضيع من خلال المحاضرات والمسابقات والمقابلات لتمكين الطلاب من استيعاب المفاهيم والاستراتيجيات والنصائح الأساسية المقدَّمة من خلال هذا المساق. سيتم استخدام المحاضرات والاختبارات والمواد التدريبية لصقل طلاقة المشاركين في مهارات التطور المهني. احرص على التسجيل في هذا المساق الآن حتى تتمكن من إقناع الآخرين بمهنيتك العالية والسعي لتصبح مرجع موثوق لدى صاحب العمل الذي ترغب في العمل لديه.\n\n                                    ", 
    "end_date": "2015-11-15T00:00:00Z", 
    "title": "مهارات التطور المهني", 
    "price": 0, 
    "instructors": "Amara Zubair and Ahmed Alterani", 
    "institution_name": [
        "Bayt"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edraak.org/course/course-v1%3Abayt.com%2BBA_105%2BBA_105_SelfPaced/", 
    "duration": "3 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Edraak"
    ], 
    "start_date": "2015-10-25T00:00:00Z"
}