{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t     C.S. Lewis is one of the of the most talented and well-known writers of the 20th Century. Many are familiar with his <em>Chronicles of Narnia</em>, but few are familiar with his works that cover religion directly, such as the <em>Screwtape Letter</em>s, <em>Mere Christianity</em> and the subject of this course, <em>The Great Divorce</em>. C.S. Lewis takes a different approach to discussing key religious topics in <em>The Great Divorce.</em> In the book, a group of damned souls in Hell are allowed to take a bus trip into Heaven. While some stay, most do not, and are left to continue spending an eternity in Hell. C.S. Lewis scholar, and doctor of Philosophy, Arthur Hippler takes a chapter by chapter look at this work to help you understand some of the complexities of the work. By reading the book and utilizing the course material provided here, you&#039;ll be able to gain a better understanding of what one should avoid in order to achieve Heaven.  </p>  <p>  \t     The course material includes:  </p>  <ul>  \t<li>21 high-quality video lectures</li>  \t<li>16 Quizzes</li>  \t<li>Written text</li>  </ul>  <p>  \t     It is highly recommended that students purchase a copy of the actual book <em>The Great Divorce </em>to read along with the course. Each section in the the course covers a specific chapter of <em>The Great Divorce </em>and starts with written text explaining the themes in that chapter, followed by a video lecture, and concludes with a short quiz.  </p>", 
    "end_date": null, 
    "title": "A Companion to The Great Divorce", 
    "price": "20.00", 
    "instructors": "Dr. Arthur Hippler", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222990_639e_2.jpg", 
    "course_url": "https://www.udemy.com/a-companion-to-the-great-divorce/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-19T15:51:18Z"
}