{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to <em class=\"redactor-inline-converted\">a Glimpse of Chinese Culture</em>!\n\n  </p>\n\n\n\n<p>How much you know about China and her colorful culture? After <em>A Glimpse of Chinese Culture</em>, You will know more about Chinese culture and you will find China is not mysterious any more.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course includes 12 chapters, covering An Overview of China, Philosophy and Religions, Literature, Arts, Education, Science and Technology, Sports, Traditional Festival, Culinary Culture, Dress and Adornments, Architecture, and Tourism. Less than 8 hours will be needed to complete this course. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It aims to help the students command a general knowledge of Chinese culture and acquaint them with the English expressions of Chinese culture, thereby producing the probability that they can express Chinese culture appropriately in English. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course presents Chinese culture with the illustration of melodious music and vivid pictures so as to make the profound culture learning relaxing and pleasing.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The presentation language is simple with the relatively low speed, and also all of their words spoken will co-occur on the screen. Therefore, any student with an adequate English foundation should have no problem understanding this course, like Chinese college students or middle school students, overseas students, students in Confucius Institutes, native English speakers in middle or even primary school, the personnel engaging in cross-culture business, like tourism, culture, foreign affairs, etc., and of course, anyone with an interest in Chinese culture. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The Global English On-line Course A Glimpse of Chinese Culture is researched and developed by Liao Huaying and her team based on her National ”Eleventh Five-Year” Planned textbook A Glimpse of Chinese Culture. </p>\n\n\n\n\n\n<p>About our instructor:</p>\n\n\n\n\n\n<p>Prof. Liao Huaying, East China University of Technology (ECUT)</p>\n\n\n\n\n\n\n\n<p>Kyle Cox, English Language Institute of China (ELIC)</p>\n\n\n\n\n\n\n\n<p>Prof. Lu Renshun, East China University of Technology (ECUT)</p>\n\n\n\n\n\n\n\n<p>Sherri Nelson, English Language Institute of China(ELIC)<br></p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "A Glimpse of Chinese Culture", 
    "price": "30.00", 
    "instructors": "China Explore China Explore Adam", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850438_d3b8_2.jpg", 
    "course_url": "https://www.udemy.com/a-glimpse-of-chinese-culture/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T07:07:59Z"
}