{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>\nIn this Course\nyou will learn and gain <strong>6 new habits</strong>. <strong>Each habit will make big change in your Memorization Ability</strong>. Many people who have taken this course before were able\nto memorize the whole holy Quran in 2 months. <em>Even some of them were able to\nmemorize the whole Quran in less than two months</em>. </p>\n\n<p>This course helped myself and\nwhen I noticed the amazing results, I have decided to do this course publicly\nto <strong>help million of Muslims</strong> around the world. <strong>Learning\nhow to Memorize the Quran is easy. By successfully applying what you would learn in this course, you would be able to Connect Dots Differently from now. All you need is this course.</strong> </p>\n\n\n\n<p>\nThis course is designed for every age group; either youth or adults. This Quran memorization course is really has an Innovative and easy Way to Memorize the Quran.</p>\n\n\n\n<p><strong>Our Course divide to:</strong></p>\n\n\n\n<ol><li>Build yourself Goal's Map.</li><li>Quantum Reading Technique</li><li>Scan Reading Technique</li><li>Initial Memorization Technique</li><li>Forgetfulness types and their solving.</li><li>Deep Memorization</li></ol>\n\n\n\n<p>This step by step training will let you be able to Finally Memorize the Whole Holy Quran in Short Time.</p>\n\n\n\n<p> <strong>You will...</strong></p>\n\n\n\n<ol><li>Learn Four New Techniques for improving you Memorization Ability.</li><li>Learn the Forgetfulness types and their solving.</li><li>Be able to memorize around 10 pages daily.</li><li>Be able to Memorize the Whole Holy Quran in 2 months.</li><li>you will be my supportive brother/ sister.</li><li>Simple Way to Memorize The Qur'an</li><li>A Quick and Easy Way to Memorize The Quran.</li><li>Memorize Quran Online. A complete Online Quran Memorization Course For you.</li><li>If you get stuck or have questions, you will always have access to me as a resource for   you inside the course.</li></ol>\n\n\n\n<p>Let's dive in to learn: who to memorize the whole Quran. <strong><em>Click on the \"</em>Take This Course<em>\" button and I look forward to</em></strong><strong> see you inside the course.</strong></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "A proven system to memorize the whole Quran in short Time", 
    "price": "30.00", 
    "instructors": "Mr. Basheer Alharthi", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756536_a362_2.jpg", 
    "course_url": "https://www.udemy.com/a-proven-system-to-memorize-the-whole-holy-quran-in-2-months/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T23:50:26Z"
}