{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t  Join your personal writing coach today as you learn the tools and strategies necessary to begin writing successfully at the college level.  </p>  <p>  \t<strong>Learn How to Approach and Excel at Any Academic Writing Assignment</strong>  </p>  <p>  \t  ·Understand academic writing expectations  </p>  <p>  \t  ·Develop clear thesis statements  </p>  <p>  \t  ·Outline and organize effectively  </p>  <p>  \t  ·Structure strategically  </p>  <p>  \t  ·Master the mechanics (grammar, punctuation, etc.)  </p>  <p>  \t  ·Find and use sources powerfully  </p>  <p>  \t  ·Write exceptionally well!  </p>  <p>  \t<strong>Work with Your One-on-One Writing Coach</strong>  </p>  <p>  \t  My goal with this course goes far beyond providing you with a series of useful lectures. My goal is to interact with you as your personal writing coach to help you consistently write successfully at the college level. In other words, with this course you will benefit both from the content and from unlimited access to an expert in college writing, who has taught academic writing to all levels of high school and university throughout the world.  </p>  <p>  \t  ·Participate in an active writing forum community  </p>  <p>  \t  ·Benefit from unlimited reviews of your preliminary writing (i.e. thesis statements, outlines, research topics, etc.)  </p>  <p>  \t  ·Interact through a 60 minute, one-on-one office hour  </p>  <p>  \t  ·Receive a detailed review of one larger writing project (i.e. a term paper, application essay, exam, etc.)  </p>  <p>  \t<strong>Content and Overview</strong>  </p>  <p>  \t  By working through the 45 lectures of this course alongside my personal commitment to your development as a writer, you will gain the skills and confidence you need to write well in any field and at any college level. Whether you&#039;re in your first year or fourth, an international student, returning to college after years away, or preparing to enter your university experience soon, discover the strategies, tools, and secrets necessary to become an exceptional academic writer.  </p>  <p>  \t  Beginning with a series of lectures on the writing process, this course will walk you through the fundamentals of brainstorming, outlining, developing, and presenting your ideas persuasively. You will learn how to develop strong thesis statements, construct supporting paragraphs, and engage your audience through effective introductions and conclusions. You will understand how to approach the most common academic writing assignments and learn how to write resumes, cover letters, and graduate school admissions essays. Most importantly, you will have access to unlimited personal and professional feedback to your questions, concerns, anxieties, and writing.  </p>  <p>  \t  Completing this course will provide you with the essential tools and coaching to ensure you ace your next college essay.  </p>", 
    "end_date": null, 
    "title": "Academic Writing Essentials: A College Writing Crash Course", 
    "price": "45.00", 
    "instructors": "Mike Taylor", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286194_0146_4.jpg", 
    "course_url": "https://www.udemy.com/academic-writing-101/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-23T05:29:25Z"
}