{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong class=\"redactor-inline-converted\">Course Synopsis</strong>  </p>\n\n<p>  \tPhilosophy is a subject that deals with the most profound questions of existence, the very nature of the world around us, and the reasons for our being here. This course will provide you with an introduction to this exciting area of study and will attempt to get you to think like a philosopher as we discuss such essential matters as morality, knowledge and truth, and existence. But, be warned, philosophy can create more questions than it actually answers!  </p>\n\n<p>  \tPhilosophy is one of the oldest disciplines, a subject developed in ancient Greece and which has evolved over time, concerning a diverse range of topics from religion to science, politics to morality. A study of Philosophy is not just the study of an academic subject, it is the study of thought itself, giving you the skills to think critically about everything around you. What is the difference between “wrong” and “right”? Does the material world around us exist? What is “existence” anyway? The skills acquired in learning to tackle such questions can be transferred to almost any other discipline, meaning that Philosophy can act as an excellent stepping stone into other areas.  </p>\n\n<p>  \tThe ORA Introduction to Philosophy is designed to offer an overview of what studying Philosophy at university is like, looking at the major areas that you would cover in a university course. This will benefit students who are keen to have a taster of the subject to help make a balanced and informed decision about whether or not they want to study Philosophy, and also students seeking to bolster their application by gaining a pool of knowledge to use in interviews and personal statements.  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">What's Included?</strong>  </p>\n\n<p>  \tThis courses consists of 4 X tutorials - audio lectures with accompanying presentation material - each taking approximately 40 minutes to complete. Regular quizzes and exams enable students to check their progress and that they are understanding the topics covered. This courses is available to start instantly online through Udemy – once you’ve chosen the course you want to take, you can get started straight away.  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">How Does it Work?</strong>  </p>\n\n<p>  \tThe course is broken down into tutorials. Each tutorial is broken down into its major topics, <strong>chapters</strong>, which are short videos of around 5-10 minutes in length. This ensures that course content is broken down into bitesized educational units that are easy to digest, and also means that content is easily navigable at the pace of the student.  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">Why Take this Course?</strong>  </p>\n\n<p>  \tThis course is ideal preparation for students thinking of studying philosophy, classics, history, or related subjects at university.  </p>", 
    "end_date": null, 
    "title": "An Introduction to Philosophy", 
    "price": "20.00", 
    "instructors": "ORA Prep", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308398_06e4_3.jpg", 
    "course_url": "https://www.udemy.com/an-introduction-to-philosophy/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T14:46:46Z"
}