{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t  Este curso pretende modificar las comunes presentaciones de PowerPoint  a un sentido mas dinámico, de una manera didáctica.  </p>  <p>  \tEl curso esta realizado en Powerpoint 2010 pero también puede realizarse en 2007 y en 2013.  </p><p>Es una manera bastante entretenida de aprender Powerpoint y a su vez usarlo para crear recursos didácticos.</p>  <p>  \t  ¿Que terminología espero del curso?  </p>  <p>  \t  Los términos usados en este curso son de lo mas sencillo posible, no uso palabras técnicas, no es necesario tener conocimientos previos, todo es explicado en el momento del vídeo.  </p>  <p>  \t  ¿Que materiales están incluidos?  </p>  <p>  \t  Los materiales a utilizar vídeos, música e imágenes están incluidos en los Recursos descargables.  </p>  <p>  \t  ¿Necesito completa todo el curso para aprender algo?  </p>  <p>No. Cada uno de los juegos del curso es independiente, osea que puede realizar cualquiera de los juegos sin necesidad de terminar el curso completo, pero si gusta terminarlo completamente esta intencionado para finalizarlo en el menor tiempo posible.</p>  <p>  \t  ¿Como esta estructurado?  </p>  <p>  \t  El curso esta estructurado en secciones de Recurso Didáctico. Cada sección indica que juego estas aprendiendo a realizar.</p>  <p>  \t  ¿Por qué realizar este curso?  </p>  <p>  \t  Por la necesidad de dar un toque fresco a todo lo que hagas, actualizarse o morir, aveces es difícil estar actualizándose en el campo de la tecnología que es muy cambiante, por eso, se usa Powerpoint debido a la sencillez y a su no tan cambiante interfaz.  </p>  <p>  \t  Actualizas contenido con tecnología fácil de usar.  </p><p>¿Quien debería realizar este curso?</p><p>Cualquier persona en general, pero, en mayor grado, docentes y alumnos, ya que les hará tener una clase dinámica o una buena nota.</p><p>Espero sea de su agrado.</p>", 
    "end_date": null, 
    "title": "Aprende a hacer Originales presentaciones en Powerpoint", 
    "price": "20.00", 
    "instructors": "Gustavo Mendoza", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338742_8f2a_7.jpg", 
    "course_url": "https://www.udemy.com/crea-juegos-en-powerpoint-versiones-2007-2010-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T19:48:11Z"
}