{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong style=\"\">What is this course all about?</strong>  </p>  <p>  \t<strong style=\"\"></strong><span>The goal of this course is to provide an overview of academic writing, with two specific focuses: (1) learning about the Writing Process and (2) developing an academic essay. There are</span><span> 10 video episodes, in addition to 6 quizzes and a 70+-page textbook that accompanies the video episodes and provides further information, including examples that students can read outside of the videos.</span>  </p>  <p>  \t<span><strong style=\"\">Who is this course for?</strong></span>  </p>  <p>  \t<span>Those who would like a refresher in academic writing, those who want to gain more confidence in their academic writing skills, and those </span><span>who want to learn a little more about writing academic essays. Additionally, this course is a good fit for EFL students who are looking to refresh their academic writing abilities before taking other courses in English.</span>  </p>  <p>  \t<span><strong style=\"\">What can students expect to gain from the course?</strong></span>  </p>  <p>  \tAfter completing the course, students can expect to have written at least one complete academic essay. Additionally, students will have gained confidence in their writing abilities, as well as their understanding of the Writing Process, and how they can apply these skills to other areas of their academic, personal, and professional lives.  </p>  <p>  \t<strong style=\"\">Why take this course?</strong>  </p>  <p>  \tIt&#039;s an easy-to-follow presentation of academic writing. No frills, nothing fancy. Instead, it keeps the focus on the two main goals of studying the Writing Process and learning about writing an academic essay.  </p>", 
    "end_date": null, 
    "title": "Basic Principles of Academic Writing", 
    "price": "20.00", 
    "instructors": "Bonnie Fox", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258984_605a.jpg", 
    "course_url": "https://www.udemy.com/basic-principles-of-academic-writing-introductory-course/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T13:13:38Z"
}