{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<ul style=\"\">  \t<p>  \t\t      The world has always been a colourful place. But do we see the colours of our modern world in exactly the same way that the people of ancient Egypt saw the colours of their land? This course will help you to consider how the ancients viewed their world by introducing you to a remarkable, vibrant time and place: a place where the sea was not blue, but green.  \t</p>  \t<p>  \t\t<strong style=\"\">See the Ancient World Through Different Eyes</strong>  \t</p>  \t<p>  \t\t      ·Learn how the ancient Egyptians regarded the colours blue, green and “grue”  \t</p>  \t<p>  \t\t      ·Examine the technology of ancient glass making  \t</p>  \t<p>  \t\t      ·Explore aspects of ancient art and sculpture  \t</p>  \t<p>  \t\t      · &quot;Meet” some ancient Egyptian letter-writers  \t</p>  \t<p>  \t\t<strong style=\"\">Contents and Overview</strong>  \t</p>  \t<p>  \t\t      This course takes the form of a symposium which presents a series of lectures given by world-renowned Egyptologists.  \t</p>  \t<p>  \t\t<strong style=\"\">Dr Steven Snape </strong>- University of Liverpool  \t</p>  \t<p>  \t\t<strong style=\"\">Professor Paul Nicholson </strong>- Cardiff University  \t</p>  \t<p>  \t\t<strong style=\"\">Dr Campbell Price </strong>- Curator of Egypt and Sudan at the Manchester Museum  \t</p>  \t<p>  \t\t<strong style=\"\">Dr Glenn Godenho </strong>- Lecturer in Egyptology at the Universities of Liverpool and Manchester  \t</p>  \t<p>  \t\tEach lecturer reflects on an aspect of the colour &quot;blue&quot; which has inspired them in their work. The different experts take very different approaches to their subject, yet together their work forms an expert guide to aspects of the art, archaeology, language and technology of the dynastic age. It forms a scholarly yet accessible introduction to the different, and very colourful, world of the pharaohs.  \t</p>  \t<p>  \t\t      The course consists of five lectures plus additional information. It will take between four and five hours to complete. By the end of the course you will have acquired a valuable understanding and appreciation of Egypt’s dynastic age.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "BLUE: a symposium exploring aspects of life in ancient Egypt", 
    "price": 0, 
    "instructors": "Joyce Tyldesley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351946_5b28_6.jpg", 
    "course_url": "https://www.udemy.com/bluesymposium/", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T14:29:18Z"
}