{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Learn Constitutional Law in 90 Minutes!</strong>  </p>  <p style=\"\">  \t           Whether you are a new student starting the Constitutional Law  this year or someone who is just about to sit for your Constitutional Law  examinations, &quot;The Law Simplified&quot; course on Constitutional Law will give you a  fast-track summery of the subject.  </p>  <p style=\"\">  \t           Many students who study the Law, find it difficult to  connect all of the pieces together. Thus, this course will give you a  &quot;bird&#039;s eye&quot; overview of the entire subject.  </p>  <p style=\"\">  \t           What&#039;s more, you will have access to 75+ pages of case  summaries, specifically designed to help you understand all the legal  principles.  </p>  <p style=\"\">  \tThis course has been adapted to suit the needs of LLB students worldwide!  </p>  <p style=\"\">  \t           Remember, this is not a substitute for thorough learning,  but it will be a great resource for students who want to recap the  entire Constitutional Law syllabus and for those who want a better, clearer  and more concise understanding of the principles.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Features:</strong></em>  </p>  <p style=\"\">  \t           - Digestible chunks of knowledge: everything you need to know on each topic, simplified  </p>  <p style=\"\">  \t           - Downloadable &quot;spider graphs&quot; that will give you the bigger picture of the subject  </p>  <p style=\"\">  \t           - 75+ pages of case-law, developed in a simplified and direct manner.  </p>", 
    "end_date": null, 
    "title": "Constitutional Law in 90 Minutes: A Fast Track Summary", 
    "price": "20.00", 
    "instructors": "Shaveen Bandaranayake", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308220_131b_6.jpg", 
    "course_url": "https://www.udemy.com/learn-constitutional-law/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T09:14:52Z"
}