{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t                  Ser \"guía de turismo\" es cada vez una profesión más demandada debido al crecimiento del sector turístico en todo el mundo. Quizá hayas pensado convertirte en guía turístico pero  no te has atrevido  o piensas que es complicado.  </p>  <p>  \t<strong>Aprende a crear tu ruta en solo tras solo 1 hora de curso.</strong>  </p>  <p>  \t                  Avanza en los vídeos y aprende de forma divertida y dinámica.  </p>  <p>  \t                  Reconoce los trucos que les funcionan a los grandes profesionales.  </p>  <p>  \t                  Construye tu propia ruta.  </p>  <p>  \t                  Encuentra la legislación que rige la actividad  y en qué lugares te está permitido trabajar.  </p>  <p>  \t                  Entérate de qué empresas están ofreciendo empleo actualmente.  </p><p>Gana confianza y tranquilidad exponiéndote y manejando al grupo.</p><p>Mejora tu proceso de preparación y gana eficacia con la metodología propuesta a la hora de preparar las explicaciones.</p>  <p>  \t<strong>¡Sal y experimenta lo aprendido!</strong>  </p>  <p>  \t                  El sector turístico está en su mejor momento. Hay más personas viajando en el mundo que nunca en la historia.  Además quieren hacerlo de una manera diferente, conociendo la ciudad como una persona local.  </p>  <p>  \t                  Es el momento de aprovechar el auge del sector y ganar un dinero extra haciendo eso que te gusta hacer.  </p>  <p>  \t                   Este curso tiene concentradas  una serie de  técnicas contrastadas que una vez aplicadas te harán progresas con éxito.  </p>  <p>  \t                   Contaras con una serie de materiales complementarios para ampliar temas más específicos así como para practicar los conocimientos adquiridos.  </p>  <p>  \t         Al finalizar este curso estaras preparado para ser   un excelente guía turístico. </p>", 
    "end_date": null, 
    "title": "Crea tus propias rutas y gana dinero enseñando tu ciudad", 
    "price": "20.00", 
    "instructors": "Camino Ramos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310998_9681_6.jpg", 
    "course_url": "https://www.udemy.com/como-hacer-rutas-guiadas-y-ganar-dinero-ensenando-tu-ciudad/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T18:35:16Z"
}