{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">These fourteen lectures highlight key aspects of entering writing competitions, and include a variety of insider tips followed by a dozen competition-related exercises.</p><p style=\"\">The course is taught via video slides with clear audio narration from a native English speaker who is not only a writer but also a freelance editor, blogger, and creative writing tutor for a variety of clients. Terminology is simple, ideal for those for whom English is a second language.</p><p style=\"\">Depending upon the student&#039;s timeframe, the course, without pausing the video, lasts just over half an hour. If completing one exercise per day, however, the course could last a couple of weeks.</p><p style=\"\">No specific materials are required other than pen / pencil and paper or blank document. All slides and mentioned handouts are provided as downloadable documents.</p><p style=\"\">If you have no prior creative writing knowledge, this course will provide a strong foundation on which to build a body of work. If you already have some knowledge, it will refresh those skills and improve your confidence going forward.</p><p style=\"\">Accompanying &#039;writing tips&#039; and &#039;editing your fiction&#039; courses provide tips and exercises concentrating on sparking creativity and improving writing skills, aimed at writers of any age and experience.</p>", 
    "end_date": null, 
    "title": "Creative Writing – Entering Writing Competitions", 
    "price": "20.00", 
    "instructors": "Morgen Bailey", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581046_e179_3.jpg", 
    "course_url": "https://www.udemy.com/creative-writing-entering-writing-competitions/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T12:14:45Z"
}