{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong style=\"\">For long-term success in school, business and life, learning HOW to think is <em style=\"\">far more important</em> than learning WHAT to think. </strong>  </p>  <p>  \t        Yet rather than serve as the core of any education worthy of a rational human being, we have relegated the teaching of logic, argument analysis and critical reasoning to specialty courses in universities that reach too few students, too late in their education.  </p>  <p>  \t<strong style=\"\">In this course I share my growing understanding of these topics, with a focus on what is practically important and useful for developing as independent critical thinkers.</strong>  </p>  <p>  \t Currently the course contains over <strong style=\"\">135 videos totaling over 14 hours of viewing time</strong>!  </p>  <p>  \t Each <strong style=\"\">LECTURE</strong> has a <strong style=\"\">COMPLETE TRANSCRIPT</strong> in the lecture description tab!  </p>  <p>  \t Each <strong style=\"\">SECTION</strong> has a <strong style=\"\">downloadable PDF ebook</strong> that contains full transcripts for the lectures in that section, in a format that is convenient for printing or viewing offline,<strong style=\"\"> for a total of 600 pages!</strong>  </p>  <p>  \t       Among the topics you will learn:  </p>  <ul style=\"\">  \t<li>why critical thinking is important</li>  \t<li>the difference between logic and argumentation</li>  \t<li>what makes an argument good or bad</li>  \t<li>the importance of background knowledge for critical thinking</li>  \t<li>techniques of argument analysis and reconstruction</li>  \t<li>what our growing understanding of the human mind tells us about how we actually form beliefs and make decisions</li>  \t<li>how to write a good argumentative essay</li>  \t<li>how to cite sources and avoid plagiarism in your writing</li>  </ul>  <p>  \t       and much more! This content is drawn from a variety of teaching resources I&#039;ve developed over the past few years, including a video podcast.  </p>  <p>  \t      It&#039;s important for you to know that I am continuing to add videos and course modules on a regular basis. <strong style=\"\">This course will continue to grow and grow</strong> -- I have a LOT OF GROUND that I want to cover! <strong style=\"\">This is ONLY THE BEGINNING! </strong>  </p>", 
    "end_date": null, 
    "title": "Critical Thinker Academy: Learn to Think Like a Philosopher", 
    "price": "35.00", 
    "instructors": "Kevin deLaplante", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43540_4011_5.jpg", 
    "course_url": "https://www.udemy.com/critical-thinker-academy/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-25T22:38:57Z"
}