{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>¡El contenido de este Curso ha sido actualizado el 22 de noviembre del 2015!</strong></p><p><strong>Se ha agregado una sección de Notas Internacionales en torno a Tecnología Educativa y/o Temas de Interés relacionados!</strong></p><p><strong>______________________________________________________________________</strong></p><p>Los Modelos Educativos Mundiales han adoptado el esquema de competencias total o parcialmente. La evolución en los paradigmas educativos; el desarrollo de las ciencias cognoscitivas; el impulso a técnicas de desarrollo del pensamiento, pero sobre todo, la necesidad de hacer más competitivo al estudiante actual, han propiciado una necesidad imperiosa de actualización profesional de todos los actores.</p><p>El esquema de Competencias ostenta una poderosa estructura educativa en torno a tres componentes fundamentales: <strong>Saber, Saber hacer y Saber ser.</strong></p><p>Para ello, se han sumado integralmente múltiples enfoques y ciencias auxiliares, como son: <strong>El Razonamiento Integral; la Heurística; la Psicología Cognitiva; la Holística</strong>, entre otros muchos, lo cual hace inexorable una actualización para los profesionales, o el re-direccionamiento para los estudiantes de dicha especialidad.</p><p>Es por ello que este curso apunta en las siguientes direcciones:</p><ul><li>Una <strong>Actualización de los conocimientos </strong>significativos actuales. Recordemos que el Conocimiento es Universal.</li><li>Una adopción más competitiva de las <strong>Nuevas Tecnologías de la Información y Comunicación.</strong></li><li>Una preparación profesional y profunda para aquellos que pretenden una <strong>Certificación Oficial</strong> en su país.</li></ul>Finalmente, el curso se distingue por una estrategia integral, basada en:<ul><li>Ser <strong>Tutorado</strong>, lo cual significa que interactuarás con un Equipo de Soporte Académico y Técnico durante todo el proceso.</li><li>Combina muy diversas técnicas de enseñanza-aprendizaje, así como <strong>30 ejercicios prácticos, evaluados y comentados por nuestro Equipo DHP</strong>, ofreciéndote una valoración y comentarios para cada uno de ellos, a través de un <strong>Informe Acumulado de Evaluaciones.</strong></li></ul>", 
    "end_date": null, 
    "title": "Diseño Profesional de Cursos Online AIC", 
    "price": "20.00", 
    "instructors": "Arturo Juárez Muñoz", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453574_b275_5.jpg", 
    "course_url": "https://www.udemy.com/diseno-profesional-de-cursos-online-aic/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T01:26:38Z"
}