{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t    As a continuation of Divine Principle, this course will go into details the providence of restoration which refers to God&#039;s work to restore human beings to our original, unfallen state so that we may fulfill the purpose of creation.  </p>  <p style=\"\">  \t As discussed earlier, human beings fell from the top of the growth stage and have been held under Satan&#039;s dominion ever since. To restore human beings, God works to cut off Satan&#039;s influence. Yet, as was explained in Christology, we must have the original sin removed before we can sever Satan&#039;s bonds and be restored to the state before the Fall. This is possible only when we are born anew through the Messiah, the True Parent.  </p>  <p style=\"\">  \t To explain further: we first need to go through a course to separate Satan from ourselves. We do this in order to restore ourselves in form to the spiritual level which Adam and Eve had reached before the Fall-the top of the growth stage.  </p>  <p style=\"\">  \t On this foundation, we are to receive the Messiah and be reborn, and thereby be fully restored to the original state of human beings before the Fall. Finally, by following the Messiah, we should continue our growth to maturity where we can fulfill the purpose of creation.  </p>  <p style=\"\">  \t Since the providence of restoration is God&#039;s work of re-creation, which has as its goal the fulfillment of the purpose of creation, God works this providence in accordance with His Principle. In the course of the providence of restoration, this principle is called the Principle of Restoration.  </p>  <p style=\"\">  \t Let us study how the providence of restoration is to be accomplished with the remainder of this course.  </p>", 
    "end_date": null, 
    "title": "Divine Principle Part 2", 
    "price": 0, 
    "instructors": "David Chen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/152248_2bc2_5.jpg", 
    "course_url": "https://www.udemy.com/divine-principle-part-2/", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-24T19:35:56Z"
}