{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>As a student taking this course, you will attain writing skills that are essential to writing excellent argumentative essays at  the junior college and high-school levels. This course has been designed for students who need to sit General Paper for the GCE A Levels in Singapore as well as those with an interest in writing more persuasive and effective argumentative essays.</p><p>In this course, you will be thoroughly guided to achieve the following goals: Th </p><p><strong></strong></p><ul><li>You will learn 3 critical steps to structuring a compelling introduction in an argumentative essay. The different options for providing a effective Foregrounding, Positioning and Thesis Statement will be explained and demonstrated for your learning. </li><li>The use of a structured approach to paragraph development using the Point, Elaboration, Exemplification and Link approach will be explained and demonstrated in detail. </li><li>A diverse range of options such as the use of Situation, Mindset, Action, Relationship and Trend factors in Elaboration and the use of Livelihood, Organization, Values and Experience factors in the Link portion of paragraph writing will be raised in individual and detailed videos. </li><li>The Positioning and Envisioning strategies critical to a thought-provoking Conclusion will be shared and explained in detail. </li></ul>", 
    "end_date": null, 
    "title": "Excellent Argumentative Essay Writing", 
    "price": "20.00", 
    "instructors": "Augustine Chan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753080_effc_3.jpg", 
    "course_url": "https://www.udemy.com/acgps-course1/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T03:35:00Z"
}