{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>The material for this course was created by Misty Keith. She has nearly 20 years of writing experience in several fields: article writing, newsletter writing, blog writing, and many more. She is the founder of Butterfly Ink Media, which is an organization that helps others in several niche categories(Copywriting, Ebooks, Proofreading, Web Content, &amp; much more). Misty is also a Top Rated freelancer and manager of the Custom Writing Services Agency on Upwork, which dedicates their efforts to giving writing consultation and professional writing services to others.  Misty is very passionate about her writing ventures and it is evident in every word of every sentence in this course.</p><p>Upon completion of this course, students will have learned the basic skills and gained the necessary tools to begin mastering the craft of creating compelling non-fiction works. If the goal is to gain long-term benefits, the curriculum guarantees non-fiction writers will find new avenues to pursue, just by discovering the more evasive secrets for developing non-fiction articles, short-stories, journalistic pieces, opinionated blurbs and even more. The entire aim of this course curriculum is to advise and guide students to discover their own authentic voice as beginning non-fiction writers. Students should keep in mind; this is just the start to building a great career as a professional non-fiction writer.</p><p><strong>Preparations </strong></p> <ul><li>A Basic Understanding Of The English Language</li> <li>Active Participation</li> <li>A Passion For Learning The Craft Of Creative Non-Fiction</li></ul><strong>Objectives</strong><ul> <li>Discover how to create engaging non-fiction pieces</li> <li>Discover your own authentic writing voice</li> <li>Learn what wordage works and what doesn't</li> <li>Create meatier work without bogus material</li> <li>Learn better grammar and editing tactics</li> <li>Write non-fiction as colorful as fiction pieces</li> <li>Improve upon your non-fiction blog</li> <li>Take your non-fiction to the web</li></ul><p>This course is geared toward any individual who wants to enhance their writing ability within the non-fiction genre. For those who are already active writers—this course provides new and inspiring ways to curate non-fiction works. The target audience can be for those who are currently web writers, editors, bloggers, and even perfect for those who design and create popular EBooks. As long as you have a desire to expand on your current skills, you can and will excel in this course. </p>", 
    "end_date": null, 
    "title": "Getting Started: Learning to Write Creative Non Fiction", 
    "price": "20.00", 
    "instructors": "LectureWare ™", 
    "commitment": "27 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584196_0683_2.jpg", 
    "course_url": "https://www.udemy.com/writing-creative-non-fiction/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-16T01:37:26Z"
}