{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">Learn better Greek and discover the true value of life in your own “Ithaka&quot;.</strong></em><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Poetry </strong>is a primitive state of the human mind, aiming to translate feelings into words.</p><p style=\"\"> <strong style=\"\">Greek </strong>is a very rich language and via <em style=\"\"><strong style=\"\">“Ithaca&quot;</strong></em> you will be benefited spiritually and also practice at the same time. The course is methodically structured in order to facilitate an easy and joyful learning using Greek native speaking by a Greek language teacher and the respective English subtitles.</p><p style=\"\">It&#039;s a challenge that once taken, it will evolve you spiritually as well as linguistically.</p><p style=\"\">This course is a life lesson. A personal creation with timeless source of inspiration and full value verses of the poem &quot;Ithaca&quot;. A lesson inspired from an unconventional personality, a strong thought of how we can freely enjoy our lives. Cavafy through the verses of this poem gives meaningful and effective tips on how to succeed in finding the meaning of life. It shows us the way .... for &quot;Ithaca&quot; , but Ithaca should we define it according to our own wants and with our own needs. But what we can do with the obstacles that we often find on our way, our barriers that deny freedom in our soul and life? How can we overcome and get stronger? If accountant already that most obstacles we create ourselves, our own thinking, we will understand that it is our own responsibility for conservation or for their separation. What should we do if we choose to go without them? Cavafy, gives the solution on how to overcome these obstacles and difficulties created by our thoughts .. It is a lesson we addressed at all but actually intended for those few, the elect, for those who can and want to realize ... for the strong ... Enjoy the journey of life! Disengaged from the bonds you hold with your guide the &#039;Ithaca&#039; ... to make your own Ithaca ...</p>", 
    "end_date": null, 
    "title": "Greek poetry: \"Ithaca\" by Constantine Cavafy", 
    "price": "20.00", 
    "instructors": "Irene Karageorgos", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495794_4ebb_2.jpg", 
    "course_url": "https://www.udemy.com/greek-poetry/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T08:59:05Z"
}