{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t      This course will look at the Spanish Conquistador, Hernando Cortes, focusing upon his expedition to Mexico.  The course will begin with lectures introducing the Mexica civilization, followed by an introduction to the Spanish enterprise in the New World.  Connections will be made so that students will understand how the Conquistadors knew of Mexico and of their great wealth, and how Hernando Cortes came to be chosen as the leader of the expedition to find and conquer this people.   This course will survey in some depth the collision of the Spanish Conquistadors with the Mexica civilization under Montezuma II.  Primary sources are often quoted or paraphrased to bring the students into the spirit of the times.  The persons of Hernando Cortes and Montezuma II are often viewed and compared in this struggle.  The person of Malinche is also occasionally discussed, as she provided a great advantage to the Spanish. The many twists and turns in this drama are truly fascinating, and illustrative of many aspects of human nature.  Other topics are explored as they add light to the story, such as the weaponry of the Spanish then, famous art representations, and the travel, water and food distribution of the Mexica within the city of Tenochtitlan. The coverage will also include the many military battles fought by Hernando Cortes, not only against the Mexica, but against other people groups in the area. There are several lectures at the end that will treat the legacy and conclusions of the conflict between the Spanish Conquistadors and the Mexica people.   The course comprises 34 video lectures, using voice narration with over 500 Powerpoint slides.  Frequently there are supplementary videos, web links, or additional Powerpoint slides to enhance the coverage.  The time to complete the video lectures is about 4 ¼ hours.   The course is intended for those High School age and up (though serious Junior High School students will benefit also), and requires just the ability to view and hear video lectures.  </p>", 
    "end_date": null, 
    "title": "Hernando Cortes and the Aztec Civilization", 
    "price": 0, 
    "instructors": "Gerald Franz", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265344_3ea7_2.jpg", 
    "course_url": "https://www.udemy.com/hernando-cortes/", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-20T23:59:21Z"
}