{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">This course will teach you how to brand yourself like a million bucks for the rest of your career by making you a best selling author in 100% legitimate industry standard ways, even if you may not be a good writer.</p><p style=\"\">It used to be nearly impossible to become a New York Times best selling author because you needed to have a publisher, and be very well connected. But since Amazon democratized book publishing, it is more attainable to become a best selling author on Amazon, and in this course I teach you exactly how to do that.</p><p style=\"\">In this course I show you how to write a good book even if you are not a good writer, how to position your book to more easily attain a best seller status, and then I show you exactly what I did to become a 3-time best selling author on Amazon so that you can do the same thing too. </p><p style=\"\">Go ahead, sign up for the course, and let&#039;s make you a best selling author. Just imagine how potential employers, business partners, clients or investors will respond when they read your bio when it opens with the words &quot;best selling author.&quot; People will be impressed, and will be more likely to do business with you or hire you. So having a best seller status will pay for itself many-fold throughout your career.</p>", 
    "end_date": null, 
    "title": "How to become a bestselling author on Amazon or Kindle ", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496456_b94f_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-an-amazon-best-seller/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T03:35:27Z"
}