{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This one-of-a-kind course by Nick Kristof and Sheryl WuDunn is designed for anyone who wants  to leave a mark on the world, make a difference and learn a few secrets about how to live a happier, healthier and more meaningful life.  Along the way, you will learn about issues that afflict the world: Why some of us do not reach our potential, why some end up in poverty, how others are left out or brutalized because of their gender. You’ll learn about some of the people who have discovered ways to have strong impact around the world--and about how you can do so yourself.</p>\n\n<p>You’ll also be inspired by social entrepreneurs who are making progress to help those struggling in life, whether because of poverty, disease, lack of education, or simply bad luck.</p>\n\n<p>Beyond understanding the issues, though, you’ll discover how to make a difference in your own world and how you can reach out to lend a hand in your own community or halfway around the world. Helping people is harder than it looks, but with the tools gained from this course, you’ll be able to join the movement toward change. There is an emerging science of how to make a difference, and that’s the focus of this course.</p>\n\n<p><strong>Understand the Challenges Facing People at Home and Abroad  </strong></p>\n\n<ul><li>Uncover the forces holding people back, including early childhood factors. </li><li>Recognize the role women play in lifting their communities out of poverty </li><li>Learn which investments of time and money help change the world--and which don’t.</li></ul>\n\n<p><strong>Make a Positive Impact and Help Improve the Lives of Others</strong></p>\n\n<p>This course is ideal for those who wish to become informed global citizens, and who yearn to find greater fulfilment but aren’t quite sure how to accomplish that or where to begin.</p>\n\n<p>Through lectures filled with incredible stories, you’ll gain valuable insights that Kristof and WuDunn collected in their reporting at home and abroad, as they saw people devise creative solutions to solve social problems around the world. </p>\n\n<p>There are many issues, from sex trafficking to a lack of quality education, that impact people all over the world. There are no silver bullets, but Kristof and WuDunn talk about “silver buckshot” that collectively make a powerful difference.</p>\n\n<p>This course will teach you about these problems, while also sharing actionable solutions and the names of organizations on the front line of social progress--organizations you can support as a donor, volunteer, or advocate.</p>\n\n<p><strong>Contents and Overview</strong></p>\n\n<p>You’ll begin this course with a self-reflection exercise that will guide you to the issues that you care about most.</p>\n\n<p>To ensure you can make the biggest impact with your altruism, you’ll learn that not all charitable organizations are created equal, and you’ll also gain insight into how you can try to distinguish an effective charity from one that may only seem to be effective.</p>\n\n<p>You’ll then learn how early childhood experiences and education impact an individual’s ability to overcome poverty or be successful. You’ll gain insights into the rich-poor achievement gap, the effects of teen pregnancy, and the evidence that nurturing character traits may help create success for those who face the greatest struggles.  </p>\n\n<p>After being introduced to programs that seek to educate and support youth in poor communities, you’ll discover the importance of education, particularly for girls around the world, and what you can do to help.</p>\n\n<p>Sex trafficking--at its extreme, a modern form of slavery--is more common than most people realize both at home and abroad. In addition to learning how this issue affects women around the world, you’ll gain an understanding of what steps work best to curb such exploitation and what communities can do to uproot it.</p>\n\n\n\n<p>Other issues that you’ll cover include maternal mortality and reproductive health around the world. As with all of the other sections in this course, you’ll learn about the many things that you can do to help join the movement to advocate against these injustices. </p>\n\n<p>Finally, you’ll learn about the growing science about the difference that hope can make, what you can do to spread hope, and the physiology of altruism and why helping others can make you feel good.  </p>\n\n<p>By the end of this course, you’ll have a deeper knowledge of issues that affect people globally, and you’ll know what needs to be done to uplift others next door or in distant countries. There are no magic wands to be waved, but we do have growing evidence of what works to empower people and make a difference.</p>\n\n<p>Rather than feeling helpless about these problems, you’ll learn how you can get involved, and what you can do to make a difference to expand opportunity and equality.</p><p><strong>Students who enroll now will be able to participate in an upcoming live, private Q&amp;A with Nicholas and Sheryl!</strong><br></p>", 
    "end_date": null, 
    "title": "How to Make a Difference by Nicholas Kristof & Sheryl WuDunn", 
    "price": "40.00", 
    "instructors": "Nicholas Kristof, Sheryl WuDunn", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785702_6ba0.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-difference-by-nicholas-kristof-sheryl-wudunn/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T04:17:37Z"
}