{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong>A fallacy is a poorly reasoned argument </strong>and those are all around us and even unintentionally come out of our own mouths sometimes!  </p>  <p>  \t<strong>Avoiding fallacies is a crucial skill, especially in the age of information we live in! The internet is full of debates. Full of arguments. And full of fallacies and tricks!</strong>  </p>  <p>  \t                                         After this short course you will no longer have to look up what people are talking about - after this course you will be explaining and pointing out what has been wrongly argued and why.  </p>  <p>  \t<strong>In just 3 days</strong>, you will have a strong setting in the art of <strong>spotting and avoiding poor arguments</strong>. This will in turn make <strong>your arguments stronger!</strong>  </p>  <ul>  \t<li>On Day 1 we will have a look at the most common and easy to understand fallacies.</li>  \t<li>On Day 2 we will approach some of the more complex fallacies.</li>  \t<li>On Day 3 we will be talk about some more implications of your new-found knowledge and where you can take things from here.</li>  </ul>  <p>  \t           You can naturally also pace the course however it fits your schedule: You get lifetime access to everything in this course! Of course, you will be provided <strong>both real life and abstract examples</strong> of the fallacies at hand, while <strong>f</strong><strong>un quizzes </strong>will test and review the stuff you have learned so far!  </p>  <p>  \t<strong>Complete transcripts and downloadable slides of all course lectures </strong>available in the supplemental materials of each video.  </p>  <p>  \t             I am always available to answer questions and contribute to discussions about the course material and beyond!  </p>  <p>  \t                 And as a special bonus, further readings and media recommendations (books, movies, etc.) will be made for aspiring philosophers. Come join our group of students today!  </p>", 
    "end_date": null, 
    "title": "Introduction to Fallacies: How to spot poor reasoning", 
    "price": "20.00", 
    "instructors": "Timon Salar Gutleb", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289938_d6b1_9.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-fallacies-how-to-spot-poor-reasoning/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-29T03:38:19Z"
}