{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t          Este curso desarrolla una estructura conceptual para entender los diferentes escenarios de aprendizaje y decidir sobre los procedimientos para abordarlos desde el punto de vista de la enseñanza universitaria. Se emplea una terminología que puede resultar &quot;novedosa&quot;; lo fundamental es comprenderla y poder aplicarla. Se desarrollan varias matrices de análisis (orden/desorden; autoridad moral/confianza entre otras).  </p>  <p style=\"\">  \t        El curso está dividido en secciones y clases. Las clases corresponden a videos tutoriales a través de los que se va analizando la temática del curso. El tiempo de duración es relativo, dad la complejidad temáticas. Lo importante es visualizar cada clase, reflexionar su contenido y formular las preguntas que se considere necesarias. Este curso puede resultar significativo al momento de organizar el contenido de enseñanza en función de los aprendizajes requeridos por los diferentes escenarios de aprendizaje. También puede servir de orientación al momento de querer cambiar los currículos, los planes de estudios, las estrategias de enseñanza en el nivel universitario.  </p>  <p style=\"\">  \tSi bien el curso hace referencia a la formación en Derecho, los conceptos son plenamente aplicables a cualquier campo de la formación profesional universitaria.  </p>  <p style=\"\">  \t  Escenarios de Aprendizaje - Complejidad - Ontologías - Mapas conceptuales  </p>", 
    "end_date": null, 
    "title": "Introducción al mundo del conocimiento complejo", 
    "price": "20.00", 
    "instructors": "Eduardo Escalante", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304218_3c21_4.jpg", 
    "course_url": "https://www.udemy.com/introduccion-al-mundo-del-conocimiento-complejo/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T12:09:53Z"
}