{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>At the end of my course, students will be able to list up a global overview of the Middle Ages of, mainly, Western Europe, by investing a minimum of time. The key words on the intention of this course are on the one hand quality and on the other hand surveyebility.</p>\n\n<p>The course is set up in this way that the student will be able to memorise a clear overview of the Middle Ages without an overload of details and trivial facts but include, on the contrary, the main events which were decisive for the Middle Ages. The course is split up into three main parts. The first part is an introduction, which gives the student a broad and clarifying insight about the Middle Ages from different point of views. The second part is the actual content of the Middle Ages, which is subdivided into five main periods, namely:</p><ul><li>The early Middle Ages part I: ca 400 until 750</li><li>The early Middle Ages part II: ca 750 until 1000</li><li><span></span>The high Middle Ages: ca 1000 until 1200</li><li><span></span>The late Middle Ages part I: 1200 until 1350</li><li><span></span>The late Middle Ages part II: 1350 until 1500</li></ul><p>Globally, the Middle Ages run from the year 400 until the year 1500, the five main time periods are based on logical fundaments, such as main events, which announced a new time period. However, keep in mind that every time period, especially for what concerns the Middle Ages, is relative. The third part of the course is a conclusion.</p>\n\n<p>On the basis of this course, students should be able to master a clear structure of the history of the Middle Ages and to demonstrate links or differences between social themes from different time periods. Moreover, students should be able to analyse the history of the Middle Ages with different ‘glasses’ and by doing this appropriating oneself different point of views of the Middle Ages. And last but not least, the students, should always start form a critical an academic attitude, wich is of course offered during this course.\n\n  </p>\n\n<p>Please, be aware of the fact that this is an introductory course. The main goal of this course is to give the student a global overview and insight of the history of the Middle Ages of Western Europe. A detailed and thorough course will be soon available. Please, enjoy this introductory course, and step by step, find out, that the Middle Ages or the Dark Ages, is quite a wrong or superseded name for this rich time period!</p>", 
    "end_date": null, 
    "title": "Introduction to the Middle Ages", 
    "price": 0, 
    "instructors": "Davy Casteleyn", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707016_6aa3_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-the-middle-ages/", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-26T15:52:51Z"
}