{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>\"Having enjoyed Josh's witty insights and engaging manner in his previous courses I was expecting nothing less than another high quality course...Looking for a highly entertaining take on Jane Austen's novels? This is it!\" --MICHAEL</strong><br></p>\n\n\n\n<p><em>Enjoy a richer experience while reading some of the best fiction ever written.</em></p>\n\n\n\n\n\n<p><em> Benefit from reading great literature about some of life's most important issues.</em></p>\n\n\n\n\n\n<p>I hear people say that they haven't read the Classics for numerous reasons:</p>\n\n\n\n\n\n<ul><li>\"I'm too busy\"</li><li>\"The story seems confusing\"</li><li>\"The book is REALLY long\"</li></ul>\n\n\n\n\n\n<p>Other people have read the books and say:</p>\n\n\n\n\n\n<ul><li>\"I didn't really get it.\"</li><li>\"I liked the story, but I'm not sure about the themes.\"</li><li>\"I didn't understand what was happening because the language was difficult.</li></ul>\n\n\n\n\n\n<p><strong>-----REGARDLESS of YOUR REASON: THIS CLASS WILL HELP YOU-----</strong></p>\n\n\n\n\n\n<p>  \t                      Allow my years of classroom teaching and experience to guide you!</p>\n\n\n\n\n\n<p>  \t                  In the classroom, a teacher builds \"scaffolding\" to help his/her students understand the material. In construction, scaffolding is a temporary structure used to support people and material while the real structure is being built.  </p>\n\n\n\n\n\n<p>  \t<strong>THIS CLASS IS YOUR SCAFFOLDING!</strong>  </p>\n\n\n\n\n\n<p>  \t<em>My course won't replace the literary richness that you will find in a Jane Austen novel, but it will help you build your understanding of her great novel in under 60 minutes.</em>  </p>\n\n\n\n\n\n<p>Here's How You Will Will Get More From These Great Books:<br></p>\n\n\n\n\n\n<ul>  \t<li>Animated Summaries that Make the Stories Come to Life</li>  \t<li>Storytelling Videos to Help you Understand the Themes</li>  \t<li>Short Bio of the Author to Better Understand the Cultural Impact</li>  \t<li>Lessons on Major Characters, Themes, and Quotes that Are Easy to Understand</li>  </ul>\n\n\n\n\n\n<p>  \t<em>You don't need a degree to enjoy the Classics -- but sometimes a little guidance goes a long way.</em>  </p>\n\n\n\n\n\n<p><strong>ENROLL NOW...IT'S FREE!</strong><br></p>\n\n\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Jane Austen: A Quick & Unique Guide to Successful Reading", 
    "price": 0, 
    "instructors": "Josh Withrow", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390980_6935_3.jpg", 
    "course_url": "https://www.udemy.com/jane-austen/", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-11T06:35:47Z"
}