{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>When you hear the terms &quot;Immortal Soul, Heaven and Hell, the Messiah, and Resurrection,&quot; do you automatically think of Christianity? This course will show you that these are Jewish beliefs as well! This 10-session course, containing a total of 2.15 hours of video lectures, will first provide you with a historical background to ancient Judaism and Christianity, and then will focus on one primary religious belief each session, including the topics of undeserved suffering, the immortal soul, heaven and hell, the messiah, the world to come, angels, resurrection, and forgiveness. Each session contains a video lecture, sample texts to study, and opportunities to interact with fellow classmates about these religious beliefs. After taking the course, you will be able to articulate how Judaism and Christianity are similar in their beliefs and how they differ; trace how religious beliefs are embedded in the Hebrew Bible and the New Testament; analyze ancient Rabbinic texts in comparison with texts from the ancient Church Fathers; and refute stereotypes about Judaism and Christianity. If you want to have a deeper knowledge of the relationship between Judaism and Christianity, are interested in chaplaincy or interfaith work, or simply want to contribute to greater interfaith understanding, this course is for you!</p>", 
    "end_date": null, 
    "title": "Judaism and Christianity: Same But Different", 
    "price": "20.00", 
    "instructors": "Ruth Sandberg", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495144_00d0_11.jpg", 
    "course_url": "https://www.udemy.com/judaism-and-christianity-same-but-different/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T16:27:50Z"
}