{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \tUnderstanding the Roman Empire is the key to understanding the early history of Europe  &ndash;  the middle ages, the Renaissance, and the early modern period owe a huge debt to Rome, from the Carolingian successor state to the shattered Spanish kingdoms left in the wake of Rome&#039;s receding power.  But to understand the Roman Empire, you have to understand the man who made it possible.  Julius Caesar was born in a time when the Roman Republic was barely hanging together, and he lives a singularly extraordinary life.  Caesar conquered Gaul, the territory that today is known as France, then returned to Rome to take absolute control of the largest nation in the western world and finally died in betrayal on the very floor of the Senate.  </p>  <p style=\"\">  \t<br style=\"\">  \t    But this was all at the end of Caesar&#039;s life, the culmination of his 55 years.  What happened before?  Caesar was 40 when he set off for Gaul, and he&#039;d already done more than most Roman politicians did in their entire lives.  He&#039;d been captured by pirates, struck alliances with the largest names in Rome, and already been a wildly successful military leader.  Understanding this part of Caesar&#039;s life is key to understanding the rest of it, as this is when Caesar becomes the man who is able to do such great things later.  This is Caesar&#039;s prologue, his origin story, and it&#039;s a fascinating tale.<br style=\"\">  \t<br style=\"\">  \t    This course is the first of what will be a three-part series covering the entire life of one of the greatest men in history.  It is an exhaustive overview of Caesar&#039;s early life with about 1.5 hours of video content.  In addition, purchasing this course will get you 66% discounts on the next two chapters of Caesar&#039;s life (coming soon!).  </p>", 
    "end_date": null, 
    "title": "Julius Caesar Part One: Early Life and Career", 
    "price": "20.00", 
    "instructors": "David Halsted, Chris Halsted", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/80240_ea09_5.jpg", 
    "course_url": "https://www.udemy.com/julius-caesar-part-one/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-18T05:03:51Z"
}