{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \tDo you need to write a literary analysis or participate in a book discussion, but you don&#039;t know where to start? How do others read a piece of fiction and understand it so much better than you do? Most likely, they have training and practice. With this course, you can, too. Colleges across the US require students to take courses in English Literature because it improves crucial critical thinking skills.  </p>  <p style=\"\">  \tResearch at Michigan State University has proven that close reading of literature engages complex cognitive brain functions. The benefits of cognitive development include increased intelligence, reasoning, language development, memory, problem solving and decision making.  </p>  <p style=\"\">  \t    Designed by a college instructor, this course can help you understand the fundamental elements of fiction and help you read and analyze literature at the college level. Save money on expensive tutors or get a jump start on those college English courses with over 20 videos filled with key terms, concepts, and examples.  </p>  <p style=\"\">  \t    This course is also beneficial to book lovers, book bloggers, and book club members who want to discuss literature with confidence and authority. You don&#039;t have to pay for an expensive college education to read fiction like a college graduate. Books are for everyone, and so are cognitive brain functions. Rise above the ordinary and engage your brain!  </p>", 
    "end_date": null, 
    "title": "Learn How To Read Literature: Elements of Fiction", 
    "price": "20.00", 
    "instructors": "Tricia Foster", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299802_298f_2.jpg", 
    "course_url": "https://www.udemy.com/critical-reading-for-college-success-elements-of-fiction/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T21:13:15Z"
}