{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Together we can <strong>easily teach your young child to read </strong>using<em> </em>this <em>Learn to</em> <em>Read </em>course. It is for beginner readers aged from 2 to 6. Everything you'll need to teach your child to read and give them a <strong>Massive Head Start</strong> is here...the Alphabet letters and sounds; sight words; phonics and early reader learn to read video books. </p><p>Most of the course is in video format and practical - the videos teach your child directly. It's like having a highly experienced teacher in your home 24/7. There are also follow-up Learn to Read activity sheets you can print off and use with your child. </p><p>I also teach you how to help your child learn to read.  You will learn all the skills that professional reading teachers have to ensure that your child is reading for comprehension and fluency.</p><p>The most powerful time for your child to learn to read is from birth to 5 years of age. Don't let this incredible opportunity slip away. Teaching your child to read will give them a massive head start.</p><p><strong>I Teach Your Child </strong></p><ul><li>Alphabet Letters and Sounds</li><li>Sight Words - themed sight words with pictures and 20 Most Commonly Used Words</li><li>Phonics - the essential vowel sounds and basic sound blends</li><li>Video Books - simple early reader books with repeated text and sight words</li></ul><p>I am a highly qualified teacher and over the past 30 years I have taught hundreds of young children to successfully read. </p><p><strong>After Taking <em>Learn to Read for Beginner Readers</em></strong></p><p>Your child will be able to read simple Level 1 early reader books. They will know the sounds of the Alphabet, be able to sound out simple Phonic Blends, identify many Sight Words and successfully read simple learn to read Video Books.<strong></strong></p><p>You will have learned new essential skills to help your child throughout their learning to read journey...including what to do when your child can't identify a word, how to introduce a book to maximize your child's chance of a fluent reading experience and how to encourage your child to read for understanding or comprehension.</p><p><strong>Who is the Target Audience</strong></p><p>Parents of young children aged from 2 to 6 who want to help their child learn to read.</p><p>Young children (1st and 2nd year school levels) who are struggling to learn to read at school. This course will take your child back to the basics and give them confidence in their ability to read.</p><p><br></p>", 
    "end_date": null, 
    "title": "Learn to Read for Beginner Readers", 
    "price": "20.00", 
    "instructors": "Teacher Karen Campbell", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465552_816d_6.jpg", 
    "course_url": "https://www.udemy.com/learn-to-read-for-beginner-readers/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T04:02:33Z"
}