{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>Ministry Essentials - Keys to Successful Ministry</strong>  will prepare students for a successful and prosperous ministry. Students will learn how to minister with the Holy Spirit and allow His power to flow through them to the sick and hurting. All areas and phases of ministry will be covered in great length and this is the one \"nuts and bolts\" bible course NEVER taught in bible schools. </p><p>Often bible school students ask, \"how do I now get started\" after they've attended bible schools all over the world and the instructors often have no idea nor do they want to share these truths that are shared in this course with students to launch them into successful ministry and how to start various ministries from nothing! </p><p>Upon completion, students will gain a great understanding of the full and part time ministry globally and how to launch and start any kind of ministry with success in a matter of weeks! </p><p>Lessons:</p><p><em>• Youth Ministry</em></p><p><em>• Music Ministry</em></p><p><em>• Successful Ministry Marketing</em></p><p><em>• Goals and Planning</em></p><p><em>• Kinds of Preaching </em></p><p><em>• Powerful Bible Study Methods</em></p><p><em>• Weddings, Funerals and Dealing with Divorce</em></p><p><em>• Caution in Ministry</em></p><p><em>• Planting a Church</em></p><p><em>• Serving Others in Ministry</em></p><p>About this course: </p><ul><li><em>Thousands of happy students</em></li><li><em>Comes with workbook </em></li><li><em>Multiple instructors that will bring great revelation of the word of God!</em></li><li><em>Full, free lifetime access</em></li><li><em>The bible training you need to make it in ministry</em></li></ul><ul><li>We have over 30 years of full time ministry training</li><li>No bible school out there will train you with practical training like MTI</li><li>Comes with free consulting for bible training</li><li>We have organizations that we refer students who have graduated MTI to get both licensed and ordained</li><li>You can go through all of the MTI classes as quickly as your schedule allows and then allowing you in an accelerated time to get launched into your ministry!</li></ul><p>Ministry Training Institute is a video school that gives you all the practical and revelation knowledge that is needed for you to get started in full time ministry or just getting to know the Lord Jesus in a greater light. </p><p>And of course we stand behind the 30 day money back guarantee! You'll be thrilled with how much you've grown spiritually in this easy to understand and easy to grasp course.<br></p><ul><li>This course has over 200 students globally!</li></ul>", 
    "end_date": null, 
    "title": "Ministry Essentials - How to Start a Successful Ministry", 
    "price": "30.00", 
    "instructors": "Tom Scarrella", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545566_b7da_5.jpg", 
    "course_url": "https://www.udemy.com/ministry-essentials-keys-to-successful-ministry/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T15:25:35Z"
}