{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \tIn the 19<sup style=\"\">th</sup> century, the planet Mars became the darling of astronomers, and there was a lot of speculation about life on Mars.  Science fiction writers like H. G. Wells picked up on this, so that Mars became the origin of many hostile invasions in literature and the emerging electronic media in the 20<sup style=\"\">th</sup> century.  This media included radio, which by 1938 had become an important source of both entertainment and news.  The overseas news bulletins were especially esteemed because they brought up-to-the-minute news concerning the growing threat of a major war because of militant leaders in Japan, Germany and Italy.  Many were saying that America would be drawn in to such an awful conflict.  </p>  <p>  \tOrson Welles, always working to increase the ratings of their Mercury Theater, decided to adapt H. G. Wells’ novel “The War of the Worlds” to their present time, using special news bulletins to draw the audience into the spreading invasion.  Our society could hardly have been primed better for the effectiveness of this broadcast.  </p>  <p>  \tMany tuned in to the broadcast after the introduction, and became convinced through those news bulletins that America was being invaded by powerful aliens from Mars.  The resultant panic choked communication lines and befuddled city and police officials.   This class will provide a broad introduction to the broadcast, links to listen to or read the original broadcast, and a survey of the reactions across this nation and Canada.  A final section will consider the legacy of the radio program and a conclusion.  </p>  <p>  \tThere are supplemental documents that provide recommended resources, and a final bibliography in APA format.  The course comprises 6 Sections, with approximately an hour and a half of video storytelling, and links to the listen to or read the original play (approximately 45 minutes).  Students should be able to complete the course in about 2 hours and 15 minutes.  </p>", 
    "end_date": null, 
    "title": "Orson Welles and the 1938 The War of the Worlds Broadcast", 
    "price": 0, 
    "instructors": "Gerald Franz", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/76460_691b_8.jpg", 
    "course_url": "https://www.udemy.com/orson-welles-and-the-war-of-the-worlds/", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-09T23:05:27Z"
}