{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">&#039;Being Transformed by the Renewing of the Mind&#039;-- That is the goal of this course and one of the Apostle Paul&#039;s own goals for his readers. </p><p style=\"\">Paul and His Letter to the Galatians is intended to take you into an in-depth understanding of one of the New Testament&#039;s most foundational writings. We will go section by section with lectures by Prof. N.T. Wright and a Q&amp;A session with Prof. Wright and Prof. Seemuth. We will have reading assignments in the textbook: &#039;Paul for Everyone: Galatians and Thessalonians&#039; by N.T. Wright (ISBN: 0664227856). We will also gather in guided discussions with other students so we can learn together through reflection and interaction about application of the material to life. You also will have opportunity to interact with Prof. Wright and Prof. Seemuth through the Discussion Forums. Quizzes have been developed to help test comprehension of both reading material and the video lectures. </p><p style=\"\">The course is intended to take time. We hope that it is worth spending many weeks to embrace Paul&#039;s message in his letter to the Galatians. There is no set time limit to the course, so it really is at your own pace. But we hope &#039;slower&#039; rather than &#039;faster&#039; will lead to greater comprehension and the transformation the apostle himself would have hoped for.</p>", 
    "end_date": null, 
    "title": "Paul and His Letter to the Galatians", 
    "price": "50.00", 
    "instructors": "N.T. Wright, David P. Seemuth", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466208_2d6f_6.jpg", 
    "course_url": "https://www.udemy.com/paul-and-his-letter-to-the-galatians/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T21:09:24Z"
}