{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<em>'Recognized as a <strong>top instructor</strong> by Udemy for high quality academic courses'</em>  </p>  <p>  \t<em>'First time on Udemy, courses delivered by <strong>Nobel Prize laureates and international academic authorities</strong>'</em></p><p><em>If you are as crazy and passionate about true knowledge as our community and believe that true <strong>knowledge is true wealth</strong>, then our courses are for you.</em></p>  <p>  \t            In this masterclass Emanuele Severino, one of the most important contemporary Italian philosophers, explains us Presocratics and the birth of philosophy.  </p>  <p>  \t        The Presocratics were the first thinkers to reject mythological explanations of the world and to explore the rational principles of reality. The works of Thales, Heraclitus and Parmenides paved the way for the thoughts of Plato and Aristotle; their theories gave the birth of the Western philosophy.  </p>  <p>  \t<strong>This course is for:</strong>  </p>  <ul>  \t<li>Anyone with inquisitive and open mind</li>  \t<li>Everyone interested in birth of philosophy and presocratics</li>  \t<li>Anyone with Interest in philosophy</li>  \t<li>Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li>Attending the course does not need any philosophical skill since it is presented in a clear and simple manner</li>  \t<li>Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates' works.</li>  </ul>  <p>  \t<strong>With this course you will learn:</strong>  </p>  <ul>  \t<li>Over 27 lectures and 1.5 hours of content!</li>  \t<li>24 masterclasses and 1.5 hour and more of content</li>  \t<li>You will learn about the Presocratic Philosophers and their theories</li>  \t<li>You will learn how the Western philosophy was born</li>  \t<li>You will take a deep dive into philosophical world</li>  </ul>  <p>  \t  From literature to economics, art to philosophy, <strong>EdooTV</strong> gives voice to the world's leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p>  \t  Don't wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong>best gift</strong> you can give to yourself and your loved ones.  </p>  <p>  \t  Feel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "Presocratics and the Birth of Philosophy - Emanuele Severino", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319520_66d4_2.jpg", 
    "course_url": "https://www.udemy.com/emanuele-severino-presocratics-and-the-birth-of-philosophy/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T15:36:10Z"
}