{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Public Speaking for kids and teens is an amazing course for any parent, child or teen who wants to see massive confidence built for public speaking.  This course is all about building confidence as you learn loads of technique that will make the topic selection, speech writing and delivery process much smoother.  Public speaking is a life long skill and employers are desperately looking for employees that are great at it.</p><p>This course is a wonderful beginning for anyone who is afraid of public speaking or wants to get better at it.</p><p>Loaded with tips and techniques on confidence building, topic selection, speech writing and delivery this is a great course for the beginner or even more advanced student of speaking.</p><p>The techniques are broken down into easy to understand terminology for kids and yet spoken in such a way that teens can relate to them as well.</p><p>The course currently includes 33 training videos and a number of supporting pdf documents that can be downloaded.  I will continue adding lectures in other areas of public speaking technique weekly in the areas of voice technique and actual presentation skills.  The price of the course will go up soon as I start adding more lectures and content.</p><p>This is a self-paced course that could be completed in a day or two or over time.</p><p>In addition to the course materials, I am on hand in the disucssion boards to answer questions and give support on a regular basis.</p><p>Public speaking is one of the most valuable skill sets we can give our children as employers, educators, colleges and beyond require this skill set.  It&#039;s also the number one fear among adults.  Now is the time to set a great foundation for no fear public speaking and massive confidence building in kids and teens, this skill set will last a lifetime.</p>", 
    "end_date": null, 
    "title": "Public Speaking for Kids and Teens", 
    "price": "20.00", 
    "instructors": "Tracy Goodwin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506250_8f3c_5.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-for-kids-and-teens/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T15:35:09Z"
}