{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This course is for everyone: for those who like Russian culture and for those who know nothing about it, for those who think Russian classics wrote only about the struggling and for those who know it is such a multi-faceted diamond and an absolute must read for any educated person. </p><p>We will learn who were the poets and writers of the Golden Age (Unit I), Silver Age of the Russian literature and Modern Russian and Soviet writers and poets (Unit II). At the end of the course you may write some essays on the topics that we would have discussed in class. If you are already in possess of some literary lexis it will make the comprehension of the course easier but if not, it is not a problem: the course is made in a funny game way to be even more interesting and you will learn some curiosities that not every Russian knows!</p><p>In downloadable materials you will find some books that you should read to understand better the course. Those are the works of the writers that we discuss in class.</p><p>Why take this course? Simply because you are finally going to be able to discuss literature with your mates and actually give them some information they would never learn! </p><p>I need to alert that this short course can't embrace all the literature and poets and writers, so, to be continued. And for now, let's explore this world together!</p>", 
    "end_date": null, 
    "title": "Russian Literature for Dummies", 
    "price": "25.00", 
    "instructors": "Anastasia Dehtiarova", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479368_90df_2.jpg", 
    "course_url": "https://www.udemy.com/russian-literature-for-dummies/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-17T22:13:20Z"
}