{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>SCHOOL OF THE SUPERNATURAL - DREAM INTERPRETATION</strong> will prepare students for walking in all that God has for them. Students will learn how to minister with the Holy Spirit and become a radical believer who shows the love of Jesus to a hurting world by demonstrating His love through His power.</p><p>The training offered in this course is life changing, covering subjects such as Healing, Prophecy, Gifts of the Spirit, Dream Interpretation and Deliverance. </p><p>Upon completion of this course, students will be confident for supernatural ministry to anyone at anytime!</p><p>The <strong>School of the Supernatural</strong> portion of the school will train students to really step out of their fears and really minister in power in the strangest places, and rather than fear dictating when and where they can minister, they'll see how natural the supernatural can flow! <br><br>The <strong>Dream Interpretation</strong> part of the course will show students the power of nighttime parables and how God's been speaking to people globally constantly and how to understand how He's speaking in the nighttime.<br></p><p>Lessons:</p><p><em>• Healing Made Easy</em></p><p><em>• Supernatural Hunger</em></p><p><em>• The Word of Obvious</em></p><p><em>• Words of Knowledge and Wisdom</em></p><p><em>• Ministering to Family and Strangers</em></p><p><em>• How to Approach People</em></p><p><em>• Supernatural Mindsets</em></p><p><em>• 12 Most Common Dreams</em></p><p><em>• Dreams, Metaphors and Play on Words</em></p><p><em>• Dream Journaling</em></p><p>Instructors: </p><p><strong>Jason Chin</strong> - is one of MTI's instructors from Redding, California. He has a strong ministry and loves training people in supernatural ministry. He teaches at the church and school of Bethel Church in Redding, CA. You can look up Jason's ministry at Love Says Go. </p><p>About this course:</p><ul><li><em>Thousands of happy students</em></li><li><em>Comes with workbook and extra ebook </em></li><li><em>Multiple instructors that will bring great revelation of the word of God!</em></li><li><em>Full, free lifetime access</em></li><li><em>The bible training you need to make it in ministry</em></li><li><em>Each of our MTI course all come with 2 courses covered in great detail</em></li></ul><ul><li>We have over 30 years of full time ministry training</li><li>No bible school out there will train you with practical training like MTI</li><li>Comes with free consulting for bible training</li><li>We have organizations that we refer students who have graduated MTI to get both licensed and ordained</li><li>You can go through all of the MTI classes as quickly as your schedule allows and then allowing you in an accelerated time to get launched into your ministry!</li></ul><p>Ministry Training Institute is a video school that gives you all the practical and revelation knowledge that is needed for you to get started in full time ministry or just getting to know the Lord Jesus in a greater light. </p><p>And of course we stand behind the 30 day money back guarantee! You'll be thrilled with how much you've grown spiritually in this easy to understand and easy to grasp course.<br></p><ul><li><strong>This course has over 200 students globally!</strong></li></ul>", 
    "end_date": null, 
    "title": "School of the Supernatural - Dream Interpretation", 
    "price": "40.00", 
    "instructors": "Tom Scarrella", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630232_754f_6.jpg", 
    "course_url": "https://www.udemy.com/school-of-the-supernatural-dream-interpretation/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T11:35:06Z"
}