{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong><u>Serving Well in China</u></strong></p>    <p>Are you a Christian preparing to serve in China, or maybe you’re already there? </p><p>Are you working with Chinese students in your home country?</p>    <p>This course is <strong><em>definitely</em></strong> for you.</p>    <p>China is one of the few places in the world where a statement can be completely true and completely false all at the same time. With a rich history and strong cultural values that are now being redefined by a complicated contemporary society, China can be a daunting place to navigate. </p>    <p>We’re here to help! This course is less about a set of answers and more about presenting a framework with which to process the complexities of China. When you encounter confusing situations or cultural differences, what you learn here will help you reconcile them with your cultural background and expectations.</p>    <p><strong><em>What’s inside?</em></strong></p>  <ul><li>Five video lectures (each 10-20 mins long)</li><li>Accompanying quizzes</li><li>Questions for reflection/discussion</li><li>A list of resources for further study</li><li>Training conducted by seasoned, professional trainers with over 40 years of combined experience working and living in China, and over 20 years of experience training westerners to serve effectively in China</li><li>Valuable information and insight on contemporary Chinese society and culture</li><li>Practical advice on managing cultural differences</li><li>An explanation of various cultural “rules” that govern how people in China interact with one another</li><li>A description of the key features of the Chinese educational system and how it directly affects and informs the worldview of the Chinese people</li><li>An examination of areas of expectation that may need to be adjusted</li><li>Key principles for successful cross-cultural adjustment and living in China</li></ul>              <p><strong><em>What you’ll get?</em></strong></p>              <p>Whether you are just getting started in China or are a seasoned Middle Kingdom sojourner, this course will deepen your understanding of why China is the way it is, allowing for a more fruitful and effective ministry.</p>", 
    "end_date": null, 
    "title": "Serving Well in China", 
    "price": "30.00", 
    "instructors": "ChinaSource Institute, Joann Pittman, Amy Young", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/770640_e870_6.jpg", 
    "course_url": "https://www.udemy.com/serving-well-in-china/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-22T15:40:59Z"
}