{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Shakespeare is a frightening name to many. People assume it means complex archaic language that will be hard to understand. This course will unlock those “complex” concepts and give you the tools to own not only Shakespeare’s language but any text you have to memorize and perform whether it be a toast at a wedding, a presentation at work, or a Shakespeare monologue for an audition. </p><p><strong>Bring language to life through fun physical exercises</strong></p><ul><li>Acting out metaphor, simile, and complex imagery</li><li>Throwing a ball against a wall to release the power of words</li><li>Motivating speech through actions and objectives</li></ul><p><strong>Master Shakespeare through text exercises</strong></p><ul><li>Understand and easily memorize through verse structure </li><li>Gain a roadmap through any speech by walking the punctuation</li><li>Release the power of the speech through operative words and antithesis</li></ul><p>There are many benefits to knowing how to perform Shakespeare. You will become much more comfortable with public speaking. You will be given exercises to conquer stage fright. You will never be afraid of the name Shakespeare again and will be able to fully enjoy his plays and the poetic language that makes him the greatest writer in the English language. </p><p>Most Shakespeare programs or classes will be very time consuming and costly and usually require an audition to participate. I have culled all of these techniques from 7 years of acting training, 20 years as a professional actor, and 6 years as a teacher of acting and Shakespeare. I have created a course that is not only effective in teaching the student how to perform Shakespeare but also a lot of fun! </p>", 
    "end_date": null, 
    "title": "Shakespeare: How to access the power of words! ", 
    "price": "30.00", 
    "instructors": "Jay Whittaker", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721196_d62c_2.jpg", 
    "course_url": "https://www.udemy.com/shakespeare/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T20:43:12Z"
}