{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>In this course <em>Simply Jesus</em>, students will be immersed in the 1st Century A.D. context of the life, work, teachings, and actions of Jesus of Nazareth.  The goal of the course is to look at the story of Jesus from the perspective of a historian. Too many times Jesus of Nazareth becomes interpreted as simply another 'religious figure' among many religious figures. But this so often eliminates the understanding of a man who lived in time and space at a critical time of history. </p><p>This course is meant for all audiences. No previous theological study is required or expected. In this way it is meant to give a basic understanding of Jesus as a figure in history primarily. </p><p>Prof. Wright will lecture on key biblical texts to walk the student through the different elements that constitute the story of Jesus. In addition, there will be quizzes and discussion questions to help the student think more intently about the material presented. </p><p>This course tries to focus on essential biblical texts and non-biblical historical material to embrace the larger story of a Jesus of history. This course is to be taken in tandem with the reading of Prof. Wright's book, <em>Simply Jesus</em>.  In <em>Simply Jesus</em>, bestselling author and leading Bible scholar N.T. Wright summarizes 200 years of modern Biblical scholarship and models how Christians can best retell the story of Jesus today. In a style similar to C.S. Lewis’s popular works, Wright breaks down the barriers that prevent Christians from fully engaging with the story of Jesus.</p><p>We trust that the material and the dialogue with other students will be encouraging and enlightening for all.</p>", 
    "end_date": null, 
    "title": "Simply Jesus", 
    "price": "40.00", 
    "instructors": "N.T. Wright, David P. Seemuth", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693138_b831.jpg", 
    "course_url": "https://www.udemy.com/simply-jesus/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T16:01:24Z"
}