{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Learn how to get organized, write your essay, and even have it reviewed by admissions counselors and professional editors before you apply. Everything you need for a stress-free college application process is here!</p><p>Students will learn how to get organized and stay organized throughout their college application process and immediately be able to apply unique techniques including the art of asking for a letter of recommendation and how to use our team of admissions counselors and professional editors to turn the personal statement (essay) from an afterthought to the strongest part of their application!</p><p>The student who will benefit most from this course are those who are dreading the college application process, those who don't know where to start when applying to colleges, and those who want to write a stellar college essay... or four!</p><p>The course is broken up into six distinct lessons, which allows students to go through the entire sequence or to jump to specific, more timely, lessons depending on where they are in the process or their feelings of competence.  The lessons include:</p><p>1. An overview of the college application process</p><p>2. How to get organized and stay motivated throughout the process.</p><p>3. The definition and purpose of a resume and the statement of purpose.</p><p>4. The art and science of requesting a letter of recommendation.</p><p>5. Writing the personal statement (essay), including instructions on having the essay reviewed by a college admissions counselor and a professional editor before submission.</p><p>6. How you can use your resume and essay in future applications, including scholarships.</p>", 
    "end_date": null, 
    "title": "Stress-Free College Applications", 
    "price": "20.00", 
    "instructors": "Sam Feeney", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653560_c4cf.jpg", 
    "course_url": "https://www.udemy.com/stressfreecollegeapplications/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T16:17:16Z"
}