{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t      Are you planning a trip to Germany? If so, a visit to at least one of &quot;Mad&quot; King Ludwig&#039;s castles is most likely on your itinerary: they&#039;re some of Germany&#039;s top tourist attractions. This course teaches you background information about each of the castles where the king grew up and later designed.  </p>  <p style=\"\">  \t      Perhaps you&#039;ve already taken a European trip and seen the castles, and your interest was piqued. This is the course to take to learn more about the man behind these fantastic buildings.  </p>  <p style=\"\">  \t      Or, suppose a trip to Europe is the farthest thing from your mind, due to budget or other constraints. This course serves as a wonderful armchair vacation as we explore a fascinating historical figure, and some of the world&#039;s most iconic buildings.  </p>  <ul style=\"\">  \t<li>      With 12 lectures, each complete with a transcript, and many photos, you&#039;ll find yourself looking forward to spending time each day in the &quot;Land of Ludwig.&quot;  </li>  </ul>  <ul style=\"\">  \t<li>    Once you&#039;re a student of the class, you&#039;ll have lifetime access to all lectures and materials.  You can &quot;visit&quot; Germany as often as you like, and you can test your comprehension with two included quizzes.  </li>  </ul>  <p style=\"\">  \t      This course is perfect for all ages, from children to seniors. Let&#039;s get started today on a <em style=\"\">wunderbar </em>trip to Germany. All aboard!  </p>", 
    "end_date": null, 
    "title": "The Castles of Mad King Ludwig ", 
    "price": "20.00", 
    "instructors": "Susan Braun", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386756_6221_3.jpg", 
    "course_url": "https://www.udemy.com/the-castles-of-king-ludwig-ii/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T15:36:37Z"
}