{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>\r\n\t     English history expert and native Brit Dr. Bernard Carpenter provides an examination of one of the most pivotal and well documented events in world history. This course covers the English Reformation that resulted in the country&#039;s break with Rome. It will introduce you to the real people such as Henry VIII and Anne Boleyn who have inspired plays, television series, films and art since the time of Shakespeare.\r\n</p>\r\n<p>\r\n\t    The materials provided in this course include:\r\n</p>\r\n<ul>\r\n\t<li>Eight, high-quality video lectures complete with historical paintings, graphics and maps</li>\r\n\t<li>Eight quizzes to accompany each video lecture</li>\r\n\t<li>Written text corresponding to each lecture including a downloadable PDF textbook</li>\r\n</ul>\r\n<p>\r\n\t    Course Outline:\r\n</p>\r\n<ol>\r\n\t<li>INTRODUCTION: This section will set up the English Reformation and give background on the Protestant reformation that preceded it</li>\r\n\t<li>THE KING&#039;S GREAT MATTER: A brief history of the origins of the Tudor dynasty and the marriage between Henry VIII and Catherine of Aragon</li>\r\n\t<li>KATHERINE QUEEN OF ENGLAND: Henry VIII demands an annulment from Catherine of Aragon who was unable to provide the male heir he desired while Anne Boleyn catches his eye</li>\r\n\t<li>&quot;THE KING&#039;S GREAT WHORE&quot; and &quot;PLAIN JANE&quot;: Anne Boleyn and Henry VIII&#039;s love quickly cools ending with Anne on the scaffold and a third wife for Henry VIII in Jane Seymour who provides him with a male heir</li>\r\n\t<li>&quot;MALLEUS MONACHORUM&quot; and &quot;THE FLANDERS MARE&quot;: Henry&#039;s Lord Chancellor Thomas Cromwell earns the title &quot;Hammer of the Monks&quot; and marriages number four and five for Henry don&#039;t last long</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    RELIGIOUS TURBULENCE: Henry VIII&#039;s death leaves the throne in turmoil when his male heir Edward VI dies young, Catholics and Protestants battle for control of England\r\n\t</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    MARY OF SCOTLAND and “THE VIRGIN QUEEN”: Elizabeth I proves to be a great monarch while her luckless cousin Mary, Queen of Scots is forced to flee religious turmoil\r\n\t</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    CONCLUSION: A summary of the English Reformation and its lasting legacy in England and the world\r\n\t</p>\r\n\t</li>\r\n</ol>", 
    "end_date": null, 
    "title": "The English Reformation", 
    "price": "20.00", 
    "instructors": "Dr. Bernard Carpenter", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176252_995a_2.jpg", 
    "course_url": "https://www.udemy.com/englishreformation/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-03T20:38:38Z"
}