{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p> What skills can help you the most long-term in your career? </p><p>According to <em>Business Insider</em>, \"Many people don't stay with their first career forever. Or their second. In fact, most people switch a number of times during their life. So <strong>skills that persist, like the ability to reason and write, may be a better bet over the long term</strong> than something narrowly tailored.\" [1]</p><p>Why is that?</p><p><strong>Because the skills that will ALWAYS be in demand, in any job and any market, are the ability to think and communicate ideas clearly and persuasively. </strong></p><p>That's where this course can help you.</p><p>Logic is the art (and science) of reasoning well. In this course, you will discover the fundamental principles of critical thinking, which is <strong>guaranteed</strong> to improve your reasoning skills. Learning logic makes you a more clear and precise thinker, and therefore a better, more persuasive writer, educator, communicator, salesperson, and student in just about every area. Plus, it's fun!</p><p>The course covers everything from the laws of thought, to different types of statements, the square of opposition, arguments, and more. It will take you about a month to complete, studying only 20-30 minutes per week (3-4 lectures). I have created printable lecture notes that you can fill in as go, and a review exercise at the end of each section.</p><p>Don't take this course just to help you in your career though. <strong>Take it to expand and deepen your mind!</strong> You will thank yourself for doing it. I promise.</p><p>Logic has <em>by far</em> been one of the most useful and universally applicable things I've learned in my college experience.<br></p><p>If for some reason you don't find the course helpful (I'm confident you will), then you can get a full refund within the first 30 days. So, you truly have no risk here.</p><p>Hit the \"Take This Course\" button and enroll today! </p><p>I plan to add a lot more content soon (which means the price will go up), so enroll now to get the best deal and let's get started!</p><p>See you in the course!<br></p><p>[1] Max Nisen, \"11 Reasons To Ignore the Haters and Major In The Humanities,\" <em>Business Insider</em>, June 27, 2013</p>", 
    "end_date": null, 
    "title": "The Basics of Logic: How to Reason Well", 
    "price": "40.00", 
    "instructors": "James Hoskins", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470196_4750_4.jpg", 
    "course_url": "https://www.udemy.com/the-basics-of-logic/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T20:25:16Z"
}