{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t    “What’s Inside”: Hullo, my name is Dr. Bernard Carpenter and I am honored to be your instructor for a course that covers one of the greatest tragedies in human history: I refer, of course, to the First World War, or, as it was known until the even more destructive Second World War, the Great War. Also called World War I, it is a subject very close to my heart, all the more so in this commemorative year. Growing up in England during the 1960s, I well remember elderly gentlemen reminiscing about the Great War, and both my parents were old enough to remember what they sometimes called the “14-18 War,” feeding my boyish imagination with inspiring images of young men leaving for the front. Tragically, far too many of those young men failed to return. Indeed, the war’s impact on the country of my birth is hard to overstate, but it was the same for European civilization in general. Although I hesitate to use language that might seem overblown, I feel compelled, nevertheless, to cite the American diplomat George Kennan who saw World War I as the seminal catastrophe of modern times, “the event which,” he believed, “lay at the heart of the failure and decline of this Western civilization.&quot; Now, if you choose to take this course, and I sincerely hope you do, you will learn more about this seminal event than in any other course of this type. Indeed, as the world prepares to commemorate the Great War’s centenary, I feel obligated to do justice to an event that degraded a civilization and continues to shape our world today.  </p>", 
    "end_date": null, 
    "title": "The Great War", 
    "price": "20.00", 
    "instructors": "Dr. Bernard Carpenter", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280298_632b_4.jpg", 
    "course_url": "https://www.udemy.com/the-great-war/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T17:48:49Z"
}