{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">This course on the RMS Lusitania was created to memorialize the 100th anniversary of the sinking of this ocean liner on May 7, 1915. In 25 video lectures, lasting almost four hours, this course will survey the complete history of the Lusitania. Included are class notes, quizzes, and extra links to videos or articles.</p><p style=\"\">The Lusitania went into service as one of the largest, most luxurious, and fastest liners. It transported saloon class, second class, and third class passengers between New York and Liverpool, England.</p><p style=\"\">However, when the Great War began, the Lusitania was used by the British government and Royal Navy to transport munitions from the United States to England, while still functioning as a passenger liner. This course will describe the tensions from performing both of these roles, as well as the German outrage over the munitions supplies being shipped. </p><p style=\"\">The course will focus especially on that last voyage, including the stories of some of the passengers. The lectures will combine the accounts of the U20 German U-boat and the Lusitania, as well as the decisions and actions of leaders on both sides of the Atlantic concerning the ship. After the successful U-boat attack upon the Lusitania, the lectures will focus upon the crew and passengers and their efforts to save themselves and their loved ones. We will also look at the rescuers, and the significant efforts of the people of Queenstown, Ireland.</p><p style=\"\">The lectures will cover both the immediate and long-term aftermath, including various inquiries held to assign responsibility, as well as underwater explorations of the Lusitania site. The course will end with an epilogue, conclusions, and a last lecture concerning the memory of the Lusitania from 1915 to 1917, when the United States entered the Great War.</p><p style=\"\">Welcome aboard this course!</p>", 
    "end_date": null, 
    "title": "The RMS Lusitania", 
    "price": 0, 
    "instructors": "Gerald Franz", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164972_16bf_2.jpg", 
    "course_url": "https://www.udemy.com/the-rms-lusitania/", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-16T01:00:42Z"
}