{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong style=\"\">Improve your writing skills today, with an exclusive writing course for high school students, college students, EFL students, teachers, and anyone else interested in improving their writing skills.</strong></p><p>Are you preparing for the IELTS exam?</p><p>Are you in the process of writing the college application essay and do not quite know how to start?</p><p>Are you a teacher (English, Social Studies, Science, etc.,) who is not sure how to teach your students how to write?</p><p>Are you a native speaker of another language and want to know how to write effectively in your first language?</p><p>If you answered yes, to the above questions, then click on the button now to begin your journey with me as we travel through the steps in the writing process.</p><p>This course, unlike many other courses, looks at writing as a process and not a product. It emphasizes the importance of going through each step of the writing process, thus enabling you as a writer to produce an effective writing piece, whether it be an essay, a research paper, a journal article, etc., <strong style=\"\">Practical strategies</strong> that will <strong style=\"\">empower you as a writer</strong> are given throughout the course.</p><p>Writing, like a journey, requires effective planning in order for the outcome to be successful. This course will look at a variety of prewriting (planning) methods that you can choose from and provides you with practice exercises. Additionally, there are quizzes that will help you measure your progress.</p><p>The most common writing errors that both native speakers and non-native speakers make are also examined to help you identify and correct your errors. The course ends with more tips that will help you <strong style=\"\">excel at writing.</strong></p><p>Let&#039;s not waste any time. Let&#039;s begin our journey.</p>", 
    "end_date": null, 
    "title": "The Road to Becoming a Better Writer ", 
    "price": "20.00", 
    "instructors": "Etc Services", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444588_b67f_2.jpg", 
    "course_url": "https://www.udemy.com/the-road-to-becoming-a-better-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T09:00:51Z"
}