{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>\r\n\t    We started out talking with experts in the field of aesthetics, asking them questions about the nature of beauty. We surprised to discover that what they said revealed a far larger, deeper, more profound and powerful subject than we had ever expected.\r\n</p>\r\n<p>\r\n\t    In fact, we realized that experiencing beauty can actually be transforming. And, as ironic as it seems since we have all experienced it, that we have to be taught to truly be able to experience beauty in a deep and meaningful way.\r\n</p>\r\n<p>\r\n\t    When we learn how to really experience beauty, our perceptions are awakened, our world becomes more vivid, and our lives become deeper, fuller, and more profound.\r\n</p>\r\n<p>\r\n\t    By learning to deeply experience beauty, we can connect with the world, and the people around us in a whole new, more meaningful way. It engages our spirit, and it transforms our lives.\r\n</p>\r\n<p>\r\n\t    In order to teach you how to more deeply experience the wonder and power of beauty in your life, we developed the Transformed by Beauty workshops that follow after each Beauty—Exploring the Mystery video.\r\n</p>\r\n<p>\r\n\t    First watch a Beauty video, then enter the workshop, where you will be invited to imagine, visualize, discuss (if you want to) and write down your responses to a series of workshop exercises.\r\n</p>\r\n<p>\r\n\t    There is a pdf file available for download that goes with each class. Print out the file and then just follow the instructions as you watch the workshop video, using your printed pdf file as your workspace and journal.\r\n</p>\r\n<p>\r\n\t    Transformed by Beauty is divided into 10 sections with each section taking 15 to 30 minutes to complete.\r\n</p>", 
    "end_date": null, 
    "title": "Transformed by Beauty", 
    "price": "35.00", 
    "instructors": "Alexandra Dickerman", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165340_4350.jpg", 
    "course_url": "https://www.udemy.com/transformed-by-beauty/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-16T23:46:22Z"
}