{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t    James Joyce once said, &quot;History is a nightmare from which I am trying to awake.&quot;  </p>  <p>  \t  Many people, both living in the United States and around the world, are interested in the history of America. A knowledge of history helps answer questions about how our country ended up where it is today, reveals the source of our diversity, and clarifies our current role and place in this vast world. Ultimately, someone who understands American history understands America, and by extension themselves.  </p>  <p>  \t  This general survey course is intended to give participants a broad understanding of United States History from the arrival of native peoples to the end of the Reconstruction era that followed the Civil War.  </p>  <p>  \t    The course is divided into 11 thematic sections that are chronologically ordered. Each covers the people, places, ideas, and events that were most influential to our nations development. Each of these sections includes;  </p>  <ul>  \t<li>Multiple course lectures which combine carefully organized and outlined notes, images, and music to give you a broad overview of the topic. </li>  </ul>  <ul>  \t<li>A selection of carefully selected historic documents that provide the opportunity to read more about important events first-hand through the words of people who were there. </li>  </ul>  <ul>  \t<li>Each unit concludes with a quiz that tests your overall knowledge of the entire thematic unit.   </li>  </ul>  <p>  \t  This course is comparable to a full semester of college-level U.S. History, but is simplified to ensure it remains relevant to the widest audience possible. It can also be completed at your own pace, so you can breeze through it in a few weeks, or carefully analyze it over a few months.  </p>  <p>  \t  Amateur historians, AP students looking for review material, people getting ready for vacation, and anyone else with a genuine interest in the presidents, military conflicts, social movements, locations, and everything else that is a part of our nation&#039;s story will find this course to be especially rewarding.  </p>  <p>  \t  If you&#039;ve ever wished you had a better understanding of our nation&#039;s origins, but don&#039;t want to suffer through a dry, boring textbook, this is the course for you!  </p>", 
    "end_date": null, 
    "title": "United States History - Prehistory to Reconstruction", 
    "price": "20.00", 
    "instructors": "James Fester", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260186_9996_3.jpg", 
    "course_url": "https://www.udemy.com/ushistory/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-12T15:42:46Z"
}