{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Critical thinking is one of the most important skills anyone can learn. Let philosopher Kevin deLaplante introduce you to the cutting edge of critical thinking education, with this entertaining and enlightening introduction to cognitive biases and their importance for critical thinking. </p>\n\n<p><strong class=\"redactor-inline-converted\">Interest in Cognitive Bias Training Has Exploded</strong></p>\n\n\n\n\n\n<p>Books and articles on the impact of cognitive biases in business, finance, management, teaching, science, politics, and many other fields, have exploded in popularity in recent years. Many industries have started offering cognitive bias training to management and workers, and the trend is growing. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Benefits of Understanding and Mastering Cognitive Biases </strong></p>\n\n\n\n\n\n<p>Cognitive biases undermine critical thinking by making us vulnerable to faulty beliefs and bad decisions. Cognitive bias training is motivated by a desire to avoid disasters, improve performance, and promote social justice. </p>\n\n\n\n\n\n<p>The good news is that there are proven strategies for neutralizing or minimizing the negative effects of cognitive biases. These \"debiasing\" techniques can be surprisingly simple and effective. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What You Will Learn in This Course</strong></p>\n\n\n\n\n\n<p>This course will get you up to speed on what cognitive biases are, why they're important for critical thinking, why cognitive bias training has become popular, and what sorts of \"debiasing\" techniques have been shown to be effective in improving the quality of thinking and decision-making.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Check out the free preview videos in the \"Getting Started\" section for a full breakdown of the topics covered in the course, and how the course is organized!</strong></p>", 
    "end_date": null, 
    "title": "Upgrade Your Mindware: New Tools For Critical Thinking", 
    "price": "20.00", 
    "instructors": "Kevin deLaplante", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815474_00e2.jpg", 
    "course_url": "https://www.udemy.com/upgrade-your-mindware/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T13:53:43Z"
}