{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Hello and welcome to Western Military History, Part 1: The Classical World.  This course will cover Western Military History from approximately 500 BC/BCE to 500 AD/CE.  With this lecture series we will be starting with the Persian Wars as fought between The Greek City States and Persia, then moving through the Greco-Roman classical period.  Lectures 2 and 3 will focus on the Peloponnesian War and conquests of Alexander the Great, respectively.  Lectures 4 through 6 will focus on the Hellenistic Successor Kingdoms, the Punic Wars between Rome and Carthage, and the general transition from Greek to Roman hegemony in the Mediterranean.  The last 2 lectures will focus on Late Republican and Early Imperial Roman Expansion, and the Fall of Rome during the 5th century AD.</p>\n\n\n\n\n\n<p>For anyone interested in taking this class, there are a couple things to know.  Firstly, this course is for people who have at least a basic background in history, especially the classical mediterranean world.  While I will be spending a little bit of time quickly summarizing the backgrounds to certain conflicts and going into the histories of certain people groups, my main focus with this course will be on the conflicts themselves - individuals and states involved, the weapons and armor used, tactics and organization of armies, how the wars themselves played out, and the strategic significance of the outcomes.  Throughout the series, I will also stop to address the overarching changes in military technology that took place over this period of 1000 years.</p>\n\n\n\n<p>Throughout all of my lectures, I am going to be using a fair amount of terminology that while very common within the military and the fields of military history and military science, may not be widely known to people who have never studied any of those topics.  So in a brief introductory lesson offered in tandem with the main lectures, I will cover the basic definitions of certain military terms and concepts that appear in my lectures.  Also please note, unless specifically stated.  If you are already familiar with certain military terms and concepts such as what a flanking attack is, what a casualty rate measures, what tactics are, what strategy is, the difference between tactics and strategy, the difference between conscripts &amp; militia etc., you will have no problem understanding this course.  If you are not clear on some or all of even the example terms I listed, but are interested in taking this course please make sure to check out my introductory lesson on military terminology.</p>\n\n\n\n<p>This course is perfect for anyone looking to learn more about the classical world, as well as a section of military history and the study of war in general.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Aside from being extremely interesting, I find that by understanding military history, one is able to have a much better grasp of the ways in which states rise and fall, and cultures become dominant or are diminished.  Moreover, I find that by understanding war, people can apply the same principles of working to achieve victory to problems or tasks in life.  After all, whether one is looking to win a specific battle, or complete a possibly career-starting project, concepts such as achieving objectives, developing a cohesive long-term strategy, and understanding tactics in order to accomplish specific tasks are perfectly applicable in both situations.  So without any further ado, let us begin.</p>", 
    "end_date": null, 
    "title": "Western Military History - Part 1:  The Classical World", 
    "price": "20.00", 
    "instructors": "Christopher Janney", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796552_6fae.jpg", 
    "course_url": "https://www.udemy.com/western-military-history-part-1-the-classical-world/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-18T02:45:22Z"
}