{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t       The <strong><em>Beginner’s Bible Survey</em></strong> is an  introductory course (intended for the first &quot;semester&quot;) on the Bible  that, in an easy-to-follow format, presents all the important themes of  the entire Bible and ties both Old and New Testaments into one story.   There is a wealth of information here for those who are interested in  where the Bible came from, the history of Israel, the beginnings of the  Church, and even the Bible’s description of the end of time. It&#039;s a  “fundamentals” survey, which means that anyone from high school level  upwards will be able to benefit from it.  </p>  <p>  \t      It is non-denominational, it is not sermons – it’s simply  approaching the data of the Bible as a textbook, according to the way  the Bible presents itself.  </p>  <p>  \t      Included within <strong>Part Three</strong> of the Survey is:  </p>  <p>  \t    •   Where things stand at the beginning of the New Testament<br>  \t           •   The Four Gospels and what they describe of Christ&#039;s ministry<br>  \t           •   The Glory of God, the foundation of the Christian faith<br>  \t           •   The work of the Spirit in the Church  </p>  <p>  \t    •   How to teach and preach the Gospel of Christ  </p>  <p>  \t           •   The skill of spiritual survival in hard times<br>  \t           •   The book of the Revelation<br>  \t           •   How the Old and New Testament pull together into one system<br>  \t           •   The structure and function of the Church<br>  </p>  <p>  \t      Each lesson consists of an informative and engaging video in  which the instructor walks you through the concepts, carefully  explaining what the ideas are and what they mean for the message of the  Bible.  Along with the video, you can download the appropriate section  of the textbook <em><strong>Mystery Revealed: A Beginner’s Bible Survey</strong></em>,  the original text written by the instructor.  Then each lesson provides  a quiz covering the material in the video lecture, designed to help  summarize and enhance your understanding of the concepts.  </p>  <p>  \t      Your understanding of the Bible, and the God that it  describes, will suddenly become fuller and richer after covering this  course!  </p>  <p>  \t    (The instructor&#039;s <strong>Part One </strong>and<strong> Part Two </strong>courses cover the Old Testament.)  </p>", 
    "end_date": null, 
    "title": "Whole Bible Survey: Part 3 (New Testament)", 
    "price": "30.00", 
    "instructors": "Charles Vogan", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/277426_0ccb_2.jpg", 
    "course_url": "https://www.udemy.com/whole-bible-survey-part-3-new-testament/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-08T20:10:39Z"
}