{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t The <strong><em>Beginner’s Bible Survey</em></strong> is an  introductory course (intended for the first &quot;semester&quot;) on the Bible  that, in an easy-to-follow format, presents all the important themes of  the entire Bible and ties both Old and New Testaments into one story.   There is a wealth of information here for those who are interested in  where the Bible came from, the history of Israel, the beginnings of the  Church, and even the Bible’s description of the end of time. It&#039;s a  “fundamentals” survey, which means that anyone from high school level  upwards will be able to benefit from it.  </p>  <p>  \t  It is non-denominational, it is not sermons – it’s simply approaching  the data of the Bible as a textbook, according to the way the Bible  presents itself.  </p>  <p>  \t  Included within <strong>Part Two</strong> of the Survey is:  </p>  <p>  \t<em><strong>The historical books of the Old Testament:</strong></em><br>  \t       •   Joshua and the Conquest of Canaan<br>  \t       •   The story of the Redeemer in Ruth<br>  \t       •   King David&#039;s 5-Point Plan<br>  \t       •   The Temple of God  </p>  <p>  \t <em><strong>The Wisdom books</strong></em>  </p>  <p>  \t       •   The secret to answered prayer<br>  \t       •   the wisdom of Israel  </p>  <p>  \t <strong><em>Major themes:</em></strong>  </p>  <p>  \t •   The Priest and his service<br>  \t       •   The Prophets of Israel<br>  </p>  <p>  \t Each lesson consists of an informative and engaging video in which the  instructor walks you through the concepts, carefully explaining what the  ideas are and what they mean for the message of the Bible.  Along with  the video, you can download the appropriate section of the textbook <em><strong>Mystery Revealed: A Beginner’s Bible Survey</strong></em>,  the original text written by the instructor.  Then each lesson provides  a quiz covering the material in the video lecture, designed to help  summarize and enhance your understanding of the concepts.  </p>  <p>  \t  Your understanding of the Bible, and the God that it describes, will  suddenly become fuller and richer after covering this course!  </p>  <p>  \t  (The instructor&#039;s <strong>Part One</strong> course covered the background and overview of the Old Testament, and the <strong>Part Three</strong> course follows this one and covers the NT)  </p>", 
    "end_date": null, 
    "title": "Whole Bible Survey: Part 2 (Old Testament cont)", 
    "price": "30.00", 
    "instructors": "Charles Vogan", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/275124_bf0c_2.jpg", 
    "course_url": "https://www.udemy.com/whole-bible-survey-part-2-old-testament-cont/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-05T10:17:47Z"
}