{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \tThe <strong><em>Beginner’s Bible Survey</em></strong> is an introductory course (intended for the first &quot;semester&quot;) on the Bible that, in an easy-to-follow format, presents all the important themes of the entire Bible and ties both Old and New Testaments into one story.  There is a wealth of information here for those who are interested in where the Bible came from, the history of Israel, the beginnings of the Church, and even the Bible’s description of the end of time. It&#039;s a “fundamentals” survey, which means that anyone from high school level upwards will be able to benefit from it.  </p>  <p>  \tIt is non-denominational, it is not sermons – it’s simply approaching the data of the Bible as a textbook, according to the way the Bible presents itself.  </p>  <p>  \tIncluded within <strong>Part One</strong> of the Survey is:  </p>  <p>  \t<em><strong>Introductory material:</strong></em><br>  \t     •   The background of how the Bible came to be<br>  \t     •   The eight stages of history of the Old Testament<br>  \t     •   The geography of the Bible<br>  \t     •   A simple outline of the entire Bible  </p>  <p>  \t<em><strong>The Torah: Themes of the five books of Moses</strong></em><br>  \t     •   The Creation process<br>  \t     •   Sin and Death<br>  \t     •   The Covenant with Abraham<br>  \t     •   Moses and Deliverance<br>  \t     •   The Name of the LORD<br>  \t     •   The Law of Moses<br>  \t     •   The role of the Witness in Scripture  </p>  <p>  \tEach lesson consists of an informative and engaging video in which the instructor walks you through the concepts, carefully explaining what the ideas are and what they mean for the message of the Bible.  Along with the video, you can download the appropriate section of the textbook <em><strong>Mystery Revealed: A Beginner’s Bible Survey</strong></em>, the original text written by the instructor.  Then each lesson provides a quiz covering the material in the video lecture, designed to help summarize and enhance your understanding of the concepts.  </p>  <p>  \tYour understanding of the Bible, and the God that it describes, will suddenly become fuller and richer after covering this course!  </p>  <p>  \t(The instructor&#039;s <strong>Part Two</strong> course continues the OT, and the <strong>Part Three</strong> course covers the NT)  </p>", 
    "end_date": null, 
    "title": "Whole Bible Survey: Part 1 (Old Testament)", 
    "price": "30.00", 
    "instructors": "Charles Vogan", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/269200_eaa9.jpg", 
    "course_url": "https://www.udemy.com/whole-bible-survey-part-1-old-testament/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-26T17:39:48Z"
}