{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Wenn du deine Bachelor-, Master- oder Diplomarbeit ein- für allemal und ohne Probleme fertigschreiben möchtest, dann stehst du kurz vor dem Zugang zum richtigen Kurs dafür. Wenn du schon seit Wochen oder Monaten das Schreiben deiner wissenschaftlichen Abschlussarbeit aufschiebst, dann kannst du noch heute damit beginnen.</p>  <p>Nach meinem abgeschlossenen Germanistikstudium habe ich als professioneller Korrekturleser mittlerweile über 100 wissenschaftliche Abschlussarbeiten verbessert und Studentinnen und Studenten beim Schreiben beraten. Dabei sind immer wieder die gleichen Fragen und Probleme aufgetaucht, die in den Büchern zum wissenschaftlichen Schreiben und Arbeiten meist nur ungenügend beantwortet werden. Die Literatur zu diesem komplexen Thema bereitet oft mehr Kopfzerbrechen, als sie für Klarheit sorgt – meist sind die entsprechenden Bücher zu abstrakt und unverständlich geschrieben. </p>  <p>Aber damit ist jetzt Schluss: Dieser Kurs ist die erste praktische Gebrauchsanleitung, die dich Schritt für Schritt von der ersten bis zur letzten Seite deiner wissenschaftlichen Abschlussarbeit führen wird. </p>  <p>Ich erkläre dir in klaren und einfachen Worten, wie du in 8 Schritten von der Forschungsfrage bis zu deiner fertigen Abschlussarbeit kommst und sie bald durch den Druck schicken kannst. </p>  <p>Du erfährst, wie du deine Angst vor dem „Ungeheuer Diplomarbeit“ überwinden, Schreibblockaden durchbrechen und dich auf Knopfdruck zum Schreiben motivieren kannst. Du bekommst effektive Arbeitstechniken, um den Prozess des Schreibens zu beschleunigen, sowie die richtige Einstellung, die dich schlussendlich zu deinem Titel führen wird. </p>  <p>Auf alle Fragen und Probleme, die beim Schreiben deiner wissenschaftlichen Abschlussarbeit auftauchen werden, findest du klare Antworten und praxiserprobte Lösungen in diesem Kurs: „Wie zitiere ich richtig? Wie verhindere ich ein Plagiat? Wie schreibe ich ‚wissenschaftlich‘? Wie komme ich schnell und zeitsparend zu Büchern und Quellen? Wie finde und formuliere ich eine geeignete Forschungsfrage? Wie schreibe ich eine gelungene Einleitung/einen gelungenen Schluss? Wie schreibe und gliedere ich den Hauptteil meiner Arbeit?“ Usw.“ Zusätzlich erhälst du als Bonus das komplette Regelwerk des Harvard-Zitiersystems, das Exposé meiner eigenen Diplomarbeit als Vorlage für dein Exposé sowie die 15 Stilregeln des wissenschaftlichen Schreibens für eine flüssige Argumentation, die sich gut lesen lässt. </p>  <p>Dieser Kurs ist nicht aus der Sicht eines Professors geschrieben worden, der von der Höhe des Podiums mit abstrakten Definitionen um sich wirft. Er stammt aus der Sicht eines erfahrenen Korrekturlesers, der regelmäßig mit Studentinnen und Studenten zusammenarbeitet und früher selbst mit dem „Ungeheuer Diplomarbeit“ kämpfen musste. </p><p>Die Lektionen sind heruntergebrochen auf die Probleme und Bedürfnisse von Studierenden, die sich eine einfache und wirkungsvolle Schreibanleitung wünschen. Sie beinhalten 10 effektive Aktionsübungen, die du sofort anwenden kannst, um deine eigene Arbeit zu schreiben - 5 davon sind absolute Geheimwaffen im Kampf um deinen akademischen Titel! Von der ersten bis zur letzten Seite führe ich dich Schritt für Schritt durch den Dschungel deiner Bachelor-, Master- und Diplomarbeit, motiviere dich konsequent zum Schreiben und helfe dir, deine wissenschaftliche Abschlussarbeit abzuschließen und so wie viele andere, denen ich vor dir bereits helfen konnte, endlich fertig zu werden! </p><p><br></p>", 
    "end_date": null, 
    "title": "Wissenschaftliche Arbeiten schreiben in nur 8 Schritten", 
    "price": "50.00", 
    "instructors": "Mark Licz", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703042_56e2_2.jpg", 
    "course_url": "https://www.udemy.com/wissenschaftliches-arbeiten-schreiben-in-nur-8-schritten/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T16:25:53Z"
}