{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>The Christmas Truce of 1914 was a remarkable episode during World War I; a single fleeting moment of man's humanity, amidst the horrors of war. This course takes a detailed look at the truce, within the context of the social and political landscape at the time. It also considers the part that football may or may not have played during the truce and why it is that a football match has become the overriding symbol of the Christmas Truce in modern times.</p><p><strong>What Subjects Does the Course Cover?</strong></p><p>The course begins with a look at a number of the factors that ultimately led to World War 1 and then describes in turn the early months of the war, the phenomenon that was trench warfare, some of the other unofficial armistices throughout history and also early attempts at a truce, in the December of 1914.</p><p>The Christmas Truce itself is then discussed, looking at the events that took place on Christmas Eve, Christmas Day and Boxing Day, before examining the part that football may have played within the truce.</p><p>Finally, the legacy of the Christmas Truce is considered, especially in the context of the Centenary celebrations of 2014.</p><p><strong>What Learning Materials are Included within the Course?</strong></p><p>The course is broken down into 8 sections, comprising of over 30 lectures.</p><p>The majority of the lectures are video-based lessons, but there are also regular Did You Know snippets of interesting information and there is a multiple-choice quiz at the end of each section, so that you can test your knowledge as you go along.</p><p><strong>Why You Should </strong><strong>Take this Course?</strong></p><p>The course acts as an ideal supplementary learning material for pupils or students studying the history of World War One, whether at school or at university.</p><p>However, the course is also an excellent resource for anyone who has an interest in learning about the Fist World War or has a passion for history in general.</p>", 
    "end_date": null, 
    "title": "World War 1 - The Christmas Truce of 1914", 
    "price": "20.00", 
    "instructors": "David James Ault", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477426_413a.jpg", 
    "course_url": "https://www.udemy.com/christmastruce/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T19:55:40Z"
}