{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t         If you want to write fiction, then short stories are a great place to start and they can be a good source of income. This course will show you how to find ideas, how to put your stories together, and how to submit them to an editor.  </p>  <p>  \t       You'll learn the essential elements of short story writing such as plot and structure, dialogue, characterisation, setting, tense, viewpoint, and much more.  </p>  <p>  \t <strong>Why not give it a try? Sell one short story and the course will more than pay for itself!</strong></p><p>With over 1,500 students, this is my most popular course. Sign up today and learn the art of short fiction. <br></p><p><em>And don't forget that the course is backed by <strong>Udemy's 30 day money-back guarantee</strong>. If you're not completely satisfied, you can ask for a full, no-questions-asked refund - which means you've got absolutely nothing to lose by enrolling on the course TODAY.</em></p>  <p>During the course we'll look at:<br></p>  <ul>  \t<li>story openings</li>  \t<li>conflict</li>  \t<li>using flashback</li>  \t<li>creating characters</li>  \t<li>writing dialogue</li>  \t<li>viewpoint and tense</li>  \t<li>settings and description, and</li>  \t<li>how to end your story. </li>  </ul>  <p>  \t           You'll be able to download writing exercises, a list of current short story markets (including how much you can expect to be paid), lecture handouts, and short stories.  </p>  <p>  \t                   Towards the end of the course we'll look at one of the most important parts of the writing process - editing. You'll also get tips on proofreading, and how to prepare and submit your manuscript to fiction editors.  </p>  <p>  \t                   And in case you get struck down with it, we'll look at how to overcome writer's block.  </p>  <p>  \t                   The course will be delivered using video lectures, writing exercises, information sheets, stories to read, and a recap quiz.  </p>", 
    "end_date": null, 
    "title": "Writing Short Stories: The Essential Guide", 
    "price": "25.00", 
    "instructors": "Jane Bettany", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147260_e3f0_12.jpg", 
    "course_url": "https://www.udemy.com/write-short-stories/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-15T13:20:34Z"
}