{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>A <strong class=\"redactor-inline-converted\">step-by-step guide to writing outstanding academic essays </strong>for\n all types of university essay questions. Understand what it takes to write academically and supercharge your grades.</p>\n\n<p>**NEW** *By popular demand, we're adding lectures on referencing, in-text citations and plagiarism over the next couple of weeks in April/May 2016*</p>\n\n<p><strong class=\"redactor-inline-converted\">Course updated spring 2016!</strong><br></p>\n\n\n\n<p>Over 1000<strong class=\"redactor-inline-converted\"> students enrolled already</strong>!Join us and learn how to <strong class=\"redactor-inline-converted\">get the grades you deserve!</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Discover the Secrets of Writing Outstanding Academic Essays Using Proven Methods</strong></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Learn </strong>the dynamics of advanced academic writing</li><li><strong>Reference</strong> right every time and correctly for your needs</li><li><strong class=\"redactor-inline-converted\">Recognise </strong>all theessay types and structuresfor university study<strong class=\"redactor-inline-converted\"><br></strong></li><li><strong class=\"redactor-inline-converted\">Build </strong>a solid essay through proper planning and preparation</li><li><strong class=\"redactor-inline-converted\">Test progress </strong>through our free quizzes and downloads </li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Together, we'll go through every stage of academic writing from analysing the question to creating a well-crafted conclusion.</strong></p>\n\n\n\n\n\n\n\n<p>There\n are many benefits to knowing every aspect of academic writing, helping \nyou to power your way through your degree and project yourself \nsuccessfully into your future career. You will also be able to take \nthese skills into writing CVs, job applications and many aspects of your\n career beyond university.<br></p>\n\n\n\n<p>But mastering academic writing at \nuniversity can be tricky and complicated. That's why we've brought you this \ncourse to teach you how to approach your written university assignments and \nhow to communicate your ideas in an academic way. From thesis statements\n to topic sentences, all is explained inside.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Content and Overview</strong></p>\n\n\n\n<p>This\n course contains more than 10 lectures with over 2 hours of content. \nIt's designed for those studying at university level or preparing to do \nso, or for students of age 15 and over looking to improve their grades \nfor written work and projects.</p>\n\n\n\n<p>In this course, you will learn every aspect of academic writing and how to create an excellent essay.  </p>\n\n\n\n<p>You'll\n also learn how to write the perfect plan, thesis statements, topic \nsentences and other elements to tackle any question that comes your way.</p>\n\n\n\n<p>By the end of this course, you'll have the essential skills that will help you quickly analyse and answer complex questions, regardless of what level you are when you start. You'll know how to produce the right type of essay to boost your grades.</p>\n\n\n\n<p>You'll also receive bonus free downloads and quizzes to check your progress and reinforce concepts you've learned along the way. With these lessons, you'll find that you're able to analyse, plan and produce an outstanding academic essay in a short period of time.<br></p>", 
    "end_date": null, 
    "title": "Write Better College Papers: Improve Your Grades Today!", 
    "price": "20.00", 
    "instructors": "Stephen Beale, Stuart Beale", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552408_8790_3.jpg", 
    "course_url": "https://www.udemy.com/academic-writing-skills-for-university/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T10:30:42Z"
}