{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong style=\"\">Fancy earning a second income as a freelance writer?</strong> This course shows you how to create topical non-fiction articles and fillers that you can sell to magazine editors and other markets.  </p>  <p>  \t        During the lessons you&#039;ll learn how to find ideas for your articles, and use your knowledge and experience to tap into a wide variety of magazine markets. The course guides you through the process of planning, researching and writing an article, and explains the importance of editing and proofreading. It teaches you exactly how to submit your work to an editor, and includes examples of how to lay out your typescript, create a cover sheet and write a query letter - in fact, everything you need to start your career as a freelance writer!  </p>  <p>  \t            The course will teach you the essential elements of writing non-fiction and help you identify writing opportunities and markets in which you can sell your work.  </p>  <p>  \t<strong style=\"\">      Sign up for this course now to get your freelance career started. Go on to sell just ONE article, and the course will more than pay for itself!  </strong>  </p>  <p>  \t<em style=\"\">And don&#039;t forget that the course is backed by Udemy&#039;s 30 day money-back guarantee. So, if you&#039;re not completely satisfied, you can ask for a full, no-questions-asked refund. You&#039;ve got absolutely nothing to lose by enrolling on the course TODAY.</em>  </p>  <p>  \t            During the course we&#039;ll look at:  </p>  <ul style=\"\">  \t<li style=\"\">finding ideas</li>  \t<li style=\"\">finding markets for your work</li>  \t<li style=\"\">pitching a topic to multiple markets</li>  \t<li style=\"\">commissioned articles, unsolicited manuscripts and query letters</li>  \t<li style=\"\">types of non-fiction</li>  \t<li style=\"\">planning and researching your article</li>  \t<li style=\"\">making a start and moving it on</li>  \t<li style=\"\">creating sidebars</li>  \t<li style=\"\">the importance of photography and images</li>  \t<li style=\"\">editing your work</li>  \t<li style=\"\">proofreading tips</li>  \t<li style=\"\">how to submit your work to an editor</li>  \t<li style=\"\">how to develop a writing routine.</li>  </ul>  <p>  \t            The course includes 17 videos and numerous downloadable writing exercises and handouts, plus a list of some of the current non-fiction markets.  </p>  <p>  \t          I hope to welcome you as a student. Please get in touch if you have any questions about the course.  </p>", 
    "end_date": null, 
    "title": "Writing Non-Fiction: The Essential Guide", 
    "price": "25.00", 
    "instructors": "Jane Bettany", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289660_4308_6.jpg", 
    "course_url": "https://www.udemy.com/writing-non-fiction/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T16:00:43Z"
}