{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Tell Your Story Today...</strong>  </p>  <p style=\"\">  \t Isn&#039;t it time you finally told the story inside your heart?  Within this course I will explain how to organize and begin writing a short story, novella, or novel.  The concepts are the same for each form. The number of balls you need to keep in the air and for how long is the only thing that differs.  </p>  <hr style=\"\">  <p style=\"\">  \t <em style=\"\">If I don&#039;t write to empty my mind, I go mad.</em><br style=\"\">  \t -- Lord Byron  </p>  <hr style=\"\">  <p style=\"\">  \t <strong style=\"\">Learn the Components of Successful Storytelling...</strong>  </p>  <p style=\"\">  \t Plot, character, and place.  Learn how to juggle them all like a professional. Learn how to discipline yourself to put the first words on the page.  Learn the even greater discipline required to put the last words on the page.  </p>  <hr style=\"\">  <p style=\"\">  \t <em style=\"\">The thing about writing is that you never stop learning and improving your craft, and a review of the basics is helpful even to an established, USA Today bestselling author like myself. Jackson&#039;s deceptively simple course on writing a first novel is concise, and covers crucial points that every writer should know and constantly keep in mind. I especially enjoyed his advice on handling writer&#039;s block and its causes; I am guilty of reason #3. Sigh. A useful course, even for those who think they don&#039;t need it.</em><br style=\"\">  \t -- Lisa Cach, USA Today Bestselling author of the &quot;1,001 Erotic Nights&quot; series  </p>  <hr style=\"\">  <p style=\"\">  \t <strong style=\"\">For the Storyteller, There is no Greater Joy...</strong>  </p>  <p style=\"\">  \t All your life, you&#039;ve carried this story with you.  Perhaps uncertain or fearful of rejection. But there is no burden greater than carrying an untold story.  </p>  <hr style=\"\">  <p style=\"\">  \t <em style=\"\">A non-writing writer is a monster courting insanity.</em><br style=\"\">  \t --Franz Kafka  </p>  <hr style=\"\">  <p style=\"\">  \t <strong style=\"\">Your All in One Source for the Inspiration and Technique Required to Tell Your Story...</strong>  </p>  <p style=\"\">  \t This is your call to arms.  Tell your story now before it&#039;s lost forever...  </p>", 
    "end_date": null, 
    "title": "Write: Basic Creative Writing Skills for Beginners (2016 Ed)", 
    "price": "20.00", 
    "instructors": "Author/Publisher Brian Jackson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259292_9ba6_4.jpg", 
    "course_url": "https://www.udemy.com/writenow/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T21:58:49Z"
}