{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">OVER 1,500 STUDENTS ENROLLED IN THE FIRST WEEK!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">UPDATED TO INCLUDE DOWNLOADABLE MP3s OF LECTURES</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <hr style=\"\">  <p style=\"\">  \t    Do you have a story idea inside you that you&#039;re dying to write, but you&#039;re not sure where to start?  </p>  <p style=\"\">  \t                                                                                                       Are you already writing a novel, but the story has become too complicated and you don&#039;t know how to make progress?  </p>  <p style=\"\">  \t                                                                                                       Maybe you already have your own novel outlining process, but you simply want to improve it?  </p>  <p style=\"\">  \t                                                                                                       Or ... it&#039;s possible you don&#039;t even have a story idea yet, but you just <em style=\"\">love</em> the thought of writing a novel.  </p>  <p style=\"\">  \t<strong style=\"\">Well, in this novel outlining course, you&#039;ll learn how to:</strong>  </p>  <ul style=\"\">  \t<li>Generate story ideas and expand them into a complete book outline <em style=\"\">from SCRATCH!</em></li>  \t<li>Weave plot lines together with such intricacy it will blow your readers&#039; minds</li>  \t<li>Create vivid story locations that will transport your readers into your story world</li>  \t<li>Create fully developed characters your readers will love (or love to hate!)</li>  \t<li>Implement BONUS outlining tips that will forever change your writing process</li>  \t<li>Gain confidence in your writing by effectively outlining your story first</li>  </ul>  <p style=\"\">  \t<strong style=\"\">It doesn&#039;t matter if you&#039;re a beginner, intermediate, or advanced writer.</strong>  </p>  <p style=\"\">  \t                                                                                               It only matters that you&#039;re interested in outlining an intricate story that will wow your readers. On top of that, learning to effectively outline your novel means that when it comes to writing your book, you will <u style=\"\">write it faster</u>, <u style=\"\">write it better</u>, <u style=\"\">it&#039;ll need less revision</u>, and … best of all, <em style=\"\"><u style=\"\">you&#039;ll get it published sooner! </u> </em>  </p>  <p style=\"\">  \t                                                                     And this course has so much content in a wide variety of formats:  </p>  <p style=\"\">  \t                                                             Video presentations, audio lectures, and screen-captured video. Plus, there are loads of downloadable files to supplement your  learning. There&#039;s even a FREE Scrivener template, so that if you&#039;re a Scrivener user you can benefit from the exact template I use for outlining my novels! But don&#039;t worry, if you&#039;re not a Scrivener user, you can still take this entire course.  </p>  <p style=\"\">  \t<strong style=\"\">By the end of this novel outlining course, you&#039;ll feel ready to write your own novel.  </strong>  </p>  <p style=\"\">  \t                                                                                                       And if for some reason you&#039;re not satisfied, you get a <em style=\"\">30-DAY MONEY BACK GUARANTEE</em>. So, you can enroll in this course assured with the knowledge that if it&#039;s not what you expected, you can get a full refund. No questions asked.  </p>  <p style=\"\">  \t                                                                   So, what are you waiting for? Enroll now and start outlining your novel today.  </p>  <p style=\"\">  \t                                                                           I&#039;ll see you inside the course. =)  </p>  <p style=\"\">  \t                                                   - Andrew Butcher<br style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Write a Novel Outline from Scratch (Novel Writing Success)", 
    "price": "20.00", 
    "instructors": "Andrew Butcher", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374962_6037_16.jpg", 
    "course_url": "https://www.udemy.com/creative-writing-success-write-a-novel-outline-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-21T12:37:07Z"
}