{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>In this course you will learn everything you need to know to develop twist plots that you can use in short stories or in a novel. </strong></p><p>Twist stories can be a very lucrative form of writing, and they are also great fun to write. <em>Write Stories With a Twist</em> covers all of the techniques and tips you will need for success. By the end of the course you will understand exactly how twist plots work and be in a position to create twist stories of your own. </p><p>Here's what you'll learn in the course:</p><ul><li>Why twist stories are so lucrative.</li><li>The importance of researching the writing markets for twist stories</li><li>The six types of twist: the Unreliable Narrator, Reversal of Identity, Reversal of Motive, Reversal of Perception, Reversal of Achievement, and Reversal of Fortune.<span></span></li><li>We will analyse several story examples, including <em>The Gift of the Magi</em> by O Henry and <em>The Necklace</em> by Guy de Maupassant.</li><li>How to create a twist, and then twist again.</li><li>Building on your initial twist idea.</li><li>Creating a story outline.</li><li>How to sow clues in your story.</li><li>The way to misdirect your readers.</li><li>Plots and storylines to avoid.</li><li>Novel v short story.</li><li>Editing your work.</li><li>Proofreading tips (with a proofreading exercise to test your skills).</li><li>Discover how to submit your work to an editor, publisher or agent.</li><li>And finally, complete an end of course quiz.</li></ul><p>There's also a glossary and recommended reading list with the course. </p><p>You’ll learn by listening to lectures, completing writing exercise and reading downloadable handouts and other materials. You’ll <em>apply</em> the things you learn in the lectures by reading and analysing stories to find out how they have been put together. </p><p><strong>Quite simply, this course has everything you need to learn how to write stories with a twist.</strong></p><p>And of course it comes with Udemy's 30-day money back guarantee - so if you're not completely satisfied with the course, you can ask for your money back, no questions asked. So what have you got to lose?</p><p>The course is taught by a qualified writer with over 25 years of fiction writing experience. </p>", 
    "end_date": null, 
    "title": "Write Stories With a Twist", 
    "price": "25.00", 
    "instructors": "Jane Bettany", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/291674_be76_4.jpg", 
    "course_url": "https://www.udemy.com/write-stories-with-a-twist/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-01T13:24:30Z"
}