{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Have you ever struggled with writer's block or the dreaded \"fear of the blank page?\" Or would you like to make writing a more enjoyable, less frustrating endeavor?</p><p>Christopher Mitchell will show you how to overcome these writing frustrations as you learn how to turn your memories into memoirs in this course jam-packed with great information. </p><p>In \"Writing Without Fear: Using Life Writing to Free the Writer Within You,\" he introduces the five stages of the writing process: prewriting, drafting, revision, editing, and publishing.</p><p>For the class project, you will write a memoir that can be shared with fellow students if you feel comfortable doing so.</p><p>Throughout the course, you will learn tried-and-true techniques that will jumpstart any writing hobby or project.</p><p>In this course, you will:</p><p><strong>(1.) use the writing process to develop and write a memoir;</strong></p><p><strong>(2.) discuss prewriting techniques to overcome writer's block and let writing come naturally to you;</strong></p><p><strong>(3) utilize \"sloppy first drafts\" to begin shaping your memoir;</strong></p><p><strong>(4) discuss and utilize revision techniques to better understand the need to \"re-see\" the draft;</strong></p><p><strong>(5) edit for clarity and understanding;</strong></p><p><strong>(6) consider ways to publish your memoir: perhaps on a blog or as part of a family history project.</strong></p><p>The writing process has five stages that we will work through. You should upload any part of the project you feel comfortable sharing with others.</p><p>Christopher is an experienced writer and writing instructor with more than ten years of hands-on, classroom teaching experience. Join him today in this eleven-video, 55-minute course and learn to overcome these common writing fears and frustrations. </p><p>Join us today!</p>", 
    "end_date": null, 
    "title": "Writing Without Fear: Learn to Overcome Writing Roadblocks", 
    "price": "20.00", 
    "instructors": "Christopher Mitchell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753858_85ef_2.jpg", 
    "course_url": "https://www.udemy.com/writing-without-fear/", 
    "currency": "USD", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T22:14:03Z"
}