{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Добро пожаловать в курс Освещение многообразия!</strong></p><p style=\"\">Данный курс учит как правильно освещать  этническое, языковое и культурное многообразие в медиа-текстах, что в  итоге направлено на установление понимания и терпимости<strong style=\"\"> </strong>в обществе, где есть место для споров и разногласий, но основной ценностью является<strong style=\"\"> </strong>уважение к различиям<strong style=\"\"> </strong>между людьми, группами и общинами. Если люди не находят себя в СМИ, не видят там свое отражение, они не смогут считать себя частью общества в котором живут. Если журналисты стремятся к освещению проблем всего общества, то они должны делать репортажи и статьи, отражающие жизнь всех членов этого общества. Новейшая мировая история показывает, что освещение политики властей, без предоставления права голоса разным мнениям об этой политике привело к расцвету расизма, этнической и религиозной нетерпимости во многих странах мира. Изучив данный курс вы поможете аудитории лучше понять традиции, потребности и особенности граждан из различных этнических сообществ, живущих среди них. Вопрос о том, как  создавать истории на чувствительную тематику и описать этнические, языковые, культурные группы в новостях, статьях и сюжетах является одним из наиболее обсуждаемым и наименее понятных тем в журналистике.</p><p style=\"\"> <strong style=\"\">Этот Курс Научит Вас Работать По Высоким  Стандартам Журналистики :</strong></p><ul style=\"\"><li style=\"\">соблюдать точность;</li><li style=\"\">искать справедливость;</li><li style=\"\">использовать ясность и корректность;</li><li style=\"\">преодолевать язык вражды в статьях и репортажах;</li></ul><li style=\"\">определять, какие элементы необходимы для написания истории на тему языкового, этнического и культурного многообразия;</li><li style=\"\">выбирать инструменты, которые понадобятся для сбора информации; работать с источниками информации при освещении чувствительных вопросов;</li><li style=\"\">освоите новые командные подходы в освещении многообразия;</li><li style=\"\">научитесь использовать язык многообразия, избегая враждебного дискурса;</li><li style=\"\">узнаете, как организовать работу журналиста в зоне конфликта и других экстремальных ситуациях;</li><li style=\"\">получите инструментарий по освещению этнических конфликтов;</li><li style=\"\">научитесь относиться к многообразию в нашей жизни как к источнику силы и надежды, духовного обогащения и интереса;</li><p style=\"\">Уникальность курса состоит в том, что большая часть учебных материалов и упражнений базируется на реальных примерах из местных медиа, что повышает понимание лекций студентами. Курс покрывает две большие темы: освещение многообразия в мирное время и в период конфликта.</p><p style=\"\"><strong style=\"\">Лекции </strong>о терминологии и аспектах многообразия в нормативно-правовой базе Кыргызстана, помогут студентам лучше ориентироваться в современном законодательстве, использовать правильную терминологию в репортажах и статьях на этническую тематику. Упражнения на редактирование текстов сопровождаются дополнительными тестами, пометками и комментариями преподавателей и построены таким образом, чтобы студент мог вовлекаться в процесс редактирования используя обратную связь. Каждое упражнение и тест завершается демонстрацией  правильного варианта, что поможет ученику проверить свою работу. В учебном цикле вы также найдете инновационные решения о том, как построить мультинациональную журналистскую команду и начать создавать совместные репортажи, работать с источниками в этнических общинах, создавать многообразие в редакциях. Вам будут предложены модели стратегий и контрольные вопросы для самооценки. Блок лекций, касающийся освещения многообразия в конфликтный период обучит репортеров техникам работы в зоне конфликта. Мы предлагаем студентам несколько упражнений основанных на мозговых штурмах и критическом мышлении, которые рекомендуют погрузиться в ситуацию и выработать собственные стратегии. Тесты самоконтроля помогут вам выбрать правильные решения.</p><p style=\"\"><em style=\"\">Данный курс разработан тренерами и экспертами Школы миротворчества и медиатехнологий в Центральной Азии в рамках проекта &quot;Поощрение многообразия через СМИ&quot; при финансовой поддержке Программы Свобода информации Фонда «Сорос Кыргызстан». При составлении курса мы также использовали тренинговые материалы по миротворческой журналистике и семинаров по разрушению этнических стереотипов, подготовленных нашими тренерами А.Меликяном (Армения) и А.Алиевым (Азербайджан), учебный курс медиа-эксперта Э.Френкеля (Испания) созданный для наших семинаров &quot;Производство командных репортажей&quot;, тренинги И.Сикорской &quot;Освещение многообразия в зоне конфликта&quot;, &quot;Преодоление языка вражды в публичном дискурсе&quot;,&quot;Медиа-грамотность в цифровую эпоху&quot;, созданные в рамках Программы по сокращению потенциала для возобновления этнического конфликта в 2010-2013 годах, а также материалы Лагеря медиа-инноваций, разработанные нашей командой в 2013 году и лекции из учебного курса &quot;Повышение навыков журналистов для освещения многообразия&quot;, который мы проводили в 2014 году.</em></p>", 
    "end_date": null, 
    "title": "Освещение многообразия ", 
    "price": 0, 
    "instructors": "Mrs.  Inga Sikorskaya", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452172_d2d7_2.jpg", 
    "course_url": "https://www.udemy.com/httpswwwudemycomdraft452172instructorpreviewmodestudent/", 
    "subject_name": [
        "Humanities"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T13:18:49Z"
}