{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">Instructor Info</strong></em>  </p>  <p>  \t   Corazon Bryant always had an artistic bone in her body. When she was  only 2 years old, she would make detailed drawings on her mother&#039;s wall.  Her mother loved the drawings so much, she decided to keep them. With  the encouragement of her mother, she continued drawing and she only got  better as time when by. When Corazon was in middle and high school, she  earned money making portraits for her classmates and even for her  teachers. She pursued a college degree in Media Arts &amp; Animation and  later worked for architectural and entertainment companies such as Camm  Productions, ID DI Design, and PDT International. She also had an  opportunity to do some freelance work for Mega Pickle Entertainment.  While working as a 3D artist, she had a chance to teach 3D animation  classes in an A+ school. This is when she found her true love - which is  not only to talk about 3D endlessly but to also inspire greatness in  young upcoming artists. Corazon is currently working on a new project  called Victory 3D with fellow industry-experienced artists to provide an  affordable and effective learning system that will make it easier for  students to get a job in the 3D industry.  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Course Info</strong><br style=\"\">  </p>  <p>  \t  In this 3-hour video course, Corazon Bryant will go over different types of tools that you can use to retopologize your character. You will first start by understanding the purpose of retopologizing and learning the kind of geometry structure that is needed to create an animatable mesh. You will gain knowledge on how to use Zremesher to create a clean topology for your character. You will learn how to control the flow of your geometry and manage the amount of polygons that is suitable for games. You will also gain insight on how to utilize the Topology brush and Zsphere Topology tool to create accurate topology for your needs. By the end of this course, you will acquire the skills to be able to turn your high res sculpt into an animation-ready low res character. So get your detailed Zbrush ready and it&#039;s time to have some fun!  </p>", 
    "end_date": null, 
    "title": "3D Character Creation: Retopologizing For Animation - Zbrush", 
    "price": "20.00", 
    "instructors": "Victory 3D", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265804_d7c1_3.jpg", 
    "course_url": "https://www.udemy.com/retopologizing/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T17:02:33Z"
}