{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course you will learn how to make and animate 3d pixel characters just like in the MineCraft game.</p><p>This course is meant for non-artists. Did you know you don't have to be an artist to be able to make great 3d characters? I've got a secret weapon to show you.  you will be able to animate your characters in no time and get animations just like in professional games </p><p>You will learn how to use free tools to make amazing characters such as the Spiderman, Ironman and Wonder-Woman, Superman*.</p><p>You will also learn how to animate them in no time.</p><p>Then you will learn how to add all these characters in the game engine called Unity 3d to make amazing 3d games, just like MineCraft.</p><p>Now, this course is meant to make things super easy for you. All the steps are shown to you in the video lectures, so you cant possibly miss a step.</p><p>And by the way as a bonus, this course includes free downloads of all the finished 3D characters, with their animations, and all the Unity projects as well.</p><p>The skills you will learn in this course can be applied to so many projects. Invest in yourself by joining this course now</p><p><strong>Important: </strong>all software used are FREE to download and use on PC and MAC computers (no need to pay, cheers!)<br></p><p><strong>What is 3D Pixel Art?</strong><br></p><p>3D Pixel art is a form of digital art, created through the use of 2D-like raster graphics software, where images are edited on the pixel level in the form of blocks. Graphics in most old (or relatively limited) computer, console, graphing calculator and mobile phone video games are mostly 2D pixel art, and now we use the new technologies t have the retro-cool style with the amazing functionality that 3d technology provides.</p><p><strong>Note:</strong> This course is great to take as a combination with the 3D Pixel art - Crossy Road modeling course.</p><p>* For educational purpose only</p><p><br></p><p><strong>Note: </strong><span>This is the second course in a series to enable you to make amazing mobile games on your own. If you want to make progress, it is recommended to also take my other course on how to make 3D pixel characters and objects like in the Crossy Road or MineCraft games and how to use them un Unity 3D game engine.</span></p><p><span>Then it is recommended to follow with the course on how to design, build, program and publish a Crossy Road like game to the app stores using Unity 3D.</span></p><p><span>By taking these courses, you will have a solid set of skills to get you to create professional games and can either become a solo entrepreneur or get hired by AAA game studios. </span></p><p><span>Enjoy!</span></p><p><br></p>", 
    "end_date": null, 
    "title": "3D Pixel Characters Modeling & Animations for all. Unity 3D", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676088_1c1a.jpg", 
    "course_url": "https://www.udemy.com/3d-pixel-characters-modeling-animations-for-all-unity-3d/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T00:57:51Z"
}