{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "  \t  \t  \t  \t\t<p style=\"\">  \t\t\t<span style=\"\"><span style=\"\">In this complete Animation in UDK tutorial, we break down everything you need to know about setting up and importing Animations into UDK! We cover the complete animation pipeline with our Thief girl character, import her animations, and even setup a dynamic cut-scene! If you&rsquo;ve ever wanted to bring your characters and animations to life in UDK, this series is for you!</span></span></p>  \t\t<hr style=\"\" />  \t\t<p style=\"\">  \t\t\t<span style=\"\"><span style=\"\"><u style=\"\"><strong style=\"\">About the Instructor:</strong></u></span></span></p>  \t\t<p style=\"\">  \t\t\t<span style=\"\"><span style=\"\">Justin Harrison is a Character and Technical Animator with more than 7 years experience in the game development industry. Currently, he is working for Molten Games in Del Mar, CA on an unannounced title. Previously he has worked for for both Activision and Sony on titles such as The Bourne Conspiracy, Ghostbusters: The Game, as well as Transformers: War for Cybertron to name a few. Justin holds a BFA in Digital Art and Animation from the College for Creative Studies, and has a generalist skill set that ranges from artistic modeling and asset creation, to motion capture and keyframe animation, to technical rigging and character setup.</span></span></p>  \t    ", 
    "end_date": null, 
    "title": "Animation and Matinee in UDK", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/83764_8a2f_3.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-animation-and-matinee-in-udk/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-26T01:52:39Z"
}