{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><span>//////////////////////////////////////////////////////////////////////////////////////////////////////</span></p>    <p><strong>Maybe you've just come up with a great new idea.</strong></p>    <p><strong>Perhaps you've always been curious how video games are made or wanted to learn how to make them yourself. </strong></p>    <p><strong>Maybe you're feeling a little intimidated and not sure where to begin. </strong></p>    <p>//////////////////////////////////////////////////////////////////////////////////////////////////////<br>  </p>    <p><span>Find out how my course has <strong>helped over 2300 students successfully learn</strong> to make games with Unity 3D and made this the <strong>most popular Unity course on Udemy!</strong></span></p>    <p>//////////////////////////////////////////////////////////////////////////////////////////////////////<br>  </p>    <p><span>Imagine being able to take your game ideas and make them a reality. </span></p>    <p><span>Picture your games bringing joy and entertainment into the lives of people from around the world. </span></p>    <p><span>What would it be like to have your games running on over 1 billion mobile devices?</span></p>    <p>//////////////////////////////////////////////////////////////////////////////////////////////////////<br>  </p>    <p><span><strong>Hi, I'm Richard Hart. </strong></span></p>    <p><span>I'm a professional interactive developer and technology instructor with over a decade of experience. I started my first game studio in 2007 because I believed that gaming can change the world.</span></p>    <p><span>I created this course because I wanted to make gaming accessible to anyone who wants to learn, regardless of their previous background.</span></p>    <p><span>I've literally taught <strong>thousands of students</strong> how to master technology and I can teach you too.</span></p>    <p><span>In my <strong>unique course</strong> aimed at <strong>complete beginners</strong>, I'll take you <strong>step by step</strong> through the game making process and show you how to unlock the power of Unity 3D.</span></p>    <p><span>I chose Unity 3d because <strong>I believe that it's not only the easiest game development platform to learn</strong>, but also <strong>the most powerful and relevant platform in the industry</strong> for people who want to create 3D games or Mac, PC, and iOS and Android mobile devices. </span></p>    <p><span>Did you know you can <strong>download Unity 3D for free today</strong> by visiting</span> unity3d. <span>Unity runs on both Macs and PCs, so no need to choose sides, use the version that works best for you!</span></p>    <p><span>While I'm teaching you the basics of Unity, I also be revealing the fundamentals of what games are made of and begin to show you how to harness the real power of play in your games.</span></p>    <p><span>When you sign up, you'll get instant access to a growing library of <strong>over 70 high definition video tutorials</strong>, not to mention <strong>full source code examples</strong> you can download and try out right away.</span></p>    <p><span><strong>Here's what you'll get instant access to when you sign up!</strong></span></p>    <p><span>//////////////////////////////////////////////////////</span></p>    <p><span><strong>In my Unity 3D tutorials you'll learn things like:</strong></span></p>    <p><span>//////////////////////////////////////////////////////</span></p>    <p><span>-Downloading and installing the amazing Unity 3D</span></p>    <p><span>-How to use the powerful MonoDevelop code editor</span></p>    <p><span>-How to create and use Prefabs to save time and effort</span></p>    <p><span>-How to add basic physics to your game like gravity</span></p>    <p><span>-How to add basic mouse interaction to your game</span></p>    <p><span>-Adding collision detection to your game objects</span></p>    <p><span>-Adding audio into your games</span></p>    <p><span>-Creating and loading new game levels</span></p>    <p><span>-Publishing your game to Mac, PC and the Web</span></p>    <p><span>-Storing and recalling game data</span></p>    <p><span>I'll also <strong>walk you through the entire process of creating of 2 simple games</strong> , step by step, so you can see how everything ties together.</span></p>    <p><span>-Learn the basics of the powerful C# programming language</span></p>    <p><span>//////////////////////////////////////////////////////////////////////////////////////////////////////////</span></p>    <p><span><strong>Bonus Sections</strong></span></p>    <p><span>//////////////////////////////////////////////////////////////////////////////////////////////////////////</span></p>    <p><span><strong>In the bonus sections you will:</strong></span></p>    <p><span>-See how to set up a 3D character controller</span></p>    <p><span>-Create and use basic particle systems</span></p>    <p><span>-Build amazing terrains it less time than you every thought possible</span></p>    <p><span>-Learn about the Unity Asset Store as a way to acquire content or make money</span></p>    <p><span>-Learn about how to Auto rig character meshes with Mixamo</span></p>    <p><span>-Start to create better User Interfaces with NGUI</span></p>    <p><span>-Create and import Unity packages</span></p>    <p><span>-And learn more about the craft of creating good games.</span></p>    <p><span>//////////////////////////////////////////////////////////////////////////////////////////////////////////</span></p>    <p><span>While your having fun, you'll be learning <strong>real skills</strong>, using <strong>real tools</strong> and making <strong>real games</strong> that you can <strong>share</strong> with the world.</span></p>    <p><span>There are lot's of game courses out there, but if your looking for something a little different, <strong>something that goes way beyond just explaining tools and technology</strong>, this is the course for you.</span></p>    <p><span>But don't just take my word for it, check out <strong>over 70 course</strong> reviews my students have written so far and find out why they've made this one of the most popular game courses on Udemy.</span></p>    <p>//////////////////////////////////////////////////////////////////////////////////////////////////////<span><em><br>  </em></span></p>    <p><span><em>\"This course was great to get into Unity and learn the basics and get a foundation to start making games with Unity. Everything is explained clearly, and the tools and information are given to you to keep learning yourself and expand after the course is over. I would recommend to anyone that is starting off in Unity!\"</em></span></p>    <p>//////////////////////////////////////////////////////////////////////////////////////////////////////<span><em><br>  </em></span></p>    <p><span><em>\"I was impressed with just the first few classes, and Richard Hart keeps adding more material to keep push the limits. Amazing effort and great value.\"</em></span></p>    <p>//////////////////////////////////////////////////////////////////////////////////////////////////////<span><em><br>  </em></span></p>    <p><span><em>\"I was afraid of Unity until I started this course, thinking it will be very hard to grasp. This course gave me that extra push, helping me a lot with making me interested in further researching Unity and how it works. In my particular case, this course was the best Ive found for starting up using Unity, having in mind the fact that I already know programming concepts and a little of C#.\"</em></span></p>    <p>//////////////////////////////////////////////////////////////////////////////////////////////////////<span><em><br>  </em></span></p>    <p><span>Finally, I'm so convinced I can help you learn to make games with Unity, that I'll put my money where my mouth is. Udemy has a <strong>30 day money back guarantee</strong>. So sign up, go through my entire course, watch all the videos, try all the code samples, and if in the first 30 days you find this course hasn't taught you the basics of making games with Unity 3D, just contact Udemy and request a refund. It's that simple.</span></p>    <p><span><strong>So if you really want to learn to make games, sign up and start learning today!</strong></span></p>", 
    "end_date": null, 
    "title": "Anyone Can Learn to Make a Game", 
    "price": "35.00", 
    "instructors": "Richard Hart", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33985_af48_3.jpg", 
    "course_url": "https://www.udemy.com/unity-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-31T19:50:00Z"
}