{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>If you are serious about becoming a game designer, then you already know that you need the most current and complete game design training possible. To succeed in this competitive industry it is essential to have an expert knowledge of the entire game development pipeline. Whether it's your goal to work for a major game studio, or to develop and publish your own indie games, one thing is clear, you will need to be well trained as both a programmer and an artist.<br><br><br>Throughout this extensive training series you will learn beginner to expert level techniques in the areas of 3D game development (Unity3D), computer animation, digital painting, and programming.</p><p><br><br>You will be learning expert techniques and workflows from veterans who have been working in the game industry for over 15 years and have a passion for making great games.<br><br><br>You will be extensively trained on programs like <strong>Unity3D</strong>, <strong>Maya</strong>, <strong>3DS Max</strong>, <strong>Mudbox</strong>, and <strong>Photoshop</strong>. Learning powerful tools like these are made easy with fun projects that are designed to take the fear out of learning such advanced software like Unity3D.<br><br><br>Your training will start with Unity3D, which is a powerful game engine that has been used by countless studios and indie developers all over the world to build some amazing games. Unity's intuitive and user friendly interface is an excellent place to start your path to becoming a game designer. You will start by learning the fundamentals of Unity3D, giving you a great foundation for you to get excited and confident to move on to more advanced Unity projects which will have you building incredible worlds. In addition to mastering the Unity interface you will be learning how to code in the c# programming language, letting you create any 2D or 3D your imagination can come up with.</p><p><br><br>After you have mastered the Unity3D game engine it is time to move on and learn how to create your own game assets.</p><p><br><br>You will be using programs like Maya and 3DS Max to model, texture, animate, and render complex 3D models and scenes. And once again you will start of with the basics learning how to create simple low poly models before moving on to advanced digital sculpting techniques in programs like Mudbox. You will then learn how to transfer your 3D models and animations into Unity3D for game assembly.</p><p><br><br>Finally, you will be moving on to the digital painting section of this master series, where you learn how to digitally paint fantasy worlds, creatures, and characters. And just like all of our previous sections in this master series, you will start off by learning the basics with fun project based lessons, before moving on to more intermediate and advanced digital painting. Even if you feel you don't possess any kind of drawing skills, you need not to fear as this digital painting portion of your training is designed to once again take you from absolute beginner all the way to an advanced level.</p><p><br><br>You have a lot of exciting things to start learning and we are excited to be your guides along the way!<br></p>", 
    "end_date": null, 
    "title": "Become a Game Designer : The Complete Master Series", 
    "price": "45.00", 
    "instructors": "School of Game Design", 
    "commitment": "70 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526534_04bb_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-game-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-12T03:10:27Z"
}