{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t In this complete Intro to GameMaker: Studio Course, instructor Alan Thorn takes us through the entire process of building an old-school, side-scrolling shooter game from start to finish! We'll cover everything you need from the ground up - all the way from first opening the software to deploying the game for iOS, Windows, or other mobile platforms! If you love retro, old-school video games, or are just interested in learning how to make your own, this course is for you!</p><p><strong>(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong><br></p><p>More about the Instructor:</p><p>Alan Thorn is a game developer, author and educator with 15 years industry experience. He makes games for PC desktop, Mobile and VR. He founded 'Wax Lyrical Games' and created the award-winning game 'Baron Wittard: Nemesis of Ragnarok', working as designer, programmer and artist. He has written sixteen technical books on game development and presented ten video training courses, covering game-play programming, Unity development, and 3D modelling. He has worked in game development education as a visiting lecturer for the 'National Film and Television School', as a Lead Teacher for 'Uppingham School', and is currently a Senior Lecturer at 'Teesside University' where he helps students develop the skills needed for their ideal role in the games industry.</p>", 
    "end_date": null, 
    "title": "Build an Old School Side-Scroller with GameMaker: Studio", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/81564_c3d5_5.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-build-an-old-school-side-scroller-with-gamemaker-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-21T04:15:31Z"
}