{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Have you ever wanted to get into Unreal Engine 4 - but were unsure where to start? This Complete Introduction to Unreal Engine 4 is a course that was created with absolute beginners or those wanting to learn this powerful game engine for the first time! This 3 Volume course will go over many helpful tools to know during your time in the Unreal Engine. In volume one, we will look at downloading the Unreal Engine, then moving onto how to start a new project we will look over the entire UE4 interface. Finally we will move onto modes inside of UE4 such as the Placement and BSP mode. Volume Two will look into the paint, landscape, foliage mode. Then we will move onto lights, post-processing and fog. Finally we will wrap up Volume two with creating materials. Volume Three is about Persona and Animation Blueprints, then looking at sounds and what we can do with them. In addition, we will also cover Cascade and creating cinematics as well as packaging a project to get ready for distribution.</p><p><strong>(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong></p><p><strong>More about the Instructor:</strong></p><p>Since graduating university in 2012, Kyle has contributed to multiple small game projects.  In addition, during his time at University he contributed as an assistant lecturer while learning and exploring his passion for 3d modelling, sculpting, texturing, and video game design.</p>", 
    "end_date": null, 
    "title": "Complete Introduction to Unreal 4", 
    "price": "30.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630024_4e06.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-complete-introduction-to-unreal-4/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T01:10:30Z"
}