{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This is a collection of tips for aspiring designers who are conceiving new games.  It isn't as simple as you might think (at least, if you want to do well).<br></p>\n\n<p>As of summer 2016, this is a free class with appropriate coupon. As such, it is not typical of one of my not-for-free classes. One difference is that this is more like an anthology, many pieces written independently, than like a book written for one purpose. Though I’m the “author” in both cases.<br>So this free class does not have the flow toward a specific result that those not-for-free classes have.<br><br>My not-for-free classes, having been planned from the beginning as coherent wholes, are fundamentally “better” than these free classes. Because of that difference between anthology and single-purpose.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What you get is valuable information, but in small packets. Like short stories rather than a novel.</p>\n\n\n\n\n\n<p>The individual videos show how I go about things. I’m here to help you become a better game designer. I do that through conveying my experience to you, by asking questions, by providing the benefit of my thinking about these topics.</p>\n\n\n\n\n\n\n\n<p>NOT by entertaining you. This is serious, game design IS sometimes work, not entertainment. It's fun to watch people playing your game, fun to create games, fun to make money (if you do), but it's not all fun.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Another difference between this course and others is that it's much shorter than my not-for-free classes.<br></p>\n\n\n\n\n\n\n\n\n\n<p>Finally, the other major difference is that all of the videos in this class are available for free by other means: either my “Game Design” channel on YouTube, or as free previews from my not-for-free classes. There are about 150 videos currently available in that way. But the other 350+ are only available if you take those not-for-free classes!</p>\n\n\n\n\n\n<p><br>What I’ve done is try to categorize some of those freely-available videos, and offer them as several free classes (though most are only free-with-coupon, nominally $20).<br><br></p>", 
    "end_date": null, 
    "title": "Conceiving a New Game: Tips for Aspiring Designers", 
    "price": "20.00", 
    "instructors": "Lewis Pulsipher", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/811538_d4af_3.jpg", 
    "course_url": "https://www.udemy.com/conceiving-a-new-game-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-03T15:17:08Z"
}