{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  En este tutorial vamos a aprender a crear objetos animados para introducirlos dentro de un escenario de videojuego. Pasaremos por todas las fases, modelado de alta, baja, baking de texturas, texturaremos con Ddo, una gran herramienta que nos ayudará a crear texturas de una manera sencilla y rápida. Veremos cómo se debe de animar un objeto para que UDK lo identifique como objeto animado y por último importaremos en UDK y lo colocaremos dentro de la escena.  </p>  <p>  \tUDK es el Unreal Engine, un marco de desarrollo profesional completo. Todas las herramientas que necesitas para crear grandes juegos, visualizaciones avanzadas y detalladas simulaciones 3D en PC y en IOS. Las mejores herramientas en la industria están en tus manos.  </p>  <p>  \tEste curso es impartido por Javier Arjonilla, profesional del 3d desde hace más de 12 años. Está especializado en el área de modelado y texturado de sets y props, tanto en alta como en baja poligonalización. Ha colaborado en muchos proyectos 3d, entre otros, ha modelado sets y props para un largometraje de animación que ha sido finalista en los Goya 2013, ha creado concepts de escenarios de algunos videojuegos para una desarrolladora estadounidense. Actualmente posee su propia empresa de audiovisuales con la que crea animaciones para museos por toda España.  </p>", 
    "end_date": null, 
    "title": "Crea un prop animado para videojuegos", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185508_d306_2.jpg", 
    "course_url": "https://www.udemy.com/crea-un-prop-animado-para-videojuegos/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-19T23:46:01Z"
}