{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">     In this online course, students will learn how to design, develop and create their very own online video game</strong>. In 27 lectures, 2 Sections and over 5 hours of content that follow, students will gain the ability to create multi-layered scenes with unique features such as draggable objects, collectables, physics alterations and high score screens.  </p>  <p style=\"\">  \t       We will take students on a journey that will start with the basics and quickly move into techniques and knowledge that experts typically use with <strong style=\"\">no prior programming knowledge required!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Additionally, we will be available at any time to answer questions you may have and will respond within 1 business day. We want you to have all the tools at your disposal so any help you may need is our goal!</strong>  </p>  <p style=\"\">  \t    All video lectures and game assets are download-enabled so you will have everything at your disposal regardless of internet speed or portability to create your very own unique game!  </p>  <p style=\"\">  \t<strong style=\"\">Why learn Video Game Design?</strong>  </p>  <p style=\"\">  \t    This course enables students and future developers to have the mathematical prowess to develop their own games. Often, hopeful hobbyists assume that in game design, simple drag and drop is all it takes. In reality, there are many algebraic and geometric principles one will need to create a truly exciting game experience. In navigating through the world of game design, you will be enhancing those skills through a real-world avenue!  </p>  <p style=\"\">  \t With this noted, it is clear that the curriculum would also be ideal for any mathematics teachers looking to diversity their lesson plans!  </p>  <p style=\"\">  \t<strong style=\"\">Why take <em style=\"\">our </em>course?</strong>  </p>  <p style=\"\">  \t    In our unique video game design curriculum, we do not teach through a &quot;click here, then click here&quot; strategy as other courses do. We will in fact show you the <strong style=\"\">how </strong>and <strong style=\"\">why </strong>of game design and take you from a beginning game designer to an expert within our 5 hours of content.  </p>  <p style=\"\">  \t    After you have created &quot;Backyard Shenanigans&quot;, it will not stop there! We have designed this curriculum to grant all of our students the skills to create anything their minds can imagine!  </p>  <p style=\"\">  \t    Become a part of the Youth Learning Center Video Game Design community today and take your first step into a larger world of Video Game Design!  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Create \"Backyard Shenanigans\" with Gamesalad", 
    "price": "30.00", 
    "instructors": "Mr. Myles Keough, Youth Learning Center, Johnathan Book", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94594_717d_10.jpg", 
    "course_url": "https://www.udemy.com/create-backyard-shenanigans-with-ylc/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T18:29:08Z"
}