{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Would you like to create<strong> professional 2D Game characters</strong> that are poseable and animation ready?<br>Are you interested to know what it takes to create a <strong>game character from scratch?</strong>...</p><p>This course is created for student's who would like to learn a solid workflow in character creation and detailing. The course is designed so that we will start from a concept sketch and bring our concept to life with help of adobe illustrator. This course is for intermediate to advanced users of illustrator who want's to learn or polish their character creation skills. I have included my own concept art which I will detail and optimize for animation throughout the entire course. But you can also bring in your own character sketches and use the workflows in the course and apply it to your own. The course is about 3 hours long, and I go in-depth in creating your character from conception to completion.</p><p>Anyone who would like to learn new workflows for game character design, or just improve their character creation skills are encouraged to take the course.</p><p>_____________________________________________</p><p><strong>Join Over 1700+ students </strong>who have enrolled in my course and are making their way to become mobile game artists!</p><p><strong>Watch 18 Lectures</strong> that shows you the proven workflows in making your own game characters<br><strong>Be built for speed</strong> and achieve great art quality in least amount of time</p><p>_____________________________________________</p><p><br></p>", 
    "end_date": null, 
    "title": "Create Detailed and Poseable Character in Adobe Illustrator", 
    "price": "30.00", 
    "instructors": "Rafael John Regidor", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490006_9d64_2.jpg", 
    "course_url": "https://www.udemy.com/charactercreationillustrator/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T02:17:38Z"
}