{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>\r\n\t     This course is about creatures. <br>\r\n\t <br>\r\n\t   Specifically, this course is an accessible demonstration of a design process that is useful right from the start. It uses only one piece of free and open source software so anyone with a graphics tablet, a touch screen or a steady hand and a mouse can begin to design creatures and characters. It is a process which is tried and true and will allow you to hit the ground running, designing creatures and making the most of your practice time, all while being fun. These are techniques that professionals use and they are specific and effective.<br>\r\n\t <br>\r\n\t       Too often, art instruction amounts to not much more than watching someone draw with very little insight into how to do it yourself. Have you picked up a book about drawing, painting or design and seen demonstrations that went something like this: &quot;First draw a drawing, then paint the drawing&quot;, with no significant process or insight into how to do it yourself?<br>\r\n\t <br>\r\n\t   That is not what this course is, it is a step-by-step process for designing a fantasy creature (in this case, an Orc), that saves your time and allows you to move from rough, easy sketches to more significant painted pieces seamlessly and on your own time. <br>\r\n\t <br>\r\n\t   So if you&#039;re interested in design, fantasy monsters, gaming of any variety, or open-source software, join us in Design with Free Software. See you in class!\r\n</p>", 
    "end_date": null, 
    "title": "Design with Free Software- Part One", 
    "price": "20.00", 
    "instructors": "Justin Operable", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248556_ad73_3.jpg", 
    "course_url": "https://www.udemy.com/designwithfloss/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-23T07:16:11Z"
}