{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>The Game Beyond</strong> is a crash course in Game Design. You will be taken through the 5 core steps that are needed to design compelling games. </p><p>This course is perfect for anyone who wants to gain a basic understanding of Game Design to use in other markets or fields. If you are looking for more information on 'Gamification', this course will give you the core tools to really shine.</p><p>This course is based upon 15 years of higher education and Game Design experience. You will receive the equivalent of the first semester at a Game Design Master's program. </p><p>What will you learn? <strong>The 5 core steps to designing games.</strong></p><ol><li>How to define goals.</li><li>Learn what feedback loops are and how do they affect the brain and habits.</li><li>Learn what are the 3 rule sets needed to define your game.</li><li>Understand how to change your game design using Narrative structures.</li><li>Learn the different types of game players, and what they are attracted to in your game.</li></ol><p>In this course we will examine a number of award winning games and advertising case studies from around the world. You will learn the key processes and mechanics that are used in these cases.</p><p>This course will introduce the affects and processes that games have on the Human Brain. </p><p>You will examine historical events through the context of a Game Designer and understand how games have shaped the world we live in today.</p><p>The only materials you need can be found in board games, card games or role playing games you have lying around. Start playing now and press \"take this course\".</p>", 
    "end_date": null, 
    "title": "Harness the Power of Play: The 5 steps of Game Design", 
    "price": "25.00", 
    "instructors": "Gabriel McIntyre", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/93962_9cea_7.jpg", 
    "course_url": "https://www.udemy.com/thgamebeyond-begin/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-18T09:37:17Z"
}