{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Ever looked at those HUGELY successful mobile games and think: “Man, I’d love to do that!”</p>\n\n<p>Like the super-addictive Mr Jump - which earns its developers upwards of $20,000…. A DAY!</p>\n\n\n\n<p>Yep, that’s right… $20,000 a DAY!</p>\n\n\n\n<p>Fancy a go at that?</p>\n\n\n\n<p>If you’re wondering where to start and your head is spinning from information overload - this course is designed to help.</p>\n\n\n\n<p>Imagine being able to flip a switch and turn your mobile game ideas into a sparkling reality…</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">WELL NOW YOU CAN!</strong></p>\n\n\n\n<p>Hi! My name’s Ben Kane Johns. I’m the creator of the course <strong class=\"redactor-inline-converted\">How to create a Mr Jump inspired iOS game in Swift 2</strong>. I’ve successfully taught over 3000 happy students with my <strong class=\"redactor-inline-converted\">How to create a Flappy Bird inspired iPhone in Swift 2</strong> course, and today I’m taking things up a notch…</p>\n\n\n\n<p>If you’ve been looking at indie games developers and thinking: “Yeah, I could totally do better than that.”</p>\n\n\n\n<p>…Maybe you’ve got an initial concept or a fully formed idea - and now you need to make it happen - FAST.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">THIS COURSE WAS MADE FOR YOU.</strong></p>\n\n\n\n<p>Sign up to <strong class=\"redactor-inline-converted\">How to create a Mr Jump inspired iOS game in Swift 2</strong> today, and I’ll share with you EXACTLY the pro tools and software I used to create this version of Mr Jump…</p>\n\n\n\n<p>It’ll save you a ton of time. In a nutshell: I’ve done the hard work, so you don’t have to!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">UNIQUE CONTENT… YOU WON’T FIND THIS COURSE ANYWHERE ELSE</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">How to create a Mr Jump inspired iOS game in Swift 2</strong> is the first of its kind on Udemy. It is the ONLY course showing you how to replicate the App Store’s best game of 2015 - Mr Jump.</p>\n\n\n\n<p>It also, shows you how to use tile maps for mobile games - a bonus skill you need to stay ahead of the competition.</p>\n\n\n\n<p>The course is stacked full of powerful content, which you’ll breeze through with ease. At the end, I guarantee you’ll have a complete working Mr Jump mobile game - which you can modify into something of your own. More on that shortly…</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">WHAT YOU’VE GOT IN STORE</strong></p>\n\n\n\n<p>This course will give you an intermediate level understanding of Swift, the Xcode environment, Sprite Kit, JSTileMap, Tiled and create game graphics.</p>\n\n\n\n<p>You’ll learn how to replicate the extremely successful game logic behind the App Store's best game of 2015 “Mr Jump”.</p>\n\n\n\n<p>My simple step-by-step guide will give you a foolproof understanding of game logic and game design - crucial skills you can take away to create games of your own.   Side-scrolling games like: Super Mario Brothers, Sonic The Hedgehog, Mega Man 9, Donkey Kong and Little Big Planet.</p>\n\n\n\n\n\n<p>HERE’S THE COURSE OUTLINE</p>\n\n\n\n<p>Create a replica of the “Mr Jump” iOS game</p>\n\n\n\n<p>Using the “Swift” Language</p>\n\n\n\n<p>Creating levels with tile maps</p>\n\n\n\n<p>Using the “JSTileMap” framework</p>\n\n\n\n<p>Using “Tiled” map editor</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">WHY MR JUMP?</strong></p>\n\n\n\n<p>One-tap games don’t have to be boring. Just look at Mr Jump! It received a humongous 10 million downloads and 700 million game sessions… in its first months of release.</p>\n\n\n\n<p>It has also been featured in the Apple App Store in over 100 countries.</p>\n\n\n\n<p>And, as I’ve mentioned before, Mr Jump generates $20,000 in fresh, green moolah. Every. Single. Day.  Thanks to Chartboost-powered ads and in app purchases from the App Store.</p>\n\n\n\n<p>In this course, I’ll show you how…</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">WHAT CAN I DO WITH MY MR JUMP GAME?</strong></p>\n\n\n\n<p>Listen. In no time you’ll have a crystal-clear, 3D understanding of how this game goes together - leaving you free to tweak, modify and change your Mr Jump game into something unique to YOU.</p>\n\n\n\n<p>Now imagine the respect and recognition you’d get if your game was the next massive runway hit?</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">WHAT ELSE?</strong></p>\n\n\n\n<p>If you’ve been looking for a hobby or career that can give you endless freedom, whilst being creative AND using that smart-cookie brain of yours?  Mobile games development is for you.</p>\n\n\n\n<p>Keep reading, and you’ll discover how it’s improved my own life. Meantime here’s why YOU need to dive in to this course today and how our work together could bear serious fruit…</p>\n\n\n\n\n\n<p>·         You’ll learn how to program a computer game - from the ground up. </p>\n\n\n\n<p>·         You’ll build invaluable, ironclad and highly transferable skills whether you’re a beginner or an intermediate programmer.</p>\n\n\n\n<p>·         You’ll quickly learn the Swift programming language.</p>\n\n\n\n<p>·         You’ll grasp a solid understanding of how to program an iOS game.</p>\n\n\n\n<p>·         You’ll gain the satisfaction of creating a computer game of your own.</p>\n\n\n\n<p>All you need to do is follow along, have fun and ask questions if you need to. Simple, right?</p>\n\n\n\n<p>So whether you’re looking to create the next Crossy Road or become the Dong Nguyen (Flappy Bird) of 2016 - this course is for you.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">So come on! Join the revolution. Start today. Because what have you got to lose?</strong></p>\n\n\n\n<p>And let’s be honest here, hours of fun await you. X hours, in fact, of meticulously-produced, laser-sharp chapters that will tool you up with everything you need to create your very own customization Mr Jump game.</p>\n\n\n\n<p>My motto? Everything you do, builds on everything you do.  So don’t waste another minute of your life. Get started with my Mr Jump course today and view the world from a new perspective… a world of limitless possibilities.  </p>\n\n\n\n<p><em><strong>Click on the link above and grab your place on my course today.</strong></em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ABOUT ME</strong></p>\n\n\n\n<p>My name’s Ben Kane Johns. I’m the creator of “How to create a Flappy Bird inspired iPhone in Swift 2” and ‘How to create a Mr Jump inspired iOS game in Swift 2.’</p>\n\n\n\n<p>I strongly believe that:</p>\n\n\n\n<p>·         Indie games development is driving the future of games.</p>\n\n\n\n<p>·         Indie games development gives you the skills and freedom to create truly innovative and interesting games with MASSIVE potential.</p>\n\n\n\n<p>·         There’s no time to waste: indie developers who start now - could be the business leaders of the games industry tomorrow.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">HERE’S MY STORY…</strong></p>\n\n\n\n<p>Ever since I was a little boy, I’ve been obsessed with gaming. From Super Mario Brothers to Pacman - I never left home without my tiny little Nintendo handheld.  One day when I was 16 years old - while washing dishes in a grimy fast food restaurant - I wondered how I could escape a life of grub work and turn what I loved doing, into a full time career.</p>\n\n\n\n<p>I worked my socks off. Followed my vision. And today I’m just as devoted and fanatical about gaming as ever - except now I use that enthusiasm as a Udemy teacher and professional mobile games developer.  It’s a job that gives me and my lovely family an incredible lifestyle, and allows me lots of free time to pursue my hobbies - guitars and fast cars!</p>\n\n\n\n<p>I love teaching people how to program… and seeing them go on to do inspirational things. Because once you learn how to create mobile games, the possibilities for your life and career are endless. I cannot wait to share these incredible skills with you, right here on Udemy. <em class=\"redactor-inline-converted\">Join me today and let’s get to work.</em></p>", 
    "end_date": null, 
    "title": "How to create a Mr Jump inspired iOS game in Swift 2", 
    "price": "20.00", 
    "instructors": "Ben Kane Johns", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/847702_2657_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-mr-jump-inspired-ios-game-in-swift-2/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T03:17:35Z"
}