{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tIf you&#039;re doing it right, one of the hardest parts of game design is writing clear rules. If you mess it up, your game will be a dud, no matter how good the actual game is - because it won&#039;t be played correctly.  How to write rules varies with your audience - of course. Polish the rules as you playtest.  </p>  <p style=\"\">  \t       If you&#039;re designing a video game for other people to produce (program, art, sound, etc.) then you have to write very clear game design documents if you want things to work as you envision.  </p>  <p style=\"\">  \t     This course is primarily about writing formal rules for games, usually tabletop games, but writing a game design document requires similar skills, as it must explicitly describe every possible interaction between player(s) and machine.  </p>  <p style=\"\">  \t Review:  </p>  <p style=\"\">  \t                              A other great course from Dr. Lewis  Pulsipher. This is an one of a kind course on Udemy (the internet) about  how to write rules for tabletop (board) games. All the do&#039;s and don&#039;ts  are discussed and more. From this course you will get some great tips if  your planning to make a tabletop game your self. Highly recommend to  watch. The teacher talks very clear and is easy to follow.  </p>  <p style=\"\">  \t Jimmy Voskuil  </p><p style=\"\">Recommendation (from email to me):</p><p style=\"\">&quot;Last year I entered one of my games in the international Hippodice boardgame competition in Germany. Unfortunately I didn&#039;t make it to the final but did make it through to the first 33 (out 150) which meant it was playtested.</p><p style=\"\">They were so good as to give me some test results feedback a few months later. One of the most positive points was with regard to the rules!</p><p style=\"\"><strong style=\"\">So I just wanted to thank you because by following your rules course, I picked up many things which improved the rulebook before I sent it off</strong>. Now I just need to use their feedback to improve the game some more - its overall score was good just not good enough for the final!&quot;</p><p style=\"\">Mark Bethell</p>", 
    "end_date": null, 
    "title": "How to Write Clear Rules (and game design documents)", 
    "price": "35.00", 
    "instructors": "Lewis Pulsipher", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147292_8c48_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-clear-rules/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-15T14:25:05Z"
}