{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn  how to make interactive 2D adventure games in Unity 5! In this comprehensive course, instructor Alan Thorn demonstrates a wide range of 2D  features and tools for making a 2D platform adventure. Targeted to  intermediate users, see how to create a player character, functional physics,  interactive characters and dangerous obstacles. Explore subjects, such as:  sprites, player controls, character animation, balancing gameplay, collisions  detection, and a questing system. In addition, see how to import and configure  2D assets optimally for 2D functionality and how to design and build complete  levels that ooze atmosphere. There’s plenty to see and do in this fun course,  and by the end you’ll have established a solid foundation both in making 2D  games generally and in working smart to create your own adventure games in no time!</p><p><strong>(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong></p><p>More about the Instructor:</p><p>Alan Thorn is a game  developer, author and educator with 15 years industry experience. He makes  games for PC desktop, Mobile and VR. He founded 'Wax Lyrical Games' and  created the award-winning game 'Baron Wittard: Nemesis of Ragnarok', working  as designer, programmer and artist. He has written sixteen technical books on  game development and presented ten video training courses, covering game-play  programming, Unity development, and 3D modelling. He has worked in game  development education as a visiting lecturer for the 'National Film and  Television School', as a Lead Teacher for 'Uppingham School', and is currently  a Senior Lecturer at 'Teesside University' where he helps students develop the  skills needed for their ideal role in the games industry.</p>", 
    "end_date": null, 
    "title": "Learn to Code and Script a 2D Adventure Game with Unity", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674144_0fe6.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-code-and-script-a-complex-adventure-game-with-unity/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T06:30:34Z"
}