{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Level design is a critical component to all games, but a component that can be difficult to get right. Anyone with graphics experience can in theory create a functioning single level game; but creating a game that&#039;s interesting and enjoyable as well as functional takes some finesse. Mastering Blender and Unity 3D is a sure fire way to make your game level design all of this, and more. </p><p><strong style=\"\">Develop your level design skills to the highest standard</strong></p><ul style=\"\"><li>Understand game level design in both conceptual and practical terms</li><li>Design 3D models for game levels</li><li>Create textures through Photoshop</li><li>Construct and operate a full game level on Unity 3D</li></ul><strong style=\"\">Construct multi-level games using versatile programs</strong><p>Blender and Unity 3D are both open source programs used by games designers all over the world. Developed by their community of users, they construct games that operate on almost all platforms; from consoles and desktops to mobile and websites. Gaining a knowledge of both programs is hugely beneficial to any game developer, as it fine-tunes your insight and intuition for creating multi-faceted, compelling and exciting game levels. Whether you&#039;re still coming to grips with level design or already have a wealth of experience under your belt, learning level design with Blender and Unity 3D will ensure your skills are up to date and flawless.</p><p><strong style=\"\">Course Overview</strong></p><p>This course includes over 66 lectures and 5 hours of content, suited to anyone with a basic understanding of Blender and Unity 3D. If your interests lie in level design, 3D modelling or texturing, then this course is for you.</p><p>You&#039;ll first learn about the concepts and best practices of level design, from setting goals and getting references to planning and mapping out your level in Photoshop. You will then move on to modular design and complete basic object manipulation tasks; the first step to creating a full game level. </p><p>You will go through each aspect of level design in detail; floors, ceilings, walls, focal points, props and other objects, filling in your level as you learn. Then, you&#039;ll add intricate texture to each of these elements, bringing your level design up a notch from basic to something much more professional looking. </p><p>Reviews and quizzes have been incorporated into each section of this course so that the material covered is constantly refreshed. On completion, you will take away an up to date skill set in Unity 3D and Blender. You will have an understanding of graphics software, game engines, game level design, and how all of these elements work seamlessly to create fun and engaging games. </p>", 
    "end_date": null, 
    "title": "Learn Level Design with Blender and Unity 3D", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506010_a477_2.jpg", 
    "course_url": "https://www.udemy.com/learn-level-design-with-blender-and-unity-3d/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T10:40:09Z"
}