{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>[Note: This course exists because my original course \"Learning Game \nDesign: as a job or a hobby\" more than doubled in size over time, \nbecoming much too large for Udemy's new structure. That massive course \nis no longer available, instead there is \"Learning Game Design\" parts 1 \nand 2. As with that original course, this one is not subject to massive \ndiscounts, which only serve to offend those who paid full or near-full \nprice.]\n</p>\n\n<p>\n  \t             This pair of \"Learning Game Design\" courses (this is Part 2) is designed for people who want to design \ngames - video or tabletop - but lack information about what is really \ninvolved and how to go about it.  It's not rocket science, but \ncommercial design is a JOB - one that cannot be done by rote, there is \nno \"Easy Button\".  I'm not here to encourage you, or entice you, or entertain you,\n I'm here to inform you.  I assume you have the motivation to learn how \nto design games, you just need to know how.  And that means you need to \ndo it from start to finish, to complete games rather than merely start \nthem.\n  \t\n  \t                We'll discuss the \nprocess of game design, the possible structures in games, the best way \nto start learning game design, what makes a game good (there's a great \nvariety of opinion about this), ways to provide a framework for your \ndesign efforts, ways to keep records of your work, software to help you \nlearn.  Many aspiring game designers have crippling misconceptions (such\n as the notion that it's all about a great idea, or that everyone likes \nthe same games they do), and I'll try to clear those out of\n your way.\n  \t\n  \t                This is not a \"comprehensive\" series because there's no such thing. It is a pair of courses about \nlearning game design. Learning is a process that goes on throughout a game \ndesigner's career, and it starts here.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t           \n    This class will never be offered for free or at very deep discounts.\n  That is disrespectful to me and to the students who pay full price or \nnear it.</p>\n\n\n\n\n\n\n\n\n\n<p>Keep in mind, this course is not about game development, that is, not\n about programming, art, sound, and so forth. It is only about game \ndesign.Most so-called \"game design\" courses are actually about game \ndevelopment, with just a little game design involved.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Following are comments from people who took the original course \"Learning Game Design: as a job or a hobby\":\n</p>\n\n\n\n\n\n\n\n\n\n<p>  \t Great course! Good for the starter like myself :)  </p>\n\n\n\n\n\n\n\n\n\n<p>\n  \t Currently I follow this course (at 75% so far) and its a great \ncourse for beginner game designers like myself. The course is not a 1 \nclick button and after your a game designer no (please send message if \nyou found that course btw) but it gives a good frame work, hand outs, \nideas and background about both video games and tabletop games.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t So if you wanted to start with game design this is a great first step.  </p>\n\n\n\n\n\n\n\n\n\n<p>\n  \t The teacher is clear and good to follow ( I am a student from The \nNetherlands and got no problem following this course). Also the course \ngot some assignment I strongly recommend doing them I finaly found out \nwhy I Hate Monopoly :)  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t Cheers all hope this was usefull,  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t Jimmy  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t==  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t Mark Frazier  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t President  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t Designs In Creative Entertainment, LLC.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t An ideal introduction to game design  </p>\n\n\n\n\n\n\n\n\n\n<p>\n  \t Dr. Pulsipher distills the critical elements of designing games into\n manageable chunks. This is an ideal course to take if you are \ninterested in designing games, regardless of whether you intend to \npursue it as a career or not.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t Much of the \nmaterial covers the specifics of the process of game design, but there \nis alot of prime advice to be had in the lectures on creating the right \nconditions for quality feedback and on understanding the realities of \nthe publishing business.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t A must-have certification if you're serious about designing, and I'd say, even publishing games!  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t==</p>\n\n\n\n\n\n\n\n\n\n<p>  \t Pull Back the Curtain on the Game Design Process  </p>\n\n\n\n\n\n\n\n\n\n<p>\n  \t I know that in the past there's only been a couple of times that I \nmanaged to blunder into some sort of prototype, but I had no clue as to \nwhat I was doing that was different than usual. Well... the material in \nthis course nails down precisely what to do to get over that initial \nhump. It can save you from countless false starts and dumb ideas. And \nunlike other commentary on the design process, Dr. Pulsipher provides a \nwhole menu of things that you can do in each phase of development.  </p>\n\n\n\n\n\n\n\n\n\n<p>\n  \t This material reveals more of the dials and knobs of gaming than I \neven knew existed. And being aware of these things was enough to shift \nme from having an occasional promising idea to having more ideas than I \nknow what to do with. Even just playing new games now, I cannot help but\n see \"behind the curtain\" and into the dilemmas the designers were \nfacing. If you care about game design and actually do the work that this\n course entails, you are in for a profoundly illuminating experience.  </p>", 
    "end_date": null, 
    "title": "Learning Game Design: Part 2", 
    "price": "40.00", 
    "instructors": "Lewis Pulsipher", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/141948_bc4b_3.jpg", 
    "course_url": "https://www.udemy.com/learning-game-design-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-04T15:38:32Z"
}