{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<a href=\"https://www.facebook.com/srlearning\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\"><strong>Like us on Facebook</strong></a> and/or <a href=\"https://twitter.com/sr_elearning\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Follow us on Twitter</a>. Message us to let us know you liked us, or Tweet us @sr_elearning.  </p>  <p>  \tAre you an artist, designer or art student? Did you know that you can create beautiful sculpture using software? If this sounds interesting, then this course is for you.  </p>  <p>  \t   Mudbox allows you to create realistic 3D sculptures without ever getting your hands dirty. It&#039;s often used to mock up a character which will later be transformed into a 3D game or movie character. Mudbox is where it all begins. This course teaches you the basics of the software itself, then goes into great detail on what you need to do to create great looking art.  </p>  <p>  \t   As you learn each tool in Mudbox you&#039;ll be given lessons in proper sculpture techniques by a long time professional digital artist. This course is more than how to use the software, it&#039;s really a course on art creation.  </p>  <p>  \t   Whether you simply want to create works of art, or you would like to understand modeling in 3D to help you with other projects you&#039;re working on, this course has everything you need.  </p>  <p>  \t A background in art, drawing or animation is helpful, but not required.  </p>  <p>  \t   The source files are included for this course.  </p>", 
    "end_date": null, 
    "title": "Learn 3D Digital Sculpting with Mudbox", 
    "price": "20.00", 
    "instructors": "Stone River eLearning, Chad Walker", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/85150_48b8_6.jpg", 
    "course_url": "https://www.udemy.com/3d-digital-sculpting/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-28T19:25:34Z"
}