{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>1000+ students upon launch!</strong></p><p><strong>________________________________________________________<br></strong><br></p><p>Creating your own 2D game backgrounds is possible. All you need are the right structure, workflows and mindset in creating it within Adobe Illustrator. And in this course that is exactly what I will teach you.</p><p>This course is about creating your own 2D game backgrounds from SCRATCH in Adobe Illustrator. We will be making a 2d/cartoony game background with proper structure, proven workflows and the mindset you can use in creating your own 2d game backgrounds.<br></p><p>This course will give you a new approach in creating a 2d game background in a more efficient and time saving way. It will also demonstrate proven workflows and tips in using Adobe Illustrator for game art.<br></p><p><br></p><p>About this course:</p><ul><li>Full, free lifetime access</li><li>The course would be regularly updated and more lectures will be added.</li><li>The awesome Udemy 30 day money-back-guarantee.</li><li>Challenging tasks that let you validate everything you will learn in this course.</li><li>Full support from the instructor</li></ul><ul><li>This course is for intermediate Adobe Illustrator cs4 and up users. And assumes you know where your shortcuts are, your tools are and the process on using tools.</li><li>This course is a FULL OVERVIEW type of course and NOT a step by step course. I will take you with me in creating a game background from blocking, breaking down the background in small areas and fully completing it.</li><li>This course shows the proper tools you CAN use in creating backgrounds, and why I use this certain tools only.</li><li>The course is about 1 and a half hour only, shorter than my other courses, but is purely focused on creating game backgrounds. No more intros to many tools. We will create the background right of the bat.</li><li>This course is structured to make you efficient in setting the layers properly, the areas you need to focus (not in sequence) but the advantage of having MODULAR approach in creating this kinds of backgrounds.</li><li>If you would like to improve your background creations skills or you want to add more knowledge and workflows to your current ones, this course is PERFECT for you.</li><li>So click enroll now and lets get started!</li></ul>", 
    "end_date": null, 
    "title": "Make your own 2D Game Backgrounds with Adobe Illustrator ", 
    "price": "30.00", 
    "instructors": "Rafael John Regidor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699574_0857_4.jpg", 
    "course_url": "https://www.udemy.com/makegamebackgrounds/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T00:59:00Z"
}