{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Don't waste $200,000 on video game developer school and spend your life paying back student loans when you can get the same level of training with this course.</p>\n\n<p>  \t <strong>Calling All Video Game Addicts</strong>  </p>\n\n<p>  \t If you love playing games, then you may be perfect for the game development industry. Did you know that video game developers make $76,000 to $112,000 per year doing what they love?  </p>\n\n<p>  \t If you think you have what it takes to break into the game development world, then look no further. Your own college experience is within this course.  </p>\n\n<p>  \t <strong>What You Will Learn</strong>  </p>\n\n<p>  \t In this course, you will learn the basics of 3ds Max game development software, as well as how to use it to create real life projects. You will be introduced to video game art, animation, 2D and 3D modelling, layout and design as you become a well rounded game developer and game artist without going to game developer school.  </p>\n\n<p>  \t This is <em>the</em> complete Game Development course, designed to take an artist from the beginning stages of traditional drawing through a completed studies of the skills and training to become a Professional Video Game Artist.  </p><p><strong>Software Used (Older Software)</strong></p>\n\n<p>Please note that while the content of this course is still very relevant, the software used is older. Students learning with the most updated versions of Photoshop and 3ds Max will find that tools have moved to new locations in the software due to multiple updates over the years. </p>\n\n<p>1. 3ds Max 2010 <br>2. Photoshop CS3</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Professional Video Game Art School", 
    "price": "50.00", 
    "instructors": "Stone River eLearning, Chad Walker", 
    "commitment": "87 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61058_5364_7.jpg", 
    "course_url": "https://www.udemy.com/game-art/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-20T05:51:05Z"
}