{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  En este curso sobre el motor de videojuegos Unreal Developments Kit revisaremos varias de sus herramientas.  </p>  <ul style=\"\">  \t<li>Aprenderemos a situar y programar una cámara en Tercera persona para que siga a nuestro personaje. </li>  \t<li>Veremos como utilizar la herramienta de Mesh Paint para, mediante vertex color, poder aplicar capas de textura a nuestra geometría para mejorar su aspecto visual en un videojuego. </li>  \t<li>También  aprenderemos a utilizar las físicas de UDK con RigidBody, SoftBody y Constrain. </li>  \t<li>Realizaremos ejercicios prácticos con cada uno de ellos para conocer su potencial y verificar su correcto funcionamiento en nuestro motor. </li>  \t<li>También  aprenderemos a realizar Cloth (Telas) en el Software UDK. </li>  \t<li>Realizaremos el proceso completo, desde un modelado simple en MAX, colocación de huesos, pesado y configuración en UDK. Para finalizar, veremos como  realizar Terrenos en UDK, mediante las dos técnicas disponibles: Editor de terrenos y Landscape. </li>  \t<li>También realizaremos ejercicios de colocación de Foliage con Decal y la nueva forma en UDK: Foliage Editor. </li>  </ul>  <p>  \t  UDK es el Unreal Engine, un marco de desarrollo profesional completo. Todas las herramientas que necesitas para crear grandes juegos, visualizaciones avanzadas y detalladas simulaciones 3D en PC y en IOS. Las mejores herramientas en la industria están en tus manos.  </p>  <p>  \t  Este curso está impartido por Jose Luis Quirós. Con más de 15 años de experiencia en producciones audiovisuales y en 3D, comenzó de forma autodidacta y gracias a la carrera profesional de diseño industrial creó sus primeros modelos 3D.  Estudió 3ds Max, Maya y Softimage. Ha trabajado en largometrajes de animación, videojuegos, publicidad y cine, y ha dirigido proyectos como los Marcatoons y participado en cinco largometrajes, el último de ellos nominado a los premios Goya.  </p>", 
    "end_date": null, 
    "title": "UDK", 
    "price": "30.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188628_6662_3.jpg", 
    "course_url": "https://www.udemy.com/udk-unreal/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-25T18:06:57Z"
}