{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Welcome to Part 2 of our training! (It is not necessary to do Part 1) This course is for any \nartist who is looking to thrive by sharing their doodles, sketches, \ncharacters &amp; designs with one of the largest growing game \ndevelopment communities in the world. Get access to millions of paying \ndevelopers and essentially your potential clients who need game assets \nfrom talented artists like yourself.  Help others create the projects of\n their dreams by providing them with your best dream creations. Your \nimagination is the limit.  </p>  <p>  \t<strong>What You Will Learn:</strong>  </p>  <ul><li>How to take your doodles and sketches and turn them into Monthly Revenue</li><li>How to look at your art and be able to break it down into simple 3D shapes</li><li>Learn specific modeling techniques used for game development and design</li><li>Learn Step by Step process on how to build 3D geometry from your sketches</li><li>How to unwrap your 3D models and draw textures using zBrush 4R7 and Photoshop</li><li>How to bring your characters to life in the leading animation package</li><li>How to export your 3D animated model and set it up inside a game engine</li><li>How to take your creations and submit them for sale using required tools</li></ul>  <p>\n  \t                                I will show you a step by step \nprocess that I use to create and submit 3D assets to the Unity Asset \nStore. I spent the last 15 years learning all the necessary tools &amp; \ntechniques and will now teach you how you can do the same with this easy\n to follow online course.  </p>  <p>  \t              As you go \nthrough the course I suggest breaking it down into sections or 4 days. Spend 2 days on modeling, 1 on animation and 1 in Unity. You are of course \nwelcome to also just squeeze the whole thing in one weekend which will \nquickly send you on your own way to selling your own assets. We all \nlearn differently so find your own comfortable speed ... and Lets Begin!\n  </p>", 
    "end_date": null, 
    "title": "Unity Asset Store: Run an Art Business with Maya & zBrush", 
    "price": "50.00", 
    "instructors": "Alan Balodi", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620896_d345_2.jpg", 
    "course_url": "https://www.udemy.com/unity-asset-store-run-an-art-business-with-maya-and-zbrush/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T00:34:07Z"
}