{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">VIDEO GAME DESIGN: CREATE A COMPETITIVE DESIGN PORTFOLIO</strong> is focused on helping aspiring game designers and level designers create a portfolio of work that is professional in quality and makes them highly competitive for design jobs in the video game industry. </p>\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p><p><strong class=\"redactor-inline-converted\">DO YOU WANT TO:</strong><br></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Have a real chance at getting a design job</strong> in the video game industry</li><li><strong class=\"redactor-inline-converted\">Get professional design experience</strong> from your portfolio games or levels</li><li><strong class=\"redactor-inline-converted\">Be taken seriously </strong>by Video Game Producers and Lead Designers</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">THEN YOU NEED TO:<br></strong></p>\n\n\n\n<ul><li>Create an extremely well designed, high quality and targeted portfolio that <strong class=\"redactor-inline-converted\">\"WOWS\" </strong>industry professionals demonstrates your value to a game team</li><li>Design<strong class=\"redactor-inline-converted\"> innovative portfolio games or levels </strong>that showcase your talent and make Game Design Leads and Creative Directors respect you</li><li>Build an <strong class=\"redactor-inline-converted\">exciting demo reel </strong>that will get a Hiring Manager's attention </li><li>Build an effective portfolio website to showcase your demo reel and games/levels</li><li>Write winning cover letters and resumes that will make Recruiters and Producers take you seriously.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">ARE YOU READY TO:</strong></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Put a stake in the ground now </strong>and put 100% of yourself into achieving your goals</li><li><strong class=\"redactor-inline-converted\">Showcase your design work </strong>to industry professionals (Producers/Designers) </li><li><strong class=\"redactor-inline-converted\">Prove that you have what it takes</strong> to break into the Video Game Industry</li><li><strong class=\"redactor-inline-converted\">Stand out from the crowd </strong>and beat out the competition for jobs</li><li><strong class=\"redactor-inline-converted\">Land your dream job </strong>and become a professional game designer or level designer</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">&gt;&gt; START BUILDING YOUR DESIGN PORTFOLIO TODAY! &lt;&lt;</strong><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">IN THIS COURSE YOU WILL LEARN:</strong></p>\n\n\n\n<ul><li>What the various design roles in the game industry are and what they do</li><li>How to research game companies effectively</li><li><strong class=\"redactor-inline-converted\">What Hiring Managers want</strong> from entry-level game designers and level designers</li><li>How to prepare effectively to create your design portfolio</li><li>How to create a winning strategy to get the design jobs you want</li><li>How to <strong class=\"redactor-inline-converted\">create the right portfolio games</strong> and <strong class=\"redactor-inline-converted\">get real industry game experience</strong> while making them</li><li>How to <strong class=\"redactor-inline-converted\">create a demo reel that Wow's Hiring Managers</strong> and showcases your most valuable design skills to them</li><li>How to create a portfolio website that showcases your work well to potential employers</li><li>How to write resumes and cover letters that will get Hiring Managers to take you seriously</li><li>How to create a winning Business card.</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">WHY TAKE THIS COURSE</strong></p>\n\n\n\n<p>Simple, this course gives you all of the insider information, training, exercises and best practices required to:<br></p>\n\n\n\n<ul><li>Choose the right design career for you</li><li>Create a solid portfolio development strategy and plan that will help you <strong class=\"redactor-inline-converted\">get the results you need</strong></li><li>Build a design portfolio that <strong class=\"redactor-inline-converted\">shows and proves your </strong><strong class=\"redactor-inline-converted\">value</strong> as a highly knowledgeable, skilled and competitive game designer or level designer to employers in the video game industry</li><li><strong class=\"redactor-inline-converted\">Maximize your chances</strong> of landing your target design job in the video game industry</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">ADDITIONAL BENEFITS OF TAKING THIS COURSE</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">All of </strong><strong class=\"redactor-inline-converted\">the information you need in one easy place. '</strong>VIDEO GAME DESIGN: CREATE A COMPETITIVE DESIGN PORTFOLIO' is a simple, straightforward and easy to understand online course that is 100% focused on the goal of helping you get your game design or level design portfolio to a polished and professional state that is highly competitive for entry-level game design or level design jobs in the Video Game Industry. Everything you need to know is in one easy place.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Need to know information only.</strong> I know your time is very valuable and you want to get a design job as soon as possible. Therefore, I have only included information that is <em class=\"redactor-inline-converted\">'need to know</em><em class=\"redactor-inline-converted\">'</em>. <em class=\"redactor-inline-converted\">All</em> course content and exercises are presented in an easy to follow step-by-step concise format to give you maximum results in the least amount of time. <em class=\"redactor-inline-converted\">No wasted time!</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Professional video guided mentorship to help you succeed</strong>. Creating an outstanding design portfolio takes serious time and effort, and believe it or not thousands of talented passionate people are trying to build them to compete for entry-level design jobs everyday. Unfortunately, the hard truth is that the majority of these people will fail to succeed because of the time they waste working on the wrong things or just not getting their work to the level of quality necessary to compete for jobs. --And YES even the most talented people struggle on their own because it is very difficult be objective and critical about your own work (<em class=\"redactor-inline-converted\">or even know what work you should be doing)</em> when you're doing something new. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course can help you change all of that and beat the odds by: </strong></p>\n\n\n\n<ul><li>Keeping you focused on <strong class=\"redactor-inline-converted\">achieving the</strong> <strong class=\"redactor-inline-converted\">right career and portfolio goals</strong> so you can get valid game design or level design experience while you’re creating your portfolio games.</li><li>Giving you the information and video guided mentoring support you need to ensure that you are <strong class=\"redactor-inline-converted\">doing things right the first time</strong> and staying on track to hit a high level of quality and achieve your goals. </li><li>Ensuring that you are creating portfolio work that is highly competitive in quality and <strong class=\"redactor-inline-converted\">clearly showcasing your value</strong> for the game design or level design jobs that you want</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">HOW IS THIS COURSE STRUCTURED</strong><br></p>\n\n\n\n<p> Each section of this course starts out with an<strong class=\"redactor-inline-converted\"> video game industry </strong><strong class=\"redactor-inline-converted\">mentor guided video</strong> explaining all of the information you need to know in a simple and concise format, followed by a set of exercises and best practices to help ensure that you do things right the first time! </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">HOW LONG WILL IT TAKE TO COMPLETE THIS COURSE</strong></p>\n\n\n\n<p>You should expect it to take between 4-8 months to complete all of the components of you design portfolio if you are starting it from scratch. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">ARE THERE 1 ON 1 MENTORING SESSIONS PROVIDED WITH THIS COURSE</strong></p>\n\n\n\n<p>Mentorship in this UDEMY course is provided through mentor guided video lectures and written documentation only. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">WHAT PEOPLE HAVE TO SAY ABOUT THE INSTRUCTOR</strong> </p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Hi there! My name is Antoine Ladouceur and Jarett was my instructor at the Art Institute of Vancouver. Boy was I lucky to have him! <strong class=\"redactor-inline-converted\">If I’m working as a Level Designer today it’s definitely because of his incredible support and advice</strong>. Having Jarett as an instructor was a little bit like opening a window onto the entire spectrum of game development. I felt like not only did I learn how to make good game design choices, but also how those choices would affect development overall. I learned what its like to work in a professional game development team and how to structure my work to fit well in that framework. --Overall, <strong class=\"redactor-inline-converted\">my first day on the job felt quite easy from everything I had learned from Jaret</strong><strong class=\"redactor-inline-converted\">t</strong>. He is a terrific instructor, straight to the point and very passionate about what he does and it’s definitely contagious.\"</em></p>\n\n\n\n<p>- <strong class=\"redactor-inline-converted\">Antoine Ladouceur</strong>, <em class=\"redactor-inline-converted\">Jr. Level Designer,</em> <em class=\"redactor-inline-converted\">Compulsion Games\"</em></p><p><em class=\"redactor-inline-converted\">\"Many of the choices I make as a Level Designer to improve my work came from advice that Jarett gave me during my courses. With his guidance and in-depth feedback, I was able to create a portfolio that really allowed me showcase who I was and what I could offer to the industry. Jarett is extremely passionate about what he does. He can always recognize when someone has potential and he'll always do his best to make sure that potential flourishes, even if it means building from the ground up. Jarett always manages to inspire creativity and hard work and I can without a doubt say I was extremely fortunate to have him as my instructor.\"</em><br></p>\n\n<p><strong>- Zack Bryan</strong>, <em>Level Designer, Akimbo Creation's</em></p><p><br></p>\n\n\n\n<p><em class=\"redactor-inline-converted\"><br></em></p>", 
    "end_date": null, 
    "title": "Video Game Design: Create A Competitive Design Portfolio", 
    "price": "50.00", 
    "instructors": "Jarett Metcalfe", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/511006_cab9_4.jpg", 
    "course_url": "https://www.udemy.com/video-game-design-portfolio/", 
    "currency": "USD", 
    "subject_name": [
        "Game Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T16:20:55Z"
}