{
    "selfpaced": true, 
    "topic_name": [
        "Algebra & Geometry"
    ], 
    "description": "\n\n                    \n                    \n                    Vous voulez apprendre l'algèbre linéaire, un précieux outil complémentaire à vos connaissances acquises durant vos études en économie, ingénierie, physique, ou statistique? Ou simplement pour la beauté de la matière? Alors ce cours est fait pour vous! Outre remplir le rôle d'outil dans les différentes branches mentionnées ci-dessus (permettant la résolution de problèmes concrets), l'algèbre linéaire, qui capture l'essence des mathématiques -à savoir, l'algèbre et la géométrie- vous introduira au monde plus abstrait des mathématiques.\n\nProposé comme complément de cours aux ingénieurs de première année à l'Ecole Polytechnique Fédérale de Lausanne, ce MOOC (composé de trois parties) n'en est pas moins un cours à part entière et peut être considéré comme une base solide d'algèbre linéaire pour tout étudiant intéressé par l'apprentissage de cette matière.\n\nBien que les vidéos constituent le coeur du cours, des exercices de type QCM (Questions à choix multiples) ainsi que des séries au format PDF seront disponibles chaque semaine, ainsi que des corrigés appropriés. Plus précisément, les séries d'exercices seront accompagnées d'un corrigé au format PDF et certains problèmes bénéficieront d'une correction détaillée en vidéo, dans laquelle l'un des enseignants présentera la solution, étape par étape. Finalement, chaque vidéo de cours sera suivie d'un quiz, dont le but est de tester le degré d’assimilation des connaissances acquises.\n\nLe cours est organisé en dix chapitres dans lesquels une approche très détaillée des concepts théoriques est proposée, ainsi que de multiples exemples illustratifs :\n\nSystèmes d'équations linéaires.\n\tAlgèbre matricielle.\n\tEspaces vectoriels.\n\tBases et dimensions.\n\tApplications linéaires.  \n\tMatrices et applications linéaires.\n\tDéterminants.\n\tVecteurs propres, valeurs propres, diagonalisation.\n\tProduits scalaires et espaces euclidiens.\n\tMatrices orthogonales et matrices symétriques.\nCette troisième (et dernière) partie du cours sera dévouée à l'étude des chapitres 9 et 10 cités plus haut. Une bonne connaissance de la matière enseignée dans les MOOCs Algèbre Linéaire (Partie 1) et Algébre Linéaire (Partie 2) est requise. Aussi, il est conseillé de travailler régulièrement et de manière assidue, de façon à ne pas prendre de retard lors de l'apprentissage de la matière. \n\n                                    ", 
    "end_date": null, 
    "title": "Algebre3X: Algèbre Linéaire (Partie 3)", 
    "price": 0, 
    "instructors": "Donna Testerman", 
    "institution_name": [
        "École Polytechnique Fédérale de Lausanne"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.edx.org/course/algebre-lineaire-partie-3-epflx-algebre3x-0", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-02-01T00:00:00Z"
}