{
    "selfpaced": true, 
    "topic_name": [
        "Algebra & Geometry"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Mathematics\n                                                                                                    &gt; Algebra &amp; Geometry\n                                                            \n                            \n                                                \n                    \n                    \n                    We live in a world of numbers. You see them every day: on clocks, in the stock market, in sports, and all over the news. Algebra is all about figuring out the numbers you don't see. You might know how fast you can throw a ball, but can you use this number to determine how far you can throw it? You might keep track of stock prices, but how can you figure out how much money you've made (or lost) in the market? And you may already know how to tell time, but can you calculate at what times a clock's hour and minute hands are exactly aligned? With algebra, you can answer all of these questions, using the numbers you already know to solve for the unknown. Algebra is an essential tool for all of high school and college-level math, science, and engineering. So if you're starting out in one of these fields and you haven't yet mastered algebra, then this is the course for you!\n \nIn this course, you'll be able to choose your own path within each lesson, and you can jump between lessons to quickly review earlier material. AlgebraX covers a standard curriculum in high school Algebra I, and CCSS (common core) alignment is indicated where applicable.\n\nLearn more about our High School and AP* Exam Preparation Courses\n\n                                    ", 
    "end_date": "2019-07-05T00:00:00Z", 
    "title": "AlgebraX: Introduction to Algebra", 
    "price": 0, 
    "instructors": "Zach Wissner-Gross", 
    "institution_name": [
        "Schoolyourself"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.edx.org/course/introduction-algebra-schoolyourself-algebrax-1", 
    "duration": "157 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-07-01T00:00:00Z"
}