{
    "selfpaced": false, 
    "topic_name": [
        "Algebra & Geometry"
    ], 
    "description": "\n\n                    \n                    \n                    A very beautiful classical theory on field extensions of a certain type (Galois extensions) initiated by Galois in the 19th century. Explains, in particular, why it is not possible to solve an equation of degree 5 or more in the same way as we solve quadratic or cubic equations. You will learn to compute Galois groups and (before that) study the properties of various field extensions.\n\nWe first shall survey the basic notions and properties of field extensions: algebraic, transcendental, finite field extensions, degree of an extension,  algebraic closure, decomposition field of a polynomial. \nThen we shall do a bit of commutative algebra (finite algebras over a field, base change via tensor product) and apply this  to study the notion of separability in some detail. \nAfter that we shall discuss Galois extensions and Galois correspondence and give many examples (cyclotomic extensions, finite fields, Kummer extensions, Artin-Schreier extensions, etc.). \nWe shall address the question of solvability of equations by radicals (Abel theorem). We shall also try to explain the relation to representations and to topological  coverings. \nFinally, we shall briefly discuss  extensions of rings (integral elemets, norms, traces, etc.) and explain how to use the reduction modulo primes to compute Galois groups.\n\nPREREQUISITES \nA first course in general algebra — groups, rings, fields, modules, ideals. Some knowledge of commutative algebra (prime and maximal ideals — first few pages of any book in commutative algebra) is welcome. For exercises we also shall need some elementary facts about groups and their actions on sets, groups of permutations and, marginally, \nthe statement of Sylow's theorems.\n\nASSESSMENTS\nA weekly test and two more serious exams in the middle and in the end of the course. For the final result, tests count approximately 30%, first (shorter) exam 30%, final exam 40%.\n\nThere will be two non-graded exercise lists (in replacement of the non-existent exercise classes...)\n\n                                            Syllabus\n                        IntroductionThis is just a two-minutes advertisement and a short reference list.Week 1We introduce the basic notions such as a field extension, algebraic element, minimal polynomial, finite extension, and study their very basic properties such as the multiplicativity of degree in towers.Week 2We introduce the notion of a stem field and a splitting field (of a polynomial). Using Zorn's lemma, we construct the algebraic closure of a field and deduce its unicity (up to an isomorphism) from the theorem on extension of homomorphisms.Week 3We recall the construction and basic properties of finite fields. We prove that the multiplicative group of a finite field is cyclic, and that the automorphism group of a finite field is cyclic generated by the Frobenius map. We introduce the notions of separable (resp. purely inseparable) elements, extensions, degree. We briefly discuss perfect fields. This week, the first ungraded assignment (in order to practice the subject a little bit) is given. Week 4This is a digression on commutative algebra. We introduce and study the notion of tensor product of modules over a ring. We prove a structure theorem for finite algebras over a field (a version of the well-known \"Chinese remainder theorem\").Week 5We apply the discussion from the last lecture to the case of field extensions. We show that the separable extensions remain reduced after a base change: the inseparability is responsible for eventual nilpotents. As our next subject, we introduce normal and Galois extensions and prove Artin's theorem on invariants. This week, the first graded assignment is given.Week 6We state and prove the main theorem of these lectures: the Galois correspondence. Then we start doing examples (low degree, discriminant, finite fields, roots of unity).Week 7We continue to study the examples: cyclotomic extensions (roots of unity), cyclic extensions (Kummer and Artin-Schreier extensions). We introduce the notion of the composite extension and make remarks on its Galois group (when it is Galois), in the case when the composed extensions are in some sense independent and one or both of them is Galois. The notion of independence is also given a precise sense (\"linearly disjoint extensions\"). This week, an ungraded assignment is given.Week 8We finally arrive to the source  of Galois theory, the question which motivated Galois himself: which equation are solvable by radicals and which are not? We explain Galois' result: an equation is solvable by radicals if and only if its Galois group is solvable in the sense of group theory. In particular we see that the \"general\" equation of degree at least 5 is not solvable by radicals. We briefly discuss the relations to representation theory and to topological coverings.Week 9.We build a tool for finding elements in Galois groups, learning to use the reduction modulo p. For this, we have to talk a little bit about integral ring extensions and also about norms and traces.This week, the final graded assignment is given.\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "Introduction to Galois Theory", 
    "price": 0, 
    "instructors": "Ekaterina Amerik", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/galois", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}