{
    "selfpaced": true, 
    "topic_name": [
        "Algebra & Geometry"
    ], 
    "description": "\n\n                    \n                    \n                    This mini-course is intended for students who would like a refresher on the basics of linear algebra. The course attempts to provide the motivation for \"why\" linear algebra is important in addition to \"what\" linear algebra is.\n\nStudents will learn concepts in linear algebra by applying them in computer programs. At the end of the course, you will have coded your own personal library of linear algebra functions that you can use to solve real-world problems.Why Take This Course?You should take this course if:\n\n - You want a refresher on the basics of linear algebra or want to learn them for the first time\n - You want to see how linear algebra can be applied to real-world problems.\n - You want to learn linear algebra in the context of programming.\n\n                                            Syllabus\n                        ### Lesson 1: Vectors\nYou will begin by learning about the basic operations on vectors (one of the fundamental objects of study in linear algebra). You will code a library of functions to perform operations on vectors that you will use in later lessons.\n\n### Lesson 2: Intersections\nYou will learn the geometric and algebraic interpretation of intersections of \"flat\" objects such as lines and planes and how they are used to solve real-world problems. You will also write your own algorithm to find the intersections of sets of lines and planes.\n                                    ", 
    "end_date": null, 
    "title": "Linear Algebra Refresher Course", 
    "price": 0, 
    "instructors": "Chris Pryby", 
    "institution_name": [], 
    "commitment": "6 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.udacity.com/course/linear-algebra-refresher-course--ud953?utm_medium=referral&utm_campaign=api", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2016-02-23T00:00:00Z"
}