{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Chrome Extensions</strong></p><p>During this Chrome Extensions video training course, you will review some popular and useful Extensions. Browser extensions can add a great deal of functionality to a browser. Because Google allows anyone to easily post an Extension in the Google store, there are a great number and variety of extensions. Google does review and scan extensions for viruses and malware before they're listed in the Google store.</p><p>Although this course is designed for anyone, there are a few extensions covered that might goes into some advanced concepts such as SEO numbers. Users are encouraged to skip through the lectures to find sections &amp; extensions that appeal to them.</p><p>It's highly recommended that you already have Chrome installed prior to the course, most devices already have it and it's very easy to install, just Google “Install Chrome\".</p><p>This is a supplemental course to Chrome and I kept it short. Udemy requires courses to be at least 30 minutes long.</p><p>There is a brief video introduction and several video sections, they are followed by a recap, a short quiz and a documents section at the end which has a copy of the slides and a few additional materials.</p><p>This course includes a quiz and certificate of completion.</p><p>This course was made in high-definition and is best viewed with the DH setting on and with the videos enlarged. Feedback is a critical part of an online course. Once you have completed the course, providing comments helps improve the course and benefits everyone, so let me know what you think.</p>", 
    "end_date": null, 
    "title": "2015 Tech - Chrome Extensions", 
    "price": 0, 
    "instructors": "Tom Lahey", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516252_f4ab_2.jpg", 
    "course_url": "https://www.udemy.com/2015-tech-chrome-extensions/", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T18:33:01Z"
}