{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>During this Chrome video training course, you will learn key overviews of Chrome and some general background on browsers. In some ways browsers are easier than ever, but as more features and synchronization are built in, there are a few items you should know. There are some great tips and you be able to find at least a few that will make your more productive or save you some stress down the line.</p><p>We will try to stay away from any technical terms and keep things as straightforward as possible. A few technical terms sneak in, but they will be explained.</p><p>It's highly recommended that you already have Chrome installed prior to the course, most devices already have it and it's very easy to install, just Google “Install Chrome\".</p><p>This is the Overview course and it is under 40 minutes. It's here to give you the big picture. I am working on the Expanded course that has more of the details and examples if you want to go deeper. I have posted the Chrome Extensions course.</p><p>There is a brief video introduction and several video sections, they are followed by a recap, a short quiz and a documents section at the end which has a copy of the slides and a few additional materials. Many of the individual sections may have other information and links, be sure to check. </p><p>This course includes a quiz and certificate of completion.</p><p>This course was made in high-definition and is best viewed with the DH setting on and with the videos enlarged. Feedback is a critical part of an online course. Once you have completed the course, providing comments helps improve the course and benefits everyone, so let me know what you think.</p>", 
    "end_date": null, 
    "title": "2015 Tech - Chrome tips & cool features", 
    "price": 0, 
    "instructors": "Tom Lahey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/509288_645f_3.jpg", 
    "course_url": "https://www.udemy.com/2015-tech-chrome-tips-cool-features/", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-22T23:55:07Z"
}