{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Aplicaciones para Android para controlar la contabilidad personal hay muchas, pero ninguna es flexible a la hora de adaptarla a nuestras necesidades<br></p>  <p>  \t              Algunas son excesivamente complicadas. Otras en cambio parecen adaptarse aceptablemente pero la interfaz no es práctica o carece de sincronización en tiempo real, limitándose a las típicas exportaciones de datos del siglo pasado  </p>  <p>  \t              Por eso he creado un sistema con los datos necesarios y mínimos para mantener una Contabilidad Doméstica o Personal sin grandes complicaciones  </p>  <p>  \t              Lo bueno de este sistema es el proceso, su adaptabilidad a tus necesidades y la potencia de las herramientas empleadas (Drive + Android)  </p>  <p>  \t              Una aplicación para contabilidad doméstica es como un traje comprado en una gran superficie, cortados todos por el mismo patrón, mientras que este sistema es como tener la tela, las tijeras y los conocimientos para hacerte tu propio traje  </p>  <p>  \t              Además el método empleado para crear el Sistema de Contabilidad Personal puede adaptarse a cualquier sistema que requiera la captura ágil y en tiempo real de datos, para su posterior análisis mediante hojas de cálculo  </p>  <p>  \t                  En este Taller aprenderás a:  </p>  <p>  \t                  - Registrar tus gastos e ingresos, rápidamente y en tiempo real desde tu smartphone  </p>  <p>  \t                  -Sincronizar dichos datos con Google Drive  </p>  <p>  \t                  -Analizarlos por meses en tu ordenador o tablet  </p>  <p>  \t                  -Realizar un resumen anual con gráficas  </p>  <p>  \t                  -Obtener promedios que te sirvan para proyectar tus meses futuros  </p>  <p>  \t                  Este curso requiere que:  </p>  <p>  \t                  -Tengas un smartphone Android y un ordenador, ambos con aceso a Internet  </p>  <p>  \t                  -Conozcas mínimamente lo que es una hoja de cálculo, una función, un rango... Bastará con que tengas una idea de lo que es ya que las funciones empleadas se explican al detalle  </p>  <p>  \t                  -Tengas una cuenta de Gmail  </p>  <p>  \t                  -Instales una aplicación gratuita de la Play Store de Google en tu dispositivo  </p>  <p>  \t                  -Opcionalmente puedes acceder a los archivos empleados para analizar el funcionamiento de las fórmulas. En ningún caso debes emplearlos en serio, sin antes llevar a cabo una revisión y verificación exahustiva  </p>  <p>  \t            Recuerda que no estás solo. Cuentas con mi asistencia durante el curso  </p>  <p>  \t                  Empieza a tomar control sobre tu economía; es el primer paso para establecer un futuro cómodo, sin disgustos ni sobresaltos. Mejor no dejarlo en manos del destino ni a merced de intereses ajenos  </p>", 
    "end_date": null, 
    "title": "Controla tu economía desde tu móvil Android y Google Drive", 
    "price": "20.00", 
    "instructors": "Juan Manuel Ríos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313954_de45.jpg", 
    "course_url": "https://www.udemy.com/controla-tu-economia-desde-tu-movil-android-y-google-drive/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-05T20:27:12Z"
}