{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t      With 850 students in the first five weeks after being published, this course in Google Apps has shown to be of tremendous value. It is a comprehensive course for all-levels of users, and is updated regularly as Google releases new features to the Google Apps Suite.  </p>  <p style=\"\">  \t                  In this course I introduce the concept of <strong style=\"\">Cloud Computing, Google Drive</strong>, and the <strong style=\"\">Google Apps </strong>suite of tools for an educational environment. In this course, I will address how to get started using Google Drive as a storage for digital files of any kind like; pictures, audio, video, MS Word, Keynote, PDF, and so on. This course will cover the use of:  </p>  <ul style=\"\">  \t<li style=\"\">Google Docs</li>  \t<li style=\"\">Google Sheets</li>  \t<li style=\"\">Google Slides</li>  \t<li style=\"\">Google Forms </li>  \t<li style=\"\">Google Classroom (coming soon)</li>  </ul>  <p style=\"\">  \t                For the most part, the approach this course takes is for teachers in a classroom setting, but as you will see, all the tools can be used by anyone wanting to use cloud-based applications for <em style=\"\">writing</em>, <em style=\"\">collaborating</em>, <em style=\"\">collecting and analyzing data</em>, and <em style=\"\">sharing resources</em>.  </p>  <p style=\"\">  \t              The structure and design of this course is based on real-world classroom environments where students are asked to complete and work on projects in a digital world. The <strong style=\"\">Google Apps for Education</strong> suite of tools provides an opportunity for teachers to connect with students outside of class, and to offer students the ability to collaborate with one another in the <strong style=\"\">Cloud</strong>.  </p>  <p style=\"\">  \t              This course uses video, screencast lessons, links to external videos and websites, and also has some projects for you to complete. The project files are structured as step-by-step manuals with a variety of challenges for you to complete. They will test what you have learned in each of the lessons. There is one project per section in the course on each of the four major Google Apps.  </p>  <p style=\"\">  \t              This course is best completed in about a week. Assuming that you will work an hour or so a day, it should be easy to complete all of the lessons and projects within one week.  </p>  <p style=\"\">  \t              Teachers or faculty and staff looking to engage students in using digital tools for classroom activities will benefit tremendously from the lessons and projects in this course. Anyone looking to level-up their use of Google&#039;s suite of digital tools will find these activities of particular value.  </p>  <p style=\"\">  \t<em style=\"\">This course is designed for all levels.</em><br style=\"\">  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">This course was last updated 10/16/2014</strong></em>  </p>", 
    "end_date": null, 
    "title": "Create, Collaborate & Work Dynamically Online in Google Apps", 
    "price": "20.00", 
    "instructors": "Jonathan Jarc, M.Ed", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266714_1569_6.jpg", 
    "course_url": "https://www.udemy.com/google-drive-and-google-apps-for-education/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T19:11:41Z"
}