{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Did you know with Gmail you can automate up to 70% of all your email tasks?</strong></p><p>In this course I'll teach you the exact habits and workflows I've been using to reach inbox zero daily for 5 years in a row.</p><p>You will learn:</p><ul><li>How to set up Gmail more maximum efficiency</li><li>The 10 step workflow that will double the speed at which you process email</li><li>How to reduce the amount of junk email that clutters your inbox to almost zero</li><li>How to automate the most tedious and repetitive email tasks</li><li>The best practices to outsource your inbox to a virtual assistant</li><li>The exact methodology I've used to hire the best possible virtual assistant</li></ul><p>If you are like me checking your email is not only a daily chore, you could say it's even an addiction that consumes hundreds of valuable hours of our time every year.<br></p><p>The thing is as much as I hate email, dealing with it is a necessity in order to run my business. I used to struggle keeping up with it. My inbox was a mess with hundreds of emails that would go unread for weeks and sometime forever.</p><p>Eventually I had enough and decided to take control and find an effective way to manage my inbox. It took me a while to develop the right habits and figure things out but eventually I did and <strong>for the last 5 years I've been able to reach inbox zero</strong> every single day except for two trips (one to Machu Picchu and one to the Amazon jungle). </p><p><strong></strong></p><p><strong></strong><strong>Is this course for you?</strong> If any of the following statements is true for you then the answer is yes.</p><p>- My inbox is a mess<br>- I have hundreds of unread emails<br>- I don't know how to automate anything in Gmail<br>- I don't know how to use labels<br>- I am constantly checking my email<br>- I don't know how to stop getting tons of junk mail<br>- I keep missing important messages<br>- I forget to reply to emails</p><p>Are you ready to finally take control over your inbox and show Gmail who is the boss?</p><p>It's time to Dominate Gmail!!!</p><p><br></p>", 
    "end_date": null, 
    "title": "Double your Gmail productivity in just over one hour", 
    "price": "20.00", 
    "instructors": "Miguel Hernandez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726230_e2ca_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-master-gmail/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T23:28:09Z"
}