{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>BIG NEWS: OVER 4,100+ STUDENTS HAVE ENROLLED IN THIS COURSE!  </p>\n\n<p>  \t<em>The Latest: Effortless Email was updated on May 20th, 2016</em></p>\n\n<p>  \t<strong><em>WHAT STUDENTS ARE SAYING:</em></strong>  </p>\n\n<p>  \t<strong>  “If you have an 'email problem', then you need this. Period.\"</strong> - <em>Andre Chaperon: Author of Autoresponder Madness</em>  </p>\n\n<p>  \t<strong>  “I'm only on Module 3 and I'd say that <em>conservatively</em> I've probably saved myself at least an hour a day in email time. Worth way more than the asking price already.\"</strong> -<em> Daegan Smith, Entrepreneur</em>  </p>\n\n<p>  \t<strong>  “I am loving your system and already seeing great results. You clearly have developed a great system.\"</strong> - <em>Cameron Lawrence: Professor at UM School of Business, London School of Economics PhD.</em>  </p>\n\n<p>  \t<strong>“I went from 26,000 emails down to ZERO! I'm getting a lot out the course, and I'm only on Module 5\"</strong>. - <em>Jill Shearer, Entrepreneur</em>  </p>\n\n<p>  \t<strong>“I finally have an empty inbox and a workflow that helps me stay in control of my email. I truly appreciate it. Thanks to you it's my wife and children who'll profit from it the most. :)\" </strong>- <em>Hashim Naushahi</em>  </p>\n\n<p>  \t<strong>  “I really enjoy your teaching style. Easy to digest and understand modules. No other course out there that teaches this stuff all together. You're a great teacher. Not everyone can teach, believe me.\"</strong> - <em>Eduardo Hermosilla</em>  </p>\n\n<p>  \t              Hey friendo, how's that inbox looking?  </p>\n\n<p>  \t                                                                                                Do you ever wish you didn't have an endless pile of email to sift through, so you could focus on what was truly important in your life?  </p>\n\n<p>  \t                                                                                                     My name is Arman Assadi, I'm a <em>former Googler</em> and creator of the Effortless Email program.  </p>\n\n<p>  \t                                                                                                Inside this course you'll learn how to reclaim the hours of time spent inside your inbox, create a custom, bulletproof system that actually works, and finally achieve <em>inbox zero for good.</em>  </p>\n\n<p>  \t                                                                                                It has taken years to build and perfect this system, which all started when I was working on the Google Apps (Gmail) team.  </p>\n\n<p>  \t                                                                                                     I've personally helped all types of people implement these learnings into their lives: from <em>CEO's and entrepreneurs, to professionals, corporate managers, and everyday users.</em>  </p>\n\n<p>  \t                                                                                                Effortless Email already has hundreds of raving fans and customers, and we are excited to now offer the course on Udemy!  </p>\n\n<p>  \t<strong>What will I get out of taking this course?</strong>  </p>\n\n<ul>  \t<li>Your time back: save over 8 hours per week (384 hours per year) on email.</li>  \t<li>  \t  \t\t                                                                                                You'll finally have a real “inbox zero\" (it's not a myth, folks) for good and eliminate all your email worries  \t  \t</li>  \t<li>  \t  \t\t                                                                                                How to reboot and refresh your inbox no matter how many emails you have! Watch me as I take the inbox of a CEO from over 34,000 emails to ZERO.  \t  \t</li>  \t<li>  \t  \t\t                                                                                                The methods to massively boost your effectiveness and productivity so you can have true peace of mind  \t  \t</li>  \t<li>  \t  \t\t                                                                                                The secret to completely eliminating spam and unwanted, annoying emails forever  \t  \t</li>  \t<li>  \t  \t\t                                                                                                One custom Gmail inbox for all your accounts that automatically and effortlessly shows you only the most important emails  \t  \t</li>  </ul>\n\n<p>  \t<strong>What's inside and what materials are included?</strong>  </p>\n\n<ul>  \t<li>Instant access to 11 modules of easy to understand, 1-on-1, step-by-step <em>HD tutorial videos and downloadable PDF Summary Guides</em></li>  \t<li>You'll have<em> lifetime access</em> to the system, which means as the course evolves and updates are made you'll still have access.</li>  \t<li>An inside view and videos of real Gmail email accounts, where I walk you through every single step of the Effortless Email process.</li>  \t<li>A complete <em>downloadable eBook version</em> of the entire course — included for free <em>(value $49).</em></li>  </ul>\n\n<p>  \t<strong>How long is the course?</strong>  </p>\n\n<p>  \t                                                                                                     Effortless Email has 11 modules of video content, averaging 20 minutes each. The course is designed to deliver each segment in easy to consume bite-sized chunks.  </p>\n\n<p>  \t                                                                                                     Complete each module at your own pace. Most people get through the entire course in one week, some people in just a couple days.  </p>\n\n<p>  \t<strong>Why should I take this course?</strong>  </p>\n\n<p>  \t                                                                                                     This is about much more than just email or inbox zero...  </p>\n\n<p>  \t                                                        This is about having the freedom to do <em>what we want, when we want, how we want</em>. Effortless Email will free you from your inbox, so you can focus on the more important things.  </p>\n\n<p>  \t<em>  If you value your time, this is for you. </em>This is not just a course on productivity or inbox management, it is an investment in yourself.  </p>\n\n<p>  \t                                                        Email is not going anywhere, and unless we're okay with being slaves to our inboxes we need to do something about it — fast.  </p>\n\n<p>  \t                                                                                                     Other systems tend to be too complicated (or too basic), and don't address the root of the problem. I've spent <em>years studying, identifying, and solving the issues</em> to help people fix this painful problem.  </p>\n\n<p>  \t                                                                                                     In order to solve the problem for good we need to take a closer look at our habits, and build a custom inbox that's designed to meet your specific needs — <strong>and that's exactly what Effortless Email will do for you. </strong>  </p>\n\n<p>  \t                                                                                                     I'm passionate about sharing this system with you because I know it will completely change the way you look at email.  </p>\n\n<p>  \t                                                                                                     No more stress, no more annoying emails, and no more overflowing and unorganized inboxes. Just an effortless system that will finally help you reclaim your time, get you to inbox zero, and keep you there.  </p>\n\n<p>  \t                                                                                           P.S. We are currently offering the course at a <strong>special introductory pricing</strong> on Udemy, and this will be increasing very soon — so act now!  </p>\n\n<p>  \t<strong><em>Important note:</em></strong> I will personally respond to any questions you may have throughout the course, and will coach you throughout the entire process. I hope to become your friend and trusted advisor, and look forward to seeing your success! :)  </p>\n\n<p>  \t<strong><em>Free Preview</em></strong>: Did you know you can preview the course for free? Lecture 7 (my personal favorite) is a 21 minute module you can go through right now!  </p>\n\n<p>  \t<strong>30 Day No Questions Asked Guarantee: </strong>Enroll now and go through the course. If in the next 30 days you don't feel you've reclaimed HOURS per week and all but eliminated your email stress, Udemy will instantly refund every penny of your money back!  </p>\n\n<p>  \t                                                        SO — click the blue \"<strong>Take This Course</strong>\" button in the top-right hand corner of your screen and enroll today. See you on the inside... :-)  </p>\n\n<p>  \t<strong> FAQ</strong>  </p>\n\n<p>  \t<strong></strong><strong>1. Will this work for me if I'm not currently using Gmail as my main/primary work or personal email? And what if there's no way I can make the switch?</strong>  </p>\n\n<p>  \t                                                                                    Yes. A large percentage of Effortless Email students were using Outlook, Mac Mail, Yahoo, Hotmail, etc. prior to starting the course. The <em>hands-on</em> portions of the course are taught in Gmail, so if you're stuck using Outlook at work this may not be ideal.  </p>\n\n<p>  \t<strong>2. </strong><strong>I don't use Gmail for my business, mainly because I don't know why I should. What are the benefits?</strong>  </p>\n\n<p>  \t                                                                                    Security: Your work is automatically backed up in the cloud, and you own/control your data. Collaboration: The ability to use tools like Drive/Docs/Calendar that integrate seamlessly. Customization: Gmail has a powerful &amp; customizable user interface.  </p>\n\n<p>  \t<strong>3. </strong><strong>I have over 100,000 emails, are you sure you can help me?</strong>  </p>\n\n<p>  \t<strong></strong>One of the very first Effortless Email students had over 200,000 emails unsorted emails in his inbox. He is now achieving inbox zero daily. Email had been a huge problem for 5+ years, and he made a complete turnaround in less than a week.  </p>\n\n<p>  \t<strong>4. I have a Gmail account but I haven't switched over completely or updated all the services that already have my old email. Seems hard, how can I do this?</strong>  </p>\n\n<p>  \t                                                                                    This process is incredibly easy and fast. Module 4 address this.  </p>\n\n<p>  \t<strong>5. I want to use my own custom domain name. Is this possible with Gmail?</strong>  \t                                                                                   Yes, there are two methods. Addressed in detail in Module 6.  </p>", 
    "end_date": null, 
    "title": "Effortless Email: Achieve Inbox Zero for Good & Master Gmail", 
    "price": "50.00", 
    "instructors": "Arman Assadi", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42321_63d4_7.jpg", 
    "course_url": "https://www.udemy.com/effortless-email/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-19T03:43:43Z"
}