{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Welcome to <em>Getting Started with Google Office: Docs, Sheets, Slides</em> from LearnSmart.</p><p><strong>Master Strategies for Effectively Utilizing the Google Drive Applications</strong><br></p><ul><li>Learn about Google Documents (Docs), Google Spreadsheets (Sheets), and Google Presentation (Slides)</li><li>As introductory courses cover key fundamentals and watch live demonstrations to get the most out of this cloud sharing system</li><li>Be able to get started and to collaborate with others!</li></ul><p><br><strong>At the end of this course, you will be able to confidently create, edit, and share presentations, documents, and spreadsheets!</strong><br></p><p>This course is a bundle of the following LearnSmart courses, and includes comprehensive information for the following topics:</p><ul><li><em>Google Docs Part 1</em>: Getting Started, Document Fundamentals, Document Formatting and Customization in Google Documents</li><li><em>Google Docs Part 2</em>: -Working with Tables, Proofing, Navigation Techniques and Document Distribution in Google Documents</li><li><em>Google Spreadsheets Part 1:</em> Getting Started, Spreadsheet Fundamentals and Beyond the Basics in Google Spreadsheets.</li><li><em>Google Spreadsheets Part 2:</em> Enhancing Spreadsheets, Spreadsheet Organization &amp; Optimization and Spreadsheet Distribution in Google Spreadsheets</li><li><em>Google Slides Part 1:</em> Getting Started, Presentation Fundamentals, Formatting Text and Drawing Options in Google Presentations</li><li><em>Google Slides Part 2: </em>Working with Images, Video and Tables, Animating Slide Elements, Collaboration and Distribution in Google Presentations</li></ul><p><strong>Recommendations:</strong><br><br>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li><em></em><em>This course is of high quality - The instructor is highly engaging and highly motivating. Can't be better. Thank you -- Saber Tlil</em></li><li><em></em><em>Excellent class! -- Amazing - I only gave 5 starts because I was not able to give more .. One of the best teachers I have seen at Udemy and the course that I have looked for years. </em><em>Thanks and keep ahead\" -- Carlos Rodriguez</em></li></ul>", 
    "end_date": null, 
    "title": "Getting Started with Google Office: Docs, Sheets, Slides", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587890_e4dd.jpg", 
    "course_url": "https://www.udemy.com/google-office-docs-sheets-slides/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T22:19:45Z"
}