{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t      Save time and stay connected by using Google Docs as your go-to word processor. Google Docs, and the entire Google Apps suite of tools help to keep the members of your team, your classroom, or your staff on the same page as you create, collaborate and publish online.  </p>  <p style=\"\">  \t      Using Google&#039;s free, cloud-based word processor will help you save time, save money, and boost productivity. This course is designed to build user confidence and streamline teamwork across multiple devices and even global regions.  </p>  <p style=\"\">  \t      Some of the benefits of using Google Docs include:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Completely Free</strong> - Google Docs and the Google Apps suite of tools is always free. Your personal account and Apps for Education are always free. However, if you look to Google Apps for Business, you may see some costs for increased storage or email accounts and filtering.</li>  \t<li style=\"\"><strong style=\"\">Easy Collaboration - </strong>quickly and easily share, work together, and publish in real-time. Keep all your team members on the same page, store all your files in the cloud in your Google Drive account - attached to Google Docs. </li>  \t<li style=\"\"><strong style=\"\">Work from Anywhere - </strong>the entire suite of tools is cloud-based, and works on any device with any browser...even on the iPad! If you can get connected to the internet, you can use Google Docs. </li>  </ul>  <p style=\"\">  \t  In this course, I will show you how to get your account established, how to access Google Drive, and how to start and save Google Docs. I will also show you how to manage folders in your Google Drive, to keep your online document storage organized and thoughtful.  </p>  <p style=\"\">  \t  Once you are familiar with connecting and accessing your documents, this course will teach you the skills you need to be successful in building, storing, sharing and publishing a variety of document types.  </p>  <p style=\"\">  \t  I will show you how to type, change formatting, build styles, change document layouts, print settings, manage lists, and tables. The list of features in Google Docs continues to grow, and can even be extended by using add-ons from the Google Marketplace. In this course, we look at the core structure and function of Google Docs, and also how to extend it&#039;s functionality and features.  </p>  <p style=\"\">  \t  The course is structured for your hands-on access to tools and projects to reinforce learning. After each section of the course, there are projects to complete that will challenge you to try what you have learned in a live environment. You will be asked to build, design and share what you have learned with others in the community, or in your own workspace.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">The progression of the course is designed to be an ongoing, collaborative, workshop-style approach, that will keep users coming back to learn and try more!</em></strong>  </p>  <p style=\"\">  \t  Our Google+ group is designed to help build community and support for those learning to write and publish using Google Docs.  </p>  <p style=\"\">  \t  This course is designed to be a comprehensive look at the application Google Docs. The intent is to cover basic functionality up through advanced add-ons and functions for all levels of users in the application.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">This course has something for all levels - from novice to advanced!</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Google Docs A-Z: Write, Collaborate, Store & Share Online", 
    "price": "25.00", 
    "instructors": "Jonathan Jarc, M.Ed", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351584_7210_2.jpg", 
    "course_url": "https://www.udemy.com/google-docs-a-z-write-collaborate-store-share-online/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T05:01:28Z"
}