{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong></strong><strong>Google Apps</strong> is a suite of apps which offers a free alternative to Microsoft Office or Microsoft Office 365, respectively. Each Google Apps corresponds to a product you might already know:</p><ul><li><strong>Gmail</strong> (= Microsoft Outlook)</li><li><strong>Calendar </strong>(=Microsoft Outlook Calendar)</li><li><strong>Hangouts</strong> (= Skype)</li><li><strong>Drive</strong> (= Drop Box)</li><li><strong>Docs </strong>(= Microsoft Word)</li><li><strong>Sheets </strong>(= Microsoft Excel)</li><li><strong>Presentations</strong> (= Microsoft Power Point)</li></ul><p><br>The course is addressed to everyone who is new to Google Apps, or to Google Apps for Work which is a corporate version of Google Apps. </p><p>Especially if you used to work with <strong>Microsoft Office </strong>or<strong> Outlook</strong> this course might help you to overcome your initial difficulties. I will show you all essential <strong>DO's</strong> and <strong>DONT's</strong>.  </p><p>The course is divided into 47 short lectures - each of them providing all necessary information about a topic but not wasting time in repetitions. My motivation for the course was to pass on my own experiences I had when being new to Google Apps.</p><p>I want you to <strong>save time</strong> and avoid fears of contact which I had myself. Further, I will pass on some tips and tricks which took me some time to discover but which provide very useful shortcuts for your daily work.</p><p>When I worked for a multinational company we have switched from Microsoft Exchange to Google Apps and I trained quite a few colleagues in how to use Google Apps. I have got to know all stumbling blocks but also all the great advantages which Google Apps will bring to you. </p><p>This course will guide you step by step through the single apps and explain how they interact with each other.</p><p>Now enjoy and have fun!</p>", 
    "end_date": null, 
    "title": "Google Apps for Beginners", 
    "price": "20.00", 
    "instructors": "Andreas Ruehlow", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529278_0b87_5.jpg", 
    "course_url": "https://www.udemy.com/google-apps-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T08:06:15Z"
}