{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong style=\"\">Learn How Use Google Hangouts to Grow Your Business by Cultivating Relationships, Hosting Webinars, Mastermind Groups, Collaborations, and more&hellip; for Zero Cost!</strong>  </p>  <p>  \t<em style=\"\">Watch step-by-step, click-by-click, how to use Google Hangouts and how to increase your web traffic, generate leads, and skyrocket your sales conversions at the same time.</em>  </p>  <p>  \tIt is becoming common knowledge that Webinars are the #1 online sales and marketing tool, not to mention using Webinars as an effective training and communication platform.  </p>  <p>  \t<strong style=\"\">If you haven&#039;t tried Google Hangouts, then the time to do so is now&hellip;</strong>  </p>  <ul style=\"\">  \t<li>Gather in the same room as everybody else, see their actual faces, interact, and use it as an instant relationship builder... with zero cost!</li>  \t<li>Collaborate in meetings with your co-workers, business partners, or prospective customers&hellip; with zero cost!</li>  \t<li>Present more effectively than ever before, show viewers files that you have working on, share your computer screen, and much, much, more&hellip; with zero cost!</li>  \t<li>Broadcast live on YouTube and host replays on one of the largest and most frequented websites in the world&hellip; again with zero cost!</li>  </ul>  <p>  \tWhat makes Google Hangouts so powerful is its integration with powerful apps that truly make the possibilities endless&hellip;  </p>  <p>  \tWhy spend hundreds of dollars a month on a webinar or meeting system with far less limiting features?  </p>  <p>  \tAnd it doesn&#039;t stop there&hellip;  </p>  <p>  \t<strong style=\"\">Google Hangouts is also compatible with mobile and tablet devices&hellip;</strong> yes, your iPhone and Android too. That means more people and more prospective customers to interact with anywhere... and as a business owner, that is huge!  </p>  <p>  \tWhether you want to use Google Hangouts for your business, non-profit organization, church, blog, website, or more&hellip; <strong style=\"\">in this video series you&#039;re going to learn everything to get started using Google Hangouts right now and the right way!</strong>  </p>  <p>  \tPlease enjoy!<br style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Google Hangouts for Business - Your Blueprint for Success", 
    "price": "25.00", 
    "instructors": "Crucial Advantage", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/111404_4fa1_6.jpg", 
    "course_url": "https://www.udemy.com/google-hangouts-for-business-your-blueprint-for-success/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-27T19:18:58Z"
}