{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Google Mail or for short Gmail - Increase Your Productivity.</strong></p><p><strong>***JOIN OVER 900 SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE*** </strong></p><p><strong>Students Say:</strong></p><ul><li><strong><em>\"</em><em>Nice course! - The instructor's voice and language is clear! And I've learned a lot from this course. Thanks Vlad!\"</em></strong></li></ul><ul><li><em><strong>\"Informative and well structured - Information is well structured and easy to understand. The best part is you can complete the entire course in under 1 hour.\"</strong></em></li></ul><ul><li><strong><em>\"Good course - This is a good course taking you through how to use google mail. I use it everyday, there weren't many things I didn't already know, but there were one or two and they were explained well. Good course if you aren't familiar yet, if you are you can skip to the sections you aren't so familiar with yet.\"</em></strong></li></ul><p><strong>30 DAYS MONEY BACK GUARANTEE</strong> (NO QUESTIONS ASKED)! </p><p> ++++++++++++++++++++++++++ </p><p>These videos provide you with detailed virtually \"over-the-shoulder\" style step-by-step HD video tutorials that leave no technical stone unturned.</p><p>Basically, the more acquainted you are with Gmail the more productive you become as you are using its full potential. </p><p><strong>This course can help you save two items that you can never have enough of - Time &amp; Money. </strong></p><p>Organize your Gmail today for the lowest price possible.</p><p>Best of luck,</p><p>-Vladimir Raykov</p>", 
    "end_date": null, 
    "title": "Google Mail - Increase Your Productivity", 
    "price": "20.00", 
    "instructors": "Vladimir Raykov", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493896_6b15_4.jpg", 
    "course_url": "https://www.udemy.com/google-mail-or-gmail-increase-your-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T06:04:07Z"
}