{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>May 22,2015<br></p><p>The Price was changed to $11 / Over 1100+ Students / 5 Stars Reviews</p><p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p>May 9, 2015</p><p>I lile to announced that new section was added - Questions and Answers.</p><p>In this section are solved visually your questions.</p><p>#1 Task:(solved)</p><p>How do we find information that is displayed on Google maps? For example, if I search for movie theatres in Chicago I see a set of red dots. How can I download all those location (name, address, etc) into excel?</p><p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p>WHO ELSE WANTS TO GET MAXIMUM FROM GOOGLE SEARCH BOX?</p><p>- AND GET IT EASILY AND INSTANTLY?</p><p>- AND FOR FREE?</p><p>- AND WITH NO EXPERIENCE OR KNOWLEDGE!</p><p>You are failing at Goole during searching, by missing a few Google Master Skills and you probably don't know that you are failing!</p><p>Google Master Skills are what distinguishes your Google Search Queries from everybody else's.</p><p>Over 90% of Google Search queries fail.</p><p>fail to find correct content</p><p>fail to find content instantly</p><p>fail to find specific information</p><p>fail to find correct services</p><p>fail to find correct technology news</p><p>fail to find correct market news</p><p>...</p><p>I'm Petr Hess and I'm Google Master Searcher and I like to share with you my experiences, my knowledge from 8 years of Google.</p><p>In this comprehensive video course, with full live examples, I take you gently by the hand as I show you how to get Google Master Skills.</p><p>++++++++++++++++++++++++++++++++++++++++</p><p>Start to use New style of Google Searching</p><p>++++++++++++++++++++++++++++++++++++++++</p><p>With billions of the search queries on Google these days it's the easiest way how to orchestrate Google searching</p><p>If you want to be a master with Google Search Box, this course is for you.</p><p>If you want to start use Google Search Box more effectively and faster, this course is for you.</p><p>If you want to know the best from Google Search Box, this course is for you.</p><p>All with my course:</p><p>You have unlimited lifetime access at no extra costs, ever</p><p>All future additional lectures, bonuses, etc in this course are always free</p><p>There's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</p><p>My help is always available to you if have a question</p><p>What are the requirements?</p><p>No experience of any kind is required</p><p>There's nothing to buy or pay for</p><p>A notebook and internet connection and Google Chrome browser</p><p>What am I going to get from this course?</p><p>Over 12 lectures and 1 hour of content!</p><p>Get more Google SearchBox features</p><p>Get more Google Search Box Skills</p><p>Get more practical skills with Google Search Box</p><p>Start work with Google more effectively and save time browsing all web pages</p><p>What is the target audience?</p><p>Anyone wishing to be very successful searcher on Google</p><p>New to Google Searching or a bit experienced - you'll still learn, grow your experiences and get more.</p>", 
    "end_date": null, 
    "title": "Google Search Engine: Master Skills For Searching ", 
    "price": "20.00", 
    "instructors": "Petr Hess", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/439854_3598_2.jpg", 
    "course_url": "https://www.udemy.com/google-search-box-master-skills-for-searching/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-05T20:50:36Z"
}