{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><em style=\"\">Attention: Local Business Owner or Online/Offline Marketer...</em>  <strong style=\"\">&quot;Discover How to Get Any Local Business to Page 1 of Google In Less Than 30 Days, Beat Out the Local Competition &amp; Get More Calls, Leads &amp; Sales Online!&quot;</strong>  And right now you are about to get access to the exact training course that you can use to do it fast! It&#039;s literally step by step... <br style=\"\"></p>    <p style=\"\">If you are a local business owner or online/offline marketer you probably realize that Google is a goldmine IF you can tap into it.</p>    <p style=\"\">And until recently, when a consumer typed a keyword phrase into Google there were just 10 results on the 1st page and that was it. You were competing with the entire country for 10 spots on that coveted first page. And that just wasn&#039;t gonna happen! <strong style=\"\">Not without spending big bucks on SEO!</strong></p>    <p style=\"\">And top it all off. IF you are still advertising in the telephone book, you realize that the phone book has died. You are not getting nearly as many calls as you once did and you don&#039;t know how to replace that income. You probably realize the internet is the key but where do you start?</p>    <p style=\"\"><strong style=\"\">Well, here&#039;s the deal...</strong></p>    <p style=\"\">Just 10 short years ago, over 90% of all consumers went straight to their phone book to find the products &amp; services they needed <strong style=\"\">BUT</strong>...</p>    <p style=\"\"><strong style=\"\">Today those numbers are much different...</strong></p>    <p style=\"\">Here&#039;s how the numbers break down today:</p>    <ul style=\"\">  \t<li style=\"\">97% of consumers start their search online AND...<br style=\"\">  </li>  \t<li style=\"\">82% of those consumers use Google<br style=\"\">  </li>  </ul>  <p style=\"\"><strong style=\"\">But here&#039;s the 1st potential killer for you...</strong></p>    <ul style=\"\">  \t<li style=\"\">93% of those searchers don&#039;t go past page 1<br style=\"\">  </li>  </ul>  <p style=\"\">That&#039;s right. The only people who really go past page 1 are researchers. Consumers will more than likely run a new search before they go to page 2 to see more results. </p>    <p style=\"\">So if you aren&#039;t on page 1 of Google, what are your chances of getting found by people looking for what you offer? If you said, &#039;slim to none&#039; you are correct. And since you realize that, you can get started now with Google Local the &#039;right way&#039; and step on your competitions throat. But before you do...</p>    <p style=\"\"><strong style=\"\">Here&#039;s the 2nd potential killer for you...</strong></p>    <p style=\"\">Google only shows up to a max of 7 local businesses on page 1 for any given keyword phrase. Why is that such a huge problem you ask?</p>    <p style=\"\"><strong style=\"\">Because chances are...</strong></p>    <p style=\"\">...you have more than 6 competitors in your area who do what you do, right? You may even have 70 competitors in your city and every single one of you are fighting for just 7 spots on page 1 of the world&#039;s most popular search engine.</p>    <p style=\"\"><strong style=\"\">Gone are the days of the full page phone book ad!</strong></p>    <p style=\"\">Back in the day, if you really wanted to clobber all of your local competitors, you would get a full page color ad in the phone book...in the best position available and your telephone would ring all week long.</p>    <p style=\"\"><em style=\"\">Well...Not any more!</em></p>    <p style=\"\"><strong style=\"\">Google Local Search is the Phone Book 2.0</strong></p>    <p style=\"\">There is no doubt that being on page 1 of Google will do wonders for your business, especially as more and more of the world goes &#039;mobile&#039;. In fact, something like 40% of all mobile searches have &#039;local intent&#039;.</p>    <p style=\"\"><strong style=\"\">So how do you get to page 1 of Google fast?</strong></p>    <p style=\"\">Yup! You guessed it. THIS online training course, of course. So here are the 3 steps you need to take right now if you want to dominate the 1st page of Google in your local area.</p>    <ul style=\"\">  \t<li style=\"\">Step 1. Subscribe to this course right now. <br style=\"\">  </li>  \t<li style=\"\">Step 2. Go through the information and do the steps as I teach them to you. <br style=\"\">  </li>  \t<li style=\"\">Step 3. Sit back and enjoy the new customers you get from being on page 1<br style=\"\">  </li>  </ul>  <p style=\"\">Not to mention the joy you will feel when you know your competitors are green with envy &amp; probably filled with a little bit of rage.</p>  Now Remember! You get a...    <p style=\"\">You have a full 30 days to try the course out and if, for any reason, you are not satisfied with it. You don&#039;t feel like doing the work. You don&#039;t like the way I teach. Or you just need the money back to make the rent or mortgage payment. Whatever the case...</p>    <p style=\"\"><strong style=\"\">You will get a complete refund...no questions asked!</strong></p>    <p style=\"\">The last thing I want is your money IF you feel like you didn&#039;t get a huge amount of value from my training course.</p>    <p style=\"\"><strong style=\"\">But I&#039;m not worried about that...</strong></p>    <p style=\"\">This course is literally a step by step guide to get your business on page 1 of Google fast. And it&#039;s the same exact process my employees use to rank our own private clients (who pay us $500 per month by the way).</p>    <p style=\"\">In fact, I actually sit them down on Udemy when they first start and make them watch the course while they do the steps with a new client. The same thing you are going to do to get your business ranked, if you are up for the challenge.</p>    <p style=\"\"><strong style=\"\">Check out the Free Vids below... </strong></p>    <p style=\"\">Awhile back, I put on a webinar for over 100 business owners who belong to the same Chambers of Commerce as I do and you can get access to it right now for Free.</p>    <p style=\"\">I broke the webinar up into chunks to make it easier to go directly to a topic you are interested in. So check those out now before you get started with the course.</p>    <p style=\"\"><strong style=\"\">Oh by the way...</strong></p>    <p style=\"\">The audio quality of the training course is much better than the audio from the webinar. Sometimes those webinars don&#039;t give back the best audio. It&#039;s not horrible but the actual training is much more crispy clear.</p>    <p style=\"\">I look forward to training you on Google Local Search so you can get your business to page 1 and enjoy the calls, leads and sales that come with it.</p>    <p style=\"\"><em style=\"\"><strong style=\"\">I will see you inside the course...</strong></em></p>    <p style=\"\"><br style=\"\">  </p>    <p style=\"\">Keith C</p>    <p style=\"\"><br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Google Local Optimization", 
    "price": "50.00", 
    "instructors": "Keith Carpenter", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/11967_e6d7_12.jpg", 
    "course_url": "https://www.udemy.com/the-10-step-google-places-domination-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-12-20T00:28:33Z"
}