{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Do you have 30 minutes to spare?</strong> It's all you'll need to get up to speed with Google Drive and Google Docs, two free programs in Google’s online productivity suite. Millions of people use Drive and Docs every day on their computers and mobile devices. You, too, can use Drive and Docs to perform the following tasks:</p><ul><li>Write reports, letters, and resumes with Google Docs</li><li>Collaborate online with classmates and colleagues</li><li>Sync files from your home computer to a work computer, and vice versa</li><li>Perform limited editing of Microsoft Word documents</li><li>Print documents using Google Cloud Print</li><li>Export PDFs</li><li>Publish documents and spreadsheets online</li><li>Use the Google Drive app and the Google Docs app on your Android phone or tablet, or iPhone or iPad to create and edit files on the go</li></ul><p>This 30-minute class is narrated by the author of the top-selling guide, <em>Google Drive &amp; Google Docs In 30 Minutes</em>. The course includes lectures on registration, finding and organizing files, creating documents and formatting them, working with Microsoft Word documents in Google Docs, and a complete review of the interfaces for Google Drive and Google Docs on the Web and mobile devices. The tone of this guide is friendly and easy to understand, with lots of step-by-step instructions and examples that show exactly what to do. </p><p>In addition to serving as a solid introduction to new users, it's great for people making the transition from Microsoft Office, not to mention teachers using Google Drive for education and Google Docs in the classroom. </p>", 
    "end_date": null, 
    "title": "Google Drive & Docs In 30 Minutes", 
    "price": "20.00", 
    "instructors": "Ian Lamont", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776424_a3b1_2.jpg", 
    "course_url": "https://www.udemy.com/google-drive-docs-in-30-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T23:05:05Z"
}