{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Google Apps</strong> ist eine Sammlung von Anwendungen, die eine kostenlose Alternative zu den Office-Produkten von Microsoft bietet. Zudem gibt es Funktionen, die weiteren bekannten Programmen entsprechen:</p><ul><li>Gmail (= Microsoft Outlook)</li><li><span></span>Docs (= Microsoft Word)</li><li><span></span>Tabellen (= Microsoft Excel)</li><li><span></span>Präsentationen (= Microsoft Power Point)</li><li><span></span>Hangouts (= Skype)</li><li><span></span>Drive (= Drop Box)</li></ul><p>Google Apps lassen sich ganz einfach von überall her aufrufen, über den Browser am PC, vom Smartphone oder Tablet.</p><p>Mit diesem Kurs möchte ich im Wesentlichen meine eigenen Erfahrungen weitergeben bzw. Berührungsängste nehmen, die ich beim <strong>Umstieg von Microsoft Office auf Google Apps</strong> hatte.</p><p>Ich habe Google Apps in einem internationalen Unternehmen eingeführt und etliche Kollegen im Umgang damit geschult. Somit kenne ich einige Stolpersteine, aber auch die vielen Vorzüge der Google Apps, insbesondere bei der Zusammenarbeit über Chat und Videokonferenz oder dem gemeinsamen Arbeiten an Dokumenten.</p><p>Dieser Kurs soll Sie Schritt für Schritt an die Handhabung der einzelnen Google Apps heranführen, aber auch die Zusammenhänge zwischen den einzelnen Anwendungen erläutern, so dass sie diese in Ihrem Umfeld bzw. Arbeitsalltag gewinnbringend einsetzen können.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Google Apps für Anfänger (deutsch)", 
    "price": "20.00", 
    "instructors": "Andreas Ruehlow", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555262_7366_4.jpg", 
    "course_url": "https://www.udemy.com/google-apps-fur-anfanger-deutsch/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T10:48:34Z"
}