{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Do you ever feel like you can <strong>never take a break from email</strong>... that you can never get ahead of the constant stream of messages coming your way... that instead of you controlling your inbox, it controls your life?</p>  <p>I for sure did.</p>  <p>I was spending <strong>HOURS PER DAY IN MY INBOX</strong> and I was always behind... never catching a break... never seeing the coveted \"inbox zero\".</p>  <p>But...</p>  <p><strong>I decided to fight back.</strong></p>  <p>I read all the books, took all the courses and put all the gmail and inbox zero tactics to the test. Some worked, some were a complete waste of time and some needed a little tweak.</p>  <p>I ended up creating a <u>step-by-step system</u> that allowed me to go from 3651 unread emails to a constant inbox zero in just 60 days.</p>  <p>And now, <strong>YOU CAN DO THE SAME!</strong></p>  <p>You can get all the <strong>battle-tested tactics so you can get back control of your inbox</strong>, eliminate all the stress and start using Gmail productively and efficiently.</p>  <p>Here is just a taste of what's inside this course:</p>  <ul><li>How to set up <strong>Gmail for maximum efficiency</strong></li><li>All the options, features and tweaks you need to enable in order to<em> turn your inbox into your productivity hub</em></li><li>The ONLY 5 tactics you'll ever need to ensure that you are always on top of your emails</li><li>How to consolidate all your emails into one inbox for easy access</li><li>How to get rid of ALL THE UNNECESSARY emails that don't belong in your inbox - less emails to process, less time needed</li><li>How to create an unlimited number of \"throwaway\" email addresses - <strong>this simple trick will blow you away</strong></li><em></em><li><em>How to process emails in record time</em> </li><li>The easiest (and quickest) way to decide what action to take with each email</li><li>How to <strong>make Gmail do all the heavy work for you</strong> with the proper use of filters</li><li>How to DRASTICALLY REDUCE your email count </li><li>Increasing your typing speed with <strong>this simple tactic</strong> will turn you into an email processing ninja</li><li>How to make sure your Gmail account is <em>fully secure</em></li><li>Use this simple technique to <strong>practically guarantee</strong> that you Gmail account is never going to get hacked</li><li>And much more...</li></ul>                              <p>This is a <strong>step-by-step inbox zero system</strong> that you can <em>start using today</em>. Just login, watch the videos, follow along and watch your productivity soar.</p>  <p>Gmail can be your productivity headquarters... but only if you know how to use it properly.</p>  <p>It is time for you to:</p>  <ul><li><em>Get in charge of your inbox (and your life)...</em></li><li><em>Start using Gmail to its fullest potential...</em></li><li><em>Drastically reduce that time that you spend in your      inbox...</em></li><li><em>Finally achieve (and keep) inbox zero...</em></li></ul>  <p>Are you interested?</p>  <p>Let's do this!</p><p><strong>Click on the \"Take This Course\" button to the right and let's start using Gmail the right way so you can master your inbox and your productivity!</strong></p><br>", 
    "end_date": null, 
    "title": "How To Use GMAIL To Maximize Your Productivity", 
    "price": "20.00", 
    "instructors": "Kosio Angelov", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633516_4860_4.jpg", 
    "course_url": "https://www.udemy.com/master-gmail-increase-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T13:08:18Z"
}