{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\"><strong style=\"\">Google Drive</strong> has truly transformed how I create documents, store,  access and share files and collaborate with colleagues</strong></em>. I would like to give you the opportunity to also dramatically improve how you interact with and manage your files and data. Access your files anywhere, at any time and with any internet connected device.</p><p style=\"\">Share my expertise and over 20 years teaching experience to make you, and potentially your workplace, effectively utilise the cloud-based features integral to Google Drive&#039;s ongoing success.</p><p style=\"\"><span style=\"\"></span>Google Drive is a file storage and synchronisation service created by Google. It allows users to store files in &quot;the cloud&quot;, share files, and edit documents, spreadsheets, presentations and the majority of other document formats.</p><p style=\"\">This course is suitable for people from any profession as the skills developed are applicable on both a personal level as well as having tremendous potential in any workplace.</p><p style=\"\">   Students will:</p><ul style=\"\"><li style=\"\">Develop the ability to <strong style=\"\">synchronise files between devices</strong> while always having that data also securely saved on the Google Drive servers.  Always access the most recent version of a document.</li><li style=\"\"><strong style=\"\">Collaborate in real-time with colleagues</strong> on documents.</li><li style=\"\"><strong style=\"\">Share files</strong> with other parties setting restrictions and limits as to the access privileges of all groups who can access the file/s.</li><li style=\"\"><strong style=\"\">Remove the need to email documents as attachments</strong>, simply allow access to the document online.</li></ul><strong style=\"\">This course will positively change how you interact with technology</strong> and the information you work with on a daily basis.  You will save time, money and reduce your stress levels by working smarter rather than harder  <p style=\"\"><strong style=\"\">I look forward to assisting you to develop an understanding of, and the ability to efficiently use Google Drive.</strong><span style=\"\"></span></p>", 
    "end_date": null, 
    "title": "How to Master Google Drive", 
    "price": 0, 
    "instructors": "Paul Barton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585004_8479_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-master-google-drive/", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T03:41:03Z"
}