{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Google Sheet is an extremely powerful alternative to Microsoft's Excel spreadsheet software. Jon will teach you step-by-step how to create a basic spreadsheet and analyze the. This course covers all the essentials that will help you manipulate and analyze large sets of data. Of course, you will learn the fundamentals such as the basic calculations, formulas, creating charts, and tips &amp; tricks that will get you started quickly.</p><p>By the end of this introductory course, you will feel confident maneuvering around Google Sheets and gain instincts to use it effectively for data analysis, and ultimately adding value to your company or to your own personal life.</p><p>In this course you will learn how to:</p><ul><li>Effectively and efficiently navigate around Google Sheets</li><li>Enter and edit data in Google Sheets</li><li>Adjust the way data and information are displayed in Google Sheets</li><li>Write formulas quickly and easily</li><li>Leverage data with Vlookup, Hlookup, Index, and Pivot Tables </li><li>Use relative, absolute, and mixed references in Google Sheets</li><li>Create powerful calculations with Google Sheets functions</li><li>Visually represent your data with charts and graphs in Google Sheets</li><li>Use data tools like sorting, filtering, and filter views</li><li>Utilize freeze panes in Google Sheets</li><li>Format worksheets in Google Sheets for impact and appeal</li><li>Learn shortcuts, tips, and tricks</li><li>Learn how to use commenting and sharing in Google Sheets</li><p><br></p><p>As a fun bonus material, you will also learn how to create art with Google Sheets!</p><p>Enroll today in this course! We are 100% confident that you will learn</p><p><br></p></ul>", 
    "end_date": null, 
    "title": "I Heart Google Sheets: Training for Skills Employers Want", 
    "price": "20.00", 
    "instructors": "Jon Chu", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756854_033d_3.jpg", 
    "course_url": "https://www.udemy.com/googlesheets/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T05:32:47Z"
}