{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">BUILD YOUR BUSINESS DATA ONLINE USING GOOGLE DRIVE</strong></p><p style=\"\"><em style=\"\">LATEST:</em> Course Updated For August 2015</p><p style=\"\">Do you want to develop your business online. Are you constantly sending Word documents to coworkers? Do you lose track of where your documents are and who has made the last edits? Do want to be able to access your files anywhere, at any time? If so, this class is for you.</p><p style=\"\"><strong style=\"\">How do people use Google Drive? There are many possible uses. Let&#039;s see how peoples are using google drive.</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">A harried product manager needs to continue work on an important proposal over the weekend.</strong> In the past, she would have dug around in her purse to look for an old USB drive she uses for transferring files. Or, she might have emailed herself an attachment to open at home. Instead, she saves the Word document and an Excel spreadsheet to Google Drive at the office. Later that evening, on her home PC, she opens her Google Drive folder to access the Excel file. All of her saves are updated to Google Drive. When she returns to work the following Monday, the updated data can be viewed on her workstation.</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">The organizer of a family reunion wants to survey 34 cousins</strong> about attendance, lodging preferences, and potluck dinner preparation (always a challenge — the Nebraska branch of the family won&#039;t eat corn or Garbanzo beans). He emails everyone a link to a Web Form created in Drive. The answers are automatically transferred to Sheets, where he can see the responses and tally the results.</li></ul><ul style=\"\"><li style=\"\">A small business consultant is helping the owner of Slappy&#039;s Canadian Diner (“We Put The Canadian Back In Bacon&quot;) <strong style=\"\">prepare a slideshow</strong> for potential franchisees in Ohio. The consultant and Slappy collaborate using Google Slides, which lets them remotely access the deck and add text, images, and other elements. The consultant shares a link to the slideshow with her consulting partner, so he can periodically review it on a Web browser and check for problems. Later, Slappy meets his potential franchise operators at a hotel in Cleveland, and uses Slides to run through the presentation.</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">An elementary school faculty uses Docs to collaborate on lesson plans.</strong>Each teacher accesses the same document from their homes or classrooms. Updates are instantly reflected, even when two teachers are simultaneously accessing the same document. Their principal (known as “Skinner&quot; behind his back) is impressed by how quickly the faculty completes the plans, and how well the curriculums are integrated.</li></ul><ul style=\"\"><li style=\"\">At the same school, the <strong style=\"\">5th-grade teachers ask their students to submit homework using Docs</strong>. The teachers add corrections and notes, which the students can access at any time via a Web browser. It&#039;s much more efficient than emailing attachments around, and the students don&#039;t need to bug their parents to buy expensive word-processing programs.</li></ul><strong style=\"\">Almost everyone uses email these days, so why not start as you mean to go on, and get organised?!<p style=\"\"><strong style=\"\"><em style=\"\">LET&#039;S GET STARTED</em></strong></p></strong>", 
    "end_date": null, 
    "title": "Learn to Build your Business data online using Google Drive", 
    "price": "25.00", 
    "instructors": "Inspirac technologies, Abitha Karthik", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590212_feff_2.jpg", 
    "course_url": "https://www.udemy.com/infinite_google_drive_for_professional_business/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-22T09:32:46Z"
}