{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>**Updated to Include Google Sheets November 2015 Updates!!**</strong></p><p><strong>Become a master Google Docs user with this course on using Google Spreadsheets. You'll learn:</strong></p><ul><li>How to use Google Spreadsheets just like you use Microsoft Excel</li><li>3 amazing tools only available in Google Spreadsheets</li><li>How to write your own scripts and use Google addons to get more done</li><li>How to create charts, tables, graphs and format data </li></ul><p>This course will give you you everything you need to know about Google Spreadsheets.</p><p>From the fundamentals, to the most advanced features, after taking this class you will be able to use Spreadsheets like a MASTER. Pretty soon, you'll be using Spreadsheets better than most people can use Excel... and be able to take advantage of the super useful features that only Google Spreadsheets has to offer.</p><p>In this course, you will learn all of the following about Google Spreadsheets:</p><ul><li>Learn how to navigate around Spreadsheets</li><li>Learn how to adjust the way data and information are displayed </li><li>Learn how to write formulas quickly and easily with the point-and-click method</li><li>Learn how to create powerful calculations </li><li>Learn how to visually represent your data with charts and graphs </li><li>Learn how to use data tools like sorting, subtotaling, and filtering</li><li>Learn how to automate tasks with time-saving scripts and addons</li><li>Learn Spreadsheets secrets and shortcuts</li></ul><p>As bonus material, you will also learn two very incredible, and super valuable, skills:</p><ul><li>how to harvest data from the web</li><li>how to create online forms which allow you to gather data from individuals</li></ul><p>As an additional bonus, you can follow along and complete challenges and quizzes as you learn the material. You will also be shown how to find and download free Spreadsheet templates that will allow you to do all kinds of things. </p><p>Another great aspect of this course is that, at the end of this class, you will be given a CERTIFICATE OF COMPLETION. </p><p>This class is guaranteed to teach you Google Spreadsheets. Once enrolled, you will have access to this course for the rest of your life. You will always be able to come back to this class to review material or to learn new material. Try this course for yourself and see how quickly and easily you too can learn to use Google Spreadsheets.</p><p>Justin Mares, Google Sheets wizard</p>", 
    "end_date": null, 
    "title": "Master Google Sheets (and see why it's better than Excel)", 
    "price": "20.00", 
    "instructors": "Justin Mares", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295503_da24_2.jpg", 
    "course_url": "https://www.udemy.com/google-spreadsheet-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-06T22:09:59Z"
}