{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>------------ The course has been fully updated for November 2015 ------------</strong></p><strong><em></em><em></em></strong><p><strong><em>Are you buried under an </em></strong><strong><em>unstoppable</em></strong><strong><em> </em></strong><strong><em>avalanche of email daily?</em></strong><em><strong> Do you want to learn all the </strong></em><strong><em>secrets of Gmail and save HOURS a week<em>?</em></em></strong></p><p>Now it's time to Master Email Management, empty your Inbox to Zero<strong> </strong><em>and </em>Skyrocket your Productivity.</p><p>“Inbox Zero” means zero time wasted in your Inbox. So <strong>The real achievement is in figuring out a system that works for you</strong>, so email doesn't rule your life.</p><p>Google says less than 1% of its total Gmail users makes use of many hidden features even though they know the features exist.</p><p><strong>What this course is about:</strong><br></p><p>In this course, you will learn <strong>over 25 different techniques and strategies that helps clear the email clutter and make you an email ninja.</strong> If you are someone who spends 10 minutes or an hour managing email daily, the tips, tricks, and tools in this course <strong>will cut that time by at least half!</strong></p><p>So what are you waiting for? </p><p><strong><em>Enroll and </em></strong><strong><em>make the most of the world's most powerful and popular email system!</em></strong></p><p><em><strong>---------------------------------------------------------------------------------------------------------------</strong></em><strong><em></em></strong></p><p>With <strong>over 40 lectures and updates</strong>, learning how to become a Gmail power user has never been easier. This course is a concise and easy-to-watch guide to master time-saving techniques for managing email and increasing email productivity.</p><p>You'll have lifetime access to watch the videos whenever you like<strong><em>. If you're not 100% satisfied, there is a 30 day money back guarantee!</em></strong></p><p><strong><em>Plus, you will get fast and responsive support within 24 hours.</em></strong></p><p><strong>You'll learn how to:</strong></p> <ul><li>Add and manage multiple email accounts in one place</li><li>Manage your emails with labels</li><li>Use filters to automatically process a message</li><li>Organize your messages with the stars system</li><li>Reply to mail faster with Canned Responses</li><li>Put your most frequent Gmail destinations in front of you with Quick Links </li><li>Bring all your Contacts together in one place with Brewster</li><li>Use IFTTT to automate Gmail's interaction with popular apps</li><li>Schedule sending and set email reminders with Boomerang</li><li>Deliver your emails at times you specify with BatchedInbox</li><li>Get rid of those newsletters with Mass Unsubscribe</li><li>Turn yourself into email ninja with keyboard shortcuts </li><li>Delegate the management of your inbox to an assistant</li><li>Set a Gmail reply for you if you are on vacation </li><li>Un-send emails and view messages without clicking through</li><li>Search in Advanced and find any email you're looking for</li><li>Set Desktop Notifiers</li><li>Perform actions quickly on many emails</li><li>Clean up your email: archiving and deleting</li><li>Create a text or image signature</li><li>Set Contacts and Contact groups: Save time and be productive</li><li>Understand tasks and maintain multiple to-do lists</li><li>Explore the settings of Gmail Labs</li><li>Navigate the brand new 2015 Gmail Version: Inbox by Gmail</li></ul> <p><strong><em>Stop being a slave of your inbox and enroll now. It's </em></strong><strong><em>100% risk free – <strong>30 day money back guarantee! - Lifetime access</strong></em></strong></p><p><strong><em>------------------------------------------------------------------------------------------------------------</em></strong><strong><em><strong></strong></em></strong><strong></strong></p><p><strong>Who is this course for?</strong></p> <ul><li><strong></strong><strong>Everyone who wants to increase their productivity</strong><strong><strong></strong></strong></li><li><strong></strong><strong>Everyone who wants to be an expert in Gmail and other email systems</strong><strong></strong></li></ul> <p><strong><em>At the end of this class, you will be given a Certificate of Completion</em></strong><strong>.</strong></p><p><strong>STUDENT REVIEWS:</strong></p><p><strong>\"I will never look at Gmail the same way again! While I would previously have considered myself to be a master of Gmail, this course proved that you could teach an old dog new tricks! Thanks Andreas! I owe you a few minutes of my time, now that it is freed up.\" </strong>- Madison Scarlett</p><p><strong>====================================================================</strong></p><p><strong>\"Andreas does an excellent job of giving tips and techniques to be much more productive with GMAIL and your overall handling of emails.\" </strong>- Alex Scott</p><p><strong>====================================================================</strong></p><p><strong>\"This is an awesome course and I learned a lot from it. It is well structured &amp; easy to follow, with tons of useful information. It gave me back hours in my week. Definitely highly recommended!\"</strong> - Vanzel Kats</p><p><strong>====================================================================</strong></p><strong><em>Enroll now and take control of email today</em></strong>!", 
    "end_date": null, 
    "title": "The Complete Gmail Course - 25 Gmail Strategies & Hacks", 
    "price": "20.00", 
    "instructors": "Andreas Exadaktylos", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481776_3beb_9.jpg", 
    "course_url": "https://www.udemy.com/your-gmail-productivity-unleashed-destroy-gmail-timewasters/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T03:09:05Z"
}