{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>**UPDATED MAY<strong> 2016</strong>**</strong> Called <em>\"<strong>the best course on email productivity + Gmail on Udemy\"</strong></em></p>\n\n<p>  \t  Do you ever feel like <strong>EMAIL CONTROLS YOUR LIFE?</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  You know...like there's those days where <strong>literally all you do is spend time in your inbox </strong>reading and respond to emails.  </p>\n\n\n\n\n\n\n\n<p>  \t  It's like you're a little email salmon swimming trying to fight the upstream inbox current.  </p>\n\n\n\n\n\n\n\n<p>  \t  I've got some amazing news for you....  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>IT DOESN'T HAVE TO BE THIS WAY.</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  This Gmail course <em><strong>has taught over 6000 people</strong></em> how to effectively manage their email to increase productivity and  GET HOURS OF YOUR LIFE BACK EACH WEEK.  </p>\n\n\n\n\n\n\n\n<p>  \t  So wait...does that mean I can spend more time in the kiddie pool on the weekends and less time in my inbox!!!??? <strong>You betcha!</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  Skeptical?  </p>\n\n\n\n\n\n\n\n<p>  \t  Just look at what all the incredibly good-looking people on the right who've reviewed this course and <strong>gave it 5 STARS</strong> have said....  </p>\n\n\n\n\n\n\n\n<p>  \t  By the end of this course you'll learn the deepest, darkest secrets of Gmail that only the greatest email ninjas know, like:  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Specific tactics to spend dramatically less time in your inbox (and why that's actually more productive!)</li>  \t<li>The best way to empty that inbox to zero<em><strong> like Speedy Gonzalez fast</strong></em> - BTW its super important to do that</li>  \t<li>Strategies to decrease the amount of mail you get. Yep, it's possible</li>  \t<li>Tools to not only manage all your contacts and connections, but ones that will also help you write emails that are a like...A ZILLION TIMES more effective</li>  \t<li><strong>20 different strategies and tools</strong> to be more productive with email</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t  So if you want to reclaim your SANITY, LIFE, OR TIME or just send emails to ANYONE.....or just want to be more productive...hear me out:  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>  \t </strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>THIS----COURSE-----IS------4-------YOU</strong><strong>  \t</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  You will learn how to become an email PRO and save hours a week over 43 short videos created by yours truly.  </p>\n\n\n\n\n\n\n\n<p>  \t  If 43 vids sounds like a lot, don't worry - you can totally go buffet style to pick and choose exactly what you want to learn...man I love buffets.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>So this sounds pretty darn good right?</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  Then here's whatchya need to do to start taking this Gmail Productivity course right now:  </p>\n\n\n\n\n\n\n\n<ol>  \t<li>Scroll back up to the top and click the “Take This Course\" Button</li>  \t<li>If you're already a member of Udemy, this will take you to the payment page - IF YOU'RE NOT, you will be prompted to sign up for Udemy (it's really good and will never spam you so YOU SHOULD SIGN UP)</li>  \t<li>Enter in your credit card or Paypal details and press “Complete Purchase\" (then do a little dance because you just made a great decision)</li>  \t<li>Udemy will confirm your purchase for $49.00</li>  \t<li>You will immediately get access to the course and subsequently learn how to dominate email.</li>  \t<li>You'll have to figure <strong>what to do with all this new time you have</strong> because you've GOTTEN SO GOOOOD AT MANAGING EMAIL</li>  </ol>\n\n\n\n\n\n\n\n<p>  \t  I will personally respond to any questions you may have as you go through the course so there's no worry if you're not sure how to take all of the information and apply it to your life...  </p>\n\n\n\n\n\n\n\n<p>  \t  What are you waiting for? Sign up now!  </p>\n\n\n\n\n\n\n\n<p>  \t  Sincerely,  </p>\n\n\n\n\n\n\n\n<p>  \t  Scott Britton - Productive Gmailer  </p>\n\n\n\n\n\n\n\n<p>  \t  P.S. The $49 price is an initial offering to build the students and positive reviews. I<strong> believe getting days of your life back and dramatically increasing your output is WORTH FAR MORE THAN THIS,</strong> so I plan on raising the price in the near future. If you want to take advantage of the initial price, I'd sign up sooner than later (Like now!)  </p>", 
    "end_date": null, 
    "title": "The Ultimate Gmail Productivity System For Business", 
    "price": "50.00", 
    "instructors": "Scott Britton", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49779_0d68_5.jpg", 
    "course_url": "https://www.udemy.com/master-gmail-to-increase-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-14T23:23:48Z"
}