{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>More than 50 million people already use Google Apps:  it is today's #1 productivity tool.  This video course teaches you all the skills you need to join them, fast!</p><p>Get super-productive with Google's online applications--painlessly! <em><strong>Using Google Docs, Sheets, Slides, and Drive</strong></em> puts all the power of Google's apps at your command, even if you've never used any of them! In just 5 1/2 hours of incredibly easy video, Michael Miller gets you 100% comfortable and amazingly productive with Google's powerful online applications...just watch! Within minutes, you'll discover how Google's cloud-based apps work, how to get started, and how to create, import, export, save, and share files on any computer, smartphone, or tablet. Next, you'll master Google Docs' powerful text editing and formatting tools, so you can create powerfully effective documents and share them with anyone. Miller shows how to build great Google Sheets spreadsheets for personal finance and other tasks...create and deliver highly effective presentations with Google Slides...and make the most of free or low-cost Google Drive storage wherever you go. </p><p>About the Instructor:</p><p><strong>Michael Miller</strong>'s 150+ nonfiction books have sold more than a million copies worldwide. Miller has also produced many training videos and DVDs for Que Publishing and other companies, including Alpha Books, America Online, BizSummits, Deluxe Corporation, and MarketingProfs. His Que video tutorials include <em>How to Use Gmail</em>, <em>How to Use Snapchat</em>, <em>Getting Started with Instagram</em>, <em>Exploring Instagram's Hidden Secrets</em>, <em>Shooting and Sharing with Vine</em>, <em>Facebook Essentials</em>, and <em>Creating Powerful Training Videos with Camtasia and Other Tools</em>. <br></p><p><br><br></p>", 
    "end_date": null, 
    "title": "Using Google Docs, Sheets, Slides, and Drive", 
    "price": "50.00", 
    "instructors": "QUE Videos", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595034_60c4_2.jpg", 
    "course_url": "https://www.udemy.com/using-google-docs-sheets-slides-and-drive/", 
    "currency": "USD", 
    "subject_name": [
        "Google"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T14:59:00Z"
}