{"selfpaced": false, "topic_name": ["Internet of Things"], "description": "\n\n                    \n                    \n                    &gt;&gt;&gt; By enrolling in this course you agree to the End User License Agreement as set out in the FAQ.  Once enrolled you can access the license in the Resources area \n\nThe Internet of Things (IoT) is an area of rapid growth and opportunity. Technical innovations in networks, sensors and applications, coupled with the advent of 'smart machines' have resulted in a huge diversity of devices generating all kinds of structured and unstructured data that needs to be processed somewhere.  Collecting and understanding that data, combining it with other sources of information and putting it to good  use can be achieved by using connectivity, analytical and cognitive services now available on the cloud, allowing development and deployment of solutions to be achieved faster and more efficiently than ever before.\n\nThis course is an entry level introduction to developing and deploying solutions for the Internet of Things. It will focus on capturing data from a trusted device and sending the data to a cloud platform where it can be exploited by the many services available. You will explore all the steps required to create a basic IoT solution using a popular device, the Raspberry Pi, and a trial version of the cloud-based IBM Watson IoT Platform. \n\nWhat you will learn: \nQuickly create applications that leverage connectivity and analytics as part of an integrated IoT platform.  Use Node-RED, an open-source visual application development environment, on both the device and the cloud.  Create a basic IoT solution by leveraging pre-built blocks of code that abstracts and speeds the development process. Use APIs to access the platform and explore the different connectivity options for various devices, gateways and applications. Explore options to ensure your solution makes best use of the captured data. \n \nWhat technology is required to complete the course?  \nThe programming assignments require you to have a Raspberry Pi device - any model of Raspberry Pi with a 40 pin header. The course also uses the SenseHAT extension board, whilst it is preferable to have a SenseHat there is a simulator provided if you can't get a SenseHAT.\nYou will need internet connectivity to download software, connect to the platform, develop and deploy your IoT solution.\nYour Rasberry Pi will need the latest Rasbian Jessie OS. This OS will be on a Micro SD Card. The recommended size of the SD card is 8GB but 4GB will do. Note that the learner kit comes with a preconfigured SD card.\nIn order to setup the Micro SD card, you will need a computer with either a windows, apple or Linux OS. Since most computer do not have a micro SD port, you will need a Micro SD adapter or USB Micro SD card adapter. Your computer will also be used when working on the platform.\nTo work on your Raspberry Pi, you will need an HDMI monitor or TV to work as the display for the Raspberry Pi (DVI monitor will also work). To connect the monitor to the Raspberry Pi you will need an HDMI cable (or a DVI to HDMI cable).\nYour Raspberry Pi needs a way to connect to the internet; either an Ethernet cable for connecting to the Router, or a USB WiFi dongle if you have wireless connectivity. Note that the Raspberry Pi 3 includes built-in WiFi\nA USB Keyboard and mouse.\nYour Raspberry Pi will also needs a 5V micro USB power supply i(This may be a phone charger for example)\n\nWhat prerequisite skills are required ?\nThis is an entry level course, but does assume you have basic programming skills. The assignments set use both Python and JavaScript programming languages, so some basic skill in these languages is required. No previous experience with IBM Bluemix or the IBM Watson IoT Platform is required.\n\nWhat additional resources do I need for this course? \nThe Server side code for the assignments will use the IBM Bluemix cloud platform, so you will need to sign up for a free account on that platform.\nWhen your 30-day trial expires, you can enter a credit card to keep using Bluemix. Bluemix has a set amount of free resources available to users who have registered with their credit card. If you stay within these free resources limits you will not incur any charges. This is a good idea if you are planning to take longer than 30 days to complete the course, or if you have an existing trial account that that is about to expire and you need longer time on the platform to complete the course.\n\n                                            Syllabus\n                        Introduction to the courseWelcome to the course.  This learning module introduces you to course and the instructors.  The module outlines the content covered on the course and gives an introduction to the Internet of Things.  It also discusses the requirements needed to complete the course including the hardware, software and details of prerequisite skills required to complete the programming assignments Rapid application development in the cloudAn Internet of Things solution usually requires a back-end server to receive and process data coming from sensors.  Cloud platforms allow new solutions to be created and deployed very rapidly without having to worry about how to host the application.  This series of lessons introduces you to a cloud based Platform as a Service and an open source rapid application development environment called NodeRED.Rapid application development on a Raspberry Pi This unit looks at how to add a device to your solution.  Creating an application on a Raspberry Pi and establishing secure, trusted communication between your cloud application and devicesLower level programming for the Internet of ThingsUp to now the course has used the NodeRED rapid application development environment.  This unit looks at how to program for the Internet of Things platform using more traditional programming environments\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "A developer's guide to the Internet of Things (IoT)", "price": 0, "instructors": "Brian Innes and Yianna Papadakis Kantos", "institution_name": ["IBM"], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/developer-iot", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}