{"selfpaced": false, "topic_name": ["Internet of Things"], "description": "\n\n                    \n                    \n                    Content is an eminent example of the features that contributed to the success of wireless Internet. Mobile platforms such as the Snapdragon™ processor have special hardware and software capabilities to make acquisition, processing and rendering of multimedia content efficient and cost-effective. \n\nIn this course, you will learn the principles of video and audio codecs used for media content in iTunes, Google Play, YouTube, Netflix, etc.  You will learn the file formats and codec settings for optimizing quality and media bandwidth and apply them in developing a basic media player application. \n\nLearning Goals: After completing this course, you will be able to:\n\n1.\tExplain the tradeoffs between media quality and bandwidth for content delivery. \n2.\tExtract and display metadata from media files.\n3.\tImplement and demonstrate a simple media player application using DragonBoard™ 410c.\n\n                                            Syllabus\n                        IntroductionWelcome to the Internet of Things! Before diving into this course give us a chance to let you know what it is all about! We will walk you through a module by module outline that will give you highlights on the interesting aspects of the course.Terminology/Cheat Sheet (Beginner)In this course, you will see a lot of new words and acronyms you might not be familiar with. If you feel comfortable with your knowledge of tech terminology, feel free to skip these lessons since they will not affect the overall integrity of the course. If you see something that you want to know a little more about, feel free to watch the video to gain insight on some basic concepts. We do expect you to know the majority of this material before going into the next module, we would recommend going through the lessons as a quick brush up.CodecsIn this module our esteemed Professor Harinath Garudadri will talk about coders and decoders (Codecs). This will allow us to make better use of our multimedia choices when working with the DragonBoardTM 410c. We want to look at the motivation behind using Codecs, the different ways to take advantage of redundancies when using codecs and finally the ability to take advantage of different receiver / transmitter combinations. If we are able to understand the way that information is sent and received over the data plane we can create and use the right codecs.Computer Vision and our ApplicationIn this module we will talk in depth about computer vision. We will talk about a variety of current applications of computer vision, and brainstorm the future applications you all are capable of making! Ultimately we will set up a computer vision development environment on your Linaro/Debian release capable of creating a wide variety of computer vision projects. By the end of this module we will have built a great basic application in Python, we will add a few features and pass the code on to you! Hopefully this code can serve as a great template for you all to use.\n                                    ", "end_date": "2016-06-27T00:00:00Z", "title": "Internet of Things: Multimedia Technologies", "price": 0, "instructors": "Harinath Garudadri and Ganz Chockalingam", "institution_name": ["University of California, San Diego "], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/internet-of-things-multimedia", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}