{"selfpaced": false, "topic_name": ["Chemistry"], "description": "\n\n                    \n                    \n                    Los materiales que utilizamos diariamente y los objetos que nos rodean están formados por sustancias químicas cuyas propiedades, aplicaciones y transformaciones dependen del tipo de enlace que las caracteriza. El tipo de enlace condiciona la interacción entre las moléculas de un compuesto. El estudio del enlace típico de un compuesto y de las interacciones entre sus moléculas es competencia de la Química, una materia básica que se estudia en muchas titulaciones universitarias. Este curso va dirigido a los alumnos que acceden a la Universidad, especialmente aquellos que no han cursado Química y que requieren de los conocimientos básicos en estos aspectos.\n \nEn este curso aprenderás a identificar los tipos de enlace que pueden presentarse en los diferentes compuestos químicos y a predecir qué tipo de enlace predomina en un compuesto en base a las características de los elementos que lo constituyen. Así mismo, podrás deducir qué enlace presenta un compuesto observando sus características y comportamiento. Profundizarás en el estudio del enlace covalente y entenderás la relación entre las interacciones moleculares y las propiedades físicas de los compuestos. En definitiva, adquirirás las habilidades necesarias para reconocer todo tipo de enlaces y relacionar la estructura de un compuesto con las propiedades físicas que manifiesta.\n \nEn el curso trataremos: \n\nEnlace químico y tipos\n\tEnlace iónico y metálico\n\tEnlace covalente. Geometría y propiedades de las moléculas\n\tInteracciones moleculares\n\n\n                                    ", "end_date": "2017-03-21T00:00:00Z", "title": "IQ101.2x: El Enlace Químico y las Interacciones Moleculares", "price": 0, "instructors": "Isabel Morera Bertomeu and Juan Antonio Llorens Molina", "institution_name": ["Universitat Politècnica de València"], "commitment": "3 hours", "subject_name": ["Science"], "course_url": "https://www.edx.org/course/el-enlace-quimico-y-las-interacciones-upvalenciax-iq101-2x-0", "duration": "49 weeks", "language_name": ["Others"], "provider_name": ["edX"], "start_date": "2016-04-12T00:00:00Z"}