{"selfpaced": false, "topic_name": ["Internet of Things"], "description": "\n\n                    \n                    \n                    It is hard to imagine life without your Smartphone – you have come to rely on it so much – for your work; to stay in touch with family and friends; to capture and share those special moments; to find your way around in a new neighborhood. Did you ever wonder how and when all this happened? Or how and when GPS sensors came to be in your cell phone?\n\nIn this course, we will explore the convergence of multiple disciplines leading to todays’ Smartphones.  You will learn about the birth and evolution of Telephony Networks, Broadcast Networks (TV and Radio) and Consumer Electronics.  We will discuss the impact of Internet, (multimedia) content, smartphones and apps on everyday lives. We will then look at how this emerging platform called the Internet of Things – wherein billions and trillions of devices communicating with each other and “the cloud” – could enable unprecedented, innovative products and services.   Take this course if you want to understand what great new advances in mobile-enabled products will be coming our way!\n\nLearning Goals: This course provides a core grounding in how science and technology have developed to enable the Internet of Things – in a way appropriate for any learner.  For those interested in developing further hands-on expertise in designing and developing for the Internet of Things, this course will provide a context to the discoveries and converging technologies that will springboard the next round of innovations.  After completing this course, you will be able to:\n\n1.\tCompare how the telephone system works (that is, peer-to-peer networks) with how media delivery works (that is, broadcast/multicast networks).\n2.\tExplain the tradeoffs between circuit switched networks (that is, dedicated resources) and packet switched networks (that is, shared resources).\n3.\tTell interesting stories about key innovations that transformed the communications, entertainment and consumer electronics industries.\n4.\tExplain how email, YouTube, SMS, etc. work.\n5.\tFind resources for those wishing to do more of a “deep-dive” into the above topics.\n\n                                            Syllabus\n                        WelcomeWelcome to the first course in the Internet of Things specialization! We hope you’re just as excited as we are to begin this fascinating journey! Before getting started with the material, we would like to introduce you to the team that made this all possible, as well as give you a preview of what to expect throughout the entire specialization. Circuit Switched NetworksIn order to answer the big question, “how did we get here?” we must start from the beginning. The beginning of what you may ask, well the beginning of telecommunication! In this course we will cover the birth of the telephone and its gradual evolution through different networks. Humans love to talk, which might explain the speedy growth of telephony networks. Packet Switched NetworksNow that we have looked at circuit switched networks, we will begin to talk about packet switched networks. Digital networking will change in the telephone industry is what allowed all of the exciting new features we see on mobile phones. In this course, we will clarify differences between circuit and packet switched networks, as well as reveal what digital networking allows us to do. Computer TelephonyThe convergence begins! Computers and telephones start working together which served a great opportunity for business in many ways. Imagine a world without caller ID or voicemail, scary isn’t it? Telephony begins to take the digital route, which brings a whole new experience in telecommunications. The digitization of telephones wasn’t all positive, for it created the possibility of hackers accessing personal information.Wireless TechnologiesTelephones eventually become a new entity which we might recognize as the cell phone. Phone mobility revolutionizes the telecommunications market, phones are no longer apply to homes but rather to people. Cell phones were a game changer for telephone companies.Features and AppsPhone applications are born! This is probably the greatest contribution to the telephone industry because now phone don’t just make phone calls and take messages, but also handle finances, entertain, educate, control your home, turn on your car and anything you can imagine! The limits of a technology have never been more endless, if you can think it you can sure build an app for it.Future OutlookCongratulations! You’ve made it to the last module in this course! At this point, you should know the history of the internet and many innovations that it has advanced with, but what is the Internet of Things anyway? That question and many more will be answered in this final course! \n                                    ", "end_date": "2015-10-29T00:00:00Z", "title": "Internet of Things: How did we get here?", "price": 0, "instructors": "Ganz Chockalingam and Harinath Garudadri", "institution_name": ["University of California, San Diego "], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/internet-of-things-history", "duration": "2 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-10-15T00:00:00Z"}