{"selfpaced": false, "topic_name": ["Internet of Things"], "description": "\n\n                    \n                    \n                    Entrepreneurs love it, large corporations love it, universities and now even governments love it – welcome to the exciting and emerging world of the Internet of Things (IoT).\n\nDecades ago, we connected computers and got today’s powerful Internet. However, it’s only been over the last few years that we’ve started to connect everyday objects using machine-to-machine (M2M) technologies, to create the Internet of Things.\n\nBut what does this really mean to you, your company and your country? What are the possibilities it offers, and the threats it poses? To become an IoT wizard, join this stimulating free online course.\n\nCreate a successful product or venture based on IoT technology\n\nOver four weeks, you’ll meet IoT pioneer, Professor Mischa Dohler, and some of the most experienced experts in the field, from business leaders to future thinkers, to equip you with business insights to help you become an Internet of Things wizard.\n\nWe’ll take you on a journey, exploring the entrepreneurial aspect of the Internet of Things. We’ll ask: “What makes an exciting Internet of Things product?” You’ll look at the shockingly fragmented wireless connectivity landscape and why so many mistakes have been made in connecting your “things”. You’ll consider the security and privacy aspects of the IoT.\n\nFinally, we’ll equip you with business insights, enabling you to start your own IoT venture. You’ll learn what it really means to build an IoT product and how to stand out and be ahead of the crowd of IoT prototypers.\n\nJoin Industry 4.0 - the fourth industrial revolution\n\nThe Internet of Things, also referred to as the Industrial Internet, the Internet of Everything or Industry 4.0, is seen as the next global or fourth industrial revolution. Being equipped with the fundamentals and practicalities taught here makes you an insider into this quickly growing industry, and of great value to potential employers.\n\nTo find out more about what to expect on this course, watch a video Q&amp;A with Mischa Dohler and a group of IoT experts on the FutureLearn blog.\n\n\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "The Internet of Things", "price": 0, "instructors": "Mischa Dohler", "institution_name": ["King's College London"], "commitment": "2 hours", "subject_name": ["Computer Science"], "course_url": "http://www.futurelearn.com/courses/internet-of-things?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-06T00:00:00Z"}