{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">Need a website for yourself, company or blog?</strong></p><p><strong style=\"\">Then...</strong></p><ul style=\"\"><li>Stop wasting time searching Google for answers.</li><li>Dump those confusing and outdated tech books.</li><li>Forget trying to go through YouTube looking for outdated tutorials.</li></ul><strong style=\"\">Learn WordPress Today, Create Beautiful Websites Forever</strong>WordPress is one of the most popular blogging tools on the web, making it easy for anybody to post their ideas, pictures, and audio/video. WordPress can be used for not only blogging posts but also to store static information that can be easily updated like a content management system (CMS). This courses teaches the new user how to get their blog up and started quickly while teaching students to fully understand the right way to install, administer, customize and market their blog. <span></span><p><strong style=\"\"></strong></p><p><strong style=\"\">You will watch over my shoulder as YOU will..</strong></p><ol style=\"\"><li>Purchase and set up your very own domain name and hosting.</li><li>Install Wordpress on your hosting without using FTP or fancy database work.</li><li>Set up Wordpress settings for perfect performance.</li><li>Install a Free Wordpress theme on your website.</li><li>Customize your Wordpress theme to fit all your ideas.</li><li>Create Posts in Wordpress.</li><li>Create Pages in Wordpress.</li><li>Add media (photos, videos and documents) to your post</li><li>Install key plugins you need for your Wordpress</li><li>You will learn Wordpress!</li></ol><p><strong style=\"\">By the end of this course, you will have an amazing professional looking Wordpress website and it will take you less than 2 hours!</strong></p>", 
    "end_date": null, 
    "title": "1 Hour Wordpress – Create a Beautiful Website or Blog", 
    "price": 0, 
    "instructors": "Basim Salim", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493864_5c29_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-for-beginners-create-a-beautiful-website-or-blog/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T04:35:34Z"
}