{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"></strong>During this eBook &amp; Reader video training course, we will review the various options for online books including the options for checking out ebooks from your local library. There are a number of options but the eBook world has greatly consolidated into a few companies and formats. Although there are signs of some changes on the horizon, the major formats and vendors are well established. Unlike many tech areas , once you learn the basics of eBooks you shouldn&#039;t have to stress about changes and new formats for many years.</p><p>Although this course is designed for anyone and you can read ebooks on a desktop computer such as a Windows or Mac, the focus of this course is phones &amp; tablets. If you already have a Kindle, you should stick with the reader and Kindle format. All devices including Kindles will allow you to borrow eBooks from your local library.</p><p>It&#039;s highly recommended that you have a Android or iPhone and if possible a valid library card for the library sessions.</p><p>As with all my courses the focus is getting to the bottom line in under an hour. If you have specific questions or more detailed issues, feel free to message me and I will do my best to answer. </p><p>There is a brief video introduction and several video sections, they are followed by a recap, a short quiz and a documents section at the end which has a copy of the slides and a few additional materials.</p><p>This course includes a quiz and certificate of completion.</p><p>This course was made in high-definition and is best viewed with the DH setting on and with the videos enlarged. Feedback is a critical part of an online course. Once you have completed the course, providing comments helps improve the course and benefits everyone, so let me know what you think.</p>", 
    "end_date": null, 
    "title": "2015 Tech - eBooks, Readers & free stuff", 
    "price": 0, 
    "instructors": "Tom Lahey", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535850_44df_2.jpg", 
    "course_url": "https://www.udemy.com/2015-tech-ebooks-readers-free-stuff/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T06:12:15Z"
}