{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>LATEST:</strong> Course Updated October, 2015<br><br><em><strong>In less than an hours time, I can show you how to produce a GREAT sounding Voice Over using simple step-by-step instructions, and using tools and software that are very inexpensive!</strong></em><em><strong> ☆☆☆☆☆ OVER 60 REVIEWS!</strong></em><br><br></p><p>Have you ever wondered what <strong>voice over processing tips</strong> can make your voice sound better on a recording? Have you ever tried to listen to a video or podcast, only to find the author has <strong>recorded his voice over too low</strong>, or worse, the audio is loud and distorted, and sounds like they're <strong>talking through a kazoo</strong>?</p>  <p>  \t               My personal pet peeve is hearing <strong>plosives, pops, and breaths distorting the audio</strong> every time says a word starting with a P or B! At the end of the day, there's a simple reason why we have very little patience for bad audio quality in a voice over...  </p>  <p>  \t<strong><em>People will forgive a bad image, but they will not forgive bad sound. </em></strong>  </p>  <p>  \t               I have been recording videos, screencasts, screen recordings, and voice overs for well over 10 years, recording for my own company, tonyteach, as well as others such as <strong>Creative Cow, Infinite Skills, and even Lynda[dot]com</strong>. During this time, through many trials and errors, playing with different audio softwares, microphones, and hardwares – I was able to develop simple voice over processing tips to produce quality audio, every single time I recorded. More importantly, I was able to do all of this without breaking the bank, and I've summed it up into a short, easy to follow, <strong>30+ minute course</strong>…<strong></strong><strong></strong>  </p>  <hr>3 Simple Steps to Recording Great Sounding Voice Over Audio!<p><br><br>• In this course, I can show you <strong>how to set up your voice over recording area</strong>, but also I tell you why.</p><p>• Learn how NOT to get those annoying echoes &amp; reverbs when recording your voiceover<br><br>• Discover why 99% of the time, <strong>I record my voice without having a SINGLE pop, or plosive</strong> in the audio.<br><br>See why<strong> I only use a $40 USB mic</strong> that fits in the palm of my hand, for 98% of my voice over recordings.<br><strong><em>I can show all of this, and more, in 3 Simple Steps :)</em></strong></p>", 
    "end_date": null, 
    "title": "3 Simple Steps to Recording Great Sounding Voice Over Audio!", 
    "price": "20.00", 
    "instructors": "Tony Ross", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322614_8755_8.jpg", 
    "course_url": "https://www.udemy.com/voice-over-processing-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-19T15:45:07Z"
}