{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Course Overview    </strong></p><p>\nThis Course provides training in the rapid\ndelivery methods that enable Enterprise Architecture projects to be progressively\ndelivered into production as databases and systems in 3-month increments. This\nis based on methods that determine the priority business processes that are needed\nto be implemented first, based on the Strategic Business Plans of the\nenterprise.\n\n</p><p>This Module 2 Course represents Days 2 – 4 of the <em>Rapid Delivery of Enterprise Architecture Workshop</em>. Through Lectures, Case Study exercises and problems, together with sample solutions, it teaches the rapid delivery methods for transforming businesses and their supporting databases and systems so they can change rapidly to compete in the rapid change environment of the 21<sup>st</sup> Century. </p>    <p>This Course presents each new method in a separate Section, together with the case study problems and sample solutions associated with that Section. </p>    <p>The <em>Rapid Delivery of Enterprise Architecture</em> <em>Workshop</em> comprises three Modules. Each Module is a separate Udemy Course. The training delivered in this workshop represents a full University year of training in the discipline of Enterprise Architecture. These Modules (courses) correspond to days in the workshop (or University semesters) as follows:</p>    <ul><li>[Day 1] Module 1: Introduction to Enterprise Architecture for Managers and IT (1 Semester)</li><li>[Days 2 – 4] Module 2: Rapid Delivery Methods for Enterprise Architecture (2 Semesters)</li><li>[Day 5] Module 3: Rapid Delivery Technologies for Enterprise Architecture (1 Semester)<ul><li><strong>NOTE</strong> – Module 3 has been renamed for UDEMY as the Course: “<em>Web Services and Technologies”</em></li></ul></li></ul>           Audience    <p>This Module 2 Course is directed to an audience of: middle-level business managers; operational business managers; business experts; IT experts (CIOs, IT managers, CTOs); systems analysts or developers. </p>    <ul>  <li>This      course is NOT for students who want to learn detailed coding for various      programming languages</li> </ul>     Prerequisites<p>This Module 2 Course has one mandatory prerequisite, which is successful completion of the Module 1 Course: <em>“Introduction to Enterprise Architecture for Managers and IT”.</em> It does not require any prior knowledge of business planning or of computers.</p>", 
    "end_date": null, 
    "title": "3) Module 2: Rapid Delivery Methods for EA", 
    "price": "50.00", 
    "instructors": "Mr. Clive Finkelstein", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625906_dd80_3.jpg", 
    "course_url": "https://www.udemy.com/rapid-delivery-methods-for-enterprise-architecture/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T14:01:39Z"
}