{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>5S good housekeeping as the name indicates helps you to make your workplace whether it is your home, office or factory. The simple Japanese methodology for improving and maintaining your table,  machine, kitchen or bed room at home. This course will coach you on the step by step process of how the 5S system can be implemented by you and your team to proceed to achieve the 5S objective of zero searching, zero wastage, zero break downs, zero defects, optimize your time management etc.</p>\n\n<p>Course Structure</p>\n\n\n\n<p>The course contains 9 modules each with about 10 slides, concluding with a 10 minute Quiz to evaluate your understanding of the learning. You are allowed to go back to the same modules as many times as required to achieve a minimum criteria to move to the next module. On completion of the 9 modules you may proceed to the final examination of about half an hour, on successful completion of this you can proceed to print the certificate of merit. Each module will take about 30 minutes -15-20 minutes with the quiz for 10 minutes - and totally about 3 hours if done continuously. If you wish you can complete it in 9 days by attending one module per day or in a month’s time by working on the course during weekends.Every successful participant will become a member of the Zandig Alumni who will get a future offer on a stream of courses - class room / E training -to be introduced by Zandig    </p>\n\n\n\n<p>Who can take this course?</p>\n\n\n\n<p>Anybody. You can take this examination as many times as you wish.</p>\n\n\n\n<p>Why you must take this course?<br></p>\n\n\n\n<p>5S is a fundamental requirement for any individual whether at home or office who wish to get the beginning of becoming a systematic person. Hygiene and good housekeeping keep you and people around you healthy and fit for the task before you. A good housekeeping will get more friends and helping hands to face the future.<br></p>\n\n\n\n<p>5S defines a method to get to orderliness. Order helps you to complete the task on time or even ahead of time, thus improving the performance in the school, office or personal life. Good housekeeping will save precious time and often money (hard to account how much!)<br></p>\n\n<p>1. In a hospital, you save lives by implementing 5S</p>\n\n<p>2. In an industry, you reduce wastage’s thus impacting the revenue and the environment</p>\n\n<p>3. At home, you save space and time.</p>\n\n<p>4. In school, you impact learning (and of course your grades)</p>", 
    "end_date": null, 
    "title": "5S Good Housekeeping: Become Systematic In Your Personal Life ", 
    "price": 0, 
    "instructors": "Mr. S Parameshwaran", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792098_5aa7_5.jpg", 
    "course_url": "https://www.udemy.com/5s-good-housekeeping/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T07:20:10Z"
}