{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Course Description</strong><br></p><p>Over the years, it has been wonderful to see musicians playing a few Celtic fiddle tunes with friends, perhaps at a house dinner or in a music session at a local bar.</p><p>Joining in with the music is probably the most fun part of all.</p><p>And this course has been created to help fiddle and violin players on their Celtic fiddle music journey and most importantly, having fun whilst playing Celtic fiddle music. </p><p><strong><br></strong></p><p><strong>Take The Next Steps On Your Musical Playing Journey With The Seven Essential Techniques for Celtic Fiddle</strong></p><ul><li>Short Engaging Presentations</li><li>Simple Exercises</li><li>Learn On The Go</li><li>Ideas on how to create your own musical adventures are also included</li></ul><p><strong><br></strong></p><p><strong>Understand Some of The Secrets Of Celtic Fiddle Playing With The Seven Essential Techniques</strong><br></p><p>There are many benefits to playing Celtic fiddle. You can develop the skill of learning to play a fiddle tune by ear and this skill alone makes it more fun to join in playing with other people at a music session!</p><p>And very often there is the question,'Where do I start if I want to take the next steps on my  Celtic fiddle journey or improve my Celtic fiddle playing?'</p><p>Well, the Seven Essential Techniques, created by Colin MacLeod, provides you with that opportunity to take those next steps.</p><p><br></p><p><strong>Contents and Overview</strong></p><p>This course contains 11 segments and over thirty minutes of compacted teaching time, excluding the practice and application of the exercises.</p><p>The course is designed for someone who wishes to take the next steps on their Celtic fiddle playing journey and have fun whilst doing so!</p><p>In this course, you will learn the Seven Essential Techniques to take your Celtic fiddle playing to the next level.</p><p>You'll discover the art of learning a tune by ear, ways to bring a tune alive and ways to apply those skills.</p><p>You'll also receive bonus material that reinforces what you have learnt and will give you a few ideas of what to do next!</p><p><strong><br></strong></p><p><strong>What are the requirements?</strong></p><ul><li>A desire to take the next steps on your Celtic fiddle playing journey</li></ul><p><strong><br></strong></p><p><strong>What am I going to get from this course?</strong></p><ul><li>Over thirty years of Colin's Celtic fiddle playing and teaching experience crammed into this course!</li><li>By the end of this course, you will be able to join in with more musical conversations with friends, both old and new and play with more energy!</li><li>Your Celtic fiddle playing will sound brighter and fresher!</li><li>You will have the skills to learn a Celtic fiddle tune from scratch and colour it with your own voice!</li></ul><p><br></p><p><strong>Who is the target audience?</strong></p><ul><li>Fiddle players have are beginning their Celtic fiddle playing journey</li><li>Violinists who would like to learn more about Celtic fiddle</li><li>Someone who has been learning violin, has taken a break and is returning to playing again and would like to join in playing at Celtic music sessions</li></ul><p><strong></strong></p><p><br></p>", 
    "end_date": null, 
    "title": "7 Essential Techniques To Improve Your Celtic Fiddle Playing", 
    "price": "20.00", 
    "instructors": "Colin MacLeod", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657354_fff7_2.jpg", 
    "course_url": "https://www.udemy.com/7-essential-techniques-to-improve-your-celtic-fiddle-playing/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T00:47:55Z"
}