{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Installing Wordpress 4.x – installation, hosting and configuration</strong> is a course totally designed in order to provide beginners with a straightforward action tips necessary to install and get up Wordpress running on a webhost.</p>  <p>I will start by discussing different types of webhosting and explain the pitfalls related to having your host both for storing your files and handling the ownership of your domain name. After those lectures you’ll know exactly why you need to stay away from this strategy and how easy to avoid it.</p>  <p>Next, I am going to cover how you can install Wordpress in just a few second with the help of quick install script. We will also cover a manual way of installing Wordpress through FTP which is easier than you think.</p>  <p>After we have Wordpress in the place, we will look at how you can easily add posts and pages to your website while also explaining when and how you should use those depending on your specific purposes.</p>  <p>You will also learn how to install and modify themes in Wordpress which is one of the fundamental stones of Wordpress as it allows you to change the design of your website in just a few clicks. </p>  <p>Plugins, which is also one of the fundamentals stones of Wordpress as well can easily transform your website from a simple “Hello world” to an advanced and impressive membership community.</p>  <p>You will learn how to find plugins, where, what should decide whether you should install a plugin and the common pitfalls you need to be aware of because the wrong plugin can cause a total mess with your site. Plus, I will present three plugins that every site should have installed!</p>  <p>As our final assignment, I am going to show you how to create a completely free Wordpress site while explain the pros and cons of it as well. </p>  <p>All in all, when you are done with this course you will be able to easily install Wordpress no matter what host you are running, understand how plugins can either make or break your site, and also keep your site responsive or mobile friendly which is crucial nowadays <strong>for higher ranking in search engine results pages</strong></p>  <p><strong>What are the requirements for joining this course?</strong></p>  <p>This course is completely for beginners and there are no specific pre-requirements, just a strong will to learn and test things</p><p><strong>What are you going to get from joining this course?</strong><br></p>  <ul><li>Install, modify and enhance your Wordpress installation</li><li><span></span>Easily install new functionality to your Wordpress</li><li><span></span>Make your site mobile friendly with just a few clicks</li><li><span></span>Discover the pitfalls you need to watch out for</li><li><span></span>Keep your site safe with free and powerful plugins</li></ul>  <p><strong>What is the target audience of this course?</strong></p><ul><li>Any person learned to install, modify and work with Wordpress.</li><li><span></span>Discovering how plugins can make or break your website</li><li><span></span>Learning the pitfalls of choosing your webhost for handling your site and domain</li><li><span></span>Discovering the ease of setting up free Wordpress site and its limitations</li><li><span></span>Transforming your website into mobile friendly in just a few seconds.</li></ul>", 
    "end_date": null, 
    "title": "A Cheat Sheet for Installing Wordpress in 24 Hours or Less", 
    "price": "20.00", 
    "instructors": "Mr Mirsad Hasic", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578782_fb11_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-install-wordpress-4-with-ease/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T07:41:10Z"
}