{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course was designed to help you <strong>find your own musical voice</strong>,\n how to plan your musical composition and how to use your current music \ntheory knowledge without losing sight of your natural musical instincts \nin the process.\n\n</p>\n\n<p>Whether you are starting out, a semi-pro musician or an enthusiast, \nthis course was thought out to help you overcome the difficulties of \nimplementing your musical ideas in a way that actually expresses your \nintents, without being dominated by the music and instead you dominate \nthe flow of musical events you are creating, in whatever the genre you \nare composing.\n</p>\n\n\n\n<p>The focus of this course is not in music theory, since this is not its \npurpose, and also because I assume that you already have a basic \nknowledge of things like scales or chords. Instead, we will be looking at how we can use contexts, images, ideas, emotions \nto give us hints on \n\t<strong>how we can use the various musical elements to \nexpress ourselves in our music compositions</strong>. And, of course, to have fun making music.</p><p>You will find videos explaining the basics so that what you can follow through the specially made music examples  that illustrate the main ideas behind this course. In the last video, you will be prompted to engage in a project assignment, where you will have the opportunity to apply everything you know and learned.</p><p>I will be waiting for your submissions!<br></p>", 
    "end_date": null, 
    "title": "A Practical Guide to Music Expression", 
    "price": "20.00", 
    "instructors": "Pedro Murino Almeida", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/889956_78bb.jpg", 
    "course_url": "https://www.udemy.com/themusicworkspace/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-27T21:41:15Z"
}