{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Note:</strong> The vast majority of the first section is <strong>free</strong>. Please view these free videos. They will give you an idea of how the rest of the course is structured. Thank you. </p><p>Although a gross oversimplification,<strong> Amazon Redshift </strong>is a traditional <strong>data warehouse </strong>platform.</p>\n\n<p><strong>Data warehousing </strong>has been around for quite a <strong>number</strong> of years now. There have been many <strong>evolutions</strong> in data modeling, storage, and ultimately the vast variety of tools that the business user now has available to help utilize their quickly growing stores of data. </p>\n\n<p>As the <strong>industry</strong> is moving more towards <strong>self service business intelligence solutions</strong> for business users, there are also changes in how data is being stored. <strong>Amazon Redshift </strong>is one of those <strong>\"game-changing\" </strong>platforms that is not only driving down the total cost, but also driving up the ability to store even more data to enable even better business decisions to be made. </p>\n\n<p><strong>One</strong> of the greatest features about all Amazon’s service is that much of the <strong>mundane</strong> <strong>administration</strong> tasks have been <strong>removed</strong>. The hardware, software patching, and disk management (all of which are no small tasks) have been taken on by Amazon. Disk management, particularly the <strong>automated recovery from disk failure</strong>, and even the ability to begin querying a cluster that is being restored (even before it is done) are all powerful and compelling things Amazon has done to <strong>reduce your workload</strong> and increase up-time.</p>\n\n<p>In the <strong>course</strong> we will create <strong>nodes</strong>, called <strong>redshift cluster</strong>. Once we spun up a node we can <strong>upload our data sets </strong>and perform data analysis. We will walk through all the steps necessary to begin using a redshift cluster in the real world. </p>\n\n<p>One of the <strong>greatest</strong> benefits of Redshift is <strong>blazing fast query performance.</strong> There are two core items that are responsible for this. The use of<strong> columnar storage</strong> technology to improve I/O efficiency and parallelizing queries across multiple nodes.  The parallelizing of queries across many nodes is known as <strong>MPP or Massive Parallel Processing</strong>. </p>\n\n<p>The underlying hardware is designed for <strong>high performance data processing</strong>, using local attached storage to maximize throughput between the CPUs and drives, and a <strong>10GigE mesh network</strong> to maximize throughput <strong>between nodes.</strong></p>\n\n<p>The last nail in the coffin for the traditional brick and mortal data warehouse is <strong>cost</strong>. Redshift accomplishes all this at a <strong>fraction of the cost</strong> of the traditional data warehouse. </p>\n\n<p>If you are looking to <strong>expand</strong> your <strong>knowledge</strong> about Amazon’s data platform and specially about their Redshift service then <strong>this course is for you.</strong> </p>\n\n<p><strong>Thank you </strong>and welcome to <strong>Redshift</strong>. </p>", 
    "end_date": null, 
    "title": "A Real World Introduction to Amazon's Redshift", 
    "price": "20.00", 
    "instructors": "Mike West", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794814_0d1b.jpg", 
    "course_url": "https://www.udemy.com/a-real-world-introduction-to-amazons-redshift/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T15:36:27Z"
}