{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>When you are ready to take your knowledge from 101 Basic Keelboat ground school,to the next level of sailing knowledge:  adding reefing, anchoring, basic navigation and good mariner stuff  to what you&#039;ve already learned, then this is the right place for your next step.   OR when you are facing the prospect of taking the 103 Basic Coastal Cruising written exam, this is the right summary course to review before passing your exam with flying colors. Additionally, you will have the knowledge that will bring you to a whole new level of understanding sailing: intermediate level terminology, systems, concepts and tips to help you make sense of your on-the-water experience. </p><ul style=\"\"><li><strong style=\"\">Learn intermediate sailing– and be safe and competent on the water</strong></li> <li><strong style=\"\">Ace your 103 written knowledge exam – without test anxiety</strong></li> <li><strong style=\"\">Feel competent in your new role as skipper or crew on a sailboat</strong></li> <li><strong style=\"\">Accelerate your learning – fast, easy and more efficient than reading</strong></li></ul><p> This course is patterned after the format of the American Sailing Association&#039;s learn to sail programs. It does not take the place of an ASA instructor or on-the-water practice and experience. However it contains a body of essential knowledge to advance your skills and seamanship. This course contains over two hours of content – utilizing over 250 colorful pictures, graphics and narrations by a senior ASA instructor to add to your experience of having “been there done that&quot; before you ever face the situation on the water. The content is divided into seven modules:<strong style=\"\"> T</strong>erminology (Sailor-speak); <strong style=\"\">A</strong>nchoring, <strong style=\"\">R</strong>ules of the Road; <strong style=\"\">C</strong>harts and <strong style=\"\">N</strong>avigation; <strong style=\"\">K</strong>nots to Know; and <strong style=\"\">R</strong>equired/<strong style=\"\">G</strong>ood to Know. <strong style=\"\">S</strong>upplemental content covers some topics in detail… all essential knowledge to advance your confidence and competence while sailing an auxiliary powered sloop rig in light to moderate sea conditions and winds.</p>", 
    "end_date": null, 
    "title": "Ace Your 103, Basic Coastal Cruising Written Sailing Exam", 
    "price": "30.00", 
    "instructors": "Capt. Howard Edson Sr.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494716_ae08_3.jpg", 
    "course_url": "https://www.udemy.com/ace-your-103-basic-coastal-cruising-written-sailing-exam/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T02:29:17Z"
}