{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p style=\"\">So you are new to sailing and you don&#039;t know what you don&#039;t know. What are &#039;points of sail&#039;, or &#039;stand-on vessel&#039; or &#039;leeward&#039; (pronounced lew-ward)? This is a good place to start!<br style=\"\"> OR<br style=\"\"> Are you facing the prospect of taking the 101 Basic Keelboat Sailing written test? After completing this course you will be able to pass the exam with flying colors.</p><p style=\"\">Additionally, you will have the knowledge that will bring you to a whole new level of understanding sailing: terminology that will become automatic, and concepts that make sense of your on-the-water experience.</p><ul style=\"\"><li style=\"\"><strong style=\"\">Learn sailing basics – and be safe on the water</strong></li><li style=\"\"><strong style=\"\">Ace your written knowledge exam – without test anxiety</strong></li><li style=\"\"><strong style=\"\">Accelerate your learning – fast, easy and more efficient than reading</strong></li></ul><p style=\"\"><br style=\"\">This course is patterned after the format of the American Sailing Association&#039;s learn to sail programs. It does not take the place of an ASA instructor or on-the-water practice and experience.  However it contains a body of essential knowledge to advance your skills and seamanship.<br style=\"\"></p>This course is over two hours of content – utilizing over 250 colorful pictures, graphics and narrations to add to your experience of having “been done that&quot; (before you ever face the situation on the water for the first time). The content is divided into six modules: Poiints of Sail; Terminology (SailorSpeak); Rules of the Road; Basic Navigation; Knots to Know; and Required/Good to Know. Supplemental content covers some topics in detail… all essential knowledge to keep you safe in a in a small sailboat during day in light to moderate sea conditions and winds.", 
    "end_date": null, 
    "title": "Ace Your 101, Basic Keelboat Written Sailing Exam", 
    "price": "30.00", 
    "instructors": "Capt. Howard Edson Sr.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441050_7723_3.jpg", 
    "course_url": "https://www.udemy.com/ace-your-101-basic-keelboat-written-sailing-exam/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T06:11:16Z"
}