{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong>Acute respiratory failure (ARF) is a medical emergency. Without appropriate care it may constitute a direct threat to patient’s life. That’s why it is extremely important to be proficient in timely recognition and adequate management of this critical condition.</p><p>Developed by practicing critical care physician with extensive teaching experience, this course is intended to provide essential medical knowledge on ARF in clear and student-friendly style.</p><p>The course starts with basic definitions and an overview of main ARF types, followed by description of causes and mechanisms of ARF development with relation to impairment of the structural components of the respiratory system. Another section presents an insight into important diagnostic considerations, including clinical presentations, pulse oximetry saturation and arterial blood gas analysis. The final section is devoted to the management strategies with particular review of airway control, oxygenation and ventilation methods. Sections are followed by quizzes in order to solidify newly acquired knowledge.</p><p>At completion of the course, students will be able to recognize patients with respiratory failure, define and classify types of ARF, differentiate between causes, analyse and describe mechanisms of respiratory dysfunction, prove diagnosis of ARF, choose and substantiate measures of critical care.<strong></strong></p><p>The course will be beneficial for medical students, nursing students, medical professionals and for anyone who are interested in improvement and refreshment of their knowledge in the area of clinical respiratory medicine.</p>", 
    "end_date": null, 
    "title": "Acute Respiratory Failure", 
    "price": 0, 
    "instructors": "Dr. Alexei Birkun", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624548_6b87_2.jpg", 
    "course_url": "https://www.udemy.com/acute-respiratory-failure/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T10:38:14Z"
}