{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tIn this tutorial,i will introduces the work process behind many of his vector landscapes, and details how, by using Illustrator CS6’s updated Pattern tool, he adds further depth and ease to the illustration.<br style=\"\">  \t<br style=\"\">  \tYou’ll learn how to use this tool to build repeating objects within vector scenes. These include vector-only textures created from crescent shapes that add a hand-made look. Alex also explains how to tweak those patterns, and how to best make them a part of the scene you intend to create.<br style=\"\">  \t<br style=\"\">  \tThe techniques shown here can be applied to making landscapes, as well as any pattern creation within Illustrator, including simplifying any work that contains repeated objects.  </p>  <p>  \tAdobe Illustrator can be used to accomplish many different design tasks, from illustration to app development. This course demonstrates core concepts and techniques that can be applied to any workflow—for print, the web, or building assets that will find their way into other applications.  </p>  <p>  \tAuthor explains the elements that make up vector graphics (paths, strokes, and fills) while showing how to use each of the drawing tools, and demonstrates how to combine and clean up paths and organize them into groups and layers. The course also covers text editing, working with color, effects, and much more.  </p>", 
    "end_date": null, 
    "title": "Adobe Illustrator CS6 Tutorial For Beginners", 
    "price": "20.00", 
    "instructors": "Howard  Simpson", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438960_d03a_7.jpg", 
    "course_url": "https://www.udemy.com/learn-adobe-illustrator-cs6/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T21:24:57Z"
}