{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>The <em>ultimate guide</em> to iOS Animations.</strong><strong>  The most comprehensive, practical, technically correct, and up-to-date guide on iOS animations in existence.</strong></p>Gain an insightful and practical understanding of how iOS animations operate and learn how to apply this understanding to your apps with this <strong>swift</strong>-based tutorial designed for intermediate to expert iOS developers.<p><span></span></p><ul><li>Learn the block animation API's (And all their quirks)</li><li>Animate without causing auto-layout issues</li><li>Understand iOS8/9 additive animations and how to use them to reduce your work</li><li>Handle Gesture-controlled animations &amp; smoothly transition to non-gesture animations</li><li>Grasp Core Animation and how the 'presentation', 'model', and 'in-flight' values relate to your animations.</li><li>Learn about exponential animations (And why you should never use easing ever again)</li><li>Animate constraints properly to keep your code clean</li><li>Wield the view-transformation properties with ease</li><li>Understand how animations relate to the kernel's XPC layer</li></ul><p><strong>Wield iOS animations with precision.  Understand how every-piece of your animations interacts with the rest of your code.</strong></p><p>Knowing how to animate in iOS is the most<strong> lucrative</strong> and <strong>sought-out</strong> skill-set for an iOS developer.  These skills are the difference between charging <strong>$120/hr</strong> and <strong>$340/hr</strong> that I can command.  As you'd expect for such a lucrative field, acquiring the skills needed to be a good iOS animation developer is almost impossible.  <strong>I've even taught ex-apple employees how to properly animate their apps.</strong>  I'm taking my <strong>9 years</strong> of battle-tested iOS experience with animations, and my previous job as a <strong>professional iOS reverse engineer for fortune 100's,</strong> and placing them into a straight-forward course. It's not that animations are particularly difficult, but <strong>the rate at which the underlying API's change, the level of kernel interaction, the contradictory statements on apple's part for their own technology, the numerous bugs, and amount of information</strong>, are all roadblocks when learning animations.  That's why i'm confident that this is the best course in iOS animations and why i'm confident that anyone can learn to do this; not just the <em>experts</em>.</p><p><strong>Content and Overview</strong><br></p><p>Suitable for intermediate-to-advanced iOS developers, through the very dense few hours of video content, you'll learn everything you need to know to apply iOS animations to your apps just like the experts.</p><p>Starting with an introductory <em>Hello World</em> project, this course helps you get a new template project started for those who may be weaker in setting up iOS scaffolding.  This template project will be referred to during the rest of the course.  During this time, we will go over material targeted towards novices and to fill in the gaps of intermediate developers who may be unfamiliar with configuring scaffolding (storyboard and custom-views).  </p><p>After, we will go into depth about the easing UIView animation helpers and take our time to understand patterns, animatable properties, and even how they work under the hood by diving into how Core Animation fundamentals.</p><p>With these basics mastered, we will go into even more subtle details about all the UIView animation helpers which includes the newly added iOS8/9 behaviors of additive animations and how to animate with CGAffineTranform's.  </p><p>Beyond the basics, we go over the Keyframe &amp; spring animations and let students in on the <strong>big secre</strong><strong>t </strong>of why exponential <strong>should replace</strong> all easing-animations &amp; how to use exponential animations via some clever usage of a spring.</p><p>We end the UIView animation helper section by going over how to animate constraints and a set of secret, and officially public, set of helper functions that allow you to set additional UIView animation properties normally only accessible by dropping down to raw core animation.</p>For the finale, we finish with a beautiful demo app that we build along with you; a tinder-esque app that captures all the subtle details of the real application including interactive-animations.<p><br></p>", 
    "end_date": null, 
    "title": "Advanced iOS 9 Animation: The Comprehensive Guide", 
    "price": "20.00", 
    "instructors": "Seo Townsend", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631686_df54_4.jpg", 
    "course_url": "https://www.udemy.com/the-dark-art-of-ios-animations/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T20:09:01Z"
}