{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Please note: This is a continuation from my first course titled, \"<em>How to Become a World Class SQL Server Performance Tuner</em><em>.</em>\" I highly recommend you take that course first. </strong></p><p>\"I've been working as SQLServer dba for +8 years, but I'm still learning every single day... So, thanks a lot for <strong>your courses, videos and tutorials</strong>, they really help me.\"</p><p>Fer</p><p>\"He uses clear cut examples to illustrate real world scenarios. <strong>Mike is one of the few SQL Server instructors that seems very focused on performance issues</strong> and I'm really glad to have stumbled onto his courses.\"</p><p>Ken</p><p>This course focuses on making SQL Server perform more optimally.</p><p>In my first course we laid the groundwork by tuning <strong>OUR</strong> instances with a top down approach. </p><p><strong>WE</strong> will continue on that path with this course. </p><p>Even though the course has the word “Advanced\" in it, there's <strong>NOTHING COMPLICATED </strong>about taking what's in the course and applying it in the real word. </p><p>It's “advanced\" in that I'll take more time explaining how to implement these recommendations. </p><p>The course is still very much a \"<strong>buttons and Knobs</strong>\" course. This simply means WE won't dive too deeply into the minutia. We are still going to focus on items that are easily implemented. Some features will have a level of contention associated with them in the SQL Server community. It will be up to you decide to implement or not. </p><p>Additionally, some of the concepts may be new to even more senior level resources so I want to make sure I'll cover the why of the topic as well as the how. </p><p>This course will give <strong>YOU</strong> deeper insight into what it takes to become a skilled <strong>PERFORMANCE TUNER</strong>. </p><p>Once thought of as an art, performance tuning is nothing more than a series of processes that seek to accomplish <strong>TWO</strong> basic goals. </p><p>The FIRST one is to <strong>increase</strong><strong> the </strong><em><strong>response time</strong> </em>for a given transaction or set of transactions. </p><p>The SECOND one is <strong>reduce </strong><em><strong>resource consumption</strong></em>. On the surface this sounds simple but nothing could be further from the truth.</p><p>Take the next step on <strong>YOUR</strong> performance tuning journey and <strong>SIGN UP</strong> now. </p>", 
    "end_date": null, 
    "title": "Advanced SQL Server Performance Tuning", 
    "price": "20.00", 
    "instructors": "Mike West", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543766_8b21_2.jpg", 
    "course_url": "https://www.udemy.com/advanced-sql-server-performance-tuning/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T03:47:14Z"
}