{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Do you already use reporting software such as Access, SSRS or WebI? Or is this your first reporting software tool? Either way, welcome.</p><p>In just a couple of hours, find out how to create reports in one of the common reporting tools, and add another tool to your CV.</p><p>Tableau is one of the most requested reporting tools that are requested in the job market, and the ability to being able to use it now could be very useful for your current work, and your next job hunt.</p><p>We'll download and install for free a trial version of Tableau Desktop. We'll investigate existing sample reports and create reports of our one. These will include bar charts, line charts and maps, using colors, labels and tooltips to help the user understand the data.</p><p>We'll create dashboards and storyboards, so that you can tell a story. We'll also have a look at some free resources, so you can see what the professional do.</p><p>The course will take around 3 hours to complete - less than half a day - but completing this will enable you to create reports of your own, and know how to overcome common problems.</p><p>The course increases in difficulty slowly, so you'll create for instance a basic bar chart, then turn it into a stacked bar chart, and adding coloring and information through tooltips and labels, step by step.</p><p>The course is fairly relaxed - there will be a few \"wrong turns\", so you can see what problems might arise, but every lesson works towards an end goal at a relatively slow pace, so you can follow on your own computer easily. I assume that you know how to use a computer, including installing programs, but the actual analysis will be at a basic level, and I'll introduce every component as we go on.</p><p>At the end of the course, you can download a certificate of completion, so you can show everyone your new-found skills, and be able to start creating analyses for yourselves.</p>", 
    "end_date": null, 
    "title": "An introduction to Tableau Desktop - Business Intelligence", 
    "price": "20.00", 
    "instructors": "Phillip Burton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721888_5da3_3.jpg", 
    "course_url": "https://www.udemy.com/an-introduction-to-tableau-desktop-/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T15:32:41Z"
}