{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Only you know who you really are. Only you know your true capabilities, and your innermost aspirations and ideals. You have the responsibility to know yourself and to be true to what you are here to give. Fulfilling this is your purpose.    </p>\n\n<p>Following this inspiration is a pathway to success. You will not find happiness by serving what others think you ought to do, but by following your heart—your own inner guidance, and listening to your higher Self. Feel what lays dormant inside of you, waiting to be shared; bursting with energy, enthusiasm, and joy!</p>\n\n<p>There is no reason to continue going through life without inspiration—that which we are here to find within ourselves, and to share with mankind.</p>\n\n<p>“If your vocation does not satisfy your heart, it is not the right path for you.If you want to reach the abode of lasting peace and happiness, you should pursue whatever path your heart’s desire tells you to follow.” —Paramhansa Yogananda</p>\n\n<p>We are here to grow with one another, to aspire to become a part of a greater reality, and to awaken to our infinite potential. We are here to learn lessons, to find purpose, to give meaning to life, and to expand our God-given higher natures.</p>\n\n<p>Now is the time to begin an inspired life full of purpose and meaning.</p>\n\n<p>---</p>\n\n<p>The purpose of this course is to help others tune into the inspiration and meaning in life that they are seeking. To learn how to be successful in the highest sense, by rediscovering the boundless fountain of enthusiasm and joy for life that resides within.</p>\n\n<p>To be alive is to be on fire with purpose, to move forward with undaunted determination toward a goal. You must be enthusiastically active, make something of yourself,and give something worthwhile to the world.” —Paramhansa Yogananda</p>\n\n<p>The inspiration for this course is Paramhansa Yogananda, author of one of the best-selling spiritual books, Autobiography of a Yogi. Yogananda came to the US to share the ancient yoga teachings of India, with applications to this age of energy, far ahead of his time. His profound yet practical teachings inspired successful leaders and creatives like Steve Jobs, George Harrison, Luther Burbank, and Henry Ford.</p>\n\n<p>Use this course as a practical guide that you can return to at any time to rejuvenate yourself, your life purpose, and regain your center for a happier, more fulfilling life.  By guiding you through the process of finding your source of inspiration in life, we will lead you to your purpose, and give you the beginning steps for making an inspiration manifest.</p>\n\n<p>The course is filled with practical exercises to help you apply what you read so that the book becomes your own experience. Your own insight will help to make the course more meaningful, and your participation will make it come alive.</p>", 
    "end_date": null, 
    "title": "An Inspiration-Driven, Success-Giving Life", 
    "price": 0, 
    "instructors": "Kalamali Lee", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527796_64bc_3.jpg", 
    "course_url": "https://www.udemy.com/inspiration-driven-success-giving-life/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-14T03:52:21Z"
}