{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\tThis course reveals an ancient tradition of Chinese herbology, in a 5000 year old lineage called the<em> Gate of Life</em>, which focuses on the use of Tonic herbs for daily health, metabolism, reproductive health, immunity, adaptability, mental clarity and spiritual perception.\r\n</p>\r\n<p>\r\n\t          We will study the profound health philosophy known as the &quot;Three Treasures&quot; - <strong><em>Jing</em></strong> (physical mass and reproductive potential)<strong><em> Chi</em></strong> (driving-force of evolution) and <strong><em>Shen</em></strong> (spirit), and we will take a deep look at  the ancient mystical herbs that &quot;tonify&quot; these energies. These herbal elixirs combined with a healthy diet can help enhance the potential to experience long lives of vitality, youthfullness, sexual potency and creativity.\r\n</p>\r\n<p>\r\n\t          The Gate of Life herbal lineage has been veiled from the west, until now; this is the first-ever course designed to bring the Gate of Life wisdom to the Western public. These 10 lessons are inspirational and non-technical. The course is designed to plant a seed by which you will see the deeper mechanisms of life, and you will continue after the course to gain clearer view of this ancient wisdom as you experience life.\r\n</p>\r\n<p>\r\n\t            Would you like to become an initiate into a 5000 year old health lineage?\r\n</p>\r\n<p>\r\n\t           This course is designed to drop a seed of truth into your palm.\r\n</p>\r\n<p>\r\n\t           The Gate of Life course is simple at the surface, but you will spend the rest of your life watching this seed grow firm roots, for only through time, observance and pure living, can one come to know the true depth of Taoist health philosophy.\r\n</p>\r\n<p>\r\n\t     Learn about the yin, grow your foundation, and nourish your soul through the Gate of Life – welcome to the first step in your journey.\r\n</p>\r\n<p>\r\n\t<em><strong>Testimonials from Students:</strong></em>\r\n</p>\r\n<p>\r\n\t<em><strong></strong></em><em>&quot;I am really enjoying your program. Thank you so much for offering this precious teaching! You are a gifted teacher. Your eloquent and articulate explanations and stories ignite imagination and interest and make learning fun and easy.&quot; —</em>Marguerite Hernandez\r\n</p>\r\n<p>\r\n\t<em>&quot;Thank you for this very informative course. I am enjoying the videos and learning about the wonderful things Mother Earth provides for us. The more I learn, the deeper the feeling is, for this information and also for the herbs.</em>\r\n</p>\r\n<p>\r\n\t<em>You, Rehmannia, have expressed things in a very easy to understand, and enjoyable way. I look forward to my years of learning and experiencing the things that are for me to learn regarding the Taoist Health Philosophy.</em>\r\n</p>\r\n<p>\r\n\t<em>For some reason, the herbs feel “holy” to me, and I hope they may become a part of me as I am ingesting the energies they have for me. Obviously, I am overjoyed with the Lessons and my new experiences.&quot; —J</em><em>ewel Bowles</em>\r\n</p>\r\n<p>\r\n\t<em>&quot;I would love to Share my Gratitude for this beautiful insight into such an ancient wisdom. The insight of what Mother has to offer us for we are built of the same energies as she. Also the aspects of working on all the areas of our beings (physical, mental and Spiritual). Mother nature has so much to show us if we become still enough to observe what is going on around us. The light stored in each plant and its potential to be shared with us.</em>\r\n</p>\r\n<p>\r\n\t<em>Thank you so much!&quot; —</em><em>From Mark Fulcher</em>\r\n</p>\r\n<p>\r\n\t<em>&quot;I feel very blessed to have the opportunity of studying this work you have put together with so much enthusiasm, love, and connection to nature. I see it as a code, which, like you say on the lessons, put together with other aspects of the awakening process, helps completing the puzzle of life. Words can’t say how thankful I am.&quot; —</em><em>Abel Moreno</em>\r\n</p>\r\n<p>\r\n\tExcellent presentation by Rehmannia Dean Thomas and the health evaluation he offered afterwards was worth it’s weight in gold. The question – How did humanity deviate so far away from the truth of what nature/nurture has intended for us. Allopathic medicine is so far from the natural order of the universe.\r\n</p>\r\n<p>\r\n\t— Jimmy Sechrest\r\n</p>\r\n<p>\r\n\t <strong><em>Testimonials about The Book for the Course:</em></strong>\r\n</p>\r\n<p>\r\n\t <em>Healing Thresholds by Rehmannia Dean Thomas is an intriguing book  that helps us begin to grasp the essence of profound deep life force  through the art of Taoist Tonic herbalism. This book gives a beautiful  account for the reader to grasp the general principles and details of  this deep level of herbalism, which integrates well with the use of  living foods and other more advanced approaches to longevity and optimal  well being.”</em>\r\n</p>\r\n<p>\r\n\t   – Gabriel Cousins M.D., M.D.(H), Diplomate of American  Board of Holistic Medicine, Diplomate of Ayurveda\r\n</p>\r\n<p>\r\n\t <em>Dean has the personality of calmness and kindness. His voice is soft,  his eyes deep. When he diagnoses, you trust him. His communication is  soft, well intended and trustworthy. One is able tyo feel the heavens  and the earth in him!</em>\r\n</p>\r\n<p>\r\n\t   – Gurmukh Khalsa (Golden Bridge Yoga)\r\n</p>\r\n<p>\r\n\t <em>Hi there fellow Aquarian Age light leader! I was just thinking about  you 24 hrs. ago, and thought I’d eventually write you to tell you I just  finished your book, The Hsien.smile I took my time with it over the  summer, reading a few chapters at a time…but the last 40 pages I read  monday night/tuesday morning. Really wonderful~~touched my soul in many  ways…and felt like it was meant for me to read, as the call I’ve  received to step up my helping our world as is has been intense and  rapid over the last year especially. Some of your writing touched my  heart so much tears rolled, blurring my vision, forcing me to take  breaks from finishing the last few pages. Really beautiful work,   Rehmannia  Dean.  Thank you for sharing your vision, imagination and  wisdom all within a story that unfortunately does feel more probable  than utter fantastic sci-fi….I do wish more people to read it and I will  pass it on to friends and family, most definitely.</em>\r\n</p>\r\n<p>\r\n\t   —Lisa Ann\r\n</p>", 
    "end_date": null, 
    "title": "Ancient, Mystical Herbs for Health & Longevity", 
    "price": "50.00", 
    "instructors": "Rehmannia Dean Thomas", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/163102_43e8_2.jpg", 
    "course_url": "https://www.udemy.com/ancient-mystical-herbs-for-health-longevity/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-12T22:55:22Z"
}