{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">If you are searching for a Android course with added advantage of Java Programming</p><p style=\"\">Did you want to prepare for Android Interview , your search will ends here. Welcome to Professional Android App Development Training , This course is the essence of my past 11+ years experience on Mobile Application programming and Java. After going through 100 + workshops on Android App Development and Training 25,000+ Students and Programmers Across India, I created this  and <strong style=\"\">daily I am adding 5 new video tutorial with brand new topics.</strong></p><p style=\"\">“Imagination is more important than knowledge. For knowledge is limited to all we now know and understand, while imagination embraces the entire world, and all there ever will be to know and understand.&quot;</p><p style=\"\">-- Albert Einstein</p><p style=\"\">In this course you will learn how to convert your imagination into programming. you will learn key concept first in Java and then will learn Complete Android Programming with 15+ projects. All the essential topic is covered in this course with full detail.</p><p style=\"\">This course is about Android Programming, and contain full practical approach of creating Android application.</p><p style=\"\">This course contain videos, pdf and source code of practical on android programming.</p><p style=\"\">This course is structured into Sections and topic wise, starting from the basic of Java, Installation of Eclipse and Android Studio, Basic of Android , Designing components in Android types of Services and lot of topics that will helpful in your professional Programming in Android</p><p style=\"\">You should take this course if you want to became hard core Android programmer, if you are working in Android Project and need help on the particular topic on Android.</p><p style=\"\">So Join this course and be update on new topics on Android Programming</p>", 
    "end_date": null, 
    "title": "Android Application Programming - Build 20+ Android Apps", 
    "price": "50.00", 
    "instructors": "Girish Shakya", 
    "commitment": "28.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315468_63dc_3.jpg", 
    "course_url": "https://www.udemy.com/professional-android-app-development-training/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T01:03:15Z"
}