{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p> Anger Management Technique to eliminate anger fast in this course you will learn to eliminate anger from your life with an easy to learn and apply technique that connects mind and body. But not just that you will also be learning a life changing technique that will let you overcome fears , feel more confident and help to remove the barriers we call bad feelings that cause you to hold back from all of what want to do with your life..  </p>\n\n<p>  \t    1) You will be guided through an exercise that will prove to you that every thought you have effects how you fee.l.  </p>\n\n\n\n<p>  \t    2) You will learn a technique that will help you change the way you think and feel..  </p>\n\n\n\n<p>  \t    3) You will learn my secrets that have helped me change so many peoples lives on a daily basis.  </p>\n\n\n\n<p>  \t    4) You will have access to my book as a download that has  protocols for working on 28 more areas of your life with this technique you are about to learn.  </p>\n\n\n\n<p>  \t    5) You will also be able to down load 4 mp3 files of how to learn and apply this technique so that you can use it anytime.  </p>\n\n\n\n<p>  \t    6) You also get a Hypnosis recording that was created just for this program that you can download also.  </p>\n\n\n\n<p>  \t    7) There is no risk by buying this course because you have a 30 day money back guarantee if you get absolutely no result from engaging in and using this technique. Also you are welcome to keep all the downloadable material, because I am confident that if you set aside a little time to try this course out just watch how your life begins to change around you.  </p>\n\n\n\n<ul>  \t<li><strong>All Videos are downloadable for easier access offline</strong></li>  </ul>", 
    "end_date": null, 
    "title": "Anger Management Technique to eliminate anger fast", 
    "price": "25.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319538_167f_2.jpg", 
    "course_url": "https://www.udemy.com/my-secret-to-eliminating-anger-from-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T15:56:00Z"
}