{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t     Apitherapy encompasses the use of bee hive products including honey, bee pollen, propolis, royal jelly and bee venom.  Apitherapy is used to treat many illnesses and to alleviate pain from injuries both chronic and acute.  The honey bee and hive products have historically played a large role in disease care and prevention. Science is finally catching up to what naturalists, herbalists, and acupuncturists have known for years.  </p>  <p>  \t     In this course with organic beekeeper and apitherapist Ross Conrad, you will learn about using honey, bee pollen, propolis, royal jelly, beeswax and bee venom to promote healing and health.  From burn treatment and the common cold, to arthritis, cancer and multiple sclerosis, Ross shares how each of these products can be beneficial to human health.  Ross explains how bees make each of these products and how the bees use them in the hive.  He covers the chemical constituents of each product and how each product can promote health and healing.  </p>  <p>  \t     Ross draws on his considerable experience as an organic beekeeper and explains how these products are harvested from the hive with the success of the hive as the ultimate goal.  With the help of volunteers from the live audience Ross even demonstrates how to give a live bee sting!  </p>  <p>  \t     As Ross says “everything about the bees is so healing; it is astounding really”.  Be prepared to be astounded!  And be thankful for the bees!  </p>  <p>  \t     This workshop was filmed at:  </p>  <p>  \t    Metta Earth InstituteLincoln, Vt  </p>", 
    "end_date": null, 
    "title": "Apitherapy", 
    "price": "35.00", 
    "instructors": "Organic Beekeeping Ross Conrad", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/167018_5ef9_2.jpg", 
    "course_url": "https://www.udemy.com/apitherapy-health-and-healing-from-the-hive/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-19T03:27:04Z"
}