{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  This computer based training course on Apple Compressor  from Infinite Skills takes you through the features and functions of this video/audio compression and encoding application from Apple. Used together with Final Cut Pro X and Motion 5, Compressor is the final step in the process of preparing your project for distribution.  </p>  <p>  \t<br style=\"\">  \t  Built for the beginner, this video based training starts off with the basics - reviewing terminology. You will quickly move to explore the Compressor interface, and how to use its basic features. Once you have explored the core features, you will move on to creating workflows for audio and video - from AIFF to MP3, H.264, MPEG1, 2 and 4, as well as exporting for Quicktime. You will learn how to create Droplets, and manage distributed processing for faster compression. Finally you will learn some advanced features of Compressor 4 - working with the command line, and setting up a web server to do HTTP live streaming.<br style=\"\">  \t<br style=\"\">  \t  Once you have completed your training using this instructional video course, you will be fully confident in your ability to compress and encode your projects in a variety of manners, for a variety of distribution methods! This video course comes complete with working files from the author, to allow you to duplicate the instructions as you follow along in the training.  </p>", 
    "end_date": null, 
    "title": "Apple Compressor Made Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226520_4b65_7.jpg", 
    "course_url": "https://www.udemy.com/apple-compressor-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T18:43:21Z"
}