{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>This course is one of the Top10 winners of the Black Friday Launch Challenge!</strong><strong></strong></p><p>You might have experienced a 'bad gift' situation in the past, not a pleasant moment. With this course you will learn how to avoid embarrassing gifts from the Apple Store. It will help you to find the perfect gift for someone who will remember your gift in a very good way.</p><p><strong>Here are other possible scenarios when this course will help you:</strong></p><ul><li>You are looking for a gift from the Apple Store but you are not familiar with the choices?</li><li>You are not sure what to buy for your dad or a friend and you are  running out of time? </li><li>This time you will actually visit cousin Fred and want to bring a gift that rocks?</li></ul><p>After this course you will be able to identify the perfect gift for the person that you have in mind. You will be able to avoid bad surprises and might even see some sparkle in the eyes of the recipient.</p><p><strong>The course consists of three main parts</strong></p><ol><li>The top5 gifts of the year 2015</li><li>The best choices for each Apple device category</li><li>The best accessories below $200</li></ol><p>You don't need any special knowledge, just the urge to go shopping for a gift. I included a downloadable list of recommended gifts below $200 which includes active links to the  product sites. You can ask questions about any of the Apple products in the discussion groups.</p><p><strong>In the course you will go through or can jump to the chapters</strong></p><ul><li>Top5 gifts of the Apple Store</li><li>iPod's</li><li>Apple TV</li><li>iPhone's</li><li>iPad's</li><li>Mac's</li><li>Accessories for all on them below $200 sorted by product type</li></ul><p>The course will take you about one hour, however you can jump right to the product you are interested in at any time.</p><p><br></p>", 
    "end_date": null, 
    "title": "Apple Store: How to pick the right gift", 
    "price": "20.00", 
    "instructors": "Markus Mueller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441950_9d80_3.jpg", 
    "course_url": "https://www.udemy.com/applestoregifts/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T15:02:16Z"
}