{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Olá!</p><p><strong>Parabéns por ter se interessado em dominar a linguagem SQL.</strong> O Objetivo é capacitá-lo a utilizar a linguagem SQL para manipulação de informações em bancos de dados relacionais. O curso é composto de 70 aulas e você poderá cursá-las em sua própria velocidade e está repleto de atividades a serem feitas por você.</p><p>É um curso ESSENCIALMENTE PRÁTICO e exigirá seu comprometimento na resolução dos exercícios. </p><p>Se você é aluno de sistemas de informação, análise de sistemas ou cursos técnicos na área de informática você precisa dominar a linguagem SQL. Meu compromisso com você é que se você fizer sua parte cumprindo os exercícios e atividades corretamente ao final desse treinamento você estará capacitado a utilizar com tranquilidade a linguagem SQL.</p><p>Nesse curso você terá <strong>mais de 7 horas de vídeos</strong> e resolução COMENTADA de mais de 200 exercícios. O curso é ESSENCIALMENTE PRÁTICO e voltado para o mais completo leigo em banco de dados.</p><p>Você será guiado através de uma abordagem de fácil entendimento e aprenderá sobre:</p><ul><li>Inserção, exclusão e alteração de dados</li><li>Triggers</li><li>Joins</li><li>Funções de banco</li><li>Criação e manipulação de tabelas</li><li>Uso de índices</li><li>Criação de views</li><li>E muito mais!</li></ul><p><br></p><p>Eu forneço pessoalmente um certificado de conclusão que pode ser validado no site! (Além do certificado que você já recebe da Udemy)</p>", 
    "end_date": null, 
    "title": "Aprenda SQL do Zero! ", 
    "price": "20.00", 
    "instructors": "Tiago Baciotti Moreira", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669012_eb3d_2.jpg", 
    "course_url": "https://www.udemy.com/aprenda-sql-do-zero/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T19:18:51Z"
}