{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Art Fundamentals: Digital Art Tools Essentials covers the core knowledge you need to know in order to utilise digital art software to create artwork digitally. Most digital art software share a number of core features, and using Adobe Photoshop as a base, this course will get you up to speed on the tools and the techniques of digital art creation. If you&#039;re new to digital art, and want to learn how to draw and paint in digital art software, this course is for you.<strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Master The Essentials Needed to Draw and Paint In Digital Art Software</strong></p><ul style=\"\"><li style=\"\">Understand both the hardware and software required to create digital art</li><li style=\"\">Learn the core features of digital art software, and how to use them</li><li style=\"\">Get to grips with the digital canvas, navigation, colour panels, tools and more</li><li style=\"\">Gain insight into brushes, layers, and basic layer modes</li></ul><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Get Started Today, and Start Drawing and Painting Digitally</strong></p><p style=\"\">If you&#039;ve never used digital art software before and you&#039;d love to learn, we&#039;d love to teach you. Getting to grips with art software and the digital art process is easier than you think, and when you&#039;re done, you should be able to approach most modern digital art packages with confidence.</p><p style=\"\">Many of the features of art software are shared, such as brushes, selections, layers, colour panels, swatches, and much more. In this easy to follow course, we go step-by-step into the digital process - from what hardware tools you&#039;ll need, to creating a digital canvas and using brushes, layers and more to draw and paint.</p><p style=\"\">Let&#039;s get started!</p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Art Fundamentals: Digital Art Tools Essentials", 
    "price": "50.00", 
    "instructors": "Scott Harris", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469668_164c_2.jpg", 
    "course_url": "https://www.udemy.com/digitalarttools/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T07:02:41Z"
}