{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>What Will You Learn in the Artist Management OnLine Course?</p><p>In this course you will learn how a successful manager answers and then deals with these issues every day:</p><ul><li>Who are the decision makers in the music industry?</li><li>What are the key points to negotiate in an artist management contract?</li><li>How will a business manager support an artist’s career?</li><li>How does a manager earn their money?</li><li>What are the negotiating points in a record label contract?</li><li>How do I interest a booking agent in my artist?</li><li>What do corporate sponsors look for when partnering with an artist?</li><li>What is negotiable in a 360° record label deal?</li><li>What are the fundamental issues in an artist rider?</li><li>What elements define an artist’s brand?</li><li>What issues should I look for when negotiating a live performance contract?</li><li>How will an attorney contribute to an artist’s team?</li></ul><p>Comprehensive Learning Experience</p><p>The elements of this Artist Management course are authored and presented by experienced professionals in the music industry that also have years of academic experience at the graduate and undergraduate level, teaching the music business.</p>Tested and Trusted<p>This original class material has been taught in graduate and undergraduate music business degree programs accredited by The National Association of Schools of Music. The course objectives and learning outcomes for this course were designed to comply with the Southern Association of Colleges and Schools guidelines.</p>", 
    "end_date": null, 
    "title": "Artist Management for the Music Business", 
    "price": "50.00", 
    "instructors": "Christopher Palmer", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688088_d24c_2.jpg", 
    "course_url": "https://www.udemy.com/artist-management-for-the-music-business/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T16:36:44Z"
}