{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Receiving a diagnosis of autism, whether for yourself or your child is often a shock. This then leads to a need to know more about the condition. Sometimes the information available can be a bit matter of fact and make it hard to understand exactly how it feels to be on the autistic spectrum.</p><p>This course is a combination of an introduction to autism and ASD and various essays that I have written over the years. I feel that the one supports the other. It gives a good overview of the subject whilst also providing information of specific experiences and challenges of those on the spectrum and giving a feel for the condition.</p><p>Completing this course will give you the facts and information to understand the subject along with an insight about how autism and Asperger Syndrome actually impact people's lives. In addition there are loads of references which will provide a good starting point for researching the subject further.</p><p>About me</p><p>My first knowledge of Asperger Syndrome was when I took my son for his 3 year check up. It was this introduction to the subject that lead me to understand the numerous problems that my family and I have gone through over the years. It has lead to an amazing amount of self understanding and enlightenment. Since then I have read extensively and completed a degree level course on the subject.</p>", 
    "end_date": null, 
    "title": "Asperger Syndrome, Autistic Spectrum Disorder from Inside", 
    "price": "20.00", 
    "instructors": "Caroline Collard", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445638_dd40_3.jpg", 
    "course_url": "https://www.udemy.com/asperger-syndrome-autistic-spectrum-disorder-from-inside/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T09:54:46Z"
}