{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<ul style=\"\"><li><strong style=\"\">Do you need a cost effective phone system for business?</strong></li><li><strong style=\"\">Are you tired of paying licensing cost to the proprietary phone system ?</strong></li><li><strong style=\"\">Do you want to expand your business and require phone system but legacy system don't allow you ? </strong></li><li><strong style=\"\">You are interested to learn asterisk but like to avoid command line and linux shell at the start ?</strong></li></ul><p>Elastix is the world most popular and widely adopted open source IP telephony software. The core VoIP communication is based on Asterisk - The most powerful IP telephony platform. This course is designed for the newbies, small &amp; medium business that like to use the IP telephony - PBX or even the solution providers that like to gear up for telephony services to the end users. </p><p>The course starts with initial telephony concepts and terms used in phone service industry. No prior technical knowledge about telecommunication required to take this course. </p><p>The course has project depicting the real world scenario. This helps the students to have activity based learning and can apply learned knowledge to the real world. The course clearly explained the phone system features with lab practice for configurations. </p><p>Proprietary systems invites a license fee for most Business-critical features and UC Features like mobility and third party integration. To avoid the expensive add-ons go the open source way.</p><p>Use a single system to manage multiple tools and platforms, thereby having “<strong style=\"\">greater employee productivity, reduced costs</strong><em style=\"\"> and a means to </em><strong style=\"\">improve customer engagement.</strong></p>", 
    "end_date": null, 
    "title": "Asterisk-Elastix VoIP - Learn to Build Phone System", 
    "price": "20.00", 
    "instructors": "Ben International", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/275132_926c_3.jpg", 
    "course_url": "https://www.udemy.com/elastix-ip-telephony-build-phone-system/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-05T10:31:04Z"
}