{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t          In this digital age, audio production has become a compulsory skill for anyone developing internet, entertainment and media content. In that sense, there are very good tools to accomplish this task. Audacity is a free, cross-platform software with all the audio functions you would need for most projects.  </p>  <p>  \t<strong>You can learn these functions in a fast and easy way with this course:</strong>  </p>  <ul>  \t<li>Record high quality audio files.</li>  \t<li>Trim, copy and repeat audio regions with confidence.</li>  \t<li>Apply professional effects: equalization, compression, reverb, echo, pitch shifting and many more!</li>  \t<li>Convert audio files from WAV and AIFF to FLAC, mp3, Ogg Vorbis and others.</li>  \t<li>Mix and render files and songs.</li>  \t<li>Remove clips and noises.</li>  </ul>  <p>  \t<strong>A complete and easy to follow course for audio editing and recording</strong>  </p>  <p>  \t    This course has been designed to be a fast and easy way to get the work done, with practical and \"to the point\" examples and explanations. You will learn, step by step and in short lessons, the tricks and tips that most audio professionals use. Forget about tons of tutorials with mixed information and out of order topics. This course was prepared by a lead professional Audio Engineering certified instructor, with more that 10 years of teaching and program development experience. His former students now work for companies like: Sony Music, Televisa and there are even Grammy Award winners, so teaching quality is warrantied. </p><p><strong>Workflow</strong><br></p><p>The course is based on common problems and how to solve them: how record audio, how equalize, how get rid of noise, how convert a file, etc. You will get the explanations and see how to do it step by step in Audacity. If you have further questions about a topic, you can ask the instructor anytime in the discussions area.</p><p>This is the ultimate course to learn all the basics you need to record and edit digital audio using free tools, all in one complete course!</p>", 
    "end_date": null, 
    "title": "Audacity recording and editing skills for media producers", 
    "price": "20.00", 
    "instructors": "Marco Galvan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430472_ead7_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-record-and-edit-audio-easily-with-audacity/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T23:57:39Z"
}