{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>หากคุณต้องการ<strong>บันทึกและตัดต่อเสียงด้วยตนเอง</strong> เช่น ต้องการบันทึกเสียงประกอบสไลด์ PowerPoint, ดูคลิป Youtube ต้องการเสียงเฉพาะบางช่วงเท่านั้น, ต้องการทำหนังสือเสียง, ต้องการตัดเพลงนำไปใส่สมาร์ทโฟน, หรือต้องการตัดเสียงจากวีดีโอ เป็นต้น แต่ไม่ทราบว่าจะเริ่มต้นอย่างไรดี คุณมาถูกที่แล้วครับ ด้วยคอร์สนี้ จะช่วยให้คุณบันทึกและตัดต่อเสียงได้ด้วยตัวของคุณเองอย่างง่าย ๆ </p><p>คอร์ส “<strong>Audacity สำหรับผู้เริ่มต้น</strong>” เป็นคอร์สที่จะสอนให้คุณบันทึกและตัดต่อเสียงด้วยโปรแกรม Audacity (โปรแกรมฟรี ไม่ต้องกังวลเรื่องลิขสิทธิ์) เนื้อหาที่สอนคือ</p><ul><li><strong>เริ่มต้น</strong> ส่วนนี้ จะเป็นการทำความรู้จักโปรแกรมว่า Audacity คืออะไร</li><li><strong>การติดตั้งโปรแกรม</strong> อธิบายการติดตั้งโปรแกรมและการติดตั้ง Library มีทั้งการติดตั้งแบบอัตโนมัติและการติดตั้งแบบเลือกไฟล์เอง</li><li><strong>เมนูและเครื่องมือต่าง ๆ</strong> ทำความรู้จักเครื่องมือต่าง ๆ ของโปรแกรมว่ามีอะไรบ้าง รวมทั้งตัวอย่างการใช้งานของเครื่องมือแต่ละอย่าง เมื่อผู้เรียนเข้าใจเครื่องมือต่าง ๆ แล้ว ก็จะทำให้การตัดต่อเสียง เป็นไปด้วยความรวดเร็วและตอบโจทย์ที่เราต้องการได้</li><li><strong>การนำเข้าไฟล์เพื่อตัดต่อ</strong> อธิบายการนำเข้าไฟล์เพื่อมาตัดต่อเสียงทั้งไฟล์เสียงและไฟล์วีดีโอ</li><li><strong>การบันทึกและการฟังเสียง</strong> อธิบายการบันทึกเสียง ไม่ว่าจะเป็นจากไมโครโฟนหรือการบันทึกเสียงจากคอมพิวเตอร์ที่เราได้ยิน รวมทั้งการตั้งเวลาบันทึกเสียง</li><li><strong>การบันทึกโครงการ</strong> เป็นการบันทึกงานที่ตัดต่อค้างไว้เป็นไฟล์ เพื่อนำกลับมาตัดต่อในภายหลังอีก</li><li><strong>การตัดต่อเบื้องต้น</strong> อธิบายถึงการตัดต่อเสียงในขั้นตอนต่าง ๆ เช่น ทำความรู้จาก Timeline และ Track การเลือกข้อมูลเสียง การตัด การลบเสียง จนถึงการเร่งเสียงให้ดังขึ้น</li><li><strong>การใช้ Effect</strong>  เช่น การลดเสียงรบกวน การทำ Echo การปรับเสียงทุ้มแหลม เป็นต้น</li><li><strong>การจัดการแทร็ค</strong> การใช้ Mute ทำให้เสียงแทร็คนั้น ๆ เสียบ การทำให้แทร็คนั้นดังเพียงแทร็คเดียวเท่านั้น</li><li><strong>การส่งออกเสียง</strong> เป็นการบันทึกเสียงที่ตัดต่อลงเป็นไฟล์ ส่งออกเฉพาะส่วนที่เลือกเอาไว้ หรือ จะบันทึกเสียงจากแทร็ค เป็นไฟล์แยกกันก็ได้</li></ul><br>คอร์สนี้พัฒนาจากประสบการณ์การใช้ Audacity มาหลายปี เรียบเรียงและอธิบายสั้น  ๆ เพื่อให้สามารถทำความเข้าใจและทำตามได้ง่าย แม้ผู้เรียนจะไม่เคยใช้โปรแกรมนี้มาก่อน", 
    "end_date": null, 
    "title": "Audacity สำหรับผู้เริ่มต้น", 
    "price": "25.00", 
    "instructors": "Samarn Sumrith", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676428_b3fb_2.jpg", 
    "course_url": "https://www.udemy.com/audacity-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T13:36:00Z"
}