{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t                        Using a compressor and understanding compression is one of the hardest things for entry audio engineers to grasp. With so many different compressors and compressors types its not hard to see why people struggle with compression. Compression is critical to getting good mixes in music today, and without a proper knowledge of compressors and how to use them your mixes can easily turn thin and lifeless. Compressors can add color to tracks, crush drums, smooth out vocals, and add weight to a bass. Compressors can add to an track, or it can take away. For example, with a compressor you add punch to a kick drum, you can take the punch away. It all depends on how you use it. And there are many, many ways to use a compressor. Using compression properly will help improve your mixes by keeping dynamics controlled. My Basics of Compression course will teach you everything you need to know to get started with compressors. Attack, release, threshold, ratio, I explain them all. I also will go over advanced controls such as the mix knob, knee, and side chain that you might see on some compressors. I also answer some frequently asked questioned about compression.  </p>  <p>  \t          So if your just getting into engineering and you are struggling to understand compression this course is for you. My teaching method and analogies should give you  confidence you need to use compressors.  </p>  <p>  \t                         For more on compression including compressor types, kinds, examples, uses, using classic compressors, and more please subscribe to my audio engineering: All About Compression course (Coming Soon!). By sharing some of my knowledge of 15 plus years in audio this course will teach you the following:  </p>  <ul>  \t<li>what is a compressor</li>  \t<li>how is compression used</li>  \t<li>controls on a compressor</li>  \t<li>how use the controls on a comrpessor</li>  \t<li>the difference between compressors and limiters</li>  \t<li>analogy for understanding compression  </li>  \t<li>examples of how compression controls work</li>  </ul>", 
    "end_date": null, 
    "title": "audio engineering: Basics of Compression", 
    "price": "40.00", 
    "instructors": "Christopher \"Czar\" Smith", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317034_fcbe_3.jpg", 
    "course_url": "https://www.udemy.com/audio-engineering-basics-of-compression/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-10T06:02:18Z"
}