{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<span>Ever wondered how your audio signal gets from the mic through your DAW and out of your speakers? This course will go over basic and advanced signal flow of audio signals.  After this course you should be able to understand what signal flow is, how it works, and why it is important to know as an audio engineer. You will be able to understand basic as well as complex signal flow for your recording signal chain. You will also learn basic and more complex signal routing in your DAW. Once completing this course you will be able set up routing for your effects, properly use busses and aux tracks, and learn some techniques for setting up your session through busses in the daw. This will be a powerpoint presentation. This course will be 30 minutes long. This course is for anyone wanting to learn about the path their audio takes to get into their recording software and back out to your speakers. My teaching method is simple and straightforward to make sure everyone can understand and follow along. This course is designed for beginners who are just getting into audio engineering. Signal flow is one of the first things aspiring audio engineers need to learn. Its understanding will not only help you in the home studio, but it will help in the recording studio as well. Everything from recording to troubleshooting is based around signal flow. Once you have a grasp on signal flow you will be able to go from setting up your audio interface to setting up recording signal chains with compressors and eq&#039;s. The better you understand signal flow then the more you will able to do with signal routing. This course will go over the following and more:</span>  </p>  <ul>  \t<li>What is signal flow</li>  \t<li>Why is signal flow important</li>  \t<li>Inputs and outputs</li>  \t<li>The two different types of signal flow</li>  \t<li>Patch bays</li>  </ul>", 
    "end_date": null, 
    "title": "Audio Engineering: Signal Flow", 
    "price": 0, 
    "instructors": "Christopher \"Czar\" Smith", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305926_5705_3.jpg", 
    "course_url": "https://www.udemy.com/audio-engineering-101-signal-flow/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-23T07:06:36Z"
}