{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>EQ is one of the two most commonly used signal processing tools audio engineers use everyday, the other being a compressor. EQ is very powerful because allows to alter the frequency of a track, instrument, or vocal. Anyone interested in learning more about EQ should subscribe to this course. In this course I start with learning frequencies. Its incredible how some engineers can pinpoint problem frequencies. I will show my approach for learning frequencies when you hear them. After a lot of practice you will be grabbing an EQ and adjusting problem frequencies with confidence.</p><p>You will also learn the difference in parametric and semi parametric EQ's. Also I go over fixed frequency eq's. Knowing the difference between these will help you know which ones to reach for and when. EQ curves can take on many different settings with its different shapes of curves. In this course I go over the different settings listed below.<br></p><ul><ul><li>High pass filter/ Low cut</li><li>Low pass filter/ High cut</li><li>peaking</li><li>Low shelf</li><li>High shelf</li><li>Band pass</li></ul></ul><p>The way an EQ boost and cuts can have unique shape of its own. In this course I go over the following curve types.</p><ul><ul><li>Asymmetrical</li><li>Symmetrical</li><li>Proportional</li><li>Tilt</li><li>Baxandall</li></ul></ul><p>I also cover the different EQ types such as a dynamic EQ. I will go over how to use a Pultec style EQ. This the most awkward EQ's you will come across because of its unique design and labeling. After the learning how to use a pultec eq and hearing what it can do its no surprise why this type of EQ in heavily emulated as plugins and recreated as hardware. In course I will go over my approach for Eq'ing a vocal. Vocals can one of the hardest things to eq because every vocal is different. Prepare to spend more than an hour with me as I tech you all about EQ.</p>", 
    "end_date": null, 
    "title": "Audio Engineering: All About EQ", 
    "price": "40.00", 
    "instructors": "Christopher \"Czar\" Smith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332408_1abe.jpg", 
    "course_url": "https://www.udemy.com/audio-engineering-all-about-eq/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T06:38:12Z"
}