{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t    Ready to take your compression skills to the next level? In my All About Compression course I move on to more advanced information about compression. I will go over advanced compressor controls such as mix, knee, and side chain. If you&#039;ve taken my basics of compression course then consider this course the next step to continue learning about compression. In All About Compression I will cover the different types of compressors, different kinds of compressors, uses for different type of compressors, classic compressors and how to use them, and much more. I also go over different compressor techniques and examples of use. This course will expand your capabilities with a compressor and introduce you to new ways of how to use them. I&#039;ve been engineering for over 15 years now, and in that time I&#039;ve gotten to use a lot of different compressors. And I&#039;ve gotten to know some compressors very well. The more you use  and learn about compressors the more the confident you will become in using them. And this course should help boost that confidence. Because all compressors are different it can be difficult to find the right compressor the job. I will go over my approach to choosing a compressor for a track. Anyone taking this course should have a DAW (Digital Audio Workstation) with a compressor plugin so they can go over and practice these techniques. The DAW being used in this course Presonus Studio One. However the DAW you use is not important, as all DAW&#039;s will come with a compressor. By sharing some of my knowledge of 15 plus years in audio this course will teach you the following:  </p>  <ul>  \t<li>Different compressor types</li>  \t<li>compression techniques</li>  \t<li>Multi band compression</li>  \t<li>De-essing and how to set a de-esser</li>  \t<li>choosing the right compressor </li>  \t<li>parallel compression</li>  \t<li>serial compression</li>  \t<li>side chain compression</li>  \t<li>using automation with compression</li>  \t<li>how to set a compressor for general compression</li>  \t<li>how to set a compressor for mix bus compression</li>  \t<li>classic comperssors and how to use them</li>  </ul>", 
    "end_date": null, 
    "title": "audio engineering: All About Compression", 
    "price": "50.00", 
    "instructors": "Christopher \"Czar\" Smith", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317936_557e_2.jpg", 
    "course_url": "https://www.udemy.com/audio-engineering-all-about-compression/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-11T20:09:36Z"
}