{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Over 1000 Students Learning Together &amp; See What They Feel -</strong></p>  <p style=\"\">  \t<strong style=\"\">Lokman Liton</strong> - &quot;This is really a very good course for IT professionals and non-tech person... If you don&#039;t have any scripting experience, you can start this Tutorial without any fear. &quot;  </p>  <p style=\"\">  \t  -----------------------------------  </p>  <p style=\"\">  \t<strong style=\"\">Jens H.</strong> - &quot;<span style=\"\">This course will save you a lot of time on your computer. </span>Very well presented course, you can use this course to automate many things...&quot;  </p>  <p style=\"\">  \t  -----------------------------------  </p>  <p style=\"\">  \t<strong style=\"\">RAGHURAM BACHU </strong>- &quot;<span style=\"\">Best course ever one could have on automation... </span>Actually whatever I describe can&#039;t reveal versatility of this course...&quot;  </p>  <p style=\"\">  \t  -----------------------------------  </p>  <p style=\"\">  \t<strong style=\"\">MG Mason</strong> - &quot;I got my first script working in just a few mins. Mohit does a good job showing examples and the course is well thought out. Thanks!&quot;  </p>  <p style=\"\">  \t  -----------------------------------  </p>  <p style=\"\">  \t<strong style=\"\">Bogdan Cpminndtr </strong>- &quot;I am a newbie in programming but for me this may be life saving because I have celebral palsy and is very important for me to automate my work because I use my hands with difficulty. Thank you Mohit Aggarwal !&quot;  </p>  <p style=\"\">  \t  -----------------------------------  </p>  <p style=\"\">  \t            Do you know you can automate almost all your boring and mundane computer tasks with computer automation? <strong style=\"\">Be it your school homework, a video making business, online affiliate marketing or just plain internet browsing</strong>.  </p><p style=\"\">Have you ever coded anything? No? Well start with automation! It&#039;s so easy that you can start right away, I promise. And, I am sure you will love it. Your first program will be of just one line!</p><p style=\"\">Computer Automation is something by which you can outsource most of your computer work and increase your productivity 10X. Or your money back! The syntax and programming required for this coding is so straightforward, that in no time you can make your job easier. Plus, you can actually see what you have coded! <strong style=\"\">There is absolutely nothing that you need to know before taking this course. All you need is </strong><strong style=\"\">a computer with Windows installed</strong>. <strong style=\"\">Even with zero coding experience,</strong><strong style=\"\">You can get your first script running in a few minutes, I guarantee! </strong></p>  <p style=\"\">  \t          This software called AutoIT is like a robot which can easily replicate the human behavior and can help you a lot with your computer-life, no matter what you do on your computer.</p>  <p style=\"\">  \t          This is what you can do after doing this course:  </p><p style=\"\"><strong style=\"\">- You can outsource your job (if you use a computer) and use your time much more efficiently</strong></p><p style=\"\">- You can get your own personal assistant to do all the legwork for you</p>  <p style=\"\">- You can make your own bots to place anywhere on Internet or on your computer</p>  <p style=\"\">- You will appreciate the <strong style=\"\">visual control of coding, </strong>even if you are starting scratch!</p><p style=\"\">If you feel the course is not relevant to you or you are not satisfied with the content or you have difficulty catching up or in any way, you are not 100% satisfied with the course then I personally <strong style=\"\">guarantee you the full-money back for first 30 days! No Questions Asked! </strong></p>  <p style=\"\">But I am sure you will love it, like other students have. So, <strong style=\"\">Enroll now</strong> and check yourself!</p>", 
    "end_date": null, 
    "title": "Automate your computer and boost your productivity 10X", 
    "price": "20.00", 
    "instructors": "Mohit Aggarwal", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305344_40bf_5.jpg", 
    "course_url": "https://www.udemy.com/automateit/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-22T12:08:37Z"
}