{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Whether you are a professional creative graphic designer, animation specialist or a novice learner Academy Class got it all to gear you up to use Maya like you know it by heart. Maya training course introduces students to the industry-standard animation software.</p><p>Maya training courses by <strong style=\"\">Adrian Albert </strong>will teach you the fundamentals of 3D designing and animations. <strong style=\"\"><em style=\"\">Students will get to learn the Maya basics of Skinning, Lighting and Rendering, and Utility Nodes, Texturing and Texture Mapping, Adobe Photoshop Basics, Tiling and Layering Textures, Block Texturing a Non-Organic Object and Texture Distressing.</em></strong></p><p>Furthermore, students with this Maya training course will also learn advanced<strong style=\"\"><em style=\"\"> Shading </em></strong>networks with<strong style=\"\"><em style=\"\"> F</em></strong><em style=\"\"><strong style=\"\">ile Textures, Mental Ray Shaders, Maya Hypershade, Graph Editor and Key Framing, Deformer and Path Animation, Clusters, Blend-shapes and connections, Expressions and Rigging, Lamp Animations.</strong></em><br style=\"\">The Maya training courses by <strong style=\"\">Adrian Albert </strong>will also entail the<strong style=\"\"> Art of Lighting, Gobos and Cookies, Daylight, Night and Artificial Lighting, Image Based Lighting, Photographic Lighting, Lighting and Shadows, Ray Tracing and Depth of Field, Final Gather and Image Based Lighting, Render Layers and Compositing and Photon Mapping and Caustics. Along with that you will also learn<span class=\"caps\">NURBS</span> Coliseum, Sandal and Kettle.</strong></p><p>I am very pleased to teach you some basics, and some ADVANCED techniques , in order to see great results from you , and to be more than prepared for your graphic designer professional life. Thank you for choosing this course! </p>", 
    "end_date": null, 
    "title": "Autodesk MAYA (for beginners) ", 
    "price": "40.00", 
    "instructors": "Apostu Adrian Albert, Adam Levis", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466298_8118.jpg", 
    "course_url": "https://www.udemy.com/autodesk-maya-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T00:14:25Z"
}