{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Mark's first 3 massage courses have  received rave reviews:</strong></p>\n\n<p><strong><em>\"This is one of the best massage courses i have ever taken!\"</em></strong><strong><em>\"I had gotten to a point where I wasn't sure if this was a career I really wanted to continue but now I have a renewed sense of passion!\"</em></strong></p>\n\n\n\n<p><strong></strong><strong><em>\"Two Giant Thumbs Way Up!\"</em></strong></p>\n\n\n\n<p><strong></strong><strong><em>\"Excellent and expert instruction. Beautiful videos. These methods are far superior to what we were taught in aesthetic and spa training classes.\"</em></strong></p>\n\n\n\n\n\n<p>And now here is his 4th massage course in the series-The Award Winning Isla Verde Spa Deep Tissue and Advanced Techniques Massage Course! </p>\n\n\n\n<p>Mark Perren-Jones guides you step by step to show you from the basics to advanced how to give your massage clients an incredible Deep Tissue massage experience. You will learn not only techniques that you can use for your deep tissue massage but also will be able to incorporate these massage techniques into any of your other massages such as your relaxation or hot stones massage sequences.</p>\n\n\n\n<p>Mark shows you not only what his 25 years of experience has helped him, but also he shows you the ways to avoid the mistakes that he has made along the way. When it comes to a massage clinic or spa, your best asset is your massage.</p>\n\n\n\n<p>Without an incredible massage sequence, it will be very difficult to have a thriving practice. This course will give you the skills set to give your clients an amazing massage experience.</p>\n\n\n\n<p>In this course you are going to learn:</p>\n\n\n\n<ul><li><strong>Acupressure Techniques</strong></li><li><strong>What equipment is needed</strong></li><li><strong>Effective Spa/Clinic Marketing Strategies to making a successful business</strong></li><li><strong>To Correct Body Alignment and Postural Problems</strong></li><li><strong>To Set up the right atmosphere for your Client</strong></li><li><strong>The Importance of First Impressions</strong></li><li><strong>How to use your forearm Techniques correctly</strong></li><li><strong>Plus so much more..</strong></li></ul>\n\n\n\n<p>The most important aspect to any spa or massage clinic is the quality of the massages, because without the ability to deliver great massages most therapists will not succeed and be taken over by the competition in this highly competitive industry. You will be shown not only our secrets to giving incredible massages to your clients, but also know how to use your body correctly and avoid the pitfalls that many therapists fall into. You will be taught advanced techniques, the correct ways to apply pressure, how to correctly use acupressure and we also share with you other aspects of the spa business that have helped our business grow from just one person to needing 4 massage therapists in under 2 years!</p>", 
    "end_date": null, 
    "title": "Award Winning Isla Verde Spa Sports Massage Masterclass", 
    "price": "20.00", 
    "instructors": "Mark Perren-Jones", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299618_4972.jpg", 
    "course_url": "https://www.udemy.com/award-winning-isla-verde-spa-deep-tissueadvanced-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T13:29:35Z"
}