{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course is about Amazon Web Service's (AWS) CodeDeploy service, including how to set up your Amazon account to enable it, how to build CodeDeploy revisions, troubleshooting, and advanced deployment techniques. </p><p>This course includes reference materials and code necessary to jumpstart your use of CodeDeploy, including IAM roles, CloudFormation templates, example revisions, and best practices for designing your implementation. The course is primarily in video lecture format, with three hands-on projects to accelerate your learning and prepare you for using CodeDeploy in your environments. </p><p>The course will take you roughly one week to accomplish, depending on how much time you can dedicate to the course each day. The course is structured in two parts, lecture and labs. We will review all terminology, logical components/concepts, and basic examples in the first three sections. The last three sections will be hands on labs, covering a simple end-to-end CodeDeploy deployments for Linux and Windows servers, troubleshooting, and an advanced zero-downtime CodeDeploy deployment.</p><p>If you're in a DevOps role, a developer hosting their app in AWS, or a System Administrator managing instances in AWS, you need to take this course to take advantage of this amazing service. CodeDeploy experience can be a differentiator when looking for a new role and make you invaluable in your current position. It can automate your deployments and patching processes, allowing you to focus your time and efforts on more value-add activities. CodeDeploy provides the simple, robust orchestration you need for automating deployments to your instances, and this course provides the quickest path to leveraging CodeDeploy.</p><p>I look forward to you joining my course.</p>", 
    "end_date": null, 
    "title": "AWS CodeDeploy", 
    "price": "35.00", 
    "instructors": "Alex Glover, Ryan Kroonenburg, Ant Stanley", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614962_8a7c_2.jpg", 
    "course_url": "https://www.udemy.com/aws-codedeploy/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T16:29:45Z"
}