{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is designed for the person interested in becoming an investigator, and the new to intermediate experienced investigators.  All general investigations use these basic concepts - making this an excellent beginner course.  In the course will be taught how to the student will also be able to improve and increase their results of successfully closed cases.  The goal is to introduce strong fundamentals to understand and apply the basic investigative concepts for skip tracing, background and asset &amp; liabilities investigations.</p><ul style=\"\"><li>Learn from one of the nation&#039;s leading experts on &quot;Finding People, Finding Out About Them&quot; with over 25 years of experience.</li><li>More than two hours of how-to and real examples - like your own one-on-one personal mentorship!</li><li>    Better find and use the resources available to investigators and manage their cases more effectively. Results of successfully closed cases should improve and increase. </li><li>    Private Investigators (interested, new and veteran) </li><li>    Understand and apply the basic investigative concepts for skip tracing, background and asset &amp; liabilities investigations. </li><li>Be prepared to improve and hone your skills. More than the book and more than a conference or webinar!</li></ul>", 
    "end_date": null, 
    "title": "Basics of Skip Tracing, Backgrounds & Assets Investigations", 
    "price": "50.00", 
    "instructors": "Associates In Forensic Investigations Beers", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474474_83c7_3.jpg", 
    "course_url": "https://www.udemy.com/skip-tracing-backgrounds-assets-investigations-101/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T00:50:06Z"
}