{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  The specific purpose of this course is to provide you in easy-to-learn chunks the information you need to become a competent map-and-compass land navigator. You&#039;ll find useful information on path finding, compass use, and map reading.</p><p>Lectures include how to use any lengthy terrain feature as a &quot;catching&quot; feature or a &quot;handrail.&quot; Plus, you&#039;ll see how to use a compass (including a military lensatic compass and protractor), including how to work with magnetic declination. You&#039;ll see why &quot;aiming off&quot; makes such good sense. And you&#039;ll see why dividing your trip into numerous legs, each ending at a &quot;checkpoint&quot; can help you find your may across great stretches of terrain. </p><p>We&#039;ll go over the time-honored navigation practice of dead reckoning, and how to use it under conditions of limited visibility, such as at night, or when you&#039;re fogged in or &quot;greened in&quot; by thick foliage. </p><p>We&#039;ll also cover USGS topographical maps, including how to read contour lines, measuring distance on the map, and interpreting depictions of terrain features. </p><p>You might be asking yourself &quot;Why do I need to know all this stuff if I have a GPS?&quot; And the answer is &quot;While GPSes are great, they should supplement, and not replace good low-tech backup navigation skills based on the proper use of map and compass.&quot;</p>  <p>  \t  Besides the course lectures, students will receive in the form of downloadable PDF files, two books I&#039;ve written on land navigation. These books supplement the Udemy lectures. Total course completion time is about 8 hours.  </p>  <p>  \t  Those needing land navigation skills include:  </p>  <p>  \t  ·hikers, hunters, outdoor photographers  </p>  <p>  \t  ·military personnel  </p>  <p>  \t  ·orienteers.  </p>  <p>  \t  ·search and rescue personnel  </p>  <p>  \t  ·wilderness medical personnel  </p>  <p>  \t  ·anybody else who wants to learn  </p>", 
    "end_date": null, 
    "title": "Basic Land Navigation: How to Find Your Way and Not Get Lost", 
    "price": "20.00", 
    "instructors": "Reid Tillery", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403650_5e0c_3.jpg", 
    "course_url": "https://www.udemy.com/basic-land-navigation/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T16:22:22Z"
}