{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course covers what you need to know to become a Dental Assistant and start your earnings journey up to and above <strong style=\"\">$54,000 per year.</strong></p><p>If you have trouble deciding on a career, looking for a change, a parent or single parent and need a flexible job with excellent earning potential look no further.</p><p>There are <strong style=\"\">no formal qualification requirements</strong> for starting as a dental trainee in some states and in the states where formal training is required; this course will show you the best way of obtaining it.</p><p><strong style=\"\">Formal training</strong>can take as little as<span class=\"apple-converted-space\"><strong style=\"\"> </strong></span><strong style=\"\">9 months</strong><span class=\"apple-converted-space\"><strong style=\"\"> </strong></span>to complete.</p><p><strong style=\"\">You can be certified and earning in as little as 9 months.</strong></p><p>At the end of this course, your Udemy Certificate of completion will be available for download.</p><p>You will learn about the two main ways to start a Dental Assistant career, as well as the advantages and disadvantages of each, in order to help you decide on which one is your best initial approach.</p><p>We will also cover other potential careers which you can move on to once experienced and certified.</p><p>Information about; websites, career progression, important addresses and more will be provided.</p><p>In the <strong style=\"\">USA</strong> Dental Assistants salaries, range from $22,000 - to $50,000+ per year.</p><p>Enroll now for this course and get started on the journey to becoming a dental assistant.</p><p>At Udemy, we offer a <strong style=\"\">30-day</strong><strong style=\"\"> money-back guarantee</strong><span class=\"apple-converted-space\">, </span>so you have nothing to lose. Dental Assisting can change your life!</p><p><strong style=\"\">Don&#039;t delay, enroll today!</strong></p>", 
    "end_date": null, 
    "title": "Become a Dental Assistant: Have a Mobile and Flexible Career", 
    "price": 0, 
    "instructors": "Natasha McDowall", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441230_9d8b_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-dental-assistant-and-earn-up-to-54k-find-out-how/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T14:49:55Z"
}