{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t         Before 6 months i publish a book about Fiverr and the steps that needs for earning money.A lot of people who read my book managed to earn at least 1000 $ a month by investing 1 hour a day from home.I’m not one of those guys who sells theory. I don’t teach you what I think should work. I teach you what I know works and what worked for me over and over again! In this course i show you all the new tactics and steps that you will need for extra online income.The goal of this course is only one : To become a Level Two Seller on Fiverr !There are people that have been using Fiverr for years and have just now reached their level one status.You will be able with this course to reach level two in 3 months.There are people that have turned Fiverr into a full time job, have bought homes or cars, and are true Fiverr Rock Stars.Using my own Fiverr experience I can give you a great middle of the road example. I find Fiverr 2 years ago (the first year I was only lurking and learning so we’ll say 12 solid months of actual work). In that time I have made it to Top Rated status with 2980 completed orders and have earned over $17,000 dollars. Not bad at all.I will tell you all the secrets that used from the Top Rated Sellers.You will see at the end of this course how easy will be, you need only to follow my steps.Also i will show you the free sources and tools that used from top rated sellers to deliver some of the most sellable gigs on Fiverr.Believe me you dont want to miss this opportunity to learn the secrets.This course cost 149 $ and will bring you at least 1000 $ a month.I hope that i see you inside.  </p>", 
    "end_date": null, 
    "title": "Become a Level Two Seller on Fiverr 2015 Secrets !", 
    "price": "20.00", 
    "instructors": "Nikolaos Mplantzas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/90942_190a_10.jpg", 
    "course_url": "https://www.udemy.com/fiverr-become-a-level-two-seller/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-11T09:15:55Z"
}