{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tHave you ever wanted to spin the wheel, buy a vowel or ask Pat if there is a &quot;T&quot;? Many people—including devout fans—think that it would be impossible to get on the Wheel of Fortune game show, <strong style=\"\">but that&#039;s not the case</strong>. While there is certainly a little bit of luck, you can maximize your chances by <strong style=\"\">preparing for audition day.</strong>  </p>  <p style=\"\">  \t                  That&#039;s what this course is all about. It&#039;s designed to prepare you not only for the audition process, but also for the when the big day arrives. After all, walking into the audition with an understanding on what the contestant team is looking for <strong style=\"\">can immediately improve your odds of being selected</strong>.  </p>  <p style=\"\">  \t              I was one of those people that <em style=\"\">didn&#039;t adequately prepare</em> for my audition. And by a fluke of luck, I was selected to be a contestant on Wheel of Fortune where I was second place, <strong style=\"\">won $7,250</strong> which included a trip to Prague (and let me tell you Prague was <em style=\"\">awesome</em>).  </p>  <p style=\"\">  \t              But better than all the cash and prizes was the chance to fulfill a dream of being on a game show—in fact, my resumé line item of &quot;Wheel of Fortune Contestant&quot; is a fantastic ice breaker when interviewing for a job.  </p>  <p style=\"\">  \t              While my journey may be a little different than yours (I tried out as a college student for Big 12 week but was selected to appear as a contestant on a regular show), my experience allows me to have an insight into what the Wheel of Fortune contestant team looks for in the audition.  </p>  <p style=\"\">  \t              By the end of this course, you&#039;ll know all about:  </p>  <ul style=\"\">  \t<li style=\"\">How to prepare for the audition process</li>  \t<li style=\"\">Ways to standout for the contestant team during the audition</li>  \t<li style=\"\">The sequence of events from auditioning to becoming a contestant</li>  \t<li style=\"\">Strategies for letter selection</li>  \t<li style=\"\">What it&#039;s like appearing on the Big Show</li>  </ul>  <p style=\"\">  \t                      There&#039;s a ton of useful information in this course, and  in an hour and a half from now you can have all the tools to dominate  your audition.  </p>  <p style=\"\">  \t                      Not convinced? Udemy offers a money back guarantee, so  you can get your cash back if you aren’t satisfied. Sounds like a can’t  lose deal to me. Enroll in this course now to gain the confidence you  need to become the next contestant on Wheel of Fortune.  </p>  <p style=\"\">  \t                      Garrett Heath, Wheel of Fortune Contestant, winner of $7,250 including a trip to Prague  </p>", 
    "end_date": null, 
    "title": "Become a Wheel of Fortune Contestant (and Win Big)", 
    "price": "20.00", 
    "instructors": "Garrett Heath", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312612_db8b_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-contestant-and-win-big-on-wheel-of-fortune/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T02:45:47Z"
}