{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>*** Course last updated on 25th June 2016 ***</strong></p>\n\n<p>This course is designed to take your basic VBA skills and quickly move you into the intermediate category.  You can probably already put together “most of the way there” programs.  These will usually have some form of problem (even if you don’t realise it).  They might have calculation errors, be a bit slow or break under specific use cases.  This course will teach you to track down and fix these problems … and then how to restructure your code to prevent such problems and handle run time errors in an effective way.    </p><p>A VBA Troubleshooter is a valuable team member.  You will quickly find people coming to you for help and advice.  Your CV will look much better and it will put in a great position to negotiate a pay rise or even use this as the first step in a new career. <br></p><p><br></p><p><strong>Some assumptions about you</strong><br></p><p>Let’s agree that you are highly motivated, want to learn new skills and want to get ahead in life.  Maybe you want to earn more in your current role, maybe you want to enhance your CV or maybe you want to switch careers.  Let’s also agree you are willing to put in the time and effort to learn new skills … yet want to do so in an efficient and effective way.  Finally, let’s agree you believe in getting what you pay for.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Still with me? Keep reading and <strong><em>see exactly why so many students have already chosen to enrol on this course</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>How this course is different</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>There are lots of great VBA courses both on the internet and on Udemy.  Many however try to cover <em>a bit of everything related to VBA</em>.  Before building my own course I looked at what was available and made sure I was providing something new and different.  Instead of teaching “a little bit of everything” I listened to my existing students, took the most useful VBA coding skill set and turned it into a full blown course all of its own.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I don’t aim for the <em>complete</em> beginner (you won’t learn about the basics such recording macros, CELL objects and RANGE objects).  Instead I assume you have some VBA knowledge and want to quickly improve on this by learning some higher level skills.  If you are a complete beginner however, just ask me for a list of resources to get you to the starting point.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Rather than the usual passive “tell you how to do stuff” method of delivery, my teaching style is very much active – if you are lazy you will still get something out of it … but nowhere near as much as if you put in a reasonable amount of work to do the quizzes and exercises. \n\n  In addition to all of this my goal is for the course to become a living entity with a “community of students”.  I have a long list of additional material, techniques and examples I plan to add.  I want it to become a reference point for future where you can dip in and out as you encounter new problems,  where you can request a specific topic to be covered and where you can provide the feedback needed to fine tune the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Who will benefit most from the course? </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Almost everyone will gain something but some will gain more than others:      </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Do you get a nice warm fuzzy feeling from those “Aha!!” moments when you understand something new?</li><li>Are you willing to put in some time and effort to learn new skills?</li><li>Are you willing to stick up your hand and ask a question … even if you think it sounds silly?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you answered “Yes” to at least 2 of these then you have the right attitude and I want you as part of my student community.  I would much rather have a small set of the right students that complete the course and get involved actively. You should enrol on this course:     \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><em>BECAUSE you answered “Yes” to 2 questions from above – you fit my ideal student description;</em></li><li><em>BECAUSE you are driven, motivated, want to get ahead in life;</em> </li><li><em>BECAUSE you are willing to work to get what you want from life;</em></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Frequently Asked Questions</strong></p>\n\n\n\n\n\n\n\n<p>Q: Why should I pay for a course when there is lot's online for free?</p>\n\n\n\n\n\n\n\n<p>A: Very good point.  There are two problems with the free online content.  Firstly, it will take a long time to find what you need.  Even if you do find something it probably won't be exactly what you want and need modification.  This takes time and time is the only real scarce resource - it's valuable and you shouldn't go wasting it.  Secondly, although there is a lot of  good content online there is also a lot of complete and utter s*it£.  If you willing to spend the time finding content, are able to tell the difference between good and bad and able to modify what you find confidently then you don't need this course anyway.  Otherwise  you can save yourself some time and stress by enrolling.    </p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>Q: Why do you put so much emphasis on exercises and quizzes? </p>\n\n\n\n\n\n\n\n<p>A: Past experience tells me the best way to lean coding is by doing.  I have taken this principle and used it to create this course.  You will find material in the exercises and quizzes that is not covered in the main body of the course and this is deliberate!</p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>Q: Why do you not provide solutions to exercises?</p>\n\n\n\n\n\n\n\n<p>A: There are two reasons.  Firstly, there is often more than one answer to a given exercise.  Secondly, and more importantly, if I do put up solutions then many students will become lazy and simply look at the solutions before attempting exercises.  I don't want this and instead want to encourage you to have a go yourself first.  </p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><strong>Still unsure? – try it for free!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I am giving away 30% of my course free as preview lectures.  I am doing this because I believe in the quality of my course, I am confident the previews will prove the course is well worth the price and that once you look at them you will want to buy the full course.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If that isn’t enough my course is backed by the Udemy 30 day 100% money back guarantee – if you enrol and change your mind you can get a full refund with no questions asked.  Why would I highlight? Because I’m confident that once you enrol you won’t want to give it back!</p>", 
    "end_date": null, 
    "title": "Become an Excel VBA Troubleshooter: Save Time and Earn More", 
    "price": "20.00", 
    "instructors": "Paul Morrissey", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/784646_e9ef_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-vba-troubleshooter/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T04:53:03Z"
}