{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong style=\"\">Get the most out of your iPad or iPad Mini with these step-by-step video tutorials.</strong>  </p>  <p>  \t<em style=\"\">(Updated February 2015)        </em><em style=\"\"><strong style=\"\">This course has Closed Captions (CC)</strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\"><br style=\"\">  \t</strong></em>  </p>  <p style=\"\">  \t        Have you ever thought that:  </p>  <ul style=\"\">  \t<li>You could use some help mastering your iPad?</li>  \t<li>Tips, guides, or tricks could help you turn your iPad into a powerful, useful tool for your life or business?</li>  \t<li>You&#039;d like to save money, time, and frustration picking out the right apps - for the right price?</li>  \t<li>You&#039;d like to really know how to use the iPad - and all of its capabilities?</li>  </ul>  <p style=\"\">  \t        No matter what stage of familiarity you have with your iPad, our user friendly course will help you get more from your Apple device. Our step-by-step video tutorials will empower you to confidently take command of your iPad.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">Watch the Savings:</strong>  </p>  <p>  \t      This exclusive course is designed to save you time, money, and effort. Let us help you optimize your iPad, keep your personal information safe, and navigate your apps daily.  </p>  <p>  \t<strong style=\"\">Save Time</strong>  </p>  <ul style=\"\">  \t<li>Your time is valuable. Let us help you learn the different types of apps, and why who makes them can (and should) influence your purchasing decision.</li>  \t<li>Learn how to set up apps, so that it works perfectly for you and your needs.</li>  \t<li>Organize your iPad so that it makes sense to you, saving you precious time.</li>  </ul>  <p>  \t<strong style=\"\">Save Money</strong>  </p>  <ul style=\"\">  \t<li>Save money by understanding the purpose of each app. By understanding the purpose of these pre-installed apps, you&#039;ll be able to make an informed decision about using it or paying for, and downloading, a third-party app.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Save Effort</strong>  </p>  <ul style=\"\">  \t<li>Not every installed app will have all of the features you want. We&#039;ll help you learn how to find, install, and personalise a third-party app that does have the features and function you&#039;re looking for.</li>  \t<li>Let us help you learn how to use App search and other discovery engines to locate the best third-party apps for your needs.</li>  \t<li>We want you to enjoy your iPad; let us help you learn how to download, and use, a wide variety of essential apps to keep you informed, productive, and entertained.</li>  \t<li>Keep your iPad organised so that it makes sense to you, saving you time and effort.</li>  </ul>  <p>  \t  ***************************************************************************************************  </p>  <p>  \t<strong style=\"\">Become an iPad Power User Course: All this and more!</strong>  </p>  <p>  \t  Our course is compatible with iOS 8.2 and has more than 7 hours of guided instruction! Lessons include:  </p>  <ul style=\"\">  \t<li>An overview of each app</li>  \t<li>Tips on how to use features and functions so you can personalize your apps and explore its functions</li>  \t<li>How to integrate pre-installed apps with other third-party apps to maximize efficiency</li>  \t<li>How to use an app and improve your understanding of it with additional resources</li>  \t<li>How to use App Search engines to locate the best alternative apps at the best price</li>  \t<li>Instructions and information that anyone can understand</li>  \t<li>Closed Captioning (CC) subtitles and a downloadable transcript</li>  </ul>  <p style=\"\">  \t<span style=\"\">We know that not every app is going to be your favourite; let us offer you viable, valuable alternatives. For example, eBooks from the iBook Store only work on Apple devices; eBooks from the Kindle store, however, work on almost any device.</span>  </p>  <p style=\"\">  \t<strong style=\"\">Your Risk-Free Trial</strong>  </p>  <p style=\"\">  \tOur guided courses are a friendly learning support system; work through courses sequentially or jump in where you want to. <strong style=\"\">Become an iPad Power User </strong>is the ideal companion to help you get the most out of your Apple device. Get lifetime access to all of the lectures and resources you need.  </p>  <p style=\"\">  \tThis course will change your life. We are so sure of it that we offer a risk-free, 30 day money back guarantee. Get the information you want, at no risk to you, today.  </p>  <p style=\"\">  \t<strong style=\"\">Enroll now!</strong>  </p>", 
    "end_date": null, 
    "title": "Become an iPad Power User ", 
    "price": "20.00", 
    "instructors": "Michele Berner", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331042_cf49.jpg", 
    "course_url": "https://www.udemy.com/the-ipad-apps-starter-kit-discover-the-power-of-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T22:03:07Z"
}