{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The Hudson Voice technique has been created by Steve Hudson, leading international voice over and communication trainer. The 7 Elements of this technique teaches you how to use your voice as a musical instrument, giving you full control over volume, pace, pitch and script interpretation. The basis for all voiceovers!</p><p>The course is on video and scripts will be provided for you to print. </p><p>The course will take about 2 weeks total (20 minutes a day), depending on your input.</p><ul><li>Before you start the course, we ask you to record your 'Before' recordings and keep them to one side. This is to establish your starting point.</li><li>You then go through each element of the course, guided by Steve. Practice each element until you're confident and then move on to the next one.</li><li>As you go through the course, you need to record yourself so you can listen back and correct anything that's not quite right.</li><li>Once you practised all seven elements and it becomes second nature, you need to record the same scripts you recorded before you started the course. These are your 'After' recordings.</li><li>Now you will hear how much you have improved.</li></ul><p><br>If you have followed the instructions and practised, you will be able to record voiceovers professionally, but of course, you will  need to record a demo CD. If you need any help with this, please don't hesitate to get in touch!</p><strong><em>Other benefits of this course:</em></strong><p><br></p>\n<ul><li>You will have greater confidence when giving presentations at school or work and job interviews.</li><li>Study time will be reduced because this course enables you to retain more information -quicker.</li><li>Reduce your accent if applicable.</li></ul><p><br><br><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Become a voiceover by learning the Hudson Voice Technique", 
    "price": "50.00", 
    "instructors": "Steve Hudson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453908_fc94_5.jpg", 
    "course_url": "https://www.udemy.com/hudson-voice-technique-for-voiceovers/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T15:41:07Z"
}