{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t                <br style=\"\">  \t<strong></strong><strong>According to Ralph M. Shenefelt, General Manager of the American Safety &amp; Health Institute (ASHI)</strong>    </p><p style=\"\">  \t                                         \"While experience is important, it's not  enough that someone has been watching children for years or that they  have raised their own children.  People who watch children should be  professionally trained.\"  </p>  <p style=\"\">  \t      In this course you will learn how to become a great babysitter that any child will love to have and that parents will want to keep calling back again and again.  </p>  <p><strong><u>Course Description</u></strong></p><p>Do you think babysitting for years is all that it takes to be great? Unfortunately the answer is A BIG NO. Experts just simply don't agree to this analogy at all. As per child safety experts, having raised one's own children is no criteria for being good at babysitting other children. Babysitters must be professionally trained.</p><p>This is what we kept in mind while designing this course for you in the most professional manner. It's just two hours of training that will turn you into the most loved and called for babysitter.</p><p><strong><u>What Are the requirements</u></strong></p><p>Audio understanding of spoken English.</p><p><strong><u>What Do you Get from This course</u></strong></p><p>The course has been designed to prepare a baby sitter for any eventuality, situation or contingency in babysitting. The content is the outcome of extensive research by our panel of childcare, pediatric and child safety experts. The course delivers to you:</p><p>Over 16 lectures and 1.5 hours of content!</p><p>Provide basic first aid to children and teenagers,</p><p>Care for multiple children at once,</p><p><strong>What is the target audience?</strong></p><p>Novice or amateur babysitters desiring to turn professional. Semi professional babysitters looking for the advanced understanding of the subject.</p><p>UPDATED: 9/24/2015<br></p>", 
    "end_date": null, 
    "title": "Become the Ultimate Babysitter In Less Than 2 Hours", 
    "price": "20.00", 
    "instructors": "Mrs. Cherokee Rainbow Lewis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/190624_0cc4_8.jpg", 
    "course_url": "https://www.udemy.com/childcare/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-28T22:46:23Z"
}