{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>This course offers complete instruction on keeping honey bees using organic, natural and traditional beekeeping techniques.<br> </strong></p><p>Beekeeping\n 101 was created over the course of a summer in order to capture a full \nseason with the bees including lots of hands-on time in the hive.   The \ncourse is intended to be a thorough introduction to keeping bees so that\n upon completion, the student can confidently start their own \ntreatment-free honey bee hive.  Taught from a permaculture perspective, \nthis course will teach you a holistic approach to beekeeping that \nconsiders the natural ecology of honey bees and agriculture.  Jacob's \ntechniques are bee-friendly and bee-centered vs. beekeeper-centered.</p><p>Beekeeping\n 101 covers it all from basic honey bee physiology and biology to \nextracting honey and preparing your hive for winter.  In this course you\n will learn about different kinds of honey bees and equipment and where \nto get it.  You'll learn about bloom and brood cycles, swarms, hive site\n placement, queens and re-queening, planning your honey harvest, \nextracting honey and crushing comb, combining hives and much more.  In \naddition Jacob will share with you his philosophies on feeding only \nhoney and pollen, using locally adapted stock, never using plastic or \ntreatments, mimicking nature's patterns.  As this course was filmed over\n the course of the summer season, lesson topics follow the flow of the \nseason.</p><p><em>This\n course was filmed over the course of the summer on 5 different days.  \nEach day's topics strays somewhat from the agenda as Jacob addresses \nstudent questions.</em></p>", 
    "end_date": null, 
    "title": "Beekeeping 101: Organic, Natural, Traditional", 
    "price": "50.00", 
    "instructors": "Jacob Wustner", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733608_bf10_2.jpg", 
    "course_url": "https://www.udemy.com/beekeeping-101-organic-natural-traditional/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T02:43:29Z"
}