{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Learn the basic concepts, tools, and functions that you will need to create a living, successful blog. </p><p>This class covers the blogging world from all angles, including: </p><ul><li>How to choose the blog platform for your blogging needs </li><li>Best practices for writing &amp; publishing entries</li><li>Techniques for promoting &amp; maintaining your new blog </li><li>Ways to interact with bloggers around the globe</li><li> Information on advertising opportunities &amp; affiliate programs to earn money</li></ul><p>While emphasizing the content of your very own blog, this class will also hone your skills at: </p><ul><li>Utilizing your blog platform to its fullest potential </li><li>Applying design techniques to further communicate your ideas to readers </li></ul><p>Learn the ins and outs of three blogging platforms, including Wordpress, BlogSpot, and Tumblr. You will also encounter other bloggers and complete assignments to ensure your experience in this class is helpful in the blogging world.</p><p>Take this course if: </p><ul><li> You have a curiosity about blogs and the blogosphere </li><li> You have a desire to create and a need for an outlet</li><li> You have a passion you wish to share with the world </li><li> You have a business you're looking to promote </li><li> You have a hobby you want to make money from </li><li> You're looking for a way to communicate on a global level </li><li> You've started a blog but need direction and/or promotional help </li></ul>", 
    "end_date": null, 
    "title": "Blogging for Beginners", 
    "price": "30.00", 
    "instructors": "Holly A. Phillips", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650876_6d9c_2.jpg", 
    "course_url": "https://www.udemy.com/blogging-for-beginners-hp/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T03:33:23Z"
}