{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Keynote has quietly revolutionized the world of mobile application design by providing the tools to transform your flat designs into fully animated and engaging concepts with only a few hours of training. This course will teach you to use the Keynote application to design dynamic, animated mobile app UIs that impress clients and engage users.</p><p><strong>Learn to Build Beautiful, High-Quality Animated Mobile Application UIs with Keynote’s Powerful Tools and Smooth Workflow</strong></p><p>• Master the essential principles and tools of Keynote.</p><p>• Discover design techniques that will enhance your creative potential.</p><p>• Learn and implement best practices to ensure quality and impact.</p><p>• Journey from concept to completion by animating a sample mobile application.</p><p><strong>Find Out Why Some of the Best Designers in the World Use Keynote</strong></p><p>Many of Silicon Valley’s most established and fastest growing companies swear by Keynote when animating UIs for mobile applications because it’s fast and intuitive, and produces stunning final products.</p><p>One thing that sets Keynote apart is its nearly one-step “Magic Move” transition which animates the difference between to design comps. This course will teach you the power of Magic Move, as well as many other advanced design techniques available within Keynote.</p><p><strong>Contents and Overview</strong></p><p>Whether you’re a beginner or a veteran designer with experience using Photoshop and Illustrator, you will find this course valuable in the way that it blends step-by-step instruction with hands-on, customizable exercises:</p><p><strong>• Mobile App Animation from A to Z: </strong>With 23 lectures and 2 hours of content, this course covers everything from preparing assets, designing elements, and precision animation timing to exporting finished video mockups.</p><p><strong>• Workflows for Sketch, Photoshop, and Illustrator: </strong>Since not all designers use the same tools, this course covers the workflows for bringing in designs for each of the top 3 design applications used by professionals. </p><p><strong>• Test Your Knowledge: </strong>Periodic quizzes will review key concepts and ensure that you are mastering the content.</p><p><strong>• Interactive Design Project: </strong>Together with the instructor, you will animate a sample UI for an iPhone music player app. Included Sketch, Photoshop, Illustrator, and Keynote documents allow you to pick up at any point in the project.</p><p>After completing this course, you will understand how to animate high-quality mobile application UIs using Keynote and you will be better prepared to meet the demands of your clients and developers.</p>", 
    "end_date": null, 
    "title": "Bring Your Design Concepts to Life with Keynote", 
    "price": "25.00", 
    "instructors": "Joseph Angelo Todaro", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669984_6bd2.jpg", 
    "course_url": "https://www.udemy.com/animating-in-keynote/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T23:54:15Z"
}