{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>Why was this class developed? </strong>  </p>  <p>  \t    In 2014, the American College of Obstetricians and Gynecologists (ACOG) and the American Academy of Pediatrics (AAP) released a joint statement denouncing waterbirth. In response, hospitals all over the U.S. began suspending their waterbirth programs.  </p>  <p>  \t    The ACOG/AAP statement has been roundly criticized for its low scientific quality. The statement included multiple gross errors, misrepresentations of study findings, and omissions of important research evidence. The opinion placed a strong emphasis on low-level evidence from “case reports” (like letters to the editor), while completely ignoring higher-level evidence from large observational studies that showed excellent outcomes in studies on thousands and thousands of women and babies. Among other flaws, the ACOG/AAP statement referred to “drownings and near drownings” that <strong>did not actually occur.</strong>  </p>  <p>  \t    As hospitals suspended or shut down their waterbirth programs, mothers, midwives, nurses, and physicians alike lamented the loss of waterbirth in their hospitals, as strong evidence shows that waterbirth is a safe, evidence-based option for pain relief during labor.  </p>  <p>  \t<strong>So what can we do to bring waterbirth back? </strong>  </p>  <p>  \t    When evidence-based childbirth options such as waterbirth are taken away—the last thing we should be doing is giving up! Instead, <strong>stand up and DO SOMETHING about it!</strong> This class gives you the knowledge, skills, and tools that will help you bring waterbirth back!  </p>  <p>  \t<strong>What will I get out of this course? </strong>  </p>  <p>  \t    The “Bring Waterbirth Back, Baby!” course will give you all the tools, tricks, and tips you need to bring waterbirth back to your community hospital. We will start by using the famous &quot;change theory&quot; to describe how change occurs in hospitals, and discuss why it is so important that you form a team to tackle this issue.  </p>  <p>  \t    Together, we will talk about the driving forces that can bring waterbirth back, and the restraining forces that can keep waterbirth at bay. You will learn how to set up a rally, how to talk with the media, and how to start a petition. You will be empowered by a brief cognitive therapy session, in which you will take a deep look at a hidden barrier to fighting waterbirth bans. You will also be able to debunk the flawed ACOG/AAP statement in front of hospital administrators.  </p>  <p>  \t    The class concludes with a fascinating series of interviews with people across the U.S. who have been involved in overturning waterbirth bans, including: an obstetrician champion for waterbirth, a nurse midwife, a mother, an attorney, and Barbara Harper, RN-- the founder of Waterbirth International.  </p>  <p>  \t<strong>Will I get anything else for taking the class? </strong>  </p>  <p>  \t    As part of your membership in this class, you will be invited to join a closed Facebook group of mothers and professionals who are working on reversing waterbirth bans in their hospitals.  </p>  <p>  \t    You will also be given access to an incredibly useful &quot;Waterbirth Ban Toolkit&quot; that contains all kinds of downloadable documents, templates, and handouts that you can use in your mission to reverse waterbirth bans.  </p>  <p>  \t<strong>The Waterbirth Ban Toolkit includes the following files and documents for you to download:</strong>  </p>  <ul>  \t<li>PowerPoint file you can use to give presentations to hospital administrators and physicians about the ACOG/AAP Opinion Statement</li>  \t<li>Change.org petition language for you to use</li>  \t<li>Printable petition to gather handwritten signatures</li>  \t<li>Sample press release about bringing waterbirth back to your community</li>  \t<li>One-page handout of “talking points” about waterbirth</li>  \t<li>Two-page handout on tips for dealing with the media</li>  \t<li>Sample letter to hospital administrators from a mother</li>  \t<li>Template for a letter-writing campaign from mothers</li>  \t<li>Printer-friendly PDF of the Evidence Based Birth blog article on waterbirth (42 pages)</li>  \t<li>Evidence Based Birth Annotated Bibliography of all the research ever conducted on waterbirth (80+ pages)</li>  \t<li>Formal letter to hospital administrators from Evidence Based Birth about the flaws in the ACOG/AAP Opinion Statement </li>  </ul>  <p>  \t<strong>Who is teaching this class?</strong>  </p>  <p>  \t    This class was designed and organized by Rebecca Dekker, PhD, RN, APRN, a nurse researcher and founder of Evidence Based Birth. In 2014, Rebecca spent four months conducting a systematic review of the literature on waterbirth.  </p>  <p>  \t    When she saw how many people were dismayed by the suspension of waterbirth in their communities, Rebecca gathered all of the resources and knowledge she could find into one course—to give people a better chance of being able to reverse waterbirth bans and restore waterbirth as an option for women in their community.  </p>  <p>  \t<strong>Can you guarantee that we will be able to reverse waterbirth bans by taking this class? </strong>  </p>  <p>  \t    To be totally honest and up front with you—there are many barriers to waterbirth. For one, the ACOG/AAP Opinion Statement is very powerful-- because of the liability concerns it has created. By simply taking this class we cannot and do not guarantee that you will be able to reverse waterbirth bans in your community. However, this class is<strong> the first time all of the knowledge, skills, and tools to fight waterbirth bans have been gathered into one online resource.</strong> So your fight to overcome waterbirth bans will be strengthened by what you learn here, and you will have access to materials that will make your fight both more productive and more strategic.  </p>  <p>  \t<strong>What if I want to start a new waterbirth program? </strong>  </p>  <p>  \t    I want to make sure that you understand this—the “Bring Waterbirth Back, Baby!” class is specifically focused on <strong>reversing waterbirth bans in hospitals that previously had a waterbirth program</strong>. This class will not teach you how to START a new waterbirth program—that is a huge topic by itself. If your goal is to start a waterbirth program, and you are starting from scratch we recommend that you contact Waterbirth International for their assistance.  </p>  <p>  \t    However, the lessons and materials in this class could be very <strong>helpful for anyone who is trying to overcome administrative barriers to implementing waterbirth in the first place</strong>. For example, if your hospital administrators are resistant to starting waterbirth because they are worried about the ACOG guidelines—then this class will likely be very helpful for you. If you&#039;re not sure whether this class is right for you, you can always sign up. You have 30 days to request a refund if you find out the class doesn&#039;t meet your expectations.  </p>  <p>  \t<strong>What if I decide I don’t want the class?</strong>  </p>  <p>  \t    If you sign up for this class and realize that it’s not exactly what you are looking for, don’t worry—you can simply request your <strong>30-day refund—no questions asked. </strong>  </p>  <p>  \t<strong>How long does the class take?</strong>  </p>  <p>  \t    There are about 3 and a half hours’ worth of video and audio in this class. Since the entire class is recorded and hosted online on Udemy, you can <strong>watch the class at your own pace</strong>. Udemy also has iPhone, iPad, and Android apps, so you can watch the class on your <strong>mobile device.</strong>  </p>  <p>  \t<strong>Can I earn continuing education credits? </strong>  </p>  <p>  \t    Yes, you can earn a certificate for <strong>3.5 nursing contact hours </strong>for taking this class. Evidence Based Birth is an approved continuing education provider by the Kentucky board of nursing. Kentucky Board of Nursing approval of an education organization does not constitute endorsement of program content. <strong>Nursing contact hours are accepted by most doula, childbirth educator, and some midwifery organizations.</strong> To get your certificate, you will simply take a short quiz after you finish the class. After passing the quiz, you will be able to instantly download and/or print your certificate.  </p>  <p>  \t<strong>Is there anything else I need to know?</strong>  </p>  <p>  \t    If you want to fight a waterbirth ban in your hospital, the &quot;Bring Waterbirth Back, Baby!&quot; class will give you the tools and tricks—and street knowledge—that you need so that you can be better equipped to bring waterbirth back to your community.  </p>  <p>  \t<br>  \t<strong></strong>  </p>", 
    "end_date": null, 
    "title": "Bring Waterbirth Back, Baby!", 
    "price": "50.00", 
    "instructors": "Rebecca  Dekker, PhD, RN, APRN", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226592_5878_3.jpg", 
    "course_url": "https://www.udemy.com/bring-waterbirth-back/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T19:48:53Z"
}