{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Gracias al avance de WordPress y el continuo desarrollo de soluciones, podemos decir que hoy en día crear una red social en línea no es tan difícil como podríamos pensar. Si eres un usuario entusiasta de WordPress, es muy posible que conozcas BuddyPress. Este potente plug-in para WordPress transforma sitios web en una plataforma de red social completamente funcional y lo mejor de todo es que no necesitas tener conocimientos de programación!\n\n  </p>\n\n<p>Con el plug-in gratuito de BuddyPress podrás crear tu propia red social para tu sitio web, empresa, escuela, equipo deportivo, o cualquier tipo de comunidad.\n\n  </p>\n\n\n\n<p>BuddyPress es una solución que brinda funcionalidades de red social que permite a los usuarios registrarse y crear sus propios perfiles. Los usuarios pueden enviar mensajes, hacer conexiones con otros usuarios, crear grupos o comunidades, compartir multimedia usando el plug-in rtMedia y mucho más.\n\n  </p>\n\n\n\n<p>En este curso aprenderás todo sobre BuddyPress. Aprenderás a instalar y configurar BuddyPress, a gestionar y personalizar perfiles de usuario, a entender cómo funciona BuddyPress y además aprenderás a personalizar el sitio web del proyecto usando un template gratuito llamado MesoColumn que soporta BuddyPress y bbPress para la creación de Foros y Discusiones.\n\n  </p>\n\n\n\n<p>Al finalizar el proyecto tendrás creado un sitio web con características de red social completamente funcional y lista para ser publicada en internet.</p>", 
    "end_date": null, 
    "title": "BuddyPress - Construir una Red Social con WordPress", 
    "price": "40.00", 
    "instructors": "Clarisa Maman Orfali", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/825256_87e7_2.jpg", 
    "course_url": "https://www.udemy.com/buddypress-construir-una-red-social-con-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-18T18:04:57Z"
}