{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Learn how to build your website with minimal technical skills using a Weaver theme author template. You&#039;ll also learn how to integrate author marketing strategies into the structure of your site.</p><p style=\"\"><strong style=\"\">Create a website that connects to your target audience and promotes your writing products and books.</strong></p><ul style=\"\"><li style=\"\">Create pages that showcase your books with buy buttons;</li> <li style=\"\">Learn to build your target audience of readers by blogging;</li> <li style=\"\">Set up autoposting of your blogs to your social media networks;</li> <li style=\"\">Learn the basics of how to operate your WordPress website; and</li> <li style=\"\">Explore advanced techniques such as building an email list.</li></ul><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">A Painless Solution to Building the Foundation of Your Author Platform</strong></p><p style=\"\">Whether you are self-published or have a traditional publisher, you need a website to market your books. Most publishers will tell you that you have to build your own platform: you have to blog regularly; you must try to connect with your target audience; you must build followers and friends on social media; and you must build an email list for ongoing contact with potential readers and buyers.</p><p style=\"\">Building a website that accomplishes all your online marketing needs can be a daunting challenge for the non-techy author. However, success is much more likely if you choose the strategy of using a pre-built and pre-customized WordPress author template and a hosting company that takes care of the technical work for you.</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">This course of over four hours of content (33 video lectures) will walk you through every step of creating your finished website. Each video focuses on one element of the site showing you exactly how to complete it. You can then continue to watch the next video, or stop and implement what you just learned. In other words, you could complete your own author website as you progress through the course.</p><p style=\"\">We will start with easy steps followed by more challenging tasks so that you don&#039;t get overwhelmed. Each video you watch will prepare you for the next. The end goal is always kept in mind that you are creating a website that will be an effective tool for marketing your writing materials and selling more books.</p>", 
    "end_date": null, 
    "title": "Build Your WordPress Author Website: NO Tech Skills Needed", 
    "price": "20.00", 
    "instructors": "Joe Jacobson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474306_7d9f_2.jpg", 
    "course_url": "https://www.udemy.com/complete-your-author-website-absolute-beginners-welcome/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T19:11:35Z"
}