{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong>+++++ A community of 1500+ students learning together +++++   \t                    </strong></p>\n\n<p><strong>+++++ Udemy 30 Day Money Back Guarantee +++++</strong>  \t<strong>  </strong></p>\n\n<p><em>\"<strong>The course was well-structured and comprehensive in its coverage and delivery</strong> - ideal for anyone starting out building a Wordpress site for business from scratch. Carol's Wordpress experience shines through in every lecture she delivers, and in addition to knowing her material, she delivers it in a clear and concise manner. This course is aimed at small business owners specifically, and Carol covers all the essential items in an efficient and effective manner. Recommended for anyone wanting to build a Wordpress website for their business quicksmart.\" (Philip Low)</em><br></p><p><strong></strong></p>\n\n<p><em> <strong>\"Comprehensive easy to follow guide</strong>: Carol takes you from the the very basics all the way through to some more complex tasks with grace and ease. You will definitely be able to build you own site after this course.\" (Sharon Ramel)</em></p>\n\n<p><em>---------------------------------------------------------------------------------------------------</em><em></em></p>\n\n<p><em> </em><em> </em><br></p><p><em>  \t</em><strong><em></em>Are you fed up with paying other people to build your website? Having to continually pay them to make changes? Being charged over the odds for hosting?</strong>  </p>\n\n<p>  \t  Well here's the good news. You can create a website yourself, have full control to make changes, and pay only a minimal amount for hosting. Even better, you don't need to know anything about HTML or other gobbledygook.  </p>\n\n<p>  \t  70+ comprehensive lessons cover step by step everything you need to get your website up and running. Videos and instructions make sure the steps are clear and easy to follow.  </p>\n\n<p>  \t<strong>Here's what you will learn:</strong>  </p>\n\n<ul>  \t<li>Why you should have your own website</li>  \t<li>Why your should use WordPress</li>  \t<li>How to choose the right host and install WordPress</li>  \t<li>How to set up WordPress</li>  \t<li>How to map out your website, create the pages you need, and create menus</li>  \t<li>Choosing and customising a theme</li>  \t<li>Adding functionality with plugins and widgets</li>  \t<li>Managing images</li>  \t<li>Keeping things up-to-date</li>  \t<li>And more</li></ul>\n\n\n\n<p>  \t<strong>Doesn't building a website require me to learn computer code like HTML?  </strong>Absolutely not. If you can send email, search the web and login to a website like your bank account, you have all the skills you need to create a professional looking website.  </p>\n\n<p>  \t<strong>Isn't there a lot to learn?</strong></p>\n\n<p>This course breaks things down into manageable size chunks, so you can take your time and move forward at your own pace. Do it all in one day or one section a day, the choice is yours.  </p>\n\n<p>  \t<strong>Is it expensive to have my own site?</strong></p>\n\n<p><strong></strong>WordPress is free so apart from your monthly hosting and domain (URL) costs of a few bucks there are no other costs.  </p>\n\n<p>  \t<strong>Why WordPress?</strong></p>\n\n<p><strong></strong>WordPress is used by 50 million sites worldwide, it has been around since 2008, and it's easy to use. And did I say it's free.  </p>\n\n<p>  \t<strong>So why do I need my own domain (URL)?</strong>With your own hosting and domain name you are in control. Your domain name is yours and gives your company a professional feel. It is <em>your</em> web address, place it on your business cards, it's yours, uniquely yours. It becomes part of your marketing identity like your address, email and telephone.  </p>\n\n<p>  \t  <strong>Get started today. You will have your own website up and running in no time.</strong></p>", 
    "end_date": null, 
    "title": "Build a Killer Business Website. No Experience No Coding.", 
    "price": "20.00", 
    "instructors": "Carol Cooper-Taylor", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340334_df20_12.jpg", 
    "course_url": "https://www.udemy.com/save-hundreds-create-your-own-small-business-website/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T07:38:59Z"
}