{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Have you ever wanted to hold a lightsaber in your hands or learn how to build one that's identical to the one in Star Wars? </strong><strong></strong><br></p><p>This course shows you how to find the parts and build the original lightsaber prop given to Luke Skywalker from Star Wars in under an hour. It's packed with my personal advice and resources to help you along the way and prepares you for the task of building your own saber with ease.</p><p><strong>Construct a timeless relic from Star Wars putting you a notch above the other fans and solidifying your legacy in the galaxy far, far away.</strong></p><ul><li>Learn how to find the parts you need to build a lightsaber</li><li>Relish in the process of building a vintage film prop</li><li>Discover secrets for success as I share my experience</li><li>Prepare yourself with the bonus resource kit included</li><li>Watch as I walk you through the process step by step</li></ul><p><strong>A short journey filled with cherished memories, child-hood nostalgia, and a priceless addition to your Star Wars collection.</strong></p><p>Who hasn't wondered what it would be like to be a Jedi Knight? Waving your lightsaber around, the Force at your fingertips, and destined to bring order to the galaxy. Well I can't make you a Jedi, but in my opinion holding a lightsaber in your hands is the next best thing. And the lightsaber built in this course isn't some cheap, flimsy mess. This course shows you the exact process the original special effects pioneers used to build the original lightsaber prop used in Star Wars.</p><p>After following the process outlined in this course you'll be holding a piece of history in your hands. The weight and quality of the materials as well as the attention to the details sell themselves. And when you share the experience with others and let them hold this lightsaber it's obvious that this is the real deal. No mass reproduction here, just results!</p><p><strong>Content and Overview</strong><br></p><p>Starting with a brief overview of the historical prop I'll then share some advice for how to get the most out of your time in this course. Then I'll cover all of the parts you'll need in order to start your build and where to find them.</p><p>From here on the course is a step by step walkthrough as I build this lightsaber right in front of you with my personal commentary sharing tips and tricks as I build. And before we wrap up I'll share some parting words of advice about how to get the details right and improve the look and feel of your prop with some things I've learned over the years.</p><p><strong>The Bonus Material</strong></p><ul><li><strong>A printable desktop guide</strong> - complete with a parts and tools list and a written version of the course. (Very handy to have at your workbench as you start your build.)</li><li><strong>A lightsaber blueprint</strong> - vital for reference as you assemble the parts</li><li><strong>A grip template</strong> - Ensures the grips are spaced evenly and the proper length</li><li><strong>An online resource list</strong> - Pointing you to more places to find parts and answers</li></ul><p>Grab this FREE course today and build a lightsaber just like the pros did it for the original film that started it all. May the force be with you!<br></p>", 
    "end_date": null, 
    "title": "Build a Lightsaber: Luke ANH Edition from Star Wars", 
    "price": 0, 
    "instructors": "Brandon Hix", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559202_d57b.jpg", 
    "course_url": "https://www.udemy.com/build-a-lightsaber-from-star-wars/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T06:50:47Z"
}