{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>In this course, you&#039;ll learn how to create complete online help systems using Adobe RoboHelp 11, the leading online help creation application available today. Eric Butow is your instructor and this course is narrated by Ann MacPhail. </p><p>RoboHelp allows you to create and integrate online help into your software or web app so your users can find answers to questions about your app quickly and easily. If you&#039;re a technical writer or an app developer who wants to support your users with online help, this course is for you. </p><p>This 10-hour course is divided into 13 sections that progressively show you how to create your own online help project. Each lecture contains a video demonstration that shows you how to perform the lecture task in the RoboHelp window.</p><p>Topics covered in the course include:</p><ul style=\"\"><li>Learn about the menu bars, toolbars, and windows within the RoboHelp app window</li><li>Create a project, add project topics, and format topic text</li><li>Design your topics with styles, links, and frames</li><li>Go further by building forms, creating tables, and inserting graphic and multimedia files</li><li>Understand how to create user variables, add conditional build tags, and add scripts</li><li>Make it easy for your users to find information by learning how to add a table of contents, index, glossary, and see also keywords to your project</li><li>Generate your project in a variety of different formats so your users can view your online help on any device from smartphones to computers…and even in a printed manual</li></ul><p></p><p>At the end of most sections, you&#039;ll be able to create various parts of your help project in an exercise that tests how much you learned in that section.</p><p>When you finish this course, you&#039;ll have all the knowledge you need to create online help systems for your users that are truly helpful.</p>", 
    "end_date": null, 
    "title": "Building Online Help for Beginners Using Adobe RoboHelp 11", 
    "price": "50.00", 
    "instructors": "Eric Butow", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23873_a8b1_5.jpg", 
    "course_url": "https://www.udemy.com/adobe-robohelp-9/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-30T08:00:12Z"
}