{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Fundamentals of Use Case Modelling course use an integrated case-study based approach.\n\n  </p>\n\n<p>This is a beginner to intermediate level course and hence suitable for fresh as well as experienced business analysts. This course is ideal for those who want to learn use case modelling but do not want to spend hundreds of dollars or spend extensive time in self study.\n\n  </p>\n\n<p>With this business analysis training, you will be able to acquire skills to create use case diagrams, write detailed use case descriptions and scenarios. You will also be able to talk confidently about use case modelling in your business analyst interviews.\n\n  </p>\n\n<p>In this course, you will get introduced to the key concepts and terms of requirements analysis before you learn specifics of use case modelling. In the introduction to use case modelling, you will learn purpose of use cases, and components of use case diagrams such as actors, use cases and the associations between them. \n\n  </p>\n\n<p>You will learn to write detailed use case descriptions, identify actors and use cases and also learn steps involved in writing use cases incrementally in a well defined structured way. You will also learn to write scenarios to analyse various ways in which a use case can be performed. \n\n  </p>\n\n<p>The whole course will take less than 2 hours to complete.\n\n  </p>\n\n<p>This course includes lectures with examples and case study to help you learn concepts of use case modelling. You will be able to attempt quiz at the end of each session to check your understanding. You will also be able to download a sample use case that is used as a part of the case study as well as a self-explanatory use case template for personal or commercial use.</p>", 
    "end_date": null, 
    "title": "Business Analysis: Fundamentals of Use Case Modelling", 
    "price": "50.00", 
    "instructors": "Trividh Patel, CBAP", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806082_6784_7.jpg", 
    "course_url": "https://www.udemy.com/business-analysis-fundamentals-of-use-case-modelling/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T12:36:39Z"
}