{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Advanced concepts in Use Case Modelling course uses an integrated case-study based approach.</p>\n\n<p>This is an advanced level course and hence suitable for business analysts who are experienced (or at least trained) in writing simple use case descriptions. This course is ideal for those who want to learn to use relationship between use cases or about misuse and security use cases but do not want to spend extensive time in self study.\n\n  </p>\n\n\n\n\n\n<p>With this business analysis training, you will be able to acquire skills to write detailed use case descriptions using the include, extend and generalization relationships. You will also be able to talk confidently about relationship between use cases, misuse and security use cases in your business analyst interviews.\n\n  </p>\n\n\n\n\n\n\n\n<p>In this course, you will get a recap on fundamental concepts in use case modelling before you learn advanced concepts in use case modelling. In overview of relationship between use cases, you will understand the need for using relationship between use cases, and get an overview on purpose of each relationship and about modelling them in use case diagrams. \n\n  </p>\n\n\n\n\n\n<p>You will learn to write detailed use case descriptions by using the include, extend and generalization relationships. \n\n  </p>\n\n\n\n\n\n<p>You will also learn to identify and mitigate security threats to the system by identifying misuse cases and security use cases. \n\n  </p>\n\n\n\n\n\n<p>The whole course will take less than 2 hours to complete. </p>\n\n<p>\n  This course includes lectures with examples and case study to help you learn advanced concepts in the use case modelling. You will be able to attempt quiz at the end of each session to check your understanding. You will also be able to download an enhanced version of self-explanatory use case template for personal or commercial use.</p>", 
    "end_date": null, 
    "title": "Business Analysis: Advanced Concepts in Use Case Modelling", 
    "price": "50.00", 
    "instructors": "Trividh Patel, CBAP", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/869094_b837.jpg", 
    "course_url": "https://www.udemy.com/business-analysis-advanced-concepts-in-use-case-modelling/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-05T04:04:04Z"
}