{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>There are currently an estimated 35,000,000 people in the United States alone who are caring for an aging loved one.</p><p>And as the baby boomer generation retires...at the rate of 10,000 a day...the strain on caregivers throughout the world will increase exponentially as the &quot;silver tsunami&quot; hits.</p><p>Simply put, caregivers need help, and as time goes on they will need more of it.</p><p><strong style=\"\">But The Incredible Thing Is The Amount of Resources That Currently Exist </strong><strong style=\"\">To Assist Caregivers</strong></p><p>Yes, there is a massive assortment of services and organizations designed to assist caregivers.  The problem is that some of these can be difficult to find.</p><p>And that&#039;s where the caregiver support workshop comes in.</p><p><strong style=\"\">Learn About The Resources You Have Access To NOW!</strong></p><p>After completing this course, you will have the knowledge to...</p><ul style=\"\"><li>Understand the biggest mistakes that caregivers make, and how to avoid these</li><li>Find the local volunteer organizations that are designed to assist you</li><li>Help your aging parents get access to free dental care, free legal advice and dozens of other free services</li><li>Understand exactly what caregiver burnout is, and what help is out there to help you as the caregiver</li><li>How to find local sources sources of respite care</li><li>Get a complete primer on government health care and the differences between Medicare and Medicaid</li><li>Know how to properly evaluate a nursing home, assisted living facility or home health care agency</li><li>How to pick the right elder law attorney to guard your family&#039;s assets from the massive costs of nursing homes</li><li>And so much more</li></ul><p><strong style=\"\">Contents and Overview</strong></p><p>Through 45 lectures and my own personal experiences as a caregiver, you will learn from my successes and mistakes the best way to take care of and protect your aging parents, while at the same time getting enough support for yourself that you can still live your own life...as you deserve to do!</p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Caregiver Support: Resources For Stressed Caregivers ", 
    "price": 0, 
    "instructors": "Tony Rovere", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402650_db68_4.jpg", 
    "course_url": "https://www.udemy.com/caregiver-support/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T02:24:12Z"
}