{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\"> A database is the backbone of any application, and therefore it must be sturdy, reliable, and accurate. Having a well-designed database is the key to having your database meet these criteria, and the six-step database design technique ensures that the data model upon which your database is based is sturdy, reliable, and accurate.</p><p style=\"\"><strong style=\"\">Review case studies on designing relational databases in six easy steps</strong></p><ul style=\"\"><li style=\"\">Review the <em style=\"\">Six-Step Relational Database Design</em> technique</li><li style=\"\">Learn by example using case studies that go through designing a database in six easy steps</li><li style=\"\">Each case study goes through each of the six steps</li><li style=\"\">Each case study starts with a problem statement and ends with a Crow&#039;s Foot R-M diagram<span style=\"\"></span></li><li style=\"\">Challenge yourself with case studies increasing in complexity</li></ul><p style=\"\"><strong style=\"\">Case studies demonstrating the <em style=\"\">Six-Step Relational Database Design</em> technique</strong></p><p style=\"\">After a brief overview of the six-step database design process, three case studies are used to demonstrate how the technique works. Each case study starts with a concise statement of the problem and then goes through each of the six steps that are part of the six-step database design technique, ending with a Crow&#039;s Foot relational database model.</p><p style=\"\">Some knowledge of database design terminology and techniques is required, and while this course does delve into the details of the six-step relational database design technique, you will learn, from examples, how this technique can be used to create a  sturdy, reliable, and accurate relational database model. The extensive supplemental resources (handouts) that compliment the video tutorials allow you to fully understand how the six-step relational database design technique works. </p><p style=\"\">You will learn what the six steps of <em style=\"\">Six-Step Relational Database Design</em> are, and how they work to transform a problem statement into a Crow&#039;s Foot relational database model using three examples. </p>", 
    "end_date": null, 
    "title": "Case Studies in Six-Step Relational Database Design", 
    "price": "20.00", 
    "instructors": "Fidel Captain", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587448_4e57_4.jpg", 
    "course_url": "https://www.udemy.com/csinsixstepdatabasedesign/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T15:10:38Z"
}