{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course will teach you to care for and maintain every wearing part on your chainsaw, from the guide bar to the chain and sprockets, fuel and air filters, starter mechanism, clutch and chain brake. The course is predominantly video based, with detailed descriptions and demonstrations of all the operations you will need to perform to understand your saw and keep it in top working order, whatever duty you put it through. The course will take about four hours to view all material from start to finish but it is designed to be modular so that you can use each individual lecture as a \"how to\" before you go ahead and perform each job on your own saw yourself. The course is split into five main teaching sections and introduces you to a course overview, the right Personal Protective Equipment (PPE), how to select the tools for your job, each individual maintenance process on the saw and a specific section devoted to chain care, maintenance and sharpening. There are quizzes in each section to help you check your progress and by the end of the course you will have covered a syllabus which professional chainsaw operators have to fulfil to successfully pass a UK industry standard assessment in chainsaw maintenance. Over the life of a saw, this knowledge will save you more money in maintenance than the saw costs to buy new and will ensure you are capable of extracting the highest cutting performance, accuracy and quality possible from your machine.</p>", 
    "end_date": null, 
    "title": "Chainsaw Recovery, Maintenance and Safety.", 
    "price": "25.00", 
    "instructors": "John William Russell", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592604_87a2_2.jpg", 
    "course_url": "https://www.udemy.com/chainsaw-recovery-maintenance-safety/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T07:53:15Z"
}