{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Take back your power! Speed up your computer - for free.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">***This course is ideal for beginners in the world of taking care of your computer. It is designed to take you step by step through the very basics of working with your computer.***</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<em style=\"\">Join now for ongoing access to all lectures and interaction with more than 1,500 students.</em><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t        Learn how to keep your computer running as fast as it can. Even if you are afraid to look at anything other than your email or Facebook, you can learn how to use completely free tools to fix those things that destroy your surfing pleasure.  </p>  <p style=\"\">  \t        Have you ever tried to look at a website only to find your computer screen completely unusable because it is covered with pop-ups?  </p>  <p style=\"\">  \t        Do you get big bright messages telling you that you have hundreds of viruses?  </p>  <p style=\"\">  \t        Are you tired of taking your computer to the repair shop to pay hundreds to have it cleaned and speeded up?  </p>  <p style=\"\">  \t        Then this course is for you. You will take a gentle peek at your computer and learn a bit more about it than you ever thought you wanted to know. Then you&#039;ll discover the truth about how you can surf the &#039;net and how to protect yourself from brutal attacks and hijacked webpages.  </p>  <p style=\"\">  \t        You&#039;ll learn about the different programs available and how to safely and properly use antivirus and antimalware programs to protect yourself.  </p>  <p style=\"\">  \t        The course can be finished in a weekend if you want to plunge right into it. The best thing is, you can see immediate improvements in your computer&#039;s performance before you are half-way through the course.  </p>", 
    "end_date": null, 
    "title": "Clean Your Computer & Make It Run Fast - with No Cost Tools", 
    "price": "30.00", 
    "instructors": "Joanne Reid", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361842_6e67_4.jpg", 
    "course_url": "https://www.udemy.com/clean-up-your-computer-make-it-run-fast-with-free-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T23:33:22Z"
}