{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Course one of two necessary to complete to earn a certificate as a Consulting Hypnotist or Hypnotherapist, depending on the state in which one lives.<br><br>The fee for the basic course is $75. The entire certification course is broken down into different parts strictly because of different desires of those who wish to learn more about hypnosis but might not have a need for a completely new career. <br><br>The person teaching this course has successfully hypnotized tens of thousands of people and is as much of an expert in this field as anyone will find.<br></p><p>In this course you will learn:<br>Brief history of Hypnosis<br>Hypnosis Defined<br>Suggestibility Tests<br>Classifying Clients<br>Pre-Inductions and why they are so critical<br>Inductions<br>Depth Tests<br>Deepeners<br>Basic Therapy<br>Awakening<br><br>Students will learn how to induce hypnosis and the critical steps to take before an induction even begins. A successful student WILL be able to hypnotize a willing subject and perform a basic hypnosis session with the knowledge obtained.<br><br>With this knowledge someone can then determine if this field is one which warrants taking the next step and investing more resources into earning the certificate from The American School of Hypnosis.<br><br>Certified Hypnotherapist, Instructor and renown Stage Hypnotist Marshal Manlove is the instructor of this course. He can be reached at via email during any stage of the course.</p>", 
    "end_date": null, 
    "title": "Clinical Hypnosis Basics", 
    "price": "50.00", 
    "instructors": "Marshal Manlove", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449534_e589_4.jpg", 
    "course_url": "https://www.udemy.com/clinical-hypnosis-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T15:56:57Z"
}