{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Why should you learn cloud computing?</strong></p>\n\n<p>Now-a-days Cloud computing or simply Cloud is the buzzing world in the technology industry. With the current challenging business environment all industry demands cost effective and reliable (i.e. always on) solutions. Cloud computing technology provides the answer. This makes it absolutely essential to have a basic knowledge on cloud computing concepts, technology and architecture as well as get a bigger picture about cloud computing advantages and disadvantages.\n\n  </p>\n\n<p><strong>As a beginner you will build a strong fundamental on cloud computing.</strong>\n\n  </p>\n\n<p>If you are just a beginner who is confused about big jargons of cloud computing and want to learn cloud computing fundamentals then this is the best course for you. On the web you will find a lot of content discussing about cloud computing in bits and pieces or few discuss about specific technology through which cloud computing concept is implemented. But most of the courses don’t discuss about the fundamental concept and jargons used. So as a beginner you miss the bigger picture and always get confused with the terminologies.\n\n  </p>\n\n<p><strong>Get ready to take your first step towards cloud computing jobs/career.</strong>\n\n  </p>\n\n<p>In this course I will take you through all the fundaments and jargons used in the cloud computing industry and it is explained in layman’s term. So you don’t need any prior knowledge on cloud computing to enrol for this course.\n\n  </p>\n\n<p>After completing this course you will be able to comprehend cloud computing related discussion happening around and all set to start a career or manage a team in this field.\n\n  </p>\n\n<p><strong>Content and overview</strong>\n\n  </p>\n\n<p>We will start with answering why cloud computing required? With real-life business scenario. Then the next lectures will cover the major terminology and concepts of clouds computing. You can consider this course as “cloud computing for dummies”.\n\n  </p>\n\n<p>You will also come to know about cloud service model and cloud deployment model in detail with cloud computing examples related to our day-to-day life business scenarios.\n\n  </p>\n\n<p>We will conclude this course describing about cloud computing benefits, characteristics and key challenges.\n\n  </p>\n\n<p>Once you complete this course along with quiz you will receive a verifiable certificate of completion and all the fundamental required to face a discussion or interview for cloud computing jobs.\n\n  </p>\n\n<p><em>You can get a full refund within 30 days and no question asked, if you didn't like the course.</em>\n\n  </p>\n\n<p>So, what are you waiting for? <strong>Enroll now and get equipped with the most demanding skill.</strong></p>", 
    "end_date": null, 
    "title": "Cloud Computing Basics:Enhance your career as Cloud Engineer", 
    "price": "25.00", 
    "instructors": "Er. Malaya Biswal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/824256_5a29_5.jpg", 
    "course_url": "https://www.udemy.com/cloud-computing-basics-essential-concepts-you-must-know/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-17T10:09:04Z"
}