{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong style=\"\">Have you ever had a dream of running off and joining the circus? </strong>  </p>  <p>  \t<strong style=\"\">Do you like hearing people laughing at your antics? </strong>  </p>  <p>  \t<strong style=\"\">Do you have a desire make other people happy? </strong>  </p>  <p>  \t          Then maybe you should think about the art of clowning. It is an art and takes years of practice to perfect. You can&#039;t just go to the Halloween store buy some face paint throw on your pajamas and be a clown. That is not a clown.  </p>  <p>  \t  This course is structured to get you on your way to becoming a clown. No matter if you clown for fun or profit a clown is  always representing the entire profession whether your niche is birthday  parties, parades/fairs or visiting hospitals and nursing homes.  </p>  <p>  \t          A clown is a professional entertainer and it takes work and effort to do it correct. Everyone can spot a &quot;real&quot; clown versus an amateur in a wig. This <strong style=\"\">course teaches about being a &quot;real&quot; clown</strong>, what supplies you need, how you conduct yourself. We will cover types of clowns how they act and interact with people.  We will talk about how YOU can pick your clown outfit(s), wig, make up and clown personality.  </p>  <p>  \t          From here we will cover how to actually clown by talking about <strong style=\"\">balloon twisting and the use of props</strong> and types of props you can use in your clown act.  </p>  <p>  \t          We will discuss major topics in the clown community such as rules to be a professional clown and <strong style=\"\">how to act professionally and appropriately</strong>.  We will talk about the bad wrap that clowns can get from Hollywood movies and how you can avoid falling into that stereotype.  </p>  <p>  \t          The last part of the course is will be all about <strong style=\"\">professional development</strong>.  This covers the topics of honing your craft by getting involved with other clowns in the community through clown alleys and conventions both on the local, regional and national level. This will also give personal tips on clowning in particular situations such as parades, hospitals and birthday parties.  </p>", 
    "end_date": null, 
    "title": "Clown for fun and profit: Learning the art of clowning", 
    "price": "40.00", 
    "instructors": "J. R. Boyle", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/84008_6df3_11.jpg", 
    "course_url": "https://www.udemy.com/becoming-a-clown/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-26T13:39:05Z"
}