{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t    Setting up a development environment is the first, and often the most important, step for you to learn mobile development. However, as a beginner to mobile application development, you may have many questions regarding development environment setup: What programming language should I use, Java, Objective C or Swift? What computer should I use, a Mac Book, a Windows machine, or a Linux box? What Integrated Development Environment (IDE) should I use, Eclipse, Xcode, or Android Studio? Should I start programming for iPhone, Android phone, or Windows Phone?  </p>  <p>  \t      These are all the questions I asked when I tried to set up my first mobile app development environment about two years ago. As a beginner, you may have similar questions. This course is designed to answer these questions. In this course, I will show you how to set up the following mobile app development environments step by step:  </p>  <p>  \t<strong style=\"\">Mobile Development Environments to Be Set up in This Course</strong>  </p>  <ul style=\"\">  \t<li>Xcode for iPhone/iPad app development on Mac</li>  \t<li>Eclipse ADT bundle for Android app development on Mac</li>  \t<li>Visual Studio for Android app development on Windows</li>  \t<li>Eclipse ADT bundle for Android app development on Windows</li>  \t<li>Visual Studio for Windows Phone app development on Windows</li>  \t<li>Eclipse ADT bundle for Android app development on Linux (Ubuntu)</li>  \t<li>Android Studio on Windows, Mac and Linux</li>  </ul>  <p>  \t      This list actually covers all major development environments on all main platforms and for all popular mobile devices. So no matter what platform you have and what type of mobile devices you target on, you may find at least one setup and configuration that is suitable for you.  </p>  <p>  \t<strong style=\"\">Game Development Environment Setup with Cocos2d-x</strong>  </p>  <p>  \t      Mobile game development is one of the main mobile app categories. However, game development needs additional setup and configuration to a general app development environment. And, similarly, setting up a game development is the first important step to learn mobile game development. Cocos2d-x is cross-platform and one of the most popular game libraries for mobile game development today. So I’ll also show you how to set up cocos2d-x on all platforms in this tutorial. So this is not only a course for setting up a game development environment with cocos2d-x, but also one for setting up a general mobile app development environment.  </p>  <p>  \t<strong style=\"\">How This Course is Taught and What You can Learn</strong>  </p>  <p>  \t      In this course, I will teach you how to set up a mobile app development environment in the following manner: First, you will learn to how to set up a common development environment for mobile apps, then on the basis of this environment, you set up cocos2d-x. If you don’t plan to develop games, you can still use exactly the same same development environment you set up, or you may simply ignore the cocos2d-x setup. By the end of this course, you will understand the similarities and difference between each development environment and, based on your hardware and programming experience, set up the right mobile app development environment you need.  </p>", 
    "end_date": null, 
    "title": "Cocos2d-x Setup on Mac, Windows, and Linux Step by Step     ", 
    "price": "20.00", 
    "instructors": "Jian Fang", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363594_9b5c_10.jpg", 
    "course_url": "https://www.udemy.com/cocos2d-x-setup-on-mac-windows-and-linux-step-by-step/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T04:54:25Z"
}