{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>“This course is not sponsored by or affiliated with Udemy, Inc.”<br></p>\n\n<p>Se você é um novo instrutor na Udemy, ou se você já tem cursos publicados mais gostaria de pegar alguns novos truques, você veio ao lugar certo.</p>\n\n<p>Este curso é tudo o que você quer e precisa para todas as coisas relacionadas com a criação do curso na Udemy. Este curso está sempre crescendo, constantemente estou atualizando com novas Aulas para ajudar você a criar o curso perfeito e assim poder ganhar um bom dinheiro com a venda dos seus cursos.</p>\n\n\n\n<p>Aqui está o que nós vamos cobrir:</p>\n\n\n\n<p>Como criar seu curso na Udemy, do começo ao fim.</p>\n\n\n\n<p>Como escolher o tema ou assunto perfeito para o seu curso.</p>\n\n\n\n<p>Como ganhar dinheiro com a venda dos seus cursos</p>\n\n\n\n<p>Como a Udemy vende os cursos para você de forma Automática e constante!</p>\n\n\n\n<p>Como planejar o seu curso de forma de criar o curso 5 vezes mais rápido!</p>\n\n\n\n<p>Como começar a gravar seus cursos com custo ZERO!</p>\n\n\n\n<p>Como otimizar o seu perfil de instrutor para atrair mais alunos.</p>\n\n\n\n<p>Todos os meus Segredos de Marketing na Udemy! Para aumentar os seus lucros exponencialmente!</p>\n\n\n\n<p>Como posicionar o seu curso para ter sucesso no mercado, usando uma imagem do curso, vídeo promocional perfeitos para assim atrair mais alunos.</p>\n\n\n\n<p>O processo de revisão Udemy.</p>\n\n\n\n<p>E muito mais...</p>\n\n\n\n<p>Tudo pronto para começar a nossa aventura na Udemy? Vamos lá!!!</p>", 
    "end_date": null, 
    "title": "Como Criar seu curso na Udemy unnoficial", 
    "price": 0, 
    "instructors": "Diego Davila", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523406_e486_2.jpg", 
    "course_url": "https://www.udemy.com/criarcurso/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T15:59:41Z"
}