{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This Plaster Casting Course is for the Complete Beginner. It  is assumed that you have never cast a statue or figurine from plaster, using a rubber  mould. (NOTE: Mould is spelled Mold in some countries)    This course is about MAKING MONEY, using Casting Plaster  to make statues or other objects; objects that you can sell for a profit in  markets, shops or from your house.    On completion of the Course, you will have all the  information you need to start a career in Plaster Casting (or Moulding). Plaster Casting is  a very rewarding and lucrative career and I hope, like me, that you will find  great enjoyment doing it.  Whether you  want to cast the same statue over and over again, or make many different  statues, the pleasure and excitement is always there, every time you remove a finished  statue from a rubber mould.    As a career, you can vary it in many different ways and  make it more interesting. For example, you might want to make only small statues  for inside a house -  or maybe you would  like to make a selection of small and large items,  - or you might want to make statues and  ornaments for outside, - both big and small sizes.     Ready-made moulds are available online for every type of statue,  figurine and character you can think of.    This course will be show you how to cast a small statue  nine inches tall, from plaster powder to a statue ready for sale. You can  follow this very same process exactly, for any other object you choose.    At the end of the course, I will show you how to paint and  varnish the statue, once the plaster has dried.    When the statue is completed, you can sell it for a  significant profit.</p>", 
    "end_date": null, 
    "title": "Complete Plaster Casting Course for the Total Beginner", 
    "price": "20.00", 
    "instructors": "John Hesnan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469856_0aea_4.jpg", 
    "course_url": "https://www.udemy.com/complete-plaster-casting-course-for-the-total-beginner/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T13:12:17Z"
}