{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course helps you understand how computer programming works. Here, I will introduce you to the basic principles of programming. You will develop your logical thinking, while learning how to design algorithms.<br></p>\n\n<p>Becoming a programmer(software developer) does not mean to just learn a programming language. Nope! It means to:</p>\n\n\n\n<ol><li><strong>Learn to think like a programmer,</strong></li><li><strong>understand how programming works,</strong></li><li>learn any programming language,</li><li>practice, practice, practice</li></ol>\n\n\n\n<p><em><strong></strong></em>This course will help you with points 1 and 2. The course does <strong>not</strong> cover any programming language or development environment. This course is meant to be taken before learning a specific programming language.</p>\n\n\n\n<p><em><strong> </strong></em></p>\n\n\n\n<p>I designed this course for complete beginners, because I have seen too many students starting from point 3 and not understanding what they are doing. I recommend this course to all beginners at our live courses and if you are just starting with computer programming, I also recommend it to <strong>you</strong>!</p>\n\n\n\n<p>I am very keen on examples. Every time when I explain something new, I supplement it with examples. Another key to understanding is exercise. I prepared questions, exercises or practice problems after each lesson.<br></p>\n\n\n\n<p>By the end of this course you will understand:</p>\n\n\n\n<ul><li>How the computer represents and handles information</li><li>How to design an algorithm, using flowcharts</li><li>Data types, operators, Variables, Decisions, Loops, Arrays and matrices</li></ul>\n\n\n\n<p>After this course you will be ready to learn any programming language faster, with deeper understanding.<br></p>", 
    "end_date": null, 
    "title": "Computer programming for beginners: Understand how it works", 
    "price": "20.00", 
    "instructors": "Miroslav Paunov", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709444_272c_2.jpg", 
    "course_url": "https://www.udemy.com/computer-programming-for-beginners-understand-how-it-works/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T09:14:08Z"
}