{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t  This course is for anyone who is using a digital camera. You can be a photographer, videographer, a media guru, a creative student, an udemy instructor, you will figure it out once, to clean your digital sensor with a professional is really expensive, especially when you need to do it quite often.  </p>  <p>  \tMaybe you working as a Photographer who just want to make some income to offer a sensor cleaning service in your city after you finished with this course and became a professional sensor cleaner. You also tried to search online some videos or ebooks about the cleaning process but the quality or quantity was never as good to be sure you know enough to start cleaning your sensor by your own.  </p>  <p>  \tIn this course you will learn how to:  </p>  <ul>  \t<li>Check your camera that it&#039;s dirty or not</li>  \t<li>Make a special tool to check your sensor</li>  \t<li>Use the rocket blower and air duster</li>  \t<li>Use the wet sensor cleaning process</li>  \t<li>Make your own equipments</li>  \t<li>How often you should clean your sensor, and how to keep it clean</li>  </ul>  <p>  \t  While you will learn everything in this course about sensor cleaning from A - Z, you will also get in every lesson a lot of useful tips &amp; tricks.  You will also learn that the sensor cleaning is easy and fun. You also don&#039;t have to spend a lot of money on equipments, especially if you will use your own DIY things.  </p>  <p>  \t  You can complete the complete course in a day, or  just spread the time, and learn day-by-day a little.  </p>  <p>  \t<br>  \t<br>  </p>", 
    "end_date": null, 
    "title": "Complete guide of Cleaning a Digital Camera Sensor", 
    "price": "50.00", 
    "instructors": "Gábor Balogh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305624_5455_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-clean-your-digital-camera-sensor/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-22T20:03:48Z"
}