{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to the \"<strong>Complete Exchange 2013 Practical Guide</strong>\" where you will learn everything you need to know to build and maintain an Exchange 2013 environment. </p><p>In this course we will start by going over Microsoft Exchange and email concepts.  Then will will move right into building our own Microsoft Exchange 2013 environment from scratch.  We will make all the configurations needed just as we would do in a production business environment.</p><p>This course has over 90 lectures totaling over 6 hours of video content.  This course was designed to help any IT Professional further their career or start a new career with Microsoft Exchange. There are no prerequisites to taking this course but a basic understanding of Microsoft Windows Servers is beneficial.</p><p>The video content for this course is primarily lab instructional videos that show you how to do many of the tasks a Microsoft Exchange administrator would have to do.</p><p>The first section of this course is a quick introduction and then we jump right into the second section where we go over everything to build your Microsoft Exchange server from scratch.    Then sections three, four and five go even deeper into the different parts of Microsoft Exchange 2013 and show you what you need to know to become a Microsoft Exchange Administrator. <br></p><p>Unlike many other courses this course was designed to not only teach you Microsoft Exchange Server but to act as a continual reference when administrating Microsoft Exchange Server.  All of the demonstration lectures are kept short and to the point allowing any student to quickly refer to them on a day to day basis. </p><p>I am always available to my students and I like to continually add material to my courses, especially material that my students want to see.</p><p>So take a look through the course material and layout, let me know if you have any questions and I look forward to seeing you in the lectures.</p>", 
    "end_date": null, 
    "title": "Complete Exchange 2013 Practical Guide", 
    "price": "30.00", 
    "instructors": "Mike Walton", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864566_11ff_2.jpg", 
    "course_url": "https://www.udemy.com/complete-exchange-2013-practical-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T11:45:38Z"
}