{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p> You have <strong>never</strong> before had the potential that you do – right now – to reach millions of people all around the world! The <strong>power of video is simply incredible</strong>; allowing you, your words your ideas, your products to get right into the hearts and minds of those you really want to connect with. </p><p>This is so exciting!! </p><p>And, at the same time, maybe a little bit scary. Or overwhelming. Or frustrating. Maybe you appreciate the importance of video content, but you just can't manage to <strong><em>'be yourself'</em></strong> on screen. </p><p> Listen, I get it. Video presenting is not a natural thing for most people, but with my help, you absolutely <em><strong>can</strong></em> move from a  place of fear and discomfort around being on camera, to being able to <strong>shine on screen</strong>. </p><p>This isn't about coaching you to <em>be</em> anyone or anything you're not. It's about you being the best, <strong>most brilliant version of yourself</strong> that you can be. It's in you, you know it! </p><p>We'll work through the mental blocks that get in the way of you being natural on camera, and you'll learn workable techniques that help you relax on screen and <strong>connect</strong> with the people you really want to reach.</p><p>So if you're looking to promote your ideas, market your brand, share your knowledge, sell your products, start an online channel or want to create video content for any reason at all - there's something in this course for you. <br></p><p>I bring a whole lot of passion to my work! I have a <strong>wealth of experienc</strong><strong>e</strong> in both <strong>Television </strong>and <strong>Coaching</strong>, and by combining these worlds, I'm able to give you a valuable toolbox of learning. I have so much belief in our potential as humans and nothing excites me more than seeing the people I work with really <strong>come alive</strong>, using all the gifts and potential they have to offer the world.<br></p><p>Here's to having the power to share your energy and ideas with ease and confidence, <strong>connecting with your perfect audience</strong> in every corner of the earth!</p><p>Let's do this!<br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Confidence on Camera - Master Your Presenting Skills", 
    "price": "20.00", 
    "instructors": "Mar Healy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597440_640b_2.jpg", 
    "course_url": "https://www.udemy.com/confidence-on-camera-master-your-presenting-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T15:03:08Z"
}