{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This is a 30 Minute Quick Course To Give You Some Very Valuable Information About Angels.  No Matter What Your Philosophy Or Outlook On Life Is.... </p><p>This course in informative - It is designed to give a quick lesson in something we all have heard of but never really think of very often. </p><p>Most people do not realize that we are all surrounded by heavenly angels and we often hear about angels in the media and through reference books, but if we wanted to know more than a simple definition - it would be difficult to know where to look for more information. </p><p>Angels help us through our lives and we will focus on our guardian angels and the archangels in this course.  Persons of all ages would enjoy the material presented in these lessons and you will also get a \"how-to\" demonstration of a simple way that anyone can receive guidance from angels. </p><p>What you will need to take this course will be a computer and about 30 minutes of time to view the video lessons.  There are no tests to take in this class and no homework assignments to complete - just enjoy.</p><p>So many people are reaching out to find more meaning in life. Having some current information about spiritual development will assist you in being more effective and successful in life.  If you are the type of person who is headed down a path towards new awakenings, and you want to follow your dreams to advance - take a big leap forward and connect to your angels. the knowledge gained will have a wonderful influence on all that you experience.....</p><p>Best Wishes,</p><p>Minister Kimberly </p>", 
    "end_date": null, 
    "title": "Connect To Your Angels", 
    "price": 0, 
    "instructors": "♥ Minister Kimberly Holmes ♥", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629742_6a48_8.jpg", 
    "course_url": "https://www.udemy.com/connect-to-your-angels-quick-course/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T17:48:43Z"
}