{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\"><em style=\"\">Do you have a Swedish partner or Swedish friends and would like to converse to them in their native tongue?</em></p><p style=\"\"><em style=\"\">Are you travelling to Sweden but would like to tour the country like a bona fide Swede instead as a tourist?</em></p><p style=\"\">Whatever your reasons are for learning basic Swedish conversation, this course is a relaxed way for you to reach your goal. </p><p style=\"\">The entire course is taught with slides with Swedish terms and English translations. Every slide is accompanied with a head shot video of me, <strong style=\"\">Åsa</strong>, your Sweden born-and-bred instructor. </p><p style=\"\">We start off by covering some grammar before moving onto <strong style=\"\">spoken conversation</strong>. We will express what we like and don&#039;t like, how old we are, where we are from, what we do for work, and various other bits of social conversation. </p><p style=\"\">We finish off by talking about Swedish food<strong style=\"\">,</strong> restaurant visit vocabulary and a small dose of Swedish culture. </p><p style=\"\"><strong style=\"\">The pronunciation and the use of phrases in this course is put together so you will sound like a native speaker. </strong>You will learn the spoken language, no textbook-style teaching where words and phrases don&#039;t match the real world. </p><p style=\"\">The lessons have <strong style=\"\">quizzes </strong>and <strong style=\"\">sketches </strong>in place to reinforce the new words that were just introduced. </p><p style=\"\">The bonus section has <strong style=\"\">extra material </strong>if you want to take your learning further. </p><p style=\"\">See you in lesson number one! Vi ses i lektion nummer 1! </p>", 
    "end_date": null, 
    "title": "Conversational Swedish", 
    "price": "20.00", 
    "instructors": "Åsa Purdy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433766_73d3_14.jpg", 
    "course_url": "https://www.udemy.com/conversational-swedish/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T04:45:23Z"
}