{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn to Count Cards and Make Money While Playing Ordinary Blackjack!</strong><br></p><ul><li>Learn the basic strategy foundation to playing good blackjack.</li><li>Learn to keep the count and use it to know when to strike!</li><li>Build easy skills that maximize your profit potential while reducing your risks.</li><li>Avoid common mistakes and pitfalls that have ended many a budding blackjack career.</li><li>Tailor your play and your technique to any sized bankroll and any beatable blackjack game (including multi-deck games!)</li></ul>  <p>Sure most of us have heard that Blackjack is a beatable game if you can count cards, maybe you heard it from a gambling buddy or from a grandparent like I did. Maybe you saw a movie or TV show which featured a genius card counter, maybe you heard about the MIT team or any other college teams who feature the best and brightest sticking it to the house.</p><p>You may even want to be them.</p><p>But to you, like me, card counting may have seemed out of reach. So many of us are not mathematical geniuses or even mathematically inclined. We may not have stacks of thousands per hand we'd be willing to lose or have a team of players to help us spot the good tables.</p><p>What I'm about to say may seem hard to believe, but <em>you need </em><em>NONE of the above to learn to count cards and make money.</em></p><p>I started out myself as an ADD arts major, better with words than with numbers and that's an understatement (I could barely count down the register at the gas station where I worked!) I was absolutely shocked at how easy it was to learn this lucrative skill and since then I've played all over the US for big bucks and even trained and managed a team of my own. I finally decided it was time to take these advantage player skills I was teaching people 1-on-1 and share them with the world.</p><p>  \t        This course will take you from being just another chump gambler, to beating casinos at their own game!  I will admit, this isn't for everyone.  Not everyone can handle practicing for a few minutes per day to build these skills, not everyone can handle the pressure of putting money out on the table even with an edge, and not everyone can maintain calm, cool, and collected while taking their big paydays.  Like I said, counting cards isn't for everyone, but <strong>EVERYONE</strong> can learn, and with this course you'll get the fast-track to success that I've developed over several years of research and experience to build my own blackjack career.  </p>", 
    "end_date": null, 
    "title": "Counting Cards for Long-Term Wins: The Simplified Way", 
    "price": "50.00", 
    "instructors": "Geoff Bowman", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288164_d4d3.jpg", 
    "course_url": "https://www.udemy.com/counting-cards-for-long-term-wins-the-simplified-way/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T13:40:50Z"
}