{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Most of us do not have the instinctive ability to always touch another in a way that transmits love, tranquility, security and awareness.  </p><ul style=\"\"><li style=\"\"><strong style=\"\">In the workshop you will learn how to adopt clear mutual listening </strong><strong style=\"\">that will strengthen your communication and improve your relationship</strong><strong style=\"\">.</strong></li><li style=\"\"><strong style=\"\">Learn how to create a pleasant and relaxing romantic atmosphere</strong><strong style=\"\">.</strong><strong style=\"\"></strong></li> <li style=\"\"><strong style=\"\">Practice meditation in pairs</strong><strong style=\"\">.</strong><strong style=\"\"></strong></li> <li style=\"\"><strong style=\"\">Learn massage techniques using base oils and stimulating aromatic oils.</strong></li> <li style=\"\"><strong style=\"\">Get important tips on improving relationship and mutual indulgence</strong><strong style=\"\">.</strong><strong style=\"\"></strong></li> <li style=\"\"><strong style=\"\">Graduates of the workshop report on more satisfaction in their relationship</strong><strong style=\"\">.</strong><strong style=\"\"></strong></li></ul>  <p>  \t  Through this online short course, Naama takes you on a journey with your partner and shows you step-by-step and technique-by-technique how to perform a massage that will connect you on a deeper and more secure level.  </p>  <p>  \t  The massage routine is broken into various stages to make it easier to grasp. The course is an introduction to couple massage and it takes about half an hour to complete its viewing. It gives the basis of couple massage, a way to get you started. These basics will be your guideline for ever: from the beginning, when you might only do an half hour massage to your partner, through the more advanced stage, where you will be able to give and receive a full, loving massage to your partner. </p>", 
    "end_date": null, 
    "title": "Couples Massage Workshop", 
    "price": "20.00", 
    "instructors": "Naama Nir", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390632_decf_3.jpg", 
    "course_url": "https://www.udemy.com/couples-massage-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T19:47:09Z"
}