{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Critical Thinking is an introduction to the theory and practice of reasoning. At its core, critical thinking involves the application of both formal and informal tools of reasoning to what we read and interpret as well as what we write and produce. Critical thinking, however, is more than a one size fits all application of abstract logical principles, but requires we think effectively and holistically, stripping way what is superfluous to find the logical core of a situation. It is more of an art than a science and draws as much from intuition as from intellect, requires creativity as much as calculation. </p><p style=\"\"> This course will instruct the students in the fundamental themes and concepts of critical thinking, which include: (1) distinguishing premises and conclusions; (2) recognizing fallacies; (3) analyzing argumentative form (4) considering the truth of premises. The method by which this course proceeds is to allow students to develop incrementally the skills required to be critical thinkers. First, this course examines the use of language to formulate arguments and provides methods for analyzing genuine arguments in their richness and complexity, stressing the need to restructure arguments in order to discern their true argumentative form. Next, the course discusses and uncovers the use of fallacious reasoning patterns. Finally, this course suggests strategies, both formal and informal, for analyzing and criticizing arguments, focusing in particular on the notion of validity, the central concept of all reasoning<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Critical Thinking and Politics", 
    "price": 0, 
    "instructors": "Peter Vernezze", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177568_5198_4.jpg", 
    "course_url": "https://www.udemy.com/critical-thinking-and-politics/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-05T23:34:49Z"
}