{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <em>\"<strong>This is the most inspiring course on Udemy!</strong> Impressive teacher, up to date resources, great structured course, everything you need to start with crowdfunding, but the way Kristen has done this sort of crowdfunding over the last ten years... That story alone is worth taking the course. Thanks, Kristen, for your work and for your course!\" -Anneke Camstra</em></p>\n\n<p><strong><strong><br></strong></strong>  </p>\n\n<p>  \t <strong></strong>Can one ordinary person create a massive wave of positive change by generating support and cash donations to the people and communities who need it most?<strong> This easy to follow crowdfunding course is here to answer with a big resounding YES!</strong>  </p>\n\n<p>  \t                                              If you, a loved one, a family, a community, a cause, or a charity you care about is in urgent need of support and funding, you have come to the right place to <strong>learn simple and effective crowdfunding techniques so that you can begin raising money right away.</strong>  </p>\n\n<p>  \t                                                             This course will empower YOU to plan, create, and manage  your first successful online fundraising campaign even if you have no previous crowdfunding experience and no idea where to start!  </p>\n\n<p>  \t <strong>What Students Are Saying  \t </strong>  </p>\n\n<p>  \t <em>\"<strong></strong>Inspiring! I love a course that backs up what they teach with real-world examples and this course does just that. Kristen's experience with her own fund-raising efforts allows her to speak with authority about the various approaches to fund-raising online. If you are thinking about starting a fund-raising campaign to support a favorite cause, this course will certainly point you in the right direction.\"</em> -Deborah Wojcicki</p>\n\n<p>  \t                                                           I'm just one ordinary person that has been fortunate enough to also<strong> raise over $100,000+ for needy children in developing countries</strong> through my online grassroots project,<em> Aura's House</em> as well as additional thousands for my University students through online crowdfunding platforms. My fundraising techniques are so simple, anyone can follow my crowdfunding formula and have similar results.  </p>\n\n<p>  \t                                                           I'm an artist, a college professor, a mother, a wife, an expat navigating life in a foreign country, and an all around busy person with A LOT on my plate and yet all of my fundraising activities have been done in my so-called spare time. My goal is to share what I've learned over the past decade about online fundraising and crowdfunding so that <strong>you can</strong> <strong>get started making an impact quickly, efficiently, and powerfully in just a few hours.  </strong>  </p>\n\n<p>  \t                                                      In this course I share my very best tips and advice so that you can begin collecting donations right away for your loved one, community, or cause that you care about through a carefully planned and executed online crowd funding campaign.  </p>\n\n<p> I'm a tenured Associate Professor of Digital Media at The American University of Rome and have over 15 years of experience teaching students all over the world using my tried and true custom approach (turning complex information into something simple, memorable, easy-to-understand in as short amount of time as possible) to ensure that <strong>you get the most important, relevant, and useful information that can be applied immediately.</strong><br></p><p>New bonus lectures and resources will continue to be added and friendly and supportive crowdfunding advice will be provided in the discussion forum. I love to help  and always respond to inquiries and discussions ASAP.  </p>\n\n<p> <strong></strong>Please Note: Students enrolled in ANY of my courses periodically receive freebies and discounts to my other current and upcoming courses as well.<br></p><p>.</p><br><p>  \t                                                                                      You have a 30-day, 100% money-back  guarantee with no questions asked so  you have nothing to lose. I make  myself available so you will have  access to me if you have questions or  need specific feedback along the way.  </p>\n\n<p> Come and begin making positive change now by enrolling in this top crowdfunding course and join our growing learning community!<strong> Click the \"Take This Course\" button in the upper right corner and let's get started generating support and donations for you and your cause today.</strong></p>", 
    "end_date": null, 
    "title": "Crowdfunding Confidential: Easy Ways to Boost Fundraising", 
    "price": "30.00", 
    "instructors": "Kristen Palana", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383034_0e77_7.jpg", 
    "course_url": "https://www.udemy.com/how-i-raised-100k-for-charity-with-no-fundraising-experience/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T13:45:38Z"
}