{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Price increases June22.<strong style=\"\"></strong></p><p><strong style=\"\">Are you:</strong></p><ul style=\"\"><li>amazed at the millions raised rapidly though record-breaking crowdfunding campaigns,</li><li>looking to know the secrets for success, </li><li>a for-profit or nonprofit company, </li><li>an entrepreneur or an individual,</li><li>working on a project, product or service that needs funding? </li></ul> <p>If so, this course is for you! There are 4 key secrets behind all successful crowdfunding campaigns that are crucial for you to know and use to join those who surpass their goal.</p><p><strong style=\"\">Learn:</strong></p> <ul style=\"\"><li>why crowdfunding is replacing old, difficult to navigate banks and investors,</li><li>the different types of crowdfunding, </li><li>the 20/30/50 Rule and how to apply it to your campaign,</li><li>how to set the right goal (it&#039;s NOT what you think),</li><li>which of the thousands of crowdfunding platforms is right for you,</li><li>how to build the right team,</li><li>how to design exciting campaign content,</li><li>how to brings in sales and keep the traffic coming,</li><li>when to use PR and how,</li><li>the secret sauce for all successful crowdfunding campaigns.</li></ul> <p>What you need:</p><ol style=\"\"><li>a computer,</li><li>willingness to listen, take notes, learn,</li><li>determination to follow the steps and NOT take shortcuts,</li><li>2 hours of focused time to watch the videos (you can watch in shorter segments of time),</li><li>persistence to apply what you learn. </li></ol>This course is the basis from which you can design and manage a great campaign PLUS develop a foundation for your success long-term. These basics help you understand and build your market as well as establish best practices to carry forward into your business.<p>Other courses provide valuable hacks and techniques to use, but this course provides the strategy and long-term foundation for your success. Master these basics, and you will meet and beat your goals.</p>", 
    "end_date": null, 
    "title": "Crowdfunding Startups and Nonprofits: 4 Keys to Success", 
    "price": "50.00", 
    "instructors": "Robin Eschler", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510364_1091_2.jpg", 
    "course_url": "https://www.udemy.com/successful-crowdfunding-4-key-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-24T19:26:30Z"
}