{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Este curso de ofrece las principales herramientas para comenzar tu aprendizaje en el mundo de la Gemoterapia. Lejos de dogmas y cualquier tipo de religión, ofrecemos educación, recetas, consejos y rutinas para ampliar y acelerar el proceso de transformación y equilibrio que el ser humano debe vivir. </p><p style=\"\">Al completar mi curso los estudiantes serán capaces de aprender que la gemoterapia es una solución para re-establecer el equilibrio natural del ser humano porque las gemas contienen una composición de minerales y otros compuestos que producen energía vibracional o oscilaciones que impactan el campo electromagnético del ser humano. </p><p style=\"\">Este curso es para todos aquellos entusiastas de temas esotéricos, así como, temas de moda, estilo y salud porque podrán incluir la gemoterapia como un arte para modificar las frecuencias de vibración del ser humano, colocando gemas en el cuerpo. </p><p style=\"\">¿Cómo es posible? Todo lo que ves está formado por átomos y los átomos, tienen cargas positivas, neutras y negativas, sujetas a las leyes de magnetismo. Los minerales y su vibración son capaces de influir en las energías que los rodean. Si vistes una gema, el magnetismo de sus átomos influirá en las frecuencias de luz y color en tu cuerpo, modificando esa energía según la gema usada, lo cual transforma y equilibra. </p><p style=\"\">Por eso cuando acercamos las gemas (con sus composiciones de minerales particulares) a nuestro cuerpo y nuestro campo electro-magnético, sus formas geométricas y sus colores actúan como verdaderos catalizadores de energía. </p><p style=\"\">Para este curso, los estudiantes no necesitarán ningún tipo de material para conocerlo básico ya que es una guía para comenzar en el mundo de la gemoterapia. </p>", 
    "end_date": null, 
    "title": "Curso completo de terapia con cristales: moda para sanar.", 
    "price": "50.00", 
    "instructors": "Zayra Mo", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471882_01b6_4.jpg", 
    "course_url": "https://www.udemy.com/mejora-tu-salud-y-resalta-tu-belleza-con-la-gemoterapia/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T13:02:10Z"
}