{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">¿Tener tus conversaciones y mensajes de WhatsApp siempre a mano, en cualquier dispositivo? </strong>  </p>  <p style=\"\">  \t<strong style=\"\">¿Controlar todas tus nubes, redes sociales y sitios web desde un mismo entorno online? </strong>  </p>  <p style=\"\">  \t<strong style=\"\">¿Automatizar tareas como envío de emails, subir fotos, autoguardado de seguridad?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">  ¿Imprimir documentos desde tu smartphone?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">  ¿Tener todos tus archivos en todos tus dispositivos a la vez?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">  ¿Compartir carpetas enteras o archivos de manera simultánea?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">¿Autoguardar las fotos de tu móvil para tenerlas al instante en todos tus dispositivos?</strong>  </p>  <p style=\"\">  \t              Todo esto y más de cien utilidades que ni siquiera te imaginas aprenderás en este curso que gira en torno a la utilización de Dropbox.  </p>  <p style=\"\">  \t              Las nuevas tendencias, los nuevos modos de trabajo, la capacidad de trabajar online y los nuevos perfiles laborales demandados por las empresas y entidades, hacen que realizar este &quot;<em style=\"\">Curso Dropbox, utilidades inimaginables de la nube&quot;</em>, sea una formación de increíble utilidad para adquirir las aptitudes necesarias para controlar y agilizar de manera eficaz nuestro trabajo diario o nuestros archivos personales.  </p>  <p style=\"\">  \t              El curso se desarrolla en su mayoría a través de videotutoriales, existiendo 5 cuestiones al final de cada sección que ayudarán a asimilar los conceptos esenciales.  </p>  <p style=\"\">  \t            Las dos primeras secciones están centradas en el uso de Dropbox desde el principio, es decir, quien tan siquiera haya escuchado hablar de esta herramienta aprenderá a usarla desde su instalación.  </p>  <p style=\"\">  \t            Avanzaremos por las fuciones básicas de Dropbox: compartir archivos, crear links, compartir carpetas, activar la carpeta &quot;Public&quot;...  </p>  <p style=\"\">  \t            Las dos siguientes secciones están destinadas a dos herramientas que, para quien no las conozca, abrirá un campo de infinitas posibilidades y optimizará de manera sobresaliente el trabajo realizado tanto en el entorno laboral como personal. Se trata de IFTTT y ZeroPC. Dos grandiosas, potentes, versátiles y GRATUITAS herramientas online que nos simplificarán la vida de una manera inimaginable. La primera de ellas para automatizar tareas, permitiendo que se ejecuten de manera automática, sin que tan siquiera tengamos que tener encendido nuestro ordenador, acciones como enviar emails, subir fotos a las redes sociales, publicar post en nuestro blog, descargar vídeos, sincronizar nuestras nubes... y mil posibilidades más.  </p>  <p style=\"\">  \t            La segunda de estas herramientas, ZeroPC, nos ofrecerá la solución definitiva para gestionar todas nuestras nubes, redes sociales y correos desde un mismo entorno online, como si de un sistema operativo virtual se tratase.  </p>  <p style=\"\">  \t            La última de las secciones es la más sorprendente. En ella encontrarás más de cien utilidades, programas y herramientas que, unidas a dropbox, simplemente facilitará su vida y abrirá las puertas para que conozca las posibilidades que las Nuevas Tecnologías de la Información y la Comunicación le ofrecen.  </p>  <p style=\"\">  \t            Dada la naturaleza de esta última parte, el material que se acompaña es a través de archivos PDF en los que se encuentran la lista de herramientas con los enlaces directos a las mismas.  </p>  <p style=\"\">  \t   En total, más de 20 horas de formación entre videotutoriales y documentación en texto, que le proporcionarán las habilidades y herramientas necesarias para optimizar al máximo la utilización de todas sus redes, nubes y espacios web.  </p>", 
    "end_date": null, 
    "title": "Curso Dropbox, utilidades inimaginables de la nube", 
    "price": "20.00", 
    "instructors": "Toharia Villarte", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170278_0c0d_5.jpg", 
    "course_url": "https://www.udemy.com/curso-dropbox-utilidades-inimaginables-de-la-nube/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T17:03:43Z"
}