{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tAdéntrate de una forma fácil y directa en la Realidad Virtual de la mano de Oculus Rift y Unity3D. Gracias a este curso dominaras las técnicas necesarias para un correcto diseño y desarrollo para la Realidad Virtual.  </p><p><strong>-*Certificado Profesional Linkedin al concluir el Curso (con codigo exclusivo).-Actualizaciones Gratuitas de por vida ( 3 actualizaciones al año garantizadas).-Tutorizamos a todos los alumnos, resolvemos tus dudas. </strong></p><p>\"La realidad virtual es la oportunidad que estabas buscando para darle valor a tus proyectos e innovar.\"</p><p>\"Descubre de la mano de Fernando Sierra todo un mundo por explorar y una nueva forma de ver y sentir lo audiovisual.\"</p><p>El uso depurado del HMD Oculus Rift no tendrá secretos para ti y lograrás mucha más calidad a la hora de presentar tus productos y desarrollos. No pierdas la oportunidad, la Realidad Virtual esta aquí para quedarse y este curso te proporciona todo lo necesario para triunfar como profesional.</p>  <p>  \tQué aprenderás:  </p>  <p><em>  \t-Pasado, presente y futuro.  </em></p>  <p><em>  \t-Motor de diseño y desarrollo, periféricos para al Realidad Virtual.  </em></p>  <p><em>  \t-Instalación y configuración de nuestro Workspace.  </em></p>  <p><em>  \t-El diseño, parte fundamental.  </em></p>  <p><em>  \t-Usos de los SDK y desarrollo de nuevos asset´s.  </em></p>  <p><em>  \t-Creación de proyecto ejemplo.  </em></p>  <p><em>  \t-Distribución y posicionamiento de nuestros proyectos.</em>  </p><p><em>\"Rompe la barrera y descubre todo lo que ofrece la realidad virtual, pronto todo el mundo hablara de ello.\"</em></p><p><strong>¿Que es la realidad Virtual y por qué es el FUTURO?</strong></p><p>La Realidad Virtual de la mano de Oculus, empresa que lo desarrolla, está en <strong>plena expansión y pronto llegará a todo los hogares</strong> de forma estándar. Esto va a ser posible gracias a la inversión de más de <strong>2.000 millones de dólares por parte de inversores tan importantes como “FACEBOOK\"</strong>. Esta prevista su <strong>comercialización a nivel mundial</strong> para el último trimestre del 2015 con una aceptación y pre-reservas de los diferentes periféricos nunca vistas. Ha sido premiado en el año 2014 como <strong>mejor producto tecnológico</strong> por encima de dispositivos como el nuevo “Iphone\" de Apple. </p><p><strong>Brainside es empresa pionera en España</strong> y lleva más de <strong>2 años desarrollando y estudiando tecnología VR</strong>. Estamos en estrecha relación con directivos de la empresa Oculus Rift y poseemos todas las herramientas para concluir con éxito cualquier proyecto relacionado con VR (realidad virtual). </p>", 
    "end_date": null, 
    "title": "Curso de Realidad Virtual : Diseña y Desarrolla con Unity3D", 
    "price": "45.00", 
    "instructors": "Fernando Sierra Sanchez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397546_a0ee_3.jpg", 
    "course_url": "https://www.udemy.com/disena-y-desarrolla-para-la-realidad-virtual/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T22:25:37Z"
}