{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Este curso está diseñado para prepárate para tomar el examen de certificación profesional en Revit Architecture 2015 </p>\n\n<p>La Certificación Profesional en Revit Architecture 2015, es una excelente manera de medir cuantitativamente el desempeño en Revit así como revisar a detalle algunas estrategias especificas recomendadas para obtener el máximo beneficio de la paquetería.</p>\n\n\n\n<p>Este curso te guiara específicamente sobre los temas de evaluación con preguntas similares a las que tendrías que resolver en el examen de certificación de Revit Architecture 2015</p>\n\n\n\n<p>El uso de este curso de preparación considera que has utilizado Revit alrededor de 400 hrs y que conoces la funcionalidad de Revit 2015, ya que no es un curso sobre Revit, es un curso de simulación de un examen similar al que tendrás que aprobar.</p>\n\n\n\n<p>El examen oficial consiste en 35 preguntas de las cuales necesitas contestar adecuadamente 32 de ellas para aprobar, el tiempo límite es de 2 hrs 40 min, y mi recomendación personal es solicitarlo en Ingles para evitar ambigüedades en los términos técnicos.</p>\n\n\n\n<p>Este Curso cuenta con una breve explicación del tema para repasarlo, y un examen por tema con una pregunta similar a la que vendría en el examen.</p>\n\n\n\n<p>Todas las preguntas son de opción multiple aunque en el examen podras encontrar preguntas de escribir valores, seleccionar una imagen, etc.</p>\n\n\n\n<p>¿Estás cansado de tomar cursos que van demasiado rápido o que tienen demasiado contenido? No te preocupes, sabemos que tú lo que buscas es obtener rápidamente resultados. “Salta entre las secciones, repite cuantas veces necesites las clases y los ejercicios del curso\"...El acceso al curso es vitalicio por parte de Udemy lo cual significa que puedes utilizarlo cuando necesites, y con subscripción a sus anuncios, entérate de las novedades y ten al alcance de tu mano cualquier actualización del curso. Cuenta con foros de discusión en donde podremos mejorar el curso y obtener el mejor beneficio de éste.</p>\n\n\n\n<p>Cuenta con foros de discusión en donde podremos mejorar el curso y obtener el mejor beneficio de éste.</p>\n\n\n\n\n\n<p>Además serás el primero en enterarte de futuros cursos por parte de Mag Architecture &amp; Technology Solutions S. A. de C.V. aprovecharás las oportunidades de futuros cursos, y garantizarás mantenerte al día con los conocimientos necesarios para destacar en tu trabajo, y conseguir mejores posiciones laborales y profesionales.</p>", 
    "end_date": null, 
    "title": "Curso para Certificación Profesional Revit Architecture", 
    "price": "20.00", 
    "instructors": "Enrique Galicia", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/716296_adfb_2.jpg", 
    "course_url": "https://www.udemy.com/certarch/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T23:46:54Z"
}