{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>VirtualBox es una potente herramienta de virtualización</strong> que nos permite instalar y ejecutar sistemas <em>huésped </em>dentro de nuestro sistema operativo <em>anfitrión</em>.</p><p>En la práctica, esto significa que podemos ejecutar (por ejemplo) Windows en nuestro equipo y, a la vez, estar ejecutando de forma virtual e independiente cualquier distribución Linux, Solaris, BSD, u otros.</p><p><strong>VirtualBox</strong> no solo permite instalar una gran variedad de máquinas virtuales, sino que también está disponible para ejecutarse desde diferentes plataformas (o \"anfitriones\") aparte de Windows, como Mac OS o Linux, por lo que las combinaciones son bastante amplias.</p><p>Y por si esto fuera poco, ¡VirtualBox se distribuye de forma gratuita!</p><p><strong>En este curso</strong> el alumno llegará a entender lo que es una máquina virtual, las ventajas e inconvenientes de estas y, por supuesto, a instalar y configurar las suyas propias. Todo <strong>desde un nivel inicial sencillo, hasta llegar a manejar esta herramienta con soltura y a un nivel profesional</strong>.</p><p><strong>¡Más de 2 horas de vídeo!</strong> y documentación adicional.</p><p>Para hacerlo más didáctico, el curso cuenta con infinidad de <strong>ejemplos prácticos</strong>: veremos <strong>cómo instalar las máquinas virtuales más comunes</strong>, aprenderemos a <strong>configurar nuestras máquinas de forma avanzada</strong>, y veremos el caso práctico de un desarrollador que trabaje en Windows para entornos Linux (<strong>LAMP</strong>).<br></p><p>El alumno contará con varios <strong>exámenes </strong>para poner a prueba sus conocimientos, así como <strong>resúmenes </strong>al final de cada sección para repasar los conceptos más importantes.</p><p>Para realizar este <em>Curso de VirtualBox</em> <strong>no se necesitan conocimientos técnicos específicos</strong>, ya que se explicarán todos los conceptos, <strong>desde un nivel inicial sencillo</strong>, evolucionando <strong>hasta llegar a un nivel avanzado</strong> de manejo de la aplicación.<br></p>", 
    "end_date": null, 
    "title": "Curso de VirtualBox", 
    "price": "20.00", 
    "instructors": "David Gutiérrez", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569106_d6a5_2.jpg", 
    "course_url": "https://www.udemy.com/curso-de-virtualbox/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T10:11:46Z"
}