{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tIf you receive lots of e-mail and demands on your time, this course shows you 7 proven ways to get back full control of your e-mail - and create more time for the high value tasks.  </p>  <p>  \t·Just using the ‘One-Touch Inbox’ technique can HALVE the time you’d normally take.  </p>  <p>  \t·‘Batching’ and other great techniques reduce the stress associated with overload.  </p>  <p>  \t·The difference that the times of day when you handle e-mail can make to concentration  </p>  <p>  \tThe video demos are done in MS Outlook 2010 - but it doesn’t matter which software you use, the course gives you proven techniques to reduce the time spent with e-mail. And you’ll get more mileage out of whatever system you use now.  </p>  <p>  \tOne third of office workers suffer from ‘e-mail stress’. It’s even been called a plague. We’re not just overwhelmed by the volume of e-mail but we lose focus on the productive activities of our jobs. The ‘7 Keys To E-mail Control’ help you to actually be more focused and to be able to spend time on the things that move your job, and the business, forward.  </p>  <p>  \tAccording to the BBC Money Programme people can spend up to half the working day going through the inbox!  But not if you follow the 7 Key principles outlined in this course. You’ll not only shave hours off the time you spend with e-mail, you’ll get precious time and energy back for yourself.  </p>  <p>  \tIt comes with a workbook which gives you a rapid overview of the 7 Keys and then goes on to  explain the theory behind it all – after you’ve made some immediate gains from the 12 short, 5 minute videos.  </p>  <p>  \tIf it’s important to you or your team to handle e-mail volumes better and faster and with less effort so you can concentrate on the big issues that count, this is the right course for you.  </p>", 
    "end_date": null, 
    "title": "Cut the Time E-mail Steals from You by Half", 
    "price": "35.00", 
    "instructors": "7 Keys Solutions", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36090_8d0c_10.jpg", 
    "course_url": "https://www.udemy.com/7keys-to-e-mail-control/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-14T14:05:03Z"
}