{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">Let&#039;s face it - life on the Internet means <strong style=\"\">usernames and passwords (accounts)</strong>!<em style=\"\"> Lots</em> of them in fact!</p><p style=\"\">Stop and think about it for a moment.  How many sites do you login into daily, weekly, or monthly?</p><ul style=\"\"><li style=\"\">Social media: Facebook, Twitter, Snapchat, Skype, Pinterest, Instragram, Youtube...</li><li style=\"\">Ecommerce: Amazon, eBay, Overstock, Newegg, Target, Walmart...</li><li style=\"\">Online Banking: Paypal, Bank Of America, Wells Fargo, Sun Trust, Charles Schwab...</li><li style=\"\">Email: Gmail, Yahoo! Mail, Hotmail, your ISP email...</li><li style=\"\">Gaming: Xbox Live!, Playstation, Wii, Steam....</li></ul><p style=\"\">The above list is only a<em style=\"\"> <strong style=\"\">small sample</strong></em> of sites you probably use on a regular basis.  In fact many people have over one hundred accounts and that list is growing all the time!</p><p style=\"\">How do you keep track of all this information?</p><ul style=\"\"><li style=\"\">Use the same few passwords among your accounts</li><li style=\"\">Keep a spreadsheet</li><li style=\"\">Write them down on paper</li><li style=\"\">List them on a word processing document</li><li style=\"\">Stick notes on your monitor</li></ul><p style=\"\">Unfortunately none of those are good practices.  That&#039;s right - none of them.  For the best security you should have a<strong style=\"\"> different password </strong>for every account (site)!  These passwords should also be stored in an encrypted and safe manner.</p><p style=\"\">Now why should you use a different password? You have heard of massive data breaches haven&#039;t you? Where cyber criminals steal thousands, hundreds of thousands, or even millions of account information?  It has happened to many sites including Adobe, eBay, Twitter, and many many others.</p><p style=\"\">If your Twitter and bank passwords are the same and the cyber criminals steal your Twitter password, guess what? They could now potentially access your bank account! That would be a nightmare.</p><p style=\"\">So every account on every site should have a unique password.  After all, the username is usually your email address so in most cases your account is only protected by your password.  However, there is more to this puzzle.</p><p style=\"\">You should make your password as difficult for the cyber criminals to guess as possible.  That means quit using <strong style=\"\">video123</strong> and use something like <strong style=\"\">R-&#039;hJ@y|11_b@i&amp;U%RfB-z`J7ZF0d&quot;:blJg&quot;ksUg</strong> which is far more secure.</p><p style=\"\">Now you are probably wondering: how in the world do I have a unique long password for every site and easily keep track of all this information? Well, you are in the right place.  That is the whole point of this Udemy course.</p><p style=\"\">Your instructor, Jeremy O&#039;Connell, will explain with videos how you secure your digital accounts and better protect yourself from cyber criminals.  So the next time when you hear on the news   of some site being hacked and millions of accounts being stolen you will know your accounts are safe and changing that site&#039;s password is no big deal.</p><p style=\"\">What are you waiting for?! This course is even <strong style=\"\"><em style=\"\">free,</em></strong> so put away your wallet!</p>", 
    "end_date": null, 
    "title": "Cyber Criminals Want Your Information: Stop Them Cold!", 
    "price": 0, 
    "instructors": "Jeremy OConnell", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434398_5966_2.jpg", 
    "course_url": "https://www.udemy.com/not-another-password/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T19:31:45Z"
}