{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<em>Una buena presentación dice de su autor la creatividad que tiene, que le gusta las cosas bien hechas, el aprecio y respeto que tiene por su público.</em>  </p>  <p>  \t<strong>Crea presentaciones y videos animados en Powtoon</strong> es un curso pensado para todos los que necesitan darle un toque profesional a sus presentaciones. Hoy más que antes necesitas destacarte.  </p>  <p>  \t        ¿Y si complementas tus presentaciones con un video original hecho por ti con un aspecto completamente profesional? Suena bien, ¿verdad? Powtoon es una aplicación para crear presentaciones animadas y videos con aspecto profesional. ¡Imagina tener un video que hable por ti! Powtoon lo hará posible en pocos pasos. En este curso aprenderás todo lo que necesitas saber para sacarle el mejor provecho a las herramientas de Powtoon.  </p>  <p>  \t              ¿Estas en la escuela? Este curso te dará las herramientas para sacar una buena calificación en tus presentaciones.  </p>  <p>  \t              ¿Estas en la universidad? Este curso es ideal para ti. Lograrás que el catedrático quede encantado con tus presentaciones.  </p>  <p>  \t              ¿Necesitas expresar tus ideas entre tus jefes y compañeros de trabajo? Este curso te hará destacar.  </p>  <p>  \t           ¿Estás nervioso por la presentación de ventas que necesitas hacer? Tranquilo, darle un toque profesional a tus presentaciones te hará ver muy bien.  </p>  <p>  \t<strong>Crea presentaciones y videos animados en Powtoon</strong> es un curso que te enseñará a utilizar esta poderosa herramienta para que todas tus presentaciones queden fabulosas.  </p>  <p>  \t            En este curso aprenderás:  </p>  <ul>  \t<li>A crear un original video con aspecto profesional que podrás utilizar para tu blog, website, presentaciones en PowerPoint, Prezi o simplemente utilizarlo por sí solo para que a través de él puedas expresar todas tus ideas.</li>  \t<li>A crear una fabulosa presentación que podrás usar en tus conferencias y destacarte ante los demás.</li>  \t<li>A utilizar cada una de las herramientas que Powtoon te proporciona para que puedas usar esta plataforma con mucha comodidad.</li>  </ul>  <p>  \t        Hacer una buena presentación puede ser la diferencia entre lograr una venta o no lograrla, lograr un ascenso o no lograrlo, obtener una buena calificación o no obtenerla.  </p>  <p>  \t           Los requisitos de este curso son:  </p>  <ul>  \t<li>Contar con una conexión a internet para acceder a Powtoon.</li>  </ul>  <p>  \t    Con este curso obtendrás:  </p>  <ul>  \t<li>¡20 clases y 1.5 horas de contenido!</li>  </ul>  <p>  \t            ¡Este curso te encantará, bienvenido(a)!  </p>", 
    "end_date": null, 
    "title": "Cómo hacer una presentación efectiva en Powtoon", 
    "price": "20.00", 
    "instructors": "Profesor [24]7", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/264882_ee6f_4.jpg", 
    "course_url": "https://www.udemy.com/crea-presentaciones-y-videos-animados-en-powtoon/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-20T02:17:15Z"
}