{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>¿Necesitas mejorar tu forma de crear presentaciones?</strong>, ¿Estás cansado de presentaciones lineales y previsibles que aburren a la audiencia? ¿Quieres sorprender a tus compañeros con presentaciones dinámicas?<br></p><p><strong>Con este curso impresionaras a todos con presentaciones sorprendentes, aprenderás a realizar presentaciones dinámicas y con Zoom y rotaciones que mantendrán a tu audiencia atenta e interesada desde el primer al último minuto.</strong></p><p><strong>Prezi es un programa Gratuito</strong>, sin necesidad de instalación y fácil de utilizar que te premite realizar presentaciones profesionales sin necesidad de ser informático o saber programar o utilizar programas complejos. </p><p>En este curso aprenderás paso a paso, en  11 secciones con 32 lecciones y más de 2 horas y media de video, desde cómo abrir una cuenta en Prezi a cómo compartir tus presentaciones una vez finalizadas.</p><p>Tendrás además:</p><ul><li>Acceso a las lecciones para siempre.</li><li><strong>Actualizaciones</strong> constantes cada vez que Prezi implemente nuevas funcionalidades o cambie algún aspecto del programa</li><li>Sistema de <strong>tutorización</strong> constante, para responder todas tus dudas y ayudarte a mejorar tus presentaciones</li><li>Todo ello incluido en su.... reducido Precio!!! </li></ul><strong>Aprende a realizar Presentaciones que sorprendan y por las que seras felicitado en tu trabajo o en tus estudios.</strong><p>Mejorar está en tus manos!!!</p>", 
    "end_date": null, 
    "title": "Cómo crear presentaciones dinámicas fácilmente con Prezi", 
    "price": "20.00", 
    "instructors": "KtoolsAcademy KTA", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36945_f2c3_5.jpg", 
    "course_url": "https://www.udemy.com/curso-prezi/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-19T14:46:11Z"
}