{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t        Learn the vocabulary, grammar and communication skills you need to become a confident Danish speaker.  </p>  <p style=\"\"><strong style=\"\">There are many good reasons for wanting to learn Danish:</strong></p>  <ul style=\"\">  \t<li style=\"\">Are you planning a trip or a move to Denmark?</li>  \t<li style=\"\">Do you want to master everyday situations with Danish speakers?</li>  \t<li style=\"\">Do you wish that you were able to speak with your Danish family and friends? </li>  \t<li style=\"\">Would you like to better honor your Danish heritage?</li>  \t<li style=\"\">Are you curious about the Danish language?</li><li style=\"\">Do you want to develop or improve your Danish reading, writing, speaking and listening skills?</li>  </ul>  <p style=\"\">  \t        No matter your reasons for wanting to learn Danish, this course is the perfect starting point. It covers all four basic skills: speaking, listening, reading and writing, and you can enjoy the freedom and flexibility to learn in your own home or on the go.  </p>  <p style=\"\"><strong style=\"\">Course Structure:</strong></p>  <p style=\"\">  \t        Learning a language takes commitment and exposure, but it doesn&#039;t have to be hard and tedious work. However, it does require a structured approach and consistency.  </p>  <p style=\"\">The course is divided into 7 weeks to provide structure and allow you time to absorb the topic of each lecture without sacrificing the pace of the course. Every week consists of 3 video lectures, with supplementary materials that reinforce the concepts you have learned. </p>  <p style=\"\">  \t        You are welcome to work your way through the course faster or slower than the suggested 7 weeks. However, make sure that you move at a fast enough pace to allow you to retain what you have learned, and slow enough that you have time to internalize what is being taught and commit it to your long-term memory.  </p>  <p style=\"\">  \t        My goal with this course is for you to learn Danish and be able to use it when you are done! </p><p style=\"\">Additionally, since Danish is one of the Scandinavian languages it is very similar to both Swedish and Norwegian. Taking this course will thereby not only help you be able to communicate with native Danes, but also with most Swedes and Norwegians. </p>  <p style=\"\">  \t<strong style=\"\">This is what you can expect:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">7 weeks of engaging learning material, including videos, texts, tests and other exercises.</li>  \t<li style=\"\">22 lectures and over 2 hours of video content.</li>  \t<li style=\"\">Simple, fun and easy-to-understand lectures.</li>  \t<li style=\"\">Captivating exercises that let you test your comprehension.</li>  \t<li style=\"\">Considerable vocabulary training and grammar instruction to build your conversational skills.</li>  \t<li style=\"\">A 30-day full refund guarantee, no questions asked.</li>  \t<li style=\"\">And last but not least… to learn Danish!</li>  </ul>  <p style=\"\"><strong style=\"\">Are you ready? Enroll in this course and start your Danish journey today!</strong>  </p>", 
    "end_date": null, 
    "title": "Danish for Beginners", 
    "price": "40.00", 
    "instructors": "Kristine Andersen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396004_ea7a_5.jpg", 
    "course_url": "https://www.udemy.com/danish-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-16T19:21:55Z"
}