{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>We are living in a digital world, all our information are now digital, our photos are small icons inside some folder, our Documents are PDFs and Docs here and there, our baby might finish his first year without taking a single film photo.</p>\n\n<p>To keep a photo safe in the 80s, you'll place it in a neat album and hide this album in a cabinet, you'll keep you documents in your elegant Samsonite briefcase and \"encrypt\" it with a PIN, to make sure nobody will be able to read a note you made, you'll spend the afternoon shredding it into smaller and smaller pieces, so that no one can \"recover\" it.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>Well, everything is now digital as I said, and this course will guide step by step to mange your data the right way.</p>\n\n\n\n<p>This course is for everybody, literally anybody, if you can see this message, you can, and you will benefit from this course, if you want to:</p>\n\n\n\n<ul><li>Recover/Undelete lost/deleted data.</li><li>Prevent your data from being lost/deleted.</li><li>Find out what options you have to keep your data backed up</li><li>Safely delete sensitive data without worrying about the possibility of getting it back by the wrong people</li><li>Encrypting your data to ensure you're the only one who can access it.</li></ul>\n\n\n\n<p>If these points are important to you, or at lease one of it, then you've came to right course, go ahead, get the course and let's start this journey together.</p>", 
    "end_date": null, 
    "title": "Data Management, Recovery, Backup, Shredding & Encryption", 
    "price": "20.00", 
    "instructors": "Hazem Salam, IT Manager Waleed Abdeen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/727914_3642_4.jpg", 
    "course_url": "https://www.udemy.com/data-recovery/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T12:39:27Z"
}