{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Data Warehousing and Business Intelligence for Managers prepares you for the many data warehousing projects that are underway or scheduled to begin in both federal and private organizations. It's also an entryway into Big Data. If you've heard of data warehousing but never knew what it meant, this is the course for you. Have you always wanted to know what kind of eneterprise software is made by Oracle, SAP, Informatica, Tableau, SAS, and even Microsoft?  The answer is Data Warehousing and Business Intelligence software, two categories of software that can even include one thing you probably have on your latptop right now: Microsoft Excel.  </p><p>The course is geared towards managers, but is also effective for non-techies who want to understand one of the largest approaches to managing operations that organizations undertake, and that affects your life and your interaction with technology every day.  The course is a series of video presentations, but also includes quizzes, a final project, PDF downloads, and a dive into two pieces of important software that will help familiarize you with data warehousing.  This course is quick to complete, giving you an overview of what you need most without going too deep for Data Warehousing novices. If you want a solid introduction to Data Warehousing and Business Intelligence, sign up for this course today!</p><p><strong>Over 1.5 hours of material!</strong></p><p><strong>New material will be added periodically to this course.</strong></p><p><strong>Once you register, you will have LIFETIME ACCESS to this course</strong>.<br></p>", 
    "end_date": null, 
    "title": "Data Warehousing and Business Intelligence for Managers", 
    "price": "20.00", 
    "instructors": "Samori Augusto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693376_1f94_5.jpg", 
    "course_url": "https://www.udemy.com/data-warehousing-and-business-intelligence-for-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T19:58:59Z"
}