{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Droughts are among the most expensive natural disasters, harming agriculture, the economy and human health, and creating ideal conditions for wildfires. The conditions that the western United States is experiencing today may be a taste of the \"new normal.\" By the end of this century, scientists expect droughts to intensify and increase in length and frequency in many regions of the United States. The intensified drought conditions projected under climate change will present challenges for the management of reservoirs, aquifers and other water infrastructure.</p><p>In this course, you will learn about drought and its impacts on society and the environment, while gaining practical tips and tools to help you and your family save water. Through videos, quizzes and activities with tips and links to trusted resources, you will learn more about:</p><ul style=\"\"><li>different types of drought;</li><li>historical, current and projected drought trends for the United States;</li><li>the health, financial, social and environmental impacts of drought; </li><li>how to reduce water use by both changing behavior and creating a more water-efficient home and landscape. </li></ul><p>The course uses the current California drought as a case study throughout and draws on expertise and interviews from trusted sources, including the U.S. Environmental Protection Agency's WaterSense program, the National Drought Mitigation Center, the U.S. Forest Service, NASA, NOAA and others. </p>", 
    "end_date": null, 
    "title": "Dealing with Drought", 
    "price": 0, 
    "instructors": "National Environmental Education Foundation (NEEF)", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597700_3c73_3.jpg", 
    "course_url": "https://www.udemy.com/dealing-with-drought/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T21:49:43Z"
}