{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>WordPress</strong> ist die ideale Plattform, um auch als Einsteiger schnell, effizient und mit überschaubarem Budget anspruchsvolle Webseiten oder auch Online Shops zu erstellen. WordPress bietet dir aber auch hervorragende Möglichkeiten, de<strong></strong>ine eigenen Vorstellung durch die Erstellung eines professionellen Plugins umzusetzen. <strong>Mit diesem Kurs hast du die Möglichkeit, mir bei der Erstellung eines kompletten Plugins über die Schulter zu schauen.</strong> Hierbei wird ausdrücklich nichts geschönt dargestellt, sondern der Weg vom Beginn der Entwicklung bis zur Fertigstellung realistisch und authentisch wieder gegeben. Dabei war es mir wichtig, auch den ein oder anderen kleinen Fehler oder eine falsche Entscheidung nicht heraus zu schneiden, sondern dir vielmehr aufzuzeigen, wie und was man daraus lernen kann und wie man diese Klippen umschifft. Du kannst somit die komplette Erstellung eines WordPress Plugins von Beginn bis zum Ende miterleben, und dies ungekürzt und in deutscher Sprache.</p><p><strong>Ziel des Kurses</strong></p><p>Nach Abschluss dieses Kurses kannst du selbständig ein komplettes WordPress Plugin entwickeln und realisieren. Es werden keine Lösungen und Programmierbausteine zu bestimmten Fragestellungen entwickelt und aufgezeigt, s<strong>ondern im Mittelpunkt steht die Umsetzung eines WordPress Plugins von A bis Z.</strong> Du erlernst zudem die Fähigkeit, bekannte WordPress Bordmittel für deine Zwecke zu nutzen. Dies sind zum Beispiel die Custom Post Tyes, die Meta Boxen, den jQuery Color Picker, die WordPress Mediathek, die Sternebewertung und den WordPress Shortcode.</p><p>Nach diesem Kurs wirst du kein perfekter WordPress Plugin Entwickler sein, aber du wirst zu den wenigen gehören, die ein Plugin von Beginn bis zum Ende entwickelt haben, und du wirst erkennen, dass vieles, was für den toll im Frontend aussieht gar nicht so kompliziert in der Entwicklung ist. Und vor allem baust du dir mit Hilfe dieses Kurses, ein ansehnliches Repertoireö an Tools und Funktionen auf, die dir die Entwicklung von weiteren WordPress Plugins erheblich erleichtern werden.<br></p>", 
    "end_date": null, 
    "title": "Dein erstes professionelles WordPress Plugin von A-Z", 
    "price": "20.00", 
    "instructors": "Ralf Pareigis", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703196_25e7.jpg", 
    "course_url": "https://www.udemy.com/dein-erstes-professionelles-wordpress-plugin-von-a-z/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T19:39:14Z"
}