{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Have you ever asked yourself:<br></p><ul><li>what you should wear to look good?</li><li>how to improve your home's interiors?</li><li>how to shoot better looking and more meaningful photos?</li><li>why some graphic design works are better than others?</li></ul><p style=\"\">The answers to all of those questions is found in the <strong>elements and principles of art and design.</strong> They are the general rules and guidelines that help to make a design look as good as it can. In this course I will explain how you can <strong>apply them easily to your life to dress up fabulous, shoot better photos and decorate your home's interiors.</strong> If you are a novice graphic designer, you will also learn how to <strong>improve your graphics' look and meaning.</strong></p><p style=\"\">In clothing, elements and principles will help you to look good. They can flatter your figure and optically correct your body's imperfections. At home, elements and principles will help you to improve the look of your interiors, to optically correct your rooms' defects and to introduce any atmosphere you want. In photography and graphic design, elements and principles will help you with communication and will affect your image's mood.</p><p style=\"\"><strong>If you want to look better, learn some new ideas for your own home and improve your photography (or even graphic design) skills, this course is for you. These simple rules work for anyone, anywhere in the world, any age.</strong></p><p style=\"\">You have unconditional 30 day money-back guarantee. Study the course and test the ideas. If you are unhappy, you will get a full refund from Udemy. You cannot loose!</p><p style=\"\">Some facts about me:</p><ul><li>I have completed hundreds of design projects for clients worldwide</li><li>My Photoshop extension was featured by Adobe</li><li>I am ranked top 5% Graphicriver author</li><li>My Photoshop tool, <em>Pablo the Pixel Art Builder</em>, is ranked top 1% Graphicriver file with well over 1k licenses sold and dozens of 5 star reviews.</li></ul><p style=\"\"><br></p><p style=\"\">Enjoy!</p><p style=\"\">Asia Ciesla</p>", 
    "end_date": null, 
    "title": "Design Your Life: Beautify Yourself, Home, Photos & Graphics", 
    "price": "40.00", 
    "instructors": "Asia Ciesla", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544996_4e85.jpg", 
    "course_url": "https://www.udemy.com/design-your-life-with-elements-and-principles-of-art-and-design/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T19:13:27Z"
}