{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Do you enjoy using your tablet? Did you ever wish you could create interactive presentations that were touch screen ready? Well now you can with this Beginners course to Touch Screen Content Design.</p><p>I will quickly familiarize you with Intuiface Composer and the powerful functionality it provides. You do NOT need to know code or have any prior knowledge in application design. You will be amazed at how fast you can begin to design your own creations.</p><p><strong style=\"\">Why would you want to learn this? <br style=\"\"> </strong>There are so many industries that still struggle with presenting information in an organized and interactive manner to their end users. The opportunities to implement your designs in industries like retail, trade shows, constructions, real estate, and banking are simply endless.</p><p>Most agencies charge thousands of dollars for the exact same functionality you will be able to provide within just a few hours. Learn this for fun or make a career out of it, the choice is yours.</p><p><strong style=\"\">What is covered in this course?</strong></p><p>Properly setup a project for the appropriate devices you will be targeting. Learn about the variety of asset types available to you with in the software. This includes: Working with image, background images, video, background video, documents, web browser component, simple text, buttons, asset groups, asset flows and more. </p><p>All of these components are used as we create a demo project with a real world application in mind. You will follow along with me from start to finish. Each lecture explains my process and gives you the confidence to do it on your own. After just a few hours of practice you will be able to develop new ideas on your own. </p><p><strong style=\"\">This course sets the foundation for more advanced materials and demo projects coming in the future.</strong></p><p>Many people are unware how easy it is to begin creating professional touch screen presentations. Learn how now, and get in on one of the fast growing industries.</p>", 
    "end_date": null, 
    "title": "Design Professional Multi Touch Screen Content in 1 Hour!", 
    "price": "20.00", 
    "instructors": "Jonathan Wichmann", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449436_de67_3.jpg", 
    "course_url": "https://www.udemy.com/beginning-touch-screen-content-design/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T13:46:05Z"
}