{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  Aucune expérience préalable sur AutoCAD n&#039;est nécessaire, on commence au tout début.  </p>  <p>  \t  Apprenez à réaliser des dessins d&#039;aspect professionnel en parcourant 8 modules. Pour chaque nouvelle commande, nous vous présentons une vidéo d&#039;un exercice simple. Puis, vous pourrez télécharger le fichier de l&#039;exercice et le réaliser par vous-même. Puis, on recommence en augmentant graduellement la difficulté pour, qu&#039;à la fin du module, vous soyez capable de réaliser seul des exercices complexes intégrant toutes les commandes apprises.  </p>  <p style=\"\">  \t<br style=\"\">  \tOBJECTIF:<br style=\"\">  \tCe cours permettra à l&#039;élève de représenter graphiquement par l&#039;intermédiaire d&#039;un système ordiné, des vues d&#039;objets simples à l&#039;aide d&#039;un logiciel de dessin assisté par ordinateur (DAO).<br style=\"\">  \t<br style=\"\">  \tCOMPÉTENCES:<br style=\"\">  \tÀ la fin de la formation, le participant sera en mesure de :<br style=\"\">  \t- utiliser un logiciel de dessin assisté par ordinateur AutoCAD;<br style=\"\">  \t- connaître les nombreuses possibilités du DAO;<br style=\"\">  \t- développer ses habiletés propres au fonctionnement du logiciel AutoCAD;<br style=\"\">  \t- utiliser les différentes techniques de création et d&#039;édition d&#039;entités de base en deux dimensions, de cotation, d&#039;habillage et de mise en plan.<br style=\"\">  \t<br style=\"\">  \tCONTENU:<br style=\"\">  \t*Dessiner :<br style=\"\">  \tOuvrir AutoCAD, découvrir l&#039;interface du logiciel et utiliser les commandes de traçage de dessin simple.<br style=\"\">  \t*Modifier :<br style=\"\">  \tUtiliser les commandes de modification et de réalisation de dessins de simples à complexes.<br style=\"\">  \t*Blocs :<br style=\"\">  \tCréer et utiliser des banques de blocs pouvant représenter des symboles d&#039;architecture, d&#039;électricité, de cartographie, de mécanique, etc.<br style=\"\">  \t*Imprimer :<br style=\"\">  \tImprimer des dessins et les exporter en format PDF pour être en mesure de les transmettre de façon sécuritaire par courriel à des clients et collaborateurs.<br style=\"\">  \t*Hachurer :<br style=\"\">  \tUtiliser les hachures pour représenter des revêtements sur des dessins d&#039;architecture, des sols sur des dessins d&#039;aménagement paysagé ou des types de métaux sur des dessins mécaniques.<br style=\"\">  \t*Cotation :<br style=\"\">  \tAjouter les cotes (mesures) nécessaires pour compléter vos dessins.<br style=\"\">  \t*Texte :<br style=\"\">  \tAjouter des notes, titres et autres textes aux dessins. Ajustez des polices, des hauteurs de lettrage et autres paramètres reliés au texte.<br style=\"\">  \t*Mise en plan :<br style=\"\">  \tProduire des dessins d&#039;aspect professionnels en assurant la mise en plan de dessins avec AutoCAD. Ajouter un cartouche (cadre) à un plan, le compléter et respecter les normes de présentation de la cotation.  </p>", 
    "end_date": null, 
    "title": "Dessiner avec AutoCAD à partir de zéro", 
    "price": "50.00", 
    "instructors": "Jean-René Rodrigue", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358032_5074_2.jpg", 
    "course_url": "https://www.udemy.com/autocad-debutant/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T20:15:42Z"
}