{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">As any sufferer knows diabetes is not easy to live with.  Modern medicine is effective but thousands of people believe that alternative and natural remedies can offer a different way of treating the condition. </p><p style=\"\"><strong style=\"\">Create Your Own Alternative, Natural, Healthy Diabetes Management Program</strong></p><ul style=\"\"><li style=\"\">Understand the science of diabetes</li><li style=\"\">See the power of ancient techniques like acupuncture and ayurveda</li><li style=\"\">Know the natural foods you should be eating and those you shouldn&#039;t</li><li style=\"\">Increase wellness with the right exercise and yoga</li><li style=\"\">Learn how simple meditation can play a vital role</li><li style=\"\">Apply modern alternative treatments like biofeedback</li></ul><p style=\"\"><strong style=\"\">Use your new knowledge to find the combination of ideas that works for you</strong></p><p style=\"\">The course takes a different approach to many others.  It gives you an overview of many varied techniques, approaches and points of view.  It guides but does not tell.  With the knowledge gained you can think about what will work for you.  What do you have time for?  How will it fit into your daily life?  What do you think you will persevere with?  What interests you?  .</p><p style=\"\"><strong style=\"\">Overview and Contents</strong></p><p style=\"\">The course is easy to pick up and easy to follow.  It is laid out in 6 separate sections.</p><p style=\"\">The starting point is understanding exactly what is diabetes, the science and the health consequences of having it. I need you to know this to understand the rationale behind the treatments and remedies.</p><p style=\"\">The course has 2 major sections on alternative and natural remedies.  These cover acupuncture, ayerveda, homeopathy, reflexology, natural foods, massage, meditation and more.</p><p style=\"\">There are 2 &quot;physical&quot; sections.  One offers a detailed introduction to yoga and a demonstration class, the other gives you a workout specifically designed for diabetics.</p><p style=\"\">The course finishes with a deliberately reflective summary section.  This gives you the opportunity to think about what we have covered and how the ideas can work for you.</p><p style=\"\">When you have finished the course you will have a more complete understanding of diabetes.  Most importantly, you will have a whole new set of tools which you can use to manage your condition.</p>", 
    "end_date": null, 
    "title": "Diabetes - Beat It With Alternative & Natural Remedies", 
    "price": "25.00", 
    "instructors": "Richard Love", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494196_c950_2.jpg", 
    "course_url": "https://www.udemy.com/diabetes-beat-it-with-alternative-natural-remedies/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T13:52:15Z"
}