{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Digital Creations: Concept Art Objects &amp; Effects with Photoshop</strong></p><p>If you are a student with plans to enter the field of conceptual art and illustration or already work in the business but want to learn an exciting way to build a strong client base and improve workflow, this course is perfect. However, the course is also beneficial for virtually anyone interested in painting cool armor and weapons on the computer. </p><p><strong>How to Transform the Ordinary into Something Extraordinary with Digital Painting</strong></p><li>Master key elements of art and illustration</li><li>Understand how to stand apart from the competition</li><li>Benefit from basic and sidebar methodologies</li><li>Optimize existing or gain new knowledge</li><p><strong><br></strong></p><p><strong>Content and Overview</strong></p><p>By applying everything learned in this course, you have incredible opportunities to work within multiple industries, including film, video game, print and fine art to name a few. Digital art is used in the conceptualization of environments seen in blockbuster films and video games.</p><p>Other courses tend to skip critical steps or gloss over information, but with this digital painting course, everything you need to get started is provided. This course will take you through the process of creating believable and compelling concept art objects step-by-step using Adobe Photoshop. </p><li>Simple Exercises - we will learn the basics of rendering metal, wood, \"jewels\" and glass containers. All skills that every concept artist must master in order to create professional level weapons &amp; armor concept art.</li><li>Full Scale Projects - we will apply what was learned in the exercises to three simulated real world assignments. Students can choose to render a suit of armor, a pistol or a sword (or try all three!)</li><li>Special Effects - we will learn to render realistic magical effects such as smoke, fire and lightning.</li><p>After completing this course using Adobe Photoshop, you will have the ability to render these commonly sought after assets with confidence and ease. </p>", 
    "end_date": null, 
    "title": "Digital Creations", 
    "price": "20.00", 
    "instructors": "Hardy Fowler", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756598_c8e8.jpg", 
    "course_url": "https://www.udemy.com/digital-creations/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T00:59:17Z"
}