{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>A quién está Dirigido el Curso?  </p><p>  \t              Estudiantes de los últimos semestres de Ingeniería Civil o Profesionales en el área.  </p>  Duración y Metodología  <p>  \t              El contenido es equivalente a <strong>32 horas académicas de un curso presencial</strong>.  </p>  <p>  \t              Aproximadamente <strong>el 60% del material disponible está en forma de videos</strong>, en los que se presentará al participante los aspectos específicos sobre algún tema.  </p>  <p>  \t<strong>Se presentará al participante, a  manera de autoevaluación, una serie de preguntas que le  permitirán establecer el alcance de comprensión obtenido del tema.</strong> Se utilizará a lo largo del curso <strong> un ejemplo de diseño de una edificación residencial de 5 niveles. </strong>  </p>  <p>  \t<strong>Todos los cálculos serán desarrollados a través de hojas de cálculo (Excel)</strong> que serán suministradas al participante conforme se desarrollen los temas.<strong></strong>  </p>  <p>  \t    Revisado todo el contenido, <strong><strong>el participante tendrá acceso a una serie de  presentaciones en las que se </strong>realizará la revisión  del diseño de los distintos componentes de una edificación multifamiliar  de 4 niveles, con 4 viviendas por nivel. </strong>En ellas, se  explicarán y darán conceptos y comentarios adicionales a los vistos a lo  largo del curso.  </p>", 
    "end_date": null, 
    "title": "Diseño de Instalaciones Sanitarias - Suministro de Agua", 
    "price": "35.00", 
    "instructors": "Aula Virtual Tutoriales al Día", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305434_ee86_3.jpg", 
    "course_url": "https://www.udemy.com/diseno-de-instalaciones-sanitarias-suministro-de-agua/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-22T15:23:48Z"
}