{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>In DIY smart home system online workshop you will learn how to automate your home using smart phone, how control in many device inside your home.</p><p><br><br> it will inspire you to get your own ideas and start designing &amp; building your own home automation systems.</p><p><br><br>In this Workshop, I will show you how to use the Arduino platform with small Bluetooth module for home automation by using your smart phone. <br>You will learn how to interface commonly used home automation Relay to Arduino to be able to control your lights, air conditioning, etc.<br> <br>In this on line workshop we will control an Ac lamp with a smartphone via Bluetooth.<br> This project is great to learn more about:<br>1. 5 pin Relay<br>2. Interfacing Arduino with your smartphone<br>3. Bluetooth module HC-05<br>4. transistor 2222A<br>5. diode</p><p><br><br>The workshop will give you the chance to get acquainted with a variety of electronic components such as LEDs, relay, diode, transistors, and ac lamp. You will get started with hardware hacking, bread boarding and circuit building and creating your own automation system.</p><p><br><br>The Android phone that stays in your hand most of the time is useful in many other applications apart from WhatsApp, Facebook; appliances; monitor your health parameters. How it would be if it can control an automation, which can assist in your daily work.<br> With this project you can make a robot and control in house lighting that can be controlled by an Android Phone, over Bluetooth Communication. <br>The automation system is built around Arduino interfaced with a Bluetooth receiver to receive commands from Android Phone.</p><p><br><br>The operation being very simple, as the app on the phone transmits data serially over a Bluetooth connection established between it and the receiver.<br>The commands are received and are processed according to the program fed into Arduino, upon which the further controlling is done. lamps are given instructions, in the way user commands them through his phone.<br></p>", 
    "end_date": null, 
    "title": "DIY simple smart home system ", 
    "price": "20.00", 
    "instructors": "AMR Eldihemy", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/784878_4bd1.jpg", 
    "course_url": "https://www.udemy.com/diy-simple-smart-home-system/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T11:33:37Z"
}