{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      This course is specifically tailored for immigrants who are married to a U.S. citizen, <u style=\"\">reside in the U.S.</u>, <u style=\"\">entered lawfully</u>, and are seeking a green card through family-based immigration. This course will enable you to complete the necessary forms accurately and provide the U.S. Citizenship &amp; Immigration Services with the required supporting documentation, all without the need for an expensive immigration attorney.  </p>  <p>  \t      However, this course is not intended for complex cases that require an attorney&#039;s expertise. To that end, if any of the following apply to your situation, this course will be useful, but cannot provide you with the specific guidance you may need:  </p>  <p>  \t      1. You entered the U.S. without inspection (e.g., you are an unauthorized immigrant);  </p>  <p>  \t      2. You are currently in or have previously been in immigration proceedings (i.e., immigration court);  </p>  <p>  \t      3. You have been previously removed from the U.S. by Customs and Border Patrol or Immigration &amp; Customs Enforcement; or  </p>  <p>  \t      4. You have a criminal history beyond traffic citations, driving without a license, and other simple matters.  </p>  <p>  \t      The course includes an overview of the immigration system and necessary terminology, and then proceeds to walk you through each required USCIS form: Form I-130, Form G-325A, Form I-131, Form I-765, Form I-485, and Forms I-864, I-864A, and I-864W. It concludes with an description of the various supporting documents required by USCIS to prove your case and a brief description of what to expect once you have filed.  </p><p><strong style=\"\">This precise, &quot;how-to&quot; knowledge would easily cost in the $1000s, but this start-to-finish course gives YOU the power to do it yourself! Enroll today!</strong><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Do It Yourself Immigration: Green Cards for Spouses", 
    "price": "25.00", 
    "instructors": "Spencer Larche", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286072_bdab_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-green-card-based-on-marriage-to-a-us-citizen/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-22T18:02:55Z"
}