{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t Si vas a <strong style=\"\">crear un blog con WordPress</strong>, necesitas dos cosas:  </p>  <ul style=\"\">  \t<li>Contratar      un Hospedaje para WordPress</li>  \t<li>Instalar      WordPress en tu recién adquirido Hospedaje o Alojamiento</li>  </ul>  <h4><u style=\"\">Cómo Elegir un Hosting WordPress</u></h4>  <p>  \t A la hora de adquirir un <strong style=\"\">Hosting para WordPress</strong> el primer paso es analizar las características de nuestro proyecto y en función a estás elegir alguno de los 3 tipos principales de Hosting WordPress que existen:  </p>  <p>  \t <strong style=\"\">Hosting WordPress Compartido o Shared Hosting</strong>  </p>  <p>  \t Como su propio nombre indica se trata de compartir un servidor con otros usuarios. Esta es la opción más económica y más común. Si no tenemos especiales requerimientos (procesos, memoria, etc) esta opción suele ser suficiente.  </p>  <p>  \t <strong style=\"\">VPS (Virtual Private Server)</strong>  </p>  <p>  \t En un nivel superior tenemos la opción del Servidor Virtual Privado. En este caso al igual que en el anterior, todos los usuarios comparten servidor, pero con la diferencia fundamental de que cada usuario opera independientemente del resto.  </p>  <p>  \t Es decir, si un cliente está consumiendo más recursos de los que se le permiten, solo le afectará a su funcionamiento y no al resto de clientes. Así se goza de  inmunidad respecto a los “malos vecinos” que sobrecargan el servidor.  </p>  <p>  \t Es una opción muy adecuada cuando tenemos que alojar varias páginas web o nuestro proyecto es de cierta envergadura, tiene mucho tráfico web, etc.  </p>  <p>  \t <strong style=\"\">Servidor Dedicado</strong>  </p>  <p>  \t Cómo su propio nombre indica, se trata de contratar un hosting WordPress única y exclusivamente para nosotros. Esta opción es la más segura y la más cara, pero muy interesante para las empresas que no desean tener ningún tipo de problema de seguridad o con caídas del servidor.  </p>  <h4><u style=\"\">Qué características debe tener un Hosting para WordPress</u></h4>  <p>  \t Dado que los sitios web realizados con WordPress usan una base de datos MySQL y aplicaciones PHP, para que un servidor sea adecuado para WordPress deberá tener ciertos requisitos mínimos. Especialmente si deseamos complementar la página con algunos plugins, que también consumen recursos.  </p>  <p>  \t Entre las <strong style=\"\">características básicas</strong> que se nos presentan a la hora de adquirir un <strong style=\"\">hosting WordPress</strong> destacan:  </p>  <ul style=\"\">  \t<li>El Ancho      de Banda o volumen de transferencia de datos por mes</li>  \t<li>Memoria      RAM</li>  \t<li>Memoria en      disco</li>  \t<li>Número de      cuentas de correo</li>  \t<li>Número de      dominios</li>  \t<li>Copias de      seguridad o backups</li>  \t<li>Up-time o      tiempo en que el servidor está funcionando, sin caídas</li>  \t<li>Soporte      técnico</li>  </ul>", 
    "end_date": null, 
    "title": "Domina Hospedaje para WordPress", 
    "price": "20.00", 
    "instructors": "Marco Rojero", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165336_706b_3.jpg", 
    "course_url": "https://www.udemy.com/hospedaje-wordpress-2hrs/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-16T23:07:40Z"
}