{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">This course is geared <strong>specifically towards E-commerce business owners</strong> and any one who wants to do <strong>conversion rate optimisation</strong> on their store.</p><p style=\"\">This course draws in the very best insight from a host of international agencies, clients and seasoned E-commerce consultants, using their split test data compiled to show you exactly how to optimise your store for maximum conversions.</p><p style=\"\">All of this information has been <strong>compiled into 10 easy to consume</strong>, easy to digest and easy to act upon sections <em>(with more planned in the next 12 months).</em> </p><p style=\"\">I share with you what I find works best for the:</p><ul><li>Header of your store</li><li>Footer of your store</li><li>Home page (including three tactics of how to sell directly from the home page, even to first time visitors)</li><li>Videos and images you use</li><li>Product pages</li><li>Checkout process </li><li>Information touch points </li><li>And even down to the best way to deliver shipping and returns information, as well as making sure your site is as fast as possible with <strong>easy site speed optimisation tactics.</strong></li></ul> <p style=\"\"><br style=\"\">I even discuss how to use strategically delivered re-marketing campaigns that are built around a solid three step funnel so your message is always delivered to the right consumer at the right time in the right context.<br style=\"\"></p><p style=\"\"><strong>This is the very best in E-commerce conversion rate optimisation so that when you are driving traffic you can get the most value from that traffic.</strong> </p><p style=\"\">If your technical skills are lacking or you don't have dedicated webmaster support, don't worry. In this course we have you covered <strong>providing you with either free or low cost solutions</strong> for implementing all of the changes you may want to make. </p><p style=\"\">Don't worry about what sort of site you have, WordPress, Magento or even some sort customer build. The strategies we talk about in this course can be applied equally no matter what sort of site you have or what products you sell. </p><p style=\"\">Inside this course you will see a wide range of examples and case studies from:</p><ul><li>Furniture retailers</li><li>Printers</li><li>Fashion Brands</li><li>B2B</li><li>Automotive</li><li>Amazon</li><li>Food and many more.</li></ul><p style=\"\"><strong>30 Money Back Guarantee. Take the course for 30 days, try it, implement what I show you, run some ads on Twitter and if you don't like it, you will get a full 100% refund no questions asked. What have you got to lose? Get the course right now and generate new leads and sales in less than 3 hours!<br></strong></p><p style=\"\"><strong>Join now and start increasing your sites conversions today!<br></strong></p>", 
    "end_date": null, 
    "title": "Double Your E-Commerce Conversion Rate In 7 days Or Less", 
    "price": "25.00", 
    "instructors": "The Digital Hack Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/602868_dbdb_2.jpg", 
    "course_url": "https://www.udemy.com/ecommerce-conversion-optimisation/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-04T22:42:26Z"
}