{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This Figure Drawing course is designed to help you develop your powers of observation and equip you with multiple techniques to become the best artist you can be. It was inspired by the website I run called FigureDrawingCourses dot com, which is designed to help people learn how to tap in to their inner artist through life drawing.</p><p>This Udemy course features lectures that will teach you about: choosing perspective, the power of the pose, symmetry, finding the horizon line and much  more. We will be focusing on how to draw various parts of the human body. This course is a bit unconventional because as we go through each body part I will also be teaching you different drawing techniques at the same time to keep it fun, interesting and educational.</p><p>The various techniques covered in this course include: gesture drawing, sketching and scribbling, line drawing, tonal simple lines and some great lectures on illustration techniques to learn comic book drawing.</p><p>For aspiring artists who want to draw the human body as realistically as possible, I will be covering in detail the importance of shadows, shape, negative space, the power of using light effectively, shading and rendering.</p><p>Also, at the end of the course there’s a 14 day challenge designed to encourage you to get into the habit of drawing every day. One of the biggest mistakes that artists make is not getting to work. My job is to get you excited about drawing and to equip you with the skills, tools and techniques that will help you to tap into the amazing artist that is within you.</p><p>Lets get started!</p>", 
    "end_date": null, 
    "title": "Drawing the Human Figure", 
    "price": "20.00", 
    "instructors": "Leslie Scott", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676170_35b2.jpg", 
    "course_url": "https://www.udemy.com/drawing-the-human-figure/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T04:35:46Z"
}