{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t  “Mark covers all the aerial photography topics in this course. Very  interesting course over all, and great production quality. If you’ve  ever wanted to get a quadcopter and use it to take cool videos and  photos, you must take this course.” Scott Duffy  </p>  <hr style=\"\">  <p style=\"\">  \t               “This is a fantastic course, Mark has really gone over the top to put  this together! Get this course Before you get a drone it will be your  best investment! Thanks Mark! This Course will make a Great Gift!” MC  Mason  </p>  <hr style=\"\">  <p style=\"\">  \t      Unquestionably, we are in the pioneering stages of a brand new &quot;drone&quot; revolution. Do a google search for this article from CNN Money: Drone Pilot Wanted: $100,000 Starting Salary.  </p>  <p style=\"\">  \t                                       Drones of all shapes and sizes are here to stay. Those people that know how to fly are about to have a whole new world of opportunities open up to them. The photography and videography trades alone have already and will continue to see major transformations as multirotors are used as flying cameras. Business is becoming aware of these options and paying attention to the additional dimension drone work can offer.  </p>  <p style=\"\">  \t      It&#039;s an exciting time to be a part of this new &quot;drone&quot; economy. Get up to speed and add the valuable and rewarding skill of drone-based aerial imaging to your skill-set.  </p>  <p style=\"\">  \t<strong style=\"\">Photographers and videographers!</strong> Do you want to take your images to the next level... literally? This video course is all about helping you to get started taking awesome aerial photos and videos with the use of multirotors (drones) as quickly as possible. At the same time, I’ll teach you to avoid the many pitfalls or problems you may face when learning to fly, choosing an aerial platform, and flying safely. This course contains concise video lessons, PDF guides and helpful links to help you get up to speed and up in the air.  </p>  <p style=\"\">  \t<strong style=\"\">            What do you get?</strong>  </p>  <p style=\"\">  \t                                   Camera drones are incredibly fun to fly and will add a whole new dimension to your work. If you are a videographer, this course will help videographers and photographers gain the skills and knowledge you&#039;ll need to confidently add epic aerial shots to your video projects. Learn the best GoPro settings and post processing techniques to achieve the best video quality.  </p>  <p style=\"\">  \t                                   Still photographers can have just as much fun taking still photos from a multirotor drone. We&#039;ll cover taking and processing still photos with a GoPro, as well as stitching aerial panoramas into breathtaking masterpieces.  </p>  <p style=\"\">  \t      Real estate agents, farmers, miners, law enforcement officers, sheer hobbyists... the possible uses for aerial imaging are many. Cutting edge technology is making aerial photography and videography more accessible than ever.  At the same time it&#039;s important to know the laws, rules, and best practices to ensure your success.  </p>  <p style=\"\">  \t<strong style=\"\">Easy Self-Paced Learning</strong>  </p>  <p style=\"\">  \t                                   Take this course at your own pace, come back and re-watch sections if you like, or watch the entire course in one go.  </p>  <p style=\"\">  \t<strong style=\"\">        Who is the instructor?  </strong>  </p>  <p style=\"\">  \t      Mark Richardson is a full time photographer and videographer who has built custom multirotors and has been capturing aerial imagery for over two years. He&#039;s traveled world wide with his current quadcopter, (a Phantom 2) and has mastered the techniques for getting stunning aerial shots while maintaining safety. Mark has hundreds of hours of multirotor flight time under his belt, with a zero crash record on the Phantom 2.  </p>", 
    "end_date": null, 
    "title": "Drones: Learn Aerial Photography and Videography Basics", 
    "price": "30.00", 
    "instructors": "Mark Richardson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308076_55ab_3.jpg", 
    "course_url": "https://www.udemy.com/aerial-photography-and-videography-with-drones/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T02:30:40Z"
}