{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Become a Master Drone Pilot! Why Wait or Waste Time?</p>\n\n<p><strong class=\"redactor-inline-converted\">If you’re looking to truly master the art of piloting your DJI drone</strong>, then you need to look no further than this comprehensive beginner course designed to allow you to really get the most from your new flying friend!</p>\n\n\n\n<p><strong>It doesn’t matter if you’ve never even taken your drone out of the box before; within no time at all you will be piloting it like you were born to! </strong>You will feel total and complete control over your drone’s movement and finally be able to truly make the most of it!</p>\n\n\n\n<p>Your new drone piloting skills will allow you to capture truly awe inspiring videos and photography that it’s simply impossible to find any other way! <strong class=\"redactor-inline-converted\">To master your drone is to tap into a whole world of unexplored potential – the sky literally is the limit!</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">With this course you will be taken through every single foundational step of perfect drone piloting to allow you to steadily and constantly build on those strong foundations. </strong></p>\n\n\n\n<p>I have left no stone unturned, no question unanswered and no students unsatisfied – so if you would like to learn the art of drone piloting waste no time, buy today!</p>\n\n<p>~~~~~~</p>\n\n\n\n<p>This course is designed to teach you all the steps needed to go from unboxing your drone to flying it, all within a day's time. You'll learn how to fly safely, legally, responsibly so you don't become another statistic for crashed drones.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Preview the lecture on Registering Your Drone for FREE to see a topic students are learning about.</strong><br></p>\n\n\n\n<p>While there are many course that teach you about drones and how to create professional footage, it's hard to find one that shows you the very basics to get started.</p>\n\n\n\n<p>This course is designed for beginners, for those who have never flown and for those who don't want to spend days reading manuals, and searching the internet for answers to their questions. This course is also designed for DJI Phantom or Inspire owners, and is tailored to these drones.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Master your DJI Drone to Take Out-of-this-World Footage and Boost Freelancing Income.</strong></p>\n\n\n\n<p>To start your journey of taking breathtaking footage, and making extra money from your DJI Drone, you first need to know the basics. <em>Walk before you run</em>. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">By the end of this course, you'll be able to:</strong><br></p>\n\n\n\n<ul><li>Identify the components of your drone</li><li>Charge your battery &amp; controller</li><li>Use the DJI app &amp; controls</li><li>Register with the FAA</li><li>Take photos &amp; videos</li><li>Update your drone with the latest firmware</li><li>Know which mode to fly in</li><li>Understand your fail-safe feature</li><li>Know the FAA safety guidelines</li><li>Improve your aerial photos through editing</li><li>Apply to legally sell aerial footage</li><li>Understand which gear/accessories are right for you</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">By the end of this master course you'll know <em>everything</em> you'll need to fly, and so much more. Included quizzes will help drive home what you've learned too.</strong><br></p>\n\n\n\n<p>It's easy to get excited, watch a couple of YouTube videos and immediately start flying your DJI Drone, but this is how you crash. DJI Drones aren't cheap, but if you know how to use yours properly, it'll last forever. Take the time to learn the basics and master your DJI Drone!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">About the Instructor:</strong><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Kate</strong> started her love for photography at age 15, and constantly looked for ways to take her photography to the \"next level.\"  While traveling around the world, she realized there was no view quite like the one from above. She has since become a DJI Drone expert and wants to share her passion of aerial photography so others can experience the unreal views that drones can provide.</p>", 
    "end_date": null, 
    "title": "Drone Masterclass: Your Complete Guide to DJI Drones", 
    "price": "25.00", 
    "instructors": "Kate Kay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/762086_286c_3.jpg", 
    "course_url": "https://www.udemy.com/dji-drones/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-14T07:37:28Z"
}