{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>** \"<em>This course really contains amazing and powerful practical stuff.</em>\" (Rana)<br>** \"<em>This is a very good course. Take this course. Don't let the Farsi script scare you.</em>\" (Ruben)<br></p><p><em></em></p><p><em>Would you like to learn a new language with\n2500 years of culture and history?</em> Then <strong>Persian </strong>is for you! You will be able to\ncommunicate with over 110 million Persian native speakers all around the world. This course is <strong>a revolutionary method in\nPersian language teaching</strong>. Everything has made simple for you to learn\nefficiently and effectively. Don’t worry about the complexity of grammar any\nmore. Forget about the rules and just use it! In this method you will<strong> learn\nnaturally </strong>with variety of techniques to exercise. And we’re always here to help\nyou! In this course, you will <strong>learn to speak, read and write Persian\nsimultaneously</strong> and you will learn hundreds of practical words, ready to be used\nin everyday conversation. </p><p>The words are selected among from <strong>the most common words in Persian</strong>. We do believe that you can master this beautiful language in a very short time if you take this course. This course is designed in a way to make you autonomous in Persian language learning. Since you'll be able to read and write at the end of this course, you can expand your both speaking and writing skills by the use of many other resources in Persian. Take this course today and enjoy learning it! </p><p><em>My special thanks go to Mohammad Mohamadpoor for his valuable comments and insights on this course.</em><br></p>", 
    "end_date": null, 
    "title": "Easy Persian (Farsi): Speak, Read, and Write in 3 Hours!", 
    "price": "20.00", 
    "instructors": "Amin Dehghan", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662850_ef24_11.jpg", 
    "course_url": "https://www.udemy.com/easy-persian-farsi-speak-read-and-write-in-3-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T08:30:31Z"
}