{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    Expecting Moms: Do You Struggle with Worry, Fear, or Anxiety about Childbirth?  </p>  <p>  \t<strong style=\"\">Approach Childbirth With Confidence Instead Of Anxiety!<br style=\"\">  \t<br style=\"\">  \t</strong>  </p>  <p>  \t    Dear Mom-to-Be:  </p>  <p>  \t    There’s just no simple way to describe pregnancy and the process of childbirth. On one hand, you feel <em style=\"\">excited</em> about the new life you’re about to bring into the world, and about your new role as a parent. You might have been dreaming about becoming a mom for years…<em style=\"\"> and now it’s finally about to happen!</em>  </p>  <p>  \t    On the other hand, thinking about childbirth can be <em style=\"\">utterly terrifying</em>. You’ve probably heard horror stories from women who describe the process as nothing short of excruciating. In fact, when we surveyed 64,000 American moms, <strong style=\"\">one third</strong> of them said it was <strong style=\"\">the most painful experience of their lives!<br style=\"\">  \t<br style=\"\">  \t</strong>  </p>  <p>  \t    And there are plenty of other worries that expecting moms around the world – just like you – face as they enter their third trimester.  </p>  <p>  \t    Tell me if any of these thoughts sound familiar to you:  </p>  <ul style=\"\">  \t<p>  \t\t    ·You worry that <strong style=\"\">you haven’t done enough to keep your body healthy</strong> for your baby, and that will complicate delivery.  \t</p>  \t<p>  \t\t    ·You fear that when the time comes, <strong style=\"\">you won’t be able to make it to the hospital in time</strong> (many women play out the “giving birth in a taxi” scenario in their minds).  \t</p>  \t<p>  \t\t    ·You <strong style=\"\">wonder if you’ll be able to manage the physical pain</strong> and exertion of childbirth.  \t</p>  \t<p>  \t\t    ·You worry that your <strong style=\"\">stress and anxiety</strong> will somehow cause problems with delivery (which brings on even more stress and creates a vicious cycle).  \t</p>  \t<p>  \t\t    ·<strong style=\"\">You fear that something will go wrong</strong> or your child will be born with an injury or illness.  \t</p>  \t<p>  \t\t    ·You worry about providing <strong style=\"\">proper care and a nurturing environment</strong> for your baby when you return home with the new addition to your family.  \t</p>  </ul>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t    All of these are common fears that women in many different cultures around the world share. It doesn’t matter how many supportive people you have around you or how much you look forward to life as a mom… these worries can still be overwhelming!  </p>  <p>  \t    I want you to understand that if you have any of these stressful thoughts going through your mind, <strong style=\"\">it’s not your fault</strong>.  </p>  <p>  \t    You see, there are a lot of information resources out there for expecting moms. Some are good, and frankly, others are not so good. If you start reading or watching online videos about what to expect before, during, and after your delivery… it can be easy to become overwhelmed!  </p>  <p>  \t    And it doesn’t help that you’ll find a lot of conflicting information in these resources. No wonder having a child is often one of the most stressful events a woman experiences during her lifetime!  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>You Simply Want a Stress-Free Childbirth Experience and the Chance to Enjoy Your Newborn!  </p>  <p>  \t  You don’t want to remember welcoming your child into the world as a stressful, traumatic experience, filled with worry and uncertainty. You want to be able to enjoy every single moment of the <em style=\"\">miraculous experience</em>, so that you can look back on your child’s birth with fondness.  </p>  <p>  \t  The good news is, <strong style=\"\">childbirth can be a positive, empowering experience</strong>.  </p>  <p>  \t<strong style=\"\">Sign up today to learn how you can have a </strong><strong style=\"\">a positive birth experiance. </strong><strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Effective Childbirth Preparation", 
    "price": "40.00", 
    "instructors": "Monica Healy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289162_9670_7.jpg", 
    "course_url": "https://www.udemy.com/effective-childbirth-preperation/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-27T20:39:02Z"
}