{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Fuente:  Capacítate para el empleo (punto) org</p><p>  \t    Este curso está enfocado para cualquier persona que quiera aprender sobre los conceptos básicos de electricidad.  </p>  <p>  \t    Está enfocado para que después de haber realizado el curso puedan solucionar problemas eléctricos a nivel residencial .  </p>  <p>  \t    Este curso consiste en una cierta cantidad de videos, actividades y pruebas, en donde cada alumno las puede realizar a su propio ritmo.  </p>  <p>  \t  El electricista es un solucionador de problemas, como todos los oficios surge de satisfacer las necesidades sociales.  </p>  <p>  \t  Los problemas en la vida cotidiana pueden ir desde un contacto en falso, una lámpara que no enciende, timbres quemados, interruptores botados, sensores de iluminación que no operan o lavadoras mal conectadas.  </p>  <p>  \t  A través de este curso se espera dar las herramientas, conocimiento y habilidades necesarias para dar solución a este tipo de problemas.  </p>  <p>  \tLa labor de los electricistas es muy necesaria para el desarrollo de la construcción y mantenimiento de los edificios.  </p>  <p>  \tTambién se espera que el estudiante adquiera conocimientos de seguridad y prevención, ya que los trabajos relacionados con electricidad conllevan riesgos importantes.  </p>  <p>  \tEl electricista tiene como responsabilidad asesorar al cliente en el uso de la instalación eléctrica y enseñarle detectar señales de posibles fallas que puedan prevenirse.  </p>  <p>  \tEL objetivo del curso también implica que los electricistas puedan entregar una mayor calidad en el trabajo realizado. Para que puedan atraer clientes es importante entregar un trabajo de calidad, de tal manera que cada cliente pueda recomendarlo a sus amigos o conocidos.  </p>  <p>  \tTambién es recomendable tener tarjetas de presentación, participar de blogs de especialistas y promocionarse en redes sociales. Además, es sumamente importante mantenerse actualizado en temas de Electricidad, por lo que se debe buscar y estar pendiente de nuevas técnicas o materiales que vayan saliendo con el tiempo, para así poder asegurar un servicio de mayor calidad todavía.  </p>  <p>  \tLa ventaja de realizar el curso a través de esta plataforma es que se puede acceder al contenido desde cualquier dispositivo contando o no con conexión a Internet, lo que significa que se puede llevar el curso hasta los lugares más remotos.  </p>", 
    "end_date": null, 
    "title": "Electricista", 
    "price": 0, 
    "instructors": "Diego Carey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406048_7421_3.jpg", 
    "course_url": "https://www.udemy.com/electricista/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T03:39:09Z"
}