{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong style=\"\">        Are you preparing for an IT leadership position, either in a consulting firm or large organisation?</strong>  If so, you need to know about <strong style=\"\">Enterprise Architecture (EA)</strong>, an important and emerging practice within the IT discipline.  </p>  <ul style=\"\">  \t<li>Frustrated by the complexity your organisation&#039;s IT architecture and how it increasingly drains precious organisational resources and budget?</li>  </ul>  <ul style=\"\">  \t<li>Worried that individual IT projects are making decisions in isolation without considering the &#039;bigger picture&#039; of the organisation&#039;s IT strategy?</li>  </ul>  <ul style=\"\">  \t<li>Concerned that IT decision-making is not aligned with the current and future business needs of the organisation?</li>  </ul>  <p>  \t                                                    These are not uncommon challenges as organisations become increasingly dependent on IT yet seek better returns from IT spending.  <strong style=\"\">Enterprise architecture</strong>, can help organisations address these challenges by:  </p>  <ul style=\"\">  \t<li>Forming a bridge between business needs and strategic IT decision-making</li>  </ul>  <ul style=\"\">  \t<li>Formulating a &#039;big picture&#039; view of IT architecture, namely the enterprise architecture</li>  </ul>  <ul style=\"\">  \t<li>Establishing architectural standards and principles, followed by all individual IT projects, that help reduce architectural complexity</li>  </ul>  <p>  \t<strong style=\"\">  By mastering enterprise architecture, you will develop an architectural rather than implementation mindset that will guide your IT decision-making and help you communicate and engage more effectively with both business and technology stakeholders.  </strong>  </p>  <p>  \t      Note that enterprise architecture is essentially a management rather than technical subject, so experience of specific technology architectures or modelling methods (such as UML) is not required.  </p>  <p>  \t                                  Warning - this is not your typical certification course that pushes a particular method, recipe or approach for the sake of passing an exam.  This course is designed to build deeper critical thinking skills about enterprise architecture - not &#039;how, but the &#039;what&#039; and &#039;why&#039; that is essential to strategic IT decision-making.  </p>  <p>  \t                      Having said that, this course is an ideal primer that provides a solid foundation prior to undertaking a programme of certification such as TOGAF, FEA or Zachman.  </p>", 
    "end_date": null, 
    "title": "Enterprise Architecture: A plain and simple guide", 
    "price": "50.00", 
    "instructors": "CIO Institute", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382174_c06f_3.jpg", 
    "course_url": "https://www.udemy.com/enterprise_architecture/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T14:03:55Z"
}