{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t      Entonces, ¿qué es el gobierno escolar y qué  audiencia es la ideal para este curso?  </p>  <p style=\"\">  \t      Bueno, hablaremos más a fondo acerca del &quot;qué&quot; del Programa de Gobierno de la Escuela en la primera sección de este curso, pero el gobierno escolar es esencialmente las maneras formales en el que las personas se reúnen para tomar decisiones a nombre de las escuelas públicas de California y de los estudiantes que sirven. Para los efectos de este curso, nos centraremos en las vías de gobierno de las escuelas que incluyen – y a menudo son dirigidos por - los padres.  </p>  <p style=\"\">  \t      En cuanto a &quot;quien&quot; hemos diseñado este curso considerando a los padres de las escuelas públicas y guardianes de California. Como tal, el contenido será conciso y relevante, ingredientes claves para asegurar que sea capaz de usar  inmediatamente en su escuela lo aprendido.  </p>  <p style=\"\">  \t      Esperamos que disfrute de este curso tanto como nosotros hemos disfrutado en el diseño de esta experiencia para usted. Realmente, ¿le gusta lo que ve? Contacte a Padres para las Escuelas Públicas de San Francisco para informarse acerca de los módulos adicionales del Programa de Gobierno de la Escuela y ampliar su comprensión en estos temas importantes.  </p>  <p style=\"\">  \t      ¡Vamos a empezar!  </p>", 
    "end_date": null, 
    "title": "Entendiendo los Consejos Escolares y Comités de Estudiantes ", 
    "price": 0, 
    "instructors": "Parents for  Public Schools", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418850_6dee.jpg", 
    "course_url": "https://www.udemy.com/parents-for-school/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T01:02:54Z"
}