{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>ÜBER DIESEN KURS</p><p>In diesem Kurs werden wir folgende Themen behandeln:</p>  <p>- Registrierung und Einstellung deines Amazon Verkäufer Accounts, auch außerhalb der USA</p>  <p>- Zahlungen empfangen weltweit</p>  <p>- Verkaufen auf Amazon nach früherer Accountsperrung</p>  <p>- Alles rund um Produktbeschaffung</p>  <p>- Die wichtigsten Verkaufsstrategien</p>  <p>- Wie du Produkte richtig für Amazon FBA etikettierst</p>  <p>- Die Funktion des Amazon Nachrichtensystems</p>  <p>- Welche Käuferinformationen dir zugänglich sind</p>  <p>- Feedback und Bewertungen – Was ist der Unterschied?</p>  <p>- Begriffe rund um dein Amazon Business, die jeder Verkäufer kennen sollte</p>  <p>- Länder mit Amazon Fulfillment Centers, um dein Private Labeling Unternehmen zu expandieren</p>    <p>All das bekommst du völlig kostenlos! (Beachte aber, dass es sich hierbei um eine Einführung zu meinem umfassenden Kurs zum Verkauf mit Amazon FBA handelt)</p>    <p>Für fortgeschrittenes Training im Bereich Private Labeling, Amazon FBA und Amazon SEO, schaue dir unsere weiteren Kurse an.</p>    <p>+ Zusätzlich</p>    <p>1) Du hast die Möglichkeit, mir jederzeit all deine Fragen zu stellen</p>    <p>2) Interagiere über den Diskussionsbereich und lerne von Fragen anderer Teilnehmer</p>    <p>3) Ich stelle dir die neuesten Aktualisierungen der Amazon Richtlinien und Regeln mit Erklärung zur Verfügung </p>    <p>4) Hole dir deinen besonderen Bonus!</p>    <p>Solltest du neu im Bereich Amazon FBA einsteigen, ist dieser Kurs ein Muss!</p>    <p>Wir sehen uns! :)</p>", 
    "end_date": null, 
    "title": "Erfolgreich auf Amazon verkaufen - Amazon FBA Grundlagen", 
    "price": 0, 
    "instructors": "Markus Knopp, Damir Serbecic", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744196_85e1_2.jpg", 
    "course_url": "https://www.udemy.com/erfolgreich-auf-amazon-verkaufen-amazon-fba-grundlagen/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T22:37:42Z"
}