{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>No es lo mismo un ambiente <strong style=\"\">efectivo</strong> de aprendizaje que un ambiente <strong style=\"\">poderoso </strong>de aprendizaje. El ambiente efectivo de aprendizaje siempre es <em style=\"\">a posteriori</em>; es decir, definido por la evidencia; el ambiente poderoso de aprendizaje, siempre es <em style=\"\">a priori</em>, y parte de la evidencia pero reconoce que cada espacio, interacción o entorno, es diferente, y que no siempre se pueden replicar las condiciones de estricto control científico o de mejores prácticas internacionales que definen a los ambientes efectivos.</p><p>Los maestros efectivos no son los que replican la evidencia, sino los que la utilizan como un elemento para construir, creativamente, un nuevo ambiente poderoso de aprendizaje.</p><p>Un mismo maestro puede construir diferentes ambientes de aprendizaje para diferentes alumnos, en diferentes grupos, grados o ciclos escolares; lo mismo, en el hogar y la empresa. Los ambientes de aprendizaje son intrínsecos a las relaciones personales y estas cambian con las personas; no existen dos personas iguales.</p><p>Los grandes líderes pedagógicos o creativos no son los que aplican un modelo teórico sino los que utilizan el conocimiento de muchos modelos y los moldean o adaptan a la realidad que viven, muchas veces creando un nuevo modelo.</p><p>El curso está dividido en tres módulos: </p><p><strong style=\"\"><em style=\"\"><strong style=\"\">1-</strong><strong style=\"\">Debate mundial sobre la educación en el siglo XXI y México</strong> </em></strong></p> <p><strong style=\"\"><em style=\"\">2 -<strong style=\"\">Las competencias, los maestros y los alumnos del siglo XXI. Reflexión: “la calidad de un sistema educativo no puede exceder a la calidad de sus maestros&quot; ¿cierto o falso? </strong> </em></strong></p> <p><strong style=\"\"><strong style=\"\"><em style=\"\">3-</em></strong></strong><strong style=\"\"><strong style=\"\"><em style=\"\">Ambientes y sitios de aprendizaje en el mundo: ¿Qué dice la investigación sobre los ambientes de aprendizaje y cómo lucen estos en la segunda década del siglo XXI?</em></strong></strong> </p><p><strong style=\"\">Se incluyen enlaces a lecturas complementarias.</strong></p>", 
    "end_date": null, 
    "title": "Escuelas y Aulas como Ambientes de Aprendizaje", 
    "price": "50.00", 
    "instructors": "Eduardo Andere M", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207396_ca5f.jpg", 
    "course_url": "https://www.udemy.com/escuelas-y-aulas-como-ambientes-de-aprendizaje/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T18:14:36Z"
}