{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>  \t      This course is for students who are not getting the grades they want on their academic essays and need an extra hand from the pros. <span>It is also for students who have put off writing their essays and need actionable steps to get them done quickly and on time.</span>  </p>  <p>  \tTaking this course will give you the tips you need to write your next college essay quickly while still ensuring the quality is there to get the best grade possible.  </p>  <p>  \tIn this course, you will learn:  </p>  <ul style=\"\">  \t<p>  \t\t      ·The various kinds of essays and what you need to do for each of them;  \t</p>  \t<p>  \t\t      ·How to quickly research your essay;  \t</p>  \t<p>  \t\t      ·How to organize your essay so your instructor can easily follow your thoughts;  \t</p>  \t<p>  \t\t      ·How to write your essay, including how to write a thesis statement;  \t</p>  \t<p>  \t\t      ·How to use and format citations properly; and  \t</p>  \t<p>  \t\t      ·How to revise your essay to make sure you eliminate as many errors as possible before submission.  \t</p>  </ul>  <p>  \t      This essay writing course also gives you bonus instructions on how to make your essay stand out. <span>You’ll see an example of a college-level essay that received the best grade in the class for a model of how to structure and write your next paper.</span>  </p>  <p>  \t      This course consists of slides and a voice-over so that you can quickly access and skim the information, and go back to it easily whenever you need it. When an essay deadline is quickly approaching, you don’t have time to listen to video after video of talking. Skim our essay writing course to get the information you need when you need it, or take the full course when you have more time.  </p>  <p>  \t      You can complete this course in an hour, or you can take your time and go through the examples, taking a full day.  </p>  <p>  \t      Your essay writing skills will improve by taking this course. Sail through your next college essay with this easy guide . . . and if your essay is due in the next few days, this guide will help you get it done on time!  </p>", 
    "end_date": null, 
    "title": "Essay Writing: How to Write an Amazing Essay in 5 Easy Steps", 
    "price": "35.00", 
    "instructors": "Scribendi .com", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288332_3b19_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-an-essay-in-5-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T17:08:01Z"
}