{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Event Management For Young People covers the basics of event planning, from understanding sponsorship, event promotion on a budget, preparation &amp; important documents and how to keep it together on the day<br style=\"\"><br style=\"\">This course will benefit young people wanting to become more involved in community events and those wanting a taste of event management as a career<br style=\"\"><br style=\"\">Take Charge of the Planning and Delivery of Youth Community Events!<br style=\"\"><br style=\"\">Identify the key activities and processes involved with event planning to achieve viable goals and objectives<br style=\"\">Conduct a site visit and identify the key elements for consideration<br style=\"\">Explain the characteristics of successful event sponsorship<br style=\"\">Implement a low cost promotional campaign to maximise event attendance<br style=\"\">Interpret Risk Assessment documentation and evaluate potential risks associated with running an event<br style=\"\">Make a site map, run sheet and event pack<br style=\"\">Implement stress reduction techniques and key decision making factors for running a successful event<br style=\"\"><br style=\"\">An empowering experience which will allow young people to be more involved with event planning in their local area!<br style=\"\"><br style=\"\">In line with the young audience, we have created a hypothetical skate event that we use from start to finish to help place the event theories in context. Using a skatepark in Australia we teach you how to conduct assess the suitability with a site visit and make a site map. We also carry this example through when explaining how to get sponsorship and promote the event.<br style=\"\"><br style=\"\">However the theories taught in this course are equally applicable across a range of events from school formals to fair days<br style=\"\"><br style=\"\">This course was designed to help young people and youth services from a wide geographical area get access to practical and insightful event management information - without a massive price tag. We keep the course fun and directed at young people at all times - with funny anecdotes and short lectures<br style=\"\"><br style=\"\">At the conclusion of this course, students can elect to complete an assignment to receive a Certificate which will be a valuable addition to their portfolio Alternatively, those simply wanting to gather knowledge will just need to complete quizzes as they progress through the cours</p>", 
    "end_date": null, 
    "title": "Event Management for Young People", 
    "price": "20.00", 
    "instructors": "Jemima Key", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417968_1f91_3.jpg", 
    "course_url": "https://www.udemy.com/event-management-for-young-people/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T04:05:22Z"
}