{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>\r\n\t     Evernote Hands-On Training introduces Evernote as a productivity tool which helps you collect, organize and share information easily using desktops, laptops as well as mobile devices.\r\n</p>\r\n<p>\r\n\t     You will learn how to create notes using a variety of media including text,  images, audio, and video.  You will learn how to clip information from the web and save it automatically in your Evernote account.  You will learn how to organize your notes and share them with friends and colleagues.\r\n</p>\r\n<p>\r\n\t  If you have private or sensitive information you would like to store, you will learn how to encrypt that information.  You will learn how to search and backup your notes and integrate your notes with social media.\r\n</p>\r\n<p>\r\n\t     This course is designed to train you in the skills mentioned above through almost 3 hours of video demonstrations accompanied by 7 hands-on projects.  Each project has accompanying resources including directions and a guide which has step-by-step instructions and screenshots -- all designed to ensure that you have everything you need to successfully complete the project.  In addition, each project has a video demonstration showing how I completed the steps so that you as a student can have something to compare your project with and to provide you with feedback which is necessary for successful learning.\r\n</p>\r\n<p>\r\n\t     If you take this course, watch the demonstrations and do the projects, you will have a thorough understanding of what is available in Evernote and more importantly, you will know how to use it.\r\n</p>\r\n<p>\r\n\t   Please note that the focus of this course is to get the beginning Evernote user familiar with what is available in Evernote by focusing on the desktop/laptop version.  We do look at how to access notes and information within Evernote mobile apps but the mobile versions do not have all the features of the desktop version so you will need to follow the course primarily on your desktop or laptop -- if you try to follow this course by just using a mobile device, it will be difficult to follow the steps as there are significant differences between the features of the desktop and mobile versions of Evernote.\r\n</p>\r\n<p>\r\n\t  Once you become skillful using Evernote on the desktop/laptop, you can transfer those skills to your mobile devices.\r\n</p>", 
    "end_date": null, 
    "title": "Evernote Hands-On Training", 
    "price": "20.00", 
    "instructors": "Fred Horton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164436_3e89_2.jpg", 
    "course_url": "https://www.udemy.com/evernote-hands-on-training/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-14T19:17:50Z"
}