{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tO Evernote é um sistema multiplataforma, que funciona em qualquer tipo de computador, celular, tablet ou via internet. Nele, você terá todas as funcionalidades de gerenciamento de documentos e de informações na nuvem (Cloud).  </p>  <p style=\"\">  \tEssas informações e documentos podem ser inseridos em qualquer formato.  </p>  <p style=\"\">  \tO interessante do Evernote, é que se trata de uma ferramenta com inúmeras formas de uso, cada um consegue adapta-lo ao seu jeito de trabalhar sem ter que seguir regras rígidas para busca das informações.  </p>  <p style=\"\">  \tSendo extremamente útil para guarda de documentos pessoais ou para empresas  de qualquer tamanho (Pequenas, Médias ou Grandes):  </p>  <p style=\"\">  \tEntre suas principais funcionalidades podemos destacar:  </p>  <li style=\"\">Gestão de documentos por cadernos, Pilhas de Cadernos e Etiquetas.</li>  <li style=\"\">Controle de acesso personalizável, o administrador da conta dirá o que cada usuário poderá ver, compartilhar e/ou modificar. Na conta Business, nenhuma informação poderá ser excluído sem a autorização do administrador.</li>  <li style=\"\">Busca de documentos por cadernos, etiquetas, palavras, frases e/ou qualquer informação que conste em um arquivo pdf.</li>  <li style=\"\">Compartilhamento de informações entre vários usuários.</li>  <li style=\"\">entre muitas outras funcionalidades</li>", 
    "end_date": null, 
    "title": "Evernote, um elefante que ajuda muita gente!", 
    "price": "20.00", 
    "instructors": "Ricardo Fairbanks Cacciaguerra", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189796_e625_3.jpg", 
    "course_url": "https://www.udemy.com/organize-se-com-evernote/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-27T16:29:30Z"
}