{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>OUR PSYCHOLOGY AFFECTS EVERYTHING WE DO - our mood, our relationships, the way we behave and perform. And yet few of us are taught how to most of it.</strong></p><p>In this programme, NLP Trainer Chris Grimsley shares basic models and techniques from Neuro Linguistic Programming, a practical approach to psychology and communication based on the study of what works in life. Developed over 20 years training and coaching with NLP, this is the material that has made people say <em><strong>\"Why has no-one told me this before?!\"</strong></em></p><p>The course explains in everyday language what makes us 'tick'  psychologically, and introduces top tips and simple techniques you can use everyday (for yourself or with others) to:-</p><ul><li><strong>reduce negative emotions and feel more confident</strong></li><li><strong>understand people better and have more influence</strong></li><li><strong>get problems in perspective and be clearer about goals</strong></li></ul>\n\n<p>Part 1 looks at how our perception works, and explains how our thinking affects our feelings, and both affect our behaviour. </p>\n\n<p>Part 2 introduces a practical framework for understanding our mental / emotional 'state', and top tips and techniques to help us experience things more positively. </p>\n\n<p>Part 3 explores the differences between people, and shares practical ways of building rapport, communicating more clearly, and having more influence so that we can reduce conflict and promote harmony and cooperation.</p>\n\n\n\n<p>Part 4 introduces us to some top tips and techniques for working with problems and goals, that when applied can transform our own lives, and the lives of people around us. </p>\n\n\n\n<p>The course has around 2.5 hours content in 30+ bite sized lessons.  Content includes video content with supporting graphics, with additional PDF material and video footage from live NLP trainings. </p>\n\n<p>If you're looking for practical ways to change your life for the better, and work with others to do the same, this is a great starting point for learning about the benefits and practical applications of NLP to promote more choice, control and cooperation.</p>\n\n\n\n<p><strong>This course content is intended for educational purposes only.  It is not intended as a substitute for medical advice, and you should always consult your doctor on all medical matters and conditions.</strong><br></p>", 
    "end_date": null, 
    "title": "Everyday NLP", 
    "price": "30.00", 
    "instructors": "Chris Grimsley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645684_5bce_12.jpg", 
    "course_url": "https://www.udemy.com/everyday-nlp/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T10:43:23Z"
}