{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Using Evernote is easy...</strong> using it productively takes practice and this course teaches you how. Uncover a simple yet powerful system that anyone can quickly apply to <strong>SAVE HOURS</strong> and <strong>BE MORE PRODUCTIVE</strong> - guaranteed. Take your use of Evernote to new levels of productivity - enrol today.</p>\n\n<p>  \t<strong>Based on the #1 Amazon Best Selling Book \"EVERNOTE EXPOSED\"</strong> this course shows you quickly how to be more productive. <em>*Book not required.</em></p>\n\n\n\n<p>  \t<em><strong>\"This course is absolutely fantastic.</strong> I've been using Evernote for years and knew that there was a better way. I always thought I would find the time and organize and standardized my use of Evernote. <strong>James has done the work for me and shared it in a very logically organized easy to implement fashion in this course.</strong> If you use Evernote and you don't feel like you have your process or understanding optimized you may want to <strong>give this course a try. It's a life changer for me</strong>.\" </em>-- Robert U Smith  </p>\n\n\n\n<p>  \t                                                                                                                    <strong>Discover the best-practice formulas for:</strong>  </p>\n\n\n\n<ul>  \t<li>setting up notebooks, </li>  \t<li>choosing a workable tagging strategy, </li>  \t<li>when and why to use temporary notebooks, </li>  \t<li>email automation tricks and </li>  \t<li>how to archive everything properly </li>  \t<li>managing a centralized ToDo system   \t                                                                                                                                                                                                                              (<em>inspired by the 'Getting Things Done' model.</em>)</li>  </ul>\n\n\n\n<p>  \t<strong>A Richer Multi-Media Experience</strong>  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                                In addition to live screen capture video, the author includes actual footage of his office and desk setup and shows you how he personally uses the various tools and technology to manage his personal and professional life.  </p>\n\n\n\n<p>  \t<strong>BONUS: Behind The Scenes Evernote Shared Notebook - Over 7,000 Extra Words!</strong>  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                        Along with the training materials, cheat sheets and tactics, the author is including OVER 7,000 words of additional material in a special \"behind the scenes\" private Evernote notebook. Access to this exclusive library is immediate when you enrol in this unique course about Evernote personal and professional productivity.  </p>\n\n\n\n<p>  \t<strong>No Risk To You</strong>  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                                Remember, this course is guaranteed for a FULL 30 DAYS so you are free to apply the Evernote Exposed training to your personal and professional life. If for any reason you don't feel this course met your expectations you may request a prompt and courteous refund - no questions asked.  </p>\n\n\n\n<p>  \t<strong>Take Action Now</strong>  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                                Don't delay, enrol in Evernote Exposed today and begin benefitting from the extra time, the sense of control and the new knowledge you are now more productive than ever before.  </p>", 
    "end_date": null, 
    "title": "Evernote Exposed: How To Maximize Your Productivity Quickly", 
    "price": "20.00", 
    "instructors": "James Burchill", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339900_0922_4.jpg", 
    "course_url": "https://www.udemy.com/evernoteexposed/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T15:31:52Z"
}