{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Evernote Made Easy: Increase Productivity And Simplify Your Life </strong>is a complete step by step system that will help you to organize you business and personal life using one simple app - Evernote. <br></p>\n\n<p>In this course you are going to learn Evernote basics, building up productivity foundation and slowly but surely understand and implement its advanced features, tips, and tricks for enhanced organization. <br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here is just a small part of things you will learn throughout the course:</strong></p>\n\n\n\n<ul><li>Collect all your tasks, to-do's, goals and documents into Evernote;  </li><li>Organize your data the most efficient way possible;  </li><li>Reduce your daily stress, free up your mind and time, for the things that matter to you the most.</li></ul><p><br></p>\n\n\n\n<p>This class is designed to help you organize, plan and track your own time, whether you are an entrepreneur, small business owner, stay at home mom or you have a 9 to 5 corporate job. <br></p>\n\n\n\n\n\n<p><strong>You Have Nothing To Risk</strong></p>\n\n\n\n\n\n<p>If at any point of your learning experience you feel like this system is not the right fit for you then you just keep your money.   </p>\n\n\n\n\n\n<p>This course is backed up by 30 days no questions ask, money back guarantee.  </p>\n\n\n\n\n\n<p>Enroll by clicking ''Take this course\" button!</p>\n\n\n\n\n\n<p>I look forward to seeing you inside. </p>\n\n\n\n\n\n<p>Ivan Yordanov</p>", 
    "end_date": null, 
    "title": "Evernote Made Easy: Boost Productivity & Simplify Your Life", 
    "price": "20.00", 
    "instructors": "Ivan Yordanov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842444_3051_3.jpg", 
    "course_url": "https://www.udemy.com/evernote-made-easy-boost-productivity-simplify-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-08T01:20:45Z"
}