{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">What the students say</strong>  </p>  <p style=\"\">  \t<em style=\"\">This is a great course to take if you are not familiar with Evernote but would like to be. I have been wanting to use this program for awhile but have put it off because it seemed a bit overwhelming and confusing. I wasn&#039;t halfway through his course and I immediately jumped into my Evernote account and started setting items up and creating notes. Radu Popa gave great information with great examples - it was easy to follow and understand and implement. It is a beginners course so if you are looking for the beginners starting point this is the course to take. BTW - it was delightful to see Radu Popa use himself in one of the lectures as an example of how to use the webcam part in a note. - </em>Ruth N  </p>  <p style=\"\">  \t<strong style=\"\">The problem with information</strong>  </p>  <p style=\"\">  \t  It is hard to remember everything isn&#039;t it? You probably have a lot going on in your professional life, multiple projects and responsibilities and also at home. Maybe you feel that you are constantly forgetting something and this adds stress. Your files and documents are probably spread across your laptop, tablet, email, etc. making things harder to find.  </p>  <p style=\"\">  \t<strong style=\"\">Evernote, a complete information management system</strong>  </p>  <p style=\"\">  \t  I believe that Evernote can be a real solution in this information age to help us remember everything. It can be a central spot in which we put all our thoughts and files and give us a sense of control.  </p>  <p style=\"\">  \t  I have been using Evernote for couple of years and can say that it is a very powerful tool, not only an application but rather an extension of ourselves, an extension of our brain. I created this <strong style=\"\">online Evernote course </strong>to share what I learned so far with you.  </p>  <p style=\"\">  \t  This 100+ minutes course is structured into 6 sections:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Getting started</strong>: if you are really new to Evernote this section will help you learn the basics</li>  \t<li style=\"\"><strong style=\"\">Evernote setup</strong>: my suggestion on how to set up a notebook and tag structure so you can quickly archive and find everything</li>  \t<li style=\"\"><strong style=\"\">Putting stuff in</strong>: how to easily add content to Evernote in multiple ways</li>  \t<li style=\"\"><strong style=\"\">Getting stuff out</strong>: how do I find information in Evernote and how can I share it with others</li>  \t<li style=\"\"><strong style=\"\">Other goodies</strong>: tools that complement the Evernote experience, Evernote Clearly and Evernote Reminders</li>  \t<li style=\"\"><strong style=\"\">Open space</strong>: a place to answer your questions</li>  </ul>  <p style=\"\">  \t  Hope you enjoy the course  </p>  <p style=\"\">  \t  Radu Popa  </p>", 
    "end_date": null, 
    "title": "Evernote for busy professionals", 
    "price": "20.00", 
    "instructors": "Radu Popa", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134238_d116_3.jpg", 
    "course_url": "https://www.udemy.com/evernote-for-busy-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-16T09:06:31Z"
}