{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<span></span><p><span></span></p><p>Dieses Seminar behandelt die Pivot Tabellen in Excel 2010.</p>  <p>Heute zählen in Excel PivotTabellen und PivotDiagramme zum Standardwerkzeug für die Analyse von Datenlisten. Informationen, die in Tabellenform vorliegen eignen sich hervorragend zur Auswertung mit dem leistungsfähigen PivotTabellen Tool.</p>    <p>Dieses Seminar begleitet Sie Schritt für Schritt von einer Datenliste zur fertigen PivotTabelle mit ihren vielfältigen Möglichkeiten.</p>  <p>Das Seminar besteht aus 14 Videolektionen und den passenden Handouts.</p>  <p>Die Videolektionen bauen auf einander auf. Sie sollten die Lektionen in der vorgegebenen Reihenfolge durcharbeiten, da auch der Schwierigkeitsgrad mit jeder Lektion steigt.</p>    <p>Die folgenden Themen werden behandelt:</p>    <p>Vorarbeiten zu den Pivot Tabellen in Excel 2010. Sie erfahren in welcher Form Ihre Daten in Excel vorliegen müssen.</p>    <p>Erste Schritte mit Ihrer PivotTabelle. Erstellen Sie mit wenigen Klicks Ihre erste PivotTabelle. Kontrollieren Sie anschließend die Berechnung in Ihrer PivotTabelle. Motto: Vertrauen ist gut, Kontrolle noch besser. Filtern Sie jetzt Ihre Daten nach Ihren Wünschen. Ändern Sie die Daten in Ihrer Datenliste und übernehmen Sie diese in Ihre PivotTabelle.</p>    <p>Das Gestalten einer PivotTabelle. Erfahren Sie alles zum Thema Lesbarkeit von PivotTabelle steigern.</p>    <p>Berechnungen innerhalb PivotTabelle ändern. Berechnen Sie beispielsweise die Anteile des Umsatzes in Prozent oder wie oft kommt ein Wert vor kommt.</p>  <p>Gruppieren Sie Datumswerte nach Jahren, Monaten, Quartalen und vieles mehr.</p>    <p>Erstellen Sie berechnete Felder oder berechnete Elemente, wenn die Datenliste bestimmte Informationen nicht her gibt. Mit berechneten Felder fügen Sie neue Spalten an Ihre PivotTabelle. Mit berechneten Feldern fügen neue Zeilen an Ihre PivotTabelle.</p>    <p>Die neuen Datenschnitte. Mit Datenschnitten filtern Sie Daten aus Ihrer PivotTabelle schnell und übersichtlich heraus. Erfahren Sie zusätzlich, wie Sie Datenschnitte optisch aufpeppen können.</p>    <p>Mit PivotCharts erstellen Sie übersichtliche Diagramme. In der Lektion erfahren Sie außerdem, wie Sie diese Diagramme verändern und an Ihre Wünsche anpassen.</p>    Wenn Sie fertig mit dem Erstellen der PivotTabelle sind, können Sie diese an andere Personen weitergeben. Sie erhalten wertvolle Tipps zur Weitergabe von PivotTabellen an dritte Personen. <p><br></p><p><br></p><span></span><p><br></p>", 
    "end_date": null, 
    "title": "Excel 2010 Pivot Tabellen", 
    "price": "20.00", 
    "instructors": "Saskia Gießen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625658_7639.jpg", 
    "course_url": "https://www.udemy.com/excel-2010-pivot-tabellen/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T08:54:16Z"
}