{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Bienvenidos al curso!!</span>  </p>  <p style=\"\">  \tEn este curso, y a lo largo de los diferentes temas, veremos cuáles son las materias de estudio necesarias para poder convertirnos en criminalistas de éxito. Aprenderemos cualquier situación que se nos requiera cuando seamos criminalista.  </p>  <p style=\"\">  \tEmpezaremos el curso explicando Cuales son los elementos que forman parte de un perfil psicológico en este caso el de un perfil criminal. El profilling, como también se le denomina es la técnica por lo que según los diferentes elementos de un crimen, podremos establecer que tipo de personas pueden ser las encargadas de haber realizado cualquier tipo de crimen o agresión.  </p>  <p style=\"\">  \tMas tarde veremos aspectos de gran importancia en los que debe ser experto el criminalista para ayudar a resolver un crimen. Entre ellos encontramos, El modus operandi, la firma o la escena del  crimen.  </p>  <p style=\"\">  \tTambién veremos los diferentes tipos de criminales y cuales son sus divisiones según sus actos.  </p>  <p style=\"\">  \tAsí mismo veremos cual es el perfil de la víctima y cuales son los métodos por los que un agresor o criminal se acerca a la persona futura víctima de un crimen.  </p>  <p style=\"\">  \tPara finalizar veremos cual es el perfil de un violador y como encuadramos a las diferentes clases de violadores.  </p>  <p style=\"\">  \tEn último tema, veremos cual es el primer perfil psicológico de un criminal: El Perfil de Jack el destripador.  </p>", 
    "end_date": null, 
    "title": "Experto en Criminología (C.S.I)", 
    "price": "20.00", 
    "instructors": "Luis Prieto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432156_2c15_6.jpg", 
    "course_url": "https://www.udemy.com/experto-en-criminologia/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T16:43:57Z"
}