{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>In this course I am going to share two of my passions – Hungarian language and singing. The singing is optional – but by singing the words you will find it sticks better.</p><p><strong style=\"\">An easy, fun introduction to the Hungarian Language.</strong></p> <ul style=\"\"><li>Learn to read Hungarian words aloud</li><li>Learn to sing a simple Hungarian song</li><li>Learn how to count to 10</li><li>Form simple plurals</li></ul> <p><strong style=\"\">Learn to speak Hungarian by singing.</strong></p><p>I decided on this approach to learning Hungarian as I struggled with keeping up spoken Hungarian in an English speaking environment. I remembered my Hungarian family who would sing for hours and realized it is a great way to practice the language.</p><p>This course will introduce you to the Hungarian alphabet. We start first with the consonants which stress out English speakers (those combined letters like “sz” or “ty”). Using that knowledge, we will try the words of a simple Hungarian folksong. </p><p>You will find that much of Hungarian pronunciation is predictable and easy as we try to read the song lyrics. I will help you with the words – and tell you what they mean. Then I will sing them to you. I encourage you to sing along at home. </p><p>Then we will explore some vocabulary and grammar suggest by the song. In this case counting and plurals. And yes, there is a 102 planned.</p><p>You should finish the course with a sense of achievement and a new song to sing.</p>", 
    "end_date": null, 
    "title": "Exploring Hungarian from Folksongs for English Speakers: 101", 
    "price": "20.00", 
    "instructors": "Judith Varga", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467192_3564.jpg", 
    "course_url": "https://www.udemy.com/exploringhungarian101/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T07:33:30Z"
}