{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                                             As far as I know the only place this science is currently taught is the U.S. Judicial System for criminal profiling and jury selection. <strong>That sucks!</strong> It's not right that this information is withheld. We should all be taught it in kindergarten!  </p>  <p>  \t                          I believe this Knowledge should be available to everyone, so I have created this course.  </p>  <p>  \t             Half the problems in the world exist because everyone thinks that everyone else thinks just the way they do.  </p>  <p>  \t                          Face Reading will teach you how to <em><strong>read someone's face, </strong>and <strong>before a word is said</strong></em>, know everything from <strong>how they need new information to be presented</strong>, to whether they'd prefer to be <strong>greeted with a hug or a handshake.</strong>  </p>  <p>  \t        This science has been verified with 98% accuracy. I've been teaching this for more than 20 years and found it to be more like 90% - 92% accurate.- Good enough to have <strong>made me a LOT of money</strong> as a sales person; and <strong>saved me a <em>lot </em>of grief in relationships.</strong>  </p>  <p>  \t<strong>At work or home</strong> this is the one tool that will put you on the same page with everyone straight away, and enable you to speak in a way that <em>you will not only be heard, they will feel heard.</em>  </p>  <ul>  \t<li>Communication isn't about what's said, its about what's heard.</li>  </ul>  <p>  \t<strong>Make Face Reading a game the whole family plays</strong>. Share it with anyone who needs to understand people better, and let's face it, that's everyone.  </p>  <p>  \t         To be easily reading faces yourself with more than 90% accuracy, get the manual that goes with this course. It will help you apply face reading effectively in your life. It contains additional essential information, Trait Photos - including Type B - with detailed descriptions for each trait; Information on how the traits operate in relationships - with advice on how to manage them; and a JOYscription - fun ways to implement and learn the traits. It's only $29.  </p>  <p>  \t         Print out the Trait pages, stick them on the fridge and on the back of the toilet door. Follow the JOYscriptions.  </p>  <ul>  \t<li>SHARE this information with people you want to understand YOU!</li>  </ul>", 
    "end_date": null, 
    "title": "Face Reading", 
    "price": "50.00", 
    "instructors": "Joy Phoenix", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140786_dd6e_16.jpg", 
    "course_url": "https://www.udemy.com/facereading/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-02T11:07:49Z"
}