{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Does this sound familiar?</strong></p><ul><li>What is Facebook and why is everyone using it?</li><li><strong>How do I see my kids and grandkids posts?</strong>  </li><li><strong>Is it </strong><strong>safe</strong> to post on Facebook? </li><li>What should I share?   What should I NOT share?<span></span></li><li><strong>This thing is so confusing</strong>! I just want to see my families posts, why is this so difficult?</li></ul><p><br></p><p>As a social media instructor, I've often wondered why we don't have more online support for <strong>one of the fastest growing demographics of Facebook users - YOU!</strong> Yes, as more and more <strong>grandparents and boomers</strong> sign up with Facebook, we - your kids - find you have more and more questions about it. <em>And why shouldn't you?!</em></p><p>What we, your kids, may not tell you is that even those of us who signed up near the start of Facebook also have difficulties, because Facebook is famous for changing things. <strong>BUT, there is hope.</strong></p><p><strong>You don't have to be an expert</strong> to know the basics of getting around, posting, messaging, even uploading your own photos and videos if you want to. </p><p>This course is designed with grandparents (like my Dad!) and baby boomers in mind, <strong>answering questions sent to me by friends and family</strong> who, like you, are just wanting to keep in touch with their families without a bunch of hassle.</p><p><strong>Each short lecture covers one - and only one - concept</strong>, making this course filled with bite sized chunks. I've used screenshots and videos to walk you through common questions like:</p><ul><li>How do I set up my profile?</li><li>How can I find someone?</li><li>Is it safe?</li><li>How do I like or comment on a post?</li><li>And many more!</li></ul><p><br></p><p>I've created this course to progress from the most basic (creating a profile) to upper level use as a beginner. <strong>Watch the lectures as many times as you like - you have lifetime access!</strong></p><p>Soon, you may find yourself answering your friends' questions on getting around Facebook!</p><p>Ok, ready?  See you in class!</p><p><br></p><p><br></p><p><span></span></p>", 
    "end_date": null, 
    "title": "Facebook for Grandparents and Boomers", 
    "price": "20.00", 
    "instructors": "Louanne Saraga Walters", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718742_450c_4.jpg", 
    "course_url": "https://www.udemy.com/facebook-for-grandparents-and-boomers/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T20:51:50Z"
}