{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Die <strong>Klassische Massage</strong> ist die „Königsdisziplin“ unter den Massagearten und daher weltweit bekannt. Vor allem in Europa gehört die Klassische Massage, die auch Schwedische Massage genannt wird, zu dem Standardwerk eines jeden guten Masseurs oder Therapeuten.<br><br>Aber auch zur reinen Wellness, Entspannung und Prävention kann die Klassische Massage optimal genutzt werden. <strong>Nur, wie funktioniert sie wirklich? Welche Vorbereitungen und Handgriffe sind im Einzelnen wichtig und in welcher Reihenfolge?</strong> Wie gehe ich mit dem Kunden um, damit er die Massage perfekt gelagert optimal genießen kann?<br><br>Alle diese Fragen und Punkte kannst Du lernen und beantwortet bekommen, wenn Du unseren Fernlehrgang \"Klassische Ganzkörpermassage (WIP-Akademie)\" absolvierst. Jedes Hauptkapitel ist dabei in mehrere Lektionen untergliedert, die wiederum aus anschaulichen Videos oder kurzen Skripten bestehen - so macht das Lernen Spaß und Du kannst die <strong>Grifftechniken der Massage zu Hause direkt üben</strong> und ausprobieren. Kleine Wiederholungsfragen an Ende eines Kapitels helfen Dir dabei, das Gelernte selbst zu überprüfen.<br><br>Am Ende des Fernlehrgangs wird Dir die <strong>von UDEMY ein Certificate</strong> verliehen, das direkt online zum Download bereitsteht. Während des Lehrgangs kannst Du natürlich immer Fragen stellen und Profi-Tipps von uns erhalten. Mein Team und ich freuen uns darauf, Dich kennen zu lernen und im Fernlehrgang betreuen zu dürfen.<br><br>Herzliche Grüße<br><br>Dein Uli Pötter (Direktor WIP-Akademie)<br>WellnessInPerfektion WIP GmbH</p>", 
    "end_date": null, 
    "title": "Fernlehrgang Klassische Ganzkörpermassage (WIP-Akademie)", 
    "price": "25.00", 
    "instructors": "Direktor WIP-Akademie Ulrich Pötter, Wellness-Expertin Undine Scheel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698368_de1a_9.jpg", 
    "course_url": "https://www.udemy.com/fernlehrgang-klassische-ganzkoerpermassage-mit-urkunde/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T17:24:38Z"
}