{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\"><li style=\"\">This course is ONLY one of its kinds, not just on Udemy but on the Internet as well. Which covers each and every aspect of finding and locating an email.</li></ul> <p style=\"\">Useful strategies, tricks &amp; techniques explained in detail with Live examples in an easy way to understand. This course is real and practically applicable course explained with example to prove what I am saying.</p><p style=\"\">This course is very important for –</p> <ul style=\"\"><li style=\"\">-<strong style=\"\">Small business owners</strong> wanting to connect with potential clients. (Marketing purpose)</li> <li style=\"\">-<strong style=\"\">Freelancers</strong> who want to take “Web research projects&quot;. There are lots of freelancing jobs available for “Web research &amp; finding email addresses&quot;. You can learn this skill and earn good amount of money.</li> <li style=\"\">-<strong style=\"\">Students</strong>, finding Professor email-id of some university to contact directly</li> <li style=\"\">-<strong style=\"\">Young entrepreneur</strong> looking to get in touch with a CEO directly</li> <li style=\"\">-<strong style=\"\">Experienced salesman</strong> looking for leads</li> <li style=\"\">-<strong style=\"\">Every one</strong>, finding a person&#039;s email address via the pool of internet</li> <li style=\"\">I will take you from the very basic to advanced level techniques for finding required email id. The quality of this course is that it covers all the available tricks &amp; techniques and that too explained with live example, so that student gets confidence. </li> <li style=\"\">This is a quick and straight to the point course, not only for finding emails but to learn how to refine your searches on google as well. You will learn techniques, how you can use google effectively for finding someone.</li></ul>", 
    "end_date": null, 
    "title": "Find Email Address: Magic tricks for Marketing & Freelancing", 
    "price": "50.00", 
    "instructors": "Chandresh Gupta", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544218_f046_4.jpg", 
    "course_url": "https://www.udemy.com/find-email-address-magic-tricks-for-marketing-freelancing/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T16:52:28Z"
}