{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tFiverr V2 has delivered more tools and capabilities to both sellers and buyers, making the process of creating Gigs and purchasing not only easy, but simple and fun.  </p>  <p style=\"\">  \tI will share with you in this step by step video course the top unrevealed realistic formulas to live in the kingdom of Fiverr, whether you are a seller and/or a buyer, beginner or advanced.  </p>  <p style=\"\">  \t<strong style=\"\">                                           Who This Video Course is For?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Sellers:</strong>  </p>  <p style=\"\">  \tWho want to rank their Gigs in Fiverr &amp; Google  </p>  <p style=\"\">  \tWho want to boost their sales &amp; dominate their niche  </p>  <p style=\"\">  \tWho want to learn how to deal with hard buyers and keep the 100% rating  </p>  <p style=\"\">  \tWho are offering great Gigs and they are still waiting for orders  </p>  <p style=\"\">  \tWho are new and don&rsquo;t know where or how to start in the kingdom of Fiverr  </p>  <p style=\"\">  \tWho are looking for inspiration for new Gigs  </p>  <p style=\"\">  \tWho want to discover the top Gigs secrets  </p>  <p style=\"\">  \t<strong style=\"\">Buyers: </strong>  </p>  <p style=\"\">  \tWe are human, and we know that we cannot be the best in every domain, but actually we can do that now with Fiverr :) , the formula is simple, all you need to do is choose the best sellers to do your jobs for you, and then you are gonna be the best.  </p>  <p style=\"\">  \tThis video course will guide you to find the right sellers that are able to do your jobs, and without wasting your money or your time on the wrong sellers.  </p>  <p style=\"\">  \t♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛♛  </p>  <p style=\"\">  \tThis video course contains all the tips, techniques and strategies that I have collected from my experience and from the Top Rated Sellers on Fiverr and that I have tested and used for a long time, I have held nothing back, and in this video course I share with you ALL of my lighting secrets and techniques.  </p>  <p style=\"\">  \t<strong style=\"\">This is a clear, structured, kept simple &amp; short and to the point video course.</strong>  </p>  <p style=\"\">  \tThe Fiverr V2 Kingdom Formula is a <strong style=\"\">&ldquo;MUST VIDEO COURSE&rdquo;</strong> for any seller and/or buyer on Fiverr.  </p>", 
    "end_date": null, 
    "title": "Fiverr V2 Kingdom Formula", 
    "price": "20.00", 
    "instructors": "Ahmed DALHI", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/128308_ae37_8.jpg", 
    "course_url": "https://www.udemy.com/fiverr-v2-kingdom-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-03T00:57:38Z"
}