{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p style=\"\">This course is based on the curriculum of the CFA L3 exam subject_Fixed Income Portfolio Management.</p><p style=\"\">Spread over 18 videos and about 4 hours, the course will give students a fair understanding of this subject and help clarify difficult concepts. All the readings and LOSs of Study Session 9 of CLA L3 are explained in these videos.</p><p style=\"\">This course includes the elements of the investment management process, such as the consideration of risk, return, and investment constraints, are the same for a fixed-income portfolio as for any other type of portfolio. As part of the process, an appropriate benchmark is selected to serve as a reference for portfolio construction and performance evaluation. For investors taking an asset-only approach, the benchmark is typically a bond market index. For investors with a liability-based approach, performance is measured in terms of the portfolio&#039;s ability to meet a set of investor-specific liabilities. </p><p style=\"\">The first reading addresses these primary elements of managing fixed-income portfolios and introduces specific portfolio management strategies. </p><p style=\"\">The second reading discusses additional relative-value methodologies.</p><p style=\"\">Taking this will hep the students complete the perpetration for Fixed Income portfolio management in less than 5 hours, which would otherwise by self study take 20-25 hours!</p>", 
    "end_date": null, 
    "title": "Fixed Income Portfolio Management for CFA Level 3 2016", 
    "price": "20.00", 
    "instructors": "Tanuja Yadav", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/583158_5220_4.jpg", 
    "course_url": "https://www.udemy.com/fixed-income-portfolio-management-for-cfa-level-3/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T16:48:51Z"
}