{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course you’ll learn everything you need to know about the various travel related diseases transmitted by food and water. You will learn about specific diseases, and how they are transmitted, treated and prevented, as well as learning methods for quickly teaching others the important points in a concise manner. </p>\n\n\n\n\n\n\n\n<p>You’ll be introduced to a unique framework called the 5Ts of tropical disease, which will be use to walk you through diseases such as Hepatitis A, Typhoid, Polio, and Traveller’s Diarrhoea. You’ll learn a host of interesting facts about each disease which you can take back to your consultations, and there are load of resources to help you remember all the important points.</p>\n\n\n\n\n\n\n\n<p>This course is particularly suitable for travel health professionals who will be delivering health advice to travellers who are heading to parts of the world with increased health risks. Some of the content is particularly aimed at professionals from the UK, though the vast majority will be beneficial for health professionals or students from any part of the world, who wish to gain a better knowledge of the diseases related to food and water hygiene.</p>\n\n\n\n\n\n\n\n<p>The course is a combination of video presentations, written lectures and maps, and multiple choice exams to test your knowledge. There are a number of PDF resources to download. It should take less than two hours to complete.</p>", 
    "end_date": null, 
    "title": "Food and Waterborne Diseases for Health Professionals", 
    "price": "20.00", 
    "instructors": "Euan Naismith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/763516_69eb_3.jpg", 
    "course_url": "https://www.udemy.com/food-and-waterborne-diseases-for-health-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-15T20:23:29Z"
}