{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<em>LATEST: Course Updated On September, 2015 </em>  </p>  <ul>  \t<li><em>How To Raise Money With Bitcoin (revolutionary new currency)!</em></li>  \t<li><em>3 websites that helps you raise money for your business</em></li>  \t<li><em>Extra resources for finding and getting grants</em></li>  \t<li><em>New section with very unusual ways to get money for your business</em></li><li><em>Most lectures updated to have improved audio and video quality</em></li></ul>    <p style=\"\">  \t<em>* OVER 4,500 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE</em>  </p>    <p style=\"\">  \t                                                Learn exactly how to raise money for your project! This course presents over 10 unique and actionable ways to raise money, and how to go about raising money using each particular strategy. If you are in the process of raising money for your business, or are wondering how and where to start with your fundraising efforts, this course will shed light on what is possible. You will learn many actionable and very practical ways to raise money.  </p>  <p style=\"\">  \t<strong>Who This Course Is For:</strong>  </p>  <ul>  \t<li>People who have a business idea and need funding to get started</li>  \t<li>People with active businesses who need funding to grow and improve their product</li>  </ul>  <p style=\"\">  \t<strong>Personal Touch And Support</strong>  </p>  <p style=\"\">  \t                                            In addition to the lectures, you get my help and advice! Students are able to start public discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses, and I look forward to helping you.  </p>  <p style=\"\">  \t<strong>Not Sure If The Strategies In This Course Will Help You Raise $100,000?</strong>  </p>  <p style=\"\">  \t                                If I was in your shoes, I would wonder the same thing. To be honest with you, not all strategies presented in this course will work for you. That is why this course gives you a <strong>very wide range of strategies to raise money</strong>. While not all fundraising strategies presented in this course will work for you, some of the strategies in this course should definitely help you raise money.  </p>  <p style=\"\">  \t                                You may end up raising more or less than $100,000. That will be up to how hard you work at it, and how well you will apply the strategies in this course, and how well you execute the strategies.  </p>  <p style=\"\">  \t                    If you combine a number of the strategies presented in this course you should be able to reach the sum of $100,000 and in many cases even more.  </p>  <p style=\"\">  \t                                Give it a try. There isn't much to lose. The course is backed by a 30-day money back guarantee from Udemy. So if you don't feel that this course helped you, you can just get a refund.  </p>  <p style=\"\">  \t<strong>Why It Is Important That You Take This Course</strong>  </p>  <p style=\"\">  \t                There are some courses that push you towards investors, or loans or crowdfunding. But they are all narrow because they just focus on one strategy. After taking this course, you will have a very broad view of all the possible ways to raise money. You will be like a general overseeing the full battlefield instead of a soldier just blindly following what people say you should do.  </p>  <p style=\"\">  \t                You will be able to choose the path that is right for your unique situation and business. And that will help you to become a stronger business person, raise the money you need, and grow your business.  </p>  <p style=\"\">  \t<strong>I understand how you feel</strong>  </p>  <p style=\"\">  \t            I am a small business owner just like you and I help many business owners almost every day. Trust me, I understand how difficult, confusing and stressful it might be for you to start a business with no money and no support. I made this course to empower you to make confident and correct decisions, and take your business in the right direction.  </p>  <p style=\"\">  \t<strong>First part of the course:</strong>  </p>  <p style=\"\">  \t                                            General fundraising fundamentals to help you understand how much money you need to raise, and help you feel comfortable with ins and outs of raising money.  </p>  <p style=\"\">  \t<strong>                                                                 Second part of the course:</strong>  </p>  <p style=\"\">  \t                                            Raising money from institutions by getting  </p>  <ul>  \t<li>Loans</li>  \t<li>Donations</li>  \t<li>Investments </li>  \t<li>Grants</li>  </ul>  <p style=\"\">  \t<strong>Third part of the course:</strong>  </p>  <p style=\"\">  \t                                            In this part of the course I go over many out of the box, creative and resourceful ways to raise money.  </p>  <p style=\"\">  \t<strong>NEW! Fourth part of the course:</strong>  </p>  <p style=\"\">  \t                                            The fourth part of the course has tips on how to raise money for mobile apps.  </p>  <p style=\"\">  \t<strong>Who should take this course:</strong>  </p>  <p style=\"\">  \t                                                                                                                    You should take the course if you need to raise money for your business. If you are hoping to get an investment, loans, grants, or maybe raising donations via crowdfunding, this is the course for you because it covers a wide variety of ways that you can raise money. Not all businesses will find each of the strategies effective, but surely, with such a wide variety of fundraising strategies, the course has something for just about any business or organization.  </p>  <p style=\"\">  \t<strong>How This Course Was Born</strong>  </p>  <p style=\"\">  \t                                                                                                                   Here is the story of how the material for the course was made. I originally created the Problemio mobile apps which are some of the top apps for entrepreneurs who are planning to start a business. Those apps now have over 500,000 downloads across iOS, Android and Kindle. A great majority of the entrepreneurs who used the apps needed to raise money. To help them, I had to research all the different ways to raise money that they could use. And this course is the summation of all those ways to raise money, and my continuing efforts to keep finding new ways to help entrepreneurs raise money.  </p>  <p style=\"\">  \t                                                                                    The course will take between 1 to 2 hours to complete. It is almost entirely video, which is the preferred Udemy course content type!  </p>  <p style=\"\">  \t                                                                                                             I sincerely hope you find the course helpful and insightful. I wish you best of luck with your business, hope to see you on the inside of the course!  </p>  <p style=\"\">  \t                                                                                                     +++++++++++++++++++++++++++++  </p>  <p style=\"\">  \t                                                                                                     MONEY BACK GUARANTEE  </p>  <p style=\"\">  \t<em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Fundraising Tips and Strategies for Raising Capital", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/178242_d12a_3.jpg", 
    "course_url": "https://www.udemy.com/fundraising-tips-and-strategies-for-raising-capital/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-07T01:20:42Z"
}