{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>How to Start  YOUR OWN PASSIVE GAME APPLICATIONS And Jump  Into $4,5 Billion Mobile Game  App Business!</strong></p><p>Maksym Vysochanskiy here, today we want to talk to you about MOBILE GAME applications. You and I know that during the last year the world is going crazy about Iphones &amp; Android about mobile applications and mobile sites. Big sharks like Google are buying around many mobile companies. Just look at those crazy numbers of downloads in the Istore for applications! Since the opening of the iPhone Apps store there have been 75 BILLION apps downloaded. That is insane! That is such a huge market. I is a real Gold Rush in the applications market right now.</p><p>- That's why I can't simply sit and watch how many applications are making 100K every single DAY!!! </p><p>- That's why for the last 3 years I have spent 100% of my time on developing different applications. </p><p>- That's why we developed a game app business which is earning money while we sleep!</p><p>- That's why we found a way to make game apps within 10 minutes and helped thousands of other developers!</p><p>And I bet that you are like me and don't want to loose this great opportunity to start your mobile business right now! </p><p>That's it.</p><p><strong>Stop Wondering How To Start A Games Application </strong><strong>Business. </strong></p><p>We are Ready To Reveal All Our SECRETS</p><p>  In this crash course you will Learn Our SUPER tricks &amp; AWESOME methods to MAKE and MARKET Applications</p><p> <strong>--&gt; <span> 15 Easy To Follow Videos</span> &lt;--</strong></p><p><strong> --&gt; <span> Over 75 Minutes of Super Content </span> &lt;--</strong><span><strong> Here is What Your Are Going To Learn</strong></span></p><p>1. Why do you need to start game apps business?</p><p>2. Which game apps to make and how to use keyword tool?</p><p>3. How to Make Your Game #1 App in 10 minutes?</p><p>4. Game #2 app case study</p><p>5. How to make Puzzles And Memo Games?</p><p>6. How to Clone Angry Birds App without coding?</p><p>7. Where and how to add sounds to your app?</p><p>8. How to combine different games into one app?</p><p>9. Where to find FREE images and edit them for FREE?</p><p>10. How correctly to use Splash Screen?</p><p>11. How to insert ad banners from iAds, Admob, Revmob</p><p>12. How to Publish Your Apps on Marketplaces?</p><p>13. How to grow your app business?</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Game Apps - How To Make Games For iPhone, Android, Windows", 
    "price": 0, 
    "instructors": "Maksym V", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577894_dc8b_2.jpg", 
    "course_url": "https://www.udemy.com/game-apps-how-to-make-games-for-iphone-android-windows/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T07:18:42Z"
}