{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Genealogy Photo Editing, Care and Repair</strong> is a course designed for genealogists who want to learn how to repair or preserve old photos and documents. You'll learn the most common kinds of damage to expect, and how to stop the progression. You'll learn about storage materials, what to use and what can cause further damage. And you'll also learn some easy techniques to repair digital copies of your photos and documents, and make them look like new.</p>\n\n<p>Environment is one of the biggest causes of damage, and you'll learn why the basement or attic is the worst choice for storing your fragile paper items. </p>\n\n\n\n\n\n<p>Before we can begin repairing and editing your photos or documents, you will need to digitize them. You'll learn how to use a scanner, camera, smartphone or hand-held scanner for digitizing. </p>\n\n\n\n\n\n<p>Then you'll need some image editing software to repair the damage to your digitized images. We'll review some different software packages, and you'll get links to several. Some are freeware and some paid. You can download the freeware, or demos of the paid versions, and use them for this course. </p>\n\n\n\n\n\n<p>With these tools you'll be ready to start repairing your photos. There are tutorials to show you how to make different corrections and which tools to use. The course includes several images that you can practice on until you learn to use the editing tools and are confident enough work on your own photos. </p>\n\n\n\n\n\n<p>As usual, my courses come with a detailed textbook that contains all of the links I refer to, and other downloads that you can use for the exercises or further study. </p>\n\n\n\n\n\n<p>Sign up above, and I'll see you in class.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Genealogy Photo Editing, Care and Repair", 
    "price": "40.00", 
    "instructors": "Michele Boyer", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437690_07b9_2.jpg", 
    "course_url": "https://www.udemy.com/genealogy-photo-care-repair/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T16:58:27Z"
}