{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t                                                                                  ***** ÚLTIMA  ACTUALIZACIÓN: 8 Junio 2016*****  </p>\n\n<p><em>¡1000+ estudiantes exitosos que se han enrolado ya a este curso! </em></p>\n\n<p><strong>¿Cómo lograr agilidad y entregar más valor utilizando la filosofía y técnicas \"Just-In-Time\" del altamente eficiente Sistema de Producción de Toyota?</strong></p>\n\n<p>  \t<strong>¿Cómo podemos eliminar el desperdicio y optimizar TODO el Ciclo de Desarrollo de Software desde que el cliente solicita un requerimiento hasta que se le entrega?</strong>  </p>\n\n<p>  \t<strong>¿Cómo  lograr mejoras sustanciales en nuestro proceso, en qué nos debemos enfocar y qué preguntas nos debemos hacer ?</strong>  </p>\n\n<p>  \t                                                                                                                                              ¡Este curso te dará las respuestas a estas preguntas! <strong>El pensamiento Lean es lo que diferencia a un profesional estándar de uno excepcional.</strong> Algunos lo relacionan con tener un nivel de sentido común avanzado para tomar decisiones con orden, coherencia lógica y pensamiento sistémico.  </p>\n\n<p>  \t                                  Si eres un profesional que busca un proceso de desarrollo de software altamente efectivo con una base filosófica <strong>100% práctica</strong> que perdure en el tiempo, este curso te será muy útil. Además contarás con herramientas para que de manera rápida tomes acción logrando:  </p>\n\n<ul>  \t<li><strong>Aprender una base filosófica efectiva, fácil de entender y aplicable para mejorar no solo en software sino en otros ámbitos  \t</strong></li>  \t<li><strong>Facilitar la formación de equipos efectivos y productivos  \t</strong></li>  \t<li><strong>Tomar mejores decisiones y tomarlas “Just-In-Time\"  \t</strong></li>  \t<li><strong>Utilizar el conocimiento que se genera en proyectos de manera más efectiva  \t</strong></li>  \t<li><strong>Entregar software rápido y con calidad optimizando el todo  \t</strong></li>  \t<li><strong>Incorporar la calidad como algo inherente a tu proceso, desde temprano  \t</strong></li>  \t<li><strong>Visualizar y eliminar el desperdicio en el proceso de desarrollo de software  \t</strong></li>  \t<li><strong>Agilizar el marco metodológico o gestión que utilizas en tus</strong> <strong>proyectos</strong></li>  </ul>\n\n<p>  \t                                                                                                                                                  *************************************************************************************  </p>\n\n<p>  \t                            Este curso no te presenta una metodología que te explica paso a paso qué debes hacer en cada situación, es mucho más poderoso que eso. <strong>Los principios de Lean Software Development te permitirán tomar mejores decisiones que impactarán positivamente en el resultado de tus proyectos a todo nivel.</strong>  </p>\n\n<p>  \t                                                                                                                                                  *****************************************************************************************  </p>\n\n<p>  \t                                                                                                                                                  Podrás potenciar tu liderazgo ayudando a tu equipo a cambiar y superarse descubriendo situaciones que generan desperdicio en los proyectos.  </p>\n\n<p>  \t                                                                                                                                                  Te sorprenderás de la cantidad de desperdicio que se generan en los proyectos por ciertas actitudes y creencias que se consideran aceptables en la industria. En este curso aprenderás a optimizar TODO tu ciclo de desarrollo de software con principios que tienen su base en el sentido común.  </p>\n\n<p>  \t<strong>Mejorarán los tiempos de entrega de tu equipo, </strong><strong>pero para entregar más rápido necesitarán calidad y eliminar el desperdicio en el proceso de desarrollo de software, el curso provee los fundamentos para comenzar a hacerlo. </strong>  </p>\n\n<p>  \t                                                                                                                                                  Además si ya utilizas o piensas adoptar metodologías ágiles en el futuro, ¡los fundamentos estudiados aquí potenciará cualquier marco, método o técnica que utilices (Kanban, Scrum, XP, TDD, etc)!  </p>\n\n<p>  \t<em>Si algo no te quedó claro contestaré preguntas propuestas en la sección de discusión. </em></p>\n\n<p><strong>Un punto final importante a tener en cuenta, ¿has pensado que en este momento se podrían estar dando situaciones que generen alguna forma de desperdicio en tus proyectos? ten en cuenta que cada minuto que pasa y no eres consciente de esto ¡se consume parte del presupuesto de tu proyecto! ¡Registrate haciendo click al botón \"Toma este curso\", empieza a aprender y aplicar estos conceptos poderosos y efectivos!</strong><br></p>", 
    "end_date": null, 
    "title": "Gestión de Proyectos exitosa con Lean Software Development", 
    "price": "20.00", 
    "instructors": "Manolo Mazan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380988_b49f_2.jpg", 
    "course_url": "https://www.udemy.com/aplica-lean-desarrolla-software-just-in-time-y-con-calidad/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T17:32:04Z"
}