{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>David Allen's <strong class=\"redactor-inline-converted\">Getting Things Done(®)</strong> or <strong class=\"redactor-inline-converted\">GTD(®) </strong>system is a world-famous productivity system. <strong class=\"redactor-inline-converted\"> IQTell(®)</strong> is one of the leading software implementations of the GTD model. Learn both in under an hour in this fast-paced  training sequence, which is guaranteed to give you concepts and tools that will change your life, or money-back!<br></p>\n\n\n\n<p>Being productive requires a <em class=\"redactor-inline-converted\">mindset, a system, and a tool.</em>  GTD provides the <em class=\"redactor-inline-converted\">mindset </em>and the <em class=\"redactor-inline-converted\">system</em>, and is a powerful model for managing tasks, goals and ideas -- all the things that your life is made of, and upon which your success depends. IQTell provides the <em class=\"redactor-inline-converted\">tool</em>.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here is what you will learn: </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>A conceptual and practical understanding of the GTD® system</li><li>We will put the IQTell software in context, comparing it with other applications designed for GTD®, CRM (Customer Relationship Management) and Project Management</li><li>And then guide you step-by-step through the IQTell software into a complete GTD implementation for your business or personal life</li><li>Which will more than likely change the way you organize and run your business and your life, because you will learn both a method and a tool in which all the data you need is in a single place and organized how you want it </li><li>Anybody can benefit from this information: students, entrepreneurs, contractors, clergy, moms</li><li>The only requirement for getting something out of this course is that you have work to do and that you want to better manage, prioritize, or reflect on your current tasks and life goals!</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">GTD is the world's most famous productivity system...</strong><br></p>\n\n\n\n\n\n\n\n<p>But it's also famously complex and difficult to understand and implement.  But not any more! With the quick and yet comprehensive GTD summaries provided in this course, and the help of the IQTell software, you will be well on your way to what we call \"Productivity Holy Grail\"\n\n</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">About your instructor</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>I am a best-selling Udemy instructor (25k students, 200+ reviews)</li><li>A successful entrepreneur myself, I use these ideas and tools in my own business every day</li><li>I will not waste your time! Teaching you only what you need to know</li><li>Learn through screen-shares and examples / actual use-cases</li><li>Covering all the major functions of the IQTell software</li><li>Backed-up by Powerpoints with explanations of GTD concepts and data types</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">***Bonus Offer***</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Purchase this course and then follow the instructions to get your free instructor coupon to the <strong class=\"redactor-inline-converted\">GTD and IQTell Advanced Course</strong>, which goes deeper into the GTD model and also covers more advanced functions of the IQTell software such as collaboration, form designer, etc.<br></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>______</p>\n\n\n\n\n\n\n\n<p>GTD® and Getting Things Done® are trademarks of David Allen Companies.</p>\n\n\n\n\n\n\n\n<p>IQTell® is a trademark of IQTell, Inc.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Get It Done with IQTell: Best App for GTD® and Inbox Zero", 
    "price": "20.00", 
    "instructors": "Marc Beneteau", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830396_f5eb.jpg", 
    "course_url": "https://www.udemy.com/gettingthingsdone/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T04:11:47Z"
}