{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Time is money. If you are paying for an Infusionsoft software application you will want to get it to produce a return on your investment (ROI) as soon as possible.</p><p style=\"\">A common challenge that new customers face is knowing what to do - and when - to quickly get up and running with the software. </p><p style=\"\">In this course, we will walk through the exact process for getting started quickly and easily with Infusionsoft.</p><ul style=\"\"><li>This is a basic level Infusionsoft software training course. <strong style=\"\">This course is perfect for new Infusionsoft customers who are ready to set up their software quickly and begin using it in their business. </strong><span></span><em style=\"\">If you are currently working with your Kickstart coach, this course will help you accomplish more with your coach because you will not have to spend your Kickstart consulting hours on app setup or basic app training.</em></li></ul><ul style=\"\"><li>This course is also useful for existing customers who do not feel they are using the software to it fullest capabilities. You likely do note have all of the foundations in place which is holding you back from being efficient in the software.</li></ul><ul style=\"\"><li>This course will also be useful for people considering Infusionsoft so you can see how easy it is to get up and running with the software when you have a system to follow.</li></ul><p style=\"\"><strong style=\"\">Included are 30 Modules and over 4 hours of training.</strong> Also, as a student in this course, you have access to an Infusionsoft Certified Consultant (Jessica Maes) who has over 5 years of experience using Infusionsoft daily through our course discussion area.</p>", 
    "end_date": null, 
    "title": "Get Started Quickly (and Easily) With Infusionsoft", 
    "price": "50.00", 
    "instructors": "Jessica Maes", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428528_14c8_5.jpg", 
    "course_url": "https://www.udemy.com/get-started-with-infusionsoft-in-48-hours-or-less/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T16:15:26Z"
}