{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">During this Intro to Smartphones video training course, you will learn key overviews of smartphones and their key features. We will cover a number of basic safety related issues as well as some practical examples of contacts, backup and remote access. As a lot of things are changing and we cover some newer features such as 2-step verification. We will also cover some often overlooked features such as placing a web shortcut on your phone. </p><p style=\"\">The overview includes Android, iPhone, Windows and Mac&#039;s and how both the Google and Apple eco-systems work to make life easier.<br style=\"\"></p><p style=\"\">It&#039;s not all about practical tips, as we cover a few fun and interesting topics, including how to get a better night&#039;s sleep by changing the settings on your phone. As I have often heard the phrase there&#039;s an app for everyone, we end with a list, of fun, cool and practical apps.</p><p style=\"\">This is a great overview for anyone and should leave you knowing some of the great possibilities on your phone. This should prepare you for taking a deeper dive into some of the more detailed and complex features and apps. Stay on the lookout for some additional smartphone courses coming soon.</p><p style=\"\">The course is structured with videos on each topic and a copy of the material with useful links for each topic. You should complete the entire course and then go back to any section you found useful or interesting and download the material. A complete copy of the presentation is also provided for your reference.</p><p style=\"\"><strong style=\"\"><u style=\"\">This course includes a quiz and certificate of completion.</u></strong><u style=\"\"></u></p><p style=\"\">This course was made in high-definition and is best viewed with the DH setting on and with the videos enlarged. Feedback is a critical part of an online course. Once you have completed the course, providing comments helps improve the course and benefits everyone!</p>", 
    "end_date": null, 
    "title": "Getting the most from your Smartphone", 
    "price": 0, 
    "instructors": "Tom Lahey", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325892_07e6_5.jpg", 
    "course_url": "https://www.udemy.com/introtosmartphones/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T18:42:57Z"
}