{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \tI created this course because I receive more questions from viewers, friends and even family about Evernote than for any other topic!  </p>  <p style=\"\">  \t<em style=\"\">Everyone wants to be more organized, more efficient and more together.</em>  </p>  <p style=\"\">  \tEvernote is the tool I use at the heart of my personal productivity system, and I have poured everything I know about Evernote into this course!  </p>  <p style=\"\">  \tIf You:  </p>  <p style=\"\">  \tNeed to be more organized but don&#039;t have time to figure it out for yourself.  </p>  <p style=\"\">  \tWant to become more productive, more organized but you can&#039;t seem to get it together.  </p>  <p style=\"\">  \tAre looking for the fastest way to learn and implement Evernote in your life.  </p>  <p style=\"\">  \tDevelop an Evernote Habit! Let me help you to learn the right way, the easy way, the best way!  </p>  <p style=\"\">  \tExperts tell us it takes AT LEAST 21 days to foster a good habit.  </p>  <p style=\"\">  \tCommit to embracing Evernote for a month  </p>  <p style=\"\">  \tBy the end of the course you will have all the skills you need to use Evernote effectively  </p>  <p style=\"\">  \tBy the end of the month, Evernote will be an integral part of your success!  </p>  <p style=\"\">  \tEvernote Means You Always Know Where Your &quot;Stuff&quot; Is  </p>  <p style=\"\">  \tEvernote Means:  </p>  <p style=\"\">  \tknowing where to put everything  </p>  <p style=\"\">  \thaving everything at your fingertips  </p>  <p style=\"\">  \tknowing you can find it again when you need it, where you need it.  </p>  <p style=\"\">  \tLearning the Evernote Way  </p>  <p style=\"\">  \tEvernote is unique, because it is not tied to a single device or place. It goes with you everywhere, and you can access it on all your devices.  </p>  <p style=\"\">  \tOnce you embrace Evernote as your digital partner, you will never wonder where you have stored a piece of information.  </p>  <p style=\"\">  \tYou will never have to say to someone, &quot;I will get back to you on that.&quot;  </p>  <p style=\"\">  \tVideo Training at it&#039;s best  </p>  <p style=\"\">  \tLessons will be delivered as videos, with supporting documents. The videos are engaging, informative and information dense.  </p>  <p style=\"\">  \tOffice Hours:  </p>  <p style=\"\">  \tEvery Friday at 10 am eastern (unless posted otherwise) as a google plus hangout  </p>", 
    "end_date": null, 
    "title": "Getting Started with Evernote", 
    "price": "20.00", 
    "instructors": "Justin Lawrie", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422934_5e24_5.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-evernote/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T02:41:38Z"
}