{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Become apart of the Git train, it's mandatory if you want to work with any stable company, or even a start up company! </p><p>Note:</p><ul><li>This course is not meant to be looked at as comprehensive on the topics of Git, Bitbucket, and SourceTree. </li><li>This course is meant to be treated as an introduction to the topics of Git, Bitbucket, and SourceTree. Once you complete the course, you will be able to dive deeper into the topics introduced.</li></ul><p>Let me tell you a little bit about the course:</p><ul><li>We start off the course by defining Version Control and Git.</li><li>We then go over the Git Glossary, which are the practical terms used for Git.</li></ul>After we know the basics of git, we are going to practice it in the command line:<ul><li>We will first install Git.</li><li>We will go over the basics of the command line like navigating through directories, etc.</li><li>Then we will practice git, and go through the process of executing git commands, anything and everything from staging, committing,  viewing the history of commits, etc.</li></ul>Once we feel comfortable with executing Git commands, we are going to be introduced to SourceTree:<ul><li>We will install SourceTree.</li><li>We will mimic our example from the command line and do it in SourceTree.</li><li>Once we have done things locally, we will move to Bitbucket.</li><li>We will learn everything from cloning a repository, all the way to pushing up local commits.</li></ul>After all is finished there will be a challenge that I encourage you to attempt on your own. After your attempt, there is a solution video that will walk you through the challenge.<p>Git is mandatory if you want to be a developer, so it's not a matter of if you should learn it, it's a matter of when you should, and you should now!</p>", 
    "end_date": null, 
    "title": "Git with Bitbucket and SourceTree", 
    "price": "20.00", 
    "instructors": "Justin Rose", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578950_41de.jpg", 
    "course_url": "https://www.udemy.com/git-with-bitbucket-and-sourcetree/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T11:27:02Z"
}