{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  In this course we will teach you how to use Git, and we will explain how version control can help you solve everyday tasks. This course will be useful to those of you who have never used version control, have little experience or maybe just need a bit of guidance during the first steps.  </p>  <p>  \t<strong>What makes this course different?</strong>  </p>  <p>  \t  There are many free courses online, but we couldn’t find one, that would answer all the questions raised by beginner developers. Most of the courses assume that you already know this or that. That’s why they show you HOW to use Git, but they don’t give you an understanding what’s going on behind the scenes.  </p>  <p>  \t  And that’s what we do in this course. On every step, in every lecture you will know exactly what’s going on and why. In simple English.  </p>  <p>  \t<strong>What will this course give you?</strong>  </p>  <ul>  \t<li>You will learn how to use a must-know tool for every developer.</li>  \t<li>You will become a much more productive and efficient developer and you will be worth more money.</li>  \t<li>From an absolute beginner, you will turn into a pro, in almost no time.</li>  </ul>  <p>  \t<strong>Other benefits of this course</strong>  </p>  <ul>  \t<li>You will learn how to use Github and Bitbucket.</li>  \t<li>Your code will be safe and you will gain much more control over it.</li>  \t<li>You will master a new way of collaboration with other developers.</li>  \t<li>You can start taking part in open-source projects.</li>  </ul>  <p>  \tIf you apply for a job as a developer, 95% of the companies will expect you to know version control (mostly Git), and after this course you will.  </p>  <p>  \tGit will make you a better developer, that’s for sure. Enjoy the ride!  </p>", 
    "end_date": null, 
    "title": "Git for Absolute Beginners", 
    "price": "40.00", 
    "instructors": "Alex Varganov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/344808_6701.jpg", 
    "course_url": "https://www.udemy.com/git-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-15T01:51:00Z"
}