{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>\"Prognosis? It's about six months. I'm sorry.\"</strong></p><p>Nobody wants to hear words like that from a doctor, especially of your mom.</p><p>I remember it like it was yesterday. It was 5:10pm on an early Friday evening.<br></p><p>Although the news was of my mother, hearing those words I felt as though it were my diagnosis.</p><p><strong>A million thoughts then raced through my mind:</strong></p><ul><li>What does that mean?</li><li>How do I tell her?</li><li>How will she react?</li><li>Will she die?</li><li>Will she suffer?</li><li>What do we do next?</li><li>What do <strong><em>I</em></strong> do next?</li><li>etc...</li></ul><p>The next few weeks were a dizzy blur of doctors appointments, tests, scans, crying, laughing, and everything in between.</p><p>We talked to 9 doctors in the first three weeks. 7 contradicted the other 2 on the best course of action. 8 gave her 6 months. The 9th gave her 6-12 months.</p><p><strong>I'm happy to say that this Feb 2016 marks 5 years since my mom's initial diagnosis of stage 4 lung cancer.</strong></p><p>But it hasn't been easy.  During that time, we've had many downs and many ups. We've learned a lot as a family.</p><p><strong>I've learned a lot as a caregiver. </strong></p><p><strong><strong><strong>________________________________________________</strong><br></strong></strong></p><p><strong><strong>And I put all of those lessons into this course in the hopes that it can help you and your family if you find yourself in similar circumstances.</strong></strong></p><p>I'm also gathering and documenting the best tips and advice from a number of other caregivers, doctors, and otherwise awesome individuals who just want to help out.</p><p><strong>This course is a work in progress. </strong></p><p>This is just the start and more content will be added in the coming weeks and months!</p><p><strong>________________________________________________</strong></p><p><strong>Who is the course for?</strong><br></p><p><strong>The caregivers: </strong>It's for you if you find yourself (suddenly) thrust into the role of caring for a loved one who is facing serious or terminal illness and want strategies, tips, and best practices to help you give your best care.</p><p><strong>The care receivers:</strong> It's for those of you who are receiving care from a loved one for your serious illness and want to better understand what they're going through and how you could best support their efforts in caring for you. Help them help you!</p><p><strong>The care supporters:</strong> It's for those of you who are family, significant others, friends, or colleagues to a caregiver and want to know how best to support them.</p><p><strong></strong><strong>________________________________________________</strong><br></p><p><strong>What's not in the course?</strong><br></p><p>Because every ones medical situation or illness is different and I am not a medical doctor, I will not be providing any medical advice for good reason.</p><p>What I will provide are strategies, tips, tools, links to resources, and other daily practices that have helped me as a caregiver</p><p><strong>________________________________________________</strong><br></p><p><strong>Why did you make this course?</strong></p><p>So many things I know now that I wish I knew at the very beginning. I would have felt less lost, less overwhelmed, and less stressed. I would have been able to give my mom even better care.</p><p>So I hope I could help others who are at earlier stages of their own journeys.</p><p>But I'm still learning and looking for ways to do better. With your feedback, I'm sure I'll also learn from you new ways to improve the care that I could continue to give my mom.<br></p><p>Plus, it would really make my mom smile knowing that our experience might be helping others, even complete strangers.</p><p>Lastly, I made a bet with my mom that we'll be able help at least one person. She's skeptical but I think I'm going to win this bet. Help me win this bet!</p><p><strong>________________________________________________</strong><br></p><p><strong>How can I help?</strong></p><p>If you think a friend or colleague who is facing similar circumstances could benefit from taking this course, please forward it to them.</p><p>This course will always remain FREE to everyone and anyone who could potentially benefit.</p>", 
    "end_date": null, 
    "title": "Give Your Best Care: A Caregiver's Guide", 
    "price": 0, 
    "instructors": "Symon He", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/652704_6298_3.jpg", 
    "course_url": "https://www.udemy.com/give-your-best-care/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T20:29:41Z"
}