{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  The Federal government sets aside multi-million dollar procurement opportunities for small  businesses just like yours.  To qualify for a <em>“small business set-aside”</em> you must  first be a for-profit business and meet the small business size  standard for the NAICS (North American Industrial Classification System) code that government contracting officers assign to the  procurement.  </p>  <p>  \t  Before  you do business with the government, you&#039;ll need to know these codes – in  particular, <strong>NAICS</strong> and <strong>SIC</strong>. They&#039;re essential for your  company to have in place before it pursues and wins government contract  work.  </p>  <p>  \t<strong>In this course, we teach you how to:</strong>  </p>  <p>  \t<strong>1.</strong> How to locate federal, state and local government contracting opportunities by NAIC codes<br>  </p>  <p>  \t<strong>2.</strong> Explain sub-contracting and why it is critical for building business profits  </p>  <p>  \t<strong>3.</strong> Why whether you have one employee or more, big government contractors are <em><strong>REQUIRED</strong></em> to do business with your company  </p>  <p>  \t<strong>4. </strong>How to easily locate NAIC and SIC Codes to help your company stand out from competitors  </p>  <p>  \t<strong>5. </strong>How to read and understand sub-contracting &#039;solicitations&#039;  </p>  <p>  \tReceiving lucrative government contracts is the difference between a successful business and one that fails. It all begins with mastering &#039;coding&#039; <strong>so join us today</strong>!  </p>", 
    "end_date": null, 
    "title": "Government Contracts Coding", 
    "price": "20.00", 
    "instructors": "Brian Dale", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/335842_4d27_2.jpg", 
    "course_url": "https://www.udemy.com/government-contracts-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-04T18:11:54Z"
}