{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t      This course is designed for nonprofits that want to not only get better at writing successful proposals, but also get better at the process of researching and applying for foundation and government grants. The course is also for grant writers or freelance writers who want to offer their clients a more comprehensive approach to grant writing.  </p>  <p style=\"\">  \t<strong style=\"\">When you’re done with the course, you’ll have assembled one of the most powerful tools a nonprofit can have – a proposal boilerplate.</strong>  </p>  <p style=\"\">  \t    The boilerplate contains about 75% of the language you’ll need as you’re drafting proposals. Working on the boilerplate outside the pressure of a proposal deadline will result in language that is better-written, as well as more thoughtful and strategic. It will also set you up to be uber-efficient as you’re writing proposals in the future.  </p>  <p style=\"\">  \t    Throughout this course we&#039;ll be using <strong style=\"\">real examples</strong> and <strong style=\"\">real language</strong>, and <strong style=\"\">each lesson includes a transcript, so you can kickstart your own boilerplate</strong>.  </p>  <p style=\"\">  \t      You’ll also be given strategies and tips for finding foundation and government grants, including:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Identifying five relevant local foundations<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Gathering information about grants at the local, state, and federal level for you to start pursuing</strong></li>  </ul>  <p style=\"\">  \t      Finally, we’ll be walking through key strategies for completing solid applications, including:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Letters of intent<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">The budget<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Meeting a funder’s expectations</strong></li>  </ul>  <p style=\"\">  \t      Each video session includes two downloads: a PDF of the slides in handout format, and a Word document transcript.  </p>", 
    "end_date": null, 
    "title": "Grant Writing for Nonprofits and Freelance Writers", 
    "price": "20.00", 
    "instructors": "Tim Whitney", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397354_f0df_2.jpg", 
    "course_url": "https://www.udemy.com/grant-writing-for-nonprofits-and-freelance-writers/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T17:10:31Z"
}