{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    Attention experienced grant writers:  </p>  <p style=\"\">  \t    Have you written at least <strong style=\"\">5 successful grant proposals</strong> over the past 7 years and have a minimum of <strong style=\"\">3 years of professional experience in the grants field</strong> within the last 5 years? If &quot;yes&quot;, you may be eligible to take the Grant Professional Certification (GPC) exam and become certified. This course is perfect for you!  </p>  <p class=\"PIN_1373148167584_hazClick\" style=\"\">  \t    The GPC Exam Prep home study course helps you <strong style=\"\">become certified </strong>by helping you complete your  eligibility packet and preparing you to pass the GPC Exam! It includes <strong style=\"\">polls, group discussions, scenarios (case studies), presentations, Google library</strong>, <strong class=\"PIN_1373148167584_hazClick\" style=\"\">orientation</strong> and <strong style=\"\">unique practice exam.</strong>  </p>  <p style=\"\">  \t    The GPC exam (and practice exam) have two parts: a <strong style=\"\">writing sample</strong> and <strong style=\"\">multiple choice section</strong>. Some  skills measured include funder research, project design,  crafting an effective grant application, post-award management, ethics, and  writing a convincing case for funding.  </p>  <p style=\"\">  \t    GPC Exam Prep covers all <strong style=\"\">9 core exam  competencies</strong> and <strong style=\"\">65 sub-competencies</strong>. It was designed by certified faculty.  </p>  <p style=\"\">  \t    The GPC Exam is independently administered by the Grant Professionals Certification Institute (GPCI). Cost for taking the GPC exam is separate. GPC Exam Prep is for <strong style=\"\">advanced grant writers</strong>.  </p>", 
    "end_date": null, 
    "title": "Grant Professional Certification (GPC) Exam Prep", 
    "price": "45.00", 
    "instructors": "Phil Johncock", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40978_9bf5_5.jpg", 
    "course_url": "https://www.udemy.com/grant-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-10T06:21:29Z"
}