{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Imagina crear un entorno arquitectónico y tener la posibilidad de recorrerlo libremente, o mejor aún, convertir esto en una habilidad más con la cual poder ofrecer servicios al mercado de los bienes raíces.</p><p>Es posible, y lo mejor, es bastante sencillo de lograr, usando las herramientas que te voy a dar en este curso, con las cuales podrás explotar tu profesión y obtener una fuente más sustentable de ingresos.</p><p>Si eres arquitecto, este curso puede darle un <strong>PLUS</strong> a tus proyectos arquitectónicos, ya que no solo vas a poder mostrar tus trabajos, sino podrás hacer que <strong>las personas lo vivan.</strong></p><p>Si eres artista 3D, podrás ofrecer estos servicios al mercado de las bienes raíces, y lo mejor de todo es que, al estar ofreciendo una aplicación de software (esencialmente) los <strong>réditos económicos pueden ser enormes.</strong></p><p>Si eres una persona con otra profesión, y no conoces nada de arquitectura ni de diseño 3D, <strong>puedes tomar el curso igualmente</strong>, ya que en el primer módulo se ofrece, de forma rápida, varias clases en las que armamos un modelo 3D simple de un departamento para el recorrido virtual.</p><p>Por otro lado, <strong>tampoco se necesita saber de programación</strong>, ya que en el curso usaremos scripts simples y los que crearemos los haremos lo más general y simples posibles tan solo para aplicarlos.</p><p>El tiempo que tome a una persona u otra en desarrollar esta habilidades es variable, dependiendo de sus conocimientos previos, pero lo que sí estoy seguro es de que sin importar el tiempo, doy las herramientas necesarias para desarrollar una visita virtual en su totalidad, es decir, <strong>al final del curso serás capaz de crear tus propias visitas virtuales</strong> aplicando los conocimientos del curso.</p><p>El curso se divide en dos módulos simples, el primero en el que se creará el modelo del entorno, y el segundo módulo en el cual construiremos la aplicación, paso a paso de la visita virtual.</p><p>Con todo lo dicho, este curso te brindará beneficios incalculables que podrán hacer que obtengas un valor agregado y un servicio más que ofrecer, cuando se trata del mercado de bienes raíces, y quién sabe, talvez se pueda ampliar a otro tipo de mercados como: Visitas Virtuales para museos, parques, plazas, etc. <strong>las posibilidades se extienden tanto como se extienda la imaginación</strong><span>...<br><br><strong>¿QUÉ ESTÁS ESPERANDO?</strong><br></span></p>", 
    "end_date": null, 
    "title": "Guía para crear Visitas Virtuales Arquitectónicas", 
    "price": "20.00", 
    "instructors": "Alfredo Alejandro Zaldumbide Garcia", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748162_4b6a_2.jpg", 
    "course_url": "https://www.udemy.com/crear-visitas-virtuales/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-31T20:35:03Z"
}