{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  The chances for your success dramatically increase when you surround yourself with high achievers. They will push you to achieve your goals and dreams. This is the purpose of a mastermind.  </p>  <p>  \t  A mastermind is like your own personal board of directors, a group that meets regularly, who are dedicated to your success. No successful person can achieve great things alone. A mastermind is a business tool that great businessmen such as Benjamin Franklin, Theodore Roosevelt, Peter Drucker, and Henry Ford used to bring them great success.  </p>  <p>  \t  But maybe you&#039;re like me. You live in small town USA, and don&#039;t know where to find high achievers. That&#039;s where a virtual mastermind comes into your success story.  </p>  <p>  \t<strong style=\"\">What You&#039;ll Learn</strong>  </p>  <p>  \t  This course is a simple guide to teach you how you can start a virtual mastermind in less than 30 days and potentially create side income. Yes, people are willing to pay to be a part of such a group!  </p>  <p>  \t  You will learn how to run a mastermind meeting, how to find members, how to host the meeting online, how much you should charge for your meeting, and a few tips &amp; tricks I learned along the way.  </p>  <p>  \t  I will also host a few interviews with entrepreneurs who host masterminds and make a few thousand dollars each month.  </p>  <p>  \t<strong style=\"\">What You&#039;ll Create</strong>  </p>  <p>  \t  At the end of this course you will create a mastermind that will push you to achieve more in your business. Not only that, but you could create another stream of income.  </p>", 
    "end_date": null, 
    "title": "Hangout and Grow Rich", 
    "price": "50.00", 
    "instructors": "Alex Barker", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/150478_ceef_3.jpg", 
    "course_url": "https://www.udemy.com/hangout-and-grow-rich/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-22T01:53:18Z"
}