{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course, produced by author of the Amazon Bestseller, Happy Hair: The Definitive Guide to Giving Up Shampoo, is designed to help student detox their hair and set them confidently on the path to discovering, clean, beautiful, healthy shampoo-free hair. </p><p><em><strong>Let Lucy hold your hand through your hair detox and transition to \"No Poo\"  -  her moderated peer to peer support forum could be just what you need to take this step confidently.</strong></em></p><p><strong>A practical and theory based course:</strong>The course is planned with a very practical first half so that students can immediately begin detoxing their hair. The second half involves some of the science of this hair care method - because knowledge is power! </p><strong>You will be equipped to:</strong><ul><li>Detox your hair from current chemicals with practical techniques and methods</li><li><span></span>Choose a shampoo alternative that will bring out the best for your specific hair type</li><li>Understand the science of clean and strong hair</li><li>Understand exactly what the health and environmental implications are of the chemicals within traditional hair products</li><li>Care for your hair long term using natural, heat and chemical free methods</li><li>Begin your shampoo free journey in a supportive class of peers and mentors willing to help</li></ul><p><strong>The course involves: </strong></p><p>This is course accompanies Lucy's book \"Happy Hair\" (students get a free copy when they sign up to the course) and includes 55 minutes of lectures and a further one hour of personal development. The course involves 7 video classes and accompanying interactive worksheets and a peer to peer support forum moderated by lucy. There is also a bonus free class and worksheet for those interested in heat and chemical free styling. Take the course at your leisure or take one unit every 3 days to see your through the most intense part of your detox!</p><ul><li><strong>Unit One - Introduction and reasons for giving up shampoo</strong></li><li><strong>Unit Two - Healthy alternatives to shampoo</strong></li><li><strong>Unit Three - Healthy alternatives to conditioner</strong></li><li><strong>Unit Four - Top Tips for getting through your detox period</strong></li><li><strong>Unit Five - The science of No Poo and the structure of your hair</strong></li><li><strong>Unit Six - What is behind the label of your shampoo bottle?</strong></li><li><strong>Unit Seven - Trouble shooting common problems</strong>*BONUS* </li><li><strong>Unit Eight - Caring for your hair long term - Heat and Chemical free styling</strong></li></ul>", 
    "end_date": null, 
    "title": "Happy Hair Detox: Give up shampoo & discover beautiful hair ", 
    "price": "45.00", 
    "instructors": "Lucy AitkenRead", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479474_671a_2.jpg", 
    "course_url": "https://www.udemy.com/happy-hair-detox/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T01:57:56Z"
}