{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t        Did you know that nearly everyone carries hazardous chemicals in their bodies that started out in frying pans, cleaning products and other household items we use every day? You deserve to know where these chemicals came from and how they can affect health, and you shouldn&#039;t have to be a chemist to find out.  </p>  <p>  \t        This course is designed to be easy to understand for any student, parent, teacher or caregiver who wants to know how to create a healthy space to live, work and learn. It&#039;s also great for anyone who suffers asthma, headaches, or other sensitivities to chemicals and wants simple and affordable tips to reduce toxics in your life. Find out:  </p>  <p>  \t<em>Why</em> untested and hazardous chemicals came into our lives<br>  \t<em>How</em> we are exposed to these chemicals<br>  \t<em>What</em> hazards these chemicals might pose to our health; and<br>  \t<em>Who</em> is responsible for reducing toxics and protecting health.  </p>  <p>  \t        The course offers a series of very short overviews (five minutes or less) that deliver the basics of what you need to know. Then, if you want to dig deeper, you can follow the links to many rich resources on the science and law of chemicals in consumer products.  </p>  <p>  \t        You&#039;ll finish the course with a step-by-step handbook that will help you give your home a healthy check-up: spotting hazards and recommending ways to reduce those hazards.  </p>  <p>  \t        You can race through this course in less than an hour and come away with a great basic understanding of one of today&#039;s most pressing environmental health issues. But you&#039;ll want to return to the course to try out the green cleaning recipes, do research on your favorite household products, and re-visit healthy choices when you make changes to your home.  </p>", 
    "end_date": null, 
    "title": "Healthy Homes: Environmental news you can use", 
    "price": 0, 
    "instructors": "Jennifer Coleman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328278_304f_4.jpg", 
    "course_url": "https://www.udemy.com/healthy-homes/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T16:47:30Z"
}