{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Welcome to Hope and Help for Dyslexics and Other Struggling Readers.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Do you, or does someone you care about, have dyslexia?</strong>  </p>  <p style=\"\">  \t        Perhaps you are trying to figure that out.  </p>  <p style=\"\">  \t        Maybe dyslexia has seemed like <strong style=\"\">nothing but a struggle</strong> and you <strong style=\"\">could use fresh perspective on dyslexic strengths</strong>.  </p>  <p style=\"\">  \t        Perhaps you are just starting to <strong style=\"\">learn about options for accommodation and remediation for dyslexia</strong>.  </p>  <p style=\"\">  \t        Or maybe you have tried a number of things already and are trying to <strong style=\"\">sort through all the remediation options</strong> available before sinking more money into expensive therapy with promises that sound too good to be true.  </p>  <p style=\"\">  \t        My <strong style=\"\">primary target </strong>for this course is <strong style=\"\">parents seeking to help their dyslexic child</strong>.  </p>  <p style=\"\">  \t        Adult dyslexics, teachers, and tutors will also benefit from this course.  </p>  <p style=\"\">  \t        If any of the things I have mentioned above are true for you, then I encourage you to take this course.  </p>  <p style=\"\">  \t        In about 2 1/2 hours’ worth  of material, I’ll provide an overview of remediation and accommodation options, woven together with my personal history of working with dyslexics over the past 16 years and my experiences with many different programs and approaches to helping dyslexics.  </p>  <p style=\"\">  \t        Some of the approaches that I’ll address include:  </p>  <p style=\"\">  \t        ●The <strong style=\"\">Orton-Gillingham phonics based approaches</strong>, whichdirectly address underlying phonological processing weaknesses found in 80-90% of dyslexics.  </p>  <p style=\"\">  \t        ●The <strong style=\"\">Davis Dyslexia </strong>approach, which uses dyslexic <strong style=\"\">strengths in 3D picture thinking </strong>to get around this weakness and teaches tools for helping the dyslexic manage their dyslexic brain.  </p>  <p style=\"\">  \t        ●Other approaches I’ll overview address the <strong style=\"\">underlying developmental and cognitive skills</strong> that need to be strengthened in order for the dyslexic to become a more efficient and effective learner.  </p>  <p style=\"\">  \t        ●Still other recommendations involve <strong style=\"\">accommodations to level the playing field </strong>for dyslexics.  </p>  <p style=\"\">  \t        In this course, you will also learn:  </p>  <p style=\"\">  \t        ●what it means to be dyslexic and dysgraphic  </p>  <p style=\"\">  \t        ●that dyslexics are smart, with differently-wired brains.  </p>  <p style=\"\">  \t        ●five key reading skills and some strategies to support student growth in each.  </p>  <p style=\"\">  \t        ●teaching strategies for supporting dyslexics and dysgraphics.  </p>  <p style=\"\">  \t        ●information about key accommodations to help your dyslexic become the best they can be.  </p>  <p style=\"\">  \t        ●what comprises an Orton-Gillingham phonics-based approach.  </p>  <p style=\"\">  \t        ●some of my adaptations to OG to engage the student.  </p>  <p style=\"\">  \t        ●several options for implementing an OG approach.  </p>  <p style=\"\">  \t        ●key elements of the Davis Dyslexia Correction program.  </p>  <p style=\"\">  \t        ●information about several other programs that address underlying developmental and cognitive skill weakness.  </p>  <p style=\"\">  \t        I hope you will be <strong style=\"\">encouraged by these fresh perspectives</strong> on some of the strengths that are often the <strong style=\"\">flip side</strong> of the more familiar dyslexic challenges.  </p>", 
    "end_date": null, 
    "title": "Help and Hope for Dyslexics (and other struggling readers)", 
    "price": "30.00", 
    "instructors": "Beth Ellen Nash", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/388062_9464_2.jpg", 
    "course_url": "https://www.udemy.com/dyslexia-fresh-perspectives-remediation-options/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T23:09:48Z"
}