{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Have you ever wanted to take an inside peek at how a top paid online tutor actually runs their business? </p><p>There are many programs that may teach you how to do this, but few are actually created from people who have reached high levels of success.  </p><p>This course gives you insight into an award winning mindset along with some strategies that will help you structure your time in an effective manner.  </p><p>You will learn the most effective marketing techniques to get new students and how to get your clients to write you the perfect testimonial.</p><p><strong>This program includes:</strong></p><ul><li>Detailed videos to walk you through your own success.</li><li>5 actions a day template</li><li>YouTube video creation template</li><li>Referral template</li><li>Access to Ultimate Support Group for Online Tutors on Facebook</li><li>Easy to follow recipe for writing the perfect testimonial </li></ul><p>These templates and videos are all you need to start getting students to find you. </p><p>This course will take less than 2 hours to complete, but you will have all the tools that you need to generate thousands of dollars in income each month as a result.</p><p><strong>Why take this course?</strong></p><ol><li>Expand your thinking</li><li>Get results like a top paid online tutor</li><li>Learn marketing techniques that actually work</li><li>Build automated systems so you can focus on teaching and not on marketing and backend tasks.</li></ol>", 
    "end_date": null, 
    "title": "Hidden Secrets of Top Paid Online Tutors Around the World", 
    "price": "30.00", 
    "instructors": "Joanne Kaminski", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752774_37d3_5.jpg", 
    "course_url": "https://www.udemy.com/hidden-secrets-of-top-paid-online-tutors-around-the-world/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-04T20:38:27Z"
}