{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Home School Decision Basics</strong> covers  topics a parent or guardian may need knowledge of to start home schooling their children. Many parents would like to home school their children but do not know what is involved. This course goes through curriculum choices, patience requirements, money, scheduling, rewards of home schooling and the time factor.</p><p>  1.Curriculum choices shows different curriculum for family size and how to do it yourself if you want. </p><p>2. Patience will be tried when you are teaching your children. Techniques on how to deal with situations, sick days and reward systems will be discussed.</p><p>3. Money- how much does home schooling cost? What items are necessary to home school? This will be answered in one of the lectures.</p><p>4. Scheduling- Different methods of scheduling based on your family will be discussed. Photos will be shown to show techniques our family used through trial and error.</p><p>5. Rewards of home schooling including famous home schoolers. </p><p>6. Time- How much time is necessary to home school? I discuss the time factor of teaching, scheduling and legal time requirements in the United States.<br></p><p>Home schooling is a fun life style choice and can be a rewarding family adventure. When you are finished with the course you will have an informed opinion of what is involved and hopefully based on the examples I have shown you will want to join the millions who do home school. </p>", 
    "end_date": null, 
    "title": "Homeschool Decision Basics", 
    "price": "20.00", 
    "instructors": "Susan Espinoza", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/811894_562d.jpg", 
    "course_url": "https://www.udemy.com/homeschool-decision-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-04T00:51:04Z"
}