{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>COME JOIN OVER 3,697+ Student's In This Incredible Productivity Course!</strong></p>\n\n<p><strong>It is TWO courses in ONE! A complete course for novice learners who want to gain a grasp of their Office and PC once and for all! </strong><br></p>\n\n\n\n<p><strong>RAVE REVIEWS!</strong></p>\n\n\n\n<p>5/5 STAR - \"Excellent productivity Course\", Carl Pohl<br>5/5 STAR - \"practical, insightful and unique!\", Gulnara Emirali<br>5/5 STAR - \"Excellent course. Very well presented with some very good tips and tricks. Highly recommended.\", Mark P Flatt<br></p>\n\n<p>5/5 STAR - \"This was a useful course for me, in being able to add some focus and organization to my computer work.\", Kathryn Kistner<br>+ MANY MORE!</p>\n\n\n\n<p><strong>WHY SHOULD YOU TAKE THIS COURSE?</strong></p>\n\n<p><em>By the end of this course, students will have the skills and expertise to:</em><br></p>\n\n\n\n<p>1. <strong>Clean up</strong> their computer desktops <strong>ONCE AND FOR ALL!</strong><br><br>2. <strong>Beautify and Enhance</strong> their computer desktop experience!<br></p>\n\n\n\n<p>3. Get a <strong>MIND-BLOWING Productivity Boost</strong> with incredible tools and methodologies<br></p>\n\n\n\n<p>4. If done correctly, students should <strong>become clutter free</strong> in a very short period of time - with some transformations happening<strong> within a </strong><strong>single hour</strong>!</p>\n\n<p>5. Create and design a <strong>new office space!</strong></p>\n\n<p>6. Learn about <strong>Backups, Calendars</strong> and <strong>Many other Productivity Tools</strong>! <br><br><em><strong>Clutter can cause massive imbalance</strong></em> as well as limit things from getting done!  Clutter can even <em><strong>negatively affect your ability to focus and process information!  </strong></em><br><br>However clutter doesn't just stop at simply cleaning up your desktop, we <em><strong>need to stop the root cause</strong></em> and that is <strong>DISORGANIZATION</strong> <strong>without any system</strong> to help you manage things.<br><br>I was once like you, <em><strong>FRUSTRATED</strong></em> with all the mess, and as a game and app developer as well as an online instructor and motivational speaker, keeping everything organized and together was <em><strong>DRIVING me crazy!</strong></em><br></p>\n\n\n\n<p>Then it happened...that day where I finally said <em><strong>ENOUGH IS ENOUGH</strong></em> and I spent my time to reorganize and get my life back!  And now I'm here to teach you <strong>how YOU can do it too</strong> with this amazing course!  Here you will learn how to create a productive and organized office and pc system!<br><br><em>OTHER FEES:</em><em><br>Some of the software being used will cost $10-$50 USD, however we will be using the free 30 day trial and free versions of the tools.  For the book that is recommended it may cost you up to $15 for the book (As I'm not the author of the book, I can only provide the direct link to Amazon for the recommended book in the course).  Other than that you should not have to worry about any other fees other than the course fee itself.</em><br></p>\n\n\n\n<p><em>INSTRUCTOR INVOLVEMENT<strong>:</strong>\n Due to the busy schedule Abhinav has as he is developing new games and apps, \nspeaking at seminars around the world, running his various companies, \nbuilding new programs and courses, and ofcourse spending time with his \nfamily, fans and other students, etc. it will naturally be a challenge \nfor Abhinav to be available all the time.  For this reason it is highly \nrecommended that students take advantage of any webinars or discussions \nwhich Abhinav is a part of!  These are great opportunities to connect \nwith Abhinav and ask questions about the course.  Note: Please \nmake sure your questions are related to this course when asking \nquestions as Abhinav has several courses on various topics. If you have a\n question on another course or topic that Abhinav teaches that is \noutside the scope of this course, please ask it in that specific webinar\n or discussion section.</em></p>\n\n\n\n<p><strong><strong>WHO SHOULD TAKE THIS COURSE?</strong></strong></p>\n\n\n\n<p>This course is aimed at beginners who may have never heard of these tools and techniques before!</p>\n\n\n\n<p>The digital part of the course is for desktop and laptop users and is targeted to those who are on a PC running a Windows Operating System (Preferably Windows 7 and above.  The course is taught on a Windows 8 PC).  The tools and software will also work on a Mac, however all lessons and course material is shown on a Windows based PC.  For \nmore courses and programs, please take a look at Abhinav's \nother programs on Udemy :)</p>\n\n\n\n<p><strong>WHY TAKE THIS COURSE?</strong></p>\n\n\n\n<p>1. You're frustrated with a <strong>MESSY OFFICE and COMPUTER DESKTOP </strong>all the time.</p>\n\n\n\n<p>2. You're looking to get control of the clutter and finally get focus again on what matters!<br></p>\n\n\n\n<p>3. You want to increase your <strong>PRODUCTIVITY </strong>by learning methods and tools to give you an <strong>ADDED EDGE </strong>over your computer.<br></p>\n\n\n\n<p><strong>TAKE BACK YOUR OFFICE AND PC NOW - TAKE ACTION TODAY!</strong></p>\n\n\n\n<p><em><strong>Important information before you enroll:</strong></em><br></p>\n\n\n\n<ul><li>In case you are not fully satisfied with the course, don't forget you are covered by a <strong>30 day money back guarantee, full refund, no questsions asked!</strong></li><li>Once enrolled, you have <strong>unlimited, lifetime access to the course!</strong></li><li>You will have <strong>instant and free access to any updates</strong> I may add to the course over time.</li><li>Check out the curriculum and <strong>FREE lectures</strong> in the course.</li></ul>", 
    "end_date": null, 
    "title": "Home Office & Computer Productivity Hacks Organize Your Life", 
    "price": "50.00", 
    "instructors": "Abhinav Gupta, Karen Browne", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656024_d5d9_3.jpg", 
    "course_url": "https://www.udemy.com/pc-productiviy-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-31T01:52:33Z"
}