{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>UPDATED: 2016-06-26. In this two-hour course, you will learn how to set up and configure your own video studio on any budget. You will learn what equipment is needed and you will receive recommendations on different types of equipment based on your available budget. Activities and resources are available at the end of each section to reinforce what you've learned and guide you in applying what you learned so you can take action and implement the setup.</p><p>The course takes you through a linear process of understanding the key concepts, making the right choices based on your vision for your videos, and implementing your choices. You can go through the course step by step or you can jump around to just get information on the specific area you need help with. </p><p>This course is divided into 4 major sections: Basics, Microphones, Lighting, and Camera. </p><p>In <strong class=\"redactor-inline-converted\">Basics</strong>, you'll learn about WHY a studio can help you create videos faster, the rule of thirds, framing, and choosing a background.</p><p>In <strong class=\"redactor-inline-converted\">Microphones</strong>, you'll learn about the different microphone types (handheld, lapel, headset, etc.), their interfaces (USB, XLR, 1/8 inch or 3.5mm), what type of microphone to buy depending on your video style and your budget, and how to properly test and record with microphones.</p><p>In <strong class=\"redactor-inline-converted\">Lighting</strong>, you'll learn about the different types of lights (incandescent, CFL, LCD, halogen), what types of lights are best for different situations, what color temperature is and its importance, changing the lighting intensity, what three-point lighting is, and how to properly light a studio for video recording.</p><p>In <strong>Cameras</strong>, you'll learn how to use the camera you probably already have, what settings to use on your camera, how to choose another camera if you prefer, how and why to stabilize the camera to make the shots look more professional, and how to use multiple cameras help you hide mistakes.</p>", 
    "end_date": null, 
    "title": "Home Video Studio - Set Up Your Video Studio on Any Budget", 
    "price": 0, 
    "instructors": "Ron Hogue", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/769786_5b8c.jpg", 
    "course_url": "https://www.udemy.com/home-video-studio/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-21T20:06:34Z"
}