{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong></strong></p><strong>Thor Alexander</strong>: <strong>Homepage/Blog? - Top-Einstieg - ohne Webseiten zu programmieren<br></strong>Dieser Online-Kurs ist ein kompakter Leitfaden fuer erfolgreiches Auftreten im Netz bei Website, Homepage, Onlineshop und Blog.<p>Neuer Kompaktkurs vom Autor des Homepagebuchs</p><p>+++ Letzte Aktualisierung am 21.12.2015 +++</p><p>Egal ob Sie Webseiten erstellen oder ob Sie keine Webseiten erstellen wollen, erfahren Sie in diesem Kurs vom Homepagebuch- und Googlebücher-Autor aus erster Hand, was als künftiger Webseitenbetreiber für die eigene Website/Homepage, den eigenen Onlineshop oder den eigenen Blog wichtig ist.<br></p><p><strong>Vom richtigen Domännamen bis zum korrekten Impressum</strong></p><p>Im Kurs erfahren Sie das Wichtigste zum Thema Gestaltung von Homepages, Blogs etc<strong>.</strong> Dieser Kurs ist für diejenigen geeignet, die sich schnell in das Thema einarbeiten wollen, ohne sonderlich in die Breite zu gehen. Schwerpunkte im Homepage/Blog-Kurs sind die Themen </p><ul><li>Richtiger Domänname</li><li>Webhosting</li><li>Konzepte der Webseitengestaltung</li><li>Kostenloses und rechtskonformes Impressum</li><li>Schritte bei der Inhaltsfindung, <br>    d.h. wie kommen Sie vom leeren Blatt zur vollen Seite.</li></ul><p><strong>Was können Sie nach dem Homepage/Blog-Kurs tun?</strong></p><p>Webseiten erstellen  - das können Sie nach Absolvierung dieses Einstiegskurses nicht. Denn hier geht es nicht um HTML und CSS. Aber Sie werden wissen, auf was es bei der Webseitenerstellung bzw. Webseitengestaltung ankommt.</p><p>Nach dem Kurs werden Sie in der Lage sein, gute von schlechten Domänennamen zu unterscheiden, Webseiten sensibler zu betrachten und wissen, was zu einem seriösen und rechtskonformen Impressum gehört. </p><p>Sie können sich die eigene Anbieterkennzeichnung kostenlos selbst zu besorgen. </p><p>Egal ob Sie einen Blog, einen Onlineshop oder eine Website/Homepage betreiben möchten, der richtige Webhoster ist ein wichtiger Dienstleister. Sie erfahren, worauf bei den monatlichen Kosten und bei der Webhosterwahl zu achten ist.</p><p>Und wenn dann Ihre Website/Homepage, Ihr Onlineshop oder Ihr Blog noch besser gefunden werden sollen, dann schauen Sie in meinen Online-Kurs zum Thema <strong>Suchmaschinenoptimierung</strong> rein.</p><p>Für alle Anderen, die in rund einer Stunde erfahren möchten, was das Wichtigste bei einem eigenen Netzauftritt (Website/Homepage, Onlineshop, Blog) ist, jenen empfehle ich diesen Kurs.</p><p><strong>Das schrieben Teilnehmer zum Homepage-/Blog-Kurs</strong></p><p>\"Der Kurs gefällt mir sehr gut. Es wird erklärt, was für eine eigene Homepage bzw. Blog wichtig ist. Ich bekam viele neue Tipps. Ich kann den Kurs empfehlen, da er für jeden geeignet ist.\"</p><p>\"Alles gut verständlich erklärt!\"</p><p><strong>Als Ergänzung zum Webshop-Kurs empfehle ich folgende Online-Kurse:</strong></p><ul><li>Online verkaufen und 5.000 € monatlich verdienen</li><li>Rechtskonformes Impressum selbst erstellen</li><li>5 x Webanalyse per Google - kostenlose Webstatistiken</li><li>Vom perfekten Domännamen zur erfolgreichen Domänstrategie</li></ul><p><strong>Wenn Sie mit Ihrer Homepage bzw. mit Ihrem Weblog Erfolg haben möchten, dann besuchen Sie jetzt meinen Homepage/Blog-Kurs!</strong></p>", 
    "end_date": null, 
    "title": "Homepage/Blog? - Der Top-Einstieg zum Internetmarketing", 
    "price": "25.00", 
    "instructors": "Dipl.-Ing. Thor Alexander", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663854_e910_3.jpg", 
    "course_url": "https://www.udemy.com/die-schritte-zur-eigenen-homepageblog-in-60-minuten/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-08T15:46:24Z"
}