{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Advance your skills with Snagit Editor by learning 3 of my favorite techniques that will enhance the way you create training guides.</p>  <p><strong><br></strong></p><p><strong>Strengthen your skills in Snagit Editor and training guide creation with this course.</strong></p>  <ul><li>Discover the potential of single image training guides with multiple screen captures</li><li>Learn the quick and easy ways to hide sensitive information</li><li>Alter screen captures to fit your needs</li></ul>        <p><strong><br></strong></p><p><strong>A great skill at your fingertips</strong></p>  <p>Training guides are a great way to document processes and documented processes are great for teaching and training. The ideal student for this course could be Teacher, Office Manager, Small Business Owner, or Content Provider, but really it's anyone that wants to enhance their skills in Snagit Editor.  This course focuses on Snagit Editor, as such, it doesn't focus on creating screen captures; instead you'll see step-by-step instructions on how I use Snagit Editor.</p>  <p><strong><br></strong></p><p><strong>Content and Overview</strong></p>  <p>Learn how to use Snagit Editor to:</p>  <ol><li>Create single image training guides with multiple screen captures</li><li>Hide sensitive information in screen captures</li><li>Alter screen captures  </li></ol>      <p>In this course, I share three of my favorite techniques in Snagit Editor (mentioned above).  These techniques have helped me in training guide creation for many years.  They save time, allow for a professional look, and expand the potential of your screen captures.  </p>  <p>Follow me through an example training guide as I lead you step by step through my process for creating single image training guides with multiple screen captures.  Then see the four ways how I hide sensitive information in screen captures.  And finally, see step by step how I alter two different screen captures.  All screen captures are provided so you can easily follow along.</p>  <p>This course is 100% video, features 4 sections, includes 3 quizzes, and is less than an hour long (concise!). Learn three of my favorite techniques in Snagit Editor and learn from my 10 plus years of experience creating training guides.</p>  <p>This course is best suited for anyone that has used Snagit screen capture software or has taken my course How to Create a Training Guide Using Snagit (Volume 1).</p>", 
    "end_date": null, 
    "title": "How to Create a Training Guide Using Snagit (Volume 2)", 
    "price": "50.00", 
    "instructors": "Scott Meister", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694936_434d_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-training-guide-using-snagit-volume-2/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-11T16:58:23Z"
}