{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    <strong>Many people struggle every single day of every single year with to do lists.</strong>  </p><p><strong>They take action:</strong></p>  <ul><li>  \t    Some people stomp on them out of sheer frustration. </li><li>Others lose them </li><li>Some ignore their lists</li><li>Some don't even bother making a list any more because it's way too stressful to see an ever-ending stream of all that has to be done</li><li>Some avoid to do lists altogether and hope their brain will remember to do what is necessary</li><li>Some have learned to hate the words, \"to do list\". </li></ul><p><strong>What's the point?</strong>  A to do list for most people is just an <strong>endless pit</strong> of things that chew up your time and make us feel bad with only small \"glimmers\" of excitement. </p><p><strong> The reward:  more things to add to the already jammed to do list! </strong> </p>  <p>  \t    <strong>This system is a unique system I've designed and taught to many people in my workshops.</strong>  People have used this simple little system to help them get control over their to do list and control over their time and their lives.  </p>  <p>  \t    People in my workshops were astonished by its <strong>powerful simplicity.</strong>  In fact, most thought it was way too simple except for one little thing - they tried it.  They liked it.  And people were <strong>thrilled to finally get a sense of achievement </strong>by accomplishing the tasks on their to do lists.  </p>  <p>  \t    <strong>Why?  </strong></p>  <p>  \t    Because there was \"oomph\" behind the to dos.  Finally, they understood the realities of human existence and why they were fighting a losing battle doing what they were doing  </p>  <p>  \t    <strong>In one day, you can do the course.</strong>  There are<strong> PDFs </strong>to work from, each building on the previous exercise.  While involved in completing the exercises, the learner will notice <strong>changes in their thinking and attitudes</strong>.  There will be<strong> \"aha\" moments</strong> and there will be moments of \"why didn't I think of that?\".  </p>  <p>  \t    <strong>By the end of the course, you'll have a much better sense of how to construct your to do lists in a sane and rational way.  </strong>You'll come to realizations which help you build a much better tomorrow, <strong>feeling good about your day every day. </strong> </p>", 
    "end_date": null, 
    "title": "How to Accomplish the Important Things in your Life", 
    "price": "20.00", 
    "instructors": "Lorraine Arams", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430444_28ee_3.jpg", 
    "course_url": "https://www.udemy.com/to-do-list-busting/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T23:22:37Z"
}