{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Discover How to Save Yourself a Fortune by Writing Your Own Sales Copy That Gets Results</strong>  </p>  <p>  \tThis course has been designed to take business owners through all the steps needed to create:-  </p>  <ul style=\"\">  \t<li>Sales copy that grabs your prospects and compels them to buy…</li>  \t<li>Sales copy that converts casual visitors into raving fans…</li>  \t<li>Sales copy that will have your phone ringing off the hook!</li>  </ul>  <p>  \t Whether you want your copy to bring in leads, build your list, or make sales directly from the page, it’s covered in this course.  </p>  <p>  \t <strong style=\"\">“How to Write Sizzling Sales Copy”</strong> is delivered as 22 bite-sized chunks of solid gold information. I don’t do fluff and flannel! I get straight into the nuts and bolts of exactly what steps you need to take to write copy that converts over and over again.  </p>  <p>  \t <strong style=\"\">What We’ll Be Covering</strong>  </p>  <p>  \t  Over the course of these 24 Modules you’ll discover:  </p>  <ul style=\"\">  \t<li>The 12-step structure of a sales letter – get this right and your copy will almost write itself</li>  \t<li>Seven different ways of writing headlines that connect emotionally and lead the reader on into the copy so you get your copy read</li>  \t<li>What you need to have on a Squeeze page for maximum sign ups</li>  \t<li>What to do before you ever start writing any piece of copy – get the foundations right and your copy could stand for years</li>  \t<li>What NEVER to do if you don’t want your visitors hitting the Back button.</li>  </ul>  <p>  \t <strong style=\"\">And I’ll show you how to…</strong>  </p>  <ul style=\"\">  \t<li>Get over the dreaded Writer’s Block – if you do this you’ll never suffer from blank page syndrome again</li>  \t<li>Write powerful, intriguing headlines that will draw your readers into the rest of your copy – without a good headline your copy won’t be read</li>  \t<li>Craft bullets that touch your reader’s emotions and have them salivating for what you’re offering</li>  \t<li>Use testimonials to get under the radar so your reader doesn’t feel sold to</li>  \t<li>State your guarantee to set your prospect’s mind at ease and increase conversions many times over</li>  \t<li>Write autoresponder emails to build a strong relationship with your list to convert them into raving fans</li>  \t<li>And much, much more…</li>  </ul>  <p>  \t <strong style=\"\">And that’s not all…</strong>  </p>  <p>  \t In addition to the video lessons you also get…  </p>  <ul style=\"\">  \t<li>Full transcriptions of every video – you can print them out and make your own notes as you watch</li>  \t<li>PDF files of the MindMaps I use – you can print them out and make MindMap notes if that’s what you prefer</li>  \t<li>A list of the Top 100 Power Words to spice up your copy so it connects more deeply with your reader’s emotions</li>  </ul>  <p>  \tInvest in your future and the future of your business by signing up to study <strong style=\"\">&quot;How to Write Sizzling Sales Copy&quot;</strong> right now!  </p>", 
    "end_date": null, 
    "title": "How to Write Sizzling Sales Copy", 
    "price": "30.00", 
    "instructors": "Penny Dablin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338378_e3d2_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-sizzling-sales-copy/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T11:15:02Z"
}