{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t                Are you a designer who falls into one or more of the following categories:  </p>  <ul>  \t<li><strong>Maybe you are already freelancing</strong> while you work a full time gig and want to learn the secret of how to maximise your earnings from your &lsquo;sideline&rsquo; freelance business without burning out into oblivion!</li>  \t<li><strong>You are looking to boost your income</strong> with a few of those great freelance jobs you keep seeing online.</li>  \t<li><strong>You want to learn more about how to earn more</strong> doing what you love without killing yourself.</li>  \t<li><strong>Perhaps you&rsquo;ve already taken the leap</strong> and you&rsquo;re ready to take things to the next level.</li>  \t<li><strong>Or maybe this is just for fun</strong> and you want to see if you can set up another income stream selling your design talent.</li>  </ul>  <p>  \t                Regardless of what category (or categories) you fall into, this is the right course for you.  </p>  <p>  \t                &hellip; But wait a second &hellip; you might be thinking &ldquo;Isn&rsquo;t freelancing, really really hard?&rdquo; My answer is no, it doesn&rsquo;t have to be.  </p>  <h5><strong>You are probably asking yourself one or maybe all of the following..</strong></h5>  <ul>  \t<li>How can I get over the <strong>fear of freelancing</strong>?</li>  \t<li>Do I have enough <strong>business skills</strong>?</li>  \t<li>What happens if I <strong>run out of cash</strong> and clients?</li>  \t<li>How<strong> will I cope</strong> with the pressure?</li>  \t<li>Will I be any good, <strong>do I have the talent</strong>?</li>  \t<li>How can I <strong>make an irresistible portfolio</strong> clients will drool over?</li>  \t<li>How can I find out <strong>what do clients really want</strong>?</li>  \t<li>How can I <strong>keep motivated</strong>?</li>  \t<li>  \t<h5><strong>Why Should you Listen to Me?</strong></h5>  \t<p>  \t\t<a href=\"http://freelanceformula.co.uk/wp-content/uploads/2013/05/andy_cuts2.png\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\"></a>  \t</p>  \t<p>  \t\t               My name is Andrew Cunning, owner of  www.creativesync.co.uk Freelancer and Creative Director, my story started 18 years ago whilst working full time as a graphic designer. I never liked the way my employer took the credit for my work and I needed extra income, so I thought &lsquo;what the heck&rsquo; and began to take on the odd project every month or so. I really liked the sense of achievement and control I had with a client - all very different from a boss that rarely gave me credit for the work. Then before I knew it, things began to grow and I had a constant stream of freelancing jobs. It was pretty shocking to me as I had no major plan. So I decided to take the leap and leave my job to go freelance.  \t</p>  \t<p>  \t\t                The journey I went on wasn&rsquo;t perfect, there were many ups and downs but I learnt the hard way which eventually helped me land some of the world&rsquo;s leading brands.  \t</p>  \t<p>  \t\t                This course covers all the mistakes I made and eliminates them for you because I want to take a lot of time and money off your learning curve so you can do your business and find success quickly without a lot of the financial worries I had.  \t</p>  \t<p>  \t\t                Now, for the first time ever, by massive popular demand (I had literally hundreds of requests) I&rsquo;m revealing my &ldquo;Freelance Formula&rdquo; system for building your freelance design business step by step. This is exactly what I wish I&rsquo;d had when I started because it would have saved me thousands of hours of aggravation and thousands of pounds in lost income.  \t</p>  \t<h5><strong>But first, who is this course NOT for:</strong></h5>  \t<ul>  \t\t<li> Someone who is just in it for the money</li>  \t\t<li> You think this is just an easy option</li>  \t\t<li> Someone who doesn&rsquo;t like people</li>  \t\t<li> You have a negative outlook</li>  \t\t<li> Someone who isn&rsquo;t an action taker</li>  \t\t<li> You don&rsquo;t really care about design</li>  \t</ul>  \t<h5><strong>Frequently Asked Questions</strong></h5>  \t<p>  \t\t                Q: <strong>What specifically will I learn from this product?</strong>  \t</p>  \t<p>  \t\t                A: You will learn how to become a freelance hero and manage work/life balance, find dream clients, work less hours, earn six figures a year doing what you love, plus much more.  \t</p>  \t<p>  \t\t                Q: <strong>How will this product teach me to generate more projects?</strong>  \t</p>  \t<p>  \t\t                A: This product shows you the step-by-step process for finding the right target market, crafting an irresistible offer and attracting clients who are actually searching for your services.  \t</p>  \t<p>  \t\t                Q: <strong>How can this product benefit someone who is already freelancing?</strong>  \t</p>  \t<p>  \t\t                A: Whether you are a beginner or already a freelancing expert, this training includes my most prized secrets and tips that you desperately need to become a six figure freelancer.  \t</p>  \t<p>  \t\t                Q: <strong>How long will it take me to implement this product and see results?</strong>  \t</p>  \t<p>  \t\t                A: Results vary but it is common to hear that members who go through the training see results in a matter of days if they have already started to freelance on the side. I&rsquo;ve also received a number of success stories of people getting new clients in the first week.  \t</p>  \t<p>  \t\t                Q: <strong>What if I&rsquo;m not very business minded, can I still use this product?</strong>  \t</p>  \t<p>  \t\t                A: Yes you can. I teach you how I discovered a unique way of modelling my freelance business that allowed me to focus on what I loved to do (i.e. designing and creative) and stop doing the stuff I was bad at.  \t</p>  \t<p>  \t\t                Q: <strong>How is this product delivered?</strong>  \t</p>  \t<p>  \t\t                A: I love instant results, so I want you to experience that as well. Right after you sign up you will receive instant access, along with all of the videos, audios, PDF transcripts, and bonuses with a unique log-in and password just for you.  \t</p>  \t<p>  \t\t                Q: <strong>Why should I buy this product today instead of waiting?</strong>  \t</p>  \t<p>  \t\t                A: This current price is discounted to make it affordable for those who like to take action as we know those who take action now will get the most results. The product does go up in price very soon as we will be adding new content and training to the course. However, once you sign up you will receive free upgrades and access for life.  \t</p>  \t<p>  \t\t                Q: <strong>What if I don&rsquo;t like this product?</strong>  \t</p>  \t<p>  \t\t                A: I know you will LOVE this product as hundreds of people around the world have already signed up in the last few months. However, if for whatever reason you aren&rsquo;t satisfied in any way or you don&rsquo;t think you&rsquo;re getting enough results, we have a 60 day money back guarantee (and you get to keep the product). I want you to succeed and know that if you get your hands on this powerful information and take action that you will see amazing results!  \t</p>  \t</li>  </ul>", 
    "end_date": null, 
    "title": "How to Start a Successful Freelance Design Business", 
    "price": "25.00", 
    "instructors": "Andy Cunning", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/105788_f167_8.jpg", 
    "course_url": "https://www.udemy.com/freelance-formula-double-your-income-as-a-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-14T18:37:11Z"
}