{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>  \t<strong>JOIN OVER 700 STUDENTS WHO HAVE TAKEN THIS COURSE.</strong>  </p>  <p>  \t<strong>LIFETIME ACCESS TO 26 LECTURES, 4 HOURS OF HIGH-QUALITY CONTENT, AND ALL FUTURE UPDATES TO THE COURSE.</strong>  </p>  <p>  \t<strong>AND THERE'S A 30-DAY MONEY-BACK GUARANTEE BY UDEMY. NO QUESTIONS ASKED. NO HASSLES. THERE IS SIMPLY ZERO RISK.</strong>  </p>  <hr>  <p>  \t            “<em>I have adopted some the things mentioned in this course such as those on productivity hacks, managing time during a test, and answering questions in the most optimum way. One of the biggest improvements I've found is in my ability to focus for longer hours, which has indirectly resulted in less number of silly mistakes in long-duration tests.</em>\"  </p>  <p>  \t            [Extract from one of the reviews at the bottom of the course page]  </p>  <hr>  <p>  \t<strong>I'm talking through experience: please go through my bio on the left margin to see my experience in different types of entrance exams.</strong>  </p>  <p>  \t<strong>You can study smart, too. You can crack those tough exams, too. </strong>And, you can apply the lessons learnt in this course to your regular high school or college coursework (and not just tough exams) as well. And, don't worry if you're not a <em>genius</em>. It's more about smart study techniques, and less about <em>genius </em>or<em> intellect.</em>  </p>  <p>  \t    There're no shortcuts, though. No fast lanes.  </p>  <p>  \t    Have you ever wondered why few consistently crack exams such as SAT, GRE, GMAT, IELTS, TOEFL, CPA, ACT, and LSAT, or get admission to the top colleges? You may dub them as geniuses. And kick yourself for falling short of expectations, year after year.  </p>  <p>  \t    In reality, in most of the cases, neither they're geniuses nor you are dumb. They adopt different strategies. Different study techniques. They work towards getting those small edges which eventually become decisive in tough exams. <strong>This course emphasizes on several such small edges, and talks about where and how to get them. In this course, I'll also talk about few <em>best practices</em> (in study techniques and writing college essays) that I devised, and which worked very well for me.</strong>  </p>", 
    "end_date": null, 
    "title": "How I Consistently Finished in Top 1% in the Toughest Exams?", 
    "price": "50.00", 
    "instructors": "Anil Yadav", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253242_ec81_4.jpg", 
    "course_url": "https://www.udemy.com/learn-habits-and-hacks-of-top-one-percentile-of-test-takers/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-30T15:29:45Z"
}