{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Coding interviews can be tough, but they become much simpler if you know how to prepare yourself properly. This course is designed to increase your chance of passing the coding interview, by presenting the best practices both from technical and non-technical perspectives.</p><p>\n\n<strong>Take your coding interview skills to another level by following the simple recommendations presented in this course.</strong><br></p><ul><li>Learn how to plan your preparation time</li><li>Discover how to build an efficient algorithm</li><li>Refresh your knowledge of data structures</li><li>Practice using real problems</li></ul><p>\n\n<strong>A coding interview is a gateway to your dream job</strong></p><p>It is not enough just to be a good coder in order to get your desired job. The competition is high and there are no shortcuts. If you want to work as a generously paid software Developer, you have to pass the coding interview. Technically speaking, usually you have to pass a few of them, so you better be well prepared. </p><p>\n\n<strong>Content and Overview</strong><br></p><p>This course starts with general recommendations regarding preparation for the coding interview: time planning, problem solving techniques, solution formulation etc.</p><p>After that comes the technical parts where we together will refresh your knowledge of the most asked about topics, like data structure problems, recursion, sort algorithm, etc.</p><p>For each topic there is a short theoretical introduction, which is focused on the interviews most important aspects. After, there is a real coding interview problem together with an explained solution.</p><p>Students completing this course will have a good understanding on which aspects they should focus on during the preparation, what to expect in the coding interview and how to deal with typical coding problems.</p>", 
    "end_date": null, 
    "title": "How to prepare for a coding interview", 
    "price": "20.00", 
    "instructors": "Igor Chtivelband", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510066_6008_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-prepare-for-a-coding-interview/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-24T08:58:28Z"
}