{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t              Open source software is free for anyone to use for any purpose. Various applications are available for office productivity, graphic image creation, project management, and much more. These applications have features that rival those found in commercial packages that cost hundreds of dollars per component, per user.  </p>  <p>  \t              Open source software offers value far above the free cost. Many millions of web site administrators have discovered this. Over 20% of the World Wide Web now runs on a mixture of open source applications including WordPress, Apache and MySQL.  </p>  <p>  \t            This course introduces several open source applications. Demonstrations are presented which show how these are capable of performing many useful tasks. If there is an open source application that you would like reviewed, just let me know and I&#039;ll see about including it in another lecture.  </p>  <p>  \t        As time goes on, this course will be updated with additional lectures showing examples of more useful open source applications. Your purchase gives you access to everything new as it is delivered, at no additional cost.  </p>  <p>  \t      Latest Update:  </p>  <p>  \t      2/3/2015: Improve summary video, replace ProjectLibre video.  </p>", 
    "end_date": null, 
    "title": "How You Can Save Thousands With Free, Open Source Software", 
    "price": "20.00", 
    "instructors": "Vaughn Smith", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363192_8fea_3.jpg", 
    "course_url": "https://www.udemy.com/how-you-can-save-thousands-with-free-open-source-software/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T17:35:38Z"
}