{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Udemy was new to me once!  I had no idea what I was doing - it was a whole new world to learn!  </p>\n\n<p>Yet, my first courses went straight to the best-seller rankings in the highly competitive 'Entrepreneurship' category AND the Instructional Design category.  </p>\n\n\n\n<p>I made $900 in my first week on Udemy and have remained in the best-seller categories with a steady stream of passive income ever since.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>We all start somewhere, so if this is all new to you too DO NOT FEAR!  I get it, I've been there.  But I am a living, breathing example that ANYONE with a great course can 'make it' on Udemy - and in this course I show you exactly how I did it so that you can do it to.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>In this course, each video lecture will give you a practical, implementable strategy that you can use to sell more of your Udemy courses.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>Many online instructors, entrepreneurs and business owners work hard to create a course, they put all of their love and passion into it, as well as many hours of effort - they excitedly send it to market when it's ready and......NOTHING HAPPENS.....</p>\n\n<p>There is no feeling worse than this for the online instructor, but luckily IT CAN BE AVOIDED.</p>\n\n<p><br></p>\n\n<p>You're an expert in you topic, but not necessarily in online course marketing, so don't feel bad.  You just need some new tools in your toolkit.  Once you have these strategies, you'll have them forever!</p>\n\n<p>Those who don't take the time to learn how to market and promote their courses, risk missing out on the sales figures they truly deserve.<br></p>\n\n\n\n\n\n<p>Luckily, the marketing behind a successful online course is easily learned.</p>\n\n\n\n\n\n<p>In this online course, I will show you over 50 strategies that you can start using today to become a Udemy best-selling instructor too.</p>", 
    "end_date": null, 
    "title": "How To Promote, Market & Sell Your Udemy Course", 
    "price": "50.00", 
    "instructors": "Sarah Cordiner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662606_a3d1_4.jpg", 
    "course_url": "https://www.udemy.com/online-course-best-seller-how-to-maximise-your-course-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T00:56:51Z"
}