{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Having worked in the music industry for over 15 years, I am well aware of the challenges and obstacles that many artists face during the early stages of their careers. </p>\n\n<p>Given that the music industry is continuously evolving and becoming increasingly competitive, it can often be difficult for aspiring singer-songwriters to develop a solid workable strategy for pursuing careers as professional music artists.</p>\n\n<p>They often find it difficult to devise a workable strategy that suits their particular needs and objectives due to the fact that the Internet is congested with information that is too general and vague to offer any real insight.</p>\n\n<p>This is compounded further by the fact that many modern-day educational programs contain excessive amounts of theory. The curriculum contained in these programs is usually created by tutors and teachers who work in the educational sector as opposed to people who have first hand experience of working in the music industry.</p>\n\n<p>And that is precisely the difficulty that this course aims to address. It’s designed to help aspiring music artists to develop a solid workable strategy for progressing and succeeding in the modern day music industry</p>\n\n<p>The lectures cover a wide range of topics that encompass music business, artist development, marketing, branding, web technology, copyright and contractual agreements. The main focus of the course is Strategy development – knowing what to do and how to do it\n\n  </p>\n\n<p> So if you’re intent on pursuing a career as a professional music artist and are looking to increase your chances of securing a record deal then this is definitely the ideal course is for you.</p>", 
    "end_date": null, 
    "title": "How To Get a Record Deal - Music Artist Development 101", 
    "price": "25.00", 
    "instructors": "Billy Allen", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788566_c6da_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-record-deal-music-artist-development-101/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T16:07:51Z"
}