{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>There can be little doubt that the single <strong>hottest career </strong>in the data field is the <strong>data</strong> <strong>scientist</strong> or BI developer skilled in <strong>predictive analytics.</strong> </p><p>Yes, <strong>Big Data</strong> is on everyone’s lips <strong>but</strong> what happens <strong>after</strong> that big data is <strong>ingested</strong> into a data lake? </p><p>The answer is <strong>predictive analytics.</strong> </p><p>Because we live in the <strong>big data era,</strong> machine learning has become much more popular in the last few years. </p><p>Having l<strong>ots of data </strong>to work with in many different areas lets the <strong>techniques of machine learning</strong> be applied to a broader set of problems.</p><p><strong>Data</strong> can hold <strong>secrets</strong>, especially if you have <strong>lots of it.</strong> </p><p>With <strong>lots of data</strong> about something, you can <strong>examine</strong> that data in <strong>intelligent</strong> ways to find <strong>patterns</strong>. </p><p>This is <strong>exactly</strong> what machine learning does: It examines <strong>large amounts of data looking </strong>for patterns, then generates code that lets you recognize those patterns in new data. </p><p><strong>Your applications </strong>can use this generated code to make <strong>better predictions.</strong> In other words, machine learning can help you create smarter applications. </p><p><strong>Azure Machine Learning (Azure ML)</strong> is a cloud service that helps people execute the machine learning process. </p><p>As its name suggests, it runs on <strong>Microsoft Azure</strong>, a public cloud platform. </p><p>Because of this, <strong>Azure ML</strong> can work with very <strong>large amounts of data</strong> and be accessed from anywhere in the world. Using it requires just a <strong>web browser</strong> and an <strong>internet connection. </strong></p><p>In this course you will be learning and <strong>building predictive algorithms</strong> using <strong>Azure Machine Learning Studio.</strong> </p><p>At the end of this course you’ll be able to <strong>build</strong> and <strong>evaluate</strong> a binary classification predictive model <strong>without</strong> authoring <strong>a single line of code</strong></p><p>You’ll build an <strong>Experiment</strong> for a targeted email campaigned and be able to tell what customers should receive flyers and those that shouldn’t. </p><p><strong>Thanks</strong> for reading about <strong>Azure Machine Learning Studio </strong>and I’ll <strong>see you in the course.</strong> </p>", 
    "end_date": null, 
    "title": "How to Become A Data Scientist Using Azure Machine Learning", 
    "price": "20.00", 
    "instructors": "Mike West", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691182_95a0.jpg", 
    "course_url": "https://www.udemy.com/azure-machine-learning-introduction/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T17:08:10Z"
}