{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p> Course Description </p><p>In this course you will learn about your rights in the US workplace, so you can protect yourself. Whether you are looking for a job, currently working, or your job has been terminated, you need to be aware of the law so you can determine if you have been treated fairly. You will also learn about potential liability including when you could be sued.</p><p><b>Learn about your basic rights to get the upper hand in the workplace in order to determine whether you should contact an attorney. </b></p> <ul> <li>Recognize when Employers can Monitor Your Phone Calls</li> <li>Learn if Your Computer Use is Private </li> <li>Learn if You Should Be Paid Overtime</li> <li>Recognize if You Could Be Sued</li> <li>Learn What an Independent Contractor is</li> </ul> <p><b>A Useful Workplace Guide for Employees</b></p><p>Understanding your basic rights in the workplace provides you with a very useful tool at your fingertips. Not all employers know the law and others may not follow it, so it is very important to have an understanding of what you and the employer can and cannot do. </p><p>There are many guides available for the employer but what about you, the worker? It is essential to have a basic understanding and this course will provide that. </p><p><b>Content and Overview </b>  This course is suitable for anyone in today's workplace. At the end of this course, you will be more knowledgeable about how you should be treated in the workplace. You will learn the various rights you may have as an employee. You will even learn whether the law considers you an employee or independent contractor. Each section ends with a quiz with real life scenarios, so that you can better understand how the law applies in the workplace. </p><p>Starting with privacy laws, this course will then cover types of discrimination, Wage and Hour laws, FMLA, termination, and potential liability. </p><p>The course is complete with examples of how you can determine if a certain law relates to a work situation. After applying the legal definitions, you will be able to understand your rights, and will receive a verifiable certificate of completion upon finishing the course. </p>", 
    "end_date": null, 
    "title": "How to Understand Your Workplace Rights to Get an Upper Hand", 
    "price": "20.00", 
    "instructors": "Heather DeVincent-Cook", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572710_3df9_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-understand-your-workplace-rights-to-get-an-upper-hand/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T19:34:47Z"
}