{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn the basic concepts, tools, and skills that you will need to create training guides with the popular screen capture software, Snagit.</p>    <p><strong>Establish a strong foundation in Snagit and training guide creation with this course.</strong></p><ul><li>Understand the ideas of themes &amp; theory</li><li>Generate screen captures</li><li>Edit screen captures</li><li>Add callouts</li></ul>        <p><strong> </strong></p>  <p><strong>A great skill at your fingertips</strong></p>  <p>Training guides are a great way to document processes and documented processes are great for teaching and training. The ideal student for this course could be Teacher, Office Manager, Small Business Owner, or Content Provider, but really it's anyone that wants to document processes with screen captures or images; even if you've never used Snagit before.</p>  <p><strong> </strong><strong>Content and Overview</strong></p>  <p>Learn how to use Snagit screen capture software to create professional training guides, quickly.</p>  <p>In this course, I share my system for creating training guides from start to finish. Follow me through an example training guide as I lead you step by step from screen capture, to edits, to adding callouts, to placement in a document, to creating a PDF. </p>  <p>This course is 100% video, features 5 sections, includes 4 training guide examples that I review, and is less than an hour long (concise!). See the easy way to use Snagit and learn from my 10 plus years of experience creating training guides. </p>", 
    "end_date": null, 
    "title": "How to Create a Training Guide Using Snagit (Volume 1)", 
    "price": "50.00", 
    "instructors": "Scott Meister", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334844_b139_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-training-guide-using-snagit-volume-1/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T14:46:09Z"
}