{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Congratulations are in order for having chosen to pursue the path of the DBA. <strong style=\"\">YOU&#039;VE</strong> made an <strong style=\"\">EXCELLENT</strong> decision and one that I have no doubt will be very rewarding should you so wish.</p><p>As with any serious endeavor, <strong style=\"\">YOU</strong> want to give <strong style=\"\">YOURSELF</strong> the very best possible start in order to ensure things can move forward.</p><p>This course focuses on what <strong style=\"\">YOU</strong> need to know in order to become a <strong style=\"\">REAL WORLD SQL Server DBA. </strong></p><p>SQL Server is one of the most complicated software offerings Microsoft has. It requires <strong style=\"\">YOU</strong> have a foundation in networks, databases and programming. This wide range of skills is often difficult to obtain without rigorous learning and years of hands on experience. </p><p>The <strong style=\"\">REWARDS YOU</strong> will <strong style=\"\">OBTAIN</strong> are worth effort. Here are just a few. DBAs are very well compensated. <strong style=\"\">YOU</strong> will get to work with some of the <strong style=\"\">SMARTEST</strong> people in the IT world. You&#039;ll <strong style=\"\">LEARN</strong> something EVERY DAY. The profession has been and will continue to be one of the highest growth professions. </p><p>SQL Server Database Administrators are responsible for the design, implementation, support and maintenance of SQL Server Databases. The role also includes architecting, building and scaling databases for future data growth and capacity. </p><p>DBA are also responsible for security, performance and availability of data to users and customers. </p><p>This course will give you some direction on how to begin your journey as a SQL Server DBA. I don&#039;t want to create any false promises. In addition to years of experience most Senior Level SQL Server resources have read a voluminous amount of product related material. </p><p><strong style=\"\">WE </strong>have to start somewhere and <strong style=\"\">THIS COURSE </strong>will provide you with the<strong style=\"\"> REAL WORLD </strong>insight <strong style=\"\">YOU </strong>need in order to start your journey. </p><p>If <strong style=\"\">YOU</strong> are seriously interested in either starting out on the path to becoming a SQL Server Database Administrator the <strong style=\"\">YOU&#039;LL</strong> need two key ingredients. <strong style=\"\">Experience and product knowledge.</strong> Experience might not be easy to get but it will be impossible if you don&#039;t have a very solid foundation in SQL Server.</p><p>ENROLL now. Let&#039;s get started!!! </p>", 
    "end_date": null, 
    "title": "How To Begin Your Career As a SQL Server DBA", 
    "price": 0, 
    "instructors": "Mike West", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499534_0301_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-real-world-sql-server-dba/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T01:26:43Z"
}