{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>What am I going to get from this course?</strong></p><ul><li>Learn every single aspect of being a rap artist step by step starting with your name, image and voice all the way up to shooting and editing music videos, how to tour, how to build every part of your professional team and how to market your music.</li><li>Gain YouTube views automatically from the use of tools you probably don't know about to gain fans everyday while you sleep. </li><li>Market your music using techniques 99.9% of rappers don't know exist</li><li>Learn how to set up your Instagram to gain 1,000 fans a month, same goes for your Twitter. No joke! </li><li>Choose your entire music industry team from Manager, Video Guy, Publicist etc.</li><li>Upload your music to iTunes, Pandora, Amazon MP3 and all others with no help!</li><li>Know what microphone and audio equipment you need to start recording [With budgets]</li><li>Know how to find their image as an artist (using major artist examples)</li><li>Know how to find their best rap voice and flow</li><li>Know where to get free beats and how to download any beat free</li><li>Overcome writer's block with ease</li><li>How to collab with other rappers</li><li>How to tell if other people have read your E-mail you sent them</li><li>Have a clear understanding of every aspect of the music industry</li></ul><ul><li>Earn money from your new skills as an artist</li><li>The list goes on and on and on! Look at the curriculum! </li></ul><p><strong>All at your fingers tips. Instantly.</strong></p><p><strong>What else will you get?</strong><br></p><p><strong>1)</strong> A list of the 200 Top Hip Hop Blogs Contact E-mails [$10 Value]</p><p><span></span><strong>2)</strong> How To Find Your Coolest Rap Voice In 15 Minutes E-book + Audio Book [$27 Value]</p><p><strong><br></strong></p><p><strong>What is the target audience?</strong></p><ul><li>Anyone wanting to actually turn their music into a career</li><li>Any rapper at any level is going to learn from this.</li><li>Anyone who believes in themselves.</li></ul><p><strong><br></strong></p><p><strong>What are the requirements?</strong></p><ul><li>No pre-knowledge required. I show you EVERYTHING!</li><li>A passion for making music</li><li>The ability to want to learn and grow. </li></ul><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "How To Market Music Like A Genius And Build Your Rap Career ", 
    "price": "25.00", 
    "instructors": "Rap Artist Instructor Robert NovAK", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658348_531d_4.jpg", 
    "course_url": "https://www.udemy.com/guide-to-becoming-a-successful-rapper/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T00:38:07Z"
}