{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Michelle Sollicito is a successful EBusiness Consultant and published technical author.</p><p style=\"\">When you pay for the course you get a number of free downloadable ebooks on topics such as angular and bootstrap, many sample documents free as well as Michelle&#039;s book on Business Continuity and Disaster Recovery free as well as her book about her Facebook group that grew to 50,000 members in just 24 hours FREE.</p><p style=\"\">This course consists of a series of videos describing a different aspect of life as an EBusiness Consultant alongside samples of work, links to useful resources, free copies of books etc. all aimed at helping you to be a successful EBusiness Consultant.  </p><p style=\"\">From how to find work as a consultant, through to how to work with clients to ensure the requirements of the work are correct, through to carrying out consultancy work (e.g. business continuity planning, disaster recovery, technical architecture work or RFPs) or implementation work (e.g. analysis and design through to implementation and testing of websites, smartphone apps or desktop apps/software packages).  </p><p style=\"\">The course will explain how to get work using technical websites and LinkedIn as well as repeat work from previous clients and work through other consultancies.  It will explain how to write RFPs, White Papers and technical documentation. </p><p style=\"\"> It will cover how to write and publish training courses and articles about technical issues. How to carry out (pre-)sales and marketing tasks in the IT world, including in-depth Facebook coverage.  How to carry out analysis and design of technical systems and how to implement them with optimal quality and reuse built-in.  How to ensure that systems meet requirements and interact with other systems correctly.   How to ensure that the IT Department is providing good service to the business, that IT Strategy is aligned with Business Strategy, and that risks are mitigated where possible, including how to carry out Audits of IT systems and software, how to ensure a Business Continuity Plan and Disaster Recovery Plan is in place and is effective and how to ensure the Technical Architecture and the Roadmap going forward will provide sustainable IT and software support to the business.</p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "How To Become A Great Ebusiness Consultant", 
    "price": "50.00", 
    "instructors": "Michelle Sollicito", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448546_dc7f_4.jpg", 
    "course_url": "https://www.udemy.com/a-day-in-the-life-of-an-ebusiness-consultant/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T13:31:50Z"
}