{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p><strong>Enroll Now and Receive A Life Time Access on Your Computer, Phone and Tablet.</strong><br></p>\n\n<p>✪ Want to Become a Pilot? Looking for a Course to Learn How to <strong>Operate a Navigation Computer</strong> and Practice Hundreds of Questions. <strong>Congratulations - You've come to the right place </strong>- Enrol Now!</p>\n\n\n\n<p>Learn how to solve <strong>f</strong><strong>light planning and navigation calculations</strong>, in order to pass your pilot licence ground examinations. Know what examiners are looking for and how to solve problems quickly and accurately without losing time for other more time consuming questions. The course provides you with the support and knowledge which brings you closer to achieving your dream of becoming a pilot.<br></p>\n\n\n\n<p>Majority of students find operating a navigation computer challenging and difficult to learn. This course includes over 22 lectures and 2 hours of content. Lectures are mashup, which means that you will be presented with a video and a PDF document side-by-side so you can easily follow the lecture notes while watching the video. Each lecture is then followed by a quiz, which tests your skills and knowledge and provides you with feedback of your performance. Once you have completed all lectures you will be able to undertake ATPL Practice Exams and identify your strengths and weaknesses. Any questions that may arise from following the course will be answered within 24 hours by the instructor.</p>\n\n\n\n<p>I designed this course to be easily understood by student pilots and serve as an exam preparation tool for them. Qualified pilots will also benefit from the course by keeping their skills and knowledge sharp and up to date.</p>\n\n\n\n<p>At the end of the course you will be able to perform all types of calculations quickly and accurately, understand the full potential and benefit of the navigation computer and receive a verifiable certificate of completion.</p>\n\n\n\n<p>➲ What is more?</p>\n\n\n\n<ul><li>You will get a lifetime access to this course, without any limits!</li><li>The course is updated frequently, and of course all future updates are absolutely FREE!</li><li>Get dedicated support from the course Instructor and the learning community anytime you need!</li><li>The course is part of PeakAviation - a company producing great pilot training content!</li></ul>", 
    "end_date": null, 
    "title": "How To Use the CRP-5 Flight Computer and Smash the Exams ", 
    "price": "20.00", 
    "instructors": "BSc Emil Avramov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633910_beb9_4.jpg", 
    "course_url": "https://www.udemy.com/crp5course/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T18:39:03Z"
}