{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>\r\n\tOver the past decade, community colleges, major public universities, and private universities around the country have embraced and operationalized robust online and distance education programs, to meet the needs of the twenty-first century student. This is the largest growth area, within higher education, and all signs indicate that this trend will continue.  However, finding online teaching jobs can be a little tricky and confusing. Relying on traditional job-seeking methods can make one miss the ideal online teaching opportunity, because not all higher education institutions recruit in the same way. The objective of this course, then, is to provide you with a comprehensive strategy and tools to effectively hunt for both academic and vocational online teaching jobs, at the college level.\r\n</p>\r\n<p>\r\n\tThe course will include links to both mainstream and underutilized websites, current articles about legislation designed to promote and fund online education, and how to find jobs with out-of-state institutions.\r\n</p>\r\n<p>\r\n\tThis course is concise and to the point. Each lecture is between five and ten minutes, allowing subscriber the flexibility to either finish quickly or to take their time.\r\n</p>\r\n<p>\r\n\tThe structure of this course will consist of an informative introduction, three main sections, and a conclusion that will discuss how to maintain online employment in other, related ways. I will introduce the various types of online jobs, similarities and differences between types of institutions (public community college, public university, private university, online &quot;mostly&quot; programs). Then the class will explore how to best prepare yourself for job hunting online teaching jobs, at the college level, while discussing when colleges tend to hire faculty. The next section will explore the various strategies and tools to finding an online teaching job within your field (academic, vocational). Next, we will review the various learning software (Learning Management Systems) employed by institutions (Blackboard, Angel, Moodle, eCollege, etc.) and how to leverage them to effectively teach online. Finally, the course will cover how to maintain online employment into the future.\r\n</p>\r\n<p>\r\n\tThis course is for anyone with Bachelor&#039;s degree and vocational trade or a Master&#039;s or terminal degree in an academic field who wishes to teach online. Online teaching allows many people with the experience or education to better balance responsibilities at home, while earning money as an educator.\r\n</p>\r\n<p>\r\n\tAbout me:\r\n</p>\r\n<p>\r\n\tI am a firm believer in online education, because I have been both a online learner and an online instructor. Having returned to school in my thirties, I appreciated the flexibility of a distance education program and learned that they can be wonderful vehicles for achieving educational goals. After I completed grad school, I was hired to design and teach an online geography course, for the University of New Mexico. This course was so successful, I was nominated for the &quot;2009-2010 Outstanding Online Instructor of the Year Award.&quot; I taught this course from my home in California. At the same time, I found a great position with Hutchinson Community College, in Kansas. In total, I taught about twenty classes for them, over four years. To this day, I have never set foot in Kansas. In California, I started teaching online for California State University, along with live courses. The benefit of teaching this way could hardly be measured. I was able to teach from home (remotely), which gave me both valuable teaching experience and the opportunity to better balance my responsibilities at home. So many of my friends and colleagues have and continue to ask me how I find these jobs around the country. In this class, I will teach you!\r\n</p>", 
    "end_date": null, 
    "title": "How to Find College/University Online Teaching Jobs", 
    "price": "20.00", 
    "instructors": "Prof. Brian McCabe", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/74574_1fbb_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-collegeuniversity-online-teaching-jobs/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-06T16:58:20Z"
}