{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">This course focuses primarily on writing song lyrics based on these 2 simple principles:</p><ol style=\"\"><li style=\"\">Your lyrics do not come from your brain. They come from an unlimited source within which then gives you the potential to write unlimited meaningful lyrics.</li><li style=\"\">You must honor a daily practice of writing with no goals in mind. This is your process instead.</li></ol><p style=\"\">The course is structured as such:</p><ul style=\"\"><li style=\"\">Overview on lyrics, getting into a flow state, 3 golden rules for writing.</li><li style=\"\">Exploring lyrics from different points of view and multiple views.</li><li style=\"\">The anatomy of a song, breaking into different parts using them to your advantage.</li><li style=\"\">Creating different lyric structure variations.</li><li style=\"\">Key concepts, exercises and practices for becoming a lyric writing machine.</li></ul><p style=\"\">I encourage discussion and dialog with my students throughout the whole course. I respond very quickly to messages. Let&#039;s do this together!</p><p style=\"\">Whether writing songs is your hobby or your professional career you will find this course to be different from any other with unique and original ideas and upon completion I hope you feel a sense of excitement and enthusiasm as well as enlightenment.<br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "How To Become A Lyric Writing Machine Complete Course", 
    "price": "30.00", 
    "instructors": "Adam Sweeney", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412584_0654_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-lyric-writing-machine-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T19:46:43Z"
}