{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>UPDATE: Thank you all for your incredible feedback on the course! I am so happy to hear how it's helping so many actors on their road to stardom! Keep the messages and comments coming!</p><strong>_________________</strong><p>Since early 2014, I've booked 8 speaking roles on major network and cable television shows, including Person of Interest, Law &amp; Order: SVU, Mysteries of Laura, Royal Pains, and Blue Bloods. I shared a scene with Dane DeHaan in Marvel's The Amazing Spider-Man 2. On the commercial side —  during that same time period —  I booked national Welch's and Dr. Scholl's ads.</p><p><em>Look me up on IMDb </em><em>to see my success.</em></p><p>Learn the principles I put into practice to go from sporadic auditions and rare bookings (1 co-star in 2013, zero in 2012) to booking with regularity and making fans of casting directors so they keep calling me in for auditions.</p><p><em>Now casting directors will keep seeing me, again and again, until I get a role on the show they're casting!</em></p><p>These tools and tricks work for any role in the on-camera world (TV, film, commercials, industrials, sketch, even print ads). Instill casting directors with confidence so they'll call you in for whatever they're casting.</p><p><em>You can't learn this stuff in class. </em></p><p>It's taken me 15 years to learn these techniques, one by one, each moving me one step closer to booking regular TV work. I've accumulated everything you need to know and it's all in this course. </p><p><strong>_________________</strong></p><p><strong>I'm proof that this course works.</strong></p><p>With this course, you will easily identify the areas of your acting career that are holding you back. Most actors neglect one or more of their vital materials, either out of laziness or because they believe their talent alone will take them to the top.</p><p>Stop concerning yourself with things that are outside your control as an actor — whether you book the role, how much your agent submits you, whether your co-star role will turn into a recurring role, etc etc etc.</p><p><em>Let me help you identify what's in your control, and help you eliminate red flags that keep casting directors from calling you in.</em></p><p><em><strong>_________________</strong></em></p><p>Actors, if you ask just about anyone, are OVERPAID. </p><p><strong>Be thankful for that.</strong></p><p>The minimum salary for a series regular on a Screen Actors Guild television show is $5,000 per episode. You shoot 22 episodes. That's $110,000. Factoring in residuals, this amount could be DOUBLED, and you've still got 6 months out of the year to shoot a movie or a couple commercials or write that screenplay. And did I mention that's the <em>minimum</em> salary? It goes up from there!</p><p>Commercial work pays notoriously high rates — anywhere between $5,000 and $60,000 PER AD depending on the distribution (and that's usually for one day of work).</p><p><strong>With the staggering number of TV shows in production, there's never been a better time — in HISTORY — to be a working TV actor.</strong></p><p>Learn how to BOOK YOUR WAY UP THE LADDER, from co-stars (the smallest SAG-AFTRA speaking roles) on up. Get some co-stars, you'll start getting auditions for guest starts (multiple scenes and an emotional arc) and recurring roles.</p><p><em>Then, and only then, will you be even considered for series regular work.</em></p><p>Let me show you how to get on this path — getting into casting offices, auditioning with confidence, and BOOKING ROLES.</p><p>SEE HOW I'M GETTING...</p><p>...speaking roles on major shows and networks — 8 since the beginning of 2014!</p><p><span></span>...regular auditions for recurring roles and series regulars.</p><p><span></span>...thousands of dollars per year in residuals from TV work.</p><p><span></span>...the chance to work with amazing directors who remember my work and think of me for future projects.</p><p><span></span>...the ability to live the dream as a working actor, making a living off my TV, commercial and film work.</p><p><strong>_________________</strong></p><p><strong>What this course is NOT:</strong></p><p>I can't teach you acting craft (not over the internet, anyway). If you're a serious actor, you should always be sharpening your skills and working on material and getting your mouth around some text.</p><p><em>Get acting. That's all you. </em></p><p>I'll show you how the easy things, squarely in your control — headshots, resume, demo… your materials — are what'll get you in the room.<em></em></p><p>Then I'll show you how to make such an impression in the room that casting directors will keep calling you back, again and again, until you book.</p><p><strong>_________________</strong></p><p>Whether you're new to acting, auditioning occasionally, or getting out but not booking regularly, these practical tools will ensure that you're covering all your bases and not standing in your own way (which an embarrassingly high number of actors are guilty of).</p><p><em>Get out of your own way! I'll show you how.</em></p><p>Remember, I've booked 8 SAG-AFTRA roles on network and cable TV <strong>IN THE LAST YEAR ALONE</strong>. I'm CURRENTLY a working actor. Take it from me — I'm out there right now, auditioning, booking, and getting on TV.</p><p>In addition to the Udemy 30-day guarantee, you have my personal promise that you will take away the skills to PUT YOURSELF ONE DAY CLOSER TO BOOKING TV WORK immediately.</p><p>Every day you wait to TACKLE your acting career is a day you're missing out on an audition. Click now, buy this course, and start taking control of your acting career TODAY. Let me show you some things I've learned!</p><p>Enroll now!!</p>", 
    "end_date": null, 
    "title": "How I Booked 8 Acting Roles On Major TV Shows in a Year", 
    "price": "40.00", 
    "instructors": "Brennan Taylor", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403804_0502_3.jpg", 
    "course_url": "https://www.udemy.com/how-i-booked-8-roles-on-major-tv-shows-in-the-last-year/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T20:47:24Z"
}