{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t      UPDATE: Course Updated For February 2015  </p>  <p style=\"\">  \tIf you're like me, you are an artist first and don't like the business part of it.  But you know how important it is to fund your dream job.  </p>  <p style=\"\">  \tIf you take this course, you can learn how to make money doing the thing you love:  taking pictures and/or making videos - just like me!  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">  Learn from my mistakes.  Invest in yourself.  </strong></em>  </p>  <p style=\"\">  \t      If you're looking for \"instant easy get rich quick\" scheme, don't take this course. You will have to actually follow the advice in this course to have a chance at being successful with your dream business.  </p>  <p style=\"\">  \t      There is no guarantee for your success but you can learn from my mistakes and our best practices so you don’t have to pay for your own mistakes.  </p>  <p style=\"\">  \t      NEW! Now includes resource guides!  </p>  <p style=\"\">  \t      +++++++++++++++++++++++  </p>  <p style=\"\">  \t      About this course:  </p>  <ul style=\"\">  \t<li>Based on actual experience and our actual fully functional studio</li>  \t<li>Full, free lifetime access</li>  \t<li>Includes regular office hours to ask questions!</li>  \t<li>All future extra lectures and upgrades are always included for free</li>  \t<li>Unconditional Udemy 30 day money-back guarantee!</li>  \t<li>Now includes resource guide - access instantly!</li>  </ul>  <p style=\"\">  \t      SEE HOW WE EARN:  </p>  <ul style=\"\">  \t<li>Over $3,000 a week taking pictures and making videos</li>  </ul>  <p style=\"\">  \t      .... all on average month after month, after month!  </p>  <p style=\"\">  \t      Today, you can start to make good money with your photography and videography!  </p>  <p style=\"\">  \t      Take a peek into our studio and how we run a six figure photo and video business.  </p>  <p style=\"\">  \t      Whether you are starting a photography or videography business or have been struggling for years, this class is for you.  </p>  <p style=\"\">  \t      You'll learn:  </p>  <ol style=\"\">  \t<li>About me and my varied experience that help me build this successful business</li>  \t<li>What to think about before starting your photo or video business</li>  \t<li>How to gain more freedom and flexibility with a true business instead of running around doing everything</li>  \t<li>One simple mindset trick that helps you succeed</li>  \t<li>The prerequisite to succeed in the photo and video business</li>  \t<li>The pitfalls and tips to build a great team</li>  \t<li>How ARTISTS help make the world better and make money doing it</li>  \t<li><strong style=\"\">How to set your prices.</strong></li>  \t<li>How to choose your business structure for your protection</li>  \t<li>Bringing in employees or contractors</li>  \t<li>Pros and cons of working from home, renting a studio, or sharing a space, </li>  \t<li>Should you buy or rent gear?</li>  \t<li>Controlling your expenses</li>  \t<li>The power of cash flow</li>  \t<li><strong style=\"\">Free yourself to do more Fun Stuff</strong></li>  \t<li>What tools and systems we use to run our business.</li>  \t<li><strong style=\"\"><em style=\"\">How to handle the Accounting and the other things you hate</em></strong></li>  \t<li>Marketing and Sales tips</li>  \t<li>Financial tools tips</li>  \t<li>Accident and theft protection for very little money</li>  \t<li>Five Laws that can shape your business</li>  \t<li>Ideas and philosophy to help you succeed</li>  </ol>  <p style=\"\">  \t      ... and more!  </p>  <p style=\"\">  \t      Click the \"take this course\" button, top right, now ...  </p>  <p style=\"\">  \t      Don’t struggle …  </p>  <p style=\"\">  \t      Learn from my experience and mistakes.  </p>  <p style=\"\">  \t      Invest in yourself and invest in your business.  </p>  <p style=\"\">  \t      Do it right the first time.  </p>  <p style=\"\">  </p>  <p style=\"\">  \t<span>I am committed to your success.  </span>I want you to succeed.  If you succeed, we all win.   Plus, my name is on this.  I don't want to be embarrassed by putting out bad information.  </p>  <p style=\"\">  \tSincerely,  </p>  <p style=\"\">  \t      -Jeff Orig  </p>  <p style=\"\">  </p>  <p style=\"\">  </p>  <p style=\"\">  \t      P.S.  This is <strong style=\"\"><em style=\"\">less than the cost of a lens</em></strong> but you can make many times that amount with this knowledge.  </p>  <p style=\"\">  \t      P.P.S.  Don't forget the money back guarantee!  Give it a try, I think you'll be happy you did.  </p>", 
    "end_date": null, 
    "title": "How to Start Your Own Business by Taking Photos & Videos", 
    "price": "20.00", 
    "instructors": "Jeff Orig", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410094_160d_2.jpg", 
    "course_url": "https://www.udemy.com/photovideobusiness/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T17:32:57Z"
}