{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>How to Buy a New Car</strong><span> will teach you everything you need to know if you are planning on purchasing a New Car.  As a previous car salesman, I know the secrets that dealerships do not want you to know.</span>  </p>  <p>  \t            This course will teach you:  </p>  <ul>  \t<li>Important information about when to buy a new car</li>  \t<li>Proven times when NOT to buy a new car</li>  \t<li>Essential preparation work before going to a dealership</li>  \t<li>How to negotiate, The Right Way, to get the best deal on a new car</li>  \t<li>The Secrets of how to play the new car purchase GAME!</li>  </ul>  <p>  \t            Stop paying too much for a new car.  Learn what every car purchaser should know.  Discover what a trial close is, and learn what you should know BEFORE you Buy a New Car.  </p>  <p>  \t        Take my course - study it, test it, implement it...and, if for whatever reason you are not happy then you can get a 100% \"no questions asked\" refund.  You will have 30 days to test drive my course and be covered by this <strong>100% money-back guarantee</strong>. So, you have absolutely no risk!  </p>  <p>  \t            What do you have to lose?  30 minutes could save you thousands.  Buy this course and you will get FREE access for my soon to be released <strong>How to Purchase a Used Car </strong>course.  </p>  <p>  \t          Also in included in this course is a <strong>FREE NEW CAR PURCHASE CHECKLIST</strong>.  This checklist will ensure you get everything you want.  </p>  <p>  \t          Learn the <strong>New Car Purchase GAME</strong> and become<strong> more confident</strong> when you buy a car.  When you know the GAME, you will actually enjoy buying a new car.  </p>  <p>  \t        So, do not leave home without this information.  Join the other successful students that are already more confident when buying a new - start today!  </p>  <p>  \t        To your Success,  </p>  <p>  \t        David Peterson  </p>", 
    "end_date": null, 
    "title": "How To Buy a NEW Car with Confidence!", 
    "price": "20.00", 
    "instructors": "David Peterson", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338458_f2b6_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-buy-a-car-with-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T13:36:13Z"
}