{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t            This course tackles the relatively new office structure known as the &quot;collaborative work environment&quot;. These are open area work spaces (no walls) and rows of cubicles that leave employees feeling their privacy and power have been taken from them.  </p>  <p style=\"\">  \t<p style=\"\">  \t\t            My 20 years of corporate experience and training as an energy practitioner lends new insight and methods that assist with reducing stress associated with this new phenomenon. I combine a blend of corporate politics with energy balancing leaving students with the ability to concentrate on work tasks not the confines of their current physical environment.  \t</p>  \t<p style=\"\">  \t\t<p style=\"\">  \t\t\t           Included in this course is a 4 step method known as C.A.S.E. to walk you through a process which has helped me withstand the day to day struggles working within the collaboration workspace.  I will remind you of the thoughts behind why these spaces are being constructed in this manner but the actual result being noticed by workers operating under these conditions.  \t\t</p>  \t\t<p style=\"\">  \t\t\t<p style=\"\">  \t\t\t\t           Most importantly, what you can do about it and how to improve the overall &quot;feeling&quot; or energy of the space. Not only we can control our behavior and emotions, I can give you some tactics and reminders that will assist with the management of your work environment so you can take back your own power. Lets face it with the push to cut costs and overhead these type of work structures won&#039;t be disappearing overnight. So lets hit the issue head on, deal with it and move on...  \t\t\t</p>", 
    "end_date": null, 
    "title": "How to Survive in The Open Workspace Environment", 
    "price": "25.00", 
    "instructors": "Shelly Jo Pinter", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256148_ebdb_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-survive-in-the-open-workspace-environment/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-05T17:07:45Z"
}