{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What will this course teach?</strong></p><p>Picking up chicks can be easy. Among males, the biggest fear is rejection.<br></p><p>This course will teach you the ins and outs of picking up women, seduction, and how to be an alpha male.</p><p><strong>What terminology would your target audience expect to use to find your course?</strong></p><p><strong><strong>PUA, Pick-up Art:</strong> This is simply the art of courting women. Pronounced pee-you-ay.<br></strong></p><p><strong>Bubbling:</strong> blowing bubbles back and forth (figuratively) until that small bubble turns into a large bubble that envelops both of you. A playful conversation. Start with a tennis ball and maybe it will turn into a large beach volleyball over time.</p><p><strong>IOI, Indicator of Interest: </strong>Twirling her hair, opening up her chest, smiling, eye contact, these and other types of body language will show that she interest.</p><p><strong>Peacocking: </strong>Intentionally displaying and/or isolating yourself so as to stick out. Wearing a leather jacket to a denim party, a shiny tie, showing some chest hair, these are all ways to stick out amongst the noise. Sometimes it pays to be a sore thumb.</p><p><strong>What kind of materials are included?</strong></p><p>You will receive an hours-long, intensive course on how to smoothly and effectively pick up women.</p><p><strong>How long will the course take to complete?</strong></p><p>The course should be completed in 3 days or less.</p><p><strong>How is the course structured?</strong></p><p>14 Lessons, 5 Bonus Lectures 3 Homework Assignments, and 1 PUA Quiz</p><p><strong>Why take this course?</strong></p><p>Take this course to up your game, whether it be to pick up girls on Tinder, find your soulmate, or approach a woman at Starbucks.</p>", 
    "end_date": null, 
    "title": "How to Pick Up Women: Smooth and Effective Ways to Score Now", 
    "price": "20.00", 
    "instructors": "Stefan Djordjevic", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756540_9f11.jpg", 
    "course_url": "https://www.udemy.com/how-to-pick-up-girls/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T23:57:38Z"
}