{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>If you have ever wanted to learn to Fly Fish or you have been stuck next to the guy on the pond who is catching fish after fish with a fly rod and you want to know what magic he is using then this course is for you.  I will take you out on the river and teach you everything you need to know.  You can even download portions of this course and take it on the river with you!  It's like having your own professional guide with you on the water.  Makes a great gift for a new fly fisher!<br></p><p>I have loved fishing for my entire life, but I didn't know how to fly fish.  All I knew was that people who were fly fishing always caught more fish than me and it drove me crazy.  When I was 12 years old I got my first Fly Rod (the WalMart Special) and after spending hours online and on YouTube I discovered that there was far too much scattered information and the videos on YouTube were too disconnected to make sense of as a whole.  </p><p>The Fly Rod went into storage for almost a decade.  When I moved next to a Blue Ribbon River (in other words a really good fly fishing river) a few years later I decided that I was going to tackle it once and for all.  I went out on the river all by myself, every day, for three weeks straight and didn't catch a single thing!  I had absolutely no idea what I was doing.  Finally I ran into a few guides on the river who were kind enough to show me some basics and I have been fly fishing ever since.</p><p>I promised myself that I would pay forward the kindness of those guides and that's why I have made this course.  I hope you will enjoy learning the art of fly fishing and pay it forward as well!<br></p>", 
    "end_date": null, 
    "title": "How to Fly Fish: A Lifelong Hobby", 
    "price": "40.00", 
    "instructors": "Chase Thornock", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721106_65cd_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-fly-fish/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T19:02:20Z"
}