{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>About This Course:</strong></p><p>You will learn how to practice <em>self-hypnosis</em> and <em>consensual therapeutic hypnosis</em> so you can help yourself, and/or help clients in a professional hypnotherapy practice.</p><p>This course will give you a foundation in hypnosis because you will learn how to speak hypnotically, and apply hypnosis safely and ethically.</p><p>You will learn how to create your own hypnosis scripts. You will achieve this by learning hypnotic language techniques and principles so you can more-so deepen the hypnotic experience for your clients. As you speak more and more hypnotically, practicing what I teach you, you will quickly elevate your hypnosis range of capabilities and become a much more eloquent hypnotist. You will no longer feel the need to rely on hypnosis scripts. This means feeling much more empowered, confident, and competent as a hypnotist.</p><p>You will also be able to open your own hypnotherapy practice and be able to successfully hypnotize clients.</p><p><strong>Here's everything included in the course:</strong></p><ul><li>Four primary white-board style video lectures;</li><li>Total instructor support with in-class discussions;</li><li>Final exam to measure your success with the course;</li><li>Certificate (helps with resume building, credibility, etc.);</li><li>Hypnotic language mini-course so you can create your own hypnosis resources and never have to rely on other hypnotists' scripts ever again;</li><li>A positive experience; and,</li><li>A course book bonus; packed full of valuable content which supports and follows along with the course lectures.</li></ul>", 
    "end_date": null, 
    "title": "How I Hypnotize", 
    "price": "50.00", 
    "instructors": "Bryan Westra", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565580_e280_3.jpg", 
    "course_url": "https://www.udemy.com/how-i-hypnotize/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T00:36:53Z"
}