{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \tLearn concrete lessons to get more done at work, set better expectations, organize your work and prepare for any situation!<br style=\"\">  \t<br style=\"\">  \t                Upfront costs are $0 but taking these steps could increase your success by thousands of dollars in profit per month.<br style=\"\">  \t<br style=\"\">  \t<em style=\"\">&quot;But, I&#039;m afraid&quot;</em><br style=\"\">  \t<br style=\"\">  \t                 Fear is one of the first topics covered in this course. The  hardest part is STARTING ... don&#039;t let fear hold you back from changing  your life!<br style=\"\">  \t<br style=\"\">  \t                You don&#039;t need to buy ANYTHING.<br style=\"\">  \t<br style=\"\">  \t                You&#039;ll learn how to gain success by following concrete lesson models.<br style=\"\">  \t<br style=\"\">  \t                You&#039;ll learn how to help others by first helping yourself.<br style=\"\">  \t<br style=\"\">  \t                 Only after you follow the lessons outlined in this course will  you start to experience the dynamic positive changes in your life.<br style=\"\">  \t<br style=\"\">  \t                 You NEVER need pay anything and I will be here for you to  answer any questions you may have along the way. This is my guarantee.  </p>  <p style=\"\">  \t<br style=\"\">  \t                You are setting yourself up for success with:<br style=\"\">  \t                NO upfront cost<br style=\"\">  \t                Proven methods getting more done and prioritizing.<br style=\"\">  \t                You will make back your investment of your time almost immediately.<br style=\"\">  \t                NO risks<br style=\"\">  \t<br style=\"\">  \t<em style=\"\">&quot;How do I know this will work?&quot;</em><br style=\"\">  \t<br style=\"\">  \t                 You&#039;ll be learning methods that are decades of years old used  by some of the most successful people in history (ex. Benjamin Franklin,  Albert Einstein, Henry Ford, J.D. Rockefeller, etc.) and are currently  being used in corporations today across the globe. The instructor of  this course is an Ivy League graduate studying business and social  psychology and using this course material daily in his work at Fortune  500 technology company.  </p>  <p style=\"\">  \t<br style=\"\">  \t                The benefits you will receive from the course are unlimited!<br style=\"\">  \t<br style=\"\">  \t                Your potential income is limited only by your personal time and effort.<br style=\"\">  \t<br style=\"\">  \t                 I have been been using these techniques since 2009 and since my  initial learning period, I have obtained a Masters degree from Columbia  University, worked as a consultant for 3 years for a Fortune 500  technology company earning over $80,000 annually and have started my own  business, working from home in California.<br style=\"\">  \t<br style=\"\">  \t                What worked and continues to work for me WILL work the same for you!<br style=\"\">  \t<br style=\"\">  \t                You need no prior experience in business, psychology or acting.<br style=\"\">  \t<br style=\"\">  \t                Click the &quot;Take This Course&quot; button on the top right of the screen because every<br style=\"\">  \t                minute you wait is costing you time and money...  </p>  <p style=\"\">  \t                Scroll up and Enroll Now!  </p>", 
    "end_date": null, 
    "title": "How to Be Productive at Work!", 
    "price": "50.00", 
    "instructors": "Ryan M. Mancinelli", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366840_121d.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-productive-at-work/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T19:25:24Z"
}