{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Have you been putting off your music dreams for too long? Get ready to be inspired by the world's leading Music Coach.</strong></p><p>Welcome to<strong> the most important</strong> Music Career <strong>Course</strong> you will ever take, from Warner-signed, best-selling artist, composer, label owner and publisher, and #1 world-ranked Music Life Coach, Mark Desvaux.</p><p>Why is it that so many brilliant artists, vocalists, bands, musicians, DJs, composers, producers and songwriters fail to get their career to take off? <strong>The secret has nothing to do with their music </strong>and <strong>everything </strong>to do with their <strong>mindset.</strong> How is your music mindset? How do you visualise music success? Do you have a concrete plan? Are your beliefs about your music helping or hindering you? How do you overcome the fears that stop you taking action? </p><p>This course will:<br></p><p>• Give you<strong> the mindset of a millionaire musician.</strong></p><p>• Teach you how to <strong>dream bigger </strong>than you ever dared.</p><p>• Help you define, plan and <strong>create your music vision.</strong></p><p>• Show you the <strong>shortcuts.</strong></p><p>• Teach you essential <strong>insider tips </strong>to succeed in the Music Business.</p><p>• Help you <strong>beat your inner saboteur</strong> when you hit roadblocks, creative or confidence slumps.</p><p>• Give you a <strong>big kick up the bassoon</strong> to make it happen!</p><p>Every technique I reveal is easy to <strong>put into action in minutes </strong>and tried and tested by in my own career. You will start to see <strong>instant breakthroughs</strong>.</p><p>Using these <strong>7 Secrets</strong> have personally led me to:</p><ul><ul><li><strong>Two bestselling albums</strong> (Urban Myth Club)</li><li>Sign a major <strong>publishing deal </strong>with <strong>Warner</strong></li><li>Mainstream <strong>radio airplay</strong></li><li>Land a theme on Brazil's most popular show (<strong>30m viewers</strong> nightly)</li><li>Play <strong>major festivals</strong> including <strong>Glastonbury</strong></li><li><strong>Royalties</strong> from music on TV globally</li><li>Sign 50+ <strong>compilation deals</strong></li><li>Be released on <strong>major labels</strong></li><li><strong></strong>Start my own record label &amp; publishing company &amp; sign artists</li><li>Over <strong>1m </strong>plays on <strong>Spotify </strong></li><li>Work with a finalist from <strong>The Voice (USA)</strong></li><li>Co-write &amp; produce a <strong>Top 30 US artist</strong></li></ul></ul><p><br>When I first started coaching these Secrets to others I saw them replicate this kind of success. My coaching clients now include an artist <strong>who has sold 16m records</strong> and the mentor of the #1 sensation<strong> Ed Sheeran</strong>.<br></p><p><em>*** THIS COURSE PRICE WILL BE INCREASING IN THE FUTURE, SO ENROLL NOW BEFORE THE PRICE GOES UP***</em><br></p><p>On top of the Udemy 30 day guarantee, you have my promise that <strong>you will be inspired and motivated</strong> by what you will learn in the this course.</p><p>To learn how to apply yourself using my personal \"insider\" experiences – found in no book or at Julliard or Berklee - <strong>get this course now</strong>. </p><p><strong>Every minute you delay is a minute from living your music dreams…</strong> costing you lost royalties, label &amp; publishing deals, album sales and all the unknown opportunities ready to reveal themselves.</p><p>Take this course and get inspired into action. <strong>Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "How To Ignite Your Music Dreams", 
    "price": "40.00", 
    "instructors": "Mark Desvaux", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311094_4a55_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-live-your-music-dreams/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T21:23:53Z"
}