{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you love reading, you know that it can be an expensive hobby.</p>\n\n<p>But that doesn’t have to be the case! Over the last few years I have acquired more than 3,700 Kindle books, the vast majority of which have literally cost me nothing.</p>\n\n<p>How did I do it? That’s what this course is all about.</p>\n\n<p>In it, I walk you through 4 little-known techniques to find and download free Kindle books!</p>\n\n<p>Within the first 30 minutes of this course, you’ll learn how to find at least 100 free books for your Kindle.</p>\n\n<p>I’ll also show you how you can find hundreds of additional free books in your specific interest areas, whether they be fiction or nonfiction.</p>\n\n<p>Plus new books are constantly being added to (and deleted from) the list of books offered for free, so availability literally changes hourly, giving you even more free books to add to your library.</p>\n\n<p>These techniques are fast and easy! In fact, literally anyone can do them.</p>\n\n<p>And everything I teach is legal and ethical, in fact Amazon actually wants you to do this!</p>\n\n<p>You don’t even have to own a Kindle - you can read them on your smartphone, your tablet, even your computer, just by downloading the free Kindle app.</p>\n\n<p>And now, for the price of just a couple of books you can take this course, and develop a massive library of excellent books in your favorite subject areas.</p>\n\n<p>So, no matter what types of books you love to read the most: romance, thrillers, business, self-improvement, graphic novels, mysteries, etc., simply click on the button to Take This Course, and let’s get you started building your own massive library that will give you thousands of hours of enjoyment for years to come!</p>", 
    "end_date": null, 
    "title": "How to Get Free Kindle Books", 
    "price": "20.00", 
    "instructors": "Don Crowther", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822296_e404_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-free-kindle-books/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T22:27:43Z"
}