{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Welcome to the Frontier of Corporate e-Learning!</strong></p>  <p>If you are excited to create innovative online courses and currently have an active Udemy for Business learning portal inside your company, then you have come to the right place. Whether you are an experienced instructional designer, a boot-strapping entrepreneur, or a creatively charged employee - nothing should keep you from sharing the skills you know best with the rest of your company. Udemy for Business course creation is all about breaking down the skills-gap by promoting internal knowledge sharing in a way that is simple, engaging, and mobile-ready. </p><p> This course is your one-stop-shop for all things related to course creation.  The Udemy instructor team has created this course to be a constantly evolving resource for all of your course creation needs.  Here's what we'll cover:</p>  <ul>  \t<li>What scenarios are most useful for creating an internal online course</li><li>How to create your course, from beginning to end.</li>  \t<li>Course quality suggestions: so you can make sure your course is up to par.</li>  \t<li>How to pick your course topic, identify your target audience, and plan your outline.</li>  \t<li>How to actually film your course: the nuts and bolts of capturing awesome audio and video, and high quality editing to make sure your course looks amazing.</li>  \t<li>How to create buzz around the launch of your course internally and keep students engaged when the course is live</li>  \t<li>Teaching tips, and how to make edits to your course post-publishing.</li></ul>  <p>Additionally, think of this course as the jumping-off point for your exploration into the Udemy Instructor Community. We'll direct you to all of our resources as well as our communities where you can join the conversation and interact with other instructors from all walks of life (as well as the Udemy team).</p><p>  \t Are you ready to push the boundaries of corporate e-learning?  Let's go!</p><p>If you are not a Udemy for Business customer and would like to learn more about us, go ahead and shoot us an email at <strong>business@udemy.com</strong> with the subject line \"Tell Me More!\"</p>", 
    "end_date": null, 
    "title": "How to Create a Course for Your Business", 
    "price": 0, 
    "instructors": "Erin Adams", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531400_da0c_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-course-for-your-business/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T16:50:00Z"
}