{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled 'Hypnosis- Heal Pimples Naturally Using Self Hypnosis' By Pradeep Aggarwal , you will learn -</p><p>Young teenage girls face the problem of pimples a lot. Having pimples affects their self-confidence and their friends get a chance to make fun of them easily. This course is designed for all those who want to heal their pimples and enhance their beauty. Self hypnosis is natural and safe without side-effects. You will be amazed how your mind can heal your body naturally.<br></p><p><strong>Psychological Reasons for Pimples</strong></p><p>There can be many reasons for pimples varying from hormones, wrong eating habits, not taking proper care of your skin, oil, heal in the body etc. If you have tried almost everything like medicines, ointments, creams in healing your pimples but got no result, you got to consider your emotions. Emotions play a vital role in your skin conditions. Many famous skin experts believe that stress and anxiety can affect your skin predominantly.</p><p>Some of the psychological reasons for pimples can be stress and anxiety.<br></p><ul><li>Pimples can be caused if one faces difficulty in expressing, understanding, or describing emotions;<strong></strong></li> <li>Suppressed feelings<strong></strong></li> <li>Stress, Anxiety, Depression<br> <br> <strong></strong></li></ul><p>Learn about conscious mind and subconscious mind and how we can program our subconscious mind for better health conditions and changing habits. Also get a detailed insight into self hypnosis. There are lots of myths attached to self hypnosis, let go of all the myths you may have about self hypnosis. Self hypnosis is natural, safe and effective method to treat many of the physical and health problems.</p><p><strong>Some Useful Tips: </strong></p><ul><li>Avoid fatty, sugary foods. Avoid milks, sodas, chocolates, candy bars and ice creams. </li> <li>Include more fruits and vegetables.</li> <li>Drink more water.</li> <li>Take vitamins. </li> <li>Include physical activities in your daily routine. Exercise and sweat.</li> <li>Practice relaxation and self hypnosis.</li></ul><ul><li>You will be able to Heal your pimples and live a healthy and happy life using powerful positive affirmations and self hypnosis techniques and change the negative state of mind into positive state .</li></ul><p>This course is ideal for young girls and women who emotionally get affected because of unclear skin and pimples .</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English including a bonus E-book</p>", 
    "end_date": null, 
    "title": "Hypnosis- Heal Pimples Naturally Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607736_7237.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-heal-pimples-naturally-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T07:25:21Z"
}