{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Are you aspiring to enter the Banking industry as a Probationary Officer? If yes, this is the course that offers great value.</p><p><strong style=\"\">Contents :</strong><span class=\"apple-converted-space\"><em style=\"\"> </em></span>The course provides you with online coaching to compete the IBPS conducted Bank PO Exam successfully. It contains (a) video lectures and (b) supporting study material (in soft copy format) in all 5 areas of the Exam, namely (1) Quantitative aptitude; (2) Reasoning ability; (3) English Language; (4) Computer Awareness and (5) Banking, Economic and General Knowledge.</p><p><strong style=\"\">Completion Time : </strong>Being a self-paced course, it gives you the option to plan your time yourself. However, we would suggest that you put in intense study of at least 4-5 hours daily on a regular basis to complete the course within two months. Based on the experience of students, we are convinced that this strategy will help you master the basic concepts and practice sufficiently to meet the following three basic parameters for success in the exam (1) 95% attempt, (2) 90% accuracy and (3) average time per question @ 36-40 seconds.</p><p><strong style=\"\">Course Structure : </strong>The course is divided into above five sections containing video lectures covering almost all the relevant topics. For reinforcement of what you learn and for proper practice, we suggest you to purchase study material covering these aspects, in book form, available with general book sellers in almost all cities and towns in India.</p><p><strong style=\"\"></strong><strong style=\"\">Why this course :</strong></p><p>(a) Our courses have helped a large number of aspirants in  entering the banking system in responsible positions. Our publications are being used by thousands of bankers.</p><p>(b) The material has been developed by a team of Bankers and subject experts with long experience of actual class room coaching for this exam.</p><p>(c) The course has been validated by Mr. N S Toor, a banking teacher, who has authored 20 books, developed six E-Learning courses and has more than 125 videos on banking on YouTube.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "IBPS Bank PO Entrance Exam in India", 
    "price": "50.00", 
    "instructors": "Prof. N S  Toor", 
    "commitment": "36 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426840_7406_5.jpg", 
    "course_url": "https://www.udemy.com/ibps-bank-po-entrance-exam-in-india/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T13:55:42Z"
}