{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong style=\"\"></strong><em style=\"\">This course is updated regularly with the latest releases of iDempiere / Adempiere and also contains interval database dumps of all the work carried out in the course.</em><em style=\"\"><br style=\"\"> <br style=\"\"> This course has </em><em style=\"\"><strong style=\"\">LIFETIME ACCESS</strong></em><em style=\"\"> once you sign up! </em> </p><p>Implementing and learning a new ERP system can be a daunting task to say the least, even to the most skilled IT professionals and consultants. This course aims to overcome this challenge quickly and painlessly.</p><p>By going through this course you will get up to speed with Adempiere / iDeempiere and their variants, without the huge learning curve,. We start with a quick and easy intro to installing the system and then move on to the foundations of the web interface, the initial client setup and continue through to a step-by-step introduction to the iDempiere setup process. </p><p>After each module, you are invited to try the lesson for yourself to consolidate your iDempiere / Adempiere knowledge and skills.</p><p>Follow <strong style=\"\">step-by-step</strong> instructions to learn how to setup and use Adempiere / iDempiere the way your business needs.</p><ul style=\"\"><li> Over 40 lectures and 4 hours of content!</li><li> Clear explanations of both the how and why</li><li> Extensive coverage of all setup procedures an implementation would be expected to fulfill</li><li> Proven methodology for successful application on the job</li><li>Instructor available by email to respond to questions</li></ul>", 
    "end_date": null, 
    "title": "Idempiere / Adempiere 101: Get up and running fast", 
    "price": "50.00", 
    "instructors": "Ed Arellano M.B.A.", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456758_4e41_3.jpg", 
    "course_url": "https://www.udemy.com/idempiere-adempiere-101-get-up-and-running-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T14:24:47Z"
}