{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Jennifer Ann [Student Review]<em> -</em> <em>\"This course helped me to understand the right format, essence and structure of task 1 and task 2. I just followed the tips and with constant practice, I have scored my target mark in IELTS! Mr. Tim is willing to check and mark the sample essays of the students which are added bonus.</em><br></p><p>Bong Yew Tzuu [Student Review]<em> - \"I found your course really useful. Most importantly, it is easy to understand.\"</em></p><p><strong>Discover The Secrets To Writing High Scoring Answers For Less Than Half The Cost Of Most IELTS Preparation Books!</strong></p><p>Did you know most people fail the IELTS exam because of the writing section?</p><p>To get a high score in the IELTS writing section you must learn how to formulate answers in the correct way using the correct structure. </p><p>This course will teach you step-by-step how to write answers that will give you an 8 level score on the IELTS exam (Academic test mode). </p><p><strong>Master The IELTS Writing Section By Learning Strategies You Can Use To Immediately Increase Your Writing Score!</strong></p><ul><li>Get high scoring sample answers for Task 1 and Task 2</li><li>Discover how to write answers that align with the IELTS scoring criteria</li><li>Get sample questions to practice for Task 1 and Task 2</li><li>Understand exactly how high scoring students write their answers</li><li>Discover how high scoring paragraphs are structured</li><li>Find out exactly how to write full high scoring answers for Task 1 and Task 2</li><li>Gain worldwide recognition for your English language skills with an 8 level score in the IELTS writing section!</li></ul><p>Achieving a high score on the IELTS opens up many doors for you. The IELTS can give you the necessary language level for your immigration visa, employment options or studying at any tertiary institution you desire. </p><p>Mastering the IELTS is actually not as difficult as it may seem, you just need to learn how to do it. I have written this IELTS writing course to provide a step-by-step system you can follow to immediately increase your writing score. </p><p>All of the course content has been taken from my years of experience teaching IELTS and researching exactly what students must do to achieve a high score. I have also written several best-selling IELTS preparation books which you can find on almost any market-place. </p><p>I know exactly what works and what doesn't work when it comes to IELTS writing. </p><p>This course is perfect if you want to learn how to pass the writing section in easy to understand steps. </p><p><strong>Contents and Overview</strong></p><p>This course contains 29 lectures which are straight to the point and easy to follow and understand. It is designed for anyone who wants to increase their IELTS writing score for visa, employment, or study purposes. </p><p>Covering both Task 1 and Task 2 of the exam, you will begin by understanding the different question types and the structures to use for each type. </p><p>You will then learn how to formulate each paragraph for each answer step-by-step by following exactly how I do it in the lectures. </p><p>By the end of the course you will know how to: </p><ol><li>Identify the different question types</li><li>Use the correct structure for each type</li><li>Write a powerful introduction (both Task 1 and 2)</li><li>Develop strong supporting paragraphs (Task 2) and middle paragraphs (Task 1)</li><li>Finish your answers with a clear and concise conclusion (both Task 1 and 2)</li><li>Write answers which align with the scoring criteria and that the evaluators love</li></ol>", 
    "end_date": null, 
    "title": "IELTS Writing: Achieve A Target 8 Score!", 
    "price": "20.00", 
    "instructors": "Timothy Dickeson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358782_7426_3.jpg", 
    "course_url": "https://www.udemy.com/ielts-writing-academic/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T00:47:06Z"
}