{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>  \t    Hi there,  </p>\n\n<p>  \t    The course <strong class=\"redactor-inline-converted\">IELTS Lite: Understanding IELTS exam is a LITE version of the Express IELTS Preparation course</strong>. If you sign up to this course occasionally you can get promotions to the main course with a great discount.  </p>\n\n\n\n\n\n<p>  \t    If you don't need to go through the whole course and just need some tips, welcome to this course. Also, if you don't want to go through the IELTS preparation and just want to understand what is IELTS, then again welcome to this course.  </p>\n\n\n\n\n\n<p>  \t    But if you need the whole set of preparations for IELTS with proper exercises, and score maximizer opportunities then please enroll with our main course the <strong class=\"redactor-inline-converted\">Express </strong><strong class=\"redactor-inline-converted\">IELTS Preparation course</strong> which is almost <strong class=\"redactor-inline-converted\">10 hours long</strong>.  </p>\n\n\n\n\n\n<p>  \t    --------------------------------------------------------------------------------------------------------------  </p>\n\n\n\n\n\n<p>  \t    The world says YES to IELTS! And...it's your time now to say YES to the WORLD!  </p>\n\n\n\n\n\n<p>  \t          According to British Council, <strong class=\"redactor-inline-converted\"><em>IELTS</em> is the only English language test accepted for immigration purposes by all countries that require one.</strong> The <em>IELTS</em>  test is designed to help you use English in your new life abroad. In  less than three hours, it will assess all of your English skills:  listening, reading, writing and speaking.  </p>\n\n\n\n\n\n<p><strong>  \t          IELTS is:</strong>  </p>\n\n\n\n\n\n<ul><li>The world’s most popular English language test for higher education  and global migration – with over 2 million tests taken last year</li><li>The most widely accepted English language test that uses a one-on-one speaking test to assess your English communication skills</li><li>Lately also, accepted by over 3000 higher education institutions in the U.S.  including the top 50 colleges and universities with the most  international students.</li></ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n<p>  \t          IELTS helps for immigration, job search, education abroad. Take your chance and get the overview of what is IELTS and some TOP TIPS shared by our tutor - Ms. Susan Jones.  </p>\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">See you on the other side!  </strong>  </p>", 
    "end_date": null, 
    "title": "IELTS Lite: Understanding IELTS Exam", 
    "price": 0, 
    "instructors": "IDEA Consultancy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317422_2404_3.jpg", 
    "course_url": "https://www.udemy.com/ielts-exam-top-tips/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-10T19:51:39Z"
}