{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p><em>+++++++++++++++++++</em><br></p><p><strong>Learn how to pass the IELTS exam and get the score you need!</strong><br><em></em></p><em>Did you take the IELTS exam but not get the score you want? </em><p><em>Do you need to improve your score in one section? All sections?<br></em></p><p>The IELTS exam opens up <strong>opportunities</strong> for you all over the world:</p><ul><li>Study at English-speaking university</li><li>Work and live in English-speaking countries</li><li>Work for company with English-speaking clients</li><li>Immigrate to Canada, UK, Australia, New Zealand, USA</li></ul><p><br></p><p>You can get the IELTS score you need and find the opportunities you want.</p><p>IELTS instructor Brian Gabriel will guide you through <strong>all four sections</strong> of the exam to make you feel confident to take it yourself. </p><p>In his video lectures, he will let you watch him as he answers exam questions. And he will even tell you why he is giving his answers in the ways he gives them. </p><p>After watching him answer questions, practice the strategies yourself with practice questions and resource websites.</p><p>Your IELTS scores will improve after you <strong>watch Brian</strong><strong> take the exam</strong> and practice his strategies on your own.</p><p><strong><strong></strong></strong>In this course, he demonstrates the skills you need to: </p><ul><li><strong>Write</strong> both the essay and the letter</li><li><strong>Speak</strong> with confidence doing the live speaking section </li><li><strong>Read</strong> with a purpose -- know what to look for in the reading to save time</li><li>Catch all the details in the <strong>Listening</strong> section</li></ul><p><strong></strong></p><p>Now, you can relax! In a few short hours, you will see Brian take the entire IELTS exam. And you can copy everything he does to improve your scores on the exam.</p><p><strong><em>Are you reading to improve your IELTS score?</em></strong> </p><p>Watch the videos of Brian taking the exam and get his personal answers to your questions about taking the IELTS exam!</p><p><strong><em>Udemy offers you a full \"never any questions asked\" 30 day money back guarantee. You can start today at NO RISK to you. </em></strong> <br></p><p>Your opportunities are waiting for you. Join the course NOW.<em></em><br><strong></strong></p>", 
    "end_date": null, 
    "title": "IELTS Exam: Watch Native English Speaker Take Exam", 
    "price": "30.00", 
    "instructors": "Brian Gabriel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694190_ecb2_2.jpg", 
    "course_url": "https://www.udemy.com/ielts-watch-exam/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T18:34:58Z"
}