{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p> La inserción de las TIC en la Educación ha favorecido el surgimiento de diversas modalidades educativas llevando el aprendizaje fuera del aula, una de éstas innovaciones es <strong>el m-learnig</strong> (aprendizaje móvil), el cual involucra el uso de dispositivos móviles en clase o fuera de ella, los estudiantes pueden intercambiar imágenes, archivos de audio, texto, video, acceder a la WEB para búsqueda de información, o aprovechar las redes sociales para hacer más dinámica, atractiva y colaborativa la clase. Lo anterior implica la profesionalización del docente en el aprendizaje móvil, como una respuesta a las necesidades de las generaciones que actualmente forma. </p><p>  El alumno en este curso aprenderá a utilizar las herramientas necesarias para lograr desarrollar habilidades tecno-pedagógicas para generar una innovación en la manera de aprender y enseñar, todo esto a través de la implementación del dispositivo móvil iPad en clases con el uso de las aplicaciones de iLife (Garage Band y iMovie), Idea Flip y Wunderlist.</p><p> El alumno aprenderá sobre el podcasting y los podcasts, así como las ventajas educativas de éstos y los pasos para realizarlos didácticamente además de ideas para el uso de los podcasts en clases. El alumno conocerá el entorno de Garage Band, realizando un recorrido por las herramientas de edición de audio para realizar podcast y la forma en las que se pueden compartir éstos. También aprenderá las ventajas educativas del video, así como sugerencias para el desarrollo didáctico del mismo y consideraciones para su uso en clase.  Conocerá el entorno de iMovie, realizando un recorrido por las herramientas para la edición de videos.  Aprenderá a realizar mapas conceptuales y mentales a través de Idea Flip una aplicación de productividad en clases. </p><p> Estas herramientas serán un apoyo que enriquecerán las experiencias de aprendizaje de hoy en día, permitiendo la habilidad de crear  podcast, videos, mapas mentales, listas de tareas y recordatorios. </p>", 
    "end_date": null, 
    "title": "iLife para iPad", 
    "price": "20.00", 
    "instructors": "UNID Universidad Interamericana para el Desarrollo", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534192_c3a0.jpg", 
    "course_url": "https://www.udemy.com/ilife-para-ipad/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-22T15:07:51Z"
}