{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Join the over 8,000  people who purchased the DVD that inspired this course!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">9 teachers share timeless wisdom.</strong></p>\n\n\n\n\n\n\n\n<ul><li><strong>Learn creative problem solving and decision making exercises, described by the experts that created them.</strong></li><li><strong>Real world advice from Ph.D.’s in the fields of education, research and business.</strong></li><li><strong>Make healthful and profitable life decisions.</strong></li><li><strong>Cultivate creativity and innovation</strong></li></ul>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"> Combining your intuition and logic is a powerful combination for making better decisions and innovating</strong>. By the end of this course <strong class=\"redactor-inline-converted\">you will make better decisions, that come easier.</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p> <strong class=\"redactor-inline-converted\">You will learn how to strengthen and use your intuition in business and<br> life</strong>. Many exercises for making decisions, improving intuition and cultivating creativity are <br>included. Included is a report titled \"How to Improve Your <br>Intuition and Make Better Decisions\" that has much of the information written for you.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In 1995 I learned about the “Intuition at Work” conference in Denver. Many of instructors there were Ph.D. ’s or had other impressive credentials. I was able to ask them to describe how they go about improving their intuition and using it to make decisions. I interviewed them and created a video from those interviews.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<strong class=\"redactor-inline-converted\">Awesome course! Really helping me to be decisive, believe and focus on my goal.” </strong><strong class=\"redactor-inline-converted\">–Ibrahima Bathily</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Topics covered include:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>How to improve your intuition</li><li>Intuition in Business</li><li>What does intuition feel like</li><li>How are intuitive messages received</li><li>Intuition use in decision making</li><li>Creative problem solving and decision making exercises</li><li>Learn the difference between impulse and intuition</li><li>Being intuitive for others</li><li>Intuition in career development</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>\"I have recommended all my students by this video!\"</strong><strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>-L.F. Polk S&amp;P Futures Day trader/Instructor</strong>\n\n\n\n\n\n</p>\n\n\n\n\n\n\n\n\n\n<p>If you're going through any kind of  life transition, this information would be valuable to you. Day traders  and business people have been using this video for years.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p> If you're interested in trying to hone your intuitive or psychic abilities this <br>course would be a good beginning for you as well.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The Viewers speak...\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"I’ve read numerous books on developing and using intuition and \nhave been looking for a good video on the subject for years. I’ve now \nfound it. I am very impressed with your intuition videotape, have \nwatched it several times, and will watch it many more times. Bravo for a\n great product at an incredibly low price. This has got to be the \nintuition-aficionado’s bargain of the year. </p>\n\n\n\n\n\n\n\n\n\n<p><strong>“I recommend it as one of the best programs available in the field.”</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>–</strong><strong class=\"redactor-inline-converted\">Dr. Jeffery Mishlove Ph.D.  Director, Intuition Network</strong></p><br><p>The teachers on this video:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Alan Vaughan Ph.D. – Alan stunned \nmany in the field of parapsychology in 1968 when he wrote an urgent \nletter from Germany warning of the impending assassination of Robert F. \nKennedy—just weeks before the actual event. He is an internationally \nknown authority on intuitive phenomenon, precognition and prophetic \ndreams. He has written numerous books and scientifically demonstrated \nsuch skills as solving crimes, finding sunken ships, remote viewing, \ntelepathy and precognition.ann mcgee cooper\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Ann McGee Cooper Ed.D – has been called a visionary and a catalyst \nfor the transformation of American business. She applies her \nunderstanding of the mind and its potential to countless companies, \ngovernment agencies, and non-profit organizations. While on the faculty \nat Purdue University, she participated in research with post-doctoral \nstudents in science and engineering to awaken their latent creativity. \nAnn was a pioneer at a time when it was generally believed that \ncreativity could not be taught. Ann proved that it could. She is the \nauthor of “You Don’t Have To Go Home From Work Exhausted”  and “Time \nManagement For Unmanageable People.” Ann is a well Known creative \nproblem solving specialist and business consultant.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Gary Markoff – Vice president of Smith Barney Inc. in Boston. Gary was \nnamed in Money Magazines 15th Anniversary issue as “One of the Top \nStockbrokers in America.”</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Nancy Rosanoff – is the author of “Intuition Workout” and has conducted numerous intuition training programs.\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Marcia Emery Ph.D. – has been teaching intuitive development for decades and is the author of “Dr. Emery’s Intuition Workbook.“\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Sharon Franquemont – is the author of “You Already Know What To Do” and has been the featured trainer in “Intuition Magazine.”\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Edith Jurka MD – is a board trained psychiatrist and creator of the \n“Wind Song Center” that helps already successful people add to their \ncapacities.\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Henry Reed Ph.D. – has published several research articles and \npopularized books on dreams and intuition. Henry is a well-known \nintuition trainer.\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Bill Taggart Ph.D. – is a professor of management at Florida <br>International University. Bill has created a variety of intuitive <br>assessment tools and training exercises.</p><p>7 Tips for Improving Your Intuition</p>\n\n\n\n\n\n<p>1. Learn to be an observer \nof people and situations. You need to detach yourself from your feelings\n in order to make effective decisions and predictions.</p>\n\n\n\n\n\n\n\n<p>2. Understand the difference between impulse and intuition. Intuition\n does not come usually with highly charged emotion. Ask yourself, is \nthis my fear, my hopes or is it really my gut instinct. Intuition \ntypically doesn’t carry a sense of desperate urgency like impulses do \nand will not fade.</p>\n\n\n\n\n\n\n\n\n\n<p>3. Meditation is important. Spend some quiet time alone. Paying \nattention to your breath is a great way to get in touch with your \nintuition.</p>\n\n\n\n\n\n\n\n\n\n<p>4. Keep a journal of your hunches and you will learn how often you are right.</p>\n\n\n\n\n\n\n\n\n\n<p>5. Have fun with it, taking things too seriously locks us into logic \nand blocks intuition. BEING ANGRY OR UPSET BLOCKS INTUITION! Take a page\n from, a book called, “The Very Rich Book”, interviews with very rich \npeople. They all say, I treat life like a game. You don’t take it so \nseriously.</p>\n\n\n\n\n\n\n\n\n\n<p>6. In the book “Think and Grow Rich” Napoleon Hill describes sitting \nin an imaginary board of directors environment. Who are your heroes and \nmentors?  Imagine posing your question, to each of your advisors. What \nwould their response be, from their point of view.</p>\n\n\n\n\n\n\n\n\n\n<p>7. Be patient. Learning to trust your intuition is a lifelong process.</p>\n\n\n\n\n\n<p>Feel free to message me if you have any questions. If you want the course but cannot afford it contact me.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I hope you enroll today.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Improving Your Intuition: Decision Making Made Easy", 
    "price": "20.00", 
    "instructors": "Ray Adler", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684418_2099_16.jpg", 
    "course_url": "https://www.udemy.com/intuitive-decision-making-for-business-investing-and-life/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T23:53:18Z"
}