{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Tired of depression specially winter depression ?? tired of the huge black hole of bad or even terrible overwhelming thoughts and painful emotions that hurt and make a huge burden on your heart ? make you always sad and need to hide?.</p><p>•Are you in constant fear that you are not worthy of happiness nor care? Blaming yourself A LOT ?.•Do you usually feel very tired and have troubles in sleep? </p><p>IMPROVE depression A LOT in just 10 days by just APPLYING  7 steps with Totally natural supplementary and diet twists .</p><p>this course will help you improving your depression A LOT and be more happy with less pain . you will SURE have marked improvement from the first week .with many clinically proved ways</p><p>at the end of the course you will know and use </p><p>-STOP the bad BLACK thoughts that fire depression</p><p>-Know and get rid of the real cause of depression.</p><p>-Renew your mind and change the PAINFUL EMOTIONS and terrible THOUGHTS.</p><p>-the AUGMENTED HAPPINESS: easy mental technique proved to give marvelous results .</p><p>-Know and apply a simple positive psychology way to increase your happiness in minutes.</p><p>-use CLINICALLY PROVED mental technique to ease depression painful emotions and black thoughts in minutes .</p><p>-USE the most important NEW PROVED tool that beat winter depression.</p><p>-USE the most potent NATURAL way proved to beat depression SUPERIOR to antidepressants.</p><p>-ENJOY using 3 dietary supplements proved to give prophylaxis and improve depression TOTALLY SAFE.</p><p>-BEWARE foods PROVED TO CAUSE depression.</p><p>In this course all you need to do is just APPLY simple and easy MINI STEPS just one step at a time which will give marked impact on increasing your happiness .</p><p><br></p>", 
    "end_date": null, 
    "title": "Improve Depression A LOT in 10 DAYS with LEAST steps.", 
    "price": "25.00", 
    "instructors": "Dr. Ehab Eldabeh Masoud", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634344_ec0f_2.jpg", 
    "course_url": "https://www.udemy.com/beat-depression-with-simple-changes-guranteed/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T03:08:01Z"
}