{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t    Join over 340+ Successful Students and<strong style=\"\"> </strong><strong style=\"\">Discover How I Went From 247 Emails a Day Clogging Up My Inbox to Nothing Left In My Inbox (aka Inbox Zero)...</strong>  </p>  <p style=\"\">  \t<strong style=\"\">...And I Did It Without Just Selecting All and Hitting Delete! </strong><em style=\"\">(I know you&#039;ve thought about it)</em>  </p>  <p style=\"\">  \t        How many emails are in your inbox right now? <em style=\"\">Too many?</em>  </p>  <p style=\"\">  \t        And I&#039;m guessing that a bunch of these are still unread from months ago (if not longer), <em style=\"\">right?</em>  </p>  <p style=\"\">  \t      If that&#039;s you... Take this course to discover the step-by-step strategies I used to take control of my inbox, reduce the stress and frustration of managing my emails, and increase my daily personal productivity.  </p>  <p style=\"\">  \t<strong style=\"\">For example, inside you&#039;ll learn...</strong>  </p>  <ul style=\"\">  \t<li style=\"\">4 ways to get your inbox to &quot;empty&quot; and <u style=\"\">keep it that way!</u></li>  \t<li style=\"\">5 techniques to speed up and simplify the way you use email</li>  \t<li style=\"\">The simplest filing system to use that ensures you always know where to find that IMPORTANT email. <em style=\"\">(no more time wasting hour long searches)</em></li>  \t<li style=\"\">and much more...</li>  </ul>  <p style=\"\">  \t<strong style=\"\"> ** YES! ... these strategies work with <u style=\"\">ALL</u> email client (eg. Gmail, Outlook, Mac Mail etc..) **</strong>  </p>  <p style=\"\">  \t          This course is perfect for you if you find yourself sitting in your email inbox all day every day (eg. business owners, office workers etc...) and waste countless hours consumed by responding and receiving emails rather than focusing on more productive or interesting tasks.  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Unchain Yourself From Your Email Inbox!!</strong>  </p>  <p style=\"\">  \t      This training has been simplified into 3 big foundational topics and broken down into actionable steps that work across all Email Software/Platforms... This is the perfect course to tame the email monster. <strong style=\"\">Click &quot;Take This Course&quot; to get started.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">MONEY BACK GUARANTEE:</strong> I give you my personal promise that this course will show you how to become the master of your email inbox. When you put these strategies and tactics into practice, you will have more time to spend on money making activities or spending time doing what you enjoy. If you don&#039;t agree that this training will get you those results then I don&#039;t want your money. Simply ask for all your money back 100% anytime in the first 30 days.  </p>", 
    "end_date": null, 
    "title": "Inbox Domination: How To Stop Wasting Time In Email", 
    "price": "50.00", 
    "instructors": "Carl Taylor", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/108598_5868_3.jpg", 
    "course_url": "https://www.udemy.com/inbox-domination-email-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-21T10:32:15Z"
}