{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  The Innovation Master Class is a comprehensive course that covers all of the topics you need to understand in order to build an enterprise innovation practice. The course covers everything from the current context of innovation in a climate of economic volatility and uncertainty, to the role of leadership and innovation metrics. It also includes in-depth case studies of  organizations that have achieved exceptional improvements in their  ability to innovate. The course goes far beyond the high level coverage of  most innovation courses to deliver detail on how other  organizations are achieving radical improvements in their innovation capability.  </p><ul style=\"\"><li><strong style=\"\">57 Video Segments</strong>!</li><li><strong style=\"\">4 hours of Instruction</strong> in short easy to digest nuggets!</li><li><strong style=\"\">Taught by one of the foremost experts on innovation</strong> who has taught innovation to more than 100,000 professionals, as well as graduate classes at Boston University, and Executive Education at Babson College and Harvard University.</li><li><strong style=\"\">Engaging video with a live instructor</strong> instead of drab and boring PowerPoint slides with voice overs!</li><li><strong style=\"\">4 assessment quizes</strong> to reinforce learnings</li><li><strong style=\"\">12 Exercises</strong> to apply learnings to your organization</li><li><strong style=\"\">Numerous real world case studies</strong> of companies who are great innovators. Includes Apple, Sony, GM, Boston Beer Company, Kodak, NASA, 3M, iRobot, and others.</li></ul>", 
    "end_date": null, 
    "title": "Innovation Master Class", 
    "price": "50.00", 
    "instructors": "Thomas M Koulopoulos", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404944_b3d1_3.jpg", 
    "course_url": "https://www.udemy.com/innovationmasterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T02:46:45Z"
}