{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Real Student Reviews:</p><p>\"Fantastic course, it covers all you need to know about moving web-sites both ways; and backing up a complete copy of the existing site. Very handy it things go pear shaped. I have my first web-site to up-grade and make responsive. My client want's to leave his old web-site up until the new one is ready. This means copying the site to my laptop (local-host), modifying it, testing it then uploading it. Anytime i've being stuck! Support from Andy and the other students has always solved any problems i've had. Would highly recommend all his courses they are straight to the point no waffle. \"</p><p>\"This class is extremely easy to follow. Andy's instructional pace was easy to follow. Wasn't as tough as I thought it might be based on my lack of experience. Success with the class motivates me to continue working on educating myself on web page design. Thanks!\"</p><p>\"My firsdt Udemy Course and my first Wordpress tutorial. It gave me a wonderful start. I did my first install of wordpress locally without any issues following this tutorial step by step. I can now do everything on wordpress without worrying about any monthly charges. Thanks Andy. \"</p><p>\"Andrew is a great instructor and I love his flexibility in providing solutions to his students problems. I was having problems applying some of the concepts to my MacBook but once I reached out to Andrew, he when back to the drawing board and provided clear instructions for us mac users. I have the pleasure of taking some of his others courses which has the same high level of content and support.\"</p><p>\"The usual high quality from Andy. If you want to test your website building skills, before committing to hosting and exposing to the world, then this is the way to do it. Clearly laid out and easy to follow. A great teacher.\"</p><p>\"Loved this course. Andy's lectures were thorough but I was never bored. In each lecture I was saying \"I didn't know I could do that without blowing up my computer\" (lol) or \"Oh, so that's how you do that!\" I took my time and enjoyed every minute of it. Thanks, Andy!\"</p><p>Have you ever wanted to learn Wordpress but didn't want the expense of setting up and maintaining web hosting?  Then this course is for you.  This course will show you how you can install Wordpress on your own computer, install plugins and themes and set up a website without web hosting or any other expenses.  The software and tools we will use are 100% free.</p><p>We'll start off by looking at the main reasons why someone might like to install Wordpress locally on their own computer.  You will then learn how to do this for yourself, even if you don't think you are technically minded.</p><p>This course will show you:</p><ol><li>All of the tools that you will need.  These are all 100% free.</li><li>How to download and install a local server environment so Wordpress can work.</li><li>How to create a database for your Wordpress site.</li><li>How to download and install Wordpress into the local environment.</li><li>How to login to your Dashboard, and the main reason it does not work in the local environment.</li><li>How to close down Wordpress and your local server correctly.</li><li>Installing themes and plugins, and how to increase the default 2MB upload limit.</li></ol>In short, this course will teach you how to install Wordpress on your PC or Mac computer, no experience required.  Whether you simply want to learn Wordpress without the expense of paying for a web host, or you are a developer wanting to test a plugin or theme, this course will guide you step-by-step through the local installation.", 
    "end_date": null, 
    "title": "Install Wordpress Locally - No Monthly Web Hosting Costs", 
    "price": "20.00", 
    "instructors": "Andrew Williams", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582816_efa9.jpg", 
    "course_url": "https://www.udemy.com/install-wordpress-locally/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T07:58:47Z"
}