{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is an introductory level course that will teach basic insurance principles and provide basic foundation level information on health insurance terminology and plan types.</p>    <p>The target audience for this course is anyone who:</p>  <ul><li>Is confused by health insurance terminology and plan types.</li><li>Has health insurance but does not understand how it works. </li><li>Knows they need insurance of any kind but doesn’t understand the purpose or benefit to having it. </li><li>Wants to get more out of their health insurance plan.</li><li>Wants to be more informed before the next time they enroll in a health insurance plan.</li></ul>            <p>The target audience described above should take this course to: </p>  <ul><li>Get their questions answered.</li><li>Understand insurance terminology.</li><li>Gain clarity and confidence in the subject matter of insurance.</li><li>Make the most informed decision possible before their next open enrollment period.</li></ul><p>Terminology this course should be found under would include: insurance, insurance principles, basics of insurance, basics of health insurance, health insurance, healthcare insurance, health insurance plans, and health insurance plan types.</p><ul><li>There are no additional materials attached to this course content at this time.</li><li>The course should take about 40minutes to complete.</li><li>The course is structured sequentially by lecture number with audio explanations of slide content.</li><li>This course would not likely be of interest (no new learning expected) for anyone who works in the insurance or healthcare industry.</li><li>This course does not address funding for healthcare expenses (i.e. Health Reimbursement Accounts or Health Savings Accounts); I can cover that in another course if there is interest.</li></ul>", 
    "end_date": null, 
    "title": "Insurance Principles and Basics of Health Insurance", 
    "price": "20.00", 
    "instructors": "Pamela Bonin", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640880_1743_2.jpg", 
    "course_url": "https://www.udemy.com/insurance-principles-and-basics-of-health-insurance/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T23:48:05Z"
}