{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\"><strong style=\"\">COURSE DESCRIPTION </strong><br style=\"\">Most major software application companies are moving away from only offering locally installed versions of their products. Microsoft is doing the same with the release of Office 365, the cloud based version of the Office suite of products. This course focuses on unique aspects of these applications in this format and not on the basic mechanics of each application. It is designed for individuals already comfortable with Office products but need to better understand how Office 365 is different and how to use the new features available in this version. <br style=\"\"><br style=\"\">In particular, this course will emphasize the OneDrive, collaborating with other users online, working with Lync for messaging and online meetings, and accessing Office 365 off mobile devices as well as a traditional computer.<br style=\"\"><br style=\"\"><strong style=\"\">Learn and Master the Features in Office 365</strong><br style=\"\"></p><ul style=\"\"><li style=\"\">Sign in to Office 365 and understand the user interface</li><li style=\"\">Install and manage the apps on your mobile devices</li><li style=\"\">Use the Outlook web app for managing email, tasks, contacts, and your calendar</li><li style=\"\">Understand how to save files to your OneDrive</li><li style=\"\">Learn to collaborate in Office 365 using shared documents on the Team Site and with SharePoint</li><li style=\"\">Work with Lync to instant message and conduct online meetings<br style=\"\"></li></ul><p style=\"\"><strong style=\"\">Mastering the Changes </strong><br style=\"\">Office 365 is a new breed of software – applications designed for connection and collaboration that will be continuously updated by Microsoft. This course takes the approach of showing you how and why this version of Office is different from previous locally installed versions and will prepare you for the future of cloud computing.<br style=\"\"><br style=\"\"><strong style=\"\">Contents and Overview </strong><br style=\"\">In 90 minutes of content, including 11 lectures, this course covers all the key features you need to know to get started with Office 365.<br style=\"\"><br style=\"\">This course broken into sections based on major sections of Office 365: Getting Started, Outlook Web App, Collaboration, and Lync.<br style=\"\"><br style=\"\">Upon completion you will be comfortable logging into Office 365, managing Outlook in the cloud, connecting with other users via Lync, and collaborating in the Cloud with OneDrive and SharePoint.</p>", 
    "end_date": null, 
    "title": "Introduction to Office 365", 
    "price": "30.00", 
    "instructors": "CompuWorks Trainers", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447312_cc28_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-office-365/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T15:57:54Z"
}