{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>The Introduction to ERP Systems course is designed to give a overview of the process of implementing ERP systems. It is generally a practical course, derived from real life experience with many projects in various countries and industries.</p><p>Learn about ERP systems, how they work and how to implement them with this comprehensive course, that covers a variety of key topics, including:</p><ul style=\"\"><li style=\"\"> What business software is available today, what is ERP </li><li style=\"\"> Characteristics of ERP systems</li><li style=\"\"> The good, the bad and the ugly side of implementing ERP systems</li><li style=\"\"> Types of ERP solutions available today</li><li style=\"\"> Costs of the project and budgeting for your ERP system</li><li style=\"\"> Implementation phases and timeline</li><li style=\"\"> Business model of the ERP systems</li><li style=\"\"> IT infrastructure, on-premise and cloud solutions</li><li style=\"\"> Integration with other solutions</li><li style=\"\"> ERP project lifecycle</li><li style=\"\"> Disaster recovery and business continuity</li></ul><p>At the end of the course, you will have a clear idea about what ERP systems are, how they are implemented, what the risks and opportunities are and how the implementation should be planned. The course contains much behind the curtain insight, which you can use to select your system better, plan your project more successfully, lower your project cost and achieve better results from the ERP system. For example you will learn that the mid-level ERP systems today are more powerful than ever, turning them into a sweet spot for most projects at the moment. You will also learn that you should start your ERP project with the minimum viable license possible, something that will save you substantial costs in support fees.</p><p>The course is designed to be easily understood and followed. You will need some basic knowledge about business and IT concepts, however beyond that the lectures give you comprehensive information about each of the topics covered. That is why the course will be interesting both for beginners in the field and for seasoned users, who need knowledge in specific areas.</p>", 
    "end_date": null, 
    "title": "Introduction to ERP Systems", 
    "price": 0, 
    "instructors": "Stefan Markov", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320840_aa25_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-erp-systems/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T12:16:23Z"
}