{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">I ran a workshop called &quot;Intro To JavaScript&quot;. In that work-shop we used visually interactive programming to build a pong game. The really fascinating part was the crowd that showed up to learn, from scratch, how to program. I had lawyers, marketers, business owners and managers who worked with programmers. They all wanted to unravel the mystery of programmers, by becoming one for a day. By signing up today, you get the same fun experience they did at the pace that interests you. This is a short course that allows you to become a programmer for a day, or it can act as the start of your programming journey.</p><p style=\"\"><strong style=\"\">CLASS DETAILS</strong></p><p style=\"\">Javascript is the world&#039;s most ubiquitous programming language. It is used in every single browser ( Internet Explorer, Firefox, etc.) and powers Gmail, Facebook, Chrome Apps and so many other technologies. The future is not JavaScripts alone, but it will remain a key player in programming for the foreseeable future.</p><p style=\"\"><strong style=\"\">What You&#039;ll Learn</strong></p><ul style=\"\"><li style=\"\">How to use Khan Academys interactive programming interface</li><li style=\"\">What different programming &quot;things&quot; mean, like functions and variables</li><li style=\"\">How to create a game using code</li><li style=\"\">How to share your game with class mates and friends</li></ul><p style=\"\"><strong style=\"\">What You&#039;ll Do</strong></p><p style=\"\">With the help of Khan Acadamy, I guide you through 4 (or 6 if you take on the optional ones) stages of program development. Our end goal is a fully functional pong-like game.</p><p style=\"\"><strong style=\"\">What You Get</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">Step-By-Step PDF Guide</strong>152 slides in PDF containing all the course content, downloadable and yours to keep forever</li><li style=\"\"><strong style=\"\">Video Tutorials</strong>Over one hour of video tutorials that follow the same curriculum</li><li style=\"\"><strong style=\"\">Classmate and Instructor Interaction</strong>A gallery to show case your program on the web, discussion forums and more.</li><li style=\"\"><strong style=\"\">Lifetime Access</strong>Lifetime access to the course including upgrades &amp; improvements to content.</li></ul><p style=\"\"><strong style=\"\">ENROLL NOW!</strong></p><p style=\"\">This class was developed by Alex Pineda</p><p style=\"\">I want to make sure to thank Kevin Browne of Software Hamilton for inviting me to deliver a workshop back in January of 2013. Without you and your community powering, this class would never have come to fruition. At some point I thought to myself, we hit an interesting market, people are having fun, so why not deliver this in an online format? Well here it is!</p><p style=\"\">Another quick shout out to AJ Bovaird of Murdock Solutions. He was one of the volunteers at the workshop and he was at my mother&#039;s side (yes she came to my workshop!) the whole time. She had just recently come from some carpal tunnel surgery and was still able to participate. Thanks AJ!</p>", 
    "end_date": null, 
    "title": "Intro To JavaScript: For Marketing and Business Types", 
    "price": "45.00", 
    "instructors": "Alex Pineda", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/127100_2fab_2.jpg", 
    "course_url": "https://www.udemy.com/programming-for-marketing-and-business-types/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-30T01:57:36Z"
}