{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t       The Introduction to Analytics course is a set of 12 videos that take you through the basics of data analytics and the language of SAS.  </p>  <p style=\"\">  \t   You should do this course if you are interested in data analytics and would like to pursue it as a career or if you have heard about the buzz it is creating and just want to know what it is all about.  </p>  <p style=\"\">  \t    Each video is from 5 to 30 minutes in length. If done in one go, it should take you about two hours to cover the course.  </p>  <p style=\"\">  \t  The course is divided into three sections. The first section &#039;Introduction to Analytics&#039; is a set of 6 videos. Here is a snapshot of the 6 videos:  </p>  <p style=\"\">  \t       1. What is analytics?  </p>  <p style=\"\">  \t    This module explains the basis of analytics.  </p>  <p style=\"\">  \t       2. Why is analytics popular?  </p>  <p style=\"\">  \t    This module talks about why analytics has become a big buzzword in business circles and the advantages of analytics.  </p>  <p style=\"\">  \t       3. Analytics applications  </p>  <p style=\"\">  \t    Here you will be introduced to the various analytics applications popularly used today.  </p>  <p style=\"\">  \t       4. Analytics technology  </p>  <p style=\"\">  \t    In this module you will learn about trending analytics technologies.  </p>  <p style=\"\">  \t       5. Analytics terminology  </p>  <p style=\"\">  \t   Here we give you a run through of the important analytics terminology that you must know.  </p>  <p style=\"\">  \t       6. Analytics resources  </p>  <p style=\"\">  \t   This lecture talks about the various analytics resources available today that will help you further your quest for analytics knowledge.  </p>  <p style=\"\">  \t The second section of the course &#039;Analytic Tools&#039; is a set of 3 videos. Here is a snapshot of the 3 videos:  </p>  <p style=\"\">  \t 7. Overview of Popular Analytic Tools-1  </p>  <p style=\"\">  \t This lecture takes you through the popular analytics tools like SAS and WNS available in the market.  </p>  <p style=\"\">  \t 8.  Overview of Popular Analytic Tools- 2  </p>  <p style=\"\">  \t In this lecture we discuss other popular tools like those from IBM.  </p>  <p style=\"\">  \t 9.  Comparison of Analytic Tools  </p>  <p style=\"\">  \t Here we see how to compare the popular analytic tools.  </p>  <p style=\"\">  \t In the last section &#039;Introduction to the Language of SAS&#039; we have 3 videos that introduce you to the language of SAS and give you an understanding of how SAS can be used to derive sound business insights.  Here is a snapshot of the 3 videos:  </p>  <p style=\"\">  \t  10. Intro to the Language of SAS- 1  </p>  <p style=\"\">  \t In this lecture we explain the basic concepts in the language of SAS and how data can be manipulated in the language of  SAS.  </p>  <p style=\"\">  \t 11. Intro to the language of SAS- 2  </p>  <p style=\"\">  \t Here we go on to explain how data can be brought into SAS in a format that is recognized by SAS.  </p>  <p style=\"\">  \t 12. Intro to the language of SAS- 3  </p>  <p style=\"\">  \t In this last lecture we explain more about data inputs into SAS.  </p>", 
    "end_date": null, 
    "title": "Introduction to Analytics and the Language of SAS", 
    "price": 0, 
    "instructors": "Jigsaw Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94392_4a51_9.jpg", 
    "course_url": "https://www.udemy.com/jigsaw-academy-introduction-to-analytics/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T06:05:40Z"
}