{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Today's data center and cloud environments have converged infrastructures and management tools, and with the advent of virtualization technologies like VMware and Microsoft Hyper-V, external SAN and NAS storage is becoming a standard. It's no longer possible to get by as an IT professional by knowing only servers, networking or storage, you need an understanding of all three for your career to thrive.</p>\n\n<p>This course will give you the knowledge you need to understand SAN and NAS storage. You'll learn the theory of the CIFS (SMB), NFS, Fibre Channel, iSCSI and FCoE protocols, and see how to configure the storage system and connect from the client with hands-on lab demonstrations.</p>\n\n\n\n<p>The lessons are vendor agnostic so they're suitable no matter who the manufacturer of your storage system is. I've used NetApp as the storage system in the live demos but the information is relevant to all vendors.</p>\n\n<p>A verifiable course certificate stating you have completed this training will be provided at the end of the course. This will prove to potential future employers that you have the basic storage knowledge necessary to be an effective member of their IT team, and the motivation  to complete further training and be a real asset to their company.<br></p>\n\n\n\n\n\n\n\n\n\n<p>As a student in this course, you will get an answer to every question you ask in the Ask Question section. I love interaction with my students- anything you want to know, please ask.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Thank you for taking the time to read about the course. I hope you now have enough motivation to get into the learning right away. If so, click the blue button at the top of the page to enroll and get started!</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Introduction to SAN and NAS Storage", 
    "price": 0, 
    "instructors": "Neil Anderson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814366_abc0_3.jpg", 
    "course_url": "https://www.udemy.com/storageintro/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T11:54:43Z"
}