{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  Atlast, Simple Video instructions for iPad …  </p>  <p>  </p>  <h4>Are You Ready To<br style=\"\">    Get The Most Out Of Your iPad ?<br style=\"\">    Quickly and Effortlessly …</h4>  <p style=\"\">  \tDear iPad user, I value your time, so let me get straight to the point.  </p>  <p style=\"\">  \tLet me show you a super quick, effortless way to learn how to do EVERYTHING you want to do with your iPad.  </p>  <p style=\"\">  \t<span style=\"\">Better than books or manuals… better than live classes, and better than anything else you might have seen online. But first, why do you even need any training?</span>  </p>  <h4 style=\"\">Missing iPad Manual ? It’s Not Your Fault</h4>  <p style=\"\">  \tYou bought an iPad or got a present of one right? But why didn’t it come with instructions ?  </p>  <ul style=\"\">  \t<li style=\"\">Because your iPad is highly intuitive. But there’s still the unavoidable learning curve of learning something new. So  choosing to just “wing it” is not a good option.</li>  \t<li style=\"\">Well the truth is folks at Apple want you to figure it out yourself but you and I both know…that’s easier said than done right? I know how frustrating it can be.</li>  </ul>  <p style=\"\">  \tAdmit to yourself that you’ve already struggled a bit figuring out some stuff on your iPad. I have come across and helped hundreds of frustrated and confused iPad users in my previous job as an Apple workshop instructor.  </p>  <p style=\"\">  \t<span style=\"\">Now, I can save you all that time by quickly and visually showing you how to do EVERYTHING you want to do with your iPad.</span>  </p>  <h4 style=\"\">Introducing IPAD For Seniors</h4>  <p style=\"\">  \t<span style=\"\"></span><span style=\"\">IPAD For Seniors is a series of iPad video lessons showing you everything from the very basics to advanced skills you need to use your iPad with ease-</span><em style=\"\">without a manual</em><span style=\"\">.</span>  </p>  <p style=\"\">  \tYou can now watch these videos to learn how to use the iPad and specifically some of the useful features of the iPad which you will be using every single day.  </p>  <p style=\"\">  \tYou are watching over my shoulder every step of the way. Even better than my live presentations, because  </p>  <ul style=\"\">  \t<li style=\"\">you don’t need to leave home</li>  \t<li style=\"\">you can access them any time 24/7</li>  \t<li style=\"\">you can go at  your own pace…and rewind sections that need review</li>  \t<li style=\"\">You can watch the videos on your PC while you follow along with your iPad or watch and learn right on your iPad</li>  </ul>  <p style=\"\">  \tPlus you’ll discover secret hidden tips that most iPad users never find out about. Or if they do it’s after days of trial and error.  </p>  <p style=\"\">  \tAt the end of your complete iPad for seniors video course, you’ll be more productive, and have more fun with your iPad. You’ll find these lessons are a tremendous return on investment that save you hours and hours of frustrating guesswork.  </p>  <p style=\"\">  \t<span style=\"\"></span><span style=\"\">I will personally respond to any questions you may have as you go through the material so there&#039;s no worry if you&#039;re not sure how to take all of the information. So sign up now!</span>  </p>  <p style=\"\">  \t<span style=\"\">Talk Soon</span>  </p>  <p style=\"\">  \t<span style=\"\">Mike Jeffries</span>  </p>", 
    "end_date": null, 
    "title": "iPad For Seniors (iPad, iPad Air, iPad Mini)", 
    "price": "30.00", 
    "instructors": "Mike Jeffries", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420988_31bd_4.jpg", 
    "course_url": "https://www.udemy.com/ipad-guide-for-seniors/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T11:20:14Z"
}