{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>\n\n</p>\n\n<p>     Are\nyou looking to enter and pursue a career in the IT Help Desk industry?  Are you searching for a resource that can\nassist you with learning the basics of what IT Help Desk technicians should\nknow?  Or are you someone who wants to enhance\nyour knowledge about IT Help Desk responsibilities?  If you have answered yes to any one of these\nquestions, then this course, <strong class=\"redactor-inline-converted\">IT HELP DESK FOR BEGINNERS</strong>, is for you.<br></p>\n\n\n\n<p>     In\nthis course we’ll guide you through the technical fundamentals of the IT Help\nDesk’s role.  We’ll inform you about\nvarious areas of technical support and even walk you through some foundational\nprocesses on resolving issues.</p>\n\n\n\n<p>\n\n</p>\n\n\n\n<p>     There’s\nno need to worry about terminology because we’ll help you with definitions along\nthe way.  We’ll even have a few mini\nassessments to help provide learning milestones for you throughout this course.</p>\n\n\n\n<p>\n\n</p>\n\n\n\n<p>     Our\nprogram of instruction is structured in an easy-to-follow way, where we’ll\ncover several topics such as customer experience, software installation and\nremoval, basic networking, joining computers to a domain, and troubleshooting.</p>\n\n\n\n<p>\n\n</p>\n\n\n\n<p>     The\nIT industry is growing and the number of IT professionals continues to rise.  If you’re eager to venture into the field of\ntechnical support and looking to join this growing profession, or if you’re\nseeking to strengthen your technical savvy and want to improve your technical\nskills set, then our course, <strong class=\"redactor-inline-converted\">IT HELP DESK FOR BEGINNERS</strong>, is the solution for\nyou.  So, join us in this valuable\ncourse, <strong>IT HELP DESK FOR BEGINNERS</strong>, and we’ll see you on the inside.</p>\n\n\n\n<p>\n\n</p>", 
    "end_date": null, 
    "title": "IT Help Desk for Beginners", 
    "price": "20.00", 
    "instructors": "Jason Ruediger, Mariecor Agravante", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791810_71c5_3.jpg", 
    "course_url": "https://www.udemy.com/it-help-desk-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T23:25:03Z"
}