{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>NEW Udemy course (9-2-2016)</strong> Welcome to <strong>Java Spring MVC Framework 4x with Spring Data JPA and Hibernate (Java Based Configuration)</strong> course.</p>\n\n<p><strong>***Live Coding and the samples are coded from scratch***<br>***Your questions will be answered within 24 hours***<br></strong><strong></strong></p>\n\n<p>This course will teach you how to configure <strong>Java Spring MVC Enterprise</strong> applications using <strong>full Java Based</strong> Configuration.(<strong>No XML configuration </strong>is required (even no web xml)). <strong>Beans, services, repositories, controllers and views</strong> will be defined and configured using Java language throughout this <strong>udemy </strong>course.</p>\n\n<p>Furthermore, the course will also show you how to configure Java Spring MVC web applications using web xml and Java Configuration.</p>\n\n<p>The benefits of attending this udemy course;<br></p>\n\n<ul><li>Learn and understand Java Spring MVC with <strong>Live Coding Examples from scratch</strong></li><li>You will learn how to configure and test <strong>the latest version of</strong> Java Spring MVC using only Java language<strong> even without web xml file</strong>.</li><li>You will understand the main principles and concepts of Java Spring MVC Framework with Java Based configuration and be ready to develop <strong>Java Enterprise </strong><strong>Spring MVC</strong> applications.</li><li>You will<strong> earn a high salary</strong> based on the knowledge provided within this course including <strong>Spring MVC Concepts, Spring Security, Spring Data JPA, Hibernate, Logging and Unit Testing.<br><br></strong></li></ul>\n\n<p>The content of Java Spring MVC with Java Based Configuration course;</p>\n\n<ul><li>Installing <strong>Spring Tool Suite IDE</strong> with MySQL Database Community Edition and <strong>Java </strong><strong>JDK 8.0</strong></li><li>Learn how to use <strong>integrated Maven</strong> in Spring Tool Suite and define dependencies using <strong>pom xml</strong></li><li>Learn how to create <strong>Java Enterprise Web Projects</strong> with Maven and STS</li><li>Learn how to debug, run and test Java Spring applications</li><li>Learn how to configure Java Spring MVC by using <strong>WebApplicationInitializer </strong>interface</li><li>Understand how to register configuration classes using <strong>AnnotationConfigWebApplicationContext</strong></li><li>Learn how to define <strong>DelegatingFilterProxy</strong> in order to active Spring Security Module</li><li>Understand how to define configuration classes with <strong>WebMvcConfigurerAdapter</strong></li><li>Understand the usage of <strong>@EnableWebMvc</strong> and <strong>@Configuration</strong> annotations in Java Spring MVC</li><li>Define and map views to custom pages using <strong>InternalResourceViewResolver</strong></li><li>How to use <strong>@Autowired, @ComponentScan, @Controller, @Service and @Bean</strong> annotations</li><li>Learn how to configure Java Spring MVC using <strong>AbstractAnnotationConfigDispatcherServletInitializer</strong></li><li>Learn how to configure <strong>LocaleChangeInterceptor, MessageSource and CookieLocaleResolver</strong></li><li>How to configure Java Spring MVC with <strong>web </strong><strong>xml</strong> and Java Config</li><li>Learn how to get properties inside property files using <strong>@PropertySource</strong> and <strong>PropertySourcesPlaceholderConfigurer</strong></li><li>How to define data sources with Java Spring MVC including <strong>EmbeddedDatabase</strong></li><li>Learn the configuration of <strong>EmbeddedDatabaseBuilder </strong>with scripts</li><li>How to use <strong>DatabasePopulatorUtils </strong>in order to run initial SQL files (Both (data definition language)DDL and (data manipluation language)DML SQLs)</li><li>Learn how to configure <strong>Repositories </strong>using <strong>Spring Data JPA API and Hibernate ORM</strong></li><li>Understand the usage of <strong>@EnableJpaRepositories</strong> and <strong>CrudRepository</strong></li><li>How to define map HTTP requests using<strong> @RequestMapping @RequestParam, @PathVariable and @ResponseBody</strong></li><li>How to unit test Spring MVC Services using <strong>@RunWith(SpringJUnit4ClassRunner class) </strong></li><li>Learn how to enable Unit Testing with JUnit for Java Based Configuration using <strong>@WebAppConfiguration and @ContextConfiguration</strong></li><li>Learn how to use and configure Spring Security Module with <strong>WebSecurityConfigurerAdapter</strong></li><li>Learn how to define users and roles with <strong>inMemoryAuthentication </strong>in Spring MVC Framework</li><li>Learn how to enable Spring Security Configuration module with <strong>@EnableWebSecurity</strong></li><li>Understand the usage of HTTP paths and Intercept URLs with <strong>antMatchers</strong></li><li>Understand how to define <strong>Basic Authentication</strong> in order to access web pages</li><li>Learn how to configure default login form with Spring Security Module</li><li>Learn how to define the <strong>springSecurityFilterChain </strong>filter</li><li>Learn how to access user details using <strong>Principal </strong>object in Controllers</li><li>How to use Spring Security tags such as<strong> &lt;security:authorize/&gt; and &lt;security:authentication/</strong>&gt; on view layers</li><li>Learn how to configure logging using <strong>SLF4J &amp; LogBack</strong></li><li>Learn how to create a Simple Core Java Spring project using Maven<strong><br><br></strong><strong>HD quality (full screen) recorded course content and you will be able to see the source code clearly (HD format).<br><br>Please feel free to ask me questions regarding the lectures if you attend this udemy course. I will try to answer your questions as soon as possible.</strong></li></ul>", 
    "end_date": null, 
    "title": "Java Spring Framework 4 with Spring Data JPA and Hibernate", 
    "price": "20.00", 
    "instructors": "Tuna Tore", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702410_cad4_34.jpg", 
    "course_url": "https://www.udemy.com/java-spring-mvc-framework-with-java-based-configuration/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T22:29:47Z"
}