{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong style=\"\"></strong><strong style=\"\">Overview</strong></p><p>JQuery is a popular JavaScript library that is used extensively in modern websites. This library facilitates common JavaScript tasks such as animations, event handling, manipulating HTML content, and communication with external servers. In addition to its easy-to-use features, JQuery also takes care of many cross-browser compatibility issues automatically.</p><p><strong style=\"\">Prerequisites</strong> </p><p>HTML:<strong style=\"\"> </strong>The student must know how to use HTML tags and attributes. Only a very basic understanding of HTML is assumed.</p><p>JavaScript: Since JQuery is a JavaScript library, the student must know how to write JavaScript. JQuery makes extensive use of functions and objects, so the student must be familiar with these concepts.</p><p>Notepad++ (Recommended): Notepad++ is a free, open-source text editor. Although JavaScript and HTML can be written using any text editor, Notepad++ is highly recommended because of features such as syntax highlighting and auto-complete.</p><p>JavaScript-enabled browser: In order to run JavaScript, the student must have a</p><p>ccess to a JavaScript-enabled browser. Although Google Chrome is used throughout the tutorial, any modern web browser will work as long as JavaScript has not been disabled by an administrator.</p><p><strong style=\"\">What you will learn</strong> </p><p>We will begin the course by learning about selectors. Selectors are strings that are used to target specific HTML elements on the page. The selector syntax is highly intuitive and easy to read and understand.</p><p>We will then move on to events. The student will learn how to write code that reacts to things like mouse clicks, key presses, when the page is done loading, and a few others. These events allow programmers to create interactive user interfaces.</p><p>After that, we will move on to effects and animations. Effects are used to hide and show elements. An example would be a menu that slides open when the mouse hovers over it. JQuery has a few built-in effects that can be implemented with minimal coding. For further customization, we will look at animations, which allow programmers to animate most of the visual properties of HTML elements.</p><p>Then we will learn about changing the HTML content of a webpage. This includes adding and removing entire HTML elements, as well as modifying text and other HTML attributes programmatically. We will also learn about how to navigate the tree-like structure of an HTML document using the concept of parent-, sibling-, and child-elements.</p><p>Finally, we will end the course by looking at AJAX, which stands for Asynchronous JavaScript and XML. AJAX allows programmers to interact with external servers. To serve as our example, we will read airport data from a public web service. We will learn how to request data, how to handle the response, and how to handle errors. </p>", 
    "end_date": null, 
    "title": "jQuery for Absolute Beginners", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528412_e242.jpg", 
    "course_url": "https://www.udemy.com/jquery-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T08:37:29Z"
}