{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Save at least $100 a month by discovering this unlimited source of free and discounted Kindle books. Whether your passion is romance, mystery, science fiction, horror, nonfiction, business, biographies or technology, you'll find the best special deals from bestselling authors.</p><p>Discover the Kindle's best-kept secret: free bestsellers from your local public library, without leaving your home. This course isn't a list of books, it's a source of daily, hand-picked deals, a gold mine of fiction and nonfiction treasures.</p><p>If you're a book lover, this course will help you unlock the value of your Kindle device. Instead of being steered toward high-priced books priced at $14.99 and up, you'll have a multitude of choices for $1.99, $0.99 and even free!</p><p>You don't need to be a computer geek to take advantage of this literary opportunity of a lifetime. In fact, you don't even need a Kindle device. All you need is a computer, phone, or tablet, and follow along with our step-by-step tour.</p><p>Spend 45 minutes with this course, and you'll uncover a lifetime of entertainment and educational opportunities.</p><p>You and your family will never need to shell out money at the bookstore, or stand in line at the library again. No matter what kind of books you enjoy, you will benefit from this course immensely. This unending source of literary treasures will revolutionize your life in terms of education and entertainment. </p><p>Don't waste another minute. Start enriching your life now, without and hassles of high-priced content.</p><p>No matter your reading level, you will sharpen your mind and improve your professional and personal life by taking advantage now.</p>", 
    "end_date": null, 
    "title": "Kindle Buffet - Get unlimited Free and Discount Kindle books", 
    "price": "40.00", 
    "instructors": "Steve Weber", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633756_576d_3.jpg", 
    "course_url": "https://www.udemy.com/kindle-buffet-quickly-find-and-download-free-kindle-books/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T16:42:32Z"
}