{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course, Kiswahili for Safari, targets tourists and business travelers planning to travel to Kenya and Tanzania - the two East Africa countries (and the only ones in the world!) that have Kiswahili as an official language. It offers basic practical skills that would give you the proficiency required to engage in light banter and thrilling interactions throughout your stay here. What's more, with the skills gained from this course, you will learn a lot more and broaden your vocabulary as you practice and speak more, boldly, with friendly locals and tour guides who would be eager to teach you more. </p><p>The terminologies used are basic everyday ones, whose pronunciation should not be difficult as Kiswahili is a language that is quite easy on the tongue.  With a exceptions here and there, most words are pronounced just as they are written. Easy, right? </p><p>Please grab a pen and paper as we go through this half hour course together. I have structured it to include the following slides;</p><p>1. Introduction</p><p>2. Greetings</p><p>3. Language Exercise </p><p>4. Numbers</p><p>5. Courtesies </p><p>Without this course, you would still have a memorable time as East Africa is one of the most beautiful places in the world, with friendly people, great weather and breathtaking landscape. But if you gain and apply the skills i'm teaching here, what a rich, heart-warming experience this would be for you and/or your loved ones!</p><p>NB: While at it, watch this space...more Kiswahili courses coming!<br></p><p>Ahsante sana (thank you very much) and Karibu (welcome) to Kenya and Tanzania. <br></p>", 
    "end_date": null, 
    "title": "Kiswahili for Safari", 
    "price": "20.00", 
    "instructors": "Stephen Lumumba", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578170_d9c7_4.jpg", 
    "course_url": "https://www.udemy.com/kiswahili-for-safari/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T16:24:20Z"
}