{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Lean Six Sigma Training is culmination of Lean &amp; Six Sigma. Lean on one side comes down heavily on reducing waste &amp; Six Sigma on other hand is heavy on reducing variation in the process. Training will be driven on Mini-tab and practical exposure is assured with a classroom project. The concepts of these methodologies complement each other and produce synergistic impact in achieving profound results. The results are so outstanding that it increases both the bottom-line (profits) and the top-line (increase in business). Course is explained using DMAIC methodology with a lot of real world case studies. Most of the case studies are solved using Minitab, which is amazing statistical GUI tool. Participants also get to work on a practice project towards the end to ensure that their learnings are put to practice in an end-to-end project. Quizzes at the end of each topic will set a way to recollect the topics discussed to increase the retention of topics learnt. </p>\n\n<p>Data analysts, Quality professionals, Project managers, Quality assurance &amp; control professionals, Six Sigma Practitioners, Fresh graduates who wants to establish themselves in the space of Lean Six Sigma are all eligible for undergoing this course. Leadership which has used Lean Six Sigma methodology has often achieved the uncommon by exponentially increasing the profits by keeping the operating costs the lowest and maintaining the highest quality. Lean Six Sigma Green and Black belt certification is driven using DMAIC (Define, Measure, Analyze, Improve, Control) methodology whereas Master Black belt certification is delivered majorly on DMADV (Define, Measure, Analyze, Design, Validate) methodology. DMADV is also called DFSS (Design for Six Sigma).</p>", 
    "end_date": null, 
    "title": "Lean Six Sigma Green Belt with Minitab Made Easy", 
    "price": "20.00", 
    "instructors": "ExcelR Solutions", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766450_6ba2.jpg", 
    "course_url": "https://www.udemy.com/lean-six-sigma-green-belt-made-easy-with-minitab/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T11:38:01Z"
}