{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t                                                              Hello welcome to this course on <strong>“</strong><strong>Learn How to Host Free Unlimited Static Websites</strong><strong>\".</strong>  </p>  <p>  \t<strong>2 k students enrolled. Current Price is $50. Cost will go up $100 very soon.</strong></p>  <p>  \t<strong>Benefits of using GitHub Pages:</strong>  </p>  <ul>  \t<li><strong>Host Unlimited Websites</strong></li>  \t<li><strong>1GB Disk Space per website</strong></li>  \t<li><strong>100MB Per File Limit</strong></li>  \t<li><strong>Virtually No Bandwidth Limits</strong></li>  \t<li><strong>Free</strong></li></ul>  <p>  \t                                                              Hosting a website on a web server like a Linux/Windows server can be very expensive in the first place, that's where this course comes to the rescue.  </p>  <p>  \t                                                              There are many web hosting services out there which require tremendous technical skills and a lot of experience to use them for Ex: Hostgator, Blue Host, Amazon Web Services, Microsoft Azure and many more.  </p>  <p>  \t<strong>Did you know that you can host a website on GitHub Pages for free?</strong>  </p>  <p>  \t                                                               And this course will give you a step-by-step guidance on how to host a website for free using GitHub Pages.  </p>  <p>  \t                                                              Now, before even having a second thought on having a website online or getting into the Basics of GitHub Pages, Lets read a few benefits of having a website online.  </p>  <p>  \t<strong>Did you know the Benefits of having a website online?</strong>  </p>  <ul>  \t<li>Having a Website is Far Cheaper than Advertising.</li>  \t<li>Promotes your Business 24*7 and 365 Days</li>  \t<li>Adds Value to everything (Customers, Services, Products)</li>  \t<li>Improves Credibility</li>  \t<li>Brings Growth Opportunity</li>  \t<li>Inexpensive way to provide information about your Business to your Customers.</li>  \t<li>A Website makes it easy for people to refer new customers to you.</li>  \t<li>A Website is a powerful sales tool</li>  </ul>  <p>  \t                                                              Now, let's talk about GitHub Pages and why you would want to use it for hosting your websites online.  </p>  <p>  \t                                                              GitHub Pages are public webpages freely hosted and easily published through the GitHub website. You can create and publish them online using the Automatic Page Generator. If you prefer to work locally, you can use the GitHub for Mac and Windows apps.  </p>  <p>  \t                                                              In this course you'll learn how to host your website using GitHub Pages. Before diving into GitHub Pages, You'll need to purchase your own Domain Name which costs around $10 to $12 yearly that's it no more expenses.  </p>  <p>  \t                                                              A lot of people who are scared to get their First Website online now can have their website online right away using GitHub Pages.  </p>  <p>  \t<strong>In this course you'll learn the following things:</strong>  </p>  <ul>  \t<li>Getting Started with GitHub</li>  \t<li>How to create Repositories and Organizations</li>  \t<li>How to use GitHub Pages</li>  \t<li>Types of GitHub Pages</li>  \t<li>How to use the Git Extensions Software</li>  \t<li>How to Host Websites using GitHub Pages</li>  </ul>  <p>  \t<strong>Who should join this course?</strong>  </p>  <ul>  \t<li>Small Business Company who need to host their websites</li>  \t<li>College/University Students </li>  \t<li>People with New Business who might need to host a Website</li>  \t<li>People running Organizations</li>  \t<li>People who need to host Charity Websites</li>  \t<li>People who need to host Community Websites</li>  \t<li>Web Developers</li>  </ul>  <p>  \t<strong>Note : Course is about GitHub Pages only and not about Designing Websites. This course only covers the Hosting part and not Designing.</strong>  </p>  <p>  \t                                                              Thank You  </p>  <p>  \t                                                              Abhishek Luv  </p>", 
    "end_date": null, 
    "title": "Learn How to Host Free Unlimited Static Websites", 
    "price": "30.00", 
    "instructors": "Abhishek Luv, Develop 2 Deploy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285630_7567_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-host-static-websites-using-github-pages/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-22T02:03:57Z"
}