{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t This course is for anyone who wants to <strong style=\"\">become fluent in the Vietnamese language</strong> or simply learn some conversational phrases and vocabulary before making a trip to Vietnam. It's also for anyone seeking to simply <strong style=\"\">communicate with your Vietnamese friends or neighbors</strong>.  </p>  <p>  \t It is designed to<strong style=\"\"> teach you Vietnamese in the shortest possible time</strong> frame by using the same strategies that I used when I first learned the language while living in Vietnam. I'll teach you tricks and tips along the way that allow you to understand popular phrases and slang, as well as how to <strong style=\"\">properly pronounce the difficult tones</strong> and accents of Vietnamese.  </p>  <p>  \t I have structured the course into short, instructional videos that allow you to focus on one subject at a time <strong style=\"\">without getting overloaded with too much information</strong>. I have adapted some of the grammar and sentence structures from the very popular language textbooks used at the University of Sociology and Language Arts in Ho Chi Minh City which are the core building blocks of the language.  </p>  <p>  \t Everything in the course is <strong style=\"\">useful in everyday situations</strong> so you will never be spending time studying something that is not totally applicable in the real world right away. Most language courses have a lot of this kind of superfluous material which is quite inefficient and waste a lot of time covering unnecessary vocabulary and grammar rules. Our course is designed for <strong style=\"\">efficiency AND proficiency.</strong>  </p>", 
    "end_date": null, 
    "title": "Learn to Speak Vietnamese Like a Native", 
    "price": "20.00", 
    "instructors": "Greg Vanderford", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50574_44bc_13.jpg", 
    "course_url": "https://www.udemy.com/learn-to-speak-vietnamese-like-a-native/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-19T20:29:59Z"
}