{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tWhile Adobe Photoshop CC is a phenomenal tool for graphics and photo professional, it is overkill for many users&#039; needs. In this series, you&#039;ll learn how Photoshop Elements can be used to achieve fantastic, professional quality results for a fraction of the cost.  </p>  <p>  \tAndy Anderson shows how to use the tools and techniques in this powerful photo managing and editing program. This course is designed for the absolute beginner, meaning no previous experience with Photoshop Elements is required. You will start by learning about the Elements interface, including how to access multiple images, use rulers and guides, and control grids and guides with preferences. From there, Andy will teach you the various capture techniques, how to get organized with the Elements organizer, and how to organize with albums, stacks, and catalogs. This video tutorial also covers basic image techniques, controlling image edits with selection, gaining control with layers, and working with color. You will also learn about the effects and filters in Elements, as well as additional special effects such as creating custom brushes, generating reflections, and replacing image color. Andy will also teach you how to work with text, and about the output options in Elements. Finally, you will cover how to create a personalized greeting card, produce a photo book, and generate contact sheets, among other additional considerations.  </p>", 
    "end_date": null, 
    "title": "Learning Photoshop Elements 13", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373486_53b3_5.jpg", 
    "course_url": "https://www.udemy.com/learning-photoshop-elements-13/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-18T21:25:46Z"
}