{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Laravel is the most\nfamous PHP framework. With thousands of developers and projects, it's\nincreasing the market demand to develop any kind of web applications using\nthis language. </p>\n\n\n\n<p><strong>Why should you know Laravel? </strong></p>\n\n\n\n\n\n\n\n\n\n<p>This awesome\nframework will allow you to create web applications in a simple and readable\nway. It will make app maintenance a breeze. Ever enjoyed coding? With Laravel,\nyou'll certainly do!! </p>\n\n\n\n\n\n\n\n\n\n<p>Laravel brings a\ncomplete toolset to develop in a new way so that you can focus on your app and\nnot the small, annoying little things in code. This means, many parts you'll\nneed for your app success are already built in. Such as authentication systems,\nfront-end interactions, site customizations and much more. Isn't it just\ngreat?! </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why is this the best course you can take?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>I believe in\nempowering people with really useful and practical knowledge! It's my main\nfocus and something I live by.</p>\n\n\n\n\n\n\n\n\n\n<p>I have endured\nmyself long and boring courses that left me nowhere. Dry teachings with no\nexamples to follow up with, to really bring home what you've been taught. What\na drag!! :\\</p>\n\n\n\n\n\n\n\n\n\n<p>That's why my\ncourses take an intuitive approach, not only providing useful examples but\nexplaining all the concepts behind them so that you really understand what's\ngoing on. But no need to worry!</p>\n\n\n\n\n\n\n\n\n\n<p>As per personal\nexperience, I know what is needed to know and what's really just useless\nconcepts that distract you from the important parts. You'll soon realize\nI've been very attentive so that your focus is used only for the very best. :) </p>\n\n\n\n\n\n\n\n\n\n<p>This is the best way\nto ensure you'll be able to figure out any problem that pops up your way on\nyour own. To become a real Laravel developer. And if you can't, I'll always be\nwith you until the finish line.</p>", 
    "end_date": null, 
    "title": "Learn Laravel 5.2 Basic in 7 days", 
    "price": "20.00", 
    "instructors": "Brainiacs Academy", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842224_6cfb_2.jpg", 
    "course_url": "https://www.udemy.com/learn-laravel-52-basic-in-7-days/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-07T18:49:03Z"
}