{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Heard about Mind Mapping but not had time to play with the software?<br style=\"\">  \t<br style=\"\">  \t      Feel like there must be a way to get more from your Brain?<br style=\"\">  \t<br style=\"\">  \t      Want to have more fun with the way you handle your work?<br style=\"\">  \t<br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">If so then take this course - it was designed with you in mind.<br style=\"\">  \t</strong><br style=\"\">  \t         Maps marry your logical mind with your creative abilities to keep your brain more stimulated. <br style=\"\">  \t<br style=\"\">  \t          We have an infinite capacity for remembering images so we  link graphics to ideas to boost memory.<br style=\"\">  \t<br style=\"\">  \t          The brain has an infinite capacity to make creative connections. Maps of your thoughts opens up linkages.  </p>  <p style=\"\">  \t          The whole or &quot;gestalt&quot; view relaxes the brain. Seeing the Big Picture feels like everything under control.<br style=\"\">  \t<br style=\"\">  \t             Using a  simple scenario, making a training course, we demonstrate the features and benefits of MindJet&#039;s MindManager.<br style=\"\">  \t<br style=\"\">  \t         Learn by following the course with MindJet&#039;s <strong style=\"\">30 day FREE trial.</strong> Get practical experience. It takes about 2 hours to complete with three simple exercises to build your first map.<br style=\"\">  \t<br style=\"\">  \t          Things you will achieve:<br style=\"\">  </p>  <ul style=\"\">  \t<li style=\"\">See and work on all your ideas from a single screen.<br style=\"\">  \t</li>  \t<li style=\"\">Add graphics to your work to make it more memorable.<br style=\"\">  \t</li>  \t<li style=\"\">Link  to websites, Excel, Word, Powerpoint and Visio for a complete view of the world without switching applications.<br style=\"\">  \t</li>  \t<li style=\"\">Add tasks and view them in a Project Workflow or Gantt Chart.<br style=\"\">  \t</li>  \t<li style=\"\">Make creative connections and brainstorm for innovative insights using prompts. if you get stuck.<br style=\"\">  \t</li>  \t<li style=\"\">Deliver more compelling presentations with Walk-through and Slideshow.<br style=\"\">  \t</li>  \t<li style=\"\">Navigate your map as it builds, search for specific elements, personalise the colours and backgrounds.<br style=\"\">  \t</li>  \t<li style=\"\">Share your ideas with others in a wide range of different ways.<br style=\"\">  \t<br style=\"\">  \t</li>  </ul>  <p style=\"\">  \t<strong style=\"\">   Make the mental shift to mapping and achieve more from your most important asset - your Brain.  </strong>  </p>", 
    "end_date": null, 
    "title": "Learn Mind Mapping with MindManager", 
    "price": "20.00", 
    "instructors": "Peter Urey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251388_3cd7_7.jpg", 
    "course_url": "https://www.udemy.com/learn-mind-mapping-with-mindmanager/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-27T07:23:13Z"
}