{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>No previous experience is required on AutoCAD, we begin at the beginning.</strong></p><p>Learn how to make professional-looking drawings browsing 8 modules. For each new command we present a video of a simple exercise. Then you can download the file and recreate the exercise by yourself. Then, we start by gradually increasing the difficulty, at the end of the module, you'll be able to do complex exercises incorporating all the commands learned. </p><p><strong>OBJECTIVE:</strong> </p><p>Courses allow students to draw simple objects using AutoCAD.</p><p><strong>CONTENT:</strong></p><p><em>Draw</em>: Open AutoCAD for the first time , discover the software interface and learn how to use the commands needed to draw a simple drawing.</p><p><em>Modify</em>: Learn how to use commands needed to edit and to do more complex drawings.</p><p><em>Using Blocks</em>: Learn how to create and use blocks representing architectural, map, mechanical or electrical symbols.</p><p><em>Print</em>: Learn how to print your drawings and export them into PDF files to be able to pass them safely by email to your customers and employees.</p><p><em>Hatches</em>: Learn to use hatches to represent covering on architectural drawings, soil on landscaping designs or materials on mechanical drawings.</p><p><em>Dimensions</em>: Learn how to add the dimensions needed to complete your drawings.</p><p><em>Text</em>: Learn how to add notes, titles and other text to your drawings. Adjust fonts, lettering height and other parameters related to the text.</p><p><em>Layout</em>: Create professional-looking layout of your drawings.</p><p><strong>INSTRUCTORS:</strong></p><p><em>Jean-René Rodrigue</em>, Mechanical engineer, technical college teacher and cad pro. </p><p>I have created this online course to teach AutoCAD to engineers, designers and architechs.</p><p><em>Austin Young</em>, Polyglot, software engineer, data interpreter.</p><p>He has translated the course from French to English and he is the voice you'll hear throughout the videos.</p><p><strong>AutoCAD FOR FREE:</strong></p><p>As a student, you may download AutoCAD for free. Just check the link in the first lesson.</p>", 
    "end_date": null, 
    "title": "Learn AutoCAD From Scratch: Make Your Own Plans By Yourself", 
    "price": "50.00", 
    "instructors": "Jean-René Rodrigue", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443280_afef_2.jpg", 
    "course_url": "https://www.udemy.com/learn-autocad-from-scratch-make-your-own-plans-by-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T02:45:37Z"
}