{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>\t<strong></strong><strong>THE QUICKEST, EASIEST WAY TO LEARN SCRIVENER - Guaranteed! </strong></p><p><em><strong><em>The Best Scrivener Training Anywhere! Learn Scrivner Fast with this comprehensive, easy-to-follow video training.</em></strong></em></p><p><em><strong><em>“Most useful course EVER!!!\" RS Clark</em> </strong></em></p><p><em><strong>PLEASE NOTE: This training uses the Mac version of Scrivener (with notes for Windows users) but I now also have a purely </strong></em><em><strong>Windows based </strong></em><em><strong>training also available </strong></em><strong><em>called 'Scrivener For Windows - A Quick &amp; Easy Guide' so do check that out if you are a PC user.</em></strong></p>  <p>\t<em>“Five Stars - First I want to say that <strong>if I could add a star - I would. The course just kept getting better and better. </strong>The instructor has added to the course, since I began, and has expanded on many topics. If you use Scrivener, or want to use Scrivener - this course is a must!! \" Larry Sweet</em>  </p>  <p>\t<em>“<strong>Fantastic In-depth Scrivener training.</strong>\" Amy Harrop</em>  </p>  <p>\t<em>“Excellent course! I've had Scrivener for some time. Never realised there was so much to the program. This course has been a real eye opener for me. Learning some real cool tips and tricks. <strong>At last I'm learning how to use Scrivener which in turn makes the task of writing easier.</strong>\" Roma Hudson</em>  </p>  <p>\t<em>“<strong>One of the most professional video courses I've ever seen.</strong>\" Britt Malka</em>  </p>  <p>\t<strong>Discover The Tool Of Choice For Thousands Of Six Figure Authors, Bloggers &amp; Content Creators.</strong>  </p>  <p>\t<strong>Is It Not Time You Joined Them? </strong>  </p>  <p>\t<strong>Welcome To The BEST Scrivener Training Course On The Planet!</strong>  </p>  <p>\t<strong>This Training Is Guaranteed To Unlock The Secrets Of Scrivener Right Before Your Eyes.</strong>  </p>  <p>\t<strong>Give Learn Scrivener Just One Hour, And You Will Already Be Harnessing The Power Of This Unique Software To Realize Your Own Writing Dreams.</strong>  </p>  <p>\t If you are a writer of any kind - a poet, a novelist, an educator, a blogger, in fact, whatever you are up to in the world of writing and content creation - and you are not already using Scrivener for your writing projects - you are missing out on <strong>the best kept secret in a writer's creative toolbox.</strong>  </p>  <p>\t<strong>Learn Scrivener is a unique and revolutionary piece of software that will take your writing projects, content creation, and research to the next level.</strong>  </p>  <p>\t Unfortunately, a lot of people shy away from making the leap from second rate (just my opinion, but I know I'm not alone) writer's tools like Microsoft Word, because Scrivener, at first glance, looks complicated and difficult to grasp.</p>  <p>\t I promise you that this is not the case.</p>  <p>\t The <strong>Learn Scrivener Course</strong> teaches with ease and clarity everything you need to know to make your writing projects rock.</p>  <p>\t No more excuses! This course is for you.</p>  <p>\t Within less than 30 minutes of the Learn Scrivener training you will instantly recognise how Scrivener can work for you in any writing or research project you are involved in.</p>  <p>\t Once you have those key components in place, and there are just a few essentials for this to be one of the best investments you will ever make, there will be no holding you back. You can then choose to look under the hood a little further and taste the power of this superlative program and its amazing benefits for creatives like yourself, and enjoy the advanced areas of training included in this comprehensive course.</p>  <p>\t<strong>Even if you are opening Scrivener for the very first time</strong>, the Learn Scrivener For Windows Course will hold your hand and have you up and running in no time.</p>  <p>\t<strong>And for experienced Scriveneers among us? </strong>There are tons of tips and tricks you will discover. Keys that will undoubtedly streamline your workflow, and fuel your creativity. Plus, more are being added all the time as I discover new tricks myself.</p>  <p>\t I can honestly say that no other tool has helped me in my writing career quite as much as Scrivener. I wish that I had access to training like this when I first started my own journey. What an incredible time saver that would have been!</p>  <p>\t Don't believe me? Try it for yourself, and you will wonder how you ever lived with our Scrivener!</p>  <p>\t<strong>Just a few of the Scrivener keys you will learn that will open the creative floodgates:</strong>  </p>  <ul>\t<li>How to set up a Scrivener project from scratch.</li>\t<li>How to utilize the Scrivener templates.</li>\t<li>How to format your documents like a rock star.</li>\t<li>How to add research from just about any source, and organise it right within your Scrivener project (no more mess of folders and bookmarks, everything right at your fingertips!).</li>\t<li>Enjoy distraction free writing (just one click away).</li>\t<li>How to export your project for Kindle publishing in just a few taps of the mouse.</li>\t<li>How to export to ePub format for the iBookstore, Kobo and Nook.</li>\t<li>How to take that same project and create a publish ready PDF for Createspace and other print-on-demand services (not a lot of people know how to do this, but Learn Scrivener makes it Quick &amp; Easy!).</li>\t<li>How to use Scrivener's cool cork board view to rapidly create and arrange your projects.</li>\t<li>Set writing goals, track your progress and check your stats.</li>\t<li>Use Scrivener's Collections feature to search, streamline and organise your projects.</li>\t<li>Use Scrivener's novel themplate like a pro.</li>\t<li>Illustrate your Scrivener documents with images (the right way!).</li>\t<li>Plus too many other benefits and fabulous features to pack onto one page.</li>  </ul>  <p>\t If I were you I would stop what you are doing, and jump in right now.</p>  <p>\t<strong>Seriously, even if you don't own Scrivener, you can get a 30 day trial for free, and put it through its paces alongside the training.</strong>  </p>  <p>\t The little time it takes will quickly be paid back many times over in the hours you will save because of Scrivener's awesome capabilities.</p>  <p>\t<strong>There is no other software for writers that even comes close to Scrivener in its features and benefits, and no training that can help you more than 'Learn Scrivener - A Quick &amp; Easy Guide'</strong>  </p>  <p>\t PLUS, all of the extra videos and other resources, that are added at any time in the future, will be stacked into your account at no extra cost.</p>  <p>\t There are so many cool things that will be included as the course evolves (many are already being prepared as we speak), and you will have life time updates.</p>  <p>\t It can't get much better than that!</p>  <p>\t<strong>SO LET'S GET STARTED...</strong>  </p>", 
    "end_date": null, 
    "title": "LEARN SCRIVENER - A Quick & Easy Guide", 
    "price": "35.00", 
    "instructors": "David Lee Martin", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/194168_f34d_5.jpg", 
    "course_url": "https://www.udemy.com/learn-scrivener-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-05T08:12:01Z"
}