{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This is a beginners course to learn detailed, step by step methods to paint environment in photoshop.<br></p>  <p>  \t         Ever wonder how some artists produce extremely gorgeous professional environment paintings made in digital media?  </p>  <p>  \t       -In this course you will start learning just that.  </p>  <p>  \t         in today's world of game,animation, high definition background effects, there is a growing demand for environment artists. work of an environment artist consists, illustration, game  and animation background painting, concept art for 3D games,animations,movies and more.  </p>  <p>  \t<strong>   This Course is the Stepping Stone For You To Become a Professional Environment Artist in the world of Graphic Art. </strong>  </p>  <ul>  \t<li>If you are a beginner, after this course you will be able to achieve enough skills to start your own project </li>  \t<li>You will be able to build up your own portfolio based on environment design</li>  \t<li>You will receive a structured guidance from me </li>  \t<li>This is a very dynamic course, so I will keep adding materials to this course to make the process going</li>  </ul>  <p>  \t     In this course, first we will learn basic concepts of environment painting. which is the theory part. before we dive into our project work, we need to discuss some basic rules and guidelines to start our journey. these concepts will only clear your path towards your destiny as your creativity is the ultimate source of your work.  </p>  <p>  \t        then we will see how an environment take shapes and comes into reality from concept, imagination, inspiration and creativity through various stages through my demonstration videos. stick to the end and you will find lots of information, guidance and most importantly inspiration, to start your first project.  </p>  <p>  \t        With important files included, you will be able to closely observe every steps of the project work and work along side to develop your own skills.  </p>", 
    "end_date": null, 
    "title": "Learn Digital Painting From Scratch With Photoshop", 
    "price": "20.00", 
    "instructors": "Jia Sen", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339188_9d0c_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-course-environment-painting-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T11:43:51Z"
}