{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t  Welcome to &ldquo;<strong style=\"\"><em style=\"\">Learn Jamaican Dialect in 5 lessons &rdquo;. This comprehensive course will instantaneously teach you how to interact with locals and become a Jamaican cultural Ambassador (FACT: There are actually more Jamaicans living outside of Jamaica, so chances of you finding a few are very high). </em></strong>  </p>  <p style=\"\">  \t  Our ultimate course covers the uses and relationships between popular local expressions and corresponding English translation. This course is primarily for those who want to communicate effectively with locals and allow everyone to share special moments that will create a life time of great memories.  </p>  <p style=\"\">  \t  This course features practical and real easy to follow translations between two persons having conversations to make your experience as real as possible.  </p>  <p style=\"\">  \t  So whether you&#039;re planning to visit Jamaica or just enthused about learning our Dialect. Let us help you understand one of the key ingredient to our music, and culture from the comfort of your own home with our easy-to-use guide.  </p>  <p style=\"\">  \t<strong style=\"\">With this course you: </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Gain a <strong style=\"\">deeper connection</strong> to the music and <strong style=\"\">actually      understand</strong> the power of the <strong style=\"\">Reggae and Dance-hall </strong>words that      you love to sing along to and never guess another lyric again.</li>  \t<li style=\"\">Never feel lost in a conversation again&hellip; Now you will      be able <strong style=\"\">Carry on conversations </strong>with locals and family members who      speak Patois. So, those funny moments and surprises never go over your      head and leaving wondering what just happened. </li>  \t<li style=\"\">Learn the best words to use in common social situations      and ways you can truly fit in with Jamaican friends, family, and locals      you come in contact with&hellip; <strong style=\"\">Experience a direct connection</strong> to the      people and richness of Jamaican life and enjoy every moment (which often      times are funny as hell).</li>  \t<li style=\"\">Learn to<strong style=\"\"> negotiate deals for transportation, buying      craft and just staying away from trouble</strong>. Yes, often time&rsquo;s folks will      talk and think that you don&rsquo;t understand them and now you have the element      of surprise where you can prepare to move away or avoid confrontations.</li>  \t<li style=\"\"><strong style=\"\">Gain a deeper knowledge</strong> than ever before of <strong style=\"\">Jamaican culture</strong> because      now you can interact even more freely with <strong style=\"\">Rastafarian&#039;s</strong> and share      their mysteries and history.</li>  </ul>", 
    "end_date": null, 
    "title": "Learn Jamaican Dialect in 5 Lessons", 
    "price": "20.00", 
    "instructors": "Junior Campbell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/129518_0d0c_6.jpg", 
    "course_url": "https://www.udemy.com/learn-jamaican-dialect-in-30-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-05T14:47:33Z"
}