{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>You are interested in learning Python and getting into the wide realm of programming and intense Tech Entrepreneurship. You have probably wondered what is the most practical way of learning Python (which to be frank, gives you the key to ruling the technology industry). </p><p>I have learned over 10 programming languages such as JAVA, Python, C++, R, Matlab, Ruby, CSS, HTML, Angular JS, Java Script. I have also had a successful freelancing career programming software and mobile applications. Since technology is changing every day, I have to learn something new every time. The best way that you can learn how to program is \"to program\". Yet, nobody teaches in this manner and I suffer from the same pain when learning something new every time. Most courses are not designed to help you learn by example (immersion is the most potent way of learning in humans). Rather they bathe you with inapplicable information that you have to learn over and over again anyways.<br></p><p>This course covers not only the basics of syntax in Python, but also covers the more advanced data structures and data types like Strings, Lists, Dictionaries, and Tuples. However, only 3 videos are used to explain the overviews of all this information. I develop the  rest of the details of the data structures and syntax through exercises that I walk you through in the course. The first part of the course is the introduction to these structures and the syntax. There are 4-5 lectures on solving tough exercises on each subject so that you can understand not only the syntax and how to the program python, but also what the crux of programming is in terms of how we solve problems programmatically and harness the POWER of Python.<br></p><p>There is no risk for you as a student in this course. I have put together a course that is not only worth your money, but also worth your time. This course encompasses the basics of Python programming and I urge you to join me on this journey to learn how to dominate the entrepreneurial world with the most powerful language: Python.<br></p>", 
    "end_date": null, 
    "title": "Learn Python Through Exercises", 
    "price": "20.00", 
    "instructors": "Dhruv Bais", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737196_7bfb_3.jpg", 
    "course_url": "https://www.udemy.com/learn-python-through-exercises/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T20:27:44Z"
}