{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>\n****updated February 2016</p><p>Are\nyou lost when it comes to your music career?  Do you have the\ncreative side down but lack any knowledge about the business?  Do you\nknow how to find the photographer or manager?  Its called the music\nbusiness for a reason and most independent artists, producers,\nsongwriters and muscians are constantly caught up in bogus deals or\nmeeting the wrong people because of not understanding the business\naspect. </p>\n<p>\nLearn\nthe Music Business is an educational online course that teaches\nmusic artists about the music industry and more importantly how to\nsave money in the music industry.\nHow to avoid the common mistakes that most artists make, how to  get\nripped off by a shady manager, tips on how to get airplay, sell more\nmusic and create the right image for your career.  This course will \nhelp level the playing field by making dreams come true for unsigned\nartists, songwriters, producers and musicians.  Connect the dotsby\ngiving each student access to industry leaders that can help you get\nthe exposure you need. </p>\n\n<p>\n</p>\n\n\n\n\n\n\n\n<p>I am a music industry expert with over 30 years experience in\nmarketing, publicity and branding. In the past, I've worked with\nWill Smilth, Queen Latifah, MTV, Atlantic Records, NBA entertainment,\nRosie Perez,  NBA Kenny Smith, Sean Combs, MC Lyte, veteran jazz\nartist Bob Baldwin and many others.  Learn the Music Business is a\nvideo collection of advice from a few of my close friends in the\nmusic industry. You will be learning from a team of people including\ncelebrity photographers, celebrity publicists, entertainment lawyers,\nradio DJs, record executives, celebrity stylists, celebrity fitness\ntrainers and veteran managers.  The independent music artists who\nwants to understand the business aspect  from multiple sources\ninstead of one person.  </p><p><strong>****I am so happy with this course, and so confident that you will learn something new about the music industry that will help your career I will offer a 30 day guarantee.**************</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\n<br></p>\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>\n</p>", 
    "end_date": null, 
    "title": "Learn the Music Business and explode your music career!", 
    "price": "20.00", 
    "instructors": "Terry Moorer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442930_e2ee_4.jpg", 
    "course_url": "https://www.udemy.com/learn-the-music-business/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-09T17:48:57Z"
}