{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul style=\"\">  \t<li><strong style=\"\"><em style=\"\">Learn simple techniques developed by leading expert Debra Betts, who has taught them to hundreds of pregnant women, birth partners, midwives and practitioners around the world. They&#039;ve been amazed by the results!</em></strong></li>  \t<li><strong style=\"\"><em style=\"\">Sign up now and feel confident as you approach your due-date that you and your partner have the tools to promote a better birth experience</em></strong></li>  \t<li><strong style=\"\"><em style=\"\">No prior experience or special skills needed!</em></strong></li>  \t<li><strong style=\"\"><em style=\"\">More than 50 students in the first few days on Udemy!</em></strong></li>  \t<li><strong style=\"\"><em style=\"\">Early 5-star reviews from happy students!</em></strong></li>  </ul>  <p style=\"\">  \t          Debra Betts has taught acupressure to promote a better birth experience to midwives, practitioners and pregnant women for many years. Now - at last - this professionally produced course offers a detailed explanation, fully demonstrated, of the techniques involved. Ideal for practitioners of acupuncture, acupressure, shiatsu and massage, doulas, birth helpers and pregnant women, the course includes testimonials from women and their partners who have used the techniques during labour, and a downloadable &#039;cheat sheet&#039; with illustrated reminders of the most important pressure points and their application.  </p>  <p>  \t<em style=\"\"><strong style=\"\">“I was absolutely amazed by how much it helped me.”  </strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">“As soon as my partner’s contractions began, it <br style=\"\">  \twas obvious that this was really effective.  It <br style=\"\">  \twas also the ideal way for me to feel fully<br style=\"\">  \tinvolved with the delivery.’ </strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">“All three of my children were born naturally.<br style=\"\">  \tHowever, we used acupressure the last time<br style=\"\">  \tAnd the difference was amazing!’</strong></em>  </p>", 
    "end_date": null, 
    "title": "Learn acupressure to encourage an optimum natural birth", 
    "price": "20.00", 
    "instructors": "Tom Kennedy BSc MBAcC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421498_7860_2.jpg", 
    "course_url": "https://www.udemy.com/acupressure-for-labour/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T23:44:29Z"
}