{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Learn the basic concepts, tips, and techniques that you will need to be able to type fast as 60 WPM without having any Game/ App used.</p><p><strong>Achieve a strong experience in Touch Typing with this tutorial for beginners to advanced.</strong></p><ul><li>How to type the letters</li><li>How to type numbers</li><li>How to type symbols</li></ul><p><span></span></p><p><strong>A Powerful Skill at Your Fingertips</strong></p><p>Learning the fundamentals of Touch Typing puts a powerful and very useful tool at your fingertips. Learning Typing is useful, easy to learn, has excellent outcomes for your future. You can then stop spending time on Games or online typing course if you are using them as they are time-waste only.</p><p>Jobs get easier if you have this skill, employers will certainly prefer you over others for having strong keyboarding skills.</p><p><strong></strong></p><p><strong>Features</strong></p><ul><li>Best course on learn to type on Udemy.</li><li>Exclusive and will teach you differently unlike online typing courses using games or Apps.</li><li>Lifetime Support included on Touch Typing.</li><li>30 Days Money Back Guarantee</li></ul><p><span></span></p><p><strong>Content and Overview</strong></p><p>Suitable for beginning typist, through this course of 21 lectures, 1 hour of video content and 4-8 hours of practice labs, you’ll learn all of the typing fundamentals and become the fastest typist in 9 easy steps. Each lecture includes an exercises i.e lab, putting your new learned skills into practical use immediately.</p><p>Starting with the middle keyboard line, this course will take you through all the 3 keyboard lines, numbers, and symbols. By learning step by step and practicing them along with, you’ll a establish a strong understanding of OOP.</p><p>Congratulations you are on the right page, If you are looking for Typing Skills, The aim is to teach you the easiest way without involving any software, games or online typing tutorial. Inside course practice available, which means you won't need to go out of the course for practice as they are included after each lecture.<br></p><p>Students completing the course will have the expertise to be able to type fast. Complete with practice files, you’ll be able to gain 60+ WPM. You will receive a verifiable certificate of completion upon finishing the course.</p><p><strong><strong>Type like a pro, have the speed of around 60 WPM in as less as 4 hours with spending 30 minutes on each practice lesson.</strong> Guaranteed!</strong></p><p><strong>Enroll Now and become a Pro at typing skills within minimum 4 hours.</strong></p>", 
    "end_date": null, 
    "title": "Learn Touch Typing achieve 60WPM in 4 Days. No Game/App used", 
    "price": "20.00", 
    "instructors": "Bakir Mousavi", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404788_941e_7.jpg", 
    "course_url": "https://www.udemy.com/learn-touch-typing-60-wpm-how-to-learn-touch-typing-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T22:19:55Z"
}