{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "Thanks for looking into this course! It is about mind maps, and they're very important. Traditional ways of writing down information or keeping notes is boring (really, your brain doesn't like that), and mind maps can help improve just about every way of thinking!<p>This course will teach you how to use FreeMind, it's a free mind mapping software available on all computers. You will learn how to brainstorm, make decisions, learning, organizing, and problem solving with mind maps. You will see that you can put any and all of your thoughts down as a mind map!</p><p>Mind maps are very important because of the power they enable you to have. You will discover that you are very creative, even if you don't think you are, through brainstorming. If you have a tough time making decisions you will find out how you can make a very informed decision depending on how much detail you go into it. It's up to you! Since mind maps are how your thoughts naturally work, you will be able to learn easier by keeping notes as mind maps. Organizing is also very easy, and with FreeMind even easier with the easy drag and drop interface. Of course, you can do all of this and more! Once you are done with the course you will be making up your own ways to use mind mapping.</p><p>If this all sounds interesting, sign up for the course now, you're going to love it!</p>", 
    "end_date": null, 
    "title": "Learn Mind Maps with FreeMind", 
    "price": "20.00", 
    "instructors": "Alex Bylund", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498700_5689_2.jpg", 
    "course_url": "https://www.udemy.com/learn-mind-maps-with-freemind/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T06:22:23Z"
}