{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<strong style=\"\">Learn and  speak the Filipino (Tagalog) language right now!</strong>  </p>  <p>  \t                      The Conversational Filipino for Beginners course is here to give you<strong style=\"\"> the absolute basics of the Filipino (Tagalog) language</strong> in a quick and efficient way.  </p>  <p>  \t               As your language teacher and guide, I will give all the information you will need to speak the language after just a few lessons. <strong style=\"\">Absolutely no prior knowledge about Filipino (Tagalog) required!</strong>  </p>  <p>  \t                          Learning a foreign language may overwhelming at first, but because this is an online course, you can work through it<strong style=\"\"> at your own time and at your own pace</strong>. You just need to have an ardent desire to learn a foreign language and that will surely help you become successful in learning Filipino (Tagalog).  </p>  <p>  \t                          There&#039;s no doubt that there are a lot of Filipino (Tagalog) language learning materials out there. But this course will teach you how to <strong style=\"\">speak the kind of Filipino (Tagalog) that Filipinos speak day in, day out</strong>.  </p>  <p>  \t                        Don&#039;t worry, I won&#039;t bore with Filipino (Tagalog) grammar lessons. I know that grammar may be intimidating for many beginners. Instead, I will guide you on how you can interact with other people using the Filipino (Tagalog) language. So, we will<strong style=\"\"> learn expressions, phrases and sentences</strong> that you can use in various situations. As a bonus, you will also get to learn about the<strong style=\"\"> wonderful and fascinating Filipino culture</strong> along the way!  </p>  <p>  \t               By learning and speaking the Filipino (Tagalog) language, you&#039;ll be able to relate more with Filipinos (as well as Philippine locals) and get to know them better. I am sure that <strong style=\"\">your travel to Philippines would be more memorable and more meaningful</strong> if you&#039;ll be speaking the language of the locals.  </p>  <p>  \t<strong style=\"\">So, what are you waiting for? <em style=\"\">Tara na!</em> (Come on!) Let&#039;s begin learning and speaking the Filipino (Tagalog) language!<br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\"> </strong>  </p>  <hr style=\"\">  <p>  \t<strong style=\"\"> </strong>  </p>  <p>  \t<strong style=\"\">Course Features</strong>  </p>  <p>  \t                       Lessons are delivered via video lectures. Drills and exercises are incorporated into the lessons.  </p>  <p>  \t                       Downloadable handouts and review notes are also provided for each section or each standalone lesson. Students may use these while viewing the lecture. They may also be used for reviewing before attempting the quizzes.  </p>  <p>  \t                       Each section also ends with a quiz to measure your understanding of the lessons. The quizzes will also help in reinforcing the language lessons found in each section.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Course Content</strong>  </p>  <p>  \t                      This includes lessons that will teach you how to perform basic communicative functions in conversational or colloquial Filipino (Tagalog). In short, this course focuses on &quot;survival&quot; or &quot;essential&quot; Filipino (Tagalog), which will surely be beneficial to those traveling or relocating to the Philippines soon.  </p>  <p>  \t                     After taking the course, it is expected that students will reach approximately A2 level of fluency in the Filipino (Tagalog) language as outlined in the Common European Framework of Reference for Languages (CEFR).  </p>  <p>  \t                     Aside from teaching the Filipino (Tagalog) language, this course also aims to familiarize students with the Filipino culture.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Course Duration</strong>  </p>  <p>  \t                     The course was designed to allow students to work through the course at their own time and pace. Students may sign up and enroll in the course at anytime they wish. Course activities may also be completed at the most convenient time for them.  </p>  <p>  \t                   While students have the freedom to choose their learning schedule, it is advisable that they complete at least one lecture a day.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Course Completion</strong>  </p>  <p>  \t              Students are required to view all the lectures and accomplish all included activities to be able to qualify for a <a href=\"http://support.udemy.com/knowledgebase/articles/222875-certificates-of-completion\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Certificate of Completion</a> to be awarded by Udemy.  </p>  <p>  \t              It should be noted that there are no deadlines for completing the course. Nevertheless, students are advised to devote a few minutes of their time regularly for language learnings to fully benefit from the course.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Questions</strong>  </p>  <p>  \t            If you have any questions on the Filipino language, you are encouraged to post your questions on this course site. You may also contact me through Udemy&#039;s messaging system.  </p>", 
    "end_date": null, 
    "title": "Learn Conversational Filipino (Tagalog)", 
    "price": "40.00", 
    "instructors": "Jeric Pena", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/100874_92be_5.jpg", 
    "course_url": "https://www.udemy.com/learnfilipino/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-03T07:24:45Z"
}