{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t           Why should you join this course?</p>  <ul>  \t<li>an affordable course that is  informative and fun</li>  \t<li>learn the <em>hows and </em><em>whys</em> behind the language and really practice of what you learn</li>  \t<li>be part of a fun community of learners of Dutch worldwide</li>  </ul>    <p></p><p>  \t                      Dear fan of Dutch, yes, you!  </p>  <p>  \t                            Once upon a time you set out to learn Dutch. But every course you find just turns out to be very bland with too many boxes with grammar rules and never-ending vocabulary lists...  </p>  <p>  \t                           Well, guess what... I am a <strong>superb teacher of Dutch and I love to entertain.</strong> Shake those two up, and you get an interactive course, motivating you to really <strong>stick with it and have what you learn stick to you.</strong>  </p>  <p>  \t                    My magic? In introducing daily topics and useful expressions, I subtly have you picking up basic grammar rules. Unlike most other language courses,<strong> I won't devote entire chapters to complicated grammar rules, but will instead subtly weave them into the topic.</strong>  </p>  <p>  \t                    And then there's the Spaced Retention trick...  </p>  <p>  \t      Things will only stick if you quickly<strong> practice what you learn</strong> and keep doing that every so often. So get ready to not only listen to the voice on your screen, but also happily <strong>interact and answer any questions </strong>I have for you!  </p>  <p>  \t<strong> And that, dear fan of Dutch, is how a course can be made educational, interactive and fun!</strong>  </p>  <p>  \t              Be sure to check out the course preview to find out more!  </p>  <p>  \t<em>Veel succes en veel plezier! </em>Good luck and have fun!Leslie</p>", 
    "end_date": null, 
    "title": "Learn Dutch Online | Get Started!", 
    "price": "35.00", 
    "instructors": "Get in Dutch! with Leslie Van Ael", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71456_4076_31.jpg", 
    "course_url": "https://www.udemy.com/get-in-dutch-01/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-30T03:03:00Z"
}