{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>&nbsp;<strong>What is the course about?</strong></p><p>This course is about finding the right method for you to boost your language study.&nbsp; Every learner is different, and every learner needs something different to succeed.&nbsp; This course will help you learn methods, and find resources&nbsp;that fit <em>your </em>learning style, and will help bring you closer to real fluency.&nbsp; &nbsp;<br></p><p><strong>How long will the course take to complete?</strong></p><p>This course isn&#039;t like like a school class, with a beginning, middle and an end.&nbsp; Treat this course like a buffet, picking and choosing ideas as you please, and implementing them into your language study.&nbsp; <br></p><p><strong>How is the course structured?</strong></p><p>This course will be structured around the main areas of language acquisition. &nbsp;Each area will include multiple ideas about how to boost that area of interest:<br></p><ul><li>Reading</li><li>Writing</li><li>Speaking</li><li>Listening</li><li>Other (grammar, vocabulary, translation etc.)<br></li></ul><p><strong>Why take this course?</strong></p><p>Learning languages is fun, but it&#039;s also really challenging.&nbsp; Studying from textbooks and from a teacher are NOT the only ways to learn, and there are a lot more fun, innovative, and more effective methods available outside of the classroom.</p><p>If you feel something missing in your language education, this course could be for you!</p><p>Through this course, you&#039;ll learn to take control of your language learning, have more fun, and feel great about learning a foreign language!<br></p>  ", 
    "end_date": null, 
    "title": "Learn any Language with the Best Online Tools", 
    "price": "25.00", 
    "instructors": "Joe Gabriel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/55458_603d_7.jpg", 
    "course_url": "https://www.udemy.com/learn-any-language/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-21T05:57:17Z"
}