{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">I Created ‘Learn Scrivener Fast’ to Make Sure You Never, Ever Struggle with Scrivener Again.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Ever!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Finally</strong>…get the secret weapon every successful writer uses to publish their books, finish their novels, and have their work seen by hundreds…even millions of people…every single day!  </p>  <p style=\"\">  \tI don’t think it’s any secret that if you’re an author, a freelance writer, a copywriter, a professional blogger, a marketer, or even a lawyer, your livelihood depends on your writing.  </p>  <p style=\"\">  \tAnd if you’re not writing, you won’t be making any money on the half-finished novels and sales pages sitting on your virtual shelf of Scrivener.  </p>  <p style=\"\">  \tSee, it’s not like there are other amazing writing softwares out there. If there was a better program, you would use it!  </p>  <p style=\"\">  \t<strong style=\"\">And the Question No One Wants to Face: What Work of Yours is <em style=\"\">Unfinished</em> Because Scrivener Got in the Way?</strong>  </p>  <p style=\"\">  \tI know you have work you’re proud of and feel that need to share it with the world. And you can’t do that if you’re losing heart in docs of your research, trying to find your writing in other programs, and feel like you can’t keep it together for a minute more..  </p>  <p style=\"\">  \tIt’s my dream to help you learn Scrivener as fast as you can, move forward on your writing projects, and finally publish all of your best work, just like I’ve helped hundreds of other people do.  </p>  <p style=\"\">  \t<strong style=\"\">So Is it Possible to Sustain a Lucrative Writing Career in Your Pajamas?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">With Learn Scrivener Fast, it is.</strong>  </p>  <p style=\"\">  \tIf you believe that you have more to write, more to create, more to share…  </p>  <p style=\"\">  \tIf you want to be seen as a writer and be a writer that completely makes a living off of the words you put on the page, then I’m confident in saying that Learn Scrivener Fast will be a game-changer for you, just as it has been for so many other people.  </p>  <p style=\"\">  \t<strong style=\"\">Here’s what you will <em style=\"\">instantly</em> know how to do with Learn Scrivener Fast:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">You&#039;ll Learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"> How to get set-up with Scrivener in as little as an hour</strong>, whether you’re a Mac or Windows user, and virtually guarantee your success with using it</li>  \t<li style=\"\"><strong style=\"\"> How to navigate that complicated Scrivener window</strong> so you know what you need to use, and when you need to use it (and forget about what you don’t so you don’t waste time)</li>  \t<li style=\"\"><strong style=\"\"> How to customize your toolbar and turn yourself into a writing machine</strong>…whether you have a million ideas, or just 1.</li>  \t<li style=\"\"><strong style=\"\"> How to make “The Binder” bend to your will</strong> and organize all of your writing in one place–perfect for anyone who’s a self-proclaimed ‘visual learner’.</li>  \t<li style=\"\"><strong style=\"\"> Corkboard Mastery in just 4 minutes</strong>: How to turn your corkboard into your own ‘writing lab’ and never lose track of anything, forget your notes, or even your progress ever again.</li>  \t<li style=\"\"><strong style=\"\"> How to use the Collections feature</strong> so you always know what you need to do and what to focus on. Warning: Your projects will get done faster than you can blink.</li>  \t<li style=\"\"><strong style=\"\"> How to use the outliner to organize massive projects</strong>, complete them, and feel completely in control of your writing process.</li>  \t<li style=\"\"><strong style=\"\"> How to use your Project Notes</strong> so you can literally find your ideas ‘on-demand’ without having to stop writing and search all over the place for your notes.</li>  \t<li style=\"\"><strong style=\"\"> How to master the art of the rewrite</strong> and save every single version of your work, so you never worry about losing your ‘writing gold’ again.</li>  \t<li style=\"\"><strong style=\"\"> The simple, little known secret</strong> that will shave off weeks of time editing your writing. <strong style=\"\">Hint:</strong> <em style=\"\">Just one click can help you replace the name of a character or the name of the place without having to do it manually throughout your entire piece!</em></li>  \t<li style=\"\"><strong style=\"\"> How you can print, compile, share, and export your work</strong> with anyone so no one misses out on reading your work</li>  </ul>  <p style=\"\">  \t<strong style=\"\">So Why Do You Keep Putting Off Your Dream?</strong>  </p>  <p style=\"\">  \tAs one of my favorite self-development experts, Tony Robbins, has said: <em style=\"\">“You’re actually only a few millimeters…or a tweak away…from true success.”</em>  </p>  <p style=\"\">  \tCan you believe that your dream could be that close to you?  </p>  <p style=\"\">  \tThat Learn Scrivener Fast might be that tiny little tweak you’ve been searching for in those Scrivener forums and communities and help desks, but you never got the answer you wanted? And found yourself secretly begging the universe for someone to swoop in and fix it all for you?  </p>  <p style=\"\">  \t<strong style=\"\">Learn Scrivener Fast Is Here and Available For You to Take</strong>  </p>  <p style=\"\">  \t<em style=\"\">Just one click…and it’s yours</em>  </p>  <p style=\"\">  \t<strong style=\"\">What Others Are Saying About Learn Scrivener Fast</strong>  </p>  <p style=\"\">  \t<em style=\"\">“This is awesome! I love Joe’s training style. I highly recommend the Learn Scrivener Fast program! VERY well done and so worth it.” </em><strong style=\"\"><em style=\"\">MICHAEL HYATT - Best Selling Author, Speaker</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">“I wanted to get up to speed with Scrivener NOW, and Joseph delivered. You’re never farther away from a new skill than a couple of minutes. It’s brilliant! The course is far and away one of the best applied courses I’ve seen anywhere.”</em><strong style=\"\"><em style=\"\">JOEL FRIEDLANDER - Author</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">“The Learn Scrivener Fast program is the most comprehensive and easy-to-use guide to Scrivener, with short, actionable videos that will help you write more efficiently as well as publish more easily. There are tips and tricks for the newbie and the more experienced, I’m learning so much and I’ve been using Scrivener for years.” </em><strong style=\"\"><em style=\"\">JOANNA PENN J.F.Penn, NY Times &amp; USA Today Bestselling Author</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">“I used Scrivener a couple years ago but didn’t get mastery. Thanks to these tutorials I’m off and running now. This is going to help me push further ahead on my book project!” </em><strong style=\"\"><em style=\"\">CURT RICE - Huffpost writer </em></strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;I cannot thank you enough for creating the Learn Scrivener Fast course! I had tried to learn through a “dummies” book and it seemed complicated. Your course bought it down to easy to implement steps and now I feel confident. I am using it to write my first book and know I will be using it for years to come. Thanks so much! </em><strong style=\"\"><em style=\"\">LINDA LOCHRIDGE - Writer</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;Scrivener is the ONLY program to write your book with. You will save 10 or more hours by learning from Joe and you’ll start selling your book sooner. There’s no risk, just a chance for you to get published sooner. Buy it. You won’t regret it.&quot; </em><strong style=\"\"><em style=\"\">ANDY TRAUB - Author</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">Scrivener is an essential tool for the modern writer, but even after years of use it can still be confusing. Learn Scrivener Fast is a step-by-step self-paced video course designed to help writers maximize their time. Scrivener is an essential part of our daily flow, and tapping its full potential is paramount. This tool helps! </em><strong style=\"\"><em style=\"\">JOHNNY, SEAN, AND DAVE The Self-Publishing Podcast, </em></strong>  </p>", 
    "end_date": null, 
    "title": "Learn Scrivener Fast", 
    "price": "50.00", 
    "instructors": "Joseph  Michael", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/261244_9b52_3.jpg", 
    "course_url": "https://www.udemy.com/learn-scrivener-fast-today/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-14T18:05:51Z"
}