{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>Learn the Maltese language from 0!</strong></p>\n\n<p>Learning Maltese and finding it difficult? Or needing a good start? This is your course! You’ll learn Malta’s language online step by step, together with <strong>200+ other students</strong>. </p>\n\n\n\n<p>\n</p>\n\n\n\n<p>In this online Maltese course for beginners, we start with the Maltese alphabet and Maltese grammar. The course covers many topics Maltese language basics: you’ll learn how to use <strong>over 300 Maltese words</strong>, like Maltese food, good morning in Maltese, and many other Maltese phrases. Other subjects include: Maltese pronunciation, how to speak Maltese The level is A1-A2.</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>We’ll see many other <strong>online resources</strong>, for example how to find words in an online Maltese dictionary. So you’ll learn how to translate English to Maltese, and how to translate Maltese to English. These resources will help you to understand the Maltese people speaking ‘Malti’, the language of Malta. </p>\n\n\n\n<p>\n</p>\n\n\n\n<p>Even if you’re not on the Maltese islands, you’ll have <strong>always access</strong> to the course. You can review the lessons and repeat the exercises any time, as much as you want to get in touch with Maltese culture and the language in Malta.</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>I guarantee:</p>\n\n\n\n<ul>\n<li><em>Full, free lifetime access to a course on the language spoken in Malta</em></li>\n<li><em>All future extra lectures and upgrades are always included for free</em></li>\n<li><em>Unconditional Udemy 30 day money-back guarantee</em></li>\n\n</ul>\n\n\n\n<p>Check the free previews and see you on the inside to learn Maltese!</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>Alain</p><p><strong class=\"redactor-inline-converted\"></strong></p>", 
    "end_date": null, 
    "title": "Learn the Maltese language: speak and write Malta's language", 
    "price": "20.00", 
    "instructors": "Alain de Raymond", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618330_3ad7_2.jpg", 
    "course_url": "https://www.udemy.com/maltese-from-0-start-to-speak-read-and-understand-maltese/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T17:43:25Z"
}