{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The course is designed with one goal in mind; <strong style=\"\">To equip the students with in-depth knowledge of the United Nations recruitment process</strong> and <strong style=\"\">greatly increase their odds to be hired at the United Nations for a life-long rewarding career or short-term highly paid contracts</strong> that could potentially lead to long-term appointments</p><p>The secret to get contracts short or long at the UN is to know the organizational structure, on which post to apply where you&#039;ll have a better chance to get your foot in the door, to prepare your résumé to pass the multiple automated and manual screening processes, to be ready for your test and finally the Competency Based interview.</p><p>The course will follow that process, making sure you understand each step. The lecture will use images, PowerPoint slides and video screenshots of the actual websites. Example of letters, official emails and given replies will be at your disposal including all latest information for the United Nations to help you make your decisions on where/what to apply.</p><p>The course will last about 3 hours in lecture as there is a lot of information to cover and you will have access to me in the discussion panel should you have any further questions on the course, during and after.</p><p>If you take the time visit to the site Glass Door a website that has jobs review for various organizations, everyone agrees that the United Nations offers an awesome work environment and a rewarding career, but it is very difficult to get a job there. That is because there are a lot of applicants, the process is complex and you need to be best prepared, and after this course, you will be!</p><p>Signup and I&#039;ll see you inside.  As for all my other courses, if you are not satisfied I&#039;ll return your money, no questions ask.</p>", 
    "end_date": null, 
    "title": "Learn how to get contracts or a job at the United Nations", 
    "price": "35.00", 
    "instructors": "Mario Stinger", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472826_73b2_4.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-get-contracts-or-a-job-at-the-united-nations/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T14:27:54Z"
}