{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Have you ever wanted to get your App on the iOS/Mac App store?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Do you have no idea where to start?</strong>  </p>  <p style=\"\">  \t        Where do they start, I want my app on the app store?  </p>  <p style=\"\">  \t        Start the first steps to achieve your Apple development goals!  </p>  <p style=\"\">  \t        This course will teach you about Swift - Apple&#039;s newest programming language. Swift makes it alot easier to develop and understand App development so anyone can pick it up easily!  </p>  <p style=\"\">  \t        This course will focus on the fundamentals of Swift - to develop iOS/Mac apps you need a good foundation understanding of Swift first. After taking this course you will have a good understanding of Swift and will be ready to learn how to make iOS/Mac Apps!  </p>  <p style=\"\">  \t      What are you waiting for, every second more and more developers are earning money from their apps, why not you!  </p>  <p style=\"\">  \t      This course also comes with a 30-Day full refund if you are not satifised, what is there to lose!!!  </p>  <p style=\"\">  \t<strong style=\"\">All my courses include:</strong>  </p>  <ul style=\"\">  \t<li>Unlimited lifetime access to the course</li>  \t<li>Future bonus lecture&#039;s and materials to this course are always free</li>  \t<li>Unconditinal, no questions asked full 30 day money back guarantee</li>  \t<li>My help is always available - my support is legendary on UDemy and my Youtube channel</li>  </ul>  <div style=\"\">  \t<em style=\"\">Are you ready to take your first step in making iOS/OSX apps?</em>  </div>  <div style=\"\">  \t<em style=\"\">Do you want your App up in the app store for millions to download?</em>  </div>  <div style=\"\">  \t<em style=\"\">Errol today, every hour you delay is costing you downloads on your Apps ideas!</em>  </div>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Learn Swift A-Z Foundations to make iOS and OSX Apps!", 
    "price": "50.00", 
    "instructors": "Andrew Seeley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378286_34ff_3.jpg", 
    "course_url": "https://www.udemy.com/learn-swift-a-z-foundations/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T00:37:51Z"
}