{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Overview</strong></p><p>JavaScript is a programming language that can be run by all modern web browsers. It is downloaded alongside the HTML code of a webpage. Unlike HTML, which can only be used to display content, JavaScript allows web designers to add functionality and interactivity to their websites.</p><br style=\"\"><p><span></span><strong style=\"\">What you will learn</strong> </p><p><span></span>We will begin the course by learning where to write JavaScript. We will look at writing JavaScript directly inside an HTML tag, then inside of a &lt;script&gt; tag, and then finally in a file separate from the HTML document. We will discuss some of the reasons for using each method.</p><p>After that, we will learn about how to manipulate some basic data types. We will learn about how to do simple arithmetic, and also look at some of JavaScript&#039;s built-in mathematical capabilities. Then, we will learn about working with words and characters, using a data type known as the &quot;string&quot;. We will also cover the Boolean type, which is a representation of True and False inside of a programming language.</p><p>Then we will move on to more complex types. We will learn about the array, which is essentially a list. We will look at how to create arrays, how to access elements inside them, and how to modify the contents of an array. Functions will also be covered, which will allow us to organize code into simple, reusable pieces. We will also learn about objects, which are a way of grouping together data and behaviors.</p><p>We will then move on to control flow. We will look at the &quot;if&quot; statement, which allows the script to decide whether or not to execute a block of code based on some condition. We will also look at looping. Looping refers to repeatedly executing a block of code until some condition is met. Then, we will learn about errors, and how to handle them properly so that they do not halt execution of the script.</p><p>Next, we will look at the Document Object Model ( DOM ). This is what allows JavaScript to interact with the HTML code of a webpage. We will look at several ways of finding any particular HTML element on the page. Then we will see what information we can extract from that element (tag name, attributes,etc.). We will learn about adding and removing elements from a page. Finally, we will learn about events, which allows JavaScript to react to things like mouse clicks, mouse movement, key presses, and many others.</p><p>We will end the course with a practical exercise, in which we will build a simple JavaScript-based webpage. We will put to use most of the concepts covered in the course. We will look at how to validate user input, how to display results, and how to display meaningful error message to the user.</p><p><strong style=\"\">Prerequisites</strong> </p><p><u style=\"\">HTML</u>: The student must know how to use HTML tags and attributes. Only a very basic understanding of HTML is assumed.</p><p><u style=\"\">Google Chrome</u> (Recommended): Google Chrome is a free web browser and it will be</p><p>used to execute all the examples in this course. Although all browsers can run JavaScript, Chrome has extensive built-in developer tools. In the course, we will be using Chrome&#039;s JavaScript console, which will allow us to run quick little examples without the need to create and edit files.</p><p><u style=\"\">Notepad++</u> (Recommended): Notepad++ is a free, open-source text editor. Although JavaScript and HTML can be written using any text editor, Notepad++ is highly recommended because of features such as syntax highlighting and auto-complete. </p>", 
    "end_date": null, 
    "title": "Learn Essential Javascript Fundamentals", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483224_6da1.jpg", 
    "course_url": "https://www.udemy.com/learn-javascript-fundamentals-in-an-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T13:18:45Z"
}