{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>PART I</p><p>UPDATED!!! Experience Richard's dynamic and exciting teaching format, while learning both basic, intermediate, and advanced FileMaker development skills. With 26 years of FileMaker experience and a long time speaker at FileMaker's Developer Conference, Richard will teach you all the ins and outs of building FileMaker Solutions, while keeping an eye on customizing your own copy of a FREE Starter Solution! </p>\n\n<ul><li>Learn basic skills such as adding fields and managing layouts.</li><li>Learn intermediate skills, like script triggers, relationally connecting tables, and mastering the relationship graph.</li><li>Learn advanced skills like configuration and security of FileMaker Server.</li><li>Learning about deploying and hosting the database for hundreds of simultaneous users</li></ul>\n\n\n\n\n\n<p><br></p>\n\n<p>The work file for this software is a copy of FM Starting Point, which is a completely free and unlocked CRM. This free database works on Macs, Windows, iPads, iPhone and Android devices. We'll teach you how to customize it for your business needs while learning important FileMaker skills.<br></p>\n\n\n\n\n\n<p>This FULL course is a good step toward getting your FileMaker Certification. Remember this is part one of a two part course.</p>\n\n\n\n\n\n<p>For maximum awesomeness... this course will reference a number of third party products, a couple of books, etc. I make NO money in these references. During this course, we will also reference the use of FM Starting Point... to use as a free software... to anchor the development of your internal systems. You will be required to input your personal information to get this free software.</p>", 
    "end_date": null, 
    "title": "Learning FileMaker Pro 15 - Volume 1", 
    "price": "35.00", 
    "instructors": "Richard Carlton", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821390_41ce.jpg", 
    "course_url": "https://www.udemy.com/learning-filemaker-pro-15-volume-1/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T20:49:05Z"
}