{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t          Learn How To Use QuickBooks Online (in the Cloud) - Practical Training for the Small Business  User  </p>  <p>  \t<strong>Quizzes and Certificate of Completion!</strong>  </p>  <p>  \t          This “QuickBooks Online” (October 2014) Training is for Beginners who need to know how to enter transactions and generate reports using QuickBooks Online software by Intuit.  </p>  <p>  \t<strong>          John Whiteley, CPA and Certified Pro Advisor</strong>, and author will teach you how to set up your books in QuickBooks Online. John will demonstrate the steps needed in using all modules in the Online version of QuickBooks. Practical application are included in this valuable training.  </p>  <p>  \t          The lectures and demonstrations are provided in HD video format and allow the full screen presentation thus making it much easier to identify the menu details and data inputed into the screens.  </p>  <p>  \t          A text screen with a brief summary of the lecture, along with screen shots and the menu steps needed to retrieve the topic screens is presented at the end of each session. The text screens will save you time having to repeat the videos just to find where the menu link is for a particular screen mentioned in the training session.  </p>  <p>  \t          Each module is explored in detail so that you can see how your company file is set up; how your bank accounts are created in QuickBooks Online and connected to your actual bank accounts for downloading transactions, etc. Demonstrations are provided on how to enter your data in all the modules in QuickBooks Online; including, sales receipts, sales invoices,customer payments, expenses, checks, bills payable, payroll and much more. John also provides practical advice on using the software as you would expect from your local CPA.  </p>  <p>  \t        The student will have established a solid base for using QuickBooks Online upon completion of the course. At the same time , John emphasizes the importance of including your local CPA or Certified Pro Advisor in the set up of the chart of accounts and customized reports when accounting skills should play a part in the setup.  </p>  <p>  \t        Take this QuickBooks Online Practical Training and become confident in moving ahead with your bookkeeping system.  </p>", 
    "end_date": null, 
    "title": "Learn QuickBooks Online by John Whiteley, CPA", 
    "price": "50.00", 
    "instructors": "John Whiteley", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303206_282c_7.jpg", 
    "course_url": "https://www.udemy.com/learn-quickbooks-online-cloud/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T21:13:06Z"
}