{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"></strong>In this course, aspiring Nonprofit startups will learn to account for the legitimacy of their organizations by gaining the proper documentation in less time and less money than it took prior to 2014. Fortunately today&#039;s technology will allow applicants to complete virtually all of their filing online. Students will learn how to complete applications leading to tax exempt status online. This will allow donors to receive tax related credit as a reward for giving to your cause. Students will also learn how to develop a project budget summary. This is important because many people are denied funding because their budget does not line up with their proposed projects. Additionally students will learn about the pros and cons of securing a fiscal sponsor and how to get one.</p><p>Since this is a follow up course from How to Build Your Nonprofit Startup- Part 1, Students should have completed the exercises from that previous course. They will need to have access to their assignment results. Students need to be able to type info in Adobe PDF files in order to complete assignments within the system. They have the option to download and print those documents as well for manual completion. Students should be able to download, save and retrieve downloaded files to successfully complete course assignments.</p><p><strong style=\"\">The Course Structure</strong> includes: video lectures, quizzes, along with hands on assignments.</p><p><strong style=\"\">This Course may be completed</strong> in a 3 hours over the course of the number of days that it takes to receive feedback from applications.</p><p><strong style=\"\">Keywords include</strong>: nonprofit, startup,tax exempt, 501c3, 1023, fiscal sponsor, fiscal sponsorship, EIN, Articles of Incorporation, Tax ID</p>", 
    "end_date": null, 
    "title": "Learn How to Get 501c3 Tax Exempt Online", 
    "price": "50.00", 
    "instructors": "Dr. Margaret Jamal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473154_e8f2_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-get-your-tax-exempt-status-online/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T22:17:28Z"
}