{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Korean pronunciation explained in English, through in depth videos, examples, and self feedback. This is a course for Korean learners of almost all levels (beyond beginner). The course is made for those who have been learning Korean and found it very hard to get the pronunciation right - or find that native Koreans often can't understand them. This course will teach you not only what the perfect pronunciation is, but how to do it and how to give yourself feedback on your own pronunciation. </p><p>We do not use any linguistic terminology for the most part. Everything is explained in a way that is accessible to the average person, and yet is in depth enough that those who want to know the details will be satisfied as well. </p><p>Each lecture consists of an explanation section followed by a self feedback section (which is explained and demonstrated in the \"How to Use this Course\" video). </p><p>You can take your time with the course or go through it quickly - it is really up to you. But keep in mind that pronunciation is, like any exercise, something that involves the muscles of the throat and mouth and of course requires a lot of muscle coordination. Like with any sport or dance, the learning is just the beginning. Once you KNOW the dance, you have to go out and dance. Once you've got the sport's technique down, you have to go out and play. Likewise, with Korean pronunciation, once you know it, it's then time to practice, practice, practice and then get out there and use it in real life. <br></p><p>We hope you enjoy the course. Please utilize the Q&amp;A section in the course as well so that we can help resolve any confusion or add additional things if necessary. Enjoy the journey, friends. </p>", 
    "end_date": null, 
    "title": "Learn Korean Pronunciation-Guide to Actually Sounding Korean", 
    "price": "45.00", 
    "instructors": "Jeremy Brinkerhoff", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651928_8240_2.jpg", 
    "course_url": "https://www.udemy.com/learn-korean-pronunciation/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T01:37:10Z"
}