{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t         M.I.T. created Scratch 2.0 to be a programming language for kids aged 8-17.  </p>  <p>  \t  This course, Learn Scratch 2.0 for kids will teach your kids how to program in Scratch.  It will take things slow by showing specific examples that they can recreate for themselves.  Scratch 2.0 is a beginning level programming language course that anyone can take and learn.  While there is no &quot;real&quot; coding involved it does teach the basics of what is needed in a &quot;real&quot; programming language.  Plus it is a good foundation for those who want to learn to program for the mobile phones.  </p>  <p>  \t  The terminology in this course would be similar to what students would find in their normal coursework.  </p>  <p>  \t  No materials are included or needed except for the software which you can download for free.  </p>  <p>  \t  While this course could easily be finished in a week, this course should be taken over at least a month to get the most out of it.  It is expected that you should try to replicate everything you have learned in the lectures plus do all the quizzes.  It is also expected that you should experiment.  Try your own programs using what you just learned.  </p>  <p>  \t  While this course is mainly for kids 8-17, anyone can take this course.  This course would also be good for stay at home moms as well as grandparents who want to stay involved with their grand-kids.  </p>  <p>  \t  The course is structured as a series of videos explaining many of the &quot;functions&quot; of Scratch.  </p>  <p>  \t  Why should you take this course?  That is an excellent question and there are many reasons.  </p>  <p>  \t  Computer Programming is one of the only jobs you can get a high salary in without going to college.  In fact many businesses would rather have a high school student with many years experience than a graduate student with a Masters or PhD in Computer Science but little practical experience.  Many of the big names like Bill Gates and Steve Jobs dropped out of college and became famous for their programming skills.  </p>  <p>  \t  Example: You can&#039;t be a Nuclear Engineer without going to college because you can&#039;t have your own personal nuclear power plant at home but you can be a computer programmer.  Scratch is an excellent start at becoming a computer programmer because it introduces you to so many new concepts instead of trying to jump into the deep end of the lake.  </p>  <p>  \t  Example: You will learn what to do when two objects hit each other.  What to do when your object hits a wall or reaches a certain point.  These are all basic things that every programmer needs to know and understand.  Scratch teaches these basic things and then from there they can go on to more robust languages.  </p>  <p>  \t  So, if you want your child to get a good start at programming, then Scratch 2.0 is the right choice.  </p>", 
    "end_date": null, 
    "title": "Learn Scratch 2.0 for Kids", 
    "price": "40.00", 
    "instructors": "Markis Gardner", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/268618_bf6f_2.jpg", 
    "course_url": "https://www.udemy.com/learn-scratch-2-for-kids/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-25T13:07:35Z"
}