{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><em><strong>Updated Sept. 18, 2015!  5 New Videos Added...</strong></em></p><p>Dropbox and cloud storage offer some great ways and workflows to be more productive. </p><p>Our clear professional videos will address everything from:</p><ul><li>Providing a simple backup solution for your important files</li><li>Having a way to backup the photos you take with your iPhone or other smartphone</li><li>Giving you a way to share Large Files that are too big to email</li><li>Empowering you with a workflow to request files from clients and friends</li><li>Increasing your team productivity with file sharing</li><li>Enabling Two-Step Authentication for Security</li><li>Selectively syncing folders to your computer and leaving other folders on the internet</li><li>Synchronizing all of your important files on your computer, regardless of what folder they are in.</li><li>Using the Dropbox iOS app on iPhone, iPad, and iPod Touch. (Android App functions similarly)</li></ul><p>This course is perfect for everyone including:</p><ul><li>Those who are new to cloud storage</li><li>People who work on teams and projects with a lot of documents</li><li>Anyone who needs a simple and easy way to backup important files</li><li>People who want to be more productive with their file management</li><li>Users of Dropbox who want to go to the next level</li></ul><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Leverage Dropbox Cloud Storage to Boost Your Productivity", 
    "price": "20.00", 
    "instructors": "Arlen Nagata", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596560_154e_2.jpg", 
    "course_url": "https://www.udemy.com/leverage-dropbox-cloud-storage-to-boost-your-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T08:17:37Z"
}