{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "  <h4 style=\"\">LIFE ROOM. Giving you the Integrated Health tools of Mind Body Soul Medicine.</h4>     <div style=\"\">  \t<p style=\"\">  \t\tEmpowering individuals to Heal. Life Room Education Programs are for individuals facing either a terminal, chronic or life altering disease, who wish to embrace the power of Integrated Medicine and become active participants in their own healing.  \t</p>  \t<p style=\"\">  \t\tHistorically, society has embraced an either/or attitude when it comes to Modern Medicine or Alternative Medicine. Life Room believes, that we need to embrace both science and the power of Mother Nature, history and generations of ancient medicinal knowledge, to provide our bodies with the greatest opportunity to heal.  \t</p>  \t<p style=\"\">  \t\tThe core goal of The Life Room is, to provide individuals with the necessary skills to to embrace &#039;living now&#039; and to take personal responsibility to improve their quality of life and ultimately quantity of life.  \t</p>  \t<p style=\"\">  \t\tScience, now recognizes, that all of us have a great and largely untapped capacity to improve our own health and well-being through Body Mind and Soul Medicine (BMS). BMS incorporates nutrition, exercise, meditation, guided imagery, biofeedback, self-expression, to name just a few, of the long list of incredible options of healing tools we all have available to us.  \t</p>  \t<p style=\"\">  \t\tLife Room Living With Cancer Level 1 is the first of our Living With Cancer Series designed to empower you with information so that you can make some educated and informed decisions in dealing with your health and life journey  \t</p>  </div>  ", 
    "end_date": null, 
    "title": "LifeROOM: Mind Body & Integrated Healing ", 
    "price": "20.00", 
    "instructors": "Ana Kitson", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333834_dc1d.jpg", 
    "course_url": "https://www.udemy.com/liferoom-cancerdisease-l1/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T03:08:15Z"
}