{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t            &quot;Introduction to Living Well with Cancer &amp;  Disease&quot; is the foundation course for all Life Room Education Programs.  </p>  <p style=\"\">  \t            This course is for individuals facing either a terminal, chronic or life altering disease, who wish to embrace the power of Integrated Medicine and become active participants in their own healing.  </p>  <p style=\"\">  \t            Historically, society has embraced an either/or attitude when it comes to Modern Medicine or Alternative Medicine. Life Room believes, that we need to embrace both science and the power of Mother Nature, history and generations of ancient medicinal knowledge, to provide our bodies with the greatest opportunity to heal.  </p>  <p style=\"\">  \t            The core goal of The Life Room is, to provide idividuals with the necessary skills to  to embrace ‘living now’ and to take personal responsibility to improve their quality of life and ultimately quantity of life.  </p>  <p style=\"\">  \t            Science, now recognizes, that all of us have a great and largely untapped capacity to improve our own health and well-being through Body Mind and Soul Medicine (BMS). BMS incorporates nutrition, exercise, meditation, guided imagery, biofeedback, self-expression, to name just a few, of the long list of incredible options of healing tools we all have available to us.  </p>  <p style=\"\">  \t            Whilst we acknowledge that a terminal or even a non-terminal disease diagnosis is a tragic and terrifying thing for anyone. The current outlook in society is to fall into a depression and more often than not, give up hope.  </p>  <p style=\"\">  \t            Sadly in today’s society, most people’s individual belief systems, adopt the prognosis given to them by their medical professional, as gospel. There are many anecdotal stories of people being told they had 6 months to live and dying on the actual date six months later. Many people hand their lives over to well meaning medical professionals with limited resources, legal limitations and 50 other patients to find the magic bullet and heal them.  </p>  <p style=\"\">  \t            At Life Room, we know - how powerful you are and what incredible results individuals can achieve by taking personal responsibility !!  </p>  <p style=\"\">  \t            Our goal is to teach people to have healthy bodies and healthy minds during their healing journey. &#039;Introduction to Living Well with Cancer and Disease&#039; is the first step on your healing journey.  </p>", 
    "end_date": null, 
    "title": "LifeROOM : What is Cancer & Disease ", 
    "price": 0, 
    "instructors": "Ana Kitson", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284318_22dc_5.jpg", 
    "course_url": "https://www.udemy.com/living-with-cancer/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-20T08:03:18Z"
}