{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course is for SAP developers as well as SAP users. SAP developers get a local SAP system where they can practice what they’ve learned. They can write their first ABAP Report programs, create database tables, etc. The best thing is that they can do it in a safe environment where nothing can happen. SAP users can test how the system reacts in certain situations without the risk of destroying something in a production system.</p>  <p>Especially in SAP production systems there is a huge risk for huge damages if programs and configuration which is not working right gets there. Therefore it’s essential for people that are learning SAP to have an environment where they can safely play around and learn without the risk of destroying anything. A Local SAP system is also important for people that have no access to a running SAP system and want to practice.</p>  <p>In this course you’re going to learn how to install your own version of a Local SAP System (aka MiniSAP). This includes all necessary steps to get your Local SAP running. We will discuss prerequisites that are necessary for the installation. Then we will discuss how to install a Virtual Machine and the Java Runtime Environment which are necessary before we can install the SAP system itself. After that I will show you how to download and install the SAP system itself. We will install the Application Server as well as the SAP GUI. The SAP GUI is the graphical user interface with which you are connecting to a SAP Server. And finally we will configure the system. We will install the Trial License. Then we will set up a Developer User with a developer key which is necessary for you to write your programs.  And finally I will show you how to log on to the system.</p><p>The links to the SAP software that we're going to install are provided in the course and are free.<br></p>", 
    "end_date": null, 
    "title": "Local SAP: How To Install Your Own Local SAP Trial System", 
    "price": "20.00", 
    "instructors": "Ana Lekic", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639366_3aed.jpg", 
    "course_url": "https://www.udemy.com/how-to-install-your-own-local-sap-trial-system-minisap/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T15:47:15Z"
}