{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\"><em style=\"\"><em style=\"\">Course Updated 9th July 2015</em>. New <em style=\"\">section</em> added. Price: $79 USD</em></p><p style=\"\"><em style=\"\">Course Updated 3rd March 2015. New section added.- Price $49 USD</em></p><p style=\"\"><strong style=\"\">Do you want to have your App on the Apple Watch?</strong></p><p style=\"\"><strong style=\"\">Do you have no idea where to start?</strong></p><p style=\"\">Hi I am Andrew. 3 years ago I was in the same position as you and took an online course to learn to make iOS Apps.</p><p style=\"\">Begin here to start making your first Apple Watch App. Current price is $79 USD - this will go up as more content is added to the course which has already been planned!</p><p style=\"\">From a novice to a seasoned developer this course will give you access to <strong style=\"\">earn cash</strong> in the new Apple Watch store. Learn before launch and be one of the first in the App Store.</p><p style=\"\">This course will take you through developing several Apps for the Apple Watch. Over time more Apps and content will be added covering all aspects of the Apple Watch. All this future content is free for current students.</p><p style=\"\">You will to use the features of the Apple Watch such as:</p><ul style=\"\"><li style=\"\">Notifications</li><li style=\"\">Glances</li><li style=\"\">Connecting the Apple Watch app to your iPhone/iPad</li></ul><p style=\"\">All apps you develop in this course come with complete source code and permission to use them however you like! Change, and modify these apps to use however you like!</p><p style=\"\">This course comes with a free copy of my &quot;Learn Swift A-Z foundations&quot; valued at <strong style=\"\">$49 USD</strong>. This is the perfect companion if you are unfamiliar with Swift.</p><p style=\"\">By the end of this course you will be able to confidentially make your own Apple Watch apps, whatever you can imagine you can create.</p><p style=\"\"><strong style=\"\">All my courses include:</strong></p><ul style=\"\"><li style=\"\">Unlimited lifetime access to the course</li><li style=\"\">Future bonus lecture&#039;s and materials to this course are always free</li><li style=\"\">Unconditinal, no questions asked full 30 day money back guarantee</li><li style=\"\">My help is always available - my support is legendary on UDemy and my Youtube channel</li></ul><p style=\"\"><em style=\"\">Are you ready to take your first step in developing Apple Watch?</em></p><p style=\"\"><em style=\"\">Do you want to be among the first to be on the Apple Watch store?</em></p><p style=\"\"><em style=\"\">Enrol today, every hour you delay is costing you another App that could be ready for the Apple Watch app store!</em></p>", 
    "end_date": null, 
    "title": "Make Apple Watch Apps in Swift. Get into the App store.", 
    "price": "50.00", 
    "instructors": "Andrew Seeley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422340_0217.jpg", 
    "course_url": "https://www.udemy.com/learnapplewatchswift/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-15T05:58:43Z"
}