{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Want to make <strong>more friends</strong>? <strong>Renew old friendships</strong>? Get a more <strong>fun and active social life</strong>? Seek no further, we want, and can help you! As a student in this brand new course you will learn all the best practices on making friends and improving your social skills based on scientific research. You will <strong>get an answer</strong> to <strong>every question you ask</strong> in the course discussions and you will receive over 30 exercises to <strong>improve your social life and happiness</strong>.</p><p>We have been giving workshops on various social skills such as making friends, corporate trainings for influence and persuasion, flirting and dating for over 8 years. This is our first fully online course, and we worked really hard to make a strong course that helps you reach your social skills goals.<br></p><p>Some reviews from our other courses include:</p><ul><li><em>After taking the course I am often cheerful and it gives me a lot of energy. Also the drama class and single event group gives me a lot of satisfaction. After class we often go out for dinner, and I am no longer the shy guy that sits scary and quietly in the corner. I like to meet people now and have a conversation with them. I can really recommend this course to others. You can always make up an excuse not to do it, but the insights and lessons I got were extremely valuable. If you are not happy with your lifestyle, this is an excellent course! - </em>Paul.</li><li><em>\"The combination of theory and practical exercises proved to be very strong. Also the fact that the course does not only focus on how to, for instance, have a good conversation. It focuses on your whole lifestyle and therefore the results were amazing and lasting. I am really thankful and happy for taking this course.\"</em> - Daisy.</li><li><em>\"I found it a very good course. I really grew as a person, step by step. I found every week very useful with good exercises.\"</em> Evert.</li></ul><p><strong></strong></p><p>Research shows, and our clients tell us, that healthy social relationships is one of the most important things, or <strong>the most important thing we can do for our happiness and health</strong>. Research tells us that it doesn't matter if you are an introvert or an extravert: Having sufficient friends and good quality relationships makes people happier. But not only happiness is improved by getting better relationships, also confidence, less depression, less illness and more meaning are a proven result from having better and more friends. As a bonus, people who improve their social lives outside of work, tend to do better at work as well! </p><p>This course is geared towards getting as much of these benefits as possible. <strong>We want to help you become happier, more confident, less lonely and lead a more meaningful life by improving your social life!</strong></p><p>We gathered <strong>the latest research</strong>, the most proven methods <strong>on making and improving friendships and social skills</strong> mixed them with our experience in making workshops and designed this making-friends course for you. We helped many people with improving their social lives, join them and enrich your life!</p><p>Sign up for our making friends course by clicking the 'Take This Course' button on the top right.<br></p>", 
    "end_date": null, 
    "title": "Make Friends, Beat Anxiety and Improve Your Social Skills", 
    "price": "30.00", 
    "instructors": "Ruben de Boer, Jeroen van Dalen", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569554_029f_2.jpg", 
    "course_url": "https://www.udemy.com/make-friends/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T19:28:04Z"
}