{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Managing your Information using Evernote is an easy-to-understand but comprehensive 5-hour video course that introduces viewers to Evernote and then explains exactly how to use this popular application on a Windows, Mac, iPhone, iPad and/or Android mobile device. </p><p>In these video lessons, viewers learn different methods for efficiently creating and managing various types of Evernote content, as well as strategies for keeping Evernote data secure and private. Includes some additional more advanced information to help users customize and utilize this software (or app) in their personal and/or professional lives. This includes an emphasis on advanced uses for the Premium and Business versions of Evernote.</p><p>In addition to demonstrating specifically how to use each important feature and function of Evernote, this course explains how to sync Evernote information between computers and mobile devices, collaborate on the creation of content with others, share Evernote content with others, back up Evernote content to a cloud-based file sharing service, and customize the application using third-party add-ons.<br style=\"\"></p><p>About the Instructor:</p><p>Jason R. Rich is the author of more than 55 books, as well as a frequent contributor to numerous national magazines, major daily newspapers and popular websites. He&#039;s also an accomplished photographer. As an author, Jason R. Rich writes extensively about the iPhone and iPad, as well as many other topics of interest to small business operators, executives and entrepreneurs. Some of his recently published books and video courses include:<br style=\"\"></p><ul style=\"\"><li><em style=\"\">Your iPad At Work</em>, 1st, 2nd, 3rd and 4th editions (Que)</li><li><em style=\"\">iPad and iPhone Tips and Tricks</em>, 1st, 2nd, 3rd and 4th editions (Que)</li><li><em style=\"\">iPad and iPhone Digital Photography Tips and Tricks</em> (Que)</li><li><em style=\"\">Using Your GoPro Hero3+</em> (Video course from Que)</li></ul>", 
    "end_date": null, 
    "title": "Managing Your Information Using Evernote", 
    "price": "50.00", 
    "instructors": "QUE Videos", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468900_55cf_3.jpg", 
    "course_url": "https://www.udemy.com/managing-your-information-using-evernote/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T12:41:54Z"
}