{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>ExifTool is a powerful and versatile software tool for extracting metadata from many different kinds of files, as well as editing it. It's free and open-source, but it's also complicated and takes some effort to learn. This course starts with how to download and install the software, then goes on to how to view metadata in various ways and how to edit it. Beyond that, it covers advanced topics including configuration, copying data between files, conditional operations, and scripting. It looks briefly at the ExifTool Perl API and at ways to invoke ExifTool from other programming languages. </p><p>This course will especially benefit students and professionals in digital preservation and digital forensics. It discusses a real-life case study in using ExifTool to discover why a car player had trouble with certain MP3 files.<br></p><p>PDF resources give extensive and exact information on how to do the tasks shown in the lectures, as well as links to external resources. </p><p>Students taking this course should be familiar with a command line interface, such as the command shells on Unix, Linux, and OS X. You should be comfortable with doing simple software installation. Ability to write computer code isn't required, though knowledge of Perl is helpful for the more advanced topics.</p><p>Interaction is an important part of any course I offer, and I promise to be available for questions.<br></p>", 
    "end_date": null, 
    "title": "Managing metadata with ExifTool", 
    "price": "30.00", 
    "instructors": "Gary McGath", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/762520_b49d_2.jpg", 
    "course_url": "https://www.udemy.com/exiftool/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-14T20:20:34Z"
}