{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">** NOW with a $1.5m REAL LIFE CASE STUDY SHOWING YOU HOW THE TRIED AND TESTED PRINCIPLES IN THIS COURSE HAVE BEEN SUCCESSFULLY USED PREVIOUSLY.</strong>  </p>  <p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t  ** NOW INTRODUCING - A COMPLETE MARKETING PLAN WORKSHEET and detailed examples so you can create your own six-figure business.</strong>  </p>  <p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t<strong style=\"\">** NOW with over 20 pages worth of examples! - of different freelancer types and small businesses so you can get better insight on how to form your own value proposition and how to apply value principles to win customers.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Learn the true secrets of marketing</strong> that most marketers are not telling you (or don’t even know themselves).  </p>  <p style=\"\">  \t  Understand what it really takes to separate yourself and your business from the crowd.  </p>  <p style=\"\">  \t<strong style=\"\">Get discovered more readily and easily</strong>, and use tried and tested principles to find potential customers and convert them into clients.  </p>  <p style=\"\">  \t  In this course, not only will you learn how to create a great value proposition, but you’ll learn how to use your value proposition to find customers and turn them into paying clients.  </p>  <p style=\"\">  \t<strong style=\"\">This is a must-have course</strong> for any freelancer or small business owner.  </p>  <p style=\"\">  \t<strong style=\"\">Get a complete marketing plan</strong> worksheet with detailed examples and turn your freelance/small business into a six-figure operation.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Background:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Of a diverse sample of freelancers and small business owners surveyed:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">52% of respondents stated they had experienced difficulty in winning new clients in the last 6 months<br style=\"\">  \t</li>  \t<li style=\"\">64% of freelancers said they understood what is meant by Market Positioning, but interestingly 58% of freelancers said they had not considered putting a value proposition together for themselves<br style=\"\">  \t</li>  \t<li style=\"\">And a whopping 67% said that they were certain having a value proposition would help them win more business </li>  </ul>  <p style=\"\">  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p style=\"\">  \t<em style=\"\">If you don&#039;t differentiate yourself from the competition by identifying your market position, you&#039;ll have a hard time winning clients and getting great work.  </em>  </p>  <p style=\"\">  \t            Saying you&#039;re personable, authentic and have integrity or that your clients trust you because of your warm and friendly personality is not enough. This is an illusion and you&#039;ll be surprised to learn that every other freelancer or small business owner is saying this - just like you.<br style=\"\">  \t <br style=\"\">  \t <strong style=\"\"> You need a key differentiation that goes <em style=\"\">beyond</em> your ability to win your prospective client&#039;s trust</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">      The Key to Market Positioning is your Value Proposition </strong>  </p>  <p style=\"\">  \t                    By creating a value proposition, you can differentiate yourself from other freelancers in your space and win more business that is <em style=\"\">right</em> for you.  It&#039;s all about finding your niche.  </p>  <p style=\"\">  \t                    You may be currently working on building up your brand, or may have already had a decent amount of exposure, but if you&#039;re finding you&#039;re struggling to close sales or want to amplify and build upon your current exposure, you can accelerate your potential by creating a value proposition and applying sound value principles to your business.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">                  What this course covers</strong>:-  </p>  <p style=\"\">  \t          This course is intended for Freelancers or Small Business Owners providing services to customers.  </p>  <p style=\"\">  \t                    In this course, I will help you:-  </p>  <ul style=\"\">  \t<li style=\"\">With strategies for identifying your strengths and why customers should value you</li>  \t<li style=\"\">Turn those strengths into viable Value Propositions</li>  \t<li style=\"\">Worksheets for formulating your Value Proposition(s)</li>  \t<li style=\"\">Help you differentiate yourself from the competition</li>  \t<li style=\"\">Worksheets on strategies for finding potential customers</li>  \t<li style=\"\">Sound principles that you can apply to your own value proposition to help you create a strategy for turning potential customers into actual clients.</li>  </ul>  <p style=\"\">  \t          Note: This course will <strong style=\"\">not</strong> teach you <em style=\"\">how</em> to become a freelancer or small business owner. There are other courses on Udemy that will teach you how to do that. This course is about what to do to increase your potential of success  </p>", 
    "end_date": null, 
    "title": "Market Positioning for Freelancers & Small Business Owners", 
    "price": "20.00", 
    "instructors": "Khuram Malik", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/68008_28e3_6.jpg", 
    "course_url": "https://www.udemy.com/market-positioning-for-freelancers/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-22T13:07:34Z"
}