{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">El marketing eficaz de turismo de aventura requiere de estrategias amplias ejecutadas tanto en canales <em style=\"\">online</em> como <em style=\"\">offline</em>, así como una implementación organizada de detalles como creación de contenido, asociaciones y canalización; además de la medición, evaluación y actualización de las estrategias utilizadas. </p><p style=\"\">Personaliza este proceso paso a paso y adáptalo a las necesidades de tu empresa u operador de viajes de aventura.</p><p style=\"\"><strong style=\"\">Acerca de Julie Thorner, AdventureEDU Educator</strong></p><p style=\"\">Su experiencia de más de dos décadas en las &quot;trincheras&quot; de la gestión financiera de alto nivel y puestos de marketing han moldeado su singular acercamiento al marketing estratégico desde la perspectiva de negocios. </p><p style=\"\">Anteriormente se ha desempeñado como guía y ejecutivo de marketing. Ahora es socio de marketing para varias empresas de punta en el rubro de la recreación al aire libre. Julie enfatiza la importancia de una responsabilidad fiscal y rendición de cuentas efectiva, en conjunto con las nociones de estrategia, desarrollo y ejecución de un marketing eficaz. Julie se especializa en el nicho de recreación al aire libre y viaje de adventura, a su vez dentro de las industrias de turismo y viajes.</p>", 
    "end_date": null, 
    "title": "Marketing de Turismo de Aventura a Nivel Tour Operador Local", 
    "price": "50.00", 
    "instructors": "AdventureEDU .", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455130_877a.jpg", 
    "course_url": "https://www.udemy.com/marketing-de-turismo-de-aventura-a-nivel-tour-operador-local/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T20:58:15Z"
}