{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>\t<strong>You can easily be making over $160k working as a SDET.</strong> There are so few good Test Engineers in the world that the best ones can bring in this kind of money because there is a huge demand. Don't believe me, take a look at lecture 77 for the proof!</p>  <p>\t A complete guide for you to be able to master QTP/UFT. This will help you to establish a phenomenal automated testing foundation that will make the rest of your career easy. </p><p>Latest update in July 2015</p><p><strong>Here is what our students are saying</strong></p><p>\"Great Video I have ever seen on YouTube. You are so so clear and honest in presenting the material. I had no idea how important it is to use QTP from different angle, that is via scripting. Great Work and Thank You so so so much!\" -Mohammed</p><p>\"I dont know much about QTP. But I really love the way of your teaching. I am a just beginner of QTP. I am very eager to watch all of your videos. Just keep up the good work. And finally it is excellent.\" -Srikanth</p><p><strong>What you will learn</strong></p>  <p>\t 1. Create your very first automated test case</p>  <p>\t 2. Use descriptive programming</p>  <p>\t 3. Use data tables</p>  <p>\t 4. Identify all objects</p>  <p>\t 5. Work as an Automation Engineer at your job every day</p>  <p>\t 6. Write robust and easy to maintain UFT scripts</p><p>7. Learn how to work in an Agile environment as an Automation Tester</p><p>8. Learn Automation Testing skills for any tool</p><p>9. Debugging scripts</p><p>10. So much more...</p>This is the most complete QTP/UFT learning guide you will find on the web. You will only learn the skills and techniques that you will actually use on the job. We would never waste your time with outdated methodologies. Our content comes straight from recent and ongoing projects, which means that our material is completely up to date! You will learn the strategies utilized by the best IT companies.<p>\t You will learn everything about UFT/QTP so that you can build your very first automated test. In between, you will discover the necessary skills to reach the top of this industry. Before you know it, you will be the top automation expert at your job! Don't take our word for it, get started now!</p><p><strong>Bonus</strong></p><ol><li>The real interview script that landed us every single job as Automation Engineers.</li><li>An ebook, \"5 Steps To Creating Perfect Automation Testing Scripts\".</li><li>Real UFT/QTP functions to improve your skills right now. Developed on the job!</li><li>Access to the Keyword Driven Framework designed over 10,000 hours of automation testing</li><li>Access to a constantly evolving Automation Testing blog</li></ol><p><strong>And if you are not 100% satisfied, you can receive a full refund within 30 days of your purchase! You have absolutely nothing to lose.</strong></p>", 
    "end_date": null, 
    "title": "Master UFT/QTP and build your first real automation script!", 
    "price": "50.00", 
    "instructors": "QTP  Tutorial", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329940_d06e_2.jpg", 
    "course_url": "https://www.udemy.com/qtptutorialforebeginnersintrotouft/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T23:41:06Z"
}