{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">Prezi is a free, online presentation program comparable to Microsoft&#039;s PowerPoint. It uses the latest in cloud technology to allow you to save your presentation in one place and use it wherever you go. Prezi also integrates a variety of file types to let you present whatever you want, whenever you want.</p><p style=\"\">Mastering Prezi is an engaging and practical course that will teach you everything you need to know about Prezi. This course also discusses the advanced features of Prezi that will help you get an edge over the competition. It will help you learn in a quick, efficient way so you can begin creating presentations of your own!</p><p style=\"\">You will start off by getting introduced to Prezi so you know what it&#039;s capable of. You will learn how to leverage Prezi&#039;s simple, easy-to-use features to make presentations that will not only engage your audience but also impress them and inspire them. You will be able to help visualize a process or flowchart and share it with your viewers. It demonstrates how to show effects and produce professional-grade content templates. Prezi will also help you with other aspects of presenting such as embedding YouTube videos and making handouts of your presentation. By the end of the course, you will be able to create amazing presentations with ease.</p><p style=\"\"><strong style=\"\">About the Author<br style=\"\"></strong></p><p style=\"\"><strong style=\"\">Minh Thompson</strong> is an avid blogger, YouTuber, and graphics designer. If he&#039;s not trying out the latest video game or tech gadget, he&#039;s probably trying to master texting on his archaic cell phone. You can reach him on his YouTube channel InvaderMEEN.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Mastering Prezi", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468928_fcfb_3.jpg", 
    "course_url": "https://www.udemy.com/mastering-prezi/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T13:32:12Z"
}