{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Probably you received many times <strong>business documents that looked great.</strong> They were professional made and made you think about that business as a great one.</p><p>If you are like most small business owners you said yourself \"<em>It looks awesome, it would be great for me to have something like this, just that I cannot design them by myself and I also cannot afford to pay a professional graphic designer</em>...\"</p><p>This is true... and not. It is true that paying a designer to create your professional documents can cost you a lot of money.</p><p>But it is not true you cannot <strong>do it by yourself.</strong></p><p>Since the <strong>documents you use for your business are one of the most visible </strong>type of materials a business have, having your own professional looking usually helps a lot in <strong>positioning you as an authority in your niche</strong> (asumming you have quality products that can help people get results).</p><p>This course is a beginner course on <strong>how to create professional looking business documents by using Canva</strong>'s free tool. It is intended for people who want to position themselfes, their products ans services and be seen as an authority (like ...\"<em>these guys are good, look what stunning letter documents they use...\"</em>)</p><p>And to also capture attention immediately with your offer.</p><p>You don't need any graphic design experience, just s<strong>tart from zero and create amazing business documents</strong> that look awesome.</p><p>You will learn</p><ul><li>how to use the design dashboard,</li><li>how to add images,</li><li>how to format the text areas,</li><li>how to find out already prepared text blocks that look professional,</li><li>how to add shapes, graphic objects, frames, lines, illustrations</li><li>the most important types of documents and letters study case,</li><li>how to export your documents projects from Canva to print or email them.</li></ul><p>By taking it, you will be able to understand and master the art of creating high quality business documents in the step by step demonstrations.</p><p>In your own pace.</p><p>Since any business communication document is a <strong>visual content</strong>, an engaging one will <strong>improve the way other people see your business</strong>.<br></p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about creating this kind of business documents in minutes, for free and without any previous graphic experience.<br></p><p>The course can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next...<u><strong> click the Take this Course button</strong></u> top right and you'll be taken to our secure payment page.</p><p>Just <strong><em><u>Enter Your Regular Details</u></em> </strong>and complete your investment to have immediate access.<br></p><p>Stop struggling with boring business documents people igmore and <strong>start </strong><strong>mastering business documents</strong>, just like a pro!</p><p><strong>Thank you for reading this and learning about my course</strong> ... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE </strong>to get started!<br></p>", 
    "end_date": null, 
    "title": "Master Professional Business Documents Like a Pro", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660044_c529_3.jpg", 
    "course_url": "https://www.udemy.com/great-looking-business-documents-in-canva/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T14:01:14Z"
}