{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>JSON is evolving as one of the best open format for data interchange for all purposes. One can use JSON for storing any kind of data, client server exchange of data or for creating configuration file. It has already challenged XML from its current leadership position for similar purpose. It is slim. It is programmer friendly and is also good enough to be human readable. This course gives you sufficient insight for creating your own json files and to use the json reading and writing using common use cases in javascript, PHP, java, c#, android etc. This course is structured as -<br></p><ul><li>All theory required to understand the format.</li><li>Activities as self evaluation sheets and quizzes.</li><li>Live screen-cast examples for creating Data in this format.</li><li>Live screen-cast examples in learning to parse and update data using javascript, AJAX in javascript, PHP, java, C# in asp,net, Android etc.</li><li>JSON validation schema overview has also been given.</li><li>Lots of reference links have been provided.</li></ul><p>Every modern programmer will need this course to do successful and efficient programming in any environment he or she is working in. This data interchange format is open and language independent.</p><p>In roughly 2 hours I promise you to convert from a Novice to an expert. If I fail to deliver my promise, you have full right to take the refund as per udemy policy.</p>", 
    "end_date": null, 
    "title": "Mastering JSON - Java Script Object Notation", 
    "price": "20.00", 
    "instructors": "Sunmitra Education", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678154_cdbc.jpg", 
    "course_url": "https://www.udemy.com/mastering-json/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T12:25:55Z"
}