{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course teaches Simulink, from the basics (beginning with installation) through advanced topics (Simulink for embedded systems). Here is a sampling of topics that I cover in this course:</p><ul><li>Installation &amp; Setup</li><li>Creating Models &amp; Running Simulations</li><li>Basic Building Blocks</li><li>Libraries</li><li>Masks</li><li>Stateflow</li><li>Implementing Common Algorithms</li><li>Troubleshooting, Errors, &amp; Diagnostics</li><li>Datatypes &amp; Sample Rates</li><li>Solvers</li><li>Simulink for Embedded Systems</li><li>Integration with m-file Scripts</li><li>Signal Routing, Naming, &amp; Logging</li><li>And more!</li></ul><p><span></span></p><p>By the time you complete this course, you will be well-prepared to effectively use Simulink for a range of tasks, including the following:</p><ul><li>Running simulations for school projects</li><li>Academic research</li><li>Compiling models to embedded systems/controlling hardware</li></ul><p><span></span></p><p>You will also have the skills to understand and resolve some common challenges with Simulink and to build systems that scale well for use in commercially viable systems. Some years ago while I was in graduate school, I switched from running my simulations in Matlab scripts to using Simulink - and became far more productive! I found that I was able to focus on what I wanted to simulate instead of getting bogged down in the implementation. Prior to switching to Simulink, I spent a lot of time debugging my simulation scripts. After switching to Simulink, I spent far less time debugging and was free to focus on getting results. For the past several years in industry, I've continued to use Simulink for both simulation and embedded hardware, and it has hugely enhanced my productivity. I hope that you too experience huge gains in productivity as you use Simulink, and I intend for this course to help you achieve those gains!</p><p>*Disclaimer: after publishing this course, I learned that a book entitled \"Mastering Simulink\" was published a number of years ago. This course is not associated with that book.</p>", 
    "end_date": null, 
    "title": "Mastering Simulink: the Definitive Step-by-Step Introduction", 
    "price": "20.00", 
    "instructors": "David Nodland", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690776_7819.jpg", 
    "course_url": "https://www.udemy.com/mastering-simulink/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T05:26:45Z"
}