{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">In the previous module, <strong style=\"\">Key 2, Task Links Part A</strong>, the mechanics of linking tasks was covered.  In this course module, <strong style=\"\">Key 2, Task Links Part B</strong>, the application of the task linking feature in Microsoft Project is covered by the discussion of two important task scheduling tools: The Critical Path Method, and Task Outlining.  </p><p style=\"\">Microsoft Project automatically performs the complex <strong style=\"\">Critical Path</strong> calculations within the tool, thus this course covers how it does that, and how to use the Critical Path feature to improve the management of your project schedule. </p><p style=\"\">Additionally this course module covers the all important <strong style=\"\">Outlining feature</strong>, as with task outlining being built into Microsoft Project you have a powerful and easy way to decompose your projects down to the needed level of detail to be able to monitor and control your projects, while also providing the ability to rollup your project schedules to high level summary tasks which are beneficial for management reporting.  </p><p style=\"\">All of this is covered in detail in this important Microsoft Project course.  Watch and understand key features for mastering the Critical Path and Outlining features you need to be an effective project scheduler.</p>", 
    "end_date": null, 
    "title": "Microsoft Project: The Five Keys - Key 2 Task Links (Part B)", 
    "price": "20.00", 
    "instructors": "F. Kevin Gaza", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44576_f7c9_12.jpg", 
    "course_url": "https://www.udemy.com/gazamethod_fivekeys_key2b/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-03T18:21:00Z"
}