{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In today&#039;s day and age, Microsoft Excel is fully integrated in all businesses. Mastering its functionality is not only recommended, it is <em style=\"\"><strong style=\"\">required</strong><strong style=\"\"></strong></em>.</p><p>&quot;<em style=\"\">Microsoft Excel For Business Professionals</em>&quot; is not your average Excel course. What sets this course apart is its <strong style=\"\">business centric focus</strong>. Frankly- if you are looking for complex macros or building information databases- this course is not for you. </p><p><strong style=\"\"><em style=\"\">This course is specifically tailored for those working in some form of business capacity. </em><em style=\"\">If you want to develop Excel skills applicable to any trade/business, instantly boost your resume, and o</em></strong><strong style=\"\"><em style=\"\">utperform your peers, then this course is for you.</em></strong></p><p>My name is Calvin and I am the instructor for this course. I have been fortunate to be employed by arguably the largest professional services firm in the world with high profile clients such as Disney, Edison International, Nike, Dreamworks, and Fox- many of which I have had the opportunity to work directly with. </p><p>While these high profile clients may seem glamorous, I am down in the trenches- preparing and reviewing workpaper after workpaper, spreadsheet after spreadsheet. Naturally throughout my experience, I have seen a common thread of Excel tips, tricks, and best practices that companies across the board use. Mastering these skills is an important addition to any business professional&#039;s arsenal of skills. Through step by step guides, downloadable spreadsheet, and project based examples, this course will impart this knowledge to you.</p><p>By taking this course you will be able to:</p><ul style=\"\"><li>Analyze and Manipulate Data</li><li>Execute beginner and Intermediate Excel Functions</li><li>Perform Business Centric Excel Formulas</li><li>Save Time and Effort in Your Work</li><li>Prepare Standardized/Properly Referenced Workpapers</li><li>... Become a Better Business Professional!</li></ul><p>So what are you waiting for? With Udemy&#039;s 30 day money back guarantee, you have nothing to lose!</p><p></p><p>---------------------------------------------------------------------------------------------------------</p><p><strong style=\"\">What Business Excel Really Means:</strong></p><p>I&#039;ve received a lot of questions on what Excel for Business really means. Using Microsoft Excel in a business setting can be boiled down to three broad categories:</p><p><strong style=\"\">Data Manipulation</strong></p><p> How do you take large data sets and extract the information you need? Furthermore, how do you take the information you need and forecast results? Using Excel in a business setting is about taking raw data and transforming it meaningful information. Many of these functions and calculations are already baked into the Excel software.</p><p><strong style=\"\">Efficiency</strong></p><p> When you&#039;re working with thousands of transactions and billions of dollars, Excel can perform calculations in seconds which otherwise would take hours manually. Using Excel correctly can not only save you countless number of hours, but also, can save your company countless number of dollars. </p><p><strong style=\"\">Model Building</strong></p><p> There are three keys in building a strong model- flexibility, results, and clarity. Flexibility means that a user can change any inputs and the model will automatically calculate a new result. Whether it&#039;s forecasts or estimates, inputs are always changing. Building a model that can accommodate that is the foundation to any good model. Secondly, you must learn to present information in a clear, concise, and visually appealing manner. If someone can&#039;t understand, it won&#039;t matter how good your model is. Lastly, you must build a model that not only applies the correct logic, but can you give information that solves problems. </p><p></p>", 
    "end_date": null, 
    "title": "Microsoft Excel for Business Professionals", 
    "price": 0, 
    "instructors": "Calvin Liu", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492224_13df_8.jpg", 
    "course_url": "https://www.udemy.com/excelforbusinessprofessionals/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-03T00:22:27Z"
}