{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong></strong></p><p><strong></strong></p><p>In deze training leer ik je jouw brein veel beter te gebruiken! Je leert hoe je eenvoudig méér kunt onthouden! Hoe je makkelijker kunt leren, overzicht houden, notuleren, brainstormen en meer, veel meer!</p><p>Mijn brein is veel beter gaan werken sinds ik het mindmappen mij eigen heb gemaakt. Ik ervaar geen chaos meer in mijn hoofd, terwijl ik genoeg met mijn brein doe.</p><p>Ik gun jou ook een perfect werkend brein en zal er in deze training alles aan doen om dat te bewerkstelligen!</p><p>Wat krijg je zoal:</p><ul><li><strong>Meer dan 6 uur training!</strong></li><li><strong>Leer van dé bewezen Mind Map Expert Ruud Rensink!</strong></li><li><strong>Toepasbaar op papier én digitaal!<br></strong></li><li><strong>Niet tevreden? Geld terug!</strong></li></ul>  <p><strong><br></strong></p><p>  \t<strong>LET OP: </strong>  </p>  <p><strong>eenmaal ingeschreven is levenslang gebruik kunnen maken van de training!</strong></p>  <p>  \t<br>  \t  </p>  <p>  \tDeze training leert je <strong>alles</strong> over Mind Mapping:  </p>  <ul>  \t<li>WAAROM werkt het zo goed?</li>  \t<li>HOE maak je een effectieve Mind Map? </li>  \t<li>WAT kan je er mee?</li>  </ul>  <p>  \t                                                                                                  Dat zijn de zaken die in deze training aan bod komen zodat jij al tijdens de training en voor de <strong>rest van je leven</strong> deze techniek <strong>optimaal kunt gebruiken</strong>!  </p>  <p>  \t                                                                                                  Of dat nou <strong>zakelijk </strong>is, in het <strong>onderwijs </strong>of <strong>privé </strong>maakt niet uit. Jij leert in deze training op de <strong>perfecte </strong>manier Mind Mappen en kan dat te pas en onpas toepassen, waar en wanneer je maar wilt.  </p>  <p>  \t                                                                                            Aan het einde van deze training heb je geleerd hoe je effectieve Mind Maps kunt maken die je <strong>geld </strong>kunnen <strong>besparen</strong>, die je <strong>sneller</strong>, <strong>beter </strong>én <strong>leuker </strong>kan laten <strong>leren </strong>én waarmee je <strong>makkelijker</strong> en <strong>meer</strong> kunt <strong>onthouden</strong>!  </p>  <p>  \t<strong><em>                        IEDEREEN KAN HET LEREN!  </em></strong>  </p>  <p>  \t                                                                                          Of je nu studeert, een professional bent, of je gewoon een nieuwe techniek wilt aanleren als hobby, je wordt constant geconfronteerd met een enorme hoeveelheid aan informatie.  </p>  <p>  \t                                                                          De hoeveelheid informatie waar je enkele honderden jaren geleven in je hele leven mee werd geconfronteerd, komt nu in slechts één week voorbij. Veel mensen ervaren dat als een enorme stress!  </p>  <p>  \t                                                  Mind Mappen is een perfect instrument waarmee je stress kan voorkomen!  </p>  <p>  \t<strong><em>      OPTIMAAL RENDEMENT EN PLEZIER  </em></strong>  </p>  <p>  \t                                                                    Deze training gaat veel verder dan wat kleurrijke takken tekenen, zinnen er op plaatsen en klaar is je Mind Map. Nee, deze training leert je op de <strong>juiste </strong>manier te Mind Mappen zodat je <strong>optimaal rendement</strong> haalt uit de techniek.  </p>  <p>  \t                                                                    De ervaringen met de duizenden deelnemers aan deze training is dat ze meer plezier krijgen in leren, dat ze meer plezier krijgen in vergaderingen, brainstorms en andere zakelijke werkzaamheden. Zij ervaren dagelijks de voordelen van het Mind Mappen juist omdat ze déze training hebben gevolgd.  </p>  <p>  \t                                                                    Wij duiken met u in de processen WAAROM het juist zo goed werkt. Geen 'neem dit nou maar van mij aan'- niveau of 'dat hebben we nou eenmaal zo afgesproken', nee u ervaart zélf waarom het zo goed werkt.  </p>  <p>  \t                                                                    Alle onderdelen in deze training zijn als vele jaren in trainingen gebruikt en scherp gesteld. De ervaringen van de trainers en de duizenden cursisten is er in verwerkt. Alle overbodige ballast en onzinverhalen is er uit gesneden en wat overblijft is een training die perfect uitgebalanceerd is. En leuk is!  </p>  <p>  \t                                                                    '<em>Ik kan niet tekenen </em>' zeggen mensen wel eens, of '<em>ik ben niet creatief </em>'. Welnu, dat hoeft geen belemmering te zijn om deze training te volgen. Sterker nog, <strong>Iedere deelnemer</strong> haalt het <strong>maximale uit zichzelf</strong> dank zij <strong>deze training</strong>, of je jezelf nou creatief vindt of niet. Onze lesmethode maakt dat je alle potentieel die je in je brein hebt volledig gaat benutten!  </p>  <p>  \t<strong><em>        REACTIES ZIJN UITERMATE POSITIEF  </em></strong>  </p>  <p>  \t                                                                    Reacties van eerdere deelnemers zijn vaak verbazend. '<em>Dat ik dit in me heb</em>'. '<em>Dat ik bijna die hele presentatie kan terughalen is haast onbegrijpelijk, en ik kan het!</em>'. '<em>Ik heb niet meer zoveel plezier aan tekenen beleefd sinds vroeger</em>', zei een IT-manager. Ook hij ervoer enorme voordeelen bij het Mind Mappen, op papier!  </p>  <p>  \t                                                    \"<em>Voor mij was de training achteraf bezien best confronterend. De bewustwording die hierdoor bij mij is opgewekt begin effect te krijgen. Door deze training ben ik mijn creativiteit verder gaan ontplooien. Bedankt voor de goede training</em>\".  </p>  <p>  \t<strong><em>        JE LEERT INFORMATIE TE VERWERKEN OP EEN ANDERE MANIER:<br>  \t                                                    EEN SNELLERE BETERE ÉN LEUKERE MANIER!  </em></strong>  </p>  <p>  \t                                                Heel veel mensen geven aan dat ze het jammer vinden dat ze deze techniek niet eerder hebben geleerd. Het had ze enorm veel tijd kunnen besparen in hun studie. Of het had ze meer rust gegeven tijdens het werk, of meer overzicht.  </p>  <p>  \t                                                Maar of je nu 8 bent of 18 of 48 of 78, iedereen heeft baat bij deze training. Zolang er grote hoeveelheden informatie langskomen ervaar je constant de voordelen van het Mind Mappen.  </p>  <p>  \t<strong><em>    STUDIE  </em></strong>  </p>  <p>  \t                                                De kennis &amp; ervaring van vele jaren zelfstudie, de duizenden euro's die ik uitgeven heb voor trainingen bij de bedenker van deze techniek, de duizenden cursisten die ik getraind heb en de duizenden uren die ik besteed heb aan het Mind Mappen voor mezelf, in mijn bedrijf en voor mijn studies, zitten allemaal verwerkt in deze training.  </p>  <p>  \t                                                Al mijn kennis en ervaring biedt ik jou aan een deze uitgekiende training, die je in je eigen tijd en op je eigen gewenste plek kunt volgen.  </p>  <p>  \t                                                Ik durf je optimaal rendement te garanderen, zoveel vertrouwen heb ik in deze techniek én deze training. Maar, kies er bewust voor.  </p>  <p>  \t<strong>Ik beloof je géén tovermiddel, want dat is Mind Mappen niet!</strong>  </p>  <p>  \t                                                 Net zoals met autorijden, badmintonnen, fietsen, koken, lesgeven, schrijven, en andere vaardigheden, je zal er tijd in moeten stoppen om er goed in te worden. En net zoals ik veel tijd gestopt heb om een Expert in Mind Mappen te worden, kan jij dat ook!  </p>  <p>  \t                                                Denk niet van 'ik volg even deze cursus en ik ben een expert' want zo werkt het niet. Managementgoeroe 'Stephen Covey' zei ooit: \"this workshop begins after today\".  </p>  <p>  \t                                              Volg deze training en gebruik overal Mind Maps voor. Juist dan zal je steeds meer de voordelen gaan ervaren en het plezier er aan beleven. En, net zoals ik na langere tijd heb ervaren, zal je brein beter gaan functioneren, een fraaie bijkomstigheid!  </p>  <p>  \t                                              Het klinkt somt te mooi om waar te zijn? Welnu, daar kan ik inkomen. Maar, ik laat je ervaren dat Mind Mappen veel dichter bij jouw eigen natuurlijke manier van denken zit dan andere technieken. En juist daarom ga je die voordelen ervaren, dat weet ik zeker!  </p>  <p>  \t<strong>NIET GOED, GELD TERUG!</strong>  </p>  <p>  \t            Ben je niet tevreden over deze training, dan krijg je je geld terug! Binnen 30 dagen kan je dit aangeven en wordt je geld teruggestort, zonder voorbehoud!  </p>  <p>  \t<strong>  Heel veel plezier met deze training en het in de praktijk gebruiken van Mind Maps!  </strong>  </p>  <p><br></p>  <p>  \t        Schrijf je NU in door op de knop rechtsboven 'Take This Course' te klikken en ga gelijk SLIMMER aan de slag!  </p>  <p>  \t        Veel plezier en succes!  </p>  <p>  \t        Ruud Rensink  </p>", 
    "end_date": null, 
    "title": "MindMappen: voor een veel beter werkend brein!", 
    "price": "45.00", 
    "instructors": "Ruud Rensink", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280424_6d2d_5.jpg", 
    "course_url": "https://www.udemy.com/slimmermetmindmaps/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T20:18:28Z"
}