{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Perché è importante curare il design? </strong></p>\n\n<p>Per avere successo un’applicazione ha bisogno di essere bella. Sì, hai capito bene. Bella. Non bastano più – e forse non sono mai bastate – le sole funzionalità.</p>\n\n\n\n\n\n<p>Ogni utente spende poco più di una manciata di secondi nella scelta di un’applicazione: entra nella preview, osserva gli screenshot in primo piano, leggiucchia le prime 2-3 recensioni e poi va via. O scarica l’applicazione.</p>\n\n\n\n\n\n\n\n<p>In questo tempo così limitato, il problema principale è convincere l’utente che la tua applicazione vale. Ma come fargli capire che la tua app merita di essere comprata, scaricata ed amata?</p>\n\n\n\n\n\n\n\n<p>Semplice. Rendendo accattivante la tua applicazione.</p>\n\n\n\n\n\n\n\n<p>È tutta psicologia: quante volte ti è capitato di scartare un’applicazione solo perché “a pelle” non ti trasmetteva nulla? Quante volte hai scartato un’applicazione perché sullo store ce n’era una più “bella”?</p>\n\n\n\n\n\n\n\n<p>Tantissime, sicuramente.</p>\n\n\n\n\n\n\n\n<p>No. Non sto parlando solo di estetica. “Bella” negli Store è sinonimo di “accreditata”, “seria”.</p>\n\n\n\n\n\n\n\n<p>Se un’applicazione è esteticamente piacevole, sembrerà automaticamente professionale e seria. Ciò porterà un utente a scaricare il tuo prodotto anziché quello concorrente. Un’applicazione rozza, non curata e dal design scadente porterà gli utenti ad accostare questi aggettivi anche alle funzionalità.</p>\n\n\n\n\n\n\n\n<p>Morale della favola?</p>\n\n\n\n\n\n\n\n<p>Puoi creare l’app del secolo, ma senza curare il design raramente emergerà e si distinguerà tra le milioni di app esistenti.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Perché seguire questo corso?</strong></p>\n\n\n\n\n\n<p>Questo è il primo ed unico video-corso di Sketch in Italiano dell'intero web, ed in oltre 50 lezioni ti insegnerò come usare questo potentissimo software per creare bellissime interfacce per le tue applicazioni, ma anche icone e loghi con i quali distinguerti e presentarti sul mercato.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>Non hai bisogno di nessuna conoscenza pregressa.</em></strong> Sì, hai capito bene. Parto dal presupposto che tu non abbia mai aperto un programma di grafica digitale in tutta la tua vita. Neanche per modificare le foto della vacanza al mare. Ti spiegherò tutti i dettagli, i trucchi e le sottigliezze senza mai dare nulla per scontato.</p>\n\n\n\n\n\n\n\n<p>Sono una persona che non ama perdersi nelle teorie, ed è per questo che il corso è pensato per farti fare pratica fin da subito. Già dalla seconda lezione inizierai ad imparare le diverse funzionalità del programma sporcandoti le mani. Niente chiacchiere inutili. Ma tanta, tanta, tanta pratica e know-how.</p>\n\n\n\n<p><strong>Perché Sketch 3?</strong></p>\n\n\n\n<p>Sketch 3 – sviluppato da Bohemian Coding – è il programma award-winning che negli ultimi anni è diventato il must-have del settore.</p>\n\n\n\n\n\n<p>Statistiche hanno dimostrato che, ad oggi, Sketch è il primo programma usato dai designer per la creazione di interfacce (il 34%) mentre Photoshop si piazza al secondo posto con solo un 29%. Il restante 37% è invece frammentato in una moltitudine di programmi diversi, nessuno preponderante.</p>\n\n\n\n<p>So cosa stai pensando in questo momento: “beh, il 5% in più non è un grande distacco”. E invece no, è un distacco di proporzioni epiche se tieni in considerazione che Sketch è un programma relativamente nuovo, sul mercato da qualche anno, mentre photoshop è il gigante incontrastato della grafica digitale, sul mercato da interi decenni.</p>\n\n\n\n\n\n<p>Come Sketch è riuscito a superare Photoshop nel design delle interfacce? Perché è semplice, intuitivo ed user-friendly. La sua semplicità però non è da ostacolo alle sue funzionalità: Sketch si presenta come un software potente che nulla ha da invidiare ai giganti sul mercato.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Mobile App Design con Sketch 3", 
    "price": "50.00", 
    "instructors": "Giada Di Somma", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841908_fbf4_3.jpg", 
    "course_url": "https://www.udemy.com/mobile-app-design-con-sketch-3/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-07T07:32:25Z"
}