{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><br style=\"\">  </strong></p>    <p style=\"\"><strong style=\"\">Learn how to detect and prevent fraud!</strong></p>    <p style=\"\">Mortgage fraud costs lenders - and consumers - billions of dollars every year! Protecting yourself and your company could be as simple as one-or-two clicks and 60 seconds of double checking a small detail. <strong style=\"\"><em style=\"\">But nothing is small when it comes to fraud!</em></strong></p>    <p style=\"\">Learn the &quot;tricks of the trade&quot; from a 30-year industry veteran and certified fraud expert who has investigated and worked on some of the largest fraud cases in the country - <strong style=\"\"><em style=\"\">and how catching little oversights could have prevented millions of dollars in losses. </em></strong></p>    <p style=\"\">Designed for lending professionals, including compliance, loan originators, processors, underwriters, closing staff and mortgage executives - this 60-minute training provides an inside look at mortgage fraud schemes and trends.</p>    <p style=\"\"><strong style=\"\">Program includes specific details on:</strong></p>    <p style=\"\"><strong style=\"\">• Mortgage fraud trends and current schemes being used</strong></p>    <p style=\"\"><strong style=\"\">• Purchase &amp; refinance schemes - including short sale flops &amp; identity fraud</strong></p>    <p style=\"\"><strong style=\"\">• How to properly check identification of borrowers &amp; supporting documents</strong></p>    <p style=\"\"><strong style=\"\">• Typical &quot;Red Flags&quot; of the 1003 application, and other warning signs </strong></p>    <p style=\"\">Training looks at signature analysis (actual case study), the legal side of fraud, your individual liability, compliance procedures, CFPB and SAR reporting, and the penalties for fraud.</p><p style=\"\">Presented by best-selling author, mortgage fraud &amp; industry expert Chip Cummings. &nbsp;This course includes actual fraud examples, transcript, PDF manual and bonus materials/resources. &nbsp;Also includes Q&amp;A from industry attendees on the LIVE presentation!</p>    <p style=\"\"><strong style=\"\"><em style=\"\">This quick course is a MUST for anyone involved in mortgage lending or the world of real estate!</em></strong></p>    <p style=\"\"><strong style=\"\">BONUS DOWNLOAD - Attendees receive a downloadable state-by-state identification and online resource guide!</strong></p>  ", 
    "end_date": null, 
    "title": "Mortgage Fraud Prevention & Detection", 
    "price": "40.00", 
    "instructors": "Chip Cummings", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65897_39d7_3.jpg", 
    "course_url": "https://www.udemy.com/mortgage-fraud/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-16T13:32:40Z"
}