{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tThis <em>Intermediate</em> <em>Course</em> is the second of a series of courses that take the student from the very beginnings of musical understanding to getting an \"A\" in a college music theory class. You do not have to be a college student to take this course, but by the time you finish the series, it will be as if you had taken several semesters of classes. If you are going to take college music classes, this series will save you a considerable amount of stress and maybe even some tuition money.  </p>  <p>  \t      The <strong>Fundamentals Course</strong> covers Pitch, Staff Notation, the Piano Keyboard, Modes, Major Scales and Key Signatures.  </p>  <p>  \t      The <strong>Intermediate Course</strong> covers Intervals, Minor Keys and Scales, Triads, Seventh Chords, Figured Bass, Roman Numeral Analysis, Time Signatures, Meter, Rhythm, Melodic Dictation  </p>  <p>  \t      The <strong>Advanced Course</strong> covers 4-part (SATB) Voice Leading,  Musical Analysis, and Chromatic Harmony.</p>  <p>  \t      The Lectures can be viewed in an afternoon. However, as with many subjects, it is the consistent practice that internalizes the knowledge so that it becomes second nature. To this end I have included dozens of worksheets and audio files for practice with each lesson. Working with a friend, parent, or partner can be very effective in keeping this practice motivated.  </p>  <p>  \t      You will need a printer and an MP3 player of some kind to do the practice work. Having a piano keyboard nearby to practice on will also greatly accelerate learning. Mastery of the the complete series may take as little as six months or as long as two years. The Level II Intermediate Course is normally taught in 18-36 weeks.  </p>", 
    "end_date": null, 
    "title": "Music Theory II: Learning Chords & Rhythm", 
    "price": "40.00", 
    "instructors": "David Spondike, Ph.D.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/330974_73dc_3.jpg", 
    "course_url": "https://www.udemy.com/music-theory-level-ii/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T20:48:19Z"
}