{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course will take you from beginner in SQL and MySQL to an advanced level. Whether you're a complete beginner with only basic computer knowledge, or a professional who already uses MySQL but wants to understand advanced features like transactions, user permissions, triggers and stored procedures, this course can help you.</p>\n\n<p>Database skills are highly in demand in the I.T. industry; everything from websites to multiplayer games are likely to make use of some kind of database.</p>\n\n\n\n\n\n\n\n\n\n<p>MySQL is a free, industrial-strength relational database, very widely used all over the world. In fact, the MySQL Community Server (which this course covers to an advanced level) is the world's most popular open-source database, used by millions of websites.</p><p><br></p><p><strong>Master Advanced MySQL Features, Starting from the Ground Up</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>In this course you'll begin by learning the basics of creating, querying and adding data to databases using SQL with MySQL. As the course progresses, we'll move on to advanced features, vital for getting the most out of MySQL, including transactions, indexes, isolation levels, views, triggers and stored procedures.</p>\n\n\n\n\n\n\n\n\n\n<p>You'll learn how to create powerful and efficient databases using SQL, how to read and create EER diagrams, how to understand and implement table relationships like \"many to many\" and \"one to many\", and even how to design databases visually using the free MySQL Workbench client tool.</p>\n\n\n\n\n\n\n\n\n\n<p>By the end of the course you'll understand MySQL's powerful features to a greater level than probably most professional software developers, and you'll have an understanding of SQL that will help you get to grips with any relational database. You'll be able to create and query your own databases and use transactions, stored procedures, constraints, indices, views and other features to ensure your database is efficient and secure.</p>", 
    "end_date": null, 
    "title": "MySQL, SQL and Stored Procedures from Beginner to Advanced", 
    "price": "30.00", 
    "instructors": "John Purcell", 
    "commitment": "18.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/838406_d297_2.jpg", 
    "course_url": "https://www.udemy.com/mysql-and-sql-from-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-03T12:12:39Z"
}