{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Natural fertility planning is a great way to have a baby, plan your pregnancy or to avoid getting pregnant.</p><p style=\"\">By understanding how your amazing body works, you can take control of when you get pregnant or when you need to use other methods of contraception.</p><p style=\"\">There are many methods of natural fertility planning in this course I combine several. This means that you have the best chances of achieving what you want. </p><p style=\"\">The effectiveness of natural fertility planning is in the high 90%. You can choose nearly 99% effectiveness if necessary, or use more lax rules when pregnancy is an option, and possibly &quot;we don&#039;t mind if we do have a baby&quot;. </p><ul style=\"\"><li style=\"\">Many couples who don&#039;t want to follow a strict regime (it is your choice), will be happy to accept a small risk of pregnancy and are often highly delighted with their &#039;accident. </li><li style=\"\">Other couples will want to follow a stricter regime, because for them pregnancy is a no no. </li><li style=\"\">Other couples want to use natural fertility planning to decide when to have a child. </li><li style=\"\">Then there are those couples who are struggling to conceive and natural fertility planning is a fantastic way of helping them to understand the women&#039;s body and using that knowledge to work with their medical practitioner.</li></ul><p style=\"\">Natural methods do not interfere with your health in any way. In fact, as you get to know your cycles you will know when something&#039;s not right. If your cycles are really weird, natural fertility planning can be used to help you work closely with your medical practitioner.</p><p style=\"\">If you are trying to get pregnant, natural fertility planning combined with other aspects of your health and nutrition will give you a great chance of conceiving.</p><p style=\"\">It is a well known fact that a woman can only get pregnant on a specific few days within her cycle. Natural fertility planning helps you to understand when the best time to plan intercourse is or when to use other barrier methods in the case of pregnancy avoidance.</p><p style=\"\">In this course we are going to cover:-</p><ul style=\"\"><li style=\"\">Who natural fertility planning best suited for?</li><li style=\"\">Mind set for fertility success</li><li style=\"\">Understanding your fertility</li><li style=\"\">The signs of fertility</li><li style=\"\">How to chart your fertile signs</li><li style=\"\">How to get plan or avoid pregnancy</li></ul><p style=\"\">This course will be for you, if you want to understand your fertility and take control of when and if you get pregnant.</p>", 
    "end_date": null, 
    "title": "Natural Fertility Planning. Plan pregnancy the natural way", 
    "price": "20.00", 
    "instructors": "Jacqui Malpass", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490262_d972.jpg", 
    "course_url": "https://www.udemy.com/natural-fertility-planning-plan-pregnancy-the-natural-way/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T11:22:04Z"
}