{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "\n\n<p>Este curso nos ayudará a <strong>mejorar nuestros proyectos y llevarlos al límite</strong>.</p>\n\n<p>¿Cómo es esto posible?</p>\n\n<p>Aprenderemos a revisar cada detalle y cada componente que ha sido modelado. </p>\n\n<p><strong>Curso 100% orientado a la utilidad practica para construcción.</strong></p>\n\n<p>Encontraremos todos los posibles conflictos en el proyecto de manera independiente y con otros modelos de otras disciplinas para anticiparnos a solucionarlo.</p>\n\n<p>Vincularemos los modelos a un proceso de construccion para saber cómo y cuándo se construiría nuestro proyecto; con lo cual obtendremos mejores proyectos, más analizados, sin sorpresas, y con una visibilidad inmejorable que convencerá a todos los interesados, inversionistas, clientes, constructores, e incluso colegas de trabajo.</p>\n\n<p><strong>Sabremos con certeza</strong> que nuestro proyecto diseñado o nuestro proyecto a construir es construible. Y si una imagen dice más que mil palabras y que mil planos, imagina qué tanto más nos podrá decir un video, o un recorrido en tiempo real coordinando todos los modelos generados anteriormente.</p>\n\n<p>Además podremos llevar nuestro resultado de manera móvil, con Glue 360, exportando archivos en NWD y mostrámdolos donde estemos, ya sea en una junta, en el pasillo o desde nuestro celular.</p>\n\n<p><strong>Aprovecha el Certificado que obtienes al finalizar y registralo en la red de estudiantes expertos de autodesk como curso Udemy para mejorar tu perfil </strong><strong></strong><br></p>\n\n<p><strong>Navisworks</strong> al ser una herramienta de plataforma para modelos BIM, <strong>es necesaria en el ámbito de construcción, aún cuando el software utilizado como plataforma no sea éste, los fundamentos, comandos y funcionalidad presentados en el curso nos serán utiles para escalar o cambiar de herramientas, ya que fueron diseñados como procesos de transferencia y vinculación de información.</strong></p>\n\n<p>La versión utilizada será Navisworks 2014 (ésto considerando que es una versión que aún está en uso y que las últimas actualizaciones no presentan cambios mayores), ya que cuenta con la misma versatilidad para la integracion entre multiples archivos de Revit, Autocad, Civil 3d, Nubes de Puntos y varios archivos más, sin afectar el rendimiento ya que el motor 3d con que el programa fue generado nos permite visualizar y analizar de una manera efectiva todo el proyecto, aún cuando exceda los limites permitidos en Revit.</p>\n\n<p>¿Estás cansado de tomar cursos que van demasiado rápido o demasiado lento?, este curso podrás tomarlo cuando mejor te convenga, ya que tú decidirás la velocidad del mismo, de manera que podrás utilizar los resultados para incrementar tus proyectos; cuenta con 4 ejercicios para poner en práctica lo aprendido en el curso y de esta manera, mejorarará los proyectos ylos llevará al limite; también habrá un foro de preguntas, así como foros de discusión o dudas específicas en relación a los temas vistos durante el curso, el foro tendrá como objetivo mejorar la calidad del curso y el profundo desarrollo de: Visualización, Detección de Interferencias y Simulaciones 4d <br></p><p>\"Salta entre las secciones, repite cuantas veces necesites las clases y los ejercicios del curso\"... El acceso al curso es vitalicio por parte de Udemy lo cual significa que puedes utilizarlo cuando necesites, y con subscripcion a sus anuncios, entérate de las novedades de Navisworks que se publiquen en el curso.</p>\n\n<p><strong>Garantia de devolución de 30 días, en caso que el curso no cumpla con tus expectativas.</strong></p>\n\n<p>Cuenta con foros de discusión para mejorar el curso y obtener el mejor beneficio de éste, será un foro para el profundo desarrollo de: Visualización, Detección de Interferencias y Simulaciones 4d.</p>\n\n<p>Ademas serás el primero en enterarte de futuros cursos por parte de Mag Architecture &amp; Technology Solutions , aprovecharás las oportunidades de futuros cursos, y garantizarás mantenerte al dia con los conocimientos necesarios para destacar en tu trabajo , y conseguir mejores posiciones laborales y profesionales.</p>", 
    "end_date": null, 
    "title": "Navisworks, Simulaciones, Interferencias y Visualización BIM", 
    "price": "20.00", 
    "instructors": "Enrique Galicia", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510618_b883_4.jpg", 
    "course_url": "https://www.udemy.com/mag_navisworks/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T03:43:19Z"
}