{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>My name is Kelly Reese, a Chartered Financial Consultant, with more than 40 years of Network Marketing experience. A “Million Dollar Earner”, I have won the Top Team Builder Award and the Top Income Earner Award multiple times - and I'm looking forward to teaching you this course.</p><p>Have you considered the fact that, for more than 60 years, Network Marketing has proven to be the most powerful business model in history? Network Marketing has produced more millionaires than all other business models, because it is the ONLY business model that opens the entrepreneurial door to the masses.</p><p>If the next five years look like your last five years will you be measurably closer to achieving financial liberty? If not, I know of nothing, short of winning the lottery, that can speed up your financial freedom date like owning a successful Network Marketing business, as an independent distributor.</p><p>Network Marketing is the only industry where an individual, man or woman, has a chance to earn a professional level income while competing against mostly untrained and ill-prepared amateurs. In other industries you must compete against the best of the best to have any chance of significant income.<br></p><p><strong> What are you going to get from this course?</strong></p><ul><li>You WILL be able to rapidly build a solid foundation for your business that will support long-term walk-away income.</li><li><span></span>You WILL discover how to find an unlimited number of \"free\" prospects using my proprietary methods that could be easily performed by a 10 year old.</li><li><span></span>By using my proven scripts, that use \"optimistic curiosity\", you WILL be able to compel a many of your prospects to watch your opportunity presentation.</li><li><span></span>You WILL be able to use my \" $100,000 3-Step Close\" to convert a substantial number of your prospects into team mates</li><li><span></span>By using my simple \"Pass the ball\" technique, you WILL be able to focus your attention only on your active team mates, without upsetting those who are inactive.</li><li><span></span>You WILL be able to lead a team successfully, as a result of having developed excellent mental toughness and leadership skills in \"The Mind Game\" section of the course.</li><li><span></span>You WILL make the jump from amateur to professional Network Marketer by using the techniques and tools of professionals.</li><li><span></span>You WILL enjoy higher income; more benefits and the recognition you will richly deserve.</li></ul><p><strong>Take this course Now!</strong></p><p>I have experienced the wonderful feeling of going on vacation, knowing that my income will be growing while I am gone. That is the beauty of “passive income”. </p><p>I am very excited to share my proven tactics and methods with you and to guide you on the path to success in Network Marketing!</p>", 
    "end_date": null, 
    "title": "Network Marketing Mastery", 
    "price": "50.00", 
    "instructors": "Kelly Reese", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746942_5c69_5.jpg", 
    "course_url": "https://www.udemy.com/network-marketing-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T15:18:43Z"
}