{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>NLP Anchoring works! Have you ever had that situation where you feel lethargic and wish that you could SNAP out of it? </strong></p><p><strong>Have you ever wanted to feel more confident? to improve your results<br>NLP Anchoring will help you !</strong></p><p><strong>How would it be if you could choose your state fire off any state in an instant?<br><strong>NLP Anchoring will help you do this!</strong></strong></p><p>In this course, Matt Barnett - Certified Trainer of NLP will take you through the incredible power of Anchoring with NLP. Influenced by the work of Ivan Pavlov and conditioned response, you will learn how to effectively manage your state so that you can operate at your peak at any time and in any situation.</p><p><strong>Have you ever had the situation when you just cant seem to get motivated at all? </strong></p><p>How about what about when you know you 'should' be excited or happy but you cant seem to get that going?And what about boredom... have you ever had that feeling of boredom where 'nothing' will snap you out of it? <em><strong>Imagine if you could learn a technique that would enable you to EASILY move from a stuck dis-empowering state through to a highly motive empowering one...</strong></em></p><p>...Chaining anchors is an NLP technique that will see you taking control of your state and really getting a hold of your feelings enable you to maintain whatever state you choose.</p><p>If you are a parent or a coach then you will get great benefit out of this course. Have you ever had to listen to the moaning when its time for homework :)</p><p>And of course in your own life, just picture being able to always be at your best, <strong>empowered, positive and moving forward. Wouldn't that be great ?</strong></p><p>Collapse anchoring is a great technique for eliminating minor negative states.</p><p>Can you imagine if you could get rid of that nagging irritation that is constantly there?Imagine if frustration was a thing of the past !</p><p>Everybody has experienced these minor negative states before, and in varying contexts. Collapse anchoring is the technique for getting rid of them once and for all.</p><p>In this course, expert NLP trainer Matt Barnett describes the process of collapse anchoring a fabulous and powerful technique for eliminating minor negative states that are 'always present' The course is comprised of slides and audio as well as video of Matt Barnett talking about the process and demonstrating aspects of it. Included in the course is a Script to assist you in using the technique with other people and reference is made to how to use the technique with yourself as well.</p><p>The course is structured in such a way as to layer and represent key information so that it is easily absorbed.</p><p>You can take this course and you may find that you could go through the entire course in a day and by studying this course, you will learn another way to take control of your thinking and your life and of course you will learn a great skill for helping other people as well. Which is always a good thing.</p><p>Sign up for the Complete NLP Anchoring course ! today!</p><p>This course is presented by expert NLP trainer Matt Barnett and is equally applicable to those wanting to work with others or those people who are committed to being the best they can be in life.</p>", 
    "end_date": null, 
    "title": "NLP GET Full control over your feelings NOW NLP Anchoring", 
    "price": "30.00", 
    "instructors": "Matthew Barnett", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479768_5444.jpg", 
    "course_url": "https://www.udemy.com/nlp-anchoring-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T15:00:17Z"
}