{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Hast Du schon nach Beispielen, Tutorials oder Dokumentation für iPhone oder iPads Apps gesucht? Sicher hast ist Dir dabei auch schon Objective-C Code begegnet. Selbst in Dokumenten von Apple ist es noch ständig präsent. Kurzfristig wird Objective-C auch nicht verschwinden. Und da kommt dieser Kurs ins Spiel.</p>\n\n<p><strong>Objective-C für Swift-Entwickler</strong></p>\n\n\n\n<p>Auch Für Swift-Entwickler ist Objective-C sehr wertvoll. In diesem Kurs lernst Du deshalb Objective-C in den wichtigsten Facetten kennen. Egal ob Apps Dein Hobby sind, Du ambitioniert eigene Apps vertreibst oder als Entwickler arbeitest. Das Hintergrundwissen hebt Dich und Dein Skillset auf ein ganz neues Level.</p>\n\n\n\n<p><strong>Im Beruf</strong></p>\n\n\n\n<p>Als Profi machst Du Dich mit Objective-C Kenntnissen für mögliche Arbeit- und Auftraggeber noch wertvoller. Nur mit dem abgerundeten Profil kannst Du bisherige Projekte verstehen, Fehler lösen und Projekte weiterentwickeln. </p>\n\n\n\n<p>Im Unternehmen sind häufig bestehende Frameworks oder sogar ganze Apps noch nicht umgestellt. Hier werden Entwickler gesucht, die beide Welten beherrschen.</p>\n\n\n\n<p><strong>Als Hobby</strong></p>\n\n\n\n<p>Auch Hobbyentwickler profitieren von Objective-C Wissen. Es gibt viele Beispiele und eine ganze Reihe Dokumentation, die bisher nicht für Swift zur Verfügung steht. In diesem Kurs lernst du nicht nur Objective-C. Du lernst das Wissen mit Swift in Verbindung zu setzen. </p>\n\n\n\n<p><strong>Syntax und die Sprache</strong></p>\n\n\n\n<p>Im ersten Teil des Kurses liegt der Fokus auf der Sprache. Deshalb lernst Du die Syntax und Konzepte am Beispiel von Kommandozeilen-Apps kennen. Komplexere Lösungen mit dem Cocoa Touch Framework stehen erst im praktischen Teil auf dem Lehrplan.</p>\n\n\n\n<p><strong>Portierung von Swift zu Objective-C und umgekehrt</strong></p>\n\n\n\n<p>Ein zentraler Bestandteil des Trainings sind Übungen zur Portierung von Swift zu Objective-C und umgekehrt. Die direkte Anwendbarkeit im Alltag ist Teil des Trainingskonzepts.</p>\n\n\n\n<p><strong>App-Entwicklung mit Objective-C</strong></p>\n\n\n\n<p>Damit das Wissen in der Praxis gefestigt wird, lernst Du zusätzlich erste App-Projekte mit der neuen Sprache in Deinem Portfolio umzusetzen. Hier wird das vorher gesammelte Wissen benötigt, da die vorab besprochenen Elemente alle in den Frameworks für iOS-Apps benötigt werden.</p>", 
    "end_date": null, 
    "title": "Objective-C für Swift Entwickler", 
    "price": "30.00", 
    "instructors": "Jan Brinkmann", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/888048_5f0e.jpg", 
    "course_url": "https://www.udemy.com/objc-fuer-swift-entwickler/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-25T15:09:32Z"
}