{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">*************************************************************************************************************************<br style=\"\">Version 2.0 of the course is currently in development.&nbsp; Anyone who purchases this course will be upgraded for free to version 2.0 which will cost 2-3 times the current price.&nbsp; Sign up now to lock in your registration and get the free upgrade!</p><p style=\"\">*************************************************************************************************************************<br style=\"\"></p><p style=\"\">The Online Fundraising Bootcamp for Nonprofits is a comprehensive online course that covers how to create successful fundraising campaigns, drive traffic to your website, and engage your supporters to build long term relationships. <br style=\"\">  <br style=\"\">   During this four Module course, we will show everything you need to firm up your strategy and strengthen your online fundraising efforts. Each module is jam-packed with video lessons, resources, and, most importantly, action steps so you are not left wondering what to do next. <br style=\"\">  </p>    <p style=\"\">----- Student Testimonial -----<br style=\"\">  </p>    <p style=\"\">&ldquo;With the Online Fundraising Bootcamp, we were able to determine where we need to be and were <strong style=\"\">given a road map to help us</strong><strong style=\"\"> get there </strong>through the Fundraising Campaign Workbook.<br style=\"\">  <br style=\"\">   The most helpful information was how to design, write, and prepare communications for your donors and a schedule of optimal time to send emails<strong style=\"\">.<br style=\"\">  <br style=\"\">   Everything you need to be a more effective fundraiser</strong> is outlined with specific examples to get your mind thinking in the right direction about how these fundraising skills can work for your organization and benefit those you serve.&rdquo; <br style=\"\">    Tressie Seegers - The Austin Harmony Project  </p>  <p style=\"\">-------------------------</p>    <p style=\"\">The Online Fundraising Bootcamp includes the following Modules:</p>    <p style=\"\">Introduction</p>    <ul style=\"\">  <ul style=\"\">  \t<li style=\"\">The first module includes an overview of the Bootcamp and the structure of the course, as well as the tools needed to run successful online campaigns.</li>  </ul>  </ul>  <p style=\"\">Fundraising Campaigns</p>    <ul style=\"\">  <ul style=\"\">  \t<li style=\"\">The second module discusses the cornerstone of a successful online fundraising campaign. It includes many templates and examples to help you build your campaign and get you off the &ldquo;blank page.&rdquo;</li>  </ul>  </ul>  <p style=\"\">Strategies and Tactics</p>    <ul style=\"\">  <ul style=\"\">  \t<li style=\"\">The third module is all about driving traffic to your website and expanding the basic online fundraising campaign you built in the previous Module. We cover more advanced topics including email marketing, online video, and peer-to-peer fundraising.</li>  </ul>  </ul>  <p style=\"\">Testing and ROI</p>    <ul style=\"\">  <ul style=\"\">  \t<li style=\"\">The final Module focuses on the important question &ldquo;Is any of this really working?&rdquo; We discuss how to measure and test your campaigns, as well as how to figure out your Return on Investment (ROI).</li>  </ul>  </ul>  <p style=\"\">BONUS: Pre-Training Module</p>    <ul style=\"\">  <ul style=\"\">  \t<li style=\"\">We created the Pre-training Module to ensure everyone was up to speed and on the same page when it comes to Online Fundraising. We cover important topics including Why Online Fundraising?, the Myths of Online Fundraising, as well as mindset, the importance of testing, and learning from others.</li>  </ul>  </ul>  <p style=\"\">----- Student Testimonial -------</p>    <p style=\"\">&ldquo; The bootcamp has been an amazing tool for me and the organization I work with&hellip;.This was a great learning experience and helped me get up to speed with what is currently used by other non-profits.&rdquo;</p>    <p style=\"\">Katherine Verburg - Aware Awake Alive</p>    <p style=\"\">------------------------<br style=\"\">  </p>    <ul style=\"\">  </ul>  <p style=\"\">The Online Fundraising Bootcamp for Nonprofits, includes:</p>    <ul style=\"\">  \t<li style=\"\">&nbsp; A perfect &ldquo;rinse and repeat&rdquo; system that you can use again and again on all of your fundraising campaigns.</li>  \t<li style=\"\">Lessons that come with easily-digested bite sized videos showing me the why and how of each step.</li>  \t<li style=\"\">5 Modules of training, including the bonus Pre-Training.</li>  \t<li style=\"\">Over 36 video lessons totaling more than 6 hours of instruction.</li>  \t<li style=\"\">Downloadable templates, forms, and samples to help get you off the &ldquo;blank page.&rdquo;</li>  \t<li style=\"\">Action Steps for each lesson so I know exactly what I should be doing every step of the way.</li>  \t<li style=\"\">Question and answer support throughout the course. Send us your questions and we will answer them!</li>  \t<li style=\"\">Private &ldquo;invitation-only&rdquo; webinar trainings exclusively for Bootcamp members.</li>  \t<li style=\"\">Free updates whenever we add new videos, lessons, or action steps to the core course. (Version 2.0 is in development now!)</li>  </ul>  <p style=\"\"><br style=\"\">   Join the Online Fundraising Bootcamp now and get started today!</p>  ", 
    "end_date": null, 
    "title": "Online Fundraising Bootcamp for Nonprofits", 
    "price": "25.00", 
    "instructors": "Rich Dietz", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/70628_185e_6.jpg", 
    "course_url": "https://www.udemy.com/online-fundraising-for-nonprofits/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-28T04:21:03Z"
}