{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    This course orients college students to using OpenOffice Writer for essays and other written assignments. Students often find it challenging to maintain up-to-date word processing software. OpenOffice Writer is a shareware option that, with some training, can serve as an economical alternative to pricey programs like Microsoft Word.  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">The course starts at the very beginning, guiding students through the process of downloading and installing OpenOffice. </span></li>  \t<li style=\"\"><span style=\"\">Course tutorials focus on software elements relevant to college students writing in both MLA and APA formatting styles. </span></li>  \t<li style=\"\"><span style=\"\">Students can take the course in order and develop an essay template to use in your writing classes. </span></li>  \t<li style=\"\"><span style=\"\">Alternately, students can jump to tutorials dealing with issues of interest, such as inserting page breaks or formatting in-text citations. </span></li>  \t<li style=\"\"><span style=\"\">Since many college instructors require assignments to be submitted as Microsoft Word documents, the course includes a tutorial guiding you to convert your OpenOffice Writer documents to .doc files, which can be opened in Microsoft Word.</span></li>  </ul>  <p>  \t  This course was developed specifically for students who would like step-by-step APA or MLA essay formatting help using a free software alternative to Microsoft Word.  </p>", 
    "end_date": null, 
    "title": "OpenOffice Writer for College Students", 
    "price": 0, 
    "instructors": "Mary-Beth Brophy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/291892_ea8b_2.jpg", 
    "course_url": "https://www.udemy.com/openoffice-writer-for-college-students/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-01T19:17:21Z"
}