{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>O curso - <strong class=\"redactor-inline-converted\">Operações Exploratórias</strong> - visa dar um norte para a realização de operações online.<br>No curso demonstraremos técnicas para atender necessidades imediatas para obtenção de dados específicos sobre determinado alvo. Composto por vídeos e material para download. É um curso de nível I, ou básico, abordaremos apenas ferramentas online.<br>No primeiro módulo conheceremos os conceitos de Operações de Inteligência. Já no segundo trabalharemos o planejamento para operações exploratórias( operações que visam atender as necessidades imediatas de obtenção de dados).<br>A partir do terceiro módulo começaremos a execução dessas operações, primeiramente utilizando motores de busca, meta pesquisa, busca semântica e busca avançada no Google com utilização de operadores booleanos.<br>Ainda no terceiro módulo veremos a busca de dados em redes sociais, Facebook, Twitter e Instagram. Nesse módulo o aluno aprenderá como encontrar os mais diversos dados em redes sociais.<br>Finalizando o curso conheceremos bancos de dados disponíveis na internet. Veremos 2 bancos de dados privados que necessitam pagamento e mais de 15 bancos de dados públicos, mostraremos a utilização de cada um desses bancos de dados com um passo a passo para obtenção de dados.</p>\n\n<p>Além disso o aluno receberá o acesso a nossa caixa de ferramentas, uma página com mais de 200 links com ferramentas para <strong>Inteligência em Fontes Abertas(OSINT)</strong>, além de ferramentas exclusivas.</p>", 
    "end_date": null, 
    "title": "Operações de Inteligência", 
    "price": "30.00", 
    "instructors": "Jean Mortaza", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/881632_d8e2_5.jpg", 
    "course_url": "https://www.udemy.com/operacoes-de-inteligencia-1/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-18T13:06:29Z"
}