{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<strong style=\"\">Take your department to a new level.</strong><br style=\"\">  \t   With increasing demand for teachers to have empirical evidence <br style=\"\">  \t   in an instance, this course shows you how to set up a smoother running department with a method to track progress with minimal fuss generating evidence instantly.  </p>  <p>  \t<strong style=\"\">Step by step</strong>.<br style=\"\">  \t   Course is designed to be easily understood by beginners.  </p>  <p>  \t  Starts from downloading your qualification, looking at <br style=\"\">  \t   key documents, examining the spec. Looking at exemplar materials, setting up timelines, Checking tracking systems, benefits &amp; power of a self-made tracking system [downloadable].  </p>  <p>  \t<strong style=\"\">Why should I enrol?</strong><br style=\"\">  \t   Tracking system calculates certification type, level &amp; grades automatically per student for the OCR ICT Cambridge Nationals to save time calculating results*. With the blank curriculum timeline, it can provide staff &amp; students a way to optimise time &amp; energy to the best result.  </p>  <p>  \t<strong style=\"\"></strong>Stuart McLaughlin The Brittons Academy Essex <strong style=\"\"><em style=\"\">&quot;Shaf Cangil came as a consultant to The Brittons Academy when we desperately needed someone to organise our Year 11 students to finish off their coursework for the OCR National ICT qualification. She applied her management system to identify each students individual needs &amp; then provided staff with first class support. Her technique enabled staff to map and monitor every student&#039;s work against the specification &amp; then direct them to what was needed to complete the course. Thanks to her support, a significant number have achieved a pass or merit on the full course.&quot;</em></strong><br style=\"\">  \t<strong style=\"\">30 day money back guarantee no questions asked.</strong><br style=\"\">  \t<br style=\"\">  \t   Music by longzijun  </p>  <p>  \t<em style=\"\"><strong style=\"\">*Guide only! Always check with exam board. Adapt tracker/timeline accordingly. S.E.O Rescue takes no responsibility tracker use or any aspects as we cannot know your skill level/ability to deploy the system appropriately or the set level of PASS MERIT OR DISTINCTION for any year.</strong></em> Check with a moderator regularly &amp; adjust tracker for YOUR school.  </p>", 
    "end_date": null, 
    "title": "Organise to optimise a school ICT department & Reduce Stress", 
    "price": "30.00", 
    "instructors": "Mrs Shaf Cangil", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304250_c371_5.jpg", 
    "course_url": "https://www.udemy.com/setting-up-a-secondary-school-ict-department-as-head-of-dept/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T13:26:42Z"
}