{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<h4>Apprendre le management de projet avec des outils numériques performants et gratuits?</h4>\n\n<p><em><strong class=\"redactor-inline-converted\">Bienvenue dans cette formation</strong> qui va vous aider à manager, diffuser et pérenniser votre projet!</em></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Vous voulez monter votre projet, mieux décider, coordonner les activités, suivre vos indicateurs SMART, communiquer, disséminer, pérenniser votre projet?</li><li>Vous pensez peut-être que le management de projet est difficile?</li><li>Détrompez-vous: gérer un projet cofinancé avec des partenaires sur internet, c'est tout à fait réalisable!</li><li>Cette formation va vous donner de solides connaissances et des outils numériques simples et gratuits.</li><li>Découvrez les visions du projet, comment le gérer, communiquer, diffuser et le pérenniser :-)</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bonjour, nous sommes Cristina &amp; Olivier Rebière</strong>, un couple d'aventuriers de la vie et d'entrepreneurs. <strong class=\"redactor-inline-converted\">Nous avons des milliers d'étudiants et de lecteurs</strong> dans le monde entier qui apprécient nos livres numériques en français, anglais et espagnol (e-books) ainsi que nos formations vidéo en ligne (e-learning).</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Nous sommes spécialisés en projets complexes</strong> pour ainsi dire:</p>\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Nous avons créé une entreprise de team building </strong>et facilité des dizaines d’événements avec des centaines de participants simultanément.</li><li><strong class=\"redactor-inline-converted\">Nous avons fondé, construit et exploité le premier parc d’aventures</strong> de Roumanie où nous avons accueilli des milliers d’enfants et d’adultes.</li><li><strong class=\"redactor-inline-converted\">Nous avons publié </strong>plus d’une cinquantaine de livres numériques et des formations vidéo en ligne.</li><li><strong class=\"redactor-inline-converted\">Nous avons visité plus de 45 pays</strong> depuis nos études, sans nous ruiner.</li></ul>\n\n\n\n\n\n\n\n\n\n<p>Alors <strong class=\"redactor-inline-converted\">nous connaissons vos difficultés</strong> et allons vous aider à les régler sans prise de tête!</p>\n\n\n\n\n\n\n\n\n\n<h4>Préparez-vous à acquérir de nouvelles compétences utiles!</h4>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Dans cette formation, nous allons vous exposer</strong> les solutions qui existent sur internet, les outils numériques gratuits efficaces qui vont vous faire performer dans le management de projet, accroître votre crédibilité et votre autorité auprès des parties prenantes et des partenaires de votre projet.</p>\n\n\n\n\n\n\n\n\n\n<p>Vous allez notamment apprendre:</p>\n\n\n\n\n\n\n\n\n\n<ol><li><strong class=\"redactor-inline-converted\">Les visions du projet</strong>: stratégique, tactique, opérationnelle</li><li><strong class=\"redactor-inline-converted\">Les outils numériques gratuits</strong>: carte mentale, diagramme de Gantt, agenda et listes, PhotoScape, Handbrake, Google Keep, Docs, Sheets, Slides, etc.</li><li><strong class=\"redactor-inline-converted\">La révolution du webinaire en direct</strong>: comment communiquer simplement, créer de la preuve sociale et de l'engagement avec la plate-forme \"blab\"</li></ol>\n\n\n\n\n\n\n\n\n\n<h4>Quelle est la terminologie utilisée?</h4>\n\n\n\n\n\n\n\n\n\n<p>Dans cette formation nous allons parler entre autre de: carte mentale, créativité, diagramme de Gantt, proactivité, agenda, Google Apps, MindMup, ordinateur, smartphone, faire le point, webinaire, blab, communiquer, diffuser, pérenniser, productivité, autorité, crédibilité, plaisir au travail, structure de découpage du projet, work breakdown structure, indicateurs SMART...</p>\n\n\n\n\n\n\n\n\n\n<h4>Qu'allez-vous obtenir de cette formation sur le management de projet?</h4>\n\n\n\n\n\n\n\n\n\n<ul><li>33 leçons vidéo de grande qualité</li><li>un certificat de complétion de la formation lorsque vous l'aurez terminée</li><li>Lien vers le programme de formation officiel contenant toutes les ressources utilisées dans le cours</li><li>Lien vers un fichier zippé des signets de la formation pour cliquer facilement vers les ressources en utilisant votre navigateur internet préféré</li><li>de nombreux outils numériques gratuits en ressources</li><li>zone de discussion pour échanger directement avec nous</li><li>l'accès à la communauté des Formateurs &amp; Auteurs Numériques En Ligne</li></ul>\n\n\n\n\n\n\n\n\n\n<h4>Ce que d'autres personnes disent de nos formations sur les outils porteur de projet (+ de 400 étudiants francophones):</h4>\n\n\n\n\n\n\n\n\n\n<ul><li><em>« Excellent cours avec beaucoup de ressources utiles. Dynamique et facile à suivre. Sauve temps et argent à tous ceux qui ont un projet à gérer. »</em> – <strong class=\"redactor-inline-converted\">Dr. Nathalie Campeau,MD</strong></li><li><em>« Il s’agit d’un cours structuré et intéressant, utile pour tous ceux qui souhaitent gérer des projets d’une manière plus efficace. Très bien fait! »</em> – <strong>Gerfried Reis</strong></li><li><em>\"J'avais juste besoin de cours en gestion de projet et il faut juste dire que ce cours ce distingue par sa clarté sa simplicité et voila j'ai adoré!!!\"</em> - <strong class=\"redactor-inline-converted\">Lamine Badji</strong></li><li><em>\"<strong class=\"redactor-inline-converted\">J'ai trouvé cela très intéressant</strong>, ce pourrait être une progression à proposer aux porteurs de projets. C'est très complet et cela propose de nombreuses pistes...\"</em> - <strong class=\"redactor-inline-converted\">Philippe Rousseau</strong></li><li><em>\"des cours simples qui nous donnent des pistes de réussite de le montage de nos projets\"</em> - <strong class=\"redactor-inline-converted\">Kouadio Kouakou Djaban Desire</strong></li><li><em>\"Contenus pertinents et bien organisés\"</em> [...] - <strong class=\"redactor-inline-converted\">UO-FWB Université Ouverte de la Fédération Wallonie - Bruxelles</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<p>Alors, êtes-vous prêt(e) pour la formation?! Oui?</p>\n\n\n\n\n\n\n\n\n\n<h4><em>Alors on démarre!</em></h4>\n\n\n\n\n\n\n\n\n\n<p>Cristina &amp; Olivier Rebiere</p>", 
    "end_date": null, 
    "title": "Outils Projet: Management Projet, Outils Numériques Gratuits", 
    "price": "25.00", 
    "instructors": "Cristina Rebiere, Olivier Rebiere", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793996_f952_2.jpg", 
    "course_url": "https://www.udemy.com/management-projet/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T19:42:54Z"
}