{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Discover the benefits of Leveraging your time and money through Outsourcing.  </p>  <p>  \t<strong>If you don&#039;t know how to outsource some of your business, you are not only losing time, you are losing money.</strong>  </p>  <p>  \t     By outsourcing to a third party, your business can  focus on what it  does best and gain a competitive edge in the  marketplace.  </p>  <p>  \t<em><strong>Being Successful isn&#039;t about your Resources, its about how Resourceful you Can BE!</strong></em>  </p>  <p>  \t     Why would you, as a small business owner, entrepreneur, or  solo-preneur, spend your valuable time and resources to personally do  all the small tasks instead of outsourcing those tasks that someone  could else could do?  </p>  <p>  \t     When you learn the benefit of outsourcing you can Focus on whats important to you and your business.  </p>  <p>  \t     When you discover how to get quality work for as little as $4 an  hour, you can begin to make your business run more efficiently and  profitably.  </p>  <p>  \t  I first  learned about outsourcing years ago when I read the book  &quot;The 4 hour Work Week&quot; Imagine not having to learn how to do anything  other than use quality people to provide services for you and your  customers. You could make your entire business virtual, leaving you the  time to do whatever you want.  </p>  <p>  \t  In this class I will show you how to use outsourcing to delegate tasks you don&#039;t need to be doing, where you can go to get the best outsourcing freelancers, and how to find the best ones for each area of your business.  </p>", 
    "end_date": null, 
    "title": "Outsourcing for Internet Marketers", 
    "price": "45.00", 
    "instructors": "Tyson Russell", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320640_f6e8_3.jpg", 
    "course_url": "https://www.udemy.com/outsourcing-for-internet-marketers-101/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T05:47:18Z"
}