{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>So you have made some acrylic paintings, but you want to learn how to take your skills to the next level. You've seen artists painting in a realistic style, and you would love to be able to paint like that, but you are not sure how to. This course will give you the skills and techniques as the tutor, Joe McMenamin, completes every stage of a painting of the New Zealand songbird the \"Tui\".</p>\n\n<p><br></p>\n\n\n\n\n\n<p>This course covers:</p>\n\n\n\n\n\n<p>1. Image preparation - How to choose a good image and how to transfer it onto wood.</p>\n\n\n\n\n\n<p>2. The tools - Which paint, brushes and other materials you will use in this course.</p>\n\n\n\n\n\n<p>3. Wet blending - How to blend acrylic paint for the different parts of the bird and foliage.</p>\n\n\n\n<p>4. Dry brushing - How to add a soft layer of paint to smooth out the brush strokes and give the feathers a more details soft blend.</p>\n\n\n\n<p>5. Adding the fine details - How to use small brush strokes to create texture and other fine details to make the painting appear more realistic.</p>\n\n\n\n<p>6. Finishing the painting - Getting the painting ready to hang for an exhibition, for sale or for display in your own home.</p>\n\n\n\n\n\n<p> </p>\n\n<p>I wish I had been able to watch a course like this when I was developing my skills in painting. The great thing about having an online course is that you are able to keep going over the areas that you need to work on until you get them right. </p><p>If you are looking to develop and improve your painting skill and learn some new techniques, I encourage you to enroll in this course. I believe you can paint like me if you learn the skills and practice them!<br></p>", 
    "end_date": null, 
    "title": "Paint a realistic bird using acrylics", 
    "price": "20.00", 
    "instructors": "Joe McMenamin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/828840_8124.jpg", 
    "course_url": "https://www.udemy.com/paint-a-realistic-bird-using-acrylics/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-22T04:56:57Z"
}