{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t<strong><em>Are you curious about past life regression?</em></strong>\r\n</p>\r\n<p>\r\n\t<strong><em>Are you interested in experiencing it at your own pace?</em></strong>\r\n</p>\r\n<p>\r\n\t<strong><em>Perhaps you would like to do past life regression as often as you like?</em></strong>\r\n</p>\r\n<p>\r\n\t <strong><em>Are you awakening to new dimensions of spirituality?</em></strong>\r\n</p>\r\n<p>\r\n\t<em>Learn more about who you were so that you can learn more about who you are.....</em>\r\n</p>\r\n<p>\r\n\t                For more and more people, past life regression has become a way of releasing fears, phobias and feelings. Past life therapy through hypnosis loosens the rigidity of the intellect and opens the door to a new experience of reality.\r\n</p>\r\n<p>\r\n\t              Transformation becomes a process of coming to a place of peace and harmony within the self that is attained by experiencing the primordial essence from which we have become separated. Regression therapy touches the deepest part of our essence, the lost part of our soul that is redeemed through our love and acceptance.\r\n</p>\r\n<p>\r\n\t                This raises the level of consciousness to become centered in love and caring for others. Feelings of separateness become recognized as an illusion and one can experience the ultimate reality. Past life therapy is becoming recognized as one of the most powerful tools for inner transformation in psychology today.\r\n</p>\r\n<p>\r\n\t<em>  This powerful tool for the transformation of human thought is our connection to the universe and will eventually raise the consciousness of everyone on the planet.</em>\r\n</p>\r\n<p>\r\n\t              This course enables you to experience your own past life regression in the comfort of your own home. <br>\r\n\t<br>\r\n\t            This program provides you with video lectures as well as hypnosis audio programs which can enable you to tap into the unconscious and subconscious mind to help you uncover and heal past life memories. A past life regression with a hypnotist or hypnotherapist can cost hundreds of dollars! This program is a cost effective way of experiencing past life regression.....and getting results!\r\n</p>\r\n<p>\r\n\t            You also receive 2 bonus downloads for enrolling in this course. That is an additional one hour of content free.\r\n</p>\r\n<p>\r\n\t<strong>The Journey-Music For Meditation</strong>\r\n</p>\r\n<p>\r\n\t            Put on your headphones, close your eyes and get ready to be transported . The Journey has been composed to support deep states of relaxation and exploration into expanded states of awareness.\r\n</p>\r\n<p>\r\n\t            You will be gently guided from waking consciousness to deep theta relaxation on the first 4 tracks and brought back to waking consciousness on the 5th track. Your perfect musical companion for relaxation, meditation, self-hypnosis, reiki, reflexology, massage and other healing work. This music is tuned to 432hz which resonates and activates the heart chakra.\r\n</p>\r\n<p>\r\n\t            When you emerge at the end of the program you will feel remarkably refreshed and renewed with energy.\r\n</p>\r\n<p>\r\n\t            5 Tracks 43 Minutes in length-MP3 320 kbps\r\n</p>\r\n<p>\r\n\t<strong>Radiant Energy Meditation</strong>\r\n</p>\r\n<p>\r\n\t<em>Feeling tired or drained energetically?</em>\r\n</p>\r\n<p>\r\n\t<em>Maybe you sense that you are carrying energy that is making you heavy or lethargic?</em>\r\n</p>\r\n<p>\r\n\t<em>Would you like to experience more &quot;lightness&quot; in your body, mind and emotions?</em>\r\n</p>\r\n<p>\r\n\t<span style=\" color:inherit; \">Experience a voice guided, gentle, meditative journey to help you clear your aura, chakras and energy field.</span>\r\n</p>\r\n<p>\r\n\t            In this program you will have the opportunity to clear your energy field and aura.  You will learn how to connect with the universal healing energy to balance and align your systems. Releasing energy that is no longer serving you creates new space within both yourself and your life.\r\n</p>\r\n<p>\r\n\t            Space that can then be filled with only that which you choose.\r\n</p>\r\n<p>\r\n\t            During this program you will work directly with the universal healing energy. You will align with your highest and best self leading to a complete renewal.\r\n</p>\r\n<p>\r\n\t           Program approximately 23 minutes in length.\r\n</p>", 
    "end_date": null, 
    "title": "Past Life Regression: The Power Of Your Past", 
    "price": "50.00", 
    "instructors": "Donald Currie", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238070_7fcf_5.jpg", 
    "course_url": "https://www.udemy.com/past-life-regression-the-power-of-your-past/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-05T22:54:32Z"
}