{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>This course introduces the ecological design approach known \nas permaculture and shows how it can be used to create water-wise \nlandscapes in dry climates.</strong></p><p>Permaculture combines concepts and principles derived from nature \nwith research from ecology and sustainability fields to help design \nhealthy landscapes, homes, and communities that reduce resource use, are\n low-maintenance, and are self-renewing. You will learn about specific \ntechniques that work in a dry climate, and gain a general understanding \nof permaculture design and application.</p><p>Toby is well-known for his skill at taking technical, scientific \ninformation and making it readily available to everyone, regardless of \nscience background.  In this course, Toby offers 8, very clear \nstrategies for achieving a water-wise garden.  He covers a variety of \ntechniques to help you carry-out each strategy.  In addition, he \nintroduces the many benefits, besides water conservation, that come with\n implementing each water-wise strategy.</p><p>By the end of the course, you will have the knowledge necessary to \nbegin implementing water conservation techniques in your garden.  Water \nis a precious resource.  Toby gives you no excuse not to embrace \nwater-wise gardening.  So dig in and enjoy!</p><p><em>This course was created from Toby’s keynote address at </em>Rethinking Idaho Landscapes, <em>a forum presented by the Idaho Botanical Garden and the University of Idaho on February 22, 2014 in Boise, Idaho.</em></p><p><strong>About Toby Hemenway</strong><br></p><p>Toby Hemenway is the author of Gaia’s Garden: A Guide to Home-Scale \nPermaculture, which was awarded the Nautilus Gold Medal in 2011, was \nnamed by the Washington Post as one of the ten best gardening books of \n2010, and for the last eight years has been the best-selling \npermaculture book in the world. Toby has been an adjunct professor at \nPortland State University, Scholar-in-Residence at Pacific University, \nand has taught over sixty 72-hour permaculture design courses. He has \npresented lectures and workshops at major sustainability conferences \nsuch as Bioneers, SolFest, and EcoFarm, and at Duke University, Tufts \nUniversity, University of Minnesota, University of Delaware and many \nother educational venues. His writing has appeared in magazines such as \nNatural Home, Whole Earth Review, and American Gardener. He has \ncontributed book chapters for WorldWatch Institute and to several \npublications on ecological design. </p><p>After obtaining a degree in biology from Tufts University, Toby \nworked for many years as a researcher in genetics and immunology, first \nin academic laboratories including Harvard and the University of \nWashington in Seattle, and then at Immunex, a major medical biotech \ncompany. At about the time he was growing dissatisfied with the \ndirection biotechnology was taking, he discovered permaculture, a design\n approach based on ecological principles that creates sustainable \nlandscapes, homes, and workplaces. A career change followed, and Toby \nand his wife, Kiel, spent ten years creating a rural permaculture site \nin southern Oregon. He was the editor of Permaculture Activist, a \njournal of ecological design and sustainable culture, from 1999 to 2004.\n He moved to Portland, Oregon in 2004, and spent six years developing \nurban sustainability resources there. Toby and his wife now live in \nSebastopol, California.</p><p><em></em></p>", 
    "end_date": null, 
    "title": "Permaculture Design for Conserving Water", 
    "price": "20.00", 
    "instructors": "Toby Hemenway", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/187974_1584_3.jpg", 
    "course_url": "https://www.udemy.com/permaculture-design-for-conserving-water/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-24T19:10:23Z"
}