{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong>Michel Rivet</strong></em><br></p>\n\n<p><em class=\"redactor-inline-converted\">\"wow..more awsome tutorials in this version 3 that complement the previous version 1 and 2. If you use litchi as a beginner (hobby) or an advanced professional film maker these course are a must. I highly recommand them.. I rate the 3 versions 10/10.\"</em><br></p>\n\n<p><strong>Gord Frost</strong><br></p>\n\n<p><em>\"What an amazing course. Who would have believed, way back when we first bought our Phantoms that we would be able to do such things. Well presented and clearly explained lesson content that allows for \"almost professional\" results the very first attempt. I am Very sick and very old yet I was successful first time out. WOW! Words can't explain the excitement of seeing one success after the other as you work your way through this course. Laurence you are to be commended for such a well presented course, thank you for making my hobby just that much more fun.\"</em></p>\n\n\n\n<p>-------------------------------------------------------------------------------------------</p>\n\n\n\n<p>*This course is for anyone with a Phantom 3/4 or Inspire*<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Phantom Filmschool 3 takes your skills to the next level. You will learn so many new skills and techniques in this course that by the end of it you will really have a lot of value you can add to your customers, or if this is a hobby you will really be able to do so much more! </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You will learn new video editing techniques such as:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>4k zoom: how to use a technique to zoom in on your subject to give greater effect and focus</li><li>Editing to music: take your videos to the next level by properly aligning your video and music tracks </li><li>Acceleration: a technique that allows your clips to speed up &amp; rapidly slow down to add extra effect to blow your audience away</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then we will cover a new flying skill which is called Focus mode.  It is basically the ability to create awesome auto pilot shots on the fly without all the pre-planning usually required. Often you are up in the air and spontaneously see a new shot you would like to take but haven't created a mission.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then we will teach you a new aerial photography technique called Large Format pano's. With this technique you will learn how to shoot Pano photographs which can be printed in a large format in some cases over 1.5 meters in length with stunning resolution and accuracy. You will learn how to shoot in AEB and how to do HDR merges as well as pano merges and editing. You will be able to shoot such stunning shots and create such beautiful art that you could very well turn this into a business and shoot these shots commercially with much success. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then you will learn another awesome aerial photography technique based on the science oh Photogrammetry. You will learn 2 different methods to shoot, edit and create 3d models, Digital elevation models, Orthomosaics, volumetric measurements and NDVI (plant health models) and how to publish and share them. This could also lead to a new commercial venture as these are real skills required by real businesses. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Phantom Filmschool 3 teaches you new skills and techniques taking your abilities with your Phantom and Inspire to the next level. I hope you enjoy the course and also find ways to monetize these new skills and create a successful drone business with them. </p>", 
    "end_date": null, 
    "title": "Phantom Filmschool 3 - the easy way to shoot like a pro", 
    "price": "40.00", 
    "instructors": "Laurence Seberini", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794648_34fc.jpg", 
    "course_url": "https://www.udemy.com/phantom-filmschool-3-the-easy-way-to-shoot-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T12:29:05Z"
}