{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Creating seamless, effective and beautiful mobile apps is not easy, and making them run on various different platforms is even less easy. You’ll need to be fluent in several programming languages and have a wide-ranging selection of skills from HTML to Java and everything in between. PhoneGap takes all of these different elements and streamlines them into one easy to use platform; so you can create those seamless, effective and beautiful apps in a flash. This course will show you how. </p><p><strong>Create Complex Mobile Apps with Simple Technology</strong></p><ul><li>Gain a conceptual understanding of level development</li><li>Develop practical skills to develop your own levels</li><li>Build projects from templates provided</li><li>Create apps for multiple platforms including iOS, Android and Windows Mobile </li></ul><p><strong>Become a PhoneGap Expert</strong></p><p>By teaching you how to setup the development environment needed to create PhoneGap applications, this course will open up an entire world of web applications and the skills you use to create them. Over 35 lectures and 2.5 hours of content, you’ll create a basic PhoneGap application for iOS, Android, Windows Mobile, Blackberry, and more. You’ll implement every detail of the framework APIs and come out with a fully functioning mobile application, which you’ve created from scratch yourself.</p><p>The course is divided into 3 sections. The first section is dedicated to the basics of PhoneGap; if you’re a complete beginner, you’ll be up to speed in no time. If you already have some experience with PhoneGap, this section will refresh you and ensure your knowledge is completely up to date for the rest of the course. Section 2 will teach you how to use generic APIs and will cover network connection, notification, battery status and device information APIs. Section 3 deals with hardware APIs for geolocation, camera, and media, and takes your through your custom PhoneGap template. </p><p>To complete this course successfully, you will need to be familiar with the basics of HTML and JavaScript</p><p><strong>Tools Used</strong></p><p>PhoneGap allows you to easily create apps using web technologies that all beginners will have a basic understanding of; HTML, CSS, and Javascript. It is a free, open source framework for creating mobile apps using standardised web APIs. Or in other words, it allows you to use the various tech skills you have to create complex apps without the need to learn several programming languages. </p><p>Mobile development technology, front and back end technologies, hybrid applications</p>", 
    "end_date": null, 
    "title": "PhoneGap for Beginners", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594626_64fe_2.jpg", 
    "course_url": "https://www.udemy.com/phonegap-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T04:31:09Z"
}