{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>ACESSO ILIMITADO AS AULAS DE PHOTOSHOP ! APRENDA A MANIPULAR IMAGENS E CRIAR ARTES DIGITAIS, ILUSTRAÇÕES, RETOQUE EM FOTO E MUITO MAIS!</strong></p><p>Neste Curso Photoshop Básico, vamos aprender as ferramentas deste programa de forma que possamos dar início a criação de artes digitais .</p><p>Aproveite para conhecer e aprender de forma mais prática, sem muita demora nas aulas, e <strong>criando e aprendendo</strong> de forma acessível para todos nós. Muito exercício e conteúdo atualizado   sem perder o <strong>contato aluno e Professor</strong>!</p><p>Todas as aulas <strong>fornecemos as imagens e download</strong> para trabalharmos , podendo assim acompanhar de forma mais precisa as aulas.</p><p>Manipulação de imagens, retoque de foto e design gráfico são a base para irmos aprendendo as ferramentas do Photoshop.</p><p>Você vai aprender de forma rápida, vídeos rápidos e exercícios focados.</p><p>Tutoria online professor aluno, vamos acessorar de perto seus estudos e auxiliar você o melhor possível.</p><p>Você irá aprender as ferramentas básicas para ser utilzadas para criar artes digitais e manipulação de imagens.</p><p>Como gerenciar múltiplas imagens em 1 composição fazendo parecer 1 só.</p><p>Como criar banners, cartaz, flyer, e materiais para gráfica.</p><p>Você irá aprender a como criar objetos em 3D de forma bem rápida.</p><p>Vamos aprender os passos para as ferramentas usadas em ilustração e desenho no Photoshop.</p><p>Retoque de rosto para capa de revista.</p><p>Você irá aprender a transformar imagens dando um visual mais profissional como se fosse imagens de propagandas famosas.</p><p>E muito mais!</p><p>Ou seja,</p><p>Manipulação de imagem</p><p>Design Gráfico</p><p>Desenho e ilustração</p><p>O que você precisa saber é que você irá aprender a manipular imagens sendo ela na área de fotografia, artes visuais e design gráfico.</p><p>Ferramentas do Photoshop que iremos aprender a utilizar:</p><p>Layout e Interface</p><p>Layers e atalhos</p><p>Como salvar exportar imagens com qualidade</p><p>Seleção e remoção de fundo</p><p>Brush tool - Ferramenta pincél</p><p>Dodge and burn - retoques profissionais</p><p>Text tool - ferramentas de texto no Photoshop</p><p>Healing brush tool - Pincél curador</p><p>Matemática dos pixels e stamp tool(ferramenta carimbo)</p><p>Smudge tool - ferramenta borrar</p><p>Filter gallery - galeria de filtros</p><p>Puppet warp tool - ferramenta marionete</p><p>Efeito 3D e renderização</p><p>Pen tool - Ferramenta caneta</p><p>Shapes no Photoshop - criando formas geométricas para design e ilustração</p><p>Paint Bucket tool e Gradient - preenchendo fundos e removendo fundos</p><p>Selection shapes - ferramenta de seleção com formas</p><p>Blur tool e sharpen tool - ferramenta de desfoque e afiar</p><p>Transform tool - transformando e distorcendo</p><p>Eye dropper tool - seleção de cores</p><p>Slice tool - fatiando imagens para arte email marketing</p><p>New Canvas - criando novo documento</p><p>Blur filter - filtros de desfoque</p><p>Blending modes - modos de mesclagem</p><p>Adjustment layers- Ajuste de camadas FULL</p><p>Blending options and layer styles - estilos de camadas</p><p>Cores e harmonia - composição das cores</p><p>RGB e CMYK - modos de cores</p><p>Channels - Trabalhando com canais</p><p>FIltro liquify - usando filtros para distorcer imagens estilo cartoon</p><p>Arsenal de sites de imagens gratuitas</p><p>13 exercícios para praticarmos juntos</p>", 
    "end_date": null, 
    "title": "Photoshop CC - Treinamento de manipulação de imagens ", 
    "price": "20.00", 
    "instructors": "Fernando Pereira", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577662_8d8a_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cc-aprenda-a-manipular-imagens/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T21:08:24Z"
}