{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Cada vez mais procurado no Brasil, o pilates é um método de \ncondicionamento físico e mental criado pelo alemão Joseph Pilates. A \nmaioria das pessoas se preocupa apenas com a musculatura aparente, sem \nentender que em longo prazo essa atitude pode trazer uma série de \nproblemas ao organismo.</p><p>O grande segredo da prática de pilates é o\n trabalho com exercícios que proporcionam alongamento e fortalecimento \ndos músculos internos (intrínsecos) e externos, assim como ampliação da \nconsciência sobre o próprio corpo de quem pratica.</p><p>Através de \ntécnicas aplicadas no solo, com ou sem uso de equipamentos auxiliares, \nvocê poderá desenvolver seu potencial físico-motor, melhorar seu \nequilíbrio corporal e emocional, perceber um maior relaxamento no dia a \ndia e entender a importância da postura para resultados estéticos e \nterapêuticos.</p><p>O conteúdo será trabalhado de forma fácil, funcional\n e evolutiva para que qualquer pessoa possa praticar de maneira \ncuidadosa e consciente.</p><p>Com vasta experiência em trabalhos \ncorporais, a instrutora Soraya Sabino ensinará em nove aulas desde o \nprincípio básico do pilates, como o cuidado necessário com a postura no \ndia a dia, até o fortalecimento de diversos músculos e membros. \nInspire-se com os movimentos e torne seu corpo saudável e harmonioso.</p>", 
    "end_date": null, 
    "title": "Pilates terapêutico: respiração, fortalecimento e postura", 
    "price": "50.00", 
    "instructors": "Namu Cursos", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766478_cf5f_2.jpg", 
    "course_url": "https://www.udemy.com/pilates-terapeutico-respiracao-fortalecimento-e-postura/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T12:36:46Z"
}