{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Now days it is very common that you will be asked Oracle PLSQL and performance tunning questions at any Interviews for ETL developer or Database Developer or any other positions related to ETL jobs. </p><p>You can take this course weather you want to learn PLSQL quickly but practical way or you preparing for Interviews. This course covers all PLSQL topics along with examples using real time development tools like SQL Developer. I have created all these important topics very carefully and after several years of experience in Database field which will bring you lot of confidence.</p><p>This course mainly includes various questions asked during Interview for Oracle SQL and PL SQL related positions.<br></p><p>Each session explains the concept by providing explanation and examples.</p><p>Course includes all questions with explanation using real world practical examples.</p><p>Also it includes explanation for inbuilt Oracle supplied packages and the subprograms provided by them. You can get the good understanding of topics which are explained with number of examples.</p><p>Also Course includes some performance tuning concepts like EXPLAIN_PLAN, Oracle hints etc.</p><p>Topics Covered -</p><ul><li>Basic Interview Questions: This will present 18 most frequently asked questions will answers and examples.</li><li>These questions covers most of the main topics in SQL and PLSQL.</li><li>DBMS_JOB: This presents the main subprograms provided by package DBMS_JOB with examples.</li><li>DBMS_RANDOM: This presents the main subprograms provided by package DBMS_RANDOM with examples.</li><li>DBMS_OUTPUT: This presents the main subprograms provided by package DBMS_RANDOM with examples.</li><li>UTL_FILE: This presents the main subprograms provided by package DBMS_RANDOM with examples.</li><li>DBMS_SQL: It will provide you with basic understanding of Dynamic SQL and describe some of the subprograms with examples.</li><li>DBMS_PIPE: </li><li>DBMS_UTILITY</li><li>DBMS_LOB</li><li>CURSORS: This\ndetails on the use of cursors, types with examples</li><li>BULK\nOPERATIONS: This\nis majorly an important topic if you are preparing for an interview. You may\nfind detailed explanation with examples in tutorial.</li><li> MATERIALISED VIEWS</li></ul><ul><li> AUTONOMOUS TRANSACIONS: This\nis a good topic frequently asked during interviews. You can understand it well\nwhile going through tutorial</li></ul><ul><li>TRIGGERS: This\ndetails on the use of Trigger, its types with examples</li><li>Performance Tuning: Last but not least, we will cover -DBMS_PROFILER, EXPLAIN\nPLAN &amp; ORACLE\nHINTS</li></ul>", 
    "end_date": null, 
    "title": "PL/SQL Interview Questions with Examples", 
    "price": "20.00", 
    "instructors": "Kish Sat", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590068_0685_3.jpg", 
    "course_url": "https://www.udemy.com/pl-sql-interview-questions/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-22T02:17:26Z"
}