{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<ul><li><strong>Latest Update: January 2016</strong></li><li><strong>Join 880+ successful students who have already taken this course!</strong></li><li><strong>Two instructors are available inside the course to answer all your questions and provide immediate feedback</strong></li></ul><p>_________________________________________________________________________________________________</p><p>Learn the Polish language vocabulary, essential words and phrases you need to survive in Poland!</p><p><em><em>Learn Polish language essentials for beginners.</em><br></em></p><p><em><strong>This course is perfect if you want to:</strong></em><br></p><ul><li>learn how to introduce yourself on a meeting/party</li><li>know basic everyday phrases and key expressions for your social interactions</li><li>have a quick start into Polish language</li></ul><p><strong>Learn Polish language and achieve your personal and professional goals.</strong><br></p><p>Learning Polish language can help you if you have Polish relatives, friends or business partners. If you are going to visit Poland this crash course will be definitely helpful for you.</p><p><strong>Content and Overview</strong><br></p><p>In very simple steps you will learn the words and phrases you need to communicate with friends and colleagues at home, work or on the street. </p><p>This course assumes no background in the language, and explains each new concept clearly with plenty of examples, making it ideal for beginners. </p><p>You will also get many extras such as quizzes, exercises, and pdf presentations to download. <br></p><p><strong>Take this course today and learn Polish language in minutes!</strong></p>", 
    "end_date": null, 
    "title": "Polish Language Crash Course for Beginners", 
    "price": "20.00", 
    "instructors": "Remi Dudek, Janusz Przychodzen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694844_cacb_6.jpg", 
    "course_url": "https://www.udemy.com/polish-language-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-11T14:52:07Z"
}