{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<ul><li><strong>Latest Update: May 2016</strong></li><li><strong>Join 800+ successful students who have already taken this course!</strong></li><li><strong>Two instructors are available inside the course to answer all your questions and provide immediate feedback</strong></li></ul>\n\n<p>_________________________________________________________________________________________________</p>\n\n\n\n<p>Learn the language structure, vocabulary, essential words and phrases you need in order to become a confident and fluent Polish speaker.<br></p>\n\n\n\n<p><em><em>Build a strong Polish language knowledge with this course for beginners.</em><br></em></p>\n\n\n\n<p><em><strong>This course is perfect if you want to:</strong></em><br></p>\n\n\n\n<ul><li>start forming sentences after the very first lesson</li><li>master real-life situations in Polish language</li><li>know many everyday phrases and key expressions for your social interactions</li><li>become spontaneous in discussions</li></ul>\n\n\n\n<p><strong>Learn Polish language and achieve your personal and professional goals.</strong><br></p>\n\n\n\n<p>If your partner or relatives speak Polish, learning the Polish language will help you to understand them better, show your respect and love. And your Polish friends will be really amazed when you at least try to understand Polish, and know most important words.</p>\n\n\n\n<p>Knowing even basics of Polish can make your visit to Poland more enjoyable. Mastering language basics can help you in making a good impression on your business partner.</p>\n\n\n\n<p>If you know Polish you can understand Czech, Slovak, Serbian, Ukrainian and a few more languages.</p>\n\n\n\n<p><strong>Content and Overview</strong> </p>\n\n\n\n<p>In very simple steps you will start with basic words and then move to the next level in minutes! With easy-to-follow instruction and exercises that give you the language to communicate during day-to-day experiences, you will learn the words and phrases you need to communicate with friends and colleagues at home, work or on the street. </p>\n\n\n\n<p>This course assumes no background in the language, and explains each new concept clearly with plenty of examples, making it ideal for beginners. This course is packed with natural dialogues, clear grammar notes, vocabulary building, key expressions and notes on travel, culture or cuisine. </p>\n\n\n\n<p>You will also get many extras such as quizzes, exercises, and pdf presentations to download. You will be making visible progress quickly and having lots of fun at the same time.<br></p>\n\n\n\n<p><strong>Take this course today and start speaking Polish in minutes!</strong><strong></strong><br></p>", 
    "end_date": null, 
    "title": "Polish Language for Beginners: Master Polish Quickly!", 
    "price": "35.00", 
    "instructors": "Janusz Przychodzen, Remi Dudek", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600084_397a_11.jpg", 
    "course_url": "https://www.udemy.com/polish-language-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T05:26:22Z"
}