{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>January 2016 Update: New premium bonuses added! I'll keep you update with the best supplement to keep your Prezi WoW!</strong></p><p><strong><u>More than 1000+ satisfied students.</u></strong></p><p><strong>Course </strong><strong>Description</strong></p><p>Learning how to use Prezi at the right way, give you the ability to spread your idea in innovative and excited way rather than the boring slides.</p><p><strong>Build a strong Prezi Presentation from scratch with this straight forward course</strong></p><p><strong>Content and Overview </strong></p><p>Suitable for beginner and intermediate level of using Prezi, through this course of 37 lectures and more than 2 hours of pure content you'll</p><p><strong>What am I going to get from this course?</strong></p><ul><li>Over 37 lectures and 2+ hours of content!</li><li>Learn how to use Prezi from a professional trainer from your own desk.</li><li>Learn how Experts plan their presentations before start designing Prezi.</li><li>Learn the basics ( Add/adjust text, images, video, audio, frames and shapes )</li><li>How to use the online and offline version from Prezi</li><li>Learn how to convert your powerpoint file into Prezi to save your time.</li><li>Learn the best practice to work with your team in Prezi</li><li>How to Zoom in the right way, without letting your audience getting bored</li><li>How to get impressive media for your presentation</li><li>You'll learn how to earn money by the experience you've gained during the course.</li></ul><p>I'm so excited to let you in on with Power Prezi Course, <strong>Lets get Started</strong> !</p>", 
    "end_date": null, 
    "title": "Power Prezi | Boost Your Energy on Presentations", 
    "price": "20.00", 
    "instructors": "Ahmed Eleyan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562830_cf1b_4.jpg", 
    "course_url": "https://www.udemy.com/power-prezi/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T17:10:35Z"
}