{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t This course is designed to further your understanding of structured query language (SQL) for manipulating business data.  </p>  <p>  \t Once you have the basics mastered you can take your knowledge to the next level to fully harness the power of Microsoft SQL Server as well as look at how to maximise the performance of any SQL that you write.  </p>  <p>  \t The course contains walk through videos, printed documents of the course material as well as links to resources you need to be able to carry out the course.  </p>  <p>  \t The course does assume a good working knowledge of SQL to get the most out of this course. If you want an introductory course then I have also authored a course for beginners (https://www.udemy.com/practical-sql-skills-from-beginner-to-intermediate/).  </p>  <p>  \t If you need to access any data be it online or within your own company then this course is for you. Financial systems form the hub of any business these days and many job roles require some level of SQL ability. This course will equip you with the knowledge you need to perform these tasks within your business or employment to improve your prospects.  </p>  <p>  \t Most business systems utilise some form of SQL database, typically Microsoft SQL Server which is why this course focuses on that particular product. Additionally we can download a free &#039;express&#039; version of the product to work through the course.  </p>", 
    "end_date": null, 
    "title": "Practical SQL Skills from Intermediate to Advanced", 
    "price": "30.00", 
    "instructors": "Gary Kind", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96072_7d62_2.jpg", 
    "course_url": "https://www.udemy.com/practical-sql-skills-intermediate-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-23T14:26:17Z"
}