{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course will teach you the best practise approach that fuelled over fifty Service Management implementations around the world. Not only will it give you the background and context you need, you'll also leave with the tools you need <em>and</em> a proven approach on how to use them, to implement and improve your service management processes, sustainably!</p><p>Are you done with overpriced Service Management courses?</p><p>Research shows that about 75-85% of all corporate projects fail: they either completed over budget, much later than planned, or didn't complete at all. Hiring and firing temporary, external and expensive expertise through a consulting firm doesn't bring the sustainable results we're after: once the consultant leaves the knowledge often leaves as well, leaving you to gradually regress to square one.</p><p>This course will teach you all the basics you need to know about managing service in your organization. Knowing the best practise approach that fuelled over fifty Service Management implementations around the world will not only give you the background and context you need: you'll leave with the tools you need and a proven approach on how to use them to implement and improve your service management processes, sustainably!</p><p>Using a case study we'll introduce all these best practice processes. With the principles from this course you can start to establish a service baseline within any service organization. You'll also come equipped with best practise implementation ideas that will provide you with practical guidance to take the service levels and process understanding within your organization to the next level.</p>", 
    "end_date": null, 
    "title": "Practical IT Service Management Foundations", 
    "price": "50.00", 
    "instructors": "Wilko Van De Kamp", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527004_049e_7.jpg", 
    "course_url": "https://www.udemy.com/service-management-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-12T19:20:44Z"
}