{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>**930 students from 92 different countries in only 2 months!</strong></p><p>“Practical Steps to Overcoming Performance Anxiety\" is a <strong>focused, effective</strong><strong>, course for any performer who wants to be more confident on stage</strong>. Professional dancers, musicians, actors, conductors, and aspiring performers are all welcome. This course will help you get rid of that unnecessary pain and suffering, and let you stay focused and positive before and during your upcoming show. Non-performers can certainly join the class as well, as they may find interesting insights to help them at their next public speaking event.</p><p>I am Luciane Cardassi, a professional concert pianist with a doctorate in Piano Performance and more than 2 decades of performance experience. <strong>I had serious issues with stage fright early in my career</strong>, and I know it can be exhausting to be a performer if you feel terrified every time you go on stage. </p><p>We will go over the <strong>roots of your anxiety, practical steps to overcoming the anxiety, and how to stay focused on stage</strong>. By the end of the course you will have developed your own personalized pre-performance routine, with techniques that work for you.</p><p>The course is structured in 7 sections and 27 lectures, with a number of exercises and quizzes. In about 60 minutes you will have covered the lecture content. </p><p>Take this course to learn new coping techniques so you can <strong>perform with more joy, trust and confidence</strong>!</p><p>****THIS IS WHAT THE STUDENTS ARE SAYING:</p><p>“This course was amazing, in a really short time <strong>it teaches you a new awareness and self-confidence that allows you to better face anxiety both on stage and in life</strong>.”  Giulia Frascione</p><p>\"FANTASTIC! Precise, straightforward and very helpful. <strong>A gift for life to ALL performers!</strong>\"  Lorena Orozco</p><p>\"A great contribution to this important topic! Very practical and systematically thought-out. <strong>I will definitely recommend to my students and colleagues</strong>. \"Colleen Athparia<br></p><p>\"<strong>Very useful advice for performers and teachers</strong>.This has given me some practical and concise advice to help my students. Thank You.\"  Michelle Todd<br></p><p>\"<strong>The course is fantastic and filled with super useful information and exercises.</strong> Don't miss out. Good material for seasoned pros and students alike.\" Alejandro Ochoa</p><p>“Professionally presented, and most importantly she is real. She shares her own challenges as a performer and how she triumphed over them. This authenticity allowed me to connect with her and enhance my trust of her teachings. I’m not a musician but I do speak on platforms to audiences so <strong>I was able to use all of her suggestions to reduce my stress and enhance my ‘performance’ while having FUN</strong>.” Dr. Louis Corletto</p>", 
    "end_date": null, 
    "title": "Practical Steps to Overcoming Performance Anxiety", 
    "price": "20.00", 
    "instructors": "Luciane Cardassi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557336_7182_4.jpg", 
    "course_url": "https://www.udemy.com/practical-steps-to-overcoming-performance-anxiety/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T16:59:25Z"
}