{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t           Choice-Based Conjoint, also often called Discrete Choice Experimentation, is a powerful research and management tool that allow us to understand and predict people&#039;s preferences. Whether it is a manager wanting to predict product preferences, a health researcher wanting to explore the treatment preferences of patients, or a transport engineer examining people&#039;s choices of public transport this tool can provide the insight needed.  </p>  <p style=\"\">  \t              This course starts with an introduction to the capabilities and applications of Choice Based Conjoint that is suitable for all audiences. It explains the basic requirements of a CBC research project, and details the outputs that can be obtained. The course then continues on to more advanced topics where you will get training and hands on experience developing and running a CBC project. This includes design, data collection, analysis and reporting of results.  </p>  <p style=\"\">  \t              This course is suitable for managers, marketing/business researchers, and academic researchers interested in building an understanding of CBC.  </p>  <p style=\"\">  \t               If you are a PhD student I am happy to provide a discounted rate for this course. Please contact me through the Udemy messaging service. Provide your university email address, your name, and a link to your supervisor&#039;s profile on your university website.  </p>", 
    "end_date": null, 
    "title": "Predict Consumer Decisions with Choice-Based Conjoint", 
    "price": "45.00", 
    "instructors": "Luke Greenacre", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63594_678b_8.jpg", 
    "course_url": "https://www.udemy.com/learningcbc/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-03T10:35:44Z"
}