{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<ul style=\"\">  \t<p>  \t\t    This course provides the process guidelines in a framework identifying the essential activities to be carried in developing a proposal.  \t</p>  \t<p>  \t\t    The framework has been developed keeping in view the following best practices followed for business acquisition across IT Solutions and Service providers:  \t</p>  </ul>  <ol style=\"\">  \t<li>Study thoroughly the RFP released by the buyer for the needs and problems stated explicitly or otherwise</li>  \t<li>Develop a solution that not only meets the stated requirements of the customer but exceeds the expectations.</li>  \t<li>Indicate the features of your solution and explain how they benefit the customer</li>  \t<li>Be always compliant with the RFP</li>  </ol>  <ul style=\"\">  \t<p>  \t\t    A winning proposal can be differentiated by its executive summary which brings out the value proposition for the customer in engaging with the vendor on long term basis.  \t</p>  \t<p>  \t\t<strong style=\"\">Course delivery:</strong>  \t</p>  \t<p>  \t\t    The framework consists of four phases and each phase has specific modules to be completed before proceeding to the next phase.  \t</p>  \t<p>  \t\t    All the activities to be performed end to end, from receiving the RFP released by the customer to the awarding of the contract are organized across different modules.  \t</p>  \t<p>  \t\t    The activities are performed by the proposal management team which has representation from different functional areas within the organization.  \t</p>  \t<p>  \t\t    There are quality gates to be cleared before proceeding to the next phase.  \t</p>  \t<p>  \t\t<span>The Case Study with a sample RFP will help you to evaluate your understanding of the framework and its adaptation in real world scenario. There are 45 templates used in creating the response to the sample RFP, which you can download for future reference.</span>  \t</p>  \t<p>  \t\t<span>This course has 2.5 hours video,20 lectures, 8 quiz sets.</span>  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Presales Management - IT Solutions & Service Providers", 
    "price": "20.00", 
    "instructors": "Kamaraju Turaga", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/391902_ff16_3.jpg", 
    "course_url": "https://www.udemy.com/presales-management/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T10:40:42Z"
}