{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong>Aprende cómo diseñar presentaciones dinámicas, multi-dimensionales y atractivas que conecten con tus ideas de la manera más efectiva y asombren a tu público.</strong>  </p>  <p>  \tEsta es tu oportunidad para conseguir que tu próxima presentación no sea gris y aburrida. Con Prezi puedes crear una presentación de alto nivel, moderna y dinámica en unos pocos clics.  </p>  <p>  \tEste curso te va a convertir en especialista de Prezi con sólo un par de semanas de dedicación a mirar las lecciones que están diseñadas pedagógicamente para que sean fáciles de comprender y sencillas en su aplicación.  </p>  <p>  \tNo tienes excusas, ¡es rápido, es divertido, es práctico y es eficaz!  </p>  <p>  \tAdemás Prezi es un software totalmente gratuito y disponible online -no necesitas instalar nada en tu ordenador- por lo que aún es más cómodo.  </p>  <p>  \t<strong>Tanto si nunca has utilizado esta herramienta y quieres iniciarte como si ya te has lanzado y estás buscando trucos y contenidos avanzados, ¡éste es tu curso!</strong>  </p>  <p>  \tEn un par de semanas, con los vídeos tutoriales donde se muestran una a una todas las herramientas, dominarás Prezi y podrás empezar a asombrar con tus presentaciones.  </p>  <p>  \tEn las diferentes secciones vas a encontrar:  </p>  <ul>  \t<li><span>Cómo crear tu cuenta en Prezi para empezar a practicar desde el minuto 1 y cómo moverte por su entorno de manera ágil.</span></li>  \t<li><span>Cómo incorporar imágenes, vídeos, música, diagramas, fondos... Vas a ver lo fácil e intuitivo que resulta incluir estos elementos y modificarlos a tu antojo.</span></li>  \t<li><span>Cómo impresionar con el efecto 3D, las rotaciones y los zoom de la manera más sencilla.</span></li>  \t<li><span>Cómo controlar el movimiento de tu presentación, como un Director de Cine, podrás decidir plano a plano cómo animar tus ideas.</span></li>  \t<li><span>Cómo presentar tus Prezis cuando te toque mostrarlas al público, sea en la misma sala o a distancia.</span></li>  \t<li><span>Y muchos otros complementos y herramientas extra como: compartir, trabajar colaborativamente, importar y exportar...</span></li>  </ul>  <p>  \t<strong>Te va a encantar lo fácil que va a ser para ti crear presentaciones profesionales, atractivas y efectivas. Tus ideas van a calar extraordinariamente y vas a contar con la complicidad y admiración de todo tu público.</strong>  </p>", 
    "end_date": null, 
    "title": "Presentaciones con Prezi", 
    "price": "30.00", 
    "instructors": "Ivan Carnicero", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203834_464d_2.jpg", 
    "course_url": "https://www.udemy.com/presentaciones-dinamicas-con-prezi/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-23T12:27:42Z"
}