{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Prototipo de curso online para ONGs realizado por Wingu ONG y Techsoup global sobre \"Presentaciones Efectivas\".</strong></p><p>Muchos de nosotros todos los días  necesitamos crear o armar presentaciones y dar o realizar presentaciones en nuestras organizaciones, y solemos hacer esto para compartir información y hacer que las personas realicen acciones que nosotros necesitamos. Pero mucho de nosotros nos ponemos muy ansiosos y nerviosos cuando pensamos en dar nuestra presentación en frente de una audiencia o público!</p><p>¿Les gustaría ser más efectivos con sus presentaciones? ¿Les gustaría tener más confianza a la hora de armar una presentación y dar la presentación a su público? Si es así este curso es para ustedes/vos!</p><p>En este curso adquirirán habilidades en tres áreas específicas: </p>  <p>Primero, antes de empezar con el uso del software para presentaciones PowerPoint, aprenderán los elementos básicos que tiene cualquier presentación. En esta sección aprenderán cosas tales como focalizar su presentación en torno a las necesidades de su audiencia y como crear un flujo lógico para tu presentación.</p><p>En segundo lugar, vamos aprender habilidades clave en torno a cómo crear efectivamente un software de presentación como el PowerPoint. Les enseñaremos formas relativamente simples de usar estas herramientas correctamente, para que puedan hacer más fuerte su mensaje, en vez de distraerlos de el.</p><p>Y finalmente, aprenderán habilidades sobre como dar su presentación a la audiencia con más confianza y facilidad.</p>  <p>Al final del curso, ustedes serán capaces de transformar su presentación del concepto a la realidad, hacer una presentación efectiva con herramientas como PowerPoint, y estarán listos para realizar su presentación con más equilibrio y precisión.</p>Esperamos verlos en las clases!", 
    "end_date": null, 
    "title": "Presentaciones Efectivas para ONGs", 
    "price": 0, 
    "instructors": "Agustina Calcagno", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450376_6607.jpg", 
    "course_url": "https://www.udemy.com/presentaciones-efectivas/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T15:33:13Z"
}