{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t  For years now, PowerPoint has been the standard for creating and showing presentations to audiences of any size on any topic imaginable.  Well, move over PowerPoint - there&#039;s a new kid on the block!  </p>  <p style=\"\">  \t  Introducing Prezi - an exciting and dynamic presentation tool that can be used online for free!  If you are tired of the &#039;same old thing&#039; when it comes to creating and watching presentations, Prezi can add life and excitement to any topic you want to present.  </p>  <p style=\"\">  \t  This course is designed for anybody who is new to Prezi and wants to learn how to create dynamic presentations.  No experience is required - even if you have never used PowerPoint before, you will be up and running in no time with Prezi.  </p>  <p style=\"\">  \t  There are two separate presentations we will make in the course.  We will start off with an easy one that relies on the templates and built-in helpers that Prezi has to offer to get you started quickly and easily.  We will then dive deeper into Prezi and create a presentation from scratch.  This way you will learn how to have more control over the customization of Prezi to get the exact &#039;look and feel&#039; you desire.  The second Prezi will look at advanced ways to customize the 3-D background, fonts, colors and animation of your presentation.  </p>", 
    "end_date": null, 
    "title": "Present Like A Pro With Prezi:  Break Free from Powerpoint", 
    "price": "50.00", 
    "instructors": "John Martens", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236570_f631_4.jpg", 
    "course_url": "https://www.udemy.com/prezi-2014/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-03T18:09:35Z"
}