{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><span style=\"color: inherit;\">Lernen Sie einfach und schnell </span><span style=\"color: inherit;\">Prezi Präsentationen zu erstellen!</span></strong><br></p>  <p>  \t      Seit mehreren Jahren erstelle ich Prezi Präsentationen für Konzerne und Werbeagenturen. Diese neue Art der Präsentation grenzt sich deutlich von typischen PowerPoint Präsentationen ab. Statt linear Folie für Folie zu zeigen, wird auf dynamische Weise von einem Objekt zum nächsten gefahren.  </p>  <p>  \t      Nicht jede Firma oder jedes Start-up verfügt jedoch über ein entsprechendes Budget um eine Prezi umsetzen zu lassen. Aus diesem Grund habe ich mich entschlossen, mein Wissen über Prezi in diesem Online Kurs zu bündeln. Neben den Programmfunktionen zeige ich Ihnen  worauf es bei einer überzeugenden Prezi ankommt und wie Sie sich ideal vorbereiten können.  </p>  <p>  \t      Mit Prezi können Sie Ihre Präsentation in eine unterhaltsame Geschichte verpacken. Das Arbeiten mit Kamerafahrten und Zooms bietet viele Möglichkeiten.  </p>  <p>  \t<strong>Warum Prezi interessant für Ihr Unternehmen ist?<br>  \t</strong>Durch die leichte Integration von Videos und Bildern hilft Ihnen Prezi, Ihre Inhalte überzeugend zu transportieren. Sie können Prezi verwenden, um z.B. Ihr Produkt zu erklären oder Ihr Unternehmen vorzustellen.  </p>  <p>  \t<strong>Für welche Zielgruppe ist der Kurs?<br>  \t</strong>Der Kurs ist für jeden geeignet. Es werden keinen Vorkenntnisse benötigt. Es ist egal, ob Sie im Marketingbereich arbeiten, Unternehmer sind oder Trainer, der auf neuem Weg seine Inhalte kommunizieren möchte.  </p>  <p>  \t<strong>Was beinhaltet der Kurs?<br>  \t</strong>Der Kurs beinhaltet über 40 Videos in HD-Qualität. Sie werden nicht nicht nur das Programm erlernen, sondern auch Tipps bekommen, was eine erfolgreiche Prezi ausmacht. Weitere Themen sind die Vorbereitung und das überzeugende Präsentieren. Nach dem Kurs sind Sie in der Lage, eigenständig eine Prezi Präsentation zu konzipieren und umzusetzen.  </p>  <p>  \t<strong>Auszug der Themen: </strong>  </p>  <ul>  \t<li>Das Prinzip von Prezi </li>  \t<li>Die Grundlagen im Überblick  - </li>  \t<li>Fortgeschrittene Techniken (z.B. Einsatz 3D Hintergrund)</li>  \t<li>Produktion eines Videos Ihrer Prezi</li>  \t<li>Informationen was eine überzeugende Prezi ausmacht</li>  \t<li>Vorbereitung und Tipps für das überzeugende Präsentieren</li>  \t<li>Wie Sie Ihre Stimme bewußt einsetzen können </li>  </ul>", 
    "end_date": null, 
    "title": "Prezi für Einsteiger: Lernen Sie mit Prezi zu begeistern", 
    "price": "50.00", 
    "instructors": "Florian Lapiz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378518_3839.jpg", 
    "course_url": "https://www.udemy.com/uberzeugend-mit-prezi-prasentieren/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T12:35:17Z"
}