{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>¿Cansado de crear presentaciones lineales y predecibles? Pues, prepárate para sorprender a tu audiencia. Te invito a salir de tu zona de confort con PREZI. Hola, mi nombre es Amanda Jusino y esto es Pizca Educativa.</p><p> ¡Bienvenido al curso de <strong style=\"\">PREZI: Crea presentaciones Premium! </strong>Y estoy súper contenta de que estés aquí. Quizás te estarás preguntando: ¿Este curso es adecuado para mí? Pues, 1ro lo 1ro. Te pregunto:</p><ol style=\"\"><li>¿Quieres impresionar y captar la atención de tu público objetivo?</li><li>¿Quieres crear presentaciones dinámicas y profesionales sin mucho esfuerzo?</li><li>¿Deseas proyectarte como un recurso de alto nivel que domina la tecnología?</li></ol><p>Si es así, ¡llegaste al lugar correcto! Junto a mí aprenderás a dominar una herramienta online que te permitirá manejar un Canvas Ilimitado como todo un artista. ¿Y lo mejor? Es rápido, fácil y divertido. </p><p>Este curso es excelente para profesionales como tú que ofrecen o desean ofrecer talleres, cursos, seminarios o conferencias de forma presencial o en línea.</p><p>Así que si eres coach, conferenciante, consultor, profesor, estudiante, vendedor, entre muchas otras profesiones en general… <strong style=\"\">este curso es para ti.</strong></p><p>¿Por qué? Por que es totalmente práctico y dinámico. Está basado en vídeos, pdf&#039;s descargables, quizzes y tareas que podrás realizar a tu propio ritmo. </p><p>Comienza desde lo básico de PREZI y te lleva poco a poco hasta un nivel avanzado con el que podrás lucirte en tus próximas presentaciones.</p><p>Aprenderás de diseño, diagramación y animación básica para que seas capaz de realizar presentaciones impresionantes.</p><p>Como profesora de diseño gráfico, todo el tiempo debo estar preparando presentaciones para mis estudiantes. Es increíble como se maravillan cuando ven mis presentaciones realizadas en PREZI vs las que realizaba en el típico PPT. Inclusive, se motivan y me preguntan: Profe, ¿dónde usted hizo esa presentación? </p><p>De igual manera me ha pasado esto en los diferentes talleres que he tenido la oportunidad de ofrecer a colegas profesores, entre otros profesionales.</p><p>Deseo que <strong style=\"\">tú</strong> tengas las misma oportunidad que ellos y que lleves<strong style=\"\"> tu imaginación</strong> a otro nivel. Esta herramienta es la clave para captar y mantener la atención de tu público objetivo.</p><p>Mi experiencia como profesora me ha llevado a realizar un curso completamente dinámico. Los videos son cortos y van al grano. Además, las tareas son divertidas lo que te ayudará a aprender con mayor facilidad, e inclusive podrás recibir mi feedback y el de tus compañeros del curso al realizar tus tareas.</p><p>En este curso lograrás:</p><ul style=\"\"><li>Diseñar presentaciones digitales dinámicas e interactivas de alto nivel que proyecten profesionalismo y calidad.</li><li>Crear presentaciones que podrán ofrecerse tanto online como presenciales y de manera remota con su celular, tableta o laptop.</li><li>Editar las presentaciones ya realizadas desde cualquier computadora con acceso a Internet donde y cuando quieras.</li></ul><p>¿Para quién es este curso?</p><ul style=\"\"><li>Este curso es para profesionales que ofrecen o desean ofrecer talleres, cursos, seminarios o conferencias de forma presencial o remota y desean proyectarse como recursos de alto nivel que domina la tecnología.</li><li>Es excelente curso para coaches, conferenciantes, consultores, profesores, estudiantes, vendedores, líderes y profesionales en general que deseen dominar una herramienta más poderosa que el típico Power Point.</li><li>Este curso no es para profesionales que ya tienen conocimiento avanzado en la herramienta online Prezi.</li></ul><p>¿Qué conocimientos previos debes poseer?</p><ul style=\"\"><li>Los estudiantes deben tener conocimiento previo básico en el uso y manejo de la computadora y el Internet. </li><li>Los estudiantes deben tener acceso a una laptop o computadora desktop.</li><li>Los estudiantes deben tener acceso al Internet.</li></ul>", 
    "end_date": null, 
    "title": "PREZI: Crea presentaciones Premium", 
    "price": "50.00", 
    "instructors": "Amanda Jusino", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529166_9480.jpg", 
    "course_url": "https://www.udemy.com/prezi-crea-presentaciones-premium/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T03:41:35Z"
}