{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>PRojects In a Controlled environment (PRINCE2) Foundation is a methodology used in Project Management to improve Project management skills. PRINCE2 Foundation is the basic level of PRINCE2 certification level that enhances the skills required to manage the projects and handle risks efficiently. This course has been developed by GreyCampus, an Accredited Training Organization of PEOPLECERT.</p>\n\n<p>This PRINCE2 course content not only explains the benefits of the PRINCE2 methodologies, but also demonstrates the best way to achieve the PRINCE2 Foundation certification. This course prepares participants to clear the PRINCE2 Foundation Examination. Once you clear the foundation exam you will be eligible for PRINCE2 Practitioner certification.</p>\n\n<p>Take the first step towards becoming a PRINCE2 Foundation certified professional by enrolling into this course.</p>\n\n<p><strong>How to become PRINCE2 Foundation certified?</strong></p>\n\n<ol><li>Go through the course content and use the practice quizzes at the end of each chapter to test your understanding. Where needed, watch the videos again and refer the PRINCE2 manual to solidify your understanding.</li><li>Optionally, take the Mock exams and check your readiness for the exam. Fill any gaps by going back to your preparatory mode and once you feel confident of taking the exam, go for it.</li><li>The PRINCE2 Foundation certification exam booking can be facilitated by GreyCampus; PEOPLECERT administers the exam, and as per your convenience you can take it online. To take up the exam online you need to have a webcam and accept that you will follow the proctoring guidelines set by the examination authority. </li></ol>\n\n<p>Please note that, the certification exam, PDU certificate and mock tests costs are not included in the price of the course. <br></p>", 
    "end_date": null, 
    "title": "Prince2 Foundation Training", 
    "price": "20.00", 
    "instructors": "GreyCampus Inc.", 
    "commitment": "23 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274478_7d4f_5.jpg", 
    "course_url": "https://www.udemy.com/prince2-foundation-training/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T13:13:37Z"
}