{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>O módulo de Direito Civil é ministrado pelo Professor <strong>Sandro </strong><strong>Gaspar Amaral</strong>, Mestre e docente da <strong>EMERJ, FEMPERJ, FESUDEPERJ </strong>e Professora <strong>Rachel Delmas </strong><strong>Leoni</strong>, <strong>Mestre</strong> e docente de Direito Civil e Processo Civil e dos principais cursos preparatórios do Rio de Janeiro e de cursos on-line. </p>\n\n\n\n\n\n<p>O curso PROAB foi construído de forma a propiciar a revisão e o aprofundamento dos principais conteúdos ministrados ao longo do Curso de Graduação, oferecendo ao candidato aulas e material voltados ao Exame da OAB, considerando suas tendências e suas peculiaridades.\n\n  </p>\n\n<p>Coordenação Pedagógica: Ana Paula Delgado</p><p><strong>Rachel Louise Delmas Leoni </strong></p>\n\n\n\n<p>Graduada em Direito pela Universidade Estácio de Sá, Especialista em Direito Civil e Processo Civil, pela Universidade Estácio de Sá em 2004. Especialista em Direito Civil-Constitucional pela UERJ. Mestre em Direito, PUC-Rio. Professora dos cursos de Graduação e Pós -Graduação da Universidade Estácio de Sá. Advogada.</p>\n\n\n\n<p><strong>Sandro Gaspar Amaral </strong></p>\n\n\n\n<p>Graduado pela Universidade Federal do Rio de Janeiro UFRJ. Especialista em Direito Civil e Processo Civil pela Universidade Estácio de Sá. Sócio da Porto Amaral advogados. Professor de Direito Civil da graduação e da pós-graduação da Universidade Estácio de Sá. Professor de Direito Civil da Escola da Magistratura do Estado do Rio de Janeiro EMERJ, da Escola Fundação de Ensino Superior do Ministério Público do Estado do Rio de Janeiro FEMPERJ, da Escola da Associação dos Membros do Ministério Público do Estado do Rio de Janeiro AMPERJ, da Escola Fundação de Ensino Superior da Defensoria Pública do Estado do Rio de Janeiro FESUDEPERJ. </p>", 
    "end_date": null, 
    "title": "PROAB - \t1ª Fase: Módulo Direito Civil", 
    "price": "35.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "24 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785308_63d0.jpg", 
    "course_url": "https://www.udemy.com/estacio-proab-1a-fase-modulo-direito-civil/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T19:19:48Z"
}