{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>O módulo de Direito Tributário é ministrado pelo Professor <strong>Claudio Carneiro</strong>, <strong>Advogado tributarista</strong>, <strong>Procurador Municipal</strong>, Doutor e docente de Direito Tributário e Financeiro dos principais cursos preparatórios e Universidades do país e <strong class=\"redactor-inline-converted\">Carolina Barboza, Advogada, </strong><strong class=\"redactor-inline-converted\">Mestre e docente de Direito Tributário</strong><strong class=\"redactor-inline-converted\">, professora da Emerj.</strong></p>\n\n<p><strong>Nesse curso você terá acesso ao conteúdo atualizado que permitirá revisar os principais tópicos abordados em provas e concursos.</strong></p>\n\n<p><strong>Claudio Carneiro</strong> <strong>Advogado</strong></p>\n\n<p>Tributarista. Professor de Direito Tributário e Financeiro. Doutor em Direito pela UNESA/RJ. Mestre em Direito Tributário. Pós-graduado em Direito Tributário e Legislação de Impostos. Auditor do Tribunal de Justiça Desportiva do RJ. Procurador Municipal. Autor de várias obras e artigos jurídicos. Seus livros, hoje na 5ª edição pela Editora Saraiva, se tornaram referência e ferramenta indispensável para a preparação para o Exame da OAB.A coleção, além de ser utilizada nos cursos de graduação e pós-graduação de diversas Universidades no Brasil, passou a ser adotada também como bibliografia básica em vários concursos públicos, tornando-se ferramenta indispensável para a preparação para o Exame da OAB.</p>\n\n<p><strong>Carolina Barboza Lima Barrocas </strong></p>\n\n<p>Possui graduação em Direito pela Universidade Cândido Mendes (2000) e mestrado em Direito pela Universidade Cândido Mendes (2005). Atualmente é professora auxiliar da Universidade Cândido Mendes (licenciada) e da Universidade Estácio de Sá, professora palestrante da Escola da Magistratura do Estado do Rio de Janeiro e coordenadora do curso de pós-graduação em Direito Tributário da Universidade Estácio de Sá.</p><p><br></p>", 
    "end_date": null, 
    "title": "PROAB - \t1ª Fase: Módulo Direito Tributário", 
    "price": "25.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765606_9888.jpg", 
    "course_url": "https://www.udemy.com/estacio-proab-1a-fase-intensiva-direito-tributario/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T17:22:53Z"
}