{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>O módulo de Direito do Consumidor é ministrado pelo Professor <strong>Renato Porto</strong>, Especialista e docente nos cursos preparatórios da <strong>EMERJ</strong>, cursos preparatórios para carreiras jurídicas e Exame da OAB. </p>\n\n\n\n\n\n<p>O curso PROAB foi construído de forma a propiciar a revisão e o aprofundamento dos principais conteúdos ministrados ao longo do Curso de Graduação, oferecendo ao candidato aulas e material voltados ao Exame da OAB, considerando suas tendências e suas peculiaridades.\n\n  </p>\n\n<p>Coordenação Pedagógica: Ana Paula Delgado</p><p><strong>Renato César de Araújo Porto</strong></p>\n\n<p><strong></strong>Mestre em Direito pela UNESA, Doutorando em Direito pela UNESA e pela Universidade de Burgos (Espanha), Especialista em Didática de Ensino Superior, Direito Civil, Direito Processual Civil, Direito do Consumidor, Responsabilidade Civil. Atualmente, Diretor do Instituto Brasileiro de Política e Direito do Consumidor (BRASILCON), Professor do Programa de Pós Graduação da Universidade do Estado do Rio de Janeiro (UERJ), Professor da Escola de Magistratura do Estado do Rio de Janeiro (EMERJ), Escola Fundação de Ensino Superior do Ministério Público do Estado do Rio de Janeiro (FEMPERJ), Escola da Associação dos Membros do Ministério Público do Estado do Rio de Janeiro (AMPERJ), Fundação Escola Superior da Defensoria Pública do Estado do Rio de Janeiro (FESUDEPERJ) e da UNESA. Coach Profissional (CIBRACOACH ) e sócio do escritório Porto Amaral Advogados S/C.</p>", 
    "end_date": null, 
    "title": "PROAB - \t1ª Fase: Módulo Direito do Consumidor", 
    "price": "25.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/774124_115a.jpg", 
    "course_url": "https://www.udemy.com/estacio-proab-direito-do-consumidor/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T16:52:19Z"
}