{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Este curso foi concebido tendo em atenção o programa de Probabilidades e Combinatória para o 12º ano da disciplina de Matemática A.</p>\n\n<p><br>As probabilidades fornecem conceitos e métodos para estudar casos de incerteza e para interpretar previsões baseadas na incerteza.</p>\n\n\n\n<p><br>Este tema constitui uma excelente oportunidade para a introdução de uma axiomática, permitindo que os estudantes tenham uma melhor compreensão do que é a atividade demonstrativa em Matemática.</p>\n\n<p><strong>CONTEÚDOS PROGRAMÁTICOS</strong></p>\n\n<p><strong></strong>Experiência Aleatória e Espaços com Acontecimentos<br>Acontecimentos e Operações com Acontecimentos<br>Probabilidades e Propriedades das Probabilidades<br>Regra da Adição e Acontecimentos Incompatíveis<br>Probabilidade Condicionada<br>Probabilidade da Interseção de Acontecimentos<br>Acontecimentos Independentes<br>Teorema da Probabilidade Total e Teorema de Bayes<br>Princípio Fundamental da Contagem<br>Arranjos sem Repetição<br>Factorial de um Número Natural<br>Arranjos com Repetição<br>Permutações<br>Combinações<br>Triângulo de Pascal<br>Desenvolvimento Binómio de Newton<br>Distribuição de Probabilidade<br>Modelo Binomial<br>Modelo Normal</p>\n\n<p><strong>AUTORAS</strong></p>\n\n<p><strong></strong>Ana Paula Lopes | ISCAP | aplopes@iscap.ipp.pt<br>Filomena Soares | ESEIG | filomenasoares@eu.ipp.pt<br>Maria Hermínia Ferreira | ISEP | mhf@isep.ipp.pt<br>Marta Amorim | ISEP | marta.amorim13@gmail.com</p>\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Probabilidades e Combinatória", 
    "price": 0, 
    "instructors": "Matemática 100 STRESS", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801864_c7ef_4.jpg", 
    "course_url": "https://www.udemy.com/m100s-probabilidades-e-combinatoria/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T13:35:21Z"
}