{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tPaul has given more than 2,500 presentations and has helped more than 35,000 people reach their dream of being a public speaker. He gave his first speech at age 12 and was being paid to speak by the time he was 16.</p><p>In this course you will receive...</p><p><strong>STEP BY STEP TRAINING</strong></p><p>Clear, precise, applicational training that you can use immediately.</p><p><strong>CONFIDENT SPEAKING</strong><br></p><p>This course provides everything you need to present without fear!</p><p><strong>DETAILED CASE STUDY</strong></p><p>You will see a presentation being built on the fly from an impromptu audience member topic.</p><p><strong>ACCELERATED RESULTS</strong></p><p>You can become a better speaker right now without having to travel or spend 3 days in a seminar room</p><p>Dear Speaker,</p><p>Does doubt about your message overwhelm you when you speak? Palms sweating? Heart thumping? Throat lumping? Knees knocking? Memory fading? Armpits streaming? Lungs panting? Legs shaking? Voice earthquaking? Mouth caking like seared mud in the desert?</p><p>Amazingly, most people spend time searching the net for THE secret to overcoming their fear of speaking. Many download all the free answers they can find. They practice breathing techniques, positive visualization, but find them shallow and unhelpful. In fact, such \"techniques\" can actually <u>increase</u> anxiety.</p><p>Yet, if you ask those same people if they have a solid outline. An unforgettable message. A lecture or speech of encouragement. A presentation so good the audience will walk away richer for having been there. They won't have a clue.</p><p>Listen.</p><p>If you are not convinced you have a surefire, can't miss, blow their minds message, no amount of \"fear calming techniques\" will do you any good. <strong>If you are <u>NOT</u> stepping to the microphone with a winning speech, <u>you should be afraid</u>.</strong></p><p>But it doesn't have to be that way! You can step forward with confidence.</p><p><strong>Public Speaking Mastery will allow you to...</strong></p><ul><li>Stand before an audience without fear. Fear paralyzes and prevents you from doing your best. You'll get an entire special report on the issue and you'll get it as a FREE bonus.</li><li>Let your ears flood with compliment after compliment about your great speaking.</li><li>Wow the crowd with your content.</li><li>Hear the audience laugh and have fun. See their smiles.</li><li>Watch people lean forward in their seats as they <u>hang on your every word.</u></li><li>Captivate the crowd. Make them glad they didn't miss your event.</li><li>Create a great talk in l<em>ess time than watching a couple of sitcoms</em>.</li><li><u>Stay on track without getting derailed</u>. Keep your message tight.</li><li>Rest assured that what you share will make a long-term difference in the lives of the audience.</li><li>Help others transform their lives.</li><li>Motivate people to achievement.</li><li>Be accepted and find belonging as a speaker, not a wannabe.</li><li>Do more than just get through the talk, get good.</li></ul><p>***Plus...Here's a silent bonus no one tells you about: Increase Your income. Studies show that 87% of a person's earning potential is directly linked to public speaking skills</p><blockquote><em>Paul has a knack for engaging audiences–and teaching others how to do the same. He makes the difficult seem doable by providing simples, practical steps. </em><br>Erin Casey, \teditor, Success Magazine</blockquote><p><strong>SUCCESSFUL PUBLIC SPEAKING CONSISTS OF 3 ELEMENTS...</strong></p><p><em>1. CONTENT.</em></p><p>A message packed with practical, easy to remember, and useful information. It must be memorable and portable.</p><p><em>2. CONFIDENCE.</em></p><p>Knowing that what you share will be valuable and useful, and that you are the one to share it.</p><p><em>3. CONNECTION.</em></p><p>You must be able to draw the audience into the message. That's what brings the laughter, the tears, the standing ovations.</p><p>Not only will the combination of those three erase your fear, they will keep you from being dull and boring. And whatever you do - don't be dull and boring. Nothing's worse than looking into the audience's eyes...and they're closed!</p><p><strong>Stop Saying \"No\" When You Are Asked to Speak</strong></p><p>Get this system today and accept speaking engagements immediately. The reason most people turn down an opportunity to speak is fear. They're afraid of not knowing what to say, or how to say it. That does not have to be you.</p><p>Public Speaking Mastery erases your excuses. It's practical, relevant, and real. These common questions will be answered:</p><p>1. Is it really possible to speak without being scared?</p><p>2. How do I find information on the subject?</p><p>3. How do I know what material to use?</p><p>4. How do I organize all this information?</p><p>5. Where do I find good illustrations, examples, stories, statistics and other supporting resources - that are good, not the hokey stuff in most books?</p><p>6. What do I talk about?</p><p>7. Should I use notes, memorize my talk, or what?</p><p>You'll get those questions answered <u>and a lot more</u>.</p><p><strong>WARNING: DO NOT BUY ANY BOOK OR COURSE ON PUBLIC SPEAKING UNLESS IT MEETS THE FOLLOWING CRITERIA...</strong></p><p><strong>ONE: It is written by a true professional speaker.</strong> Too many courses and books are from theorists who write about speaking, but don't actually speak. You want a practitioner who speaks to thousands each year on subjects more than just public speaking.</p><p><strong>TWO: Shows you step by step how to develop, design, and deliver YOUR message.</strong> Don't be conned by someone who wants to \"sell you a fish,\" without teaching you how to catch them for yourself.</p><p><strong>THREE: Explains why certain speaking techniques work, not just that they work.</strong> Knowing why helps you understand the reason behind a practice. Without \"why\" you'll never reach your full speaking potential.</p><p><strong>FOUR: You can actually talk with the author or developer.</strong> Unreachable people have no accountability for their product.</p><blockquote>I wanted to tell you that I enjoyed Public Speaking Mastery. I have been speaking and presenting seminars for about 5 years now, mostly as a lead generation tool for my marketing consulting business and products, but I got a lot out of your material.<br><br>Having that experience actually allows me to relate more rapidly to the material in your course. (When you make a point about something not working I can say, Oh, that's why that bombed last week.) The most beneficial part for me was the help in constructing a talk.<br><br>Look forward to the next release. I have decided, mostly due to demand, that I need to start making direct income from my speaking as well.<br>- John Jantsch, \tDuct Tape Marketing</blockquote><p><strong>GREAT SPEAKERS AREN'T BORN... THEY'RE BUILT!</strong><span></span></p><p>I've been speaking as a professional for 31 years. But speaking did not come naturally for me. Possibly like you, I sat in the audience listening to great speakers wishing for that ability.</p><p>I was asked to give a speech, but was scared...terrified. What about getting embarrassed? What if something stupid comes out? What about a mess up? You know what I'm talking about.</p><p>Then I began to study speaking. Checked out every book at the library on the subject. Cleaned out the local bookstores. Shelled out hard earned cash for seminars from the masters. Began giving talks to church youth groups. Then to civic groups. But I still didn't have a clue about what I was doing. Sometimes it went well, and sometimes it bombed. But I kept going - kept studying and kept learning the secrets of effective communication.</p><p>Now I speak to thousands upon thousands of people each year. I speak to multi-million and billion dollar companies. It's not an accident. There's a reason I get invited to speak to these groups. And I don't go in and tell them how to speak. I share subjects that will motivate their people and pump up their profits.</p><p>This speaker's education has been a long (<em>tens of thousands of dollars</em>) learning curve that proved valuable. Now I want to help you - if you'll let me. You'll get the very same formula I use to build captivating messages. You can't believe what a solid message will do for your confidence.</p><p><strong>SPEAK WITH PASSION, OR JUST LEAVE ME A NOTE!</strong><span></span></p><p>It's time to speak with confidence and share your message. This course provides everything you need to design and deliver unforgettable messages.</p><p>Paul B Evans</p>", 
    "end_date": null, 
    "title": "Public Speaking Masterclass : Design . Develop . Deliver", 
    "price": "50.00", 
    "instructors": "Paul Evans", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353760_0b13_3.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-22T13:24:09Z"
}