{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \tAre you just starting to learn QTP/UFT? Are you having issues recognizing objects using this tool? Then this course is for you. It is taught by skilled professionals with 1000s of hours of Automation experience. Once you master these concepts, you will be 1000s of hours ahead of your peers. At the end of the course, you will be able to:  </p>  <p style=\"\">  \t              1. Understand how QTP/UFT identifies objects  </p>  <p style=\"\">  \t              2. Interact with any object that you desire to automate your test cases  </p>  <p style=\"\">  \t              3. Correctly configure your QTP/UFT for your application to make object identification easy  </p>  <p style=\"\">  \t              4. When UFT isn&#039;t recognizing objects, use the correct methods to fix these issues  </p>  <p style=\"\">  \t5. Understand how applications work in the &#039;computer world&#039; and how to interact with those applications.  </p>  <p style=\"\">  \t  This course is quick, easy, and a must when first starting with QTP/UFT. When we first learned these automation tools, we spent hundreds of hours on identifying the same objects that currently take us less than a minute to identify. We don&#039;t want you to go through the same trouble. We want to save you time by giving you all of the tips and tricks we learned to get around the issues of identifying objects with QTP/UFT. This course is absolutely FREE because we believe you will full benefit from it!  </p>", 
    "end_date": null, 
    "title": "QTP Tutorial: Identifying Objects Easily and Quickly", 
    "price": 0, 
    "instructors": "QTP  Tutorial", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346222_c104_2.jpg", 
    "course_url": "https://www.udemy.com/qtp-tutorial-learn-to-properly-and-quickly-identify-objects/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-16T15:17:40Z"
}