{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Microsoft SQL Server is one of the most popular and widely used relational database management systems (RDBMS) in the world.<br>T-SQL is Microsoft’s own version of the standard SQL language used to query Microsoft SQL Server Databases.<br>Transact-SQL is integral to the power of SQL Server. Transact-SQL features allow developers to create scalable, distributed applications to meet the demanding requirements of modern organisations.<br>In this course you will Learn how to setup an SQL Sever environment as well as connect to and query the database using SQL Server Management Studio also known as SSMS.  You will learn how to install the adventureworks2014  sample database  which we will use for this course .You will learn to query one or many different tables using SELECT statements and also about Aliases and why they are used. You will learn about the various types of tables joins used to get data from multiple tables.<br>You will be able to Write SQL code based on ANSI/ISO standards to build Microsoft SQL Server or Oracle database structures , Update database content with SQL and transaction handling and Retrieve data with filter conditions and from multiple tables using various types of join</p><p>Lectures include: <br>Writing SELECT queries<br>Write Transact SQL Queries<br>Table Joins<br>Aliases<br>Null Values<br>Query Multiple Tables</p><p><br></p><p>This is a hands-on practical course that is taught at a pace that you can follow along easily.<br>I look forward to welcoming you to the course.<br></p>", 
    "end_date": null, 
    "title": "Querying Microsoft SQL Server Databases using T-SQL", 
    "price": "20.00", 
    "instructors": "Skill Tree", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542844_2958_2.jpg", 
    "course_url": "https://www.udemy.com/querying-microsoft-sql-server-databases-using-t-sql/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T06:05:40Z"
}