{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>\n\tResolução das 15 questões inéditas baseadas no edital do concurso de 06 de outubro de 2013 para o cargo de Analista do MPU - Área: Tecnologia da Informação e Comunicação - Especialidade: Suporte e Infraestrutura.\n</p>\n\n<p>\n\tAs questões são respondidas de forma detalhada pelos professores da Equipe Dominando TI.\n</p><p>----------------------------</p><p>A equipe \"Dominando TI\" vem sendo formada há mais de 10 anos, reunindo professores altamente especializados que aliam conhecimento sólido das respectivas matérias ao entendimento completo sobre a forma como elas são cobradas em concursos públicos. Todos, sem exceção, com experiências anteriores como professores universitários ou de cursos especializados. Só assim podemos garantir que o conhecimento chega até onde deve: aos alunos.</p>\n\n<p>Essa equipe começou dando aulas nos cursos preparatórios de Brasília. Depois, vieram os cursos online, em videoaulas e por teleconferência. Nos últimos dois anos, passamos a ministrar aulas presenciais em outras capitais: Belo Horizonte, Rio de Janeiro, Fortaleza, Recife e Salvador.</p>\n\n<p>Este site, juntamente com o livro \"Tecnologia da Informação - Questões Comentadas CESPE/UnB\", publicado originalmente pela Editora Campus/Elsevier (e atualmente pelo Grupo GEN), representam mais um passo para levar uma preparação de excelência aos candidatos de todas as localidades.</p>\n\n<p>É importante ressaltar que a aprovação em concursos públicos sempre foi, e continuará sendo, mérito dos candidatos que dedicam semanas, meses e às vezes anos de suas vidas aos estudos. O nosso papel, como professores, é fazer com que esse caminho possa ser trilhado de forma mais eficiente, ao mostrar atalhos e armadilhas espalhados ao longo da estrada.</p>\n\n<p><strong>Sucesso a todos!\nEquipe Dominando TI</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Questões Inéditas de SGDB e SO para MPU - Suporte 2013", 
    "price": 0, 
    "instructors": "Dominando TI", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94098_66d5_4.jpg", 
    "course_url": "https://www.udemy.com/questoes-ineditas-de-sgdb-e-so-para-mpu-suporte-2013/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-18T14:38:14Z"
}