{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<strong style=\"\">Learn the basic structure, shapes, and sounds of the Korean alphabet!</strong>  </p>  <p>  \t   There are 40 letters in Hangul (the Korean alphabet). This course will teach you all of them along with their shapes and sounds. No previous Korean knowledge necessary!  </p>  <p>  \t   This is a quote unquote crash course in Hangul. Even if you have zero experience with Hangul, or Korean in general, this course will guide you step-by-step as you learn to identify, write, and pronounce the letters of Hangul. In this course, you will learn how simple it is to write in Korean while learning the sounds each character makes.  </p>  <p>  \t<strong style=\"\">Tested by History</strong>  </p>  <p>  \t   Prior to the 1440&#039;s, Korean was only read and written in complicated chinese characters (hanja) making it very difficult for anyone outside of high-class individuals to become literate. In 1446, King Sejong The Great <span>announced the creation of a simpler alphabet (Hangul) to try and fix that problem.</span><span> His goal for creating the new alphabet was to </span><strong style=\"\">make it easy enough for anyone to learn to read and write Korean in the matter of a few hours.</strong><span> That&#039;s exactly what he did and that&#039;s exactly what we intend to do in this course. </span>  </p>  <p>  \t<span></span><strong style=\"\">Content and Overview</strong><span> </span>  </p>  <p>  \t<span>   You will begin your journey with a brief history of Hangul and an overview of the structure of Korean words. Once you have a basic understanding of how Korean is structured, we will learn the 10 basic vowel letters and 14 basic consonant letters. After that, we will learn the 5 double consonants and 11 compound vowels. </span>  </p>  <p>  \t<span>    Throughout the course, you will learn how to properly write and structure these letters to form words. It is crucial that you write each character on your own and practicing the pronunciation as we go along. Doing so will help you master each one faster and make it easier when we learn to read and write a few fun words in the final section. </span>  </p>  <p>  \t<span></span><strong style=\"\">Personalized Help</strong><span> </span>  </p>  <p>  \t<span>   As the leader of this course, I understand I have a great responsibility for the learning of my course participants. I take that responsibility seriously and will work hard to see that all of your questions are answered to your satisfaction. It is my goal to answer any question you ask within 24 hours. At the end of the course, there is also a section dedicated to answering your questions where I can answer with a video if necessary.</span>  </p>  <p>  \t<span></span><strong style=\"\">Remember, at the end of the course you will be able to read and write basic words in Korean!</strong><span> </span>  </p>  <p>  \t<span>   Throughout the course there are supplementary documents that you can use to further your study of Hangul. If you take this serious, you will find yourself with a newly acquired skill in Korean in a matter of hours! Let&#039;s get going!</span>  </p>", 
    "end_date": null, 
    "title": "Read and Write 한글 (Hangul): The Korean Alphabet", 
    "price": "20.00", 
    "instructors": "Braden Thompson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383476_71c4_5.jpg", 
    "course_url": "https://www.udemy.com/read-and-write-hangul-the-korean-alphabet/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T21:40:09Z"
}