{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What is this course about?</strong>Linguistic presuppositions is a fascinating topic that when you have a good grasp of will give you amazing insight into the thinking of those you communicate with.  Would you like to enhance your communication skills and your results? Would you like to get to the TRUE meaning in conversation, to understand the true motivation for behaviour</p><strong>Are you interested in Personal development? would you like one of the sharpest tools for understanding others out there? </strong><ul><li>This course contains multiple video to enhance your learning experience </li><li><span></span>PLUS : <strong>as additional resource you get the entire course as an audio series</strong> that you can download and use on your mp3 player or other device</li><li><span></span>Two excellent exercises enable you to fully appreciate and practise your new linguistic skills. Downloadable as printable PDF's</li><li>Linguistic Presuppositions Grab sheet with the Linguistic presuppositions and the Tip offs highlighted for simplicity</li></ul><p>  <strong>ACCESS to Matt Barnett via the discussion forum.</strong></p><ul><li>You can contact Matt Barnett at anytime and ask any questions about NLP or Linguistic Presuppositions and you will get an expert response in a timely manner <strong> </strong></li></ul><p><strong>How long will the course take to complete? </strong> </p><ul><li>This course could be taken in one sitting. We recommend going through the course twice and doing the exercises fully. If you were to do this we estimate you will complete the course in around 4 hours.</li></ul><p><strong>How is the course structured?</strong></p><ul><li>The course is structired in such a way as to making the learning of the content easy.</li><li>The course is broken into sections and individual lectures to ease your learning of the topic.</li></ul><p><strong>Why take this course?</strong></p><p>Communication is something we all do all the time. And we do it unconsciously. This also means that we may well be saying a lot more than we think or want to ! by learning Linguistic Presuppositions you will get a greater command of your communication skills and will also be able to understand the language used by others. Many times what you hear is not what is being said ! learn the difference.</p>", 
    "end_date": null, 
    "title": "Read peoples deepest thoughts:NLP Linguistic Presuppositions", 
    "price": "20.00", 
    "instructors": "Matthew Barnett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366938_c1b9_2.jpg", 
    "course_url": "https://www.udemy.com/hearing-between-the-lines-nlp-linguistic-presuppositions/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T22:58:03Z"
}