{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>\"Thanks for being a great inspiration as well, especially taking out your time to compile these courses on Udemy. You do an amazing job!\" -- Oochay</p><p><strong>Welcome to Real World SQL Server From The Ground Up.</strong></p><p>SQL Server is one of the most complicated software offerings Microsoft has.</p><p style=\"\">This builds upon my course \"How To Begin Your Career As a SQL Server DBA.\" If you have't taken it <em>please sign up an take it now.</em> <strong>It's FREE!!</strong></p><p style=\"\">This course is my first course<strong> filmed entirely in 1080P. </strong></p><p style=\"\">This is the <strong>first in a multi-part series of courses on SQL Server Administration. </strong></p><p style=\"\"><strong>You</strong> need a solid foundation in <strong>networking, databases and programming</strong>. This wide range of skills is often difficult to obtain without rigorous learning and years of hands on experience.</p><p style=\"\">This course is the first in a <strong>two part series</strong> that covers much of the foundation of what SQL Server DBAs do and what skills they need to attain in order to excel at their jobs. </p><p style=\"\">All of my courses have a <strong>real world on component to them</strong>. We will cover the topics in our lectures then apply most of them to real world scenarios. </p><p style=\"\">The <strong>REWARDS YOU</strong> will <strong>OBTAIN</strong> are worth the effort. Here are just a few. DBAs are very well compensated. <strong>YOU</strong> will get to work with some of the <strong>SMARTEST</strong> people in the IT world. You'll <strong>LEARN</strong> something EVERY DAY. The profession has been and will continue to be one of the highest growth professions. You'll often get to work remotely. </p><p style=\"\">SQL Server Database Administrators are responsible for the design, implementation, support and maintenance of SQL Server Databases. The role also includes architecting, building and scaling databases for future data growth and capacity.</p><p style=\"\">DBA are also responsible for security, performance and availability of data to users and customers.</p><p style=\"\">This course will give you some direction on how to begin your journey as a SQL Server DBA. I don't want to create any false promises. In addition to years of experience most Senior Level SQL Server resources have read a voluminous amount of product related material.</p><p style=\"\"><strong>WE</strong><strong> </strong>have to start somewhere and <strong>THIS COURSE</strong><strong> </strong>will provide you with the<strong> </strong><strong>REAL WORLD</strong><strong> </strong>insight <strong>YOU</strong><strong> </strong>need in order to start your journey.</p><p style=\"\">If <strong>YOU</strong> are seriously interested in either starting out on the path to becoming a SQL Server Database Administrator the <strong>YOU'LL</strong> need two key ingredients. <strong>Experience and product knowledge.</strong> Experience might not be easy to get but it will be impossible if you don't have a very solid foundation in SQL Server.</p><p style=\"\"><strong>ENROLL now. Let's get started!!!</strong></p>", 
    "end_date": null, 
    "title": "Real World SQL Server From The Ground Up", 
    "price": "20.00", 
    "instructors": "Mike West", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608250_be4d_16.jpg", 
    "course_url": "https://www.udemy.com/real-world-sql-server-from-the-ground-up/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T17:35:05Z"
}