{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Does your business rely on word of mouth referral marketing? Could you do with more referrals being generated in this way? This course is all about how to create a referral marketing strategy to increase the number of referrals to you / your business receive. Referrals are a fantastic way to grow your business. If every customer just referred ONE person to your business... your business would literally double OVERNIGHT! Referred customers tend to haggle less, be more loyal and generally are happy to receive your call and are receptive to your message, than when you cold call or just advertise.</p><p>This course covers a referral marketing strategy and scripts that you can use, which work, to encourage and prepare people to refer new business to you. Asking for and receiving referrals should be part of your marketing process. This course will show you how to make it part of your business plan.</p><p>The course is structured by covering the material on slides. You get the slides in lecture one, which you just need to print out, and you can make notes as you go along. </p><p>This course is for you if you are not generating the referrals that you need. There are businesses out there that do not advertise at all - because all of their new customers are generated by referrals!! Imagine if you never spent a penny on advertising and yet new customers continued to walk through the door. How much would you save? What would this mean for you?</p><p>Businesses like Facebook have over 500 million users... and guess what... they never advertised once!! It was their existing users who promoted their site / service, by word of mouth and referral marketing to invite and encourage new users to join the network. How did they manage this? They gave their users exceptional value (it was free), and the user benefits were high (keeping in touch) and they made referring the business easy...</p><p>But you don&#039;t need to be an online business owner to take this course. This course works well for products and services used offline. Its a course for anyone (sales, marketing, employee, director, self employed person) who is responsible for new business development and bringing in new clients into the business.</p>", 
    "end_date": null, 
    "title": "Referral Marketing", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371818_eca6_3.jpg", 
    "course_url": "https://www.udemy.com/referral-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T22:13:26Z"
}