{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Misunderstood requirements on Information Technology (IT) projects are legend – and can cost you an arm and a leg. A recent study to quantify the cost of misunderstood requirements indicates they can nearly double the cost of the project! One of the major causes of misunderstanding is the inherent ambiguity and subjectivity of our language. Every unit within an organization has a unique vocabulary. Its members communicate within the unit effectively because each shares a common understanding of the terms and phrases within that context. Taken out of context (e.g. in Requirement Statements that IT needs to understand), those terms are subject to misinterpretation.  &lt;/p&gt;  </p>  <p>  \t        “Using Requirements Analysis to Destroy Ambiguity” presents a set of rules and techniques for recognizing and removing the ambiguity and subjectivity of language early in the process. Detection and clarification of ambiguous terms and phrases before development reduces coding errors, minimizes testing time, and increases the odds that the product will be delivered on schedule and within budget. You can use the presented techniques on any set of requirements to improve the probability that the Solution Providers will deliver what the business needs with minimal misunderstandings.  </p>  <p>  \t        This course is the second of three in our series “How to Write Effective Requirements for IT Solutions” that will dramatically reduce the failure rate of projects suffering from poor requirements. Regardless of your job title or role, if you are tasked with communicating your future needs to others, this course will help.  It is interactive (includes exercises with instant feedback), instructionally designed (based on modern learning theory), and &quot;intellimated™&quot; (uses animated visuals with an accompanying audio track) to hold your interest and increase retention.  </p>", 
    "end_date": null, 
    "title": "Requirements Analysis Destroys Ambiguity", 
    "price": "20.00", 
    "instructors": "Tom and Angela Hathaway, Daniel Myers", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288200_d15f_8.jpg", 
    "course_url": "https://www.udemy.com/requirements-analysis-destroys-ambiguity/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T14:38:50Z"
}