{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Este curso está diseñado para enseñarte a pre construir virtualmente las instalaciones hidrosanitarias un proyecto utilizando Autodesk Revit como herramienta de modelado en un nivel básico.</p>\n\n<p>Actualmente el termino BIM (Modelos de Pre construcción Virtual) se encuentra en expansión, ocasionando que en gran medida la mayoría de proyectos se encuentren sobre esta metodología y esto defina nuevos estándares de calidad, construcción y diseño.</p>\n\n\n\n<p>De la misma manera que ocurrió al substituir el lápiz por la computadora para dibujar planos, el modelado de información para la construcción BIM (por sus siglas en inglés) es un concepto indispensable en la industria de la construcción.</p>\n\n\n\n<p><strong>Este curso te enseñará a modelar en Autodesk Revit un proyecto ejecutivo integral</strong>, éste será el segundo curso de una serie de 4 cursos para dominar integralmente el modelado de proyectos ejecutivos en Revit.</p>\n\n\n\n<p>Este curso muestra cómo modelar instalaciones hidrosanitarias de manera práctica y efectiva para el desarrollo de proyectos ejecutivos.</p>\n\n\n\n<p>Este curso cuenta con 1 ejercicio de repaso directamente involucrados con el modelado, esto, te permitirá ejecutar lo aprendido en el curso y una vez enviados los ejercicios a revisión, obtendrás retroalimentación, y en caso de necesitarlo, tendrás más explicación de algunos temas.</p>\n\n\n\n<p><strong>Aprovecha el Certificado que obtienes al finalizar y registralo en la red de estudiantes expertos de autodesk como curso Udemy para mejorar tu perfil </strong><strong></strong><br></p>\n\n\n\n<p>¿Estás cansado de tomar cursos que van demasiado rápido o que tienen demasiado contenido? No te preocupes, sabemos que tú lo que buscas es obtener rápidamente resultados. “Salta entre las secciones, repite cuantas veces necesites las clases y los ejercicios del curso\"...El acceso al curso es vitalicio por parte de Udemy lo cual significa que puedes utilizarlo cuando necesites, y con subscripción a sus anuncios, entérate de las novedades y ten al alcance de tu mano cualquier actualización del curso. Cuenta con foros de discusión en donde podremos mejorar el curso y obtener el mejor beneficio de éste.</p>\n\n\n\n<p>Cuenta con foros de discusión en donde podremos mejorar el curso y obtener el mejor beneficio de éste.</p>\n\n\n\n<p>El enfoque de este curso es la pre construcción virtual (Modelado BIM) con Revit en un nivel básico, configurando las familias de proyecto y utilizando familias de Autodesk Seek y las librerías básicas.</p>\n\n\n\n<p>Además serás el primero en enterarte de futuros cursos por parte de Mag Architecture &amp; Technology Solutions S. A. de C.V. aprovecharás las oportunidades de futuros cursos, y garantizarás mantenerte al día con los conocimientos necesarios para destacar en tu trabajo, y conseguir mejores posiciones laborales y profesionales.</p>", 
    "end_date": null, 
    "title": "Revit Básico Hidrosanitario BIM (LOD200) ", 
    "price": "20.00", 
    "instructors": "Enrique Galicia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598340_63ef_2.jpg", 
    "course_url": "https://www.udemy.com/ihslod200/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T15:36:05Z"
}