{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Sage Accounts</strong> course is about  how  to use Sage based on the most popular functions which  you  as a Sage operator needs to know how to use, in order to be   proficient in using the software.  </p>  <p style=\"\">  \t      The learning is structured in a <strong style=\"\">practical way</strong>.   You are given a practical scenario assignment. There are various tasks   to complete. You are given the task to do and have a go at, and then  the  video answer is available. It is suggested that you:  </p>  <ol style=\"\">  \t<li style=\"\">Read the task</li>  \t<li style=\"\">Watch the video</li>  \t<li style=\"\">Have a go at it yourself on your own system</li>  \t<li style=\"\">Rewatch the video (if necessary) - to reinforce the learning</li>  </ol>  <p style=\"\">  \t      You’ll learn how to set up a Sage system from  scratch,  how to enter opening balances, post customer invoices and  credit notes,  post supplier bills and credit notes, pay suppliers,  petty cash,  prepare a VAT return, reconcile the bank, post journals,  run reports  amongst over things.  </p>  <p style=\"\">  \t      This is a useful course if:  </p>  <ul style=\"\">  \t<li style=\"\">You are thinking of working with the software, </li>  \t<li style=\"\">You are going for jobs which have a requirement for you to be able to use this software</li>  \t<li style=\"\">You want to put this skill on your CV, or </li>  \t<li style=\"\">You are a bookkeeper or accountant and will be using this for clients or even</li>  \t<li style=\"\">You run your own business and want to know how to use Sage for yourself.</li>  </ul>  <p style=\"\">  \t      You will need to get hold of a copy of Sage yourself. This lecture is based on v7. It&#039;s not that dissimilar to today&#039;s version. The   instructor is usually online to answer student queries for 2 hours each   day.  </p>  <p style=\"\">  \t      The course materials includes:  </p>  <ul style=\"\">  \t<li style=\"\"> the handout of the assignment task</li>  </ul>  <p style=\"\">  \t      Successful completion of the course is the equivalent to   being at the level of having a level 2 certificate in computerised   accounts.  </p>  <p style=\"\">  \t      The course will take about 3-4 hours to complete.  </p>", 
    "end_date": null, 
    "title": "Sage Line 50 Accounts", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302044_cfd3_2.jpg", 
    "course_url": "https://www.udemy.com/sage-accounts/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T11:21:18Z"
}