{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t  Sage 300 ERP: Installation and setup guide for beginners course is an exciting practical course on installing, setting up and configuring the Sage 300 ERP. The course is taught by a qualified trainer and expert in Sage 300 ERP implementations who boasts over 10 years in the IT industry in general and 8 years experience in Sage 300 ERP project implementations.  </p>  <p style=\"\">  \t  The key areas covered by the course are as follows:  </p>  <ul style=\"\">  \t<li style=\"\">Windows 7 environment preparation</li>  \t<li style=\"\">Software download and installation</li>  \t<li style=\"\">Database creation and setup</li>  \t<li style=\"\">Company setup and configuration</li>  \t<li style=\"\">System administration</li>  </ul>  <p style=\"\">  \t  This course is ideal for anyone who wants to learn about Sage 300 ERP installation and setup, but more specifically the following audience:  </p>  <ul style=\"\">  \t<li style=\"\">Newbies to Sage 300 ERP (Consultants and Administrators alike)</li>  \t<li style=\"\">Computer Science graduates</li>  \t<li style=\"\">Business Studies/Accounting graduates</li>  \t<li style=\"\">Semi-experienced consultants and administrators of Sage 300 ERP</li>  \t<li style=\"\">Seasoned ERP consultants intending to learn a new ERP</li>  \t<li style=\"\">Returning Sage ERP Consultants intending to get a refresher course</li>  \t<li style=\"\">ERP enthusiasts who would like to learn a new ERP</li>  </ul>  <p style=\"\">  \t  This course is very practical hence the need for a computer to use to follow along and perform the tasks and activities provided inside. The required software is available as a free download whose URL is provided inside, so the requirements of the course are within everyone&#039;s reach.  </p>  <p style=\"\">  \t  The course is made up of mainly video lectures incorporating slides with course topics and objectives but mostly screencasts walking you step-by-step through the activities and tasks required to achieve the set out objectives.  </p>  <p style=\"\">  \tBy the end of this course, you’ll not only have the skills, but the confidence to setup your own company, or seek employment as an administrator in a firm using Sage 300 ERP or work as a junior consultant in a Sage Business Partner, or work as an independent consultant implementing Sage 300 ERP projects for your own clients.  </p>", 
    "end_date": null, 
    "title": "Sage 300 ERP: Installation and Setup Guide for Beginners", 
    "price": "20.00", 
    "instructors": "GotCertified Training", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311528_faf4_2.jpg", 
    "course_url": "https://www.udemy.com/sage-300-erp-installation-and-setup-guide-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T14:37:34Z"
}