{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Almost every SAP implementation implements EDI. Yet, most consultants are blissfully unaware of how EDI works. Needless to say, there is always a good demand for consultants with good knowledge of EDI implementation. This is exactly the gap this course will fill. <br></p><p><strong>Course Overview </strong></p><p>This course teaches you the basics of how to implement EDI ( Electronic Data Interchange ) in SAP. It will help you understand the fundamental concepts at a much deeper level by relating them to simple business scenarios. At the same time, it will not skimp on the configuration details like Partner Profiles, Ports, Segments etc. After you finish this course you will be able to create an IDOC and process it successfully from scratch in any SAP IDES system.</p><p><strong>Why take this course ?</strong></p><p>Ever had a situation where you could not apply for a job because the requirements asked for EDI ? Ever heard words like IDocs, segments, port, partner profile tossed around in a meeting and did not know how to react ? It's all going to change with this course. Take this course and I promise you will understand everything you need to know about EDI - at least to a point where you will not feel alien to the most commonly used scenarios. <br></p><p><strong>What are the Requirements ?</strong></p><p><strong><strong></strong></strong><strong></strong>Experience at least in a technical or functional module is preferred. But at least familiarity with SAP is OK. You don't need access to an IDES system, but if you have one, it is going to help you tremendously in the hands-on. We do NOT provide access to SAP as part of this course. <br></p><p><strong>Target Audience</strong><br><strong></strong></p><p>This course assumes that you have some level of exposure to SAP. You could be a</p><ul><li>ABAP Consultant</li><li>Functional Consultant</li><li>Basis Consultant</li><li>EDI Sub-system consultant</li></ul><p><strong>What you get from this course ?</strong></p><p><em>Section 1 </em>- Gives you an overview of the course.<br></p><p><em>Section 2</em> - Cover the basics of EDI, the architecture and use cases. <br><em></em></p><p><em>Section 3 </em>- Get deeper into the IDoc, the fundamental data structure in SAP used to represent EDI data</p><p><em>Section 4 </em>- Shows you the configuration required in SAP for EDI.</p><p><em>Section 5</em> - Gives you a hands-on  on Outbound IDOC Processing</p><p><em>Section 6 </em>- Gives you a hands-on on Inbound IDOC Processing</p><p>Section 7 - Gets deeper into Application Link Enable ( ALE )</p><p><strong>How to make the best of this course ?</strong></p><p>I strongly recommend that you practice what is being taught in the course. Starting from section 3, we talk about configuration, perform transactions and do different kinds of customization in SAP. The best way to really understand and retain what is being taught here is to make sure you practice those transactions in SAP as much as you can. <br></p>", 
    "end_date": null, 
    "title": "SAP EDI Training - Practical Guide to SAP EDI Implementation", 
    "price": "35.00", 
    "instructors": "Krishna Rambhakta", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644520_06cc_2.jpg", 
    "course_url": "https://www.udemy.com/sap-edi-training/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T08:38:27Z"
}