{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Do you know why all of a sudden all big names in IT like <strong>SAP, IBM, Apple, Google and Amazon</strong> are talking about <em><strong>Internet of Things</strong></em> so seriously ?</p><p>Have you ever read an article or attended a talk or watched a video or even spoke to your colleagues about <strong>Internet of Things (IoT)</strong> and it filled you with more questions than answers ?</p><p>To put in a very simple way, <strong>IoT will be bigger than anything </strong>that's ever been done in high tech and IoT projects are not simple to do, therefore <strong>consultants and teams </strong>who are working in IoT are<strong> paid top rates and salaries.</strong></p><p>After long and extensive work of more than 5 SAP consultants and hardware experts for more than 1 month, we are able to finally compile a course which can cover entire end-to-end Internet of Things, in a simple and easy to understand way .</p><p><strong>This course is packed with information, knowledge, hands-on and real life project experience learning.</strong></p><p>After taking this course :</p><ol><li>You will be able to create your own cutting edge IoT usecases with SAP HANA and extend it with PubNub Cloud, an IoT platform already serving big names in the market.</li><li>You will be ready to work and manage an IoT project.</li><li>If you have never worked with <strong>SAP HANA XSJS </strong>or <strong>SAPUI5</strong>, after taking this course, you will be ready to make your first application.</li><li>You will be able to understand how <strong>PubNub IoT Cloud </strong>works and how it is being used by big names like SAP Finance, Coca-Cola, CBS, Yahoo and many more. </li><li>And you will be ready for a <strong>pay/rate raise.</strong></li></ol><p>We have covered <strong>SAP HANA Native development</strong>, <strong>SAPUI5,</strong> <strong>Raspberry Pi</strong>, <strong>Arduino Uno</strong> and <strong>sensor interfacing</strong> to solve a personal life problem that will keep the course interesting and fun. Once we achieved that, we will extend the same project by using <strong>PubNub Cloud platform </strong>and replacing SAP HANA backend. </p><p><strong>All the steps are easy to follow and understand.</strong></p><p><strong>You will be learning some of the most difficult technologies</strong> with ease because this course was compiled based upon DEEP principle.</p><p>Even if you are a beginner in IT or an expert or a manager <strong>you will never regret</strong> after taking this course.</p><p>We are giving you a <strong>30 days money back guarantee</strong>!</p><p>The Future is Now! </p>", 
    "end_date": null, 
    "title": "SAP HANA Internet of Things(IoT):Raspberry, Uno, PubNub, UI5", 
    "price": "20.00", 
    "instructors": "UI5 Community Network, Nuno Correia", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/504294_724b_10.jpg", 
    "course_url": "https://www.udemy.com/internet-of-things/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-17T08:52:08Z"
}