{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>INTRODUCTION TO REMOTE SENSING: Learn both the theoretical knowledge and practical skills of the latest satellite remote sensing technologies with easy to follow video lectures and laboratory exercises. </p>  <p>This course provides an introduction to remote sensing, and hands-on practical exercises to processing, downloading, and visualizing large volume of geospatial data in Google Earth Engine platform. Specifically we will cover:</p>  <p><strong> </strong></p>  <ul>  <li>Definitions of remote sensing</li>  <li>Electromagnetic spectrum</li>  <li>Types of resolutions in remote      sensing</li>  <li>Active and passive sensors</li>  <li>Earth observation satellites</li>  <li>Remote sensing data access</li> </ul>  <p><strong> </strong></p>  <p>No prior experience required. All are tailored such that anyone can follow them easily.</p>    <p>To date the ability to have skills on analyzing and utilizing geospatial data is key to various decision makings. Accessing and utilizing satellite data is not an easy task. This course will provide you the necessary skills on how to manipulate and utilize a satellite data for your own purpose. </p>  <p>In my course, I will give you the tools and skills through a step-by-step lecture and lab exercises. You will understand the fundamentals of remote sensing and gain skills on manipulating earth observation data. The skills you learn will enable you to access, and utilize satellite-derived remote sensing data in any online data portals.</p>", 
    "end_date": null, 
    "title": "Satellite Remote Sensing", 
    "price": "20.00", 
    "instructors": "Dr. Alemayehu Midekisa (PhD)", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/637754_ea6e_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-remote-sensing/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T01:30:58Z"
}