{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\">&quot;Scrivener is the professional authors choice&quot;</strong></p>  <p style=\"\">  \t                                                             If you&#039;re looking to create your next (or first) eBook quickly and easily then you need Scrivener Simplified to show you how to compile and publish your ebook in a variety of formats including Kindle, ePub and more. </p><p style=\"\"><em style=\"\">*TIP* Success with Scrivener is a matter of knowing what to ignore!</em></p>  <p style=\"\"><strong style=\"\">Your Training Includes:</strong></p><ul style=\"\"><li style=\"\">Videos of me creating an actual ebook before your eyes (No theory here!)</li><li style=\"\">Sample content (20 articles) used in the demonstrations</li><li style=\"\">A sample kindle cover for reference</li><li style=\"\">The finished ebook(s) for your review in epub, mobi and pdf formats</li><li style=\"\">The actual scrivener file (.scriv) I use in the course so you can simply start</li><li style=\"\">Other bonuses including my never before shared &quot;best seller&quot; mindmap</li><li style=\"\"></li></ul><p style=\"\">  \t                                                                   When you <strong style=\"\">ENROL IN THIS COURSE</strong> I show you how to ignore most of the overwhelming features so you can focus your time and create your eBooks quickly and easily ... in fact, you&#039;ll be able to create your next (or first) eBook in about an hour once you&#039;ve studied this course... and before you think &quot;Bogus!&quot; let me explain how and why it&#039;s true.  </p>  <p style=\"\">  \t<strong style=\"\">Ignoring Most of the Features</strong>  </p>  <p style=\"\">  \t                                                                   Because most of what Scrivener offers is advanced <em style=\"\">manuscript mojo</em> (that&#039;s the technical stuff that&#039;s cool for manuscripts ... but not key or critical to the job of creating your eBook.)  </p>  <p style=\"\">  \t                                                                 Like most software today, we only really need about 10% of it to achieve our objectives which is why, when I bought Scrivener in the summer of 2014, I was able to very quickly create eBook after eBook. I created and published 4 Kindle eBooks in very quick succession on Amazon and 3 of them went BEST SELLER too! (A nice bonus for sure.)  </p>  <p style=\"\">  \t<strong style=\"\">Speaking of BONUSES ... </strong>  </p>  <p style=\"\">  \t                                                                 I&#039;m including my personal Best-Seller eBook MIND MAP that shows how I approach the design and development of my Kindle eBooks. This is the same formula I used to create 3 back-to-back best-selling books in 2014. It&#039;s yours as part of this course ... my gift to you because I know you really want to get your eBook done quickly and efficiently and with this course and the bonus material you&#039;ll be able to create your eBook in about an hour.  </p>  <p style=\"\">  \t                                                                   So, don&#039;t wait another minute <strong style=\"\">ENROL TODAY</strong> ... because tomorrow you could be on your way to a best-seller.  </p>", 
    "end_date": null, 
    "title": "Scrivener Simplified: How To Compile Your eBook for Export", 
    "price": "20.00", 
    "instructors": "James Burchill", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384092_03b8_9.jpg", 
    "course_url": "https://www.udemy.com/scrivenersimplified/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T15:10:34Z"
}