{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Let Scrivener do the heavy lifting for you as you publish your books to Kindle.</strong></p><p style=\"\">In just a few clicks of the mouse you can create a perfectly formatted Kindle book, with automatic clickable table of contents, and bypass the technical headaches that so many self-publishers struggle with every day.</p><p style=\"\">Watch as I import, split, format, compile and publish a book to Kindle, all in under 30 minutes.</p><p style=\"\">The <strong style=\"\">&#039;Publish Effortlessly To Kindle Using Scrivener&#039;</strong> course is a completely newbie friendly guide taken from a webinar I ran introducing people to some of the powerful features and benefits of the Scrivener software.</p><p style=\"\">In the included eBook both this, and another webinar, are also included in full. The content of these popular webinars has been used and adapted for these excellent and useful introductory courses on Udemy.</p><p style=\"\">Using the webinar I occasionally refer to my more complete training guides that are both available here on Udemy, but the content of this free course is still highly valuable and actionable in it&#039;s own right. I am sure you will love every minute of this action packed walkthrough of Kindle publishing using Scrivener.</p><p style=\"\">This particular course uses the Windows version of Scrivener, but the content and training is relevant to both the Mac and Windows versions of the software.</p><p style=\"\"><strong style=\"\">**********************************************</strong></p><p style=\"\"><strong style=\"\">Includes Free 52 Page Ebook, &#039;Get Started With Scrivener&#039;</strong></p><p style=\"\"><strong style=\"\">**********************************************</strong></p><p style=\"\">Written especially for people who are completely new to Scrivener, the Get Started With Scrivener ebook is a fast track eCourse to learn the basics of Scrivener and make it really go to work for you in your writing projects. As a primer to get you over that initial terrifying encounter with Scrivener, you will not find a better read. :)</p><p style=\"\">But this is more than just an ebook. Your purchase includes:</p><li style=\"\"><strong style=\"\">20% OFF THE SCRIVENER FOR WINDOWS SOFTWARE</strong></li><li style=\"\">Two content rich webinars:</li><p style=\"\"><br style=\"\">1 HOUR: Get Started With Scrivener - How Scrivener Can Revolutionize Your Writing &amp; Publishing</p><p style=\"\">30 MINS: Effortlessly Publish To Kindle Using Scrivener - Watch As Import, Split, Format, Compile &amp; Publish a Book To Kindle In Real Time - All In Under 30 Minutes</p><li style=\"\">9 downloadable PDFs<br style=\"\"><br style=\"\"></li><p style=\"\">The easy-to-read (and watch) course material is pulled from the best selling Scrivener training, &#039;Learn Scrivener&#039; and &#039;Scrivener For Windows&#039;, and includes carefully selected videos, PDFs and other resources that are guaranteed to help you become familiar with the Scrivener writing environment, and grasp the tremendous benefits of using Scrivener for all of your writing needs.</p><p style=\"\">David Lee Martin is the developer of premium Scrivener video training course for Mac and Windows, and aims to put the right tools and techniques in people&#039;s hands to take their ideas and make them a reality!</p>", 
    "end_date": null, 
    "title": "Scrivener - Effortlessly Publish To Kindle Using Scrivener!", 
    "price": 0, 
    "instructors": "David Lee Martin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453088_3b1b.jpg", 
    "course_url": "https://www.udemy.com/publish-to-kindle-using-scrivener/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T13:37:46Z"
}