{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>*** The <strong>Scrivener Book Writing Software</strong> course was last updated on Tuesday 15th March, 2016 ***</p><p><strong>Scrivener Book Writing Software</strong> is a <span></span>course for self-published authors, which will show you how to get the most out of the powerful writing tool that is Scrivener.</p><p>Scrivener is the one software program that I use every single day, in all aspects of my writing, and I have no doubt whatsoever that it has played a huge role in me becoming a more productive writer.<br></p><p>Since using Scrivener properly, I have written regularly, I have written quickly and I have written with purpose. Now it is time that you do the same.<br></p><p>But a word of warning. This is not your run-of-the-mill basic course, where you will be spoon-fed at every turn on how to use each and every feature of Scrivener. There are some excellent beginner courses out there and indeed Scrivener’s own tutorials may suffice to get you up and running and familiar with the basics of the software.</p><p><strong>Learn how to use the industry-leading book writing software correctly</strong><br></p><p>Instead, this course is an over-the-shoulder look at how Scrivener has become an integral part of MY OWN writing process. Within the course, I will show you how you can use Scrivener:</p><ul><li>In the RESEARCHING of your book</li><li>In the OUTLINING of your book</li><li>In the WRITING of your book</li><li>In the REWRITING and EDITING of your book</li><li>In the PROMOTING of your book (through the setting up of your book’s Front and Back Matter)</li><li>In the COMPILING of your book into different eBook formats</li></ul><p><strong><br>Don't make the same mistake I made</strong></p><p>I am happy to say that I was an early adopter of Scrivener. Unfortunately, despite making a financial investment in buying the software, I did not then follow this up with making a time investment to learn how to use it properly.</p><p>For far too long I merely used Scrivener like a fancy word processor, which was such a waste. Please don't make the same mistake I made. Enrol in this course today.</p><p><strong>By the end of the course, you will become a more productive writer by unlocking the power of the incredible writing software that is Scrivener.</strong></p>", 
    "end_date": null, 
    "title": "Scrivener Simplified - Unlock The Power Of Scrivener", 
    "price": "25.00", 
    "instructors": "David James Ault", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653360_565a_3.jpg", 
    "course_url": "https://www.udemy.com/scrivener-book-writing-software/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T12:33:44Z"
}