{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t  Learn Scrivener in a hour.  </p>  <p>  \t   Even if you&#039;ve tried it before and given up, it&#039;s probably not your fault. I read many books and instructions and still found it frustrating. That&#039;s because I needed to see how to apply the features of Scrivener to my work, so I build the course I&#039;d wished I could find.  </p>  <p>  \t   How is it different? This course offers real examples of actual writing situations where you can benefit from Scrivener&#039;s tools and start using them today.  </p>  <p>  \t   You&#039;ll see how the different features can save you time and frustration by streamlining tasks and putting the references you need at your fingertips, meaning less time looking for lost information and more time writing.  </p>  <p>  \t   There are 12 lectures, some with short quizzes, and you can move through at your own pace and revisit lectures when you choose. If you don&#039;t have Scrivener yet, you can download a free trial for Mac or PC (info in Lecture #3).  </p>  <p>  \t   As an added bonus, I&#039;ve created a Quick Reference Sheet for the course, defining common terms and indicating which Lecture addresses them. You can find that  in the downloadable handout section.  </p>  <p>  \t   You&#039;ll want to take this course if you are ready to take your writing and your productivity to the next level. Whether you are beginning your writing career or already are well established, whether you are writing fiction, nonfiction, a thesis, blogs or teaching materials, Scrivener can help you by providing resources you need from within one program.  </p>  <p>  \t  A powerful system, Scrivener has features beyond what can be covered in an hour, but if you want to understand it and use it now, this is the course for you.  </p>", 
    "end_date": null, 
    "title": "Scrivener Quick Start", 
    "price": "20.00", 
    "instructors": "Lynn Kinnaman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238714_90f4_6.jpg", 
    "course_url": "https://www.udemy.com/scrivener-quick-start/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-07T01:42:50Z"
}