{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<em>Lernen Sie im *** <strong>ersten deutschen <em><strong>und best bewerteten </strong></em>Scrum Kurs auf Udemy ***</strong>, den Inhalt des agilen Projektmanagement Framework Scrum kennen. Kurz, kompakt und relevant! Mit über *** <strong>7</strong><strong>00 Studenten</strong> ***</em></p><p><strong>Mein Scrum Kurs</strong></p><p>Der Kurs wird immer die <em>kostenlosen</em> Element der ursprünglichen Version beinhalten (Vorschau ist frei verfügbar) und soll Ihnen eine <strong>erste Orientierung</strong> bieten. Der Preis des Kurses steigt mit der Anzahl der Personen, die sich einschreiben!  </p><p><strong>=&gt;=&gt;=&gt;</strong> <em>schreiben Sie sich noch heute ein, denn günstiger wird der Kurs nicht mehr angeboten!</em> <strong>&lt;=&lt;=&lt;=</strong></p>  <p>  \t<strong>Scrum</strong>  </p>  <p>  \t          <strong>Scrum</strong> ist ein <strong>agiles Projektmanagement Framework</strong>. Es  wurde von Ken Schwaber und Jeff Sutherland in der heutigen Form  entwickelt und bekannt gemacht. In Scrum gibt es den <strong>Scrum Guide</strong>, der zusammen mit dem <strong>agilen Manifest</strong> die Grundlagen des <strong>agilen Projektmanagement Frameworks</strong> vorgeben. In einer sehr schlanken Dokumentationen werden. Dieser beschreibt auf einigen  wenigen Seiten, was Scrum ist und wie es funktioniert. In diesem Kurs  lernen Sie eine erste <strong>Übersicht über Scrum</strong> kennen.</p><p>Da Scrum \"simple but not easy\" ist, liegt der Teufel im Detail. Es ist nicht das Problem ein Scrum Buch über das Wochenende zu lesen. Es sind die vielen Fragestellungen und der Erfahrungsschatz, die es richtig erfolgreich werden lassen. Diese Details möchte ich ebenfalls langfristig auf dieser Plattform anbieten. Nach diesem Kurs wissen Sie, was Scrum ist und wie Sie damit die Unbeständigkeit des Projektlebens meistern können.</p>  <p>  \t<strong>Voraussetzungen</strong>  </p>  <p>  \t        Sie benötigen für diese Übersicht keinerlei Kenntnisse  über Scrum. Hilfreich ist es, wenn Sie ein Verständnis von Projekten und  Prozessen besitzen.  </p>  <p>  \t          Sie brauchen kein Buch lesen, sondern können bequem  diesen Kurs belegen, er besteht aus kurzen Videos und ermöglicht es  Ihnen „mitzureden“. Sie werden danach kein Scrum Experte sein, Sie  können Scrum aber einordnen und für die Anwendung nutzen. Das qualifiziert Sie bei Weitem nicht als Scrum Master oder Product Owner, hilft Ihnen aber bei dem Verständnis.</p>  <p>  \t<strong>Ausblick zu Scrum</strong>  </p>  <p>  \t          Scrum wird immer bekannter und feiert seine Erfolge auch  außerhalb der Softwareentwicklung. Sie können Scrum als Change  Management Tool für Organisationen einsetzen. Sie können mit Scrum auch  andere Produkte, als reine Software erstellen. Scrum ist ein Werkzeug,  dass Ihnen schnell Probleme an den Tag bringt. Es verspricht Ihnen  nicht, diese zu lösen oder den perfekten Weg zu kennen. Es gibt Ihnen  aber einen guten Rahmen, um genau solche Fragestellung bei sich im  Unternehmen zu lösen.  </p>  <p>  \t<strong>Materialien</strong>  </p>  <p>  \t        Der Kurs besteht aus Videos und einigen Links für weiterführende Informationen und textuellen Passagen.  </p>  <p>  \t<strong>Zielgruppe</strong>  </p>  <ul>  \t<li>Studenten die von Scrum gehört haben und eine Übersicht benötigen.</li>  \t<li>Entrepreneure, die ein Start-Up gegründet haben oder es tun und für die Entwicklung ein passendes Framework benötigen.</li>  \t<li>Projektleiter, Business Analysten, Qualitätsmitarbeiter, Manager, Abteilungsleiter</li>  \t<li>Kurz: jeder, der sich für Scrum interessiert, aber noch keine oder nur wenig Erfahrungen damit gemacht hat.</li>  </ul>  <p>  \t<strong>Was ich denke?</strong>  </p>  <p>  \t          Für mich ist Scrum ein super Tool, dass ich gerne  einsetze und in diesem Kurs auch jedermann ein Stück näher bringen  möchte. Ich hoffe, dass auch Sie Gefallen an Scrum finden! Aber jetzt:  Einschreiben und teilnehmen! :-)  </p>", 
    "end_date": null, 
    "title": "Scrum: agiles Projektmanagement für Anwender", 
    "price": "20.00", 
    "instructors": "Sebastian Schneider", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352820_e50e_4.jpg", 
    "course_url": "https://www.udemy.com/einfuhrung-und-ubersicht-zu-scrum/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T11:06:14Z"
}