{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  You will be able to more effectively guide the development team (coders, testers and technical writers) through all of the Software Development Lifecycle activities. Your development projects will be easier to plan, control and delver. Team productivity will go up while development risk goes down.  </p>  <p>  \t  You will learn how to speed-up development through converting usual sequential workflows (coding, testing and documentation) into parallel workflows. This is a major factor in getting a great quality product to market more quickly.  </p>  <p>  \t  You will learn how to do strategic planning for your project and how to avoid doing tasks over – get them correct and complete the first time. It is possible.  </p>  <p>  \t  You will learn how to avoid unnecessary development risks such as:  </p>  <ul>  \t<p>  \t\t  ·Incomplete or incorrect business requirements  \t</p>  \t<p>  \t\t  ·Unintended impediments  \t</p>  \t<p>  \t\t  ·Uncontrolled requirement changes  \t</p>  \t<p>  \t\t  ·Incomplete testing  \t</p>  \t<p>  \t\t  ·Not having a Software Requirements Specification  \t</p>  \t<p>  \t\t  ·Many other self-inflicted wounds  \t</p>  </ul>  <p>  \t  Everybody wants to get their software development projects completed as soon as possible. Unfortunately, some misguided folks want to complete their projects sooner than possible. That invariably leads to development taking longer than it should, usually with lower quality. If you adopt the guidelines set forth in this course you will recognize the signs of danger ahead in time to avoid them,  </p>  <p>  \t  There is a persistent myth concerning software development. It is the notion that the fastest path to completing a project is to start coding as soon as possible. Too many people interpret this as no need to plan and design before jumping into writing code. There are many steps that should be taken prior to coding start. This course identifies them and discusses how to handle them in a preferred manner.  </p>", 
    "end_date": null, 
    "title": "SDLC – Develop with Speed and Low Risk – Get to Market Fast", 
    "price": "50.00", 
    "instructors": "Lionel Bentkower", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312346_627e_3.jpg", 
    "course_url": "https://www.udemy.com/quick-to-market-quick-to-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T18:19:37Z"
}