{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Did you know that Selenium WebDriver is the most popular GUI automation testing tool on the planet?<br></p>\n\n<p>Did you know that the demand for Selenium testers is rising, Selenium is becoming more popular, but there is a lack of good SDETs in the world?<br></p>\n\n\n\n\n\n<p>Take this course to ensure to yourself that you will be on the right path to a 6 figure salary, job security, and stability. In this course, you will learn how to build your own automation testing framework from scratch. I will hold your hand as I walk you step-by-step through the entire development of this framework. You will learn every single thing that you need to know in this single course! Not only theory, but tons of real examples, with real practice on real applications!</p>\n\n\n\n\n\n<p>GUARANTEED or your money back within 30 days!</p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">\"The best tutorials I have ever seen, simply awesome. I take off my hat in front of you, you are an gorgeous professor, I am speechless to express how satisfied I am with these tutorials.\"</strong> -Lisbey</em><br></p>\n\n\n\n\n\n<p>Here are just some of the topics that are covered in extreme depth:</p>\n\n\n\n\n\n<p>- Over 20 hours of high quality, professionally edited, automation tutorials</p>\n\n\n\n\n\n<p>- How to write your first automation framework from scratch</p>\n\n\n\n\n\n<p>- You will learn why Selenium is growing so fast, why it's so amazing and the latest IT trends for Selenium</p>\n\n\n\n\n\n<p>- The automation testing best practices to make you amazing at your job</p>\n\n\n\n\n\n<p>- The Page Object Model, the most effective way to create automation testing frameworks</p>\n\n\n\n\n\n<p>- Full 10 hours of C# lectures to make you efficient at coding frameworks</p>\n\n\n\n\n\n<p>- You will learn Visual Studio</p>\n\n\n\n\n\n<p>- How to use only free tools to code your framework</p>\n\n\n\n\n\n<p>- How to identify any element, any time, using the most advanced techniques</p>\n\n\n\n\n\n<p>- How to work as an automation tester at your job in an Agile lifecycle</p>\n\n\n\n\n\n<p>- Tips and tricks to make you better at coding and automation like Resharper</p>\n\n\n\n\n\n<p>- JSON</p>\n\n\n\n\n\n<p>Here is what my students are saying:<br></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">\"I dont know much about QTP. But I really love the way of your teaching. I am a just beginner of QTP. I am very eager to watch all of your videos. Just keep up the good work. And finally it is excellent.\"</strong> -Srikanth<br></em></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">\"Great Video I have ever seen on YouTube. You are so so clear and honest in presenting the material. I had no idea how important it is to use QTP from different angle, that is via scripting. Great Work and Thank You so so so much!\" </strong>-Mohammed</em></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">------------------------------------------------------------------------------------------------------------------------</strong></em></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Bonus</strong><br></em></p>\n\n\n\n\n\n<p>1. <strong class=\"redactor-inline-converted\">Free course on parallel test execution</strong> with Selenium Webdriver - execute tests locally or in the cloud (60+ min of video tutorials)</p>\n\n\n\n\n\n<p>2. Ebook that shows the <em class=\"redactor-inline-converted\"><strong>Top Selenium Webdriver Resources</strong></em> to make you a better automation engineer.</p><p>3. 50% off of my Selenium Webdriver Synchronization Techniques tutorial</p><p><em><strong>------------------------------------------------------------------------------------------------------------------------</strong></em><br></p>\n\n\n\n\n\n<p>And if you are not 100% satisfied, you can receive a full refund within 30 days of your purchase! You have absolutely nothing to lose.</p>", 
    "end_date": null, 
    "title": "Selenium Webdriver Complete Course - Build A Framework", 
    "price": "50.00", 
    "instructors": "Nikolay Advolodkin", 
    "commitment": "19 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541692_195e_6.jpg", 
    "course_url": "https://www.udemy.com/selenium-with-c/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T22:53:10Z"
}