{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Selenium IDE is one of the most popular test automation integrated development environment from Selenium products. This is the best tool to get started on learning about test automation. It helps to scale yourself from basics to advance level in a very effective manner. This course aims at exactly doing this with you. You do not need to have any prior programming skills or deep knowledge about software testing before taking this course. The basics are well covered in this course and gradually the course takes to advance levels. There are lot of advance details covered in the course. </p><p>It will get  you started with the testing flow like requirement, testcase design, scripting test automation, executing testcases and recording testresults and logging bugs. It will first make you familiar with some commonly used Selenium commands and use them in your test automation scripts. There will be examples covering real world applications and also a a special custom application which you can install on your system to practice on.</p><p>You will gradually get on to the advance level of know each and every details of the tool and exposed through the various user interface features of the tool and also other associated features. There is whole lot of stuff in there and we will cover that one at a time in as simple a manner as possible. You will be in command to know almost everything listed there and how to use it.</p><p>The basics of HTML, CSS and Javascript as needed in this course will be covered along with some support tools which complement use of Selenium IDE.</p><p>Selenium is one of the best tool for software test automation. So, go for it. Now.<br></p>", 
    "end_date": null, 
    "title": "Selenium IDE ", 
    "price": "20.00", 
    "instructors": "Ganesh Sahai", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530006_1d4a_2.jpg", 
    "course_url": "https://www.udemy.com/selenium-ide/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T03:33:53Z"
}