{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>This video course is the FIRST of its kind to be available on Udemy!  This course is set up to help individuals as they prepare to pass the Series 7 Licencing exam that is required for anyone who would like to be a licensed stock broker in the United States.  This course is available as a realistic alternative to paying for hours of tutoring.  This allows you to pause, rewind, and/or repeat concepts as needed. PLUS, you&#039;ll have access to realistic practice questions and step-by-step demonstrations of how to approach and answer those questions accurately and efficiently.</p><p>In this course, we will discuss the topic about what the Series 7 Exam is, why it is required and what individuals will expect to see on the actual test.  This video course is the first of many to come, with the main emphasis of this course is to ensure levels of understanding sufficient specific to the topic of &quot;Equity Securities&quot; for the Series 7.</p><p>The structure of this course will include animated videos, screen captured videos of lectures, practice questions for students to try (pdf files for download), and demonstrations of the questions (video demonstrations).</p><p>Why take this course???  Help you pass the Series 7 Exam, of course!!!</p><p>This course consists of:</p><p>7 animated and 7 lecture videos - over 90 minutes of video content</p><p>13 practice questions included on downloadable pdf&#039;s</p><p>Expected time to take this course: 2 hours (approximately): videos, lectures and practice question</p>", 
    "end_date": null, 
    "title": "Series 7 Exam Preparation: Equity Securities", 
    "price": "20.00", 
    "instructors": "Jared Downs", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427332_69a3_3.jpg", 
    "course_url": "https://www.udemy.com/series7examprep-equitities/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T01:29:45Z"
}