{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t          Note: This course was created on the pre-Eureka UI of ServiceNow. As a result, you will see some differences in the UI for what is captured in this course and what is currently available in ServiceNow. With the release of Fuji, the UI changes are more apparent.</p>  <p style=\"\">  \t  However, fundamentally, ServiceNow works the same way. What that means is that it is very intuitive to map the steps in the current ServiceNow UI and follow the course accordingly.  </p>  <p style=\"\">  \t      --  </p>  <p style=\"\">This course is created by QuickNexus. At QuickNexus, we focus exclusively on the CMDB (Configuration Management Database) in ServiceNow. If you are looking for CMDB Training and or assistance with CMDB Implementations, reach out to us via Udemy or our contact details on the QuickNexus website.</p><p style=\"\">--</p><p style=\"\">  \t          This course is what you need to Kickstart your ServiceNow knowledge. This course includes a series of videos that cover various aspects of ServiceNow to get you going with the Basics of ServiceNow Administration and give you an overview of various aspects and features of ServiceNow.  </p>  <p style=\"\">  \t             Take this course to:  </p>  <p style=\"\">  \t                                 Prepare for your ServiceNow Interview  </p>  <p style=\"\">  \t                                 Administer ServiceNow  </p>  <p style=\"\">  \t                                 Refresh your SerivceNow Skills  </p>  <p style=\"\">  \t                                 Get familiar with ServiceNow  </p>", 
    "end_date": null, 
    "title": "ServiceNow Kickstart: On-Demand Training for ServiceNow", 
    "price": 0, 
    "instructors": "Shivraj Vichare", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86322_267c_13.jpg", 
    "course_url": "https://www.udemy.com/servicenow-kickstart/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-31T05:17:19Z"
}