{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In life there are roadblocks that cause many people to get off track. One of the biggest causes is a break-up or other major life event. The Ultimate Life Reboot: 10 Steps to getting your life back on track is a course geared toward individuals that are looking for a way to assess their situation and take action to change and improve their life. The course is broken down into 10 easy steps, allowing students to make all the necessary observations to understand how they arrived at their current situation, and plan to make changes that are in-line with some of their deepest desires for their life. </p><p>The primary focus of this course is to create a goal plan and development plan around the area in your life that you feel have gotten off-track - or the areas in your life that you dream about but have not made a successful plan to accomplish. We will focus on the areas that you have the power to change and create an action-based goal plan to get you there. </p><p>The steps include, self-assessment, identifying strengths and weaknesses, gaining an understanding of what others see as strengths and weaknesses, creating a new life story, defining purpose, creating a development and goal plan, risk assessment and goal monitoring. </p><p>Students should be prepared to do work in this course, and have an honest desire to change their situation. There is a 10-step activity workbook that will be available to all students. Students will need to first view the lecture and then complete the workbook activity for that lesson. Each step in the course should be viewed in sequential order, as the earlier lessons will need to be completed before completing the development plan and goal plan in later steps/lessons.</p><p>There is an element of self-reflection that students should not take lightly, as the self evaluation will be critical to the goal planning phase. It will also be important in understanding the scope of the problem(s) that should be addressed to see life improvements. </p><p>This is an exciting opportunity to make change and I hope you make a decision for you today.I'll see you in class! </p>", 
    "end_date": null, 
    "title": "Set Goals and Get a Happy Life", 
    "price": "35.00", 
    "instructors": "Theresa Clemons", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561232_36a4_7.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-life-reboot/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T05:18:33Z"
}