{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t        Database design is the most important task performed by application developers because the resulting database and all applications that access it are based on this design. Therefore, if the data for the application is modeled incorrectly and the resulting database poorly designed, poor and difficult to use applications will result.</p>  <p>  \t<strong>Learn how to design databases in six easy steps</strong>  </p>  <ul>  \t<li>Create implementable database models</li>  \t<li>Create Crow's Foot Relational Model (R-M) diagrams</li>  \t<li>Create Entity Relationship Model (E-R) diagrams</li>  \t<li>Case studies to reinforce the instructions</li>  \t<li>Easy to follow, step by step instructions</li></ul>  <p>  \t<strong>Learn how to create sturdy, reliable and accurate data models for your databases</strong>  </p>  <p>  \t            A database is the backbone of any application, and therefore it must be sturdy, reliable, and accurate. Having a well-designed database is the key to having your database meet these criteria, and the six-step technique taught by this course ensures that the data model upon which your database is built is sturdy, reliable, and accurate.  </p>  <p>  \t            The six steps outlined in this course are simple, easy to follow, and precise. It teaches you how to quickly and accurately model the data that your application will use, and shows you how to do so in the shortest possible time. Extensive knowledge of database theory is not required and the theory is kept to a minimum. </p><p>Video lectures are used to present the material, and case studies are incorporated into the lectures thus reinforcing the steps of the database design technique taught by this course. There is also a lot of supplemental material that you can download and read, which explains each of the steps in further detail.</p>", 
    "end_date": null, 
    "title": "Six-Step Relational Database Design", 
    "price": "30.00", 
    "instructors": "Fidel Captain", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348768_eb38_17.jpg", 
    "course_url": "https://www.udemy.com/sixstepdatabasedesign/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T00:18:28Z"
}