{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong>Did </strong><strong>you </strong><strong>hear about Slack </strong><strong>but</strong><strong> not sure how to use it?</strong></p><p><strong>Want to organize your team communication?</strong></p><p><strong>Want to be more productive?</strong></p><p><strong>You</strong><strong>'ve</strong><strong> come to th</strong><strong>e</strong><strong> right place!</strong></p><p>Slack users help people to enjoy a simpler, more pleasant, and more productive work life.</p><p>Modern communication is problematic, you send an e-mail, get a message on Facebook, WhatsApp from you teammate to send a file you were talking about in the meeting, so you copy it to you google drive and share or send it by email just to discover later you forgot where it was and where did you get that question about that document? Facebook? WhatsApp? google chat? SMS?</p><p>Managing your daily communication with your colleague using different platforms can take a lot of time and effort leaving you less time to work and even lesser time to enjoy life.</p><p><strong>After adopting Slack, team owners reported:</strong></p><p><strong>1. their team became more productive by 32%</strong></p><p><strong>2. they reduce their internal email by 48.6%</strong></p><p><strong>3. they managed to reduce their meetings by 25.1%</strong></p><p><strong>4. Slack made finding information easier for team members by 62.4%</strong></p><p>If your free time is important to you as my free time is to me you HAVE TO learn to use Slack.</p><p>Slack brings everything you need for teamwork in one place, conversations happen in open channels, one for each project or one for each team, you can upload files, drop links to Dropbox or Google Docs, post a picture, create a poll to get a quick survey done, throw ideas around and get feedback from your team, make important announcements, see what’s going on on Twitter, set reminders for groups or individuals in your team, pin important messages or posts in a specific channel and much more.</p><p>If you are new to the team you are not met by an empty inbox, Slack will give you an instant access to the collective knowledge created by the team, all the shared documents and files and the specific discussions about them.</p><p>Slack's easy to use and powerful search engine will search every channel, every direct message, every post and every document and every link ever uploaded and tell you where what you are looking for is.</p><p>You can access Slack from your computer, mobile phone and even your web browser, every file and every important piece of data your teams need is always there. accessible from the office, home, train, car and everywhere else you might be.</p><p>This course will give you the tools to use Slack so you and your team have the ability to do whatever you do as well as you possibly can!</p><p><strong>M</strong><strong>ore productivity, more efficiency, means you have more time to enjoy life with your loved ones.</strong></p>", 
    "end_date": null, 
    "title": "Slack: Less email. More productive.", 
    "price": "20.00", 
    "instructors": "Uri Soglowek", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766614_c756.jpg", 
    "course_url": "https://www.udemy.com/slack-less-email-more-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T15:10:15Z"
}