{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>This revision course has been designed for GCSE Maths Foundation Tier students aiming to get a Grade C.  It is suitable for <strong>all</strong> Foundation Tier Maths students and <strong>all</strong> exam boards.  This revision course is made up of some of the topic areas that appear most often in exam papers.</p><p>Each topic area consists of:</p><ol><li><strong>Video examples of exam questions</strong></li><li><strong>Exam questions for you to complete (from the screen or downloadable to print)</strong></li><li><strong>Video answers to the exam questions</strong></li></ol><p>This course is essential for students who want to push their performance up to a Grade C.  Watching the video examples, completing the questions and then watching the video answers will not only improve knowledge but also boost confidence.  Being able to watch both the example and solution videos of exam questions, as if the teacher is right in front of you, is what makes this course unique.</p><p>Practising exam questions is proven to be the best way of building confidence, knowledge and exam technique.  This revision course is the gateway to getting that Grade C.</p><p>If you find this course useful you can use your developing confidence and knowledge to move on and complete further revision.  At the end of this course there is a link that will enable you to access even more exam style questions of the most popular topics that occur in GCSE Maths exams.</p><p>If you have any questions or would like any further topics added to the course then drop me a message or start a discussion.  Together we can get you that Grade C!  Good luck!</p>", 
    "end_date": null, 
    "title": "So you want a Grade C in your Maths GCSE? (Part 1)", 
    "price": 0, 
    "instructors": "Engage and Learn", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711852_8aaa.jpg", 
    "course_url": "https://www.udemy.com/so-you-want-a-grade-c-in-your-maths-gcse-part-1/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T12:54:24Z"
}