{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Sound affects every aspect of our lives, from our health and relationships to our success in achieving life goals. These effects are powerful and yet mainly unconscious. </p><p>This free taster course will introduce you to three key aspects of sound and communication: conscious listening, powerful speaking and soundscaping (which means designing the sound around you to improve your outcomes). Although designed to introduce you to the material covered in my in-depth Master of Sound trainings, this course contains plenty of powerful and potentially life-changing material. Simply by becoming conscious of the four ways in which sound affects you every day, you can start to take control of the sound you create and consume, and your whole life can change as a result. </p><p>This course includes practical takeaways in the following areas: how to create soundscapes that are healthy and improve your productivity; how to unlock the power and impact of your voice in your relationships and business life; and how to transform your listening - and with it your whole experience of life. If you see the value of unleashing the power of sound after taking this free course, then I invite you to check out my Master of Sound training, which comprises three in-depth courses, one each on conscious listening, powerful speaking and soundscaping. </p><p>I have worked with sound and communication for over 10 years and I understand the impact that it has on business outcomes as well as personal success, wellbeing and relationships. I am a highly-rated international platform speaker, and one of very few people to have TED talks, which have collectively been viewed over 20 million times. The latest of these, How to speak so that people want to listen, is in the top 25 talks of all time.  My company, The Sound Agency, works with some of the world's biggest brands to increase sales and customer satisfaction by improving the way they sound. </p><p>I invite you to enhance your communication skills and quality of life by becoming a Master of Sound. </p>", 
    "end_date": null, 
    "title": "Sound Affects!", 
    "price": 0, 
    "instructors": "Julian Treasure", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/133110_ed84_5.jpg", 
    "course_url": "https://www.udemy.com/sound-affects/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-13T10:57:03Z"
}