{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>If you're new to the Spring Framework, this is the course you want to start with. This course covers the core of the Spring Framework, the foundation which all of the other Spring Framework projects are built from.</p>\n\n<p>In this course, you will learn about important key concepts, such as dependency injection and inversion of control, which are used throughout the Spring Framework. Within the Spring Framework, you have the option of using the traditional XML configuration, or the new Java based configuration. I'll show you step by step how to configure Spring Beans using best practices in XML and Java. I'll also show you how to use Spring to persist data into a database, and Spring MVC to show content from the database on a webpage.</p>\n\n<p>Throughout the course you will have access to the code examples being presented in the tutorials. This is code you can build and run on your computer. You will be able to study the working code examples. Whenever possible, I will go into real world use cases and examples from my years of experience as a Spring Source consultant. I've seen a lot of good code, and bad code over the years. Through my experience with Spring, I will show you good code and poor programming practices to avoid.</p>\n\n<p>By the time we reach the end of this course, you will be able to build a functioning Spring Web Application.</p>\n\n<p>In this course, you will learn about:</p>\n\n<ul><li>Dependency Injection and Inversion of Control (IoC) in the Spring Framework.</li><li>Spring Boot</li><li>Using Spring Initializr</li><li>Using Maven to build Spring Projects</li><li>How to use JUnit and Mockito to test Spring</li><li>Java and XML Spring Configuration</li><li>Spring MVC and Thymeleaf with Bootstrap CSS</li><li>Spring MVC Test</li><li>JPA / Hibernate</li><li>Spring JPA and using DAOs</li></ul><ul><li>Spring Profiles</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Spring Core - Learn Spring Framework 4 and Spring Boot", 
    "price": "25.00", 
    "instructors": "John Thompson", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724502_fe0d_2.jpg", 
    "course_url": "https://www.udemy.com/spring-core/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T19:53:37Z"
}