{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>I produced the highest rated SQL training video with over 301,000 views and 2800 likes. If you have any doubts, scroll down and read the comments on my SQL videos! Just <strong>ranked in the top group of instructors</strong>!<br><br>This is an SQL course for job seeking beginners or people who are out of practice, that is designed to guarantee that you pass most SQL tech interviews. This is NOT for Database Administrators. This is for trading support applicants or business folks who might need to use the database for research. If you are trying to learn SQL, then my more advanced courses are awesome for that. This class is a very good video cliff note. Nothing more.</p><p>I highly recommend this course for people looking for jobs with other (other than SQL) priorities. For example a job that says \"Required: FIX Protocol. Plus: SQL\". That is the<strong> ideal </strong>candidate for this course. I'll tell you exactly what the interviewers will be looking for as far as SQL.</p><p>I have years working for companies like investment banks and FinTech venders, so I know what software they have and what you need to know. This course gets you right to the information you need faster than anything else. This frees up your time for other pursuits and getting you to that 6 figure job fast!<br></p><p>Don't take MY word for it, take a look at what some of the 301,000 people who have enjoyed my SQL videos have said:<br><br><strong>[From my FIXProtocol Channel]</strong><br><br>\"<strong>Didou Reznov</strong><strong>2</strong></p><p>the delivery and presentation is <strong><em>just genius </em></strong>, he got me hooked from sec 1﻿\"</p><p>\"<strong>Flynn Davies</strong><br>haha love the video man, the enthusiasm kept my ADHD infused brain <em><strong>entertained</strong></em> and helped me learn this. thanks so much and keep em up!﻿\"</p><p><strong>Dirovame1</strong></p><p>FIXProtocol, you are a true hero.\n\nMy Database professor has been spewing googlypoop for the last 4 months and <strong><em>I aced my final from just watching this video</em></strong>. </p><p>\"<strong>ricochet08</strong><br></p><p><span></span></p><p>definitely the <em><strong>most entertaining sql </strong></em>video i've seen :D will be watching more of your videos!﻿\"</p><p>\"<strong>Al Johnson</strong><strong>5</strong></p><p>+FIXProtocol Very interesting, informative and <em><strong>passionate video</strong></em> about the subject scary for many people. You like to teach, and you know stuff you're talking about!\"<br><br></p><p>\"<strong>Richard Cooper</strong><strong>4</strong></p><p>Great video love your <em><strong>enthusiasm</strong></em>!  I am a sql developer who is looking to expand his skill set.  Keep it up I like it!  :-)﻿\"</p><p>\"<strong>TrollAndPlay</strong><strong>1</strong></p><p>You sir, are an <em><strong>amzing teacher</strong></em> ! Thank you so much !﻿\"</p><p>\"<strong>Thomas Rönnberg</strong><strong>2</strong><br></p><p><span></span></p><p>A charismatic teacher and very <em><strong>clear teaching methods</strong></em>\"</p><p>\"<strong>Mark Ganus</strong><span></span></p><p>thanks heaps man. I'm on a race to learn SQL as quickly as and have been scouring youtube for useful videos and yours have been of <em><strong>great help</strong></em>. again thanks a bunch﻿\"</p><p>\"<strong>Siddy Kay</strong><strong>1</strong></p><p>I did a course on cyber-security this summer. You explain things well. i understand things better now haha, even though I'm a CS major. <em><strong>Wished my professors were as good in explaining as you</strong></em> lol﻿\"</p>", 
    "end_date": null, 
    "title": "SQL Wall Street CHEAT SHEET, to get HIRED FAST! 2016", 
    "price": "30.00", 
    "instructors": "Carlyle Frank", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736478_97d8_2.jpg", 
    "course_url": "https://www.udemy.com/sql-database-course-to-get-hired-fast-on-wall-street/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T06:40:25Z"
}