{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Software crashes. <strong style=\"\">WE</strong> can't stop that. What <strong style=\"\">WE</strong> can do is prepare ourselves through education and practice to be able to <strong style=\"\">act quickly</strong> and resolve these critical issues.</p><p style=\"\">In the early days of <strong style=\"\">SQL Server</strong> many support calls were server down issues that ended up being bugs in SQL Server. While this still happens, today many of those calls aren't the fault of SQL Server. </p><p style=\"\">For example. On Microsoft's case history of database corruption <strong style=\"\">99%</strong> of <strong style=\"\">ALL </strong>database corruption can be traced back to the IO subsystem. </p><p style=\"\">Either way, when <strong style=\"\">SQL Server crashes</strong> it can be a traumatic experience for a DBA. If a production box crashes during core hours <strong style=\"\">WE</strong> need to know what steps to take to resolve the problem as quickly and as cleanly as possible. </p><p style=\"\">This course will take <strong style=\"\">US</strong> beyond where to look. <strong style=\"\">WE</strong> will cover <strong style=\"\">RECOVERY INTERNALS </strong>and the fundamentals of how to analyze, diagnose and resolve critical errors. </p><p style=\"\"><strong style=\"\">WE</strong> will cover the SQL Server Error Logs<strong style=\"\"> in great detail</strong>. One of the first places as SQL Server DBAs <strong style=\"\">WE</strong> look to diagnose critical failures is the SQL Server Error logs. </p><p style=\"\"><strong style=\"\">WE</strong> will cover server startup failures and <strong style=\"\">analyze SQL Server stack dumps</strong>. Additionally, we will analyze several commonly occurring exception signatures. </p><p style=\"\"><strong style=\"\">WE</strong> will create a troubleshooting task list as use it as a template for<strong style=\"\"> resolving these crashes</strong> and critical errors. </p><p style=\"\">While this course has no prerequisites a strong background in SQL Server is highly recommended. </p>", 
    "end_date": null, 
    "title": "SQL Server Crashes and Critical Failures", 
    "price": 0, 
    "instructors": "Mike West", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561920_c610_5.jpg", 
    "course_url": "https://www.udemy.com/sql-server-crashes-and-critical-failures/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T19:32:44Z"
}