{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Good SQL Developers are in high demand and demand 100k+ salary in the IT industry.</p><p><strong style=\"\">SQL performance tuning is an art to master - for all of us!!!</strong><br style=\"\"></p><p>Many SQL Developers have tried to understand why a particualr SQL was running slow - including me - but have failed over and over again because we never tried to understand how SQL works? We were thinking it is database administrators Job!!!!</p><p>If we have to advance in our career and earn a good salary, we need these SQL tuning skills.</p><p>We know how it feels if someone talks about SQL Tuning and I dont want you to feel the same.</p><p>I took baby steps in introducing you to the optimizer and helping you write an effecient SQL.</p><p>This course takes a systematic approach to planning, analyzing, debugging and troubleshooting common query-related performance problems and will provide you with the skills necessary to write scalable, high performance SQL.<br style=\"\"></p><p><strong style=\"\">The SQL tuning methodology I used:</strong></p><ul style=\"\"><li>Identify a problem SQL statement</li><li>Determine how Oracle is executing SQL statement and why Oracle chose that way.</li><li>Investigate whether alternative executon plans would be better.</li><li>Update the SQL statement to push Oracle towards the better plan.</li></ul><p><br style=\"\"></p><p>Trust me, I will catch your hand and take you step by step!!!</p><p>See you inside,</p><p>Amarnath Panyam</p>", 
    "end_date": null, 
    "title": "SQL Tuning", 
    "price": "25.00", 
    "instructors": "Amarnath Reddy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432074_fce1_2.jpg", 
    "course_url": "https://www.udemy.com/sql-tuning/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T15:02:45Z"
}