{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Senior SQL Developers are in high demand and demand 100k+ salary in the IT industry.</p><p>If we have to advance in our career and earn a good salary, we need these Advanced SQL skills. So let's take the next step of learning these advanced concepts of Oracle SQL.<br></p><p><strong>Learning these advanced SQL concepts would position you better in your working environment.</strong><br></p><p><strong>What will we learn?</strong></p><p>Students will learn the art of breaking a big SQL statement into small pieces and rebuild it again.</p><p>Create Materialized views to replicate data across servers and improve performance by using simple SQL syntax.</p><p>Partition the tables for better management and performance optimization using SQL Partitioning.</p><p>Students will learn to use Analytic SQL to aggregate, analyze and report, and model data using the SQL Analytic capabilities.</p><p>Students will learn to interpret the concept of a hierarchical query, create a tree-structured report, format hierarchical data, and exclude branches from the tree structure using SQL Hierarchical features.</p><p>Students will also learn to use regular expressions and subexpressions to search for, match, and replace strings using SQL built in functions.</p><p>Group and aggregate data using the built in SQL functions like ROLLUP and CUBE operators.</p><p>See you inside,<br></p><p>Amarnath Panyam</p><p><br></p>", 
    "end_date": null, 
    "title": "SQL Advanced", 
    "price": "25.00", 
    "instructors": "Amarnath Reddy", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525156_62b1_3.jpg", 
    "course_url": "https://www.udemy.com/advanced-sql-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T14:13:42Z"
}