{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><em>Course Updated - January 12, 2015</em></p><p>Did you ever quit taking lessons or never started in the first place? Do you wish you could play now but think it is too late? It's not and the best place to start is here. </p><p>This is a <em>Step by Step</em> course on how to play Für Elise. Adult and teenage beginners who have never played piano before, should find this course accessible. <strong>Y</strong><strong>ou don't even need to know how to read music!</strong> You will learn:</p><ul><li>How to read music through a new innovative system (but you don't have to learn it if you don't want to)</li><li>How to play Für Elise expressively</li><li>How to use the pedal</li><li>The piano keyboard</li></ul><p><br></p><p>The course is mainly delivered in <em>How to </em>videos showing you exactly what you need to do. Each video will take you through the steps on how to practice each segment. You will also find supplemental materials for you so that you can match your style of learning to the media that helps you the best. </p><p><em>You will also have full access to the course teacher while you are taking this course</em>. He will answer your questions and help you through the process. </p><p>Best of all, <em><strong>t</strong></em><em><strong>his course will get you playing Fur Elise faster than conventional lessons. </strong></em>Doing the work outlined in the lessons, a student could confidently play Fur Elise in about 3-4 weeks. Conventional 30 minute lessons usually takes months. Sign up now and start playing piano!</p>", 
    "end_date": null, 
    "title": "Step by Step Piano - Für Elise for Newbies ", 
    "price": "20.00", 
    "instructors": "Jarrod Bell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721322_e230_3.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-piano-fur-elise-for-newbies/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T23:42:46Z"
}