{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t    Dieser umfassende Kurs beinhaltet alle Themen, welche beim Fotografieren auf der Strasse wichtig sind. Ich zeige Euch, wie ich meine Bilder mache und warum ich sie genau so mache. Ich erkläre die rechtliche Situation und wie ihr sie elegant umschiffen könnt. Ich zeige anhand von meinen Bildern welche Gestaltungsmöglichkeiten sowie Aufnahmetechniken auf der Strasse relevant sind. Ich erkläre, wie ihr die Angst überwindet und warum die Kamera nicht wirklich relevant ist, um auf der Strasse gute Bilder zu machen. Der Kurs zeigt auf, wie man Inhalte in die Bilder bringt und wie man sie interessant und spannend gestaltet. Es werden Fragen zur Ethik genau so intensiv behandelt wie solche zu Social Media.  </p>  <p style=\"\">  \t    Der Kurs dauert über 4 Stunden und ist in die folgenden 9 Abschnitte unterteilt:  </p>  <ul style=\"\">  \t<li style=\"\">Über diesen Kurs und über mich</li>  \t<li style=\"\">Einführung in die Street Fotografie</li>  \t<li style=\"\">Kamera &amp; Einstellungen</li>  \t<li style=\"\">Fähigkeiten, Angst &amp; andere Hindernisse</li>  \t<li style=\"\">Inhalt &amp; Bildgestaltung</li>  \t<li style=\"\">Gestaltungselemente &amp; Aufnahmetechniken</li>  \t<li style=\"\">Bildbearbeitung</li>  \t<li style=\"\">Für Fortgeschrittene</li>  \t<li style=\"\">Zusammenfassung</li>  </ul>  <p style=\"\">  \t    Kurz gesagt, verrate ich alle Geheimnisse und gebe mein ganzes Wissen preis, welches ich mir über die letzten 5 Jahre beim intensiven Fotografieren in den abgelegensten Winkeln auf dieser Welt angeeignet habe. Dieser Kurs umfasst den ganzen theoretischen Teil meines Workshops, welchen ich unregelmässig an unterschiedlichen Orten durchführe. Mit diesem Online Kurs bekommt ihr die Möglichkeit, Euch das nötige Wissen bequem übers Internet und dieses in Eurem Tempo anzueignen. Zwischendurch geht ihr am besten raus und übt das Gelernte, damit der Lerneffekt am grössten ist.  </p>  <p style=\"\">  \tWenn Sie mit dem Kurs nicht zufrieden sind, haben Sie eine <strong style=\"\">30-Tage-Geld-zurück-Garantie</strong>. Zögern Sie also nicht und belegen Sie heute noch diesen spannenden Kurs.  </p>", 
    "end_date": null, 
    "title": "Street Fotografie: Erfolgreich auf der Straße fotografieren", 
    "price": "20.00", 
    "instructors": "Thomas Leuthard", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265590_14fc_4.jpg", 
    "course_url": "https://www.udemy.com/streetfotografie/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T11:03:41Z"
}