{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to <strong class=\"redactor-inline-converted\">Stress Free Strategic Grant Planning &amp; Management</strong>. This unique course is based on a system I used and adapted for my employers and clients since 1989. It is unique in that it gives you proprietary grant management tools to:</p>\n\n<ul>\n<li>win grants</li>\n<li>receive grant awards</li>\n<li>track every aspect of the proposal preparation and submission process</li>\n<li>organize and keep current every piece of data that you might need to use in any proposal</li>\n<li>plan funding for several years in advance</li>\n<li>choose <ul><li>the right funder</li><li>for the right program</li><li>at the right time, and </li><li>in the right sequence</li></ul></li><li>report outcomes and show the funders that you were a good steward of their money</li>\n</ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>FOR EXAMPLE: If you've ever applied to Funder A for program expenses only to find out, too late, that Funder A was the ONLY ONE who would fund your construction or administration costs, while Funder B would gladly have funded your program expenses, you can appreciate how important it is to plan carefully, especially when future funding will be affected.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">If you've ever wished you had a way to choose...</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>\n<li>which funder</li>\n<li>for which program</li>\n<li>in which sequence</li>\n<li>and when</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">THIS IS THE COURSE FOR YOU!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This <strong class=\"redactor-inline-converted\">Strategic Planning</strong> course was developed for and adapted to many different types of NPOs over 25 years. You won't find this system anywhere else.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As a grant writer, nonprofit, or consultant, you will find this course gives you a complete solution for developing a system of grants management and strategic planning. It includes a sequence of data management and tracking forms, three funder-selection calculators, and a system to tie them all together into stress-free, grant planning and management system. You'll be so organized that you and your teammates will actually be able to take your lunch breaks. And, never again will you have to spend frantic hours in crisis-mode, trying to get your proposal submitted by the deadline. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>**********</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">If you've ever run into delays getting data, budget, signatures, reviews or approvals with a fast approaching deadline...</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Stress-Free Strategic Grant Planning and Readiness</strong> will provide you a truly stress-free planning and management system, including:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>\n<li>the forms and a database, to manage your entire grant funding system</li>\n<li>funding opportunity calculators that you will use to weigh the fit between your programs' goals and each funder's goals and to help you choose the right funder, for the right program, at the right time, and in the right sequence. </li>\n</ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This is especially valuable for organizations that have a large number of grant applications and multiple projects going on at any given time.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>\n<li>How to IMPLEMENT this proven proposal-writing management process</li>\n<li>WHO belongs on your proposal-writing and management teams</li>\n<li>What to include in your proposal writing and management POLICIES &amp; PROCEDURES</li>\n<li>How to manage each phase of your PROPOSAL-MANAGEMENT PROCESS</li>\n<li>How to establish CRITERIA for choosing your funding sources</li>\n<li>How to AVOID SUBMITTING MULTIPLE APPLICATIONS for the same RFP</li>\n<li>How to DECIDE WHICH RFP to apply for, for each program or project</li>\n<li>How to DETERMINE WHEN to apply for each grant you have identified</li>\n<li>How the tools in the <strong class=\"redactor-inline-converted\">Strategic Planning Toolkit </strong>(included) are used to create a system that flows SMOOTHLY AND STRESS-FREE</li>\n</ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And to wrap all of this together, the grant management system provides sample (editable) written procedures for smooth-flowing processes from the moment you begin to choose a funder to the moment you submit the proposal to the funder. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The system ensures that your grant applications will be error free, thoroughly reviewed, checked for accuracy and completeness and submitted error free and with essentially no stress or last minute crises (conditions most likely to cause errors.)</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I've successfully implemented this system in small and large organizations. It's flexible enough to accommodate the many unique aspects of different nonprofits' management practices.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You'll learn how to use the <strong class=\"redactor-inline-converted\">strategic planning and management tools</strong>. These tools provide storage for your most current data, to grab and insert in your proposals and budgets. They also provide the tracking records needed to keep your proposal moving through the writing, review, editing, and submission stages. In addition you'll have three different methods of evaluating your programs to match RFAs and identify the best fits.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Funding, as you know, is not just the result of submitting a qualifying proposal, but of developing relationships and credibility. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>When your organization is able to show a funder that you've covered all the essentials and are operating at the highest standards, you improve your credibility in the eyes of funders. Relationships, on the other hand, you'll have to build yourself. Begin with this system. </p>\n\n\n\n\n\n<p>With this system, you can organize your nonprofit in ways that will make your competition wonder what you've got that they don't have.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Not a bad spot to be in.</strong></p>", 
    "end_date": null, 
    "title": "Stress Free Strategic Grant Planning & Management System", 
    "price": "50.00", 
    "instructors": "Michele Boyer, RRT", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786616_15ee.jpg", 
    "course_url": "https://www.udemy.com/stress-free-strategic-grant-planning-management/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T22:33:19Z"
}