{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t    This course is designed to get you developing faster with Sublime Text, one of today&#039;s best text editors, in minimal time. You be taught all the best tips and tricks to skip the breaking in stage of using a new editor. You will also be given resources to make your coding life easier, and to increase your development speed even more with Sublime Text.  </p>  <p style=\"\">  \t    This course is all video tutorials so you can work right along with me as I guide you through a Sublime Text workflow. Not only that, but they are downloadable so you can access them at any time!  </p>  <p style=\"\">  \t    This course will take less than two hours to complete but it will save you hundreds of development hours in the future. You can&#039;t beat that ratio!  </p>  <p style=\"\">  \t    The course is divided in to two sections, &quot;The Basics&quot; and &quot;Advanced Features&quot;. All lessons are video tutorials where you can watch me work with Sublime Text.  </p>  <p style=\"\">  \t    If you have heard about Sublime Text and you have always wanted to know more about it or you are using but you aren&#039;t very familiar with all the power it can harness, then this is the course for you. Even if you do know Sublime Text very well, I&#039;m sure there is still some useful information in this course just waiting for you to use it.  </p>", 
    "end_date": null, 
    "title": "Sublime Text Workflow", 
    "price": "20.00", 
    "instructors": "Kurtis Kemple", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/89528_1433_7.jpg", 
    "course_url": "https://www.udemy.com/sublime-text-workflow/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-07T21:15:21Z"
}