{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em style=\"\">LATEST: Course Updated September 2015 To Include More Lectures.</em>  </p>  <hr style=\"\">  <p>  \t<em style=\"\">* OVER 2000 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE</em>  </p>  <hr style=\"\">  <p>  \t                        This is a fantastic course about how to create successful events. The course covers important issues like how to price your event, how to promote your event, different ways in which you can make money from your event, and much more.  </p>  <p>  \t                                  The course is about 30 minutes of video content. It is relatively short, but it covers a real wealth of insightful information.  </p>  <p>  \t                                  The course is brought to you by two businesses. I, the creator of the Problemio business apps, have created a successful event series in the past, and GrandStandStore which prints event materials such as posters and brochures also contributed ideas to this course. With this course you get the advice of two companies with experience in creating events. If you are a new event organizer, this course is a must!  </p>  <p>  \t                                  By the end of the course, you will feel that you are head and shoulders above where you were before you got started with the course.  </p>  <p>  \t                  In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p>  \t                                +++++++++++++++++++++++++++++  </p>  <p>  \t                                MONEY BACK GUARANTEE  </p>  <p>  \t<em style=\"\">The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Successful Events: Event Planning, Marketing & Management", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253804_f968_3.jpg", 
    "course_url": "https://www.udemy.com/event-marketing-how-to-create-a-successful-event-series/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-01T14:39:18Z"
}