{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>As educators we come across a range of diverse students, some of our students may need just that little bit of extra support to help them due to being differently abled.</p>  <p>This course covers how we can best support these students by developing an understanding of disabilities and learning, supporting students through strategies and responding to risky behaviour and uncharacteristic behaviours in students. </p>  <p>The course contains a series of lectures broken up into three parts and a series of knowledge quizzes throughout to assess your understanding and application in different contexts and, you will have access to a repository of articles surrounding education and supporting students with disabilities. </p>  <p><strong>The course is structured as follows:</strong></p>  <ul><li>Understanding </li><ul><li>What is a disability?</li><li>What is the impact upon learning?</li><li>Readings</li><li>Quiz</li></ul><li>Supporting</li><ul><li>Supporting students with an ASD</li><li>Supporting hearing impaired students</li><li>Supporting intellectually impaired students</li><li>Supporting speech-language impaired students</li><li>Supporting students with physical conditions</li><li>Supporting visually impaired students</li><li>Creating an inclusive curriculum</li><li>Readings</li><li>Quiz</li></ul><li>Responding</li><ul><li>Uncharacteristic and inappropriate behaviours</li><li>Readings</li><li>Quiz</li></ul></ul>                                  <p>This course can be used as three hours of professional development for educators and is aimed at teacher aides, teachers, trainer/assessors, undergraduate (pre-service) teachers and anyone involved in the education sector.</p>  <p>Those participating in this course should have an understanding of the terminology used in the education sector and an intermediate understanding of education, pedagogical practices and teaching delivery.</p>  <p>If you want to be able to further assist the students in your class by bringing out the best in differently abled students, then this is the course for you. While you can conduct this course at your own pace, it should not take more than three hours to complete and at the end you will have the skills and knowledge to support students with a recognised disability achieve successful learning outcomes.</p>", 
    "end_date": null, 
    "title": "Support disabled students", 
    "price": "20.00", 
    "instructors": "Mr Nathan Watts", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707106_8331.jpg", 
    "course_url": "https://www.udemy.com/support-disabled-students/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-26T18:00:46Z"
}