{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course is intended to teach the student how to assemble a basic survival kit that is easily carried. It will show the student how to use the equipment to quickly and<strong> effectively increase their chances of survival in an emergency.</strong></p><p>This course is intended to people with <strong class=\"redactor-inline-converted\">limited experience in Survival skil</strong>ls however it will also enhance the skill sets of those who currently practice <strong class=\"redactor-inline-converted\">bushcraft, prepping or woodsman skills</strong>. It is perfect for those who enjoy the great outdoors whether they are hunting, fishing or hiking on the trails etc.<br><br>This course contains an <strong class=\"redactor-inline-converted\">extensive overview of the Basic kit requirements  and skills sets</strong> used in wilderness survival through video as we feel that this is more effective as a learning tool. <br><br>The course itself is comprised of four content laden lectures totalling over 1 hour of teaching. Although whilst learning and <strong class=\"redactor-inline-converted\">practising, honing and owning </strong>the skill sets contained within the course will take each individual a different amount of time. With that being said former students have successfully got the basics down within a couple of hours of practice.<br><br><strong class=\"redactor-inline-converted\">Why should you take this course? </strong>To answer this simply you owe it to yourself, your family and loved ones to do everything in your power to enhance your chances of SURVIVAL in an emergency. <strong class=\"redactor-inline-converted\">How much is your life worth??</strong></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Survival 101 - What you need to know for when the SHTF !", 
    "price": "25.00", 
    "instructors": "Russell Baillie", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796904_cbc0.jpg", 
    "course_url": "https://www.udemy.com/survival-101/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-18T12:06:15Z"
}