{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Swift ist in der Apple-Welt ein heißen Eisen. Ich kenne keinen iOS-Entwickler, der davon nicht genauso begeistert ist wie ich. Neue Projekte setzen daher in der Regel bereits gleich auf Swift. Doch bevor die iOS-Entwicklung damit gelingt, müssen die Grundlagen natürlich beherrscht werden. Die Syntax und Basiselemente müssen auch erfahrene Apple-Entwickler mindestens ausprobieren. Und genau dafür ist dieses <span style=\"\"><strong style=\"\">Swift Tutorial</strong></span>. Es ist ein <span style=\"\"><strong style=\"\">Crashkurs für die iOS-Entwicklung mit Swift</strong></span>.</p><p style=\"\">Der Kurs richtet sich an Einsteiger in die iOS- und Mac OS X Entwicklung. Auch Umsteiger, die aus der Objective-C Programmierung kommen, können mit dem Crashkurs durchstarten und erste Grundlagen lernen. Das Training ist bewusst mit kurzen und prägnanten Lektionen gestaltet. So kann es später optimal auch als Referenz eingesetzt werden.</p><p style=\"\">Inhaltlich zeige ich Dir alle wichtigen Grundlagen, die Du als Entwickler unmittelbar brauchst. Dazu gehören Variablen, Datentypen, Tuples und die neuen Optionals. Auch die wichtigen Operatoren stehen auf dem Programm. Dies sind zum Beispiel Rechenoperationen, Vergleichsoperatoren sowie die logischen Operationen. Weitere wichtige Kapitel sind gerade für Einsteiger genauso die Strings, Arrays, Dictionaries und Kontrollstrukturen. Zuletzt wird eine erste App umgesetzt in der Xcode, das AutoLayout und die Übertragung des Wissens auf die Praxis in den Fokus rückt. Gemeinsam gehen wir erste Schritte.</p><p style=\"\">Gerade für Einsteiger sind die Xcode-Playgrounds ein echter Spielplatz. Ich habe vorher noch keine Sprache derart schnell gelernt. Aber auch mitten im Projekt sind sie absolut genial. Eben schnell Codeschnipsel separat entwickeln, testen oder debuggen? Mit Playgrounds einfach wie nie zuvor. Mit dem Tutorial gelingt Dir innerhalb kürzester Zeit den Einstieg in Swift. Es handelt sich nicht um eine ausführliche Referenz zu Swift - es ist ein Einsteig in die wichtigsten Grundlagen.</p><p style=\"\">Mit diesem Kurs kannst Du <span style=\"\"><strong style=\"\">Swift an einem Wochenende lernen</strong></span>. Danach kannst Du unmittelbar die iOS-Entwicklung mit CocoaTouch Framework einsteigen.</p>", 
    "end_date": null, 
    "title": "Swift 2.2 Tutorial - der Crashkurs", 
    "price": 0, 
    "instructors": "Jan Brinkmann", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529328_731f.jpg", 
    "course_url": "https://www.udemy.com/swift-tutorial-der-crashkurs/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T09:46:31Z"
}