{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>SystemVerilog Assertions and Functional Coverage is a comprehensive\nfrom-scratch course on Assertions and Functional Coverage that covers features\nof SV LRM 2005/2009 and 2012.</strong> The course does not require any prior\nknowledge of OOP or UVM. The course is taught by a 30 year veteran in the\ndesign of CPU and SoC who published a book on SVA and FC in 2014 and hold 13\nU.S. patents on design verification. The course has 33 lectures and is 8.5\nhours in length that will take you step by step through learning of the\nlanguages.</p><p>The knowledge gained from this course will help you <strong>find and cover\nthose critical and hard to find and cover design bugs. </strong>SystemVerilog\nAssertions and Functional Coverage are very important parts of overall\nfunctional verification methodology and all verification engineers <strong>need\nthis knowledge to be successful</strong>. The knowledge of <strong>SVA and FC\nwill indeed be highlights of your resume </strong>when seeking a challenging\njob or project The course offers step-by-step guide to learning of SVA and FC with\nplenty of<strong> real life applications </strong>to help you apply SVA and FC\nto your project in shortest possible time. SVA and FC helps <strong>critical\naspect of Functional/Temporal domain coverage </strong>which is simply not\npossible with code coverage. </p>", 
    "end_date": null, 
    "title": "SystemVerilog Assertions & Functional Coverage FROM SCRATCH", 
    "price": "20.00", 
    "instructors": "Ashok Mehta", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761780_0d2d_2.jpg", 
    "course_url": "https://www.udemy.com/systemverilog-assertions-language-and-applications/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T22:05:34Z"
}