{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>This online underwater photography course will teach you how to take amazing images underwater, by using your compact cameras (with a housing).</p><p>This course is designed to teach you the basics of underwater photography, even if you have little to no experience with it, to help create professional quality underwater images.</p><p>While there are plenty of underwater photography courses that focus on diving skills or how to use gear, it&#039;s hard to find a practical course like this one taught by a professional photographer, which is for beginner underwater photographers.</p><p><strong style=\"\">This course is designed for beginners with compact cameras who want to improve their skills and take stellar underwater images.</strong></p><p>Regardless of what your level of experience is or what type of camera you use, this in-depth beginners course is designed to provide you with everything you need to take your underwater photography skills to the next level.</p><p>Whether you prefer taking photos of schools of fish, a nudibranch or divers, a great underwater photographer knows how to compose a shot, light it, and edit it. By honing these skills, you can create lifelong memories of your dives.</p><p>This course shows you how.</p><p>Unlike other underwater photography classes that are more focused on equipment and diving skills, this beginners course teaches you how to take amazing underwater photos.</p><p><strong style=\"\">Contents and Overview</strong></p><p>This course is aimed at teaching underwater photographers what it takes to improve your composing techniques to make really good underwater pictures.</p><p>You&#039;ll start with the basics and understand underwater photography techniques and ideas, the opportunities available for creating extraordinary underwater pictures, and techniques you can follow to accomplishing your goals. You&#039;ll then dive into the different styles of underwater composition ideas you can focus on.</p><p>You&#039;ll learn about your camera settings, including how to shoot in manual mode. You&#039;ll use color balancing tools and master how to properly compose and light a scene. You&#039;ll even learn how to take great photos and how to edit images.</p>", 
    "end_date": null, 
    "title": "Take Amazing Underwater Pictures Using Compact Cameras", 
    "price": "30.00", 
    "instructors": "Randy Travis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397166_b017_2.jpg", 
    "course_url": "https://www.udemy.com/underwater-photography-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T11:49:57Z"
}