{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul>Are you:<br><br><li>Concerned about how much you are drinking?</li><li>Wanting to know if you can feel better and do more without alcohol?</li><li>OK with your drinking, but feeling in need of a health-kick?</li><li>Happy with your drinking but looking for a personal challenge?</li><li>Raising funds for charity (Dry January, Dryathlon, Go Sober for October, or similar) and need a bit more help to manage your month?</li></ul><p>Whatever your reasons for taking a <strong>Month Off Booze</strong> or <strong>Joining the MOB</strong>, changing your habits to live a healthier life can be difficult when you try to do it alone.</p><p>The MOB has lectures from planning and preparing, to offering structure and exercises to make it a success along the way, and then at the end tools for reflection and deciding what to do at the end of your alcohol-free month.</p>What do you get for taking this course:<strong></strong><ul><li>A complete set of tools and tips to plan your month off booze and to make it happen.</li><li>Lectures on emotions, habits, pitfalls and how to overcome them.</li><li>How to deal with stress, difficult people and situations.</li><li>New non-alcoholic drink ideas.</li><li>Videos with extra content, including discussion about various topics of the course.</li></ul>The course material has been developed by a qualified psychologist and the Club Soda team.<p><br><br></p><p> The course can be taken in any way you like, but if you study the lectures in the suggested order and schedule (one to three lectures each day), you can use the course to help you take a sober month, and spend a week before for planning and preparation.<br></p><p><strong>Note</strong>: The course videos are recordings from a series of webinars that we broadcast in 2015 for a similar online course. The video quality is not always perfect. Note also that the main content of the course is in the text lectures and handouts, the videos supplement these.<br></p>", 
    "end_date": null, 
    "title": "Take a Month Off Booze", 
    "price": "50.00", 
    "instructors": "join Club Soda, Tutor Laura Willoughby MBE, Helen O'Connor", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631454_3ad4_2.jpg", 
    "course_url": "https://www.udemy.com/take-a-month-off-booze/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T16:00:39Z"
}