{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \tDo you want to teach English Abroad? Have you ever thought of teaching English as a second language? Are you looking to start your career as an ESL teacher in Thailand but you are feeling overwhelmed with information? Do you want to take a gap year to teach English in Thailand but are scared to take the initial step? Is living in Thailand your ultimate dream but you do not know how to make a living here?  </p>  <p style=\"\">  \t          Teaching ESL in Thailand is rewarding and allows for an amazing lifestyle. This course will empower you with everything you need to know about teaching in Thailand.  </p>  <p style=\"\">  \t          In this course I will help you:  </p>  <ul style=\"\">  \t<li style=\"\">Plan your trip to Thailand.</li>  \t<li style=\"\">Choose the perfect location within Thailand for you.</li>  \t<li style=\"\">Give you a realistic view of what teaching in Thailand is all about.</li>  \t<li style=\"\">Give you an estimate of how much money you need to get you started.</li>  \t<li style=\"\">Give you the facts on what you need in order to be a teacher in Thailand.</li>  \t<li style=\"\">Give you the accurate requirements for teaching in Thailand.</li>  \t<li style=\"\">Give you a clear step by step guide to take in order to guarantee a teaching job in Thailand.</li>  \t<li style=\"\">Ongoing assistance if you have any more questions.</li>  </ul>  <p>  \t        Sign up today and start your journey to become an English teacher in Thailand.  </p>  <p>  \t<strong style=\"\">What others are saying about this course:</strong>  </p>  <p>  \t    &quot;Saved me so much time and money!  </p>  <p>  \t    Larissa is really honest and practical throughout this course and it was such a good kickstart for me to actually go out and teach in Thailand. She helps you decide whether it&#039;s right for you, and avoid all the pitfalls. Gives loads of great shortcuts and makes you realise it really is possible to make money living abroad.  </p>  <p>  \t    Have got my job all sorted now and can&#039;t wait to get started.  </p>  <p>  \t    Would highly recommend the course.&quot;  </p>  <p>  \t    -Louise Croft  </p>  <p>  \t<strong style=\"\">&quot;Straightforward info I needed!</strong>  </p>  <p>  \t    This course had the perfect straightforward info I was looking for on how to become an English teacher in Thailand. I&#039;ve been wanting to travel for a long time, and I think teaching english is probably the easiest way I could get myself someplace cool and still make money!  </p>  <p>  \t    The instructor broke it all down in a very easy way, and made it fun to watch the videos. She really seems to understand how to make it all work together! I&#039;ve seen the info in other places online, but this is by far the most complete information I could find from someone who ACTUALLY taught there.&quot;  </p>  <p>  \t    -Jesse Zagorsky  </p>", 
    "end_date": null, 
    "title": "Teach English in Thailand", 
    "price": "25.00", 
    "instructors": "Larissa Swart", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403008_d0d6_4.jpg", 
    "course_url": "https://www.udemy.com/make-money-teaching-english-in-thailand/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T16:25:25Z"
}