{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \tThis course will explore the social-psychological theories of achievement, such as “grit”, self control, resilience, and growth mindset, that underlie student learning. Participants will learn strategies for increasing achievement in their classrooms, schools and at home in order to meet the social emotional learning rigor of the Common Core Standards and help children develop the achievement skills necessary for the 21st century and beyond. The class will explore how to build a school culture that emphasizes these skills as fundamental components of success. The course will feature the latest research in adolescent brain development, student motivation, and social psychological intervention.  Growth mindset is the idea that the human brain actually has the ability to grow and change allowing us to learn based on the amount of effort we put forth rather than relying on our innate intelligence.  In fact, recent research is providing evidence that our innate intelligence is less important and less powerful than many of us have been taught it is.  Think about all the people that have demonstrated the ability to succeed despite many obstacles.  Research has shown that the intelligence and talent that we are born with is not as good a predictor of success as the effort that we put forth to attain goals.  So, if this is true, how do teachers and parents use this information to help kids succeed? Maybe our test scores aren’t dependent on IQ scores? This course identifies specific, actionable strategies, many of which can be implemented today, that will help all kids succeed.  If you are a teacher who thinks your state test scores are dependent on the intelligence of the kids you have been assigned to teach, you will learn ways to increase achievement in all children you are assigned to teach.  If you are a parent, who has a struggling student or a student for whom learning comes easily, you will learn strategies that will help both types of learners achieve high expectations throughout their entire lives.  </p>", 
    "end_date": null, 
    "title": "Teaching & Raising Successful Kids", 
    "price": "25.00", 
    "instructors": "Gabrielle Marquette M.Ed.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/271354_7260_2.jpg", 
    "course_url": "https://www.udemy.com/teaching-raising-successful-kids/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-30T01:18:53Z"
}