{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This Wordpress course is designed to offer you a simple, easy to understand and straightforward approach when it comes to learning how to build a site or blog. It dosen't require any specific technial background or knowledge in order to participate.<br></p><p><strong></strong><strong>Who is this Wordpress course for?</strong></p><p>Ever wanted to easily build a great looking site that you have a total control but felt overwhelmed by all the options available out there?</p><p>This course is jam packed with material that will help you create a professional Wordpress website in 24 hours or less by adapting the information given in practice.</p><p>You don’t need to pose any specific technical abilities or knowledge as the course assumes that you are a complete beginner just starting out!</p><p>Each sections of the course have a quiz which will allow you to test what you just learned and if you don’t pass it, just repeat the lecture until you grasp it!</p><p><strong>Few of the modules we are going to cover in this Wordpress course</strong>:<br></p><ul><li>Pick the ideal domain for your site or blog</li><li><span></span>Install Wordpress quickly with the automatic installer</li><li>Easily manage your images, videos, sound files etc</li><li>Familarize yourself with the Wordpress admin dashboard</li><li><span></span>Discover how to modify the fundamental Wordpress settings </li><li><span></span>Learn how to easily work with content management in WP</li><li><span></span>How to quickly set up your homepage or index page </li><li><span></span>Configure the navigation on different areas of your site</li><li><span></span>Turn your site into a well-protected fort with great security</li><li><span></span>Discover the \"must have\" plugins you need to install</li><li><span></span>Change the look of your site in less than a minute</li></ul><p><em><strong><br>After you complete this course you will be able to create a professional and great looking Wordpress in less than 24 hours!</strong></em><br></p>", 
    "end_date": null, 
    "title": "Teach Yourself Wordpress in 24 Hours or Less", 
    "price": "20.00", 
    "instructors": "Mr Mirsad Hasic", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707148_d3bc_4.jpg", 
    "course_url": "https://www.udemy.com/learn-wordpress-in-24-hours-or-less/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-26T19:40:40Z"
}