{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \tThai For Beginners online video course is designed as an easy to use, fun and interactive introduction to the Thai language. It&#039;s <strong style=\"\">ideal for people wanting to travel or live in Thailand</strong>.  </p>  <p>  \tThe course focuses on <strong style=\"\">day-to-day conversational topics</strong> and building a good fundamental understanding of the language. <strong style=\"\">You&#039;ll develop a solid foundation in Thai through speaking and using the language</strong>, instead of spending weeks on learning grammar rules and the alphabet.  </p>  <p>  \tBy taking this course you&#039;ll be able to pierce through that invisible veil that exists between foreigners and Thais, and start speaking with the locals in their language, therefore <strong style=\"\">developing much deeper relationships and experiences</strong>.  </p>  <p>  \t<strong style=\"\">Your confidence</strong> when dealing with things in Thailand <strong style=\"\">will grow</strong><span>, while <strong style=\"\">your image in the eyes of the Thai people will rise immensely</strong> as you&#039;ll set yourself apart from being &quot;just another foreigner&quot;.</span>  </p>  <p>  \tThe course covers 20 lessons through <strong style=\"\">dynamic and interactive video lectures</strong>, and follows a structured and easy to use pattern. At the end of most lessons, there&#039;s a review part where you&#039;re able to practice and repeat what you&#039;ve learned in that lesson.  </p>  <p>  \t<strong style=\"\">I highly encourage you to repeat words, phrases and sentences after me</strong> as you go through the lectures-- <strong style=\"\">your learning process will be much faster</strong><span> as your muscle memory develops through pronounciation and as you internalize how Thai sounds like, its melodic structure and its easy grammar.</span>  </p>  <p>  \tAfter completing the Thai For Beginners course you will be able to <strong style=\"\">communicate in practical, day-to-day situations</strong> in Thailand and develop a natural understanding of the language.  </p>  <p>  \tBy acquiring the conversational basics of the Thai language you&#039;ll be able to:  </p>  <ul style=\"\">  \t<li>Gain a deeper understanding of the Thai culture</li>  \t<li>Get an insight into the Thai mentality, which is heavily reflected in the language</li>  \t<li>Make more Thai friends -- maybe even meet your future partner -- and deepen your relationships and understanding with your existing Thai friends</li>  \t<li>Travel around Thailand and deal with every day necessities with less hassle and more confidence</li>  </ul>  <p>  \tWhen taking this course you will also get a <strong style=\"\">FREE 20-minute Skype conversation</strong> where you&#039;ll be able to practice your Thai, ask any questions you may have about the language, strengthen your weaknesses, focus on what you&#039;re struggling with, and more.  </p>  <p>  \tStart learning Thai today and see you on the inside!  </p>", 
    "end_date": null, 
    "title": "Thai Language For Beginners", 
    "price": "35.00", 
    "instructors": "Sunny Suphot", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65437_98ad_7.jpg", 
    "course_url": "https://www.udemy.com/thai-language-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-14T16:55:40Z"
}