{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    In this course the learner will understand the 4 basic styles of communication, social interaction and how all people have preferences in their personal  presentation styles.  </p>  <p style=\"\">  \t    The learner will get to assess their own style and that of their friends  &amp; colleagues from observation and pastbehaviouralhistory. This program is presented in a fun and interesting manner, however the applications of this learning are significant.  </p>  <p style=\"\">  \t    The learner will find out their personal preferences and will understand how to approach people and situations differently for maximum impact. The learner will discover how to adjust their approach to the various styles to ensure their message and needs are met.  </p>  <p style=\"\">  \t    Not only will the learner come away with a fresh perspective on their personal style but will also understand how others preferences impact them.  </p>  <p style=\"\">  \t    This is an ideal team building or project team program, as research and experience show that the perfect team has all four types present and each type brings strengths to the group.  </p>  <p style=\"\">  \t    We will look at the four styles in detail, how they like to communicate, how they like to give and receive information, and how they like to process information.  </p>  <p style=\"\">  \t    This program is in 7 modules that have video to teach the program and handouts to support the learner.  Each module will run about 15 minutes and the assessment takes approximately 10 minutes.  </p>", 
    "end_date": null, 
    "title": "That's My Style", 
    "price": "30.00", 
    "instructors": "Judy Mackenzie", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/154926_fbc1_2.jpg", 
    "course_url": "https://www.udemy.com/thats-my-style/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-29T20:07:23Z"
}