{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t <strong style=\"\">The Definitive Guide For Website Owners</strong> is about teaching people that own websites or that want to own a website, what is the proper methodology and which are the correct steps to take, in order to bring their site to the level of performance they wish and to better understand the process of creating and maintaining one, using modern day to day tools.  </p>  <p>  \t In this course, you will find <strong style=\"\">Video Presentations</strong>, <strong style=\"\">Powerpoint Presentations</strong>, <strong style=\"\">Articles</strong> and a <strong style=\"\">Glossary of Common Web Terminology</strong> that will help you understand more about Web Technologies.  </p>  <p>  \tBecause &quot;The Definitive Guide for Website Owners&quot; is a guide, it is structured in a way that gives you the option to either view it as a whole course, one Lecture after the other, or to choose the Lectures that interest you depending on their topic. This is very helpful for students that already have some knowledge of the course&#039;s main subject and would like to learn more.  </p>  <p>  \t You should take this course, if you are an <strong style=\"\">unhappy website owner</strong>, not satisfied with your website investment, or an <strong style=\"\">inexperienced website owner</strong> that does not understand how your website works or why it works in the way it does, or someone that just doesn&#039;t own a website but would like too, then this course is for you. This course will prove useful for <strong style=\"\">young Web Designers</strong> with fresh ideas that are just now starting their career and are still looking for ways to improve their methodology, it will provide handy tips for <strong style=\"\">experienced Web Designers</strong> looking for a couple of new ideas to perfect their procedures, also <strong style=\"\">Marketing managers</strong> that have been assigned the task of supervising the creation of a new site for their company, <strong style=\"\">Business owners</strong> looking to commission a Web Professional - Agency to build their new Business website, or simply people that are interested in learning about the theory of creating a website in general.  </p>", 
    "end_date": null, 
    "title": "The Definitive Guide For Website Owners ", 
    "price": "30.00", 
    "instructors": "Spyros Papaspyropoulos", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28925_8ceb_7.jpg", 
    "course_url": "https://www.udemy.com/the-definitive-guide-for-website-owners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-07T21:02:55Z"
}