{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  As the legalization and use of medical marijuana continues to sweep the nation, there is an increasing demand for how-to guides to help new patients effectively utilize this medicine. While the current guides focus on technical information about the science of growing marijuana or medical marijuana law, they often overlook essential aspects of the patient experience. &quot;The Patient-to-Patient Guide to Medical Marijuana&quot; starts from the patient’s perspective, giving insider tips on how to navigate the world of medical marijuana. Rather than rehashing the technical details (which are well documented and available for free online) this guide focuses on providing patients with practical tips, methods and resources for utilizing the wide array of online and in-person tools already at their disposal.  </p>  <p style=\"\">  \t  From the basics of getting your recommendation and finding a dispensary, to more advanced tricks like researching strains online, finding perfect strain for your condition and biochemistry or getting your insurance company to pay for your weed; this guide will lead you through the process.  </p>  <p style=\"\">  \t  Taught by Dr. Emily Earlenbaugh, PhD, who is a MMJ patient herself. The step-by-step course provides the resources and advice needed to navigate the complex world of MMJ.  </p>", 
    "end_date": null, 
    "title": "The Patient-to-Patient Guide to Medical Marijuana ", 
    "price": "20.00", 
    "instructors": "Dr. Emily Earlenbaugh", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251294_25a9_5.jpg", 
    "course_url": "https://www.udemy.com/the-patient-to-patient-guide-to-medical-marijuana/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-27T03:20:49Z"
}