{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>The course is for anyone who uses a Windows based PC -- especially business owners, freelancers, and people who work from home. Your productivity will sky-rocket, while your stress &amp; frustration drops; and you&#039;ll save money.</p><p>You&#039;ll easily learn through a series of narrated videos with written material to support them, plus a few bonuses!</p><p>Putting the material to use is EASY and much of it can be fully automated, so you can set it and forget it!</p><p>Great effort was made to eliminate tech jargon. Anyone with just basic computer skills can do this and reap the benefits.</p><p>It is not a PC repair course or a technical course and is not for people desiring to learn about the technical side of computers.</p><p><strong style=\"\">You&#039;ll Discover:</strong></p><ul style=\"\"><li>How to just about guarantee that you&#039;ll never have to worry about viruses again by doing a few simple things, then automating them. You&#039;ll be amazed at the performance increase you&#039;ll get right away just by eliminating these. And your sensitive passwords, files, and data will be much safer.</li></ul><ul style=\"\"><li>How to automate COMPLETE backups of your system, so in the unlikely event of a total crash you can be up and running again in a couple hours (not days) like NOTHING ever happened</li></ul><ul style=\"\"><li>How to ensure a fire, flood, or burglary at your home or office doesn&#039;t spell the end for your business.</li></ul><ul style=\"\"><li>How to stop a catastrophic hard drive failure BEFORE it happens.</li></ul><ul style=\"\"><li>Simple things you can do to keep your computer running FAST.</li></ul><ul style=\"\"><li>And MUCH more</li></ul><ul style=\"\"><li>Did I mention much of this can be AUTOMATED and there is no theory or tech jargon (because this is EASY) to confuse you?</li></ul>", 
    "end_date": null, 
    "title": "The Lazy Man's Guide to Automated Computer Care ", 
    "price": "20.00", 
    "instructors": "Brian Jenkins", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460778_9e96_2.jpg", 
    "course_url": "https://www.udemy.com/hassle-free-computer-care/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T17:08:28Z"
}