{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>In the past <strong>15 </strong><strong>years</strong>, the number of users on the internet has grown by almost <strong>3 billion</strong>. We feel, with this rapid growth, many people have been <strong>left </strong><strong>behind </strong>and no longer feel <strong>confident </strong>online. Over the next 2 years, it’s estimated that another <strong>600 million</strong> people will join the internet. How many of these people will be confident online?</p><p>That’s where <strong>we </strong>come in. We want to provide a <strong>strong </strong>education to anyone who feels <strong>under-prepared</strong> for the challenge ahead. </p><ul><li>How can I keep my details <strong>safe </strong>online?</li><li>What do <strong>viruses </strong>and <strong>Trojans </strong>do?</li><li>How can I avoid <strong>spam </strong>emails?</li><li>Is it <strong>illegal </strong>to download music online?</li></ul><p>If you've found yourself asking <strong>any </strong>of these questions, then you've found the right course.<br></p><p>We aim to teach you the <strong>absolute </strong><strong>basics </strong>of the internet and how it works. We’ll go through everything a <strong>beginner </strong>could need - from browsers to bookmarks. </p><p>You’ll benefit from nearly 4 hours of carefully constructed <strong>video </strong><strong>lectures</strong>, arranged into topical sections. You’ll see the screen from my perspective, allowing you to easily follow along at home. Each video will contain a description full of <strong>useful</strong>, <strong>relevant </strong><strong>material </strong>and <strong>links</strong>. There’ll also be numerous <strong>quizzes </strong>along the way, helping you to test yourself on what you've learnt. </p><p>Within this course you’ll also find an <strong>eBook </strong><strong>download</strong>, full of all the notes from the course. This will allow you to take the course with you, wherever you go!</p><p>We’re confident that our course will help you to become proficient online, and it comes complete with a full 30-day money back guarantee. </p><br>So, if you’re looking to master the internet and join the billions of online users then look no further; I’d love to have you as a student on the course, and help you to become confident online.", 
    "end_date": null, 
    "title": "The Beginner's Guide To Using The Internet & Social Media", 
    "price": "20.00", 
    "instructors": "David Childerley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627894_0d0d_4.jpg", 
    "course_url": "https://www.udemy.com/the-complete-beginners-guide-to-using-the-internet/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T11:42:31Z"
}