{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course  is set up to cover everything you will need to get started in the  ( File Sharing Community). bit-torrent  is a protocol for the practice of peer-to-peer file sharing that is used to distribute large amounts of data over the Internet..It is one of the most common protocols for transferring large files, and peer-to-peer networks have been estimated to collectively account for approximately 43% to 70% of all Internet traffic.</p><p style=\"\">To send or receive files the user must have a client, a computer program that implements the  protocol. Trackers provide a list of files available for transfer, and assist in transferring and reconstructing the files. File Sharing is utilized by 150 million active users.  Based on this figure, the total number of monthly  users can be estimated at more than a quarter of a billion. </p><p style=\"\"> In this Course I have outlined everything in easy to follow step by step instructions to get you started. In this course I walk you through all the programs required and how to set them up with ease. When you finish this course you will be up and running like a pro. As well you will be able to access even more content as it is added with no additional cost. With more in depth content coming soon such as setting up a rss feed to automatically download your files for you (a set it and forget it feature.) and much more to come. Why don&#039;t you join us on your journey and discover a whole new community of friends.   </p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\">As of January 2012,</p>", 
    "end_date": null, 
    "title": "The ABC of Downloading", 
    "price": "35.00", 
    "instructors": "Steven Barrett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485838_ec2d_5.jpg", 
    "course_url": "https://www.udemy.com/the-abc-of-downloading/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-25T03:43:19Z"
}