{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   Imagine being able to see all your business goals become a reality...  </p>  <p style=\"\">  \t   Things like:  </p>  <ul style=\"\">  \t<li style=\"\">Making 6 or 7 figures every year...</li>  \t<li style=\"\">Working less 2 - 3 days a week, so you could spend more time with loved ones...</li>  \t<li style=\"\">Overcoming any challenge that comes your way...</li>  \t<li style=\"\">Living a successful, enjoyable lifestyle every day...</li>  </ul>  <p style=\"\">  \t   What will your life look like if you could reach any business goal you wanted?  </p>  <p style=\"\">  \t   This course is designed to train you how to develop a successful mindset, so that you can easily and naturally create success in your business...  </p>  <p style=\"\">  \t This course is constructed to give you thought provoking lessons, and step by step exercises that will help you change your internal mindset, which will allow you to overcome the major obstacles to your success.  </p>  <p style=\"\">  \t Each video provides a lesson, an exercise, a decision you are called to make, as well as one practical step you can take to begin to see immediate results.  </p>  <p style=\"\">  \t This course is for you if you have ever wanted to:  </p>  <ul style=\"\">  \t<li style=\"\">Stop dreaming of success but actually live it.</li>  \t<li style=\"\">Overcome the obstacles that you know are holding you back from the life you want.</li>  \t<li style=\"\">Experience the confidence that comes from achieving your goals time and again.</li>  \t<li style=\"\">Finally overcome the fear that is paralyzing you and preventing you from seeing your dreams a reality.</li>  \t<li style=\"\">Be an example to yourself and others, of what it means to achieve success in one&#039;s life.</li>  </ul>  <p style=\"\">  \tAll of the lessons in this video series have been thoroughly tested and have consistently produced successful changes that have propelled business owners to new heights in their business.  Whether adding another zero to their income, helping them work less but make more money, or just help them operate at their best - these classes have worked wonders on the lives of many business owners and will work for you as well.  </p>  <p style=\"\">  \tI look forward to seeing you make the changes that will lead to outrageous success in your life and business.  </p>", 
    "end_date": null, 
    "title": "The 8 Keys to Outrageous Business Success", 
    "price": 0, 
    "instructors": "William U. Peña, MBA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165376_e99d_2.jpg", 
    "course_url": "https://www.udemy.com/the-8-keys-to-outrageous-business-success/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-17T02:05:44Z"
}