{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Have you ever wanted to create the type of videos you see on Facebook or YouTube?</p>\n\n<p>Have you been at at birthday party and seen a movie with pictures and music and wondered how it is done? </p>\n\n<p>Have you got a new shiny Macbook and have no idea how to use or get the most out of it?</p>\n\n<p>If you answered yes to any of the above questions then this course is for you. This Course is a complete guide to iMovie. In the course we will look at everything from the basics of iMovie to the more advanced video editing options so that you can take your videos and make something that you are proud of when you watch it back in years to come. <br></p>\n\n<p>You can impress family and friends by using iMovie to create a musical photo album for a family birthday party or anniversary.</p>\n\n\n\n\n\n<p>The iMovie course is explained in simple terms that the non video editor will be able to understand, this course is your gateway into video editing so you are not expected to know all the terms before you start.</p>\n\n\n\n\n\n<p>In the iMovie course I will take you on a journey through iMovie, starting at the basic layout and finishing when we are hitting the export  button. Using simple terms, i will demonstrate each process and you can follow along using the sample videos that I will provide for you. </p>\n\n\n\n\n\n<p>The course will be completed in under two hours and you will have all the tools you need to make your home movie to impress your family and friends. </p>\n\n\n\n\n\n<p>The course is laid out in an easy to follow manner, starting with an overview of the iMovie application, then starting to import video clips, either taken by you or the sample ones that I provide. We get into adding videos into our project and editing them so that we can create the movie that we want. <br></p>\n\n\n\n\n\n<p>This course is for anyone who has an interest in creating home movies that they can show their family and friends. It can also be used by someone who would like to make a promotional video for their business or even to create your Udemy course</p>", 
    "end_date": null, 
    "title": "The Complete iMovie Course", 
    "price": "20.00", 
    "instructors": "Colin Marks", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796322_6799.jpg", 
    "course_url": "https://www.udemy.com/imovie-course/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T21:39:38Z"
}