{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong style=\"\">Learn to build awesome browser applications that automatically adjust to mobile devices, even if you&#039;ve never heard of Bootstrap before</strong>  </p>  <p>  \t              Do  you want to build browser applications that make people say &quot;wow!&quot; when  they see it?  Of course you do!  I do too.  How about apps that look  great on a mobile device and size automatically for different screens?   Yep, I want that too. :)<br style=\"\">  \t<br style=\"\">  \t               Based on the (included) Amazon Best-Seller<strong style=\"\"> &#039;The Joy of Bootstrap&#039;</strong> this course steps you from knowing <strong style=\"\">nothing</strong> about Bootstrap to understanding its full potential.  The course includes the full text of the book plus each chapter gets its own presentation and sample code.  </p>  <p>  \t<strong style=\"\">The goal </strong>of this course is to  launch you into the subject as quickly as possible and to empower you with  the basics right away.  </p>  <p>  \t<strong style=\"\">Experiment with the code on the Companion Web Site</strong>  </p>  <p>  \t               The  course comes has tons of Bootstrap example source code which you can tweak and  play with.   It&#039;s all available at the companion website  where you can even edit the code without downloading it. (Go ahead, try  it now!)  The course will walk you through all the hard code and explain  how it works.  </p>  <p>  \tEven better, Udemy offers a 30 day guarantee, so you have nothing to lose by signing up right now.  </p>  <p>  \t<strong style=\"\">This is the Bootstrap course for you....</strong>  </p>  <p>  \t      The modules are grouped into easy, logical concepts that work together but still stand  on their own.   Presenting the book as a Udemy course makes Bootstrap even easier to understand and faster to learn.  Every lecture was obsessively edited for clarity.<br style=\"\">  \t<br style=\"\">  \t             I write in a fun, conversational style  that makes technical topics approachable for beginners.  When it makes  sense I build on early concepts to take you into progressively more  advanced (cool) topics and exercises.<br style=\"\">  \t<br style=\"\">  \t             We&#039;ll also continue to use the  successful metaphor of <em style=\"\">&quot;Sam&#039;s Used Cars&quot;,</em> a fictional web site that  gives you a context in which to learn along. You&#039;ll take a plain and  boring HTML website and bring it to life with Bootstrap.  </p>  <p>  \t<strong style=\"\">Wondering what Bootstrap is?</strong>  </p>  <p>  \t             Bootstrap  is a framework that makes front-end web development faster and easier. A  couple of guys at Twitter invented it and later made it open source.   Other people have joined in and it is now in it&#039;s third major release.    Bootstrap 3 is good for people of all skill levels, devices of all  shapes, and projects of all sizes.  </p>", 
    "end_date": null, 
    "title": "The Joy of Bootstrap-- Build awesome web pages the easy way ", 
    "price": "20.00", 
    "instructors": "Alan Forbes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350068_39cc_2.jpg", 
    "course_url": "https://www.udemy.com/joy-of-bootstrap/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T20:57:47Z"
}