{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t                Hey!   If you&#039;ve been painting on pre-stretched canvases, stop wasting money and take this course! I will teach you everything you want and need to know about how to create a gallery quality, stretched canvas. <em style=\"\">The artwork you choose to put on it is on you</em>, but I will teach you tips, tricks and detailed how-to&#039;s on the art of building your canvas.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">You will also learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">How to select the correct canvas type for your art style</li>  \t<li style=\"\">How to prep your canvas</li>  \t<li style=\"\">All about stretcher bars; what they are and how to use them</li>  \t<li style=\"\">The tools you need, the purpose of each, and where to get them</li>  \t<li style=\"\">The art of stretching the canvas to the wood</li>  \t<li style=\"\">How to prepare the finished canvas for hanging</li>  </ul>  <p style=\"\">  \t<strong style=\"\">The Course</strong>  </p>  <p style=\"\">  \t                 I have broken the course into easily digestible sections that go into lots of detail. People taking this class will range from total beginners that are just taking up art, to experienced artists that are looking for another way of completing their finished artworks. You can choose to create your canvas alongside the videos, or take the course and then complete the project when you&#039;re ready.  </p>  <p style=\"\">  \t<strong style=\"\">Why YOU should take this class</strong>  </p>  <p style=\"\">  \t      If you&#039;re like most artists, you get incredible joy from creating things with your hands. There&#039;s nothing like the feeling you get when you have created every part of a painting; the work itself, the canvas it&#039;s on, all the way down to the wire that hangs it. By enrolling in this course, you will be able to feel that feeling in your career.  </p>  <p style=\"\">  \t<strong style=\"\">Outside Availability</strong>  </p>  <p style=\"\">  \t  If you enroll in the course, I am available for any questions via email. Questions pertaining to the actual course, or anything else art related. I think that we, as artists, can learn so much from each other. We should be sharing and giving advice and caring about seeing each other succeed.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">    As an Added Bonus  </strong>  </p>  <p style=\"\">  \t      Since marketing your work is a big part of your success and exposure as an artist, everyone that enrolls in this course will have the option of being included on my own personal website on a page titled &quot;Friends&quot;. When you finish your painting, you can send an email with an image and description, and links to your website with contact info. You can take advantage of the 1,000+ unique visitors to my site, gaining yourself more exposure. My goal of this sharing method is for you to pick up new fans or, best case scenario, to sell your painting.  </p>", 
    "end_date": null, 
    "title": "The Art of Building a Stretched Canvas from Scratch", 
    "price": "20.00", 
    "instructors": "Megan Dorien", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351014_407d_3.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-building-a-stretched-canvas-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T16:25:09Z"
}