{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description:</strong></p><p><em>The ultimate deep dive into online dating and how to get the best out of it</em> - this course aims to help you have the best experience in online dating possible, by understanding some of the common mistakes and by reviewing some good examples of dating profiles.</p><p>I’ve worked in online dating for over 8 years on some of the world’s leading dating sites and during my time, I’ve come to learn some of the elements which work for people and what doesn’t. In this course I’m going to help you develop the best possible dating profile by showing you how to:</p><ul><li>Contextualise the numbers around online dating; how many people meet through online dating in today’s world</li><li>Choose the right dating site for you</li><li>Choose the right dating profile picture</li><li>Describe yourself in the best way</li><li>Go through all the do’s, and more importantly, the don’t’s when it comes to online dating</li><li>Talk through some strategies for writing that first message</li><li>How to ensure you keep safe</li></ul><p><strong>What are the requirements?</strong><br></p><ul><li>You should have access to the internet and already be familiar with online dating as a concept. For creating mock profiles, you should have access to a online or offline notepad e.g. microsoft word. </li></ul><span></span><p><strong>What am I going to get from this course?</strong></p><ul><li>Over 19 lectures and over 70 mins of content</li><li>Confidently develop your online dating profile </li><li>Understand what the right dating site is for you</li><li>Understand how to test your dating profile to get better results</li><li>Learn tips to stay safe whilst using online dating sites</li><li>Examples of messages you can send</li></ul><p><strong>What is the target audience?</strong><br></p><ul><li>People using online dating sites currently</li><li>People who're about to embark on online dating for the first time</li></ul>", 
    "end_date": null, 
    "title": "The ultimate guide into online dating", 
    "price": "20.00", 
    "instructors": "Jason Leonard", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730410_f74b.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-deep-dive-into-online-dating/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-16T21:59:50Z"
}