{
    "selfpaced": true, 
    "topic_name": [
        "Social Science"
    ], 
    "description": "<p>  \tHave you ever wanted to understand what's so special about Plato, Homer, or Aristotle? Do you wish you were more familiar with the great writers and thinkers of the past, but don't know where to begin? What difference would it make to you if you could apply the insights and wisdom of yesterday's great thinkers and leaders to your life today?  </p>  <p>  \tThis course is designed to give you a world-class classical education.  </p>  <p>  \t Using the world-renowned <a class=\"external-link\" href=\"http://en.wikipedia.org/wiki/Harvard_Classics\" rel=\"nofollow\" target=\"_blank\">Harvard Classics</a> (first compiled in 1909) as a basis, this course is a guided tour through the greatest works of philosophy, ethics, literature, drama, history, and more.  </p>  <p>  \t In summary, this course will help you to grasp and apply some of the greatest thinking, writing, and learning that humanity has produced. If you have ever wanted the benefits of a classical education but never had the opportunity, or if you simply want to delve deeper into an area of curiosity, this course is your next step.  </p>  <p>  \t With new lectures and resources being regularly added, this is a lifetime resource for culture, learning, and enjoyment.  </p>  <p>  \t You do not need to own copies of the Harvard Classics in order to take this course; the early lectures will show you where you can get hold of copies cheaply, or for free.  </p>", 
    "end_date": null, 
    "title": "The Harvard Classics", 
    "price": "50.00", 
    "instructors": "Best Thought Ltd.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118782_9168_6.jpg", 
    "course_url": "https://www.udemy.com/classics/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-12T16:26:05Z"
}