{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>The <strong>Sound Kitchen</strong> is a sound engineering course aimed at anyone who is passionate about sound and wants to learn the <strong>how-to's of great sound</strong>. The course uses lots of music and it is both inspirational and technical; but make no mistake, you will have more than your money’s worth of technical insight and input.</p>\n\n<p>The instruction is<strong> music based. </strong>Therefore there are always audio examples (there is also a lesson that will help you develop your hearing skills with audio clips you can download). We use a <strong>Digital Audio Workstation</strong> so that you can immediately put into practice the concepts expressed in some of the lessons, ending up making music (better) rather than just hearing someone talk about it. Furthermore, if you wanted to, you will be able to use the DAW (within the licensed time period) to exercise some sound engineering routines by yourself independently from the course.</p>\n\n<p>The course is <strong>very practical</strong> and the terminology is <strong>not overly technical</strong> (again do not assume that this is a shortfall, as often seasoned engineers have learned a great deal from the course approach and teachings). </p>\n\n<p>At the end of the course <strong>you will be able</strong> to plan a sound production, choose well suited equipment, set up a PA, and with practice, mix a production / song (live or in your home studio).</p>\n\n<p>\"<strong>Ears before gear</strong>\": is a sentence I coined to embody the idea that the most important piece of equipment to achieve great sound is the engineer. Ultimately great gear will sound poorly if the engineer cannot use it well. The opposite is also true that average gear in the right hands will sound great. This mindset is thematic across the entire course.</p>\n\n<p><strong>The numbers</strong></p>\n\n<ul><li>At total of almost 14      hours of video tuition </li><li>60 video clips </li><li>9 sections</li><li>9 section-overview audio      notes</li><li>9 quizzes (to help      you review each section)</li><li>89 audio clips (to      download) used for hearing training </li><li>2 DAW program available      (PC and MAC) each with a tailor-made session</li><li>Multi-track songs      performed by top South African musicians, recorded in a high end studio in      Cape Town, South Africa</li><li>Plenty of brain-stretching      and ear developing DAW exercises </li></ul>\n\n<p>I am confident that you will learn a great deal and will enjoy doing so. I look forward to seeing you among my new students. Ciao. Tim</p>", 
    "end_date": null, 
    "title": "The Sound Kitchen - Great sound made easy", 
    "price": "50.00", 
    "instructors": "Timoteo Alicino", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668594_1b1d_3.jpg", 
    "course_url": "https://www.udemy.com/the-sound-kitchen-great-sound-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T08:22:30Z"
}