{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong><em>Looking to start using the Deep Web regularly?</em></strong>\n\n  </p>\n\n<p><strong><em>Having trouble understanding the Deep Web terminology?</em></strong>\n\n  </p>\n\n\n\n<p><strong><em>Maybe you just want to experience all the Deep Web has to offer?</em></strong>\n\n  </p>\n\n\n\n<p>Whatever your motivation to start using the Deep Web, you’ve come to the right place to get started on your Deep Web journey.\n\n  </p>\n\n\n\n<p><strong><em>The Complete Deep Web Course: Become An Active Deep Web User </em></strong>is the most focussed Deep Web course on the internet focussing on getting you started using the Deep Web safely and effectively.\n\n  </p>\n\n\n\n<p>It’s the one place with everything you need to start using the Deep Web, and more importantly, using it in a safe, effective and legal way without experiencing any issues.\n\n  </p>\n\n\n\n<p>This is an <strong><em>effective and practical course that will take you from zero experience on using the Deep Web, to becoming an active Deep Web user who understands all the terminology.</em></strong>\n\n  </p>\n\n\n\n<p>While there are plenty of theoretical Deep Web guides on the web, it’s hard to find a focussed Deep Web video course like this one, which is instructed by two experienced instructors who have extensive first hand practical and theoretical knowledge of the Deep Web.\n\n  </p>\n\n\n\n<p>Nothing is kept a secret. <strong><em>We reveal everything about how to get started with using the Deep Web safely and effectively. We will also be adding new lectures to this course at no extra cost!</em></strong>\n\n  </p>\n\n\n\n<p>This course is designed for anyone who wants to get started with using the Deep Web in a safe, and effective manner. So if you’re a complete newbie, or someone who has had a little experience with the Deep Web but no extensive use, then you’re in the right place.</p>", 
    "end_date": null, 
    "title": "The Complete Deep Web Course: Become An Active Deep Web User", 
    "price": "20.00", 
    "instructors": "Dark Web Academy, Ravinder Deol", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765018_3f20_6.jpg", 
    "course_url": "https://www.udemy.com/the-deep-web/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T02:38:41Z"
}