{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>About the course:</p>    <p><span>This course is the first and only comprehensive video tutorial guide on how to become a designer. You can learn a lot about the creative industry and the best way to start your career as a designer. It will answer questions like:</span></p>    <p><span>- Is it enough to be creative to be a designer?</span></p>  <p><span>- Is it better to be a freelancer or work full time?</span></p>  <p><span>- How much can you earn as a designer?</span></p>  <p><span>- How to find jobs in the creative industry?</span></p>  <p><span>- Which areas of design are recommend for you?</span></p>  <p><span>- How to enter and win design contests and so much more.</span></p>    <p><span>Join Martin and learn from his years of experience in the creative industry. This course provides a well structured and to-the-point guide to anyone who is planning to get into the creative industry.</span></p>    <p><br></p><p>The course includes:</p>    <p><span>- 56 instructional video tutorials</span></p>    <p><span>- Essential Skills for Designers &amp; Career Guide PDF</span></p>    <p><span>- Design Terminology PDF</span></p>    <p><span>- Useful Keyboard Shortcuts PDF</span></p>    <p><span>- Collection of Useful websites for Designers PDF.</span></p>    <p><br></p><p>How long will the course take to complete?</p>    <p><span>This course will take only 2 hours to complete. It will save you a lot of time finding out everything you need to know about becoming a designer.</span></p>    <p><br></p><p>How the course is structured?</p>    <p><span>The course is structured into 56 videos, each explaining a specific topic important for a designer. It is recommended to watch the videos in order of the outline but you can also choose to watch them individually.</span></p>    <p><br></p><p>Why take this course?</p>    <p><span>This course will help you greatly if you ever considered to become a designer. It will help you to decide whether you are cut out for this career or not and it will show you the right way to get into the creative industry.</span></p>  ", 
    "end_date": null, 
    "title": "The Ultimate Guide on How to Become a Designer", 
    "price": "20.00", 
    "instructors": "Martin Perhiniak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/69752_bc61_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-25T18:17:57Z"
}