{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t          Genealogy is such an absorbing pastime that most of us don't get organized until we’re buried in information, legends, vital statistics, phantom relatives, and all of the vast hodgepodge of documents we find.  </p>\n\n<p>  \t      In \"<strong>The Organized Genealogist,</strong>\" one of our \"Everything Olde is New Again!\" series of genealogy courses, you'll learn how to navigate through the obstacles most of us run into sooner or later. In this course, you'll unravel the maze of forms and fundamentals to help you organize your research.  </p>\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Get and keep your genealogy research under control whether you are just starting this adventure, or a seasoned </strong><strong class=\"redactor-inline-converted\">family historian.</strong>  </p>\n\n\n\n\n\n<p>  \tWhen two pieces of information disagree, you'll have a way to determine which is more likely to be correct? You'll know where you found your ancestry information and have a better idea of it's accuracy.  </p>\n\n\n\n\n\n<p>  \t                  Get organized and stay organized with:  </p>\n\n\n\n\n\n<ul>  \t<li>Family data tracking forms</li>  \t<li>Common searches to find basic genealogy evidence</li>  \t<li>What to look for on primary and secondary evidence</li>  \t<li>How to spot errors, even on official documents</li>  \t<li>What's a third cousin twice removed</li>  \t<li>Genealogy filing systems</li>  \t<li>Ancestral numbering systems</li>  \t<li>Easy citations</li>  \t<li>Copyright violations to avoid</li>  </ul>\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Spend your time researching and discovering, not retracing</strong>  </p>\n\n\n\n\n\n<p>  \t                  Avoid wracking your memory. You'll have your research all written down, and nicely organized. You'll be able to find those sites you didn't think you'll ever need again.</p>\n\n\n\n\n\n<p>  \t                  You'll have access to examples of the types of inaccuracies you might come across, even in official documents. But <em>YOU</em> won't get discouraged by these because you'll know how to manage that information. More importantly, you'll learn techniques for analyzing conflicting information, or how to uncover previously elusive information (or ancestors.)  </p>\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Content and Overview</strong>  </p>\n\n\n\n\n\n<p>  \t                  I designed this course because I learned, personally, what a mess all these documents and artifacts could become.  </p>\n\n\n\n\n\n<p>  \t                  You'll learn:</p>\n\n\n\n\n\n<ul>  \t<li>Where to find forms at no cost, including one interactive set designed in Excel</li>  \t<li>How to fill out the forms using common records.</li>  \t<li>Where to look for records</li>  \t<li>How to distinguish between primary, secondary and best evidence</li><li>What is considered proof</li>  \t<li>How to connect the dots between different pieces of evidence</li>  \t<li>How to make use of incorrect information found on official documents</li>  \t<li>What numbering systems are and how to use them</li>  \t<li>Why you don't mix your mom's family photos with your dad's</li>  \t<li>How copyright law affects your decisions to share what you find</li>  </ul>\n\n\n\n\n\n<p>  \t                  You'll, also, get a full 53-page textbook with links to every site we visit, downloads and assignments for practice and discussion.  </p>\n\n\n\n\n\n<p>  \t                  And you will learn enough to be able to determine whether or not you really are related to Kevin Bacon. Isn't everyone?  </p>\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">What my classroom students say about my genealogy courses ~</strong>  </p>\n\n\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\">Exceeded my expectations. Micki was a wonderful instructor who came to class with years of research experience which she shared with us. I found her to be very encouraging and very helpful and was generous with help even when class wasn’t in session. ~ Allenda Elam</em>  </p>\n\n\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\">Learned useful ways to approach brick walls. </em><em class=\"redactor-inline-converted\">~ William Sadler</em>  </p>\n\n\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\">Wonderful Class. I’d like to take it again. </em><em class=\"redactor-inline-converted\">~ Nancy Copple</em>  </p>\n\n\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\">The course was great. </em><em class=\"redactor-inline-converted\">~ Anonymous</em>  </p>\n\n\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\">I am very pleased with the guidance course materials and helpfulness of the instructor. </em><em class=\"redactor-inline-converted\">~ Glen Crain</em>  </p>\n\n\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\">Really appreciate your research, printed and DVD package. </em><em class=\"redactor-inline-converted\">~ Bonnie Sadler</em>  </p>", 
    "end_date": null, 
    "title": "The Organized Genealogist", 
    "price": "50.00", 
    "instructors": "Michele Boyer", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295443_7bfc_2.jpg", 
    "course_url": "https://www.udemy.com/everything-olde-is-new-again-genealogy-clan-management/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-06T20:06:07Z"
}