{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t        I created a complete Travel video course because I couldn&#039;t find any courses on this topic at the time I made this. I spent most of my past 4 years specializing in travel and video and thought was the right time to share my knowledge.  </p>  <p>  \tThe Art of Travel Video is a training video made especially for travelers who are interested in making their professional videos using SLR and action camera&#039;s  </p>  <p>  \t    Travelers have special requirements. You may want to film underwater in the great barrier reef or you may want to capture your drive along the coast of New Zealand. You might want to capture the nightlife of Hong Kong or capture a beautiful sunset at Maui.<br style=\"\">  </p>  <p>  \tI&#039;ve produced over 100 videos specializing in trave in destinations such as Kruger National Park (South Africa), Capetown, Singapore, Turks &amp; Caicos, Vancouver, Maui, Bali, Hong Kong, Taiwan and more. <br style=\"\">  \t<br style=\"\">  \t        Course contents:<br style=\"\">  \t<br style=\"\">  \t         1)  Camera gear and accessories -- which camera models, lenses, accessories, lighting, and sound<br style=\"\">  \t<br style=\"\">  \t          2) Plan and packing -- How do you pack and protect your gear and make good use of your time. How do you know what to see and stay to help with you with your travel video.<br style=\"\">  \t<br style=\"\">  \t          3)  How to film your shot -- a live in the field demo of actually setting your camera to shot a great shot<br style=\"\">  \t<br style=\"\">  \t          4)  Editing -- An actual live editing video showing you step by step how to edit in Final Cut Pro X and put together a great travel video<br style=\"\">  \t<br style=\"\">  \t          5) Sharing -- How to take your finish video and sharing it through social networks or burn a DVD or blu-ray  </p>", 
    "end_date": null, 
    "title": "The Art of Travel Video", 
    "price": "20.00", 
    "instructors": "Greg Hung", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/250990_34fd_9.jpg", 
    "course_url": "https://www.udemy.com/travelvideo/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T15:48:06Z"
}