{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><em>The Sketchnote Handbook </em>author Mike Rohde is back with even more tips and techniques for taking visual notes. In <em>The</em> <em>Sketchnote Workbook</em> video course  Mike shows students new venues for using visual notetaking to capture all kinds of ideas, experiences, and memories that they'll want to return to and share with others.</p>For those students who mastered the basic sketchnoting techniques taught in <em>The Sketchnote Handbook</em>—but who still struggle to capture hard-to-visualize terms and concepts—Mike reveals advanced techniques and strategies to keep them drawing, no matter how tough the topic.  Some of the things Mike teaches in this course are how to sketchnote travelogues, your favorite movies or TV shows, sketchnoting memorable meals, plus additional advanced tips and techniques are provided to boost your sketchnoting skills.<p>About the Author:</p><p><strong>Mike Rohde</strong> is an experienced interface designer who has created usable and compelling applications for mobile, web, and dedicated devices. His clients include Northwestern Mutual, GE Health Care, Bio-Rad Laboratories, We Energies, Epocrates, and Qvidian. Rohde turned to experience design after 20 years as a successful print and web designer where he first developed his sketchnote approach and technique. He has also taught sketchnoting workshops at conferences and for private companies. Rohde is the author of <em>The Sketchnote Handbook: the illustrated guide to visual notetaking</em>.</p>", 
    "end_date": null, 
    "title": "The Sketchnote Workbook", 
    "price": "30.00", 
    "instructors": "Pearson, Author, Designer & Illustrator Mike Rohde", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560852_8d40_2.jpg", 
    "course_url": "https://www.udemy.com/the-sketchnote-workbook/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T19:55:21Z"
}