{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>\"This course was a quick study of how and why to work with Udemy as a new course provider. The information provided was clear, concise, and , very helpful.\" ~ Stephen H.<br></p>\n\n<p>Are you an instructor, teacher, or trainer, or someone who has extensive knowledge or expertise on a specific subject? Have you thought about teaching a course on Udemy, but are not yet convinced it is something you could do? </p>\n\n<p>Welcome to “The Top 10 Reasons To Teach on Udemy.” </p>\n\n\n\n<p>I am Lilia Fallgatter, your Instructor. I have a law degree, I’m a publisher, I have a passion for education and have extensive experience in online learning as a higher education administrator and instructor. I’m the Author of two books: The Most Important Letter You Will Ever Write, and The 5 Decisions That Can Transform Your Life Forever, and I teach three other Udemy courses, all of which are excellent partner courses to this one. Over the course of my career, I have developed content for numerous courses and training programs, as well as content for my books. </p>\n\n\n\n<p>This course covers the benefits of teaching online courses on Udemy, and specifically focuses on the 10 reasons I decided to teach on Udemy. In addition to outlining the reasons to teach on Udemy, there is a section on how to get started.</p>\n\n\n\n<p>Here’s what you will discover: </p>\n\n\n\n<p>- How you can touch the lives of others by sharing your knowledge </p>\n\n\n\n<p>- Why Udemy is an ideal platform for teaching online courses</p>\n\n\n\n<p>- How Udemy can help build credibility and branding </p>\n\n\n\n<p>- How teaching on Udemy can lead to a passive income stream</p>\n\n\n\n<p>- The process for getting started as a Udemy Instructor</p>\n\n\n\n<p>Ready to start? Click the “Take This Course” link to the right of your screen and I’ll “See you” online!</p>", 
    "end_date": null, 
    "title": "The Top 10 Reasons To Teach On Udemy", 
    "price": "20.00", 
    "instructors": "Lilia Fallgatter, JD", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729720_3bfb_4.jpg", 
    "course_url": "https://www.udemy.com/the-top-10-reasons-to-teach-on-udemy/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-16T03:34:46Z"
}