{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t  In this course you will be taken through all of the steps required to theme, customize and brand your FirstClass Web Services module.  </p>  <p style=\"\">  \t<strong style=\"\">Give your FirstClass installation an identity.</strong>  </p>  <ul style=\"\">  \t<li><span>Create a color palette</span></li>  \t<li><span>Modify Images</span></li>  \t<li><span>Add custom images to backgrounds</span></li>  \t<li><span>Modify CSS Colors</span></li>  \t<li><span>Create custom icons</span></li>  \t<li><span>Manage upgrades</span></li>  </ul>  <p style=\"\">  \t<strong style=\"\">Branding is Important</strong>  </p>  <p style=\"\">  \t  A strong brand begins with a thoughtfully executed and implemented visual identity.  </p>  <p>  \tThe components of visual identity (logo, colour palette, typefaces and graphic elements) are the basic visual building blocks of a brand. Each element helps identify <span>and differentiate an organization. When applied consistently, a well-executed identity will do more than identify, it will become synonymous with the values, mission and voice of the organization.</span>  </p>  <p>  \tOf course, brands are not made overnight. The relationship an organization’s identity creates with the audience is the result of thoughtful and consistent application.  </p>  <p>  \tConsistency establishes familiarity – providing the audience with a comfortable reference point for hearing the organization’s message.  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t<br style=\"\">  </p>  <p>  \tIf you are a FirstClass Administrator or Graphics Designer or Web Administrator for your organization then this is a course for you.  </p>  <p style=\"\">  \t  In this course you will build a theme for a fictional company and along the way learn the skills required to build a color palette, modify images and customize CSS to change the default FirstClass Theme into one that will better identify the Web Services install with our company.  </p>  <p style=\"\">  \t  There are 29 video lectures, each with accompanying resources or links to provide you with everything you need to customize your own site.  You will start by learning how to configure a local copy of web services then jump right in by creating a color palette and base theme using jQuery Theme-Roller.  You will use GIMP to customize graphics to match your theme and learn how to modify and test CSS colors using Chrome&#039;s developer tools.  </p>  <p style=\"\">  \tStudents completing this course will be ready to customize and give their own instances of FirstClass Web Services an identity.  </p>", 
    "end_date": null, 
    "title": "Theming FirstClass Web Services 12.1", 
    "price": "50.00", 
    "instructors": "Stewart Lynch", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402752_ef05_10.jpg", 
    "course_url": "https://www.udemy.com/theming-firstclass-web-services/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T06:40:58Z"
}