{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong style=\"\">Descripción del curso</strong></p><p>Durante años, los planificadores de proyectos lineales como carreteras, tuberías o líneas de transmisión, han tenido que apoyarse en herramientas que no están diseñadas para planificar y controlar proyectos, como: Excel, Autocad o incluso softwares de planificación CPM tradicionales sin muy buenos resultados.</p><p>Hoy en día existe TILOS (<strong style=\"\">TI</strong>me <strong style=\"\">LO</strong>cation <strong style=\"\">S</strong>ystem) una aplicación exclusiva para planificar y controlar proyectos lineales de infraestructura. Es un software con base en diagramas espacio-tiempo, también conocidos como método de programación lineal, cadenas de tiempo, carta de marcha o diagrama tiempo-camino, según sea el país donde nos encontremos. </p><p>TILOS es el software más reconocido en el mundo para planificar este tipo de proyectos, por lo que al aprenderlo usted obtendrá una especialización que será reconocida por las empresas que lo utilicen como herramienta estándar en sus proyectos.</p><p>Con más de 10 años de experiencia como instructor en el área de control de proyectos y 19 como profesional en dicho rubro; puedo asegurar que al terminar el curso, usted será capaz de desenvolverse eficaz y eficientemente con esta herramienta.</p><p><strong style=\"\">¿Que recibirá?</strong></p> <ul style=\"\"><li>Videos en calidad HD de acceso 24/7</li> <li>Selección de temas y enseñanza páctica y didáctica, por parte de alguien que utiliza a diario el software en proyectos reales y no es sólo teórico.</li> <li>Seguimiento de un proyecto en su totalidad y no tópicos aislados.</li> <li>Soporte post entrenamiento via e-mail para clarificación de dudas.</li></ul> <p><strong style=\"\">¿A quién está dirigido?</strong></p> <ul style=\"\"><li>Ingenieros </li> <li>Planificadores </li> <li>Programadores</li> <li>Controladores de proyecto</li> <li>Estimadores</li><li>Interesados en aprender más acerca de la planificación en diagramas espacio-tiempo.</li></ul>", 
    "end_date": null, 
    "title": "TILOS Programación Lineal de Proyectos", 
    "price": "50.00", 
    "instructors": "PSP, EVP Felix Soto", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505346_8b2a_2.jpg", 
    "course_url": "https://www.udemy.com/tilos-programacion-lineal-de-proyectos/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T17:20:42Z"
}