{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Brian\nbegan his massage therapy practice and teaching his method of massage\ntherapy in 1987. Through his desire to see clients set free from\ntheir pain, Brian developed his “Cross Fibre Release” method of\nmassage therapy along with treatment that get results.<br></p><p><strong>Trained\nTherapist’s Treatment Course Two</strong>\nteaches treatment methods for: releasing the muscles of the back to\nimprove the result of any therapy for sprained wrist and tennis\nelbow; how to get amazing and quick results for the treatment of\ntennis elbow and wrist problems; same with sprained ankles; how to\nbest apply the “cross fibre release” method; along with how to\nlocate and treat an injury most therapists are not aware of, as well\nas reinforcing the importance of the contraindications.</p><p>This\ntreatment course is presented clearly, just like receiving training\nfrom Brian first hand.  <strong>This\ntreatment course is only suitable for: Massage Therapists; Sports\nTherapists; Myotherapists; Physiotherapists and those trained in\nTherapy. </strong>\n</p><p>On\ncompletion of this trained therapist’s treatment course, you as a\ntherapist will have more therapy treatments for your tool box and the\nconfidence and the skills needed to treat the injuries taught in this\nremedial therapy course. The therapist will also begin to enjoy the\nsuccess that Brian and his past students have over many years using\nthese proven treatment methods. Guaranteed!  \n</p><p><br></p>", 
    "end_date": null, 
    "title": "Trained Therapists Treatment Course Two by Brian Cavill", 
    "price": "50.00", 
    "instructors": "Brian Cavill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799572_975f_2.jpg", 
    "course_url": "https://www.udemy.com/trained-therapists-treatment-course-two-by-brian-cavill/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T10:15:45Z"
}