{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Brian began his massage therapy practice and teaching his method of massage therapy in 1987. Through his desire to see clients set free from their pain, Brian developed his “Cross Fibre Release” method of massage therapy along with treatment that get results.</p>\n\n<p><strong>Trained Therapist’s Treatment Course Three</strong><br>teaches treatment methods for: shin splints; anterior compartment syndrome; Achilles tendinitis, including how to asses and treat a muscle that is missed by many therapists; quadriceps injuries,strains &amp; tears; how to relieve muscular and tendon related knee pain; a proven method that improves the healing time for muscular<br>tears; relief for headaches, as well as reinforcing the importance of the contraindications.</p>\n\n\n\n<p>This treatment course is presented clearly, just like receiving training from Brian first hand. </p>\n\n<p><strong>This </strong><strong>treatment course is only suitable for: Massage Therapists; Sports Therapists; Myotherapists; Physiotherapists and those trained in </strong><strong>Therapy.</strong></p>\n\n\n\n<p>On completion of this trained therapist’s treatment course, you as a therapist will have more therapy treatments for your tool box and the confidence and the skills needed to treat the injuries taught in this remedial therapy course. The therapist will also begin to enjoy the success that Brian and his past students have over many years using<br>these proven treatment methods. Guaranteed!  </p>", 
    "end_date": null, 
    "title": "Trained Therapists Treatment Course Three by Brian Cavill", 
    "price": "50.00", 
    "instructors": "Brian Cavill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806040_4015.jpg", 
    "course_url": "https://www.udemy.com/trained-therapists-treatment-course-three-by-brian-cavill/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T11:20:58Z"
}