{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Brian began his massage therapy practice and teaching his method of massage therapy in 1987. Through his desire to see clients set free from their pain, Brian developed his “Cross Fibre Release” method of massage therapy along with treatment that get results</p>\n\n<p>Trained Therapist’s Treatment Course Five is for Advanced Therapists ONLY!</p>\n\n<p>The treatments taught in this course will take some cautious practice to perfect, but for the advanced therapist with sensitive touch and a desire to help clients in pain they will learn proven methods for: some of the difficult lower back problems, including</p>\n\n<p>disc, coccyx, lumber, sacrum and sciatic pain; They will also learn how to treat neck pain including whiplash. The lessons on “the conversation of pain” and successful advertising and promotion, should prove valuable for most.</p>\n\n<p>This treatment course is presented clearly, just like receiving training from Brian first hand. This treatment course is only suitable for: Experienced Massage Therapists; Sports Therapists; Myotherapists; Physiotherapists and those trained and experienced in Therapy.</p>\n\n<p>On completion of this advanced trained therapist’s treatment course, you as a therapist will have more confidence and the skills needed to treat the injuries covered and enjoy the success that Brian and his past students have over many years using these proven treatment methods. Guaranteed!</p>", 
    "end_date": null, 
    "title": "Treatment Course Five for Advanced Remedial Therapists", 
    "price": "50.00", 
    "instructors": "Brian Cavill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858328_d6d6.jpg", 
    "course_url": "https://www.udemy.com/trained-therapists-treatment-course-five-by-brian-cavill/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T07:14:49Z"
}