{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Computers and the systems they run are known to break.  People who use computers are known to open support tickets for problems they are encountering.  At some point someone has to fix broken computers...but first it is important to know if something truly is broken.</span>  </p>  <p style=\"\">  \t      Troubleshooting begins when the problem is reported, and contrary to popular belief, the first step is not to jump in and fix something.  The skill of troubleshooting is not taught in schools, mainly because of two different reasons: 1) it&#039;s not the easiest to teach (but it is easy to learn), and 2) troubleshooting is an art more than it is a science.  </p>  <p style=\"\">  \t              Have you ever wanted to...  </p>  <ul style=\"\">  \t<li style=\"\">Land a job in the IT field, being an excellent troubleshooter is a valuable skill that sets you apart</li>  \t<li style=\"\">Become better at troubleshooting so that it doesn&#039;t take you nearly as long to figure something out and implement a fix</li>  \t<li style=\"\">Not get frustrated with computer problems or clients</li>  \t<li style=\"\">Fix your own computer without hiring some expensive person or company to do it for you</li>  </ul>  <p style=\"\">  \t        ...then you need this course now.  </p>  <p style=\"\">  \t                We&#039;ll cover:  </p>  <ul style=\"\">  \t<li style=\"\">The mindset behind troubleshooting that I always keep as my focus, which helps to uncover <strong style=\"\">the right questions to ask</strong> that lead to the solution</li>  \t<li style=\"\">Why you should never blindly trust your client&#039;s statement</li>  \t<li style=\"\">Why you should take more time up front to understand the problem, and <strong style=\"\">exactly how to do that</strong></li>  \t<li style=\"\">How to use the acronym <strong style=\"\">S.O.A.P. to powerfully uncover data</strong> and lead to a fix</li>  \t<li style=\"\">Keys to gathering data <em style=\"\"><strong style=\"\">that many IT professionals overlook</strong></em></li>  \t<li style=\"\">How exactly to leverage data gathered from questions to <strong style=\"\">lead you to a solution</strong></li>  \t<li style=\"\"><strong style=\"\">14 key questions</strong> I ask almost every time <strong style=\"\">+ 6 more</strong> on reproducing the problem</li>  \t<li style=\"\">What binary tree thinking is, and how to use it to <strong style=\"\">go down the right path to a solution</strong></li>  \t<li style=\"\">How to craft a hypothesis and why doing so is critical</li>  \t<li style=\"\">2 ways to go about implementing fixes and key considerations for each</li>  \t<li style=\"\"><strong style=\"\">2 key points for testing</strong> that absolutely make a difference</li>  \t<li style=\"\"><strong style=\"\">Rules you must follow</strong> when making changes to a broken system...that is, if you don&#039;t want to make more work for yourself</li>  \t<li style=\"\"><strong style=\"\">3 real-life examples</strong> where I go through the process, demonstrating how it works</li>  \t<li style=\"\"><strong style=\"\">3 more examples YOU can troubleshoot</strong> by messaging me - examples that I literally had to troubleshoot, and as such I have solutions for them you can uncover</li>  </ul>  <p style=\"\">  \t                                                      And I&#039;m here for you.  Just post in the discussion area, and I&#039;ll help you out.  If it turns out the class will benefit from additional lessons on topics, I&#039;ll add them in as well, free of charge for existing students.  </p>  <p style=\"\">  \t                                                    This course is free of fluff.  I packed only the things you need to know in it because I want you to be able to go through it as quickly as possible so that you can <strong style=\"\">start troubleshooting right away</strong>.  </p>  <p style=\"\">  \t                                                      How much time and money are you missing out on by not knowing <strong style=\"\"><em style=\"\">how to effectively troubleshoot time and time again?</em></strong>  Isn&#039;t it time you change that today?  </p>  <p style=\"\">  \t                                                  Here&#039;s what you get when you join this course today...  </p>  <ul style=\"\">  \t<li style=\"\">Access to our existing lectures</li>  \t<li style=\"\">Free access to our new lectures</li>  \t<li style=\"\">Ability to get your questions answered in our discussion section or one-on-one via private message</li>  \t<li style=\"\">The secrets that set you apart from other IT folks</li>  \t<li style=\"\">An unconditional 30-day money-back guarantee - <strong style=\"\">if you don&#039;t become a better troubleshooter, I&#039;ll buy back this course no questions asked!</strong></li>  </ul>  <p style=\"\">  \t<strong style=\"\">                  Click the &quot;Take This Course&quot; button right now, and join us today.  You&#039;ll be glad you did!  </strong>  </p>  <p style=\"\">  \t                                        P.S.  The course is presented with animated &quot;hand-drawn&quot; images with a voice-over.  Please feel free to check out the preview lessons to find out what I mean.  Pay close attention when going through the course, as <strong style=\"\">there is  no fluff.  </strong>  </p>  <p style=\"\">  \t                                        P.P.S.  If you are already a master of troubleshooting and are who people go to when their computer systems aren&#039;t working, you don&#039;t need this course.  If, however, you want to learn and realize how <strong style=\"\">I will help you with your particular situation</strong>, <em style=\"\"><strong style=\"\">join the course</strong></em>.  Let me know of anything I can do to keep this course the best one on this topic.  Post a positive review if you have something nice to say.  If you happen to come across a negative one, keep in mind <strong style=\"\">other people might not want you to learn this material due to its powerful nature</strong>.  This course, including the slides, is my original work, and no one has taught it before; I am sharing how I do what I do.  I would suggest you try it out for yourself with our unconditional 30-day money back guarantee.  Post in the discussion section or send me a private message, and I&#039;ll help you.  </p>", 
    "end_date": null, 
    "title": "Troubleshooting: The Most-Needed Skill Not Taught in Schools", 
    "price": "20.00", 
    "instructors": "Tom Tenaglia", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338164_68e7.jpg", 
    "course_url": "https://www.udemy.com/troubleshooting/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T03:31:56Z"
}