{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t            Think about a country that has been inhabited since the paleolithic age and the huge cultural heritage this situation brings to it! Turkey is one of those countries with a rich background and its language, Turkish, is one of the languages one should definitely learn to understand the culture and history of this area better. And because Turkey has been blooming in terms of economy, education and business, learning Turkish will open many doors for you! This course, <strong style=\"\">Turkish for Beginners, </strong>consists of 19 lectures and 3 quizzes, starting from the very first step in Turkish.  </p>  <p style=\"\">  \t            I&#039;ve been teaching Turkish as a Fulbright Foreign Language Teaching Assistant at University of Texas at Austin to many students from different backgrounds. There have been Americans, Norwegians, Greeks and Spanish people. So it means that irrespective of your native language, you can easily succeed in Turkish! And it also means that I have experience in teaching my own language to others.  </p>  <p style=\"\">  \t            I use explicit grammar explanation in my lectures. The first reason for this is that this course is designed to teach you Turkish in an academic way. You can learn daily phrases in Turkish anywhere, you can easily find them by google&#039;ing. However, I try to make you understand the basics of the Turkish grammar so that you can build on it on your own. Second reason for explicit explanation is that I believe learning a language is like solving a puzzle. Rather than memorizing chunks and word phrases that you take for granted but do not question (and easily forget, as a result), learning the logic of that language helps you perform the functions of every skill: Reading, listening, speaking and writing. I know English and Italian and I&#039;ve taken German and French and I will learn Spanish in 2 months. So this fact can also count as the third reason, I know some languages and I&#039;ve followed the same way I teach: explanations. If you have a curious mind, you will love this course!  </p>  <p style=\"\">  \t            I use PowerPoint slides with my own narration and English translations.  </p>  <p style=\"\">  \t            You should be able to finish this course in 15 days, but it will take time for all the materials to be automatically produced, so give yourself an additional 15 days to review. Throughout the whole course, you are more than welcome to contact me. Good luck!  </p>  <p style=\"\">  \t            Görüşürüz!  </p>", 
    "end_date": null, 
    "title": "Turkish for Beginners", 
    "price": "20.00", 
    "instructors": "Nihan Yilmaz", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340076_290e_4.jpg", 
    "course_url": "https://www.udemy.com/turkish-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T20:40:03Z"
}