{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Après avoir suivi ce cours, vous aurez un ordinateur tout-en-un pour moins de 100 euros !<br>Cette formation est un premier pas dans l’univers fantastique du Raspberry Pi. Sans aucune connaissance préalable, vous allez assembler un ordinateur personnel complet avec lequel vous pourrez :</p>\n\n<ul><li>Accéder à Internet</li><li>Installer de très nombreux programmes gratuits</li><li>Visionner vos films</li><li>Partager des fichiers et des dossiers avec les autres ordinateurs de votre réseau local</li><li>Créer des documents compatibles avec la suite Microsoft Office</li></ul>\n\n<p>Et tout ce que vous faites habituellement avec votre PC ou votre Mac. Notez cependant que le Raspberry Pi fonctionnera sous Raspbian, une version du système d’exploitation Linux Debian adaptée au Raspberry Pi.<br>Vous vous demandez peut-être si vos connaissances en informatique sont suffisantes pour mener à bien ce projet. Je vous garantis que oui, quel que soit votre passé en informatique. Il vous suffira de suivre à la lettre les manipulations que vous lirez dans cet eBook pour obtenir le même résultat.<br>En supposant que vous ayez déjà un écran, un clavier et une souris (éventuellement récupérés sur un autre ordinateur que vous n'utilisez plus), cette formation va vous montrer comment assembler vous-même un nano-ordinateur construit autour d’un Raspberry Pi 2 modèle B et de quelques accessoires qui rendront votre nano-ordinateur facilement transportable. Vous ne débourserez pas plus de 100 euros pour arriver au montage final.</p>", 
    "end_date": null, 
    "title": "Un ordinateur à moins de 100€", 
    "price": "30.00", 
    "instructors": "Michel Martin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/800702_97e0_2.jpg", 
    "course_url": "https://www.udemy.com/un-ordinateur-a-moins-de-100/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T08:20:49Z"
}