{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Comprender las estrategias didácticas necesarias para utilizar el libro <em>Una lectura crítica y reflexiva</em> con la finalidad de desarrollar el pensamiento crítico-creativo que le permita al alumno ser un lector audaz y efectivo en la vida práctica.</p><p>Este curso consta de 10 sesiones que deben ser leídas y revisadas por cada participante para identificar y comprender cada una de los apartados que consta el libro para el alumno: 1) Transforma tu lectura, 2) Construye tus ideas, 3) Construye tus palabras, 4) Literatura en el tiempo, 5) Construye tu pensamiento crítico, 6) Deconstruye tu lectura y 7) Un acercamiento crítico. Todos en conjunto permitirán desarrollar habilidades lectoras en los alumnos.</p><p>Uno de los temas de mayor importancia es la redacción de ensayos. En este curso se marcan las pautas para evaluar un ensayo bajo los lineamientos de una rúbrica, para estandarizar el conocimiento y generar en el alumno un aprendizaje y desarrollo de su pensamiento crítico, que lo lleve a emitir juicios de valor, además de perfeccionar su estilo y redacción.</p><p>Esta propuesta educativa permitirá al joven relacionarse con la lectura de una forma diferente, siendo un lector más activo y reflexivo, le permitirá involucrarse y darse la oportunidad de expresar lo que siente y piensa de lo que lee, en otras palabras, hacer suyo el texto. todo lo anterior redundará en un claro desarrollo de la competencia lectora y por ende, leer la vida desde un punto de vista más crítico aportándole beneficios personales que reflejará en su entorno social.</p><p>Las autoras</p>\r\n", 
    "end_date": null, 
    "title": "Una lectura crítica y reflexiva", 
    "price": "20.00", 
    "instructors": "Alejandra  Salinas Muraira, Instructura Martha Cristina Favela Ávila, Instructora Emilia Fernanda Leal Uhlig", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48571_74b8_4.jpg", 
    "course_url": "https://www.udemy.com/una-lectura-critica-y-reflexiva/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-04T20:13:32Z"
}