{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">What sets an average game apart for a truly amazing visual experience? How can you take your scene from “Oh, thats cool” to “ Wow, that&#039;s AWESOME!”. There are many facets that go into making a game look amazing, but when all&#039;s said and done the final polish for most any game comes down to lighting.</p><p style=\"\">If you&#039;re an army of one powering through your own game or a small studio of talented,driven individual, this course will get you up and running with the latest and greatest that Unity 5 has to offer for lighting your projects. </p><p style=\"\">In this example based course you&#039;ll be introduced to the basic Unity lights and get to know their properties. You&#039;ll learn how to control Unity shadow properties and fix common shadow related problems in your scenes. With this solid foundation under your belt you&#039;ll be ready to tackle more advanced topic like skybox lighting, Realtime Global Illumination, light map baking, and the all new light probe system.</p><p style=\"\">At the end of this course you will have mastered all the latest unity lighting features needed to bring a new level or realism to your projects. You&#039;ll be able to up the quality of your portfolio work and set yourself apart when it comes to landing that next job.</p><p style=\"\">   If you&#039;re serious about using Unity as a platform for your creative ideas, then don&#039;t pass up this chance to set your work apart with this course on Unity 5 Lighting Fundamentals.</p>", 
    "end_date": null, 
    "title": "Unity 5 Lighting Fundamentals", 
    "price": "20.00", 
    "instructors": "Jesse Ryan McAdam", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519476_894c_2.jpg", 
    "course_url": "https://www.udemy.com/unity-5-lighting-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T19:43:33Z"
}