{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Urban Innovation: Sustainability and Technology Solutions</strong></p>\n\n<p><strong>Course 2: Urban Social Equity</strong></p>\n\n\n\n\n\n\n\n<p>This course is a second introduction to various innovators and initiatives at the bleeding edge of urban sustainability and connected technology. It is a look at the challenges and practical responses related to urban sustainability through the theme of urban social equity. For those interested, a separate course in this series <strong></strong>focuses on real world examples within two other key urban innovation themes: smart cities and transportation.</p>\n\n\n\n\n\n\n\n<p>Course material is based on case studies, seminars, and conference sessions from the Meeting of the Minds international network and annual summit. Lectures are presented by topic experts; presentation slides and other helpful resources are included where applicable. </p>\n\n\n\n\n\n\n\n\n\n<p>Optional multiple choice quiz questions follow the lectures for those students wishing to test their new knowledge or obtain a course completion certificate. No commitment is required to do the entire course. Students can proceed at their own pace and may view as many - or as few - of the lectures as they choose. </p>\n\n\n\n\n\n\n\n\n\n<p>\"Urban Innovation: Sustainability and Technology Solutions – Part 2\" was created by Christina Olsen for Meeting of the Minds.</p><p><br></p>", 
    "end_date": null, 
    "title": "Urban Innovation: Sustainability and Technology Solutions 2", 
    "price": 0, 
    "instructors": "Meeting of the Minds", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753950_04b8_2.jpg", 
    "course_url": "https://www.udemy.com/urban-innovation-2/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T00:35:26Z"
}