{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course is an introduction to various innovators and initiatives at the bleeding edge of urban sustainability and connected technology. It focuses on real world examples within two key themes - smart cities and transportation - as a way to look at the challenges and practical responses related to urban sustainability.</p><p>Course material is based on case studies, seminars, and conference sessions from the Meeting of the Minds international network and annual summit. Lectures are presented by topic experts and presentation slides and other helpful resources are included where applicable. </p><p> Optional multiple choice quiz questions follow the lectures for those students wishing to test their new knowledge or obtain a course completion certificate. No commitment is required to do the entire course. Students can proceed at their own pace and may view as many - or as few - of the lectures as they choose. </p><p>This course was developed with support from Cubic Transportation Systems, a leading integrator of payment and information solutions and related services for intelligent travel applications. Cubic delivers integrated systems for transportation and traffic management, delivering tools for travelers to choose the smartest and easiest way to travel and pay for their journeys, and enabling transportation authorities and agencies to manage demand across the entire transportation network – all in real-time.</p><p>\"Urban Innovation: Sustainability and Technology Solutions\" was created by Christina Olsen for Meeting of the Minds.<br></p>", 
    "end_date": null, 
    "title": "Urban Innovation: Sustainability and Technology Solutions", 
    "price": 0, 
    "instructors": "Meeting of the Minds", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493042_df3d_9.jpg", 
    "course_url": "https://www.udemy.com/urban-innovation/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T06:10:15Z"
}