{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Most companies do not provide business analysts with tools specifically designed to do business analysis work. Most business analyst are left to manage requirements with via Microsoft Word, Excel, and Powerpoint.  Unfortunately, these tools do not address some of the most basic needs of business analysis deliverables...</p><ul style=\"\"><li style=\"\">Requirements Analysis</li><li style=\"\">Requirements Traceability</li><li style=\"\">Requirements Collaboration</li></ul><p>While SharePoint is not a tool designed specifically for business analysis or requirements, its rich set of out-of-the-box features, can be used it to take your business analysis deliverables up a few levels in quality and effectiveness.</p><p><strong style=\"\">Lists</strong> - Allow you create S.M.A.R.T. Requirements that can be manipulated, analyzed, and organized to suit all of your stakeholder needs</p><p><strong style=\"\">Lookups</strong> - Create easy requirements traceability views that allow to ensure that your requirements are valid</p><p><strong style=\"\">Views</strong> - Allow you to create stakeholder specific views to ensure the right people see exactly what they need to see, how they need to see it.</p><p>This course is intended to teach you how to use Sharepoint to author, manage, and communicate your requirements more efficiently and more effectively<br style=\"\"></p><p>Note: This tutorial uses SharePoint 2010, however the features used are available in older and newer versions of Sharepoint. The buttons just might be in different places.</p>", 
    "end_date": null, 
    "title": "Use Sharepoint as a Requirements Management Tool - No Coding", 
    "price": "20.00", 
    "instructors": "Angelo Kalevela", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450196_f173_4.jpg", 
    "course_url": "https://www.udemy.com/business-analysts-managing-requirements-in-sharepoint/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T11:13:13Z"
}