{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\">If you&#039;ve ever had a hunch that something was not quite right even when all the facts suggested otherwise …</em></p><p><em style=\"\">If you&#039;ve ever followed a gut feeling in a business decision when no data was available – only to later learn that it was the best choice at that time … </em></p><p><em style=\"\">If you&#039;ve ever seen, heard or felt an inexplicable sign that turned out to be a “red flag&quot; that something was wrong or a “green light&quot; that you&#039;ve got the all clear…</em></p><p>Then, whether you realize it or not, you&#039;ve already begun tapping into your intuition. And for most of us, we use it more than we realize. However, unlike the common misconception that “you have it or you don&#039;t,&quot; intuition can be developed and trained – just like a muscle. By consciously acknowledging it, and discovering how and when you use it, you can utilize this powerful tool and apply it to all aspects of your life – in particular, in your business and career. </p><p>“Understanding Intuition&quot; is suitable for someone exploring the use of intuition for the first time, as well as those who are already familiar with the intuitive process and want to develop their skills further. In this course, we will provide exercises that walk you through step-by-step on how to draw upon your intuition more quickly and effectively, while also providing scientific evidence that supports why and how it works. </p><p>The course is divided into three parts: defining and recognizing how you are uniquely intuitive, discovering how to make sense of the information you receive, and learning how to apply it to the business world in everyday scenarios. Between the lectures and supplemental materials, this course will take an estimated three to four hours to complete.</p><p>Welcome. On behalf of Spark Exchange Advisory, we&#039;re happy you&#039;re here. </p>", 
    "end_date": null, 
    "title": "Using Intuition in Business", 
    "price": "20.00", 
    "instructors": "Spark Exchange Advisory, Cynthia Readnower, Danielle Palli, Julie Chavanu", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538186_e7aa_4.jpg", 
    "course_url": "https://www.udemy.com/using-intuition-in-business/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T19:20:03Z"
}