{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><em>For years I've been hearing everyone talking about Enterprise GIS, but I haven't seen anyone do it.  After this course, I can now say that \"I've created a multi-user enterprise GIS on my own!\" - </em>John from California<em>.</em></p>\n\n<p>Do you want to learn how to build an Enterprise GIS from scratch using Free and Open Source Software for GIS (FOSS4g)?</p>\n\n<p>In response to the high cost and complexities of implementing an Enterprise GIS, I created this easy-to-follow, hands-on training course <strong>allowing students to actually build a multi-user enterprise GIS from scratch using Postgres, PostGIS (free) and Quantum GIS (free)</strong>.   As an added bonus, this training will show how you can add other GIS products (i.e. commercial GIS software) into the enterprise stack as GIS clients.</p>\n\n<p>In this course you will create an Enterprise GIS that includes vector and raster data for a mid-sized municipality.  You will learn how to add users, each with different permissions for accessing and editing data, and also how to use PostGRES to control all aspects of database access, presentation, and editing.  You'll even perform simultaneous multi-user editing on the same GIS layer, and learn how a true Enterprise GIS can manage many users at once.  </p>\n\n<p>As a bonus, you will see how you can access all the GIS tools from outside of the software by using python to create a table-top GIS application that you might find at a kiosk.  And finally, I will show you an example of how the same data in the enterprise can be simultaneously displayed on the Internet using FOSS4g software.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Using Open Source Tools to Create an Enterprise GIS", 
    "price": "35.00", 
    "instructors": "Dr. Arthur Lembo", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649690_ce69_4.jpg", 
    "course_url": "https://www.udemy.com/enterprise-gis/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T16:38:49Z"
}