{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Using Entrepreneurship to Prepare for Retirement – Course Summary</strong></p>  <p>This course has been prepared with a view to raising the awareness of the costs required to live comfortably during a person’s retirement years and suggests that some of the required funding needed to enable a comfortable retirement could come from some form of entrepreneurial effort made by the individual.  The course goes further to outline opportunities that could be available to the student with respect to starting an at-home business, showing methods by which extra income can be made.</p>  <p>This course targets anyone of working age (SENIORS TOO!) who does not already have an activated strategy in place to provide for his or her own comfort in retirement.  Actually, taking this course may be the catalyst for many to not only prepare for retirement financially, but it could be the kick start to a great new life direction offering a lifestyle only dreamed of by the student prior to course commencement.</p>  <p>The course content includes:</p><ul><li>Lectures on entrepreneurship and the way entrepreneurs think, different from the way employees think…</li><li>Information relating to the costs of being retired in both Canada and the USA</li><li>A vision for what your retirement could look like if you were financially secure</li><li>Options for and discussions of different kinds of businesses that could be undertaken from within one’s own home</li><li>A lecture on the pros and cons of operating as both a sole proprietorship and as an incorporated business and the timing for when a person should consider incorporating</li><li>Lectures on opportunities to initiate independent consulting activities</li><li>A check list of solid online money making ideas that could generate significant online incomes.</li></ul><p>This course should take the student approximately two hours to complete and could well be two of the most fruitful hours ever spent by the student.</p>", 
    "end_date": null, 
    "title": "Using Entrepreneurship to Prepare for Retirement", 
    "price": "20.00", 
    "instructors": "Dan Grijzenhout", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708136_d4bd_2.jpg", 
    "course_url": "https://www.udemy.com/using-entrepreneurship-to-prepare-for-retirement/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T02:24:07Z"
}