{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          Using the Internet securely is simply put an awesome and fast way to understand threats and how to protect yourself against cyber crime.  </p>  <p>  \t<strong style=\"\">   Students who take this course will learn:</strong>  </p>  <ol style=\"\">  \t<li>Understand what threats we face when surfing and using the Internet</li>  \t<li>Understanding Web Reputation and how it is created</li>  \t<li>What a proxy is, and how to use it</li>  \t<li> What a VPN&#039;s are and how to use them</li>  \t<li>What TOR is and how to use it</li>  \t<li> How to browse and surf the net more securely by being careful of where and what we do</li>  \t<li> How to use a Sandbox VM to protect you, your family and your privacy against peeping toms. </li>  </ol>  <p>  \t<strong style=\"\">    This course includes everything you need to make the right decisions on safely surfing the internet while avoiding malware, viruses and other unwanted software from installing easily into your main system.</strong>  </p>  <p>  \t  It also uses recommended mechanisms to protect your information and private data from spying eyes. Lastly using Sandbox VMs help to protect your host or main computer against spyware and hidden spying technology from being installed. If you want to be more secure, this course is for you. <strong style=\"\">The course is meant for beginners as well as seasoned security people who want to make sure they have the correct measures in place.  </strong>  </p>", 
    "end_date": null, 
    "title": "Using the Internet Securely", 
    "price": "20.00", 
    "instructors": "Michael Goedeker", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390234_153e_2.jpg", 
    "course_url": "https://www.udemy.com/using-the-internet-securely/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T09:21:46Z"
}