{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p><strong><em>*** ONLINE COURSE UPDATED FOR NEW STUDY DESIGN 2016 - 2020 ***</em></strong></p>\n\n<p>  \t <strong>Ever wished you could have a private tutor for English Language <em>WITHOUT </em>the hefty price tag? Well, today you can! </strong>  </p>\n\n<p>  \t <strong>My name is Dmitri and I am a current VCE English Language student. Having finished in 2012 and having attained a score of 45 in the subject, I believe that passing this valuable knowledge and experience onto current students is the least I can do. I also thoroughly understand how hard it is to find English Language resources (I know I would've loved something like this in Year 12!). As a current tutor of English Language for over 25 students on a full time basis, I have listened and understood the challenges of the everyday VCE English Language student. </strong>  </p>\n\n<p>  \t <strong>Here's a few reasons why you should take this course:</strong><br>  \t <strong></strong>  </p>\n\n<ul>  \t<li>You find the textbook dry and boring (many students do!)</li>  \t<li>You want an interactive way to learn the course</li>  \t<li>You want to learn how to properly structure your essays and analytical commentaries</li>  \t<li>You struggle to even <em>start </em>an essay, let alone complete it</li>  \t<li>You struggle to come up with quotes for your essays</li>  \t<li>You are struggling to grasp certain terms and concepts in the course</li>  \t<li>You simply just want to get ahead in English Language and do the best you possibly can!</li>  </ul>\n\n<p>  \t     This course is entirely comprehensive, meaning that you could be struggling at English Language OR are a pro and just need that extra bit of polishing! I have made this course so that is caters to all levels!  </p>\n\n<p>  \t <strong>Part of my offering is a complete metalanguage list for all of the subsystems AND a complete quotations list for all topics in the course. I also provide you with tons of COMPLETE sample essays covering a wide range of topics, as well as analytical commentaries. Talk about value!</strong>  </p>\n\n<p>  \t       This is the type of course that you can decide to view in a day, OR view certain lectures as necessary, or if you have difficulties in certain areas of the course. Having troubles with structuring essays? No worries, just view the 'essay structure' lecture and download the lecture notes. I also go through an essay and 'dissect' all the important parts of an essay. Though generally speaking, I recommend you go through the entire course at least once to get your money's worth.  </p>\n\n<p>  \t       I conduct this course through interactive PowerPoint videos, and faced video presentations, so I actually <em>TALK </em>to you on screen and explain the concepts and ideas in an engaging and inviting manner.  </p>\n\n<p>  \t       The course is structured according to the area of studies for each unit, with sections added for essays, analytical commentaries and quotations. I also provide you with a wide range of practice questions and also example responses from A+ essays and analytical commentaries.  </p>\n\n<p>PLUS! Once inside, you get the opportunity to talk with fellow English Language students. You can even post questions to the forums inside the course where I will do my utmost best to answer whenever I can! </p>\n\n<p><strong>Note: I have updated the course for the new study design to be implemented at the start of 2016. There have only been a few minor changes made to the current study design and these are all addressed in the online course.</strong></p>\n\n<p><strong>I charge $50 per hour for private tuition to my current students, so you are definitely getting a bargain!</strong><br></p>\n\n<p>  \t <strong>See all of my satisfied student reviews at the bottom of this page!</strong><br>  \t <strong></strong>  </p>\n\n<p>  \t       Any questions, just ask! Until then, I'll see you on the inside.  </p>", 
    "end_date": null, 
    "title": "VCE English Language Units 3/4 - Interactive Course", 
    "price": "50.00", 
    "instructors": "Dmitri Dalla-Riva", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248454_8f2c_3.jpg", 
    "course_url": "https://www.udemy.com/vce-english-language-course/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-23T02:43:13Z"
}