{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Design your own Character Illustration using Adobe Photoshop</strong></p>  <p>This course is designed to give you the ability to draw a cartoon characters with your own style and design. The course takes you through the entire vector illustration process so that you can use the techniques learned in this course to make cute cartoon drawings according to your choices!</p>  <p><strong></strong></p>  <p><strong>Become a Digital Illustrator in under an hour!</strong></p>  <p>In this course you'll learn how to draw cute cartoon characters. We will illustrate eyes, ears, hair, hands, body and the simple techniques to give image to your imaginations.</p>  <p> We will explain:</p>  <ul><li>How to use Adobe Photoshop in order to complete a vector illustration</li><li>simple steps to illustrate cartoons, objects, landscape based on this technique</li><li>Quick &amp; easy tools/techniques of cartoon illustration</li><li>Techniques to create artwork for 2D games, prints, ebooks, magazines and videos</li><li>about various short-keys of Photoshop to speed up workflow</li></ul>          <p> <strong>Content and overview</strong></p>  <p><strong></strong></p>  <p>This course includes over 8 lectures and about 45 minutes of content, suited for anyone interested in digital illustration. </p>  <p>Starting with understanding the vector tools and techniques in Photoshop, we will introduce you to vector tools in Photoshop and how to use them for illustration. Then we will move to cartoon illustration. We will cover head, eyes, lips, shirt, arms, hands, table and book illustration. You will get to know many keyboard short keys of various tools and commands for fast work flow.</p>  <p>By the end of course will will focus on Layers Management and Grouping Layers. Once artwork is completed, we will export it into PNG  format with different options. </p>", 
    "end_date": null, 
    "title": "Vector Illustration in Adobe Photoshop", 
    "price": "20.00", 
    "instructors": "Pixelandb Academy of CG & Real World Art", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782372_38d6.jpg", 
    "course_url": "https://www.udemy.com/vector-illustration-in-adobe-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-04T18:32:15Z"
}