{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This course is for anyone who wants to develop their artistic abilities in order to conceptualize and create a great vector illustration in a minimal style. </p><p style=\"\">I am going to develop the vector illustration in Adobe Illustrator and the course will cover design principles, concept development, sketching and how to turn a sketch into a veritable illustration.</p><p style=\"\">The course is structured into 5 parts as follows:</p><p style=\"\">Part 1 - Introduction</p><p style=\"\">In the introduction section I provide the students with a brief presentation of my artistic career and the goals for the curse.</p><p style=\"\">Part 2 - Get Started with the Vector Illustration</p><p style=\"\">In this part I will talk about Design principles applied to illustration, how to conceptualize an illustration and I complete the sketch for the vector illustration. The sketch process is divided into two videos.</p><p style=\"\">Part 3 - Working on the Vector Illustration</p><p style=\"\">This is actually illustrating the house, the background and the dog from the scene</p><p style=\"\">Part 4 - Finish up the Vector Illustration</p><p style=\"\">In this part I add the finishing touch and wrap up the vector illustration</p><p style=\"\">Part 5 - Conclusion</p><p style=\"\">Thanks to the students and farewell</p><p style=\"\">The course is going to take about 1.5 hours to complete.</p><p style=\"\">Whether you are a total beginner in the field of illustration or a professional artist, anyone will find an useful piece of information and apply it to their own artwork.    </p>", 
    "end_date": null, 
    "title": "Vector illustration of a landscape scene", 
    "price": "20.00", 
    "instructors": "Grigoras Alexandru", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551846_e458_2.jpg", 
    "course_url": "https://www.udemy.com/vector-illustration-of-a-landscape-scene/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T15:25:26Z"
}