{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Learn the Vendor Payments Process in SAP. Learn how to configure various payment methods like Check, ACH and Wire Transfer in SAP. Develop Wire Transfer file / Electronic Fund transfer file in SAP using Data Medium Exchange Engine. Test end to end Vendor Payment process in SAP</p>  <p><strong>This Course on Vendor Payment process includes:</strong></p><ul><li>Vendor Payment Process using Check, ACH, and Wire Transfer</li><li>Configure Payment Methods - Check, ACH, Wire Transfer in SAP</li><li>Update Vendor Master Data in SAP for Payment Methods</li><li>Develop Wire Transfer file / Electronic Fund transfer file in SAP using Data Medium Exchange Engine</li><li>Understand various functionalities of Automatic Payment program in SAP.</li><li>Test End to End Vendor Payment Process in SAP configured and developed by you.            </li></ul><p>This course includes 20 video lectures which explain the Vendor payment process in SAP, Detailed steps to <strong>configure</strong> payment methods like Check, ACH, and Wire transfer in SAP. Detailed steps to <strong>develop</strong> Wire transfer file in SAP using DMEE. Steps to update Vendor master data with new payment methods. In addition course includes supplementary material and functional specs to develop payment file in SAP.</p>  <p>After completing the course you will understand Vendor Payment process in SAP, you will be able to configure various Payment methods like Wire transfer, ACH in SAP, Update vendor master data, Develop Wire transfer / EFT file in SAP using DMEE and Test Vendor payment process. </p>", 
    "end_date": null, 
    "title": "Vendor Payment Config, Development in SAP- WIRE, ACH, Check", 
    "price": "20.00", 
    "instructors": "MKS Consultancy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683344_d3cb_3.jpg", 
    "course_url": "https://www.udemy.com/vendor-payment-sap/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T14:39:17Z"
}