{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t            This course is designed for two types of users. If you&#039;re new to compression, you will learn how to produce high quality video for distributing over the web, watching on your computer or smart TV/console, for inserting into iBooks or to record onto DVDs and Blu-ray discs.  </p>  <p style=\"\">  \t If you know the basics of compression, this course will serve as a valuable reference for questions that inevitably arise when encoding video, like what&#039;s the best key frame setting for web video (Lesson 5), what&#039;s the best way to work with x264 (Lesson 17) or how do I implement HTML5 (Lessons 31 &amp; 33).  </p>  <p style=\"\">  \t  All lessons contain video, most integrating both PowerPoint instruction and screencam demos. All lessons longer than ten minutes are annotated so you can quickly find the content most important to you. Most lessons have links to other Internet-based resources.  </p>  <p style=\"\">  \t                     This course has six major sections:  </p>  <p style=\"\">  \t<strong style=\"\">Terms and technologies (95 minutes) </strong>- provides an overview of codecs and compression, basic encoding configurations (resolution/frame rate/data rate) and then looks at configuration options like bitrate control (VBR, CBR), frame types (I-, B- and P-frames) and container formats. Then it looks at audio encoding parameters (sample rate/channels/data rate), deinterlacing and aspect ratio issues. The section concludes with a look at three free and essential tools, MediaInfo, Bitrate Viewer and MPEG Streamclip.  </p>  <p style=\"\">  \t<strong style=\"\">Codecs (52 minutes) </strong>- This section walks you through a brief history of codecs used in streaming, DVD and Blu-ray and cameras and intermediate codecs used in editing. Then three lessons introduce you to H.264, with a final lesson on using x264.  </p>  <p style=\"\">  \t<strong style=\"\">Encoding Recipes (62 minutes) </strong>- These lessons provide specific instruction for those producing video for uploading to UGC/OVP sites, for playing on mobile devices, for local or TV/console playback, for streaming from a web site, burning onto a DVD or Blu-ray disc or inserting into iBooks Author.  </p>  <p style=\"\">  \t<strong style=\"\">Encoding Programs (126 minutes) - </strong>All encoding programs have idiosyncrasies when it comes to producing streaming video. In these tutorials, for Apple Compressor 4.1, Adobe Media Encoder, Sorenson Squeeze, Telestream Episode and HandBrake, you&#039;ll learn these idiosyncrasies and learn to efficiently produce high quality video ideal for your target uses.  </p>  <p style=\"\">  \t <strong style=\"\">Distributing Your Web Video  (34 minutes) - </strong>This section teaches you how to distribute your video over the web. First it outlines your distribution options, including user generated content sites, online video platforms or from your own website via HTML5. Then it provides focused tutorials that show you how to distribute with all three options.  </p>  <p style=\"\">  \t <strong style=\"\">Optimizing Your Source Videos (68 minutes) - </strong>You can&#039;t have high quality streaming video without high quality video. In these lessons, you&#039;ll learn to optimize your source footage in Premiere Pro, FCP 7 &amp; X and to remove noise with the Neat Video filter. Then you&#039;ll learn to clean your audio in Audition, FCPX, and iZotope RX3, which produces the best quality of the three. The penultimate lesson discusses audio compression, a technique which can improve the clarity of your encoded audio, and the final lesson shows how to declip audio recorded too loudly.  </p>", 
    "end_date": null, 
    "title": "Video Compression for Web, Disc and PC/TV/Console Playback", 
    "price": "50.00", 
    "instructors": "Jan Ozer", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144762_369d_2.jpg", 
    "course_url": "https://www.udemy.com/compressing-video-for-web-disc-and-pctvconsole-playback/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-09T20:47:13Z"
}