{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \tYouTube ist mittlerweile die zweitgrößte Suchmaschine - neben Google. Videos ranken auch auf Google und das schneller und höher als Texte. Daher ist natürlich immer noch Content King aber Video der Kaiser des Internets. Aus diesem Grunde sollte jeder, der eine Webseite sein eigenen nennt oder auch sein Geschäft über das Internet vermarkten will, einmal überlegen, ob und wie er Videomarketing integrieren kann.  </p>  <p>  \tRichtig eingesetzt ist Videomarketing der Motor für Eure Webseite, der Euch immerwährend kostenlosen Trafik bringt.  </p>  <p>  \tIm Kurs &quot;Videobearbeitung für Internet Marketer&quot; geben wir Euch zunächst einen Überblick darüber, warum Internet Marketing die Zukunft für kostenlosen Trafik ist und zeigen Euch dann, wie Ihr mit einfachen Mitteln Euer Videomaterial so aufbereiten könnt, dass Eure Zuschauer schon auf das nächste Video warten.  </p>  <p>  \tWir zeigen Euch auch, wie man die Videos dann schließlich auf die eigene Webseite einfügt.  </p>  <p>  \tDabei beleuchten wir im Kurs zum einen die verschiedenen Aspekte des Internet Marketings, zum anderen gehen wir auf die technischen Details ein, so dass Ihr am Ende des Kurses einfache und effektive Videos erstellen könnt, die auch auf YouTube und Co. gefunden werden und Euch viel kostenlosen Trafik bringen.  </p>", 
    "end_date": null, 
    "title": "Videobearbeitung mit Screenflow für Internet Marketer", 
    "price": "20.00", 
    "instructors": "Monja Wessel, Markus Korsten, Online Lernen SimpleLife Stories", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354488_f177_2.jpg", 
    "course_url": "https://www.udemy.com/videobearbeitung-fur-internet-marketer/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T14:06:08Z"
}