{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t  A virtual private network (VPN) is a network that uses the Internet, to provide remote offices or individual users with secure access to their organization&#039;s network.  </p>  <p style=\"\">  \t    A lot of people use VPNs but they do not really understand how it all works. It is not good! <strong style=\"\">You NEED to know it, it is your security</strong>! Do you remember <strong style=\"\">NSA </strong>and all issues around it? Do you want to make sure hackers will not get access to your files? Well... it is time to learn how you can make your connection secure and reliable.  </p>  <p style=\"\">  \t    This training is designed for beginners, however I included some more advanced labs as well. I discuss VPN protocols, encryption, hashes, certificates, remote and site to site vpns...  </p>  <p style=\"\">  \t   Learn about the advantages of VPN:  </p>  <ul style=\"\">  \t<li style=\"\">Improve security for data exchanges</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Improve productivity</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Functionality and resources shared from a corporate office</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  If data is intercepted, it will be encrypted and will not be readable to outside hackers</li>  </ul>  <p style=\"\">  \t    It is time to learn how VPNs really work! There are  labs included which will show you how we can apply all these protocols in the real world. Enjoy!  </p>", 
    "end_date": null, 
    "title": "Virtual Private Networks for beginners - VPN, Cisco training", 
    "price": "20.00", 
    "instructors": "Marious Kuriata", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234558_94bd_4.jpg", 
    "course_url": "https://www.udemy.com/virtual-private-network/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-31T10:34:59Z"
}