{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">WHO ELSE WANTS SMARTER KIDS?</strong></p><p>If your child is not doing well at school, poor vocabulary could be the problem.</p><p>Your child&#039;s ability to use his given language is the key to all his learning.</p><p>The more words a child knows, the greater that child&#039;s success.</p><p>Taking this course is a potential vocabulary boost of 1000 words for your son or daughter!</p><p><strong style=\"\">How?</strong></p><p>Just learning 10 words can expose a person to 90 more.</p><p>Technically your child is being deliberately exposed to 100 words because this course teaches 50+ collective nouns for 50 words. 10 x (10 + 90) = 1000 words</p><p><strong style=\"\">Raising smart children just got easier</strong></p><p>If you have ever imagined sitting with pride in the audience watching your child receive an award for good work at the end of the school year, then you must act now.</p><p>If you start immediately, working diligently on your child&#039;s vocabulary, you could start to see improvement within the next year that will last him a lifetime.</p><p>We&#039;re making it easy for you by removing all the hard work usually associated with helping your child succeed at school.</p><p>The time consuming tasks of doing research on the Internet, looking for worksheets and trying to figure out answers have been done for you.</p><p>You will find everything you need in one place.</p><p>Use the course materials to rapidly improve your child&#039;s vocabulary<br style=\"\">Your ward can learn as many as 10 words in a single day.</p><p>There is a video lecture showing each noun paired with its collective noun.</p><p>There are puzzles and games to accelerate your child&#039;s learning.</p><p><em style=\"\"><strong style=\"\">But there is more…</strong></em></p><p>Because you the parent need to be satisfied that learning is taking place, at the end of each section there is a quiz for you to check your child&#039;s progress.</p><p><em style=\"\"><strong style=\"\">…and more</strong></em></p><p>We go one step further and provide a posttest app that randomly generates 20 questions related to the 50 collective nouns taught.</p><p>The app can be separately downloaded to an iPad or Android and used anytime, anywhere without an Internet connection.</p><p>The test will be different each time you take it so it can be used multiple times now and in the future as revision to keep your protégé sharp.</p><p><strong style=\"\">How this course is organized</strong><br style=\"\">You will know exactly what your child is learning because one of the first lectures is a Parent&#039;s Reference Guide listing all the nouns that make up this course.</p><p>The sections for you also include details of the steps necessary to make the best use of the course, answers to the puzzles and games and how to access the free posttest app that you will use to be sure that your son or daughter is ready to move on to the next 50 words.</p><p>The remaining sections, the teaching sections, contain the meat of the course. Each section teaches the collective noun for 10 words. There are 5 teaching sections. Each one contains:</p><li>A video lecture pairing each noun with its corresponding collective noun</li><li>Video flash cards for practice and reinforcement</li><li>Puzzles and games to help your child master the material</li><li>An end of section quiz to check that your ward knows the collective noun for each noun in the word list</li><p><br style=\"\">With your encouragement your child would be on the way to a better command of the English language and better grades in school.</p><p>You have nothing to lose as there is a 30 day money back guarantee. And you keep the posttest app.</p><p>Every minute you delay may be causing your child to fall behind his classmates at school.</p><p>Go ahead and enrol now by clicking the &quot;Take This Course&quot; button. Your child&#039;s future is determined by your present actions.</p><p><em style=\"\">Dova Team</em></p><p><strong style=\"\">P.S.</strong> You can also use this course to teach yourself vocabulary and improve your life. Research shows that people with a command of their spoken language are the ones holding key positions in their organizations.</p>", 
    "end_date": null, 
    "title": "Vocabulary: Smarter Kids in a Year - Collective  Nouns 2", 
    "price": "25.00", 
    "instructors": "Dova Lael Inc.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428094_b2ca_2.jpg", 
    "course_url": "https://www.udemy.com/vocabulary-learning-collective-nouns-2-smarter-kids-in-a-year/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T22:33:29Z"
}