{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><em>UPDATE 02.02.2016</em></p><p>In meinem Kurs <em>,,Vom Null auf TÜRKISCH - Lerne Türkisch in 1 Stunde!'</em>' zeige ich dir, wie leicht es für dich ist, türkisch zu lernen.</p><p>Lerne hier die Basics der türkischen Sprache!</p><p><strong>Alles, was du für den Anfang brauchst</strong></p><p>Ob du nach dem Weg fragen, was zu Essen bestellen oder dich einfach nur mal nett mit Leuten auf türkisch unterhalten und austauschen möchtest, dieser Kurs gibt dir die einmalige Gelegenheit, mit wenig Aufwand etwas großartiges zu vollbringen, nämlich eine neue Sprache zu erlernen!</p><p><br></p><p><strong>FÜR JEDEN GEEIGNET - </strong>Dieser Kurs eignet sich perfekt für jeden, der türkisch schon immer lernen wollte und nicht die Möglichkeit hatte, dies bisher zu tun.</p><p><strong>EINFACH UND VERSTÄNDLICH - </strong>Der Kurs ist sehr verständlich aufgebaut und du wirst schnell merken, wie einfach diese Sprache ist. </p><p><strong>VIELFÄLTIG UND UNTERHALTSAM - </strong> Nicht einfach trocken Vokabeln oder die Grammatik lernen. Du lernst, was du wirklich für den Anfang brauchst. Auch hilfreiche Tipps erwarten dich hier, die du im Alltag gebrauchen kannst. </p><p><strong>SCHNELL UND EFFEKTIV -</strong> Ich vergeude nicht deine Zeit. Der Kurs ist smart konzipiert und optimiert und ermöglicht es dir im Handumdrehen türkisch zu lernen.</p><p><br></p><p>Worauf wartest du noch? </p><p>Klicke auf ,,KURS BELEGEN'' und tauche in die geheimnisvolle Welt der türkischen Sprache ein!</p><p>Du wirst es nicht bereuen! Ich freue mich auf dich!</p><p><br></p>", 
    "end_date": null, 
    "title": "Von Null auf TÜRKISCH - Lerne Türkisch sprechen in 1 Stunde!", 
    "price": "20.00", 
    "instructors": "Lion - Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746966_f292_2.jpg", 
    "course_url": "https://www.udemy.com/tuerkisch-kurs-1/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T15:33:53Z"
}