{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Web Content Studio is a sophisticated tool to help webmasters write high quality web content.  It does have a learning curve that can put some webmasters off, but that is where this course comes in.  Created by the creator of Web Content Studio, this course will take you through every aspect of the tool, showing you how to harness the power to create great content.</p><p><strong>Watch over my shoulder</strong></p><p>This course allows you to watch \"over-my-shoulder\" as I use the software.  You'll learn about the logical workflow as you create content, and watch each step as I carry them out in this course.  You'll get to see me working on content for my real websites.</p><p><strong>What's in the course?</strong></p><p>The course starts at the very beginning, with installation and/or upgrading the software to the latest version 2. The entire course uses the latest version of Web Content Studio (version 2.x).  You'll then learn:</p><ul><li>The logical steps within the software from content idea to final article.</li><li>Mining keywords and phrases from the top ranking pages to use as theme words in your own content.</li><li>You'll learn about a few power user features of the spider, that most people are not aware of.</li><li>How to use bookmarks to quickly access your favourite research sites.</li><li>How to use the Grabber and the scratchpad to quickly research any topic, in a format that is easy to use later when writing your content.</li><li>How to use the WYSIWYG editor to write your content and format it, ready for your website.</li><li>How to use built in reports to check the theme of your content, and find potential problems like overuse of keywords.</li><li>How writing guides can speed up your content creation.</li><li>Keeping notes inside the software, so they can be found and used easily.</li></ul><p><strong>What will you get out of this course?</strong></p><p>If you are going to use a piece of software, who better to learn from than the creator and programmer of the tool?  With my inside knowledge, you'll have the advantage of learning from the leading expert on Web Content Studio, as well as a respected SEO and content creation specialist.  In short, you'll learn how to unleash the full power of Web Content Studio to write content that you are proud of, and the search engines will love.</p>", 
    "end_date": null, 
    "title": "Web Content Studio Mastery", 
    "price": 0, 
    "instructors": "Andrew Williams", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738098_ec15_5.jpg", 
    "course_url": "https://www.udemy.com/web-content-studio-mastery/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T17:52:27Z"
}