{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Win More Grants by Becoming </strong><strong class=\"redactor-inline-converted\">GRANT READY</strong> is an essential grant planning preparation course. It provides a discussion of all the documents and organizational preparations you need to have in place to successfully apply for grant funding, impress grant makers, run a smooth grant management system, and always, always include the latest data, statistics, descriptions, outcomes, and other information that supports your need and justifies your solution. To be considered for any funding, your NPO HAS to be <strong class=\"redactor-inline-converted\">GRANT READY</strong>. This course is perfect for any grant writer. And not only is it ideal as an aid to teaching your NPO or clients how to become <strong class=\"redactor-inline-converted\">GRANT READY,</strong> but as a consultant you most definitely can bill for your time spent training and preparing your clients to become <strong class=\"redactor-inline-converted\">GRANT READY</strong>.</p>\n\n<p>While updating my Grant Readiness checklist, I surveyed grant writers and consultants from across the USA, requesting their descriptions of being <strong class=\"redactor-inline-converted\">GRANT READY.</strong> The outcome became this course: a good, solid picture of what grant makers tend to ask about, and information needed to provide those answers.</p>\n\n\n\n\n\n\n\n<p>This is a short course, less than an hour, but you'll spend considerable time assembling the list of required information, developing a system of delegating and following up with those assigned to maintain data or submit information. </p>\n\n\n\n\n\n\n\n<p>So, plan to do some work, then watch your NPO soar. This course will help you improve your grant presentations and applications, your understanding of your mission, vision, and potential to achieve them. Once you complete the assignments, you'll see your programs and projects in a clearer light. You'll know more about how your services dovetail with others both similar and complimentary. <br></p>\n\n\n\n\n\n\n\n<p>You'll spend less time trying to find needed details. Grant application processes such as writing and reviewing, obtaining the specific budget information needed, assembling required attachments, and submitting well before deadlines will just go more smoothly. Wouldn't THAT be nice?</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The course is divided into two basic parts.</strong> </p>\n\n\n\n\n\n\n\n<p>The first six lectures describe why <strong class=\"redactor-inline-converted\">GRANT READINESS</strong> is important, and what a <strong>GRANT READY NPO </strong>looks like. </p>\n\n\n\n\n\n\n\n<p>The last four lectures review the contents of the checklists and why those items matter. </p>\n\n\n\n\n\n\n\n<p>Lecture 11 wraps up with a summary, assignments to build your own <strong class=\"redactor-inline-converted\">GRANT READINESS </strong>checklist, and a simple system for managing these records. </p>\n\n\n\n\n\n\n\n<p>You'll download a seven-page checklist of needed items, broken down into five categories. The checklist can be used as is, or edited to fit your or your clients' needs. This checklist is suitable for most categories of charitable giving, but if something is missing, just add it. And if you share it with me I'll add it and add your name and company to the credits. </p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Win More Grants by Becoming Grant Ready", 
    "price": "35.00", 
    "instructors": "Michele Boyer, RRT", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295423_59cf_2.jpg", 
    "course_url": "https://www.udemy.com/win-more-grant-funding-by-becoming-grant-ready/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-06T19:37:48Z"
}