{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>In this course teachers will get an overview of Work-Based learning and best practices for WBL implementation, including Guest Speakers, Industry Tours, Job Shadows and Internships. </p><p>Begin with ideas of how you can integrate Work-Based learning into your classroom through career exploration and goal setting.</p><p>Students also need to find out what it takes to get a job, and start building their personal brand.  By making a resume now and studying the resume that they will one day need, they can start to plan out their educational pathway as well as identify the skills they need to build in order to get a job.</p><p>Although you will have help setting up your WBL experiences, there are many logistics that need to be addressed in order to ensure success.  This module includes check lists, best practices and tips for setting up WBL.</p><p>Preparing students for WBL includes more than just career exploration.  Take time to talk about professional dress &amp; behavior as well as some of the ways they can present themselves in order to show their interest and respect. </p><p>In order for WBL to be sustainable, it is important to thank your industry partners and find out if they have any feedback.  For students to reap the most rewards from WBL you need to intentionally take time in class to reflect on the experience. <br></p><p>Although this training is targeted towards teachers in San Diego &amp; Imperial Counties in California, the listed resources are all free on our website and the information is likely applicable to any other teacher looking to integrate more WBL into their classroom. <br></p>", 
    "end_date": null, 
    "title": "Work Based Learning Teacher Training", 
    "price": 0, 
    "instructors": "Jewyl Clarke", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743772_0726_4.jpg", 
    "course_url": "https://www.udemy.com/workbasedlearning/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T16:57:23Z"
}