{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Sometimes we all get <strong>overwhelmed by the flow of ideas</strong>. Creative people are often distracted by ideas about new projects while they are working on their current project. Sometimes the opposite is true, that we worry about <strong>not having any ideas</strong>.  </p>  <p>  \t  It's not just creative people who face this challenge, business owners also get distracted by the bright shiny ideas that crowd out their focus on the current business strategy.  </p>  <p>  \t  Ideas come when you are not prepared to manage them and your mind becomes occupied with worry about losing them.  </p>  <p>  \t  This course will give you the<strong> tips, tools and techniques</strong> to manage that stream of ideas.  </p>  <p>  \t  The course focuses on using the knowledge for writing projects and you'll learn,  </p>  <ul>  \t<li>To recognize how you generate ideas</li>  \t<li>To manage you time to allow you to assess the ideas that come </li>  \t<li>To translate ideas into action through an assessment process</li>  \t<li>To help you learn the process, there are two examples, and a tool that you can use to walk through the assessment of good ideas. </li>  </ul>  <p>  \t  If you are tired of running after every idea, this course will help by training your muse to give you great ideas.  </p>", 
    "end_date": null, 
    "title": "Writing: Learn How To Manage Ideas & Turn Them Into Action", 
    "price": "20.00", 
    "instructors": "Perry Wilson", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/153644_d8c3_2.jpg", 
    "course_url": "https://www.udemy.com/learn-the-secret-of-changing-ideas-from-distraction-to-story/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-27T18:16:19Z"
}