{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Make real money as a freelance writer - even if you've never been able to before!</strong></p>\n\n<p>You don't need a big blog following with loyal fans, be well-connected, or even have much talent to break into freelance writing.</p>\n\n<p>You also don't need dozens of clips to launch your new career to potentially command $1,000 a month as a <em>new</em> writer. And that's with the possibility to skyrocket your income as you gain experience. But it won't happen overnight.</p>\n\n<p>All you really need is to know is exactly how to position yourself to attract paying clients who want your work.</p>\n\n<p><strong>That's exactly how I earn between $100 on up to $1,500 an assignment. I can show you the ins and outs of breaking in, navigating your way to a client's inbox and landing work.</strong></p>\n\n<p>So stop wasting your time paying dues and playing the \"send and wait\" game with query letters. There's a better way to launch a successful freelance writing career for magazines, websites, newspapers and more<em>.</em></p>\n\n<p>I've been a freelance writer for nearly 15 years and have also worked as a video editor and Multimedia Director.</p>\n\n<p><strong>And while I am persistent, none of the following worked for me in breaking into freelance writing and staying there.\n</strong></p>\n\n<ul><li>I DIDN'T have connections in the publishing industry.</li></ul>\n\n<ul><li>I DIDN'T have impeccable talent and writing skills. I didn't wait around to gather a lot of clips before breaking into markets like The LA Times.</li></ul>\n\n<ul><li>I DIDN'T get an MFA or take a lot of writing workshops.</li></ul>\n\n<ul><li>I DIDN'T break in with a bunch of high-end, glossy magazines. But I was also able to leverage clips in huge newspapers and big magazines in just a few short months (once I finally broke in).</li></ul>\n\n<p><br></p><p>It took a few years to perfect my approach, but I've gotten to a point now where I can just introduce myself and land work. And it's not just because of my clips, though I have those now. And it's not because I languished around in content mills.</p>\n\n<p>There's a reason why most reasonably talented writers spend <em>years </em>breaking in instead of just taking command and getting there. And the ones who seem to break through early all know the same thing about why talent is underrated and action is everything.</p>\n\n<p>MOST writers struggle for so long because it's completely overwhelming to know <em>where</em> to start and when to have enough faith to take bigger leaps into new markets. It's hard to think you can quit writing for peanuts and start landing lucrative clients to give you that flexibility and creative outlet you crave.</p>\n\n<h5><strong>Are you a frustrated freelance writer who is still:</strong></h5>\n\n<ul><li>Sending out queries and waiting for weeks or months only to be rejected by a form letter?</li></ul>\n\n<ul><li>Trying to break into tiny markets with no success?</li></ul>\n\n<ul><li>Drowning in a sea of information with no idea how to track down the right people?</li></ul>\n\n<ul><li>Getting advice from everyone around you - even though they've never tried to be a freelance writer? Or maybe got a few rejections and gave it up?</li></ul>\n\n<ul><li>Wondering why \"real\" writers consistently come up with irresistible ideas everyone wants?</li></ul>\n\n<ul><li>Afraid you'll never get ahead of your competition?</li></ul>\n\n\n\n<h5>Let's get brutally honest. It takes a lot more than talent to break into the world of freelance writing and more importantly - stay there.</h5>\n\n<p>Even the most talented writers may never see their name in print without a few key steps to keep them ahead of the game. In fact, it's often less talented writers that continually land clients. What do they know that you don't?</p>\n\n<p><strong>Learn how to develop a lasting craft that includes:</strong></p>\n\n<ul><li>Breaking into the industry without clips.</li></ul>\n\n<ul><li>Getting quality clips from reputable businesses and publications lightning fast!</li></ul>\n\n<ul><li>Leveraging creativity and flexibility to get ahead instead of writing talent.</li></ul>\n\n<ul><li>Stopping the cycle of fear and rejection and using your competition to do your homework for you.</li></ul>\n\n<ul><li>Taking advantage of rejection and turning it into a success story.</li></ul>\n\n<ul><li>Tracking down the right people who will buy your work and learn who they really want to work with.</li></ul>\n\n<ul><li>Leveraging your life experience for success. It matters way more than your writing talent.</li></ul>\n\n<p><br></p>\n\n<p>****</p>\n\n<p>I'm a freelance writer with nearly 15-years of experience across travel guidebooks, iPhone app content, magazine articles, newspapers, websites and commercial scripts. I've also worked as a naming consultant and video editor on national commercials and films. I earn a living freelance writing and thrive in doing creative work every day. But at the end of the day, what I really love doing is:</p>\n\n<p><strong>Helping new writers crush obstacle and break into freelance writing - even if they've never been able to before.</strong></p>\n\n<p>But I didn't walk into my career with a roster of clients and assignments in hand. Instead I came stumbling into the arena and spent nearly <em>10 years </em>breaking through with my first big clip and getting my freelance writing career rolling. Sure I had a few hits, but mostly misses, and couldn't figure out why I hadn't \"made it.\" It was endless years of frustration. I nearly lost hope that I would ever figure it out.</p>\n\n<p>Like many struggling freelance writers out there, <strong>I followed all of the traditional advice like sending out query letters and endless waiting.</strong></p>\n\n<p>Nothing really worked. It felt like I was missing key pieces from a jigsaw puzzle. I could see the big picture, but not the pieces to get there.</p>\n\n<p><strong>It wasn't until I stumbled upon a few key methods that I ended up skyrocketing my freelance writing success.</strong></p>\n\n<p>It took a lot of trial and error that took years to perfect. I pulled all that knowledge together in one place to help you crush barriers (and your competition) in just a few short months.</p>\n\n<p>I write for a living and if I can't get my idea from A to Z then my whole family suffers. This is the livelihood I picked (and love!) to stay home with my young children and still make ends meet. So I really didn't have a choice but to light a fire under myself and take some action.</p>\n\n<p>There's no sitting around waiting for an assignment to come to you, at least not in the early months and years of freelancing. You have to go out and take control of your career and build the life you want.</p><p>***</p>\n\n<p>Here's more to think about. Is writing a dying career? Hardly. According to the Bureau of Labor Statistics, the median pay of writers was $55,940 and related employment is projected to grow 3 percent until 2022.</p>\n\n<p>Companies need content. They need web pages and case studies just to scratch the surface. And while magazines may move towards the web, editorial writing is still in demand. I have a little secret I share with you for how I tap dozens of magazines that are only known to select groups but pay more than many national publications.</p>\n\n<p>Think you need an advertising agency title to be a copywriter? You're wrong. If you don't think you're \"qualified\" to be a writer, think about this. Does the wine store down the street that needs some web copy and flyers want an expensive ad agency? Do they want to pay for a six-figure copywriter?</p>\n\n<p>No. All they want is a decent and reliable writer. And that's why just about anyone with reasonable talent and ambition can cobble together a freelance writing career <em>without </em>paying dues for years.</p>\n\n<p>Languishing away and torturing yourself over why you can't break into a market like the <em>New York Times</em> or <em>People Magazine</em> is a waste of time. It's pointless. Sure, you might break into a huge market on your first try, but there are a thousand other avenues that are easier, more profitable and usually yield a higher reward (like ongoing work).</p>\n\n<ul><li>Your neighborhood alone probably has thousands of dollars in untapped writing revenue.</li></ul>\n\n<ul><li>Your city probably has editorial work ranging from glossy magazines to corporate pieces at nearby hospitals.</li></ul>\n\n<p>And instead of going out there and asking for work, you're still hoping for a big break, even though the big break is right in front of you.</p>\n\n<p>By not acting, you're missing out acting on a dream and embracing that flexible lifestyle you crave. You can take your writing with you. You can work it into your career as a side income stream while continuing a part-time or full-time job. And if you're like me, you can stay home with your children while contributing financially and tapping into your creativity at the same time.</p>\n\n<p>The hard part is figuring out how to launch yourself and get started. There <em>will</em> be ups and downs, but once you have the techniques to land clients, you can keep applying it again and again while refining your approach. Let's get started.</p>\n\n<p><strong>Who this course is for:</strong></p>\n\n<ul><li>Aspiring and struggling freelance writers looking to take break down fears and barriers and launch their careers.</li></ul>\n\n<ul><li>Writers with fluent English-speaking and writing skills. You won't achieve the same success from this program if you don't have reasonable skills.</li></ul>\n\n<ul><li>Writers who aren't afraid to dive right in and do the hard work necessary to succeed.</li></ul>\n\n<ul><li>Writers interested in learning about a variety of markets. While many techniques in this course will work for copywriting and corporate clients, it is <em>not</em> the main focus.</li></ul>\n\n<ul><li>Writers who are willing to take the time to develop their craft and learn the business without losing their patience after a few short weeks.</li></ul>\n\n<ul><li>Creative types who enjoy animated videos by way of learning. There are also PDF transcripts you can use.</li></ul>\n\n<p><strong>Who this course is <em>NOT</em> for:</strong></p>\n\n<ul><li>Non (fluent) English speaking writers.</li></ul>\n\n<ul><li>Seasoned and emerging writers already making a steady income from writing.</li></ul>\n\n<ul><li>Writers trying to break into fiction.</li></ul>\n\n<ul><li>Aspiring copywriters <em>not</em> interested in consumer journalism, magazine and web writing.</li></ul>\n\n<ul><li>Anyone who gives up after a few attempts or initial rejection. This course will take a few months to see consistent results and success is <em>absolutely</em> contingent on the work you put into it. This course is NOT a magic formula, it's simply a clear guideline to follow and tweak to suit your needs.</li></ul>\n\n<ul><li>Writers who can't put aside their fantasies about the freelance lifestyle to approach their work as a business.</li></ul>\n\n<ul><li>Writers who need information on setting up an online portfolio.</li></ul>\n\n<p><em>* I cannot guarantee you will make a specific income from this course. Projections are based on my own experience and are contingent on your skills, ability and determination.</em></p>", 
    "end_date": null, 
    "title": "Writers Who Launch: Break Into Freelance Writing Fast", 
    "price": "25.00", 
    "instructors": "Susan Finch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791086_081e_4.jpg", 
    "course_url": "https://www.udemy.com/writers-who-launch-break-into-freelance-writing-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T04:25:31Z"
}