{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong>Latest:</strong>  </p>\n\n<p>  \t<strong> Course Fully Updated for June <strong>2016</strong></strong>  </p>\n\n\n\n<p>  \t<strong>Join my community of over 5,800 students learning my courses!</strong>  </p>\n\n\n\n<p>  \t              You will learn many tips, tricks, secrets and Easter Eggs within YouTube that <strong>most people do not know about</strong>. This course does <strong>not require any prior knowledge</strong>, as everything <strong>will be explained from scratch.</strong> Nothing is needed in order to use these tricks, you simply need Internet connection and access to YouTube.  </p>\n\n\n\n<p>  \t              ____________________________________  </p>\n\n\n\n<p>  \t              YouTube is one of the most popular video streaming websites. Millions of people use the platform every single day. Even considering its popularity, <strong>very few people know the tips and tricks, which are covered in this course</strong>. This course <strong>covers a large variety of tips and tricks</strong> such as what to do, if your internet connection is slow, make your favourite videos loop, refine your search results, watch full length movies on YouTube and many others. You can simply <strong>browse through the curriculum</strong> in order to see all of the tricks you will be learning in this course.  </p>\n\n\n\n<p>  \t              This course aims to teach about the tricks in order to add a different dimension to your<strong> experience with YouTube </strong>and also <strong>make it more enjoyable</strong>, as you will be learning little shortcuts, hacks and special features that you can use on YouTube.  </p>\n\n\n\n<p>  \t            ____________________________________  </p>\n\n\n\n<p>  \t<strong>Curriculum Sections:</strong>  </p>\n\n\n\n<p>  \t              The course is divided in a few sections. After the introduction to the course you will <strong>learn small URL hacks</strong>. In this section I will cover various small hacks that you can achieve by changing the URL of the YouTube videos that you will be watching.  </p>\n\n\n\n<p>  \t              The second section will cover <strong>how you can embed YouTube videos</strong> to your website or blog. Most importantly, I will cover <strong>how you can edit the HTML code</strong> in order to make sure that the <strong>embedded videos meet your exact needs </strong>(do not worry, <strong>no prior knowledge of HTML is needed</strong>, as I will cover everything you need).  </p>\n\n\n\n<p>  \t              In the next section I will show you <strong>some external websites that offer a YouTube related service</strong>. An example of which is how to make YouTube videos repeat themselves endlessly. Also, I will be <strong>showing you examples of how to use the websites</strong> in order to use <strong>all of the features offered by them</strong>.  </p>\n\n\n\n<p>  \t              Afterwards, the next section will cover many different <strong>miscellaneous tips and tricks</strong>. These vary greatly from changing default playback settings if you have a slow Internet connection to refining the search results and allowing you to find the content easier that you want to watch.  </p>\n\n\n\n<p>  \t              This course also covers <strong>hidden and hilarious YouTube Easter Eggs</strong>, which you will learn how to unveil. The Easter Eggs are created as a <strong>joke within YouTube</strong> and <strong>very few people know about their existence</strong>. In this course you will also <strong>learn what the jokes refer to</strong>.  </p>\n\n\n\n<p>  \t              Furthermore, YouTube changes rapidly. Therefore, the tips, tricks, secrets and Easter Eggs change over time as well. <strong>This course will be reviewed very frequently and new lectures will be continuously be added.</strong>  </p>\n\n\n\n<p>  \t            ____________________________________  </p>\n\n\n\n<p>  \t<strong>Summary of Benefits from Taking This Course:</strong>  </p>\n\n\n\n<ul>  \t<li>Learn various tips that are within YouTube</li>  \t<li>Learn URL tips that you can use by simply changing the URL address</li>  \t<li>Learn how to embed videos and edit the HTML code to make them meet your individual needs</li>  \t<li>Learn about external websites, which offer a YouTube related service</li>  \t<li>Learn secret jokes that have been created by YouTube</li>  \t<li>All future extra lectures and upgrades are always included for free and the course will be reviewed very frequently and new lectures will be added.</li>  \t<li>Full lifetime access</li>  \t<li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</li>  </ul>\n\n\n\n<p>  \t<strong>Click the “Take this course\"</strong> button at the top right, as you will <strong>learn many different tricks</strong>, which <strong>will make your YouTube experience more enjoyable.</strong> Remember that <strong>this course will be reviewed frequently</strong> and <strong>you will be granted a full lifetime access</strong>.  </p>", 
    "end_date": null, 
    "title": "YouTube Tips and Tricks and Its Funny Secret Easter Eggs", 
    "price": "50.00", 
    "instructors": "John Smith", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370108_4263.jpg", 
    "course_url": "https://www.udemy.com/youtube-tips-and-tricks-and-its-funny-hidden-easter-eggs/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-14T14:35:35Z"
}