{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">   Zoho Campaigns: Overview and Getting Started</strong> is designed for the new Zoho Campaigns<a href=\"https://www.zoho.com/campaigns/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"></a> user. The course will go through the basic steps of creating an email campaign and highlight key features of Zoho Campaigns to help jump-start the user’s email marketing efforts.  </p>  <p style=\"\">  \t      By the end of the course, users will know how to:  </p>  <ul style=\"\">  \t<li style=\"\">Build a mailing list and create an audience for each email campaign.</li>  \t<li style=\"\">Design email content, using predesigned templates or importing existing templates.</li>  \t<li style=\"\">Schedule and send an email campaign. </li>  \t<li style=\"\">Analyze Campaign Reports, using statistics to learn about audience behavior and improve open-rates.</li>  \t<li style=\"\">Integrate Zoho Campaigns with Zoho CRM. (Zoho CRM is the lead management app within the Zoho Suite. This integration allows users to quickly and easily send an email campaign to their leads or contacts stored inside Zoho CRM.)</li>  </ul>  <p style=\"\">  \t      Who should take this course?  </p>  <ul style=\"\">  \t<li style=\"\">People whose company has decided to use Zoho Campaigns for email marketing and need to learn how to use the system.</li>  \t<li style=\"\">People who are joining a marketing position in a new company that is using Zoho Campaigns.</li>  \t<li style=\"\">Marketers who want to get a better understanding of how to create effective email campaigns.</li>  </ul>", 
    "end_date": null, 
    "title": "Zoho Campaigns: Creating and Sending Your First Campaign", 
    "price": 0, 
    "instructors": "Zoho Academy, Sarah Bailey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/225610_4774_5.jpg", 
    "course_url": "https://www.udemy.com/zoho-campaigns-creating-and-sending-your-first-campaign/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-21T22:37:24Z"
}