{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Zulu is a beautiful language spoken by a proud African nation.</strong>  </p>  <p style=\"\">  \t        Do you dream about going on an African adventure? A vacation or business trip where you&#039;ll meet interesting people, learn about fascinating cultures and take in the stunning natural beauty of the African continent?  </p>  <p style=\"\">  \t        South Africa is the home of the Zulu nation, the jewel at the southern tip of Africa.  </p>  <p style=\"\">  \t        Zulu is the most widely spoken language in South Africa with more than eleven million mother tongue speakers.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">This course is suitable to:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">People who will be visiting South Africa for study, work, church, or vacation.</strong></li>  </ul>  <ul style=\"\">  \t<li style=\"\">People who already live in South Africa and want to communicate more effectively in business and at home.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">People who have a keen interest in foreign languages and cultures. This is a fantastic opportunity to learn about one of the most fascinating cultures in Africa. It is amazing how so much of the Zulu&#039;s traditional culture is still practiced in today&#039;s modern society.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">&quot;Speak Zulu&quot;</strong> is the first ever online Zulu language course. Your teacher, <strong style=\"\">Sharl Henning</strong> has twenty four years’ experience in teaching Zulu to adults. He holds three university degrees in Zulu and has written a Zulu Course Book for Beginners and a Phrase Book with 700 useful English/Zulu Phrases.  </p>  <p style=\"\">  \t        Speaking to Zulu people in their own language will build cross-cultural bridges and improve both personal and business relationships.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">The course content will take you a few weeks to master. You&#039;ll learn how to:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Pronounce the interesting Zulu sounds. Including the fun click sounds.</li>  \t<li style=\"\">Greet someone respectfully.</li>  \t<li style=\"\">Ask after his/her well-being.</li>  \t<li style=\"\">Thank someone sincerely.</li>  \t<li style=\"\">Say goodbye according to the Zulu custom.</li>  \t<li style=\"\">Do the proper Zulu handshake.</li>  \t<li style=\"\"><strong style=\"\">NB!</strong> You&#039;ll also learn a large selection of <strong style=\"\">useful tourist phrases</strong>. You&#039;ll be able to use these phrases when you visit for business or pleasure.</li>  </ul>  <p style=\"\">  \t        The course materials include videos and downloadable sound files (mp3) and pdf course notes.  </p>  <p style=\"\">  \t        The videos teach the content in a fun easy way and are filled with fascinating images of people partaking in the major Zulu cultural events. You&#039;ll see pictures of the Reed Dance Ceremony, the Shembe Church gathering, Zulu diviners/healers and Zulu warriors.  </p>  <p style=\"\">  \t        This is a basic beginner&#039;s course but will give you a solid foundation upon which you can build your Zulu language skills.  </p>  <p style=\"\">  \t<strong style=\"\">Get going today! Begin your African adventure right now!</strong>  </p>", 
    "end_date": null, 
    "title": "Zulu Phrases - Your African Adventure", 
    "price": "20.00", 
    "instructors": "Sharl Henning", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349806_bd0a_4.jpg", 
    "course_url": "https://www.udemy.com/speak-zulu/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T17:17:49Z"
}