{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Онлайн-курс «Школа корпоративной социальной ответственности» подготовило и ведет Агентство социальной информации (АСИ). Он адресован представителям компаний, заинтересованных в развитии и внедрении в своих организациях принципов и практик корпоративной социальной ответственности (КСО), а также социальным предпринимателям, сотрудникам некоммерческих организаций. Курс будет полезен студентам вузов, желающим ознакомиться с основами КСО и в будущем стать менеджером этого направления. </p><p>\tЭто первый бесплатный общедоступный онлайн-курс по теме корпоративной социальной ответственности на русском языке.</p><p>Участники курса узнают, что такое корпоративная социальная ответственность, зачем компаниям и организациям необходимо развивать социальную ответственность, как нужно учитывать мнение заинтересованных сторон организации, какие основные подходы существуют в этой области.</p><p>В программе курса восемь тем: </p><ol><li>«Корпоративная социальная ответственность: основные определения и роль в работе современной компании»,</li><li>«Бизнес и права человека», </li><li>«Взаимодействие со стейкхолдерами (заинтересованными сторонами)», </li><li>«Информационно-аналитическое обеспечение КСО», </li><li>«Экологическая ответственность бизнеса», </li><li>«Нефинансовая отчетность», </li><li>«Социальная ответственность компании перед сотрудниками», </li><li>«Взаимодействие с местными сообществами». </li></ol><p>Лекции сопровождаются тестами для самопроверки и списками литературы для самостоятельного изучения.</p><p>Ведущий курса – директор Агентства социальной информации Елена Тополева-Солдунова.</p><p>Первый поток курса продлится до конца 2015 года.  Самые активные пользователи лектория смогут бесплатно получать консультации специалистов Агентства социальной информации по темам КСО, а также помощь в разработке социального проекта для своей компании.</p><p>Агентство социальной информации вручит дипломы участникам, полностью прослушавшим курс «Школа корпоративной социальной ответственности».</p><p>Об организации: Агентство социальной информации (АСИ) – некоммерческая организация и независимое агентство. АСИ 21 год вносит вклад в повышение осведомленности общества о гражданских инициативах и деятельности НКО, развитие корпоративной ответственности и расширение межсекторного диалога. АСИ оказывает информационную поддержку социально значимым проектам, проводит просветительские кампании.</p>", 
    "end_date": null, 
    "title": "«Школа корпоративной социальной ответственности»", 
    "price": 0, 
    "instructors": "Виктория Подольская, Елена Тополева-Солдунова", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644824_f103.jpg", 
    "course_url": "https://www.udemy.com/kso_school/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T15:02:21Z"
}