{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ya hemos llegado a los 100 alumnos, ¡muchas gracias!<em></em></p><p><em>Para celebrarlo hemos acutalizado el curso añadiendo exámenes.</em></p><p>  \t      Cuando inicié mis estudios de Empresariales en 1998 me llamó mucho la atención la primera clase de economía que recibí. Allí se nos explicó que la teoría económica que nació con Smith está basada en individuos egoístas y racionales con información perfecta. Me pasé diez años en shock, buscando teorías que satisficiesen mejor mi impresión de la realidad, donde lainformación no es perfecta y ni la racionalidad ni el egoísmo de los individuos no se cumple como norma. Este trabajo es fruto de esa primera clase de economía.  </p>  Resumen  <p>  \t<strong>El presente curso consta de dos partes. En la primera se esboza un recorrido histórico a modo de resumen de la aproximación de distintos autores al pensamiento económico. Lo que nos dará una imagen del origen y fuerzas que motivan la hegemonía de la corriente neo-clásica en el mundo académico occidental.</strong>  </p>  <p>  \t<strong>La segunda parte se dedica a probar la imposibilidad de dar un cuerpo teórico como válido e invalidar otros. Se utilizarán conceptos epistemológicos y lógicos de Kuhn, Gödel y del pensamiento complejo de Morin. Además se repasa la utilidad y confiabilidad de la matematización de la economía, discutiéndose la diferencia entre las ciencias sociales y las naturales y la necesidad de establecer asignaturas de economía comparada.</strong>  </p>  <p>  \t<strong>También incluye un apéndice en el que se listan una serie de corrientes heterodoxas.</strong>  </p>", 
    "end_date": null, 
    "title": "¿por qué se equivocan los economistas?", 
    "price": 0, 
    "instructors": "Foli Centre d'Estudis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/281936_1476_5.jpg", 
    "course_url": "https://www.udemy.com/historia-del-pensamiento-economico/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-16T08:42:31Z"
}