{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Bu eğitim bilgisayarı hiç kullanmamış veya çok az kullanmış kişilere hitap etmektedir.</p><p>Özellikle internet üzerinde ihtiyaç olan blog yayını, eposta kullanımı ve en önemlisi kişisel güvenlik için bilinmesi gereken konulara yer verilmektedir.</p><p>Birinci bölüm, Temel bilgisayar bilgisini kapsamaktadır. Donanım, bilgisayar türleri, yazılımın ne olduğu ve işletim sisteminin anlamı ve çeşitlerini içermektedir.</p><p>İkinci bölüm, Internet içerisinde gezinti yapabilmek için gerekli olan tarayıcının nasıl kullanılacağı konularına yer verilmiştir. Aynı zamanda, internet nedir, web adresi nedir, web sayfası, birden çok web sayfası açmak gibi temel ihtiyaçlara yer verilmiştir.</p><p>Üçüncü bölüm, eposta göndermek, almak ve eposta ile ilgili bilinmesi gereken birçok temel bilgiyi içermektedır.</p><p>Dördüncü bölüm, Bu bölüm internet üzerinden bilgi paylaşmak isteyen kişiler iin blog hazırlanması, kullanılması ve yazıların yayınlanması gibi ihtiyaç olan konuları kapsamaktadır.</p>Beşinci bölüm ise, internet üzerinde en önemli konulardan olan kişisel güvenlik konusunu el almaktadır.<br><ul><li>Kişisel bilgilerin güvenliğini saplamak,</li><li>Internet tehlikelerine dikkat etmek</li><li>Sohbet ederken kişisel güvenliğin korunması</li><li>Bilgi paylaşımında nelere dikkat etmeliyim</li><li>Eposta daki tehlikeler ve korunma yolları</li><li>Sosyal ağların tehlikeleri</li><li>Bilgisayar başındaki zaman yönetimi</li></ul><p><span style=\"\">gibi konulara değinilmiştir.</span></p>", 
    "end_date": null, 
    "title": "Çocuklar için Pc", 
    "price": "20.00", 
    "instructors": "Ersin Sengul", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705036_05b4.jpg", 
    "course_url": "https://www.udemy.com/cocuklar-icin-pc/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T17:12:53Z"
}