{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t                    Καλώς ήλθατε στο πρώτο Μαζικό Ανοικτό Ηλεκτρονικό Μάθημα (MOOC - Massive Open Online Course) το οποίο προσφέρεται δωρεάν από το <strong style=\"\">Ιόνιο Πανεπιστήμιο </strong>με τίτλο <strong style=\"\">&quot;Διαδραστικά Πολυμέσα&quot;</strong>. Η ύλη βασίζεται στις σημειώσεις και τα βιβλία του Γιάννη Δεληγιάννη &quot;Κοινωνία της Πληροφορίας και ο Ρόλος των Διαδραστικών Πολυμέσων&quot; και &quot;Διαδραστικά Πολυμέσα και Ψηφιακή Τεχνολογία στις Τέχνες&quot;, Fagotto Books. Ο σχεδιασμός και η υλοποίηση των ροών πολυμέσων πραγματοποιήθηκε αποκλειστικά από φοιτητές του <strong style=\"\">Τμήματος Τεχνών Ήχου &amp; Εικόνας</strong> στο πλαίσιο πρακτικής άσκησης των μαθημάτων Διαδραστικά Πολυμέσα Ι &amp; ΙΙ του Τμήματος Τεχνών Ήχου &amp; Εικόνας κατά τα έτη 2014-2015. Το πρότυπο αυτό μάθημα προσφέρεται δωρεάν και θα χρησιμοποιηθεί ως βάση για τα μαθήματα MOOC που θα υλοποιούνται στο μέλλον από το Ιόνιο Πανεπιστήμιο.  </p>  <p>  \t                            Το μάθημα &quot;Διαδραστικά Πολυμέσα&quot; παρουσιάζουν η <strong style=\"\">Τζωρτζίνα Κοσμάτου</strong> και ο <strong style=\"\">Κωνσταντίνος Καρακώστας</strong>.  </p>  <p>  \t              Η ύλη αποτελείται από 4 θεματικές ενότητες: την &quot;Εισαγωγή στα Μέσα και τα Διαδραστικά Πολυμέσα&quot;, την &quot;Ψηφιακή Αναπαράσταση της Πληροφορίας&quot;, την &quot;Κωδικοποίηση, Συμπίεση και Μετάδοση Πληροφορίας&quot; και τέλος τα &quot;Διαδικτυακά Πολυμέσα και τον Τρόπο Λειτουργίας τους&quot;.  </p>  <p>  \t              Στόχος των ενοτήτων είναι η παρουσίαση των πιο σημαντικών στοιχείων των πολυμέσων όπως η έννοια της διάδρασης, η διαδικασία της επικοινωνίας και οι κυριότερες τεχνολογίες ανάπτυξης και διάδοσης διαδραστικών πληροφορικών συστημάτων. Εξετάζονται τεχνικές και πρότυπα που αφορούν στη συλλογή, κωδικοποίηση, αναπαράσταση και διάδραση με τις εκάστοτε ροές δεδομένων (κείμενο, ήχος, εικόνα, σχεδιοκίνηση, βίντεο). Τέλος, εξετάζονται χαρακτηριστικές τεχνικές κωδικοποίησης, συμπίεσης και διάδοσης του περιεχομένου.  </p>  <p>  \t                          Το μάθημα των &quot;Διαδραστικών Πολυμέσων&quot; έχει ως στόχο να εισαγάγει τους ενδιαφερόμενους στον κόσμο των πολυμέσων και να παρακινήσει το ενδιαφέρον τους για τον κόσμο της τέχνης και της δημιουργίας. Είναι ιδιαίτερα προτεινόμενο για όσους ενδιαφέρονται να ασχοληθούν με την τέχνη και τον συνδιασμό της με ψηφιακά μέσα, χωρίς να είναι απαραίτητες προηγούμενες γνώσεις πάνω στο αντικείμενο.  </p>  <p>  \t                                    Το μάθημα αποτελείται από 4 βιντεοδιαλέξεις, χωρισμένες σε ενότητες με συνολικό χρόνο 15 περίπου λεπτών η κάθε μία, και ο εκτιμώμενος χρόνος ολοκλήρωσης του μαθήματος είναι ανάμεσα στις μίαμιση έως δύο ώρες (συμπεριλαμβανομένου του χρόνου που απαιτείται για την απάντηση ορισμένων ερωτήσεων).  </p>  <p>  \t                          Ο εκπαιδευόμενος καλείται να παρακολουθήσει τις βιντεο-διαλέξεις  και να απαντήσει κατά τη διάρκεια της παρουσίασης, ερωτήσεις πάνω στην  ύλη, ώστε να ολοκληρώσει επιτυχώς όλες τις ενότητες.  </p>  <p>  \t            Θα ήθελα να ευχαριστήσω όλους τους φοιτητές που μας βοήθησαν για την παραγωγή αυτή, και  τα μέλη  του Εργαστηρίου Διαδραστικών Τεχνών <strong style=\"\">inArts</strong> για την συνεχή υποστήριξη τους.  </p><p style=\"\"><strong style=\"\">ΟΡΓΑΝΩΣΗ ΠΑΡΑΓΩΓΗΣ-ΣΚΗΝΟΘΕΣΙΑ:</strong></p><p style=\"\">ΑΡΓΥΡΗΣ ΖΑΧΟΣ, ΜΙΧΑΛΗΣ ΚΩΝΣΤΑΝΤΙΝΟΥ</p><p style=\"\"><strong style=\"\">ΜΟΝΤΑΖ:</strong></p><p style=\"\">ΑΡΓΥΡΗΣ ΖΑΧΟΣ, ΕΛΕΝΗ ΜΠΟΥΡΑ, ΡΟΒΕΝΑ ΣΕΛΕ, ΧΑΡΙΚΛΕΙΑ ΣΑΚΕΛΛΑΡΗ, ΚΩΝΣΤΑΝΤΙΝΟΣ ΚΑΡΑΚΩΣΤΑΣ ΠΑΠΑΧΡΗΣΤΟΣ, ΓΕΩΡΓΙΟΣ ΓΟΥΛΑΠΤΣΗΣ, ΕΥΑΓΓΕΛΟΣ ΚΑΡΑΠΕΤΣΑΣ</p><p style=\"\"><strong style=\"\">MOTION GRAPHICS:</strong></p><p style=\"\">ΜΙΧΑΛΗΣ ΚΩΝΣΤΑΝΤΙΝΟΥ, ΜΑΓΔΑ ΚΑΝΔΥΛΙΑΡΗ, ΙΩΑΝΝΑ ΣΕΤΤΑ, ΓΙΩΡΓΟΣ ΠΑΠΑΔΟΠΟΥΛΟΣ, ΓΙΩΡΓΟΣ ΠΑΠΑΔΟΠΟΥΛΟΣ, ΗΛΙΑΣ ΤΡΑΚΑΛΗΣ, ΦΙΛΙΠΠΟΣ ΜΙΣΤΡΙΩΡΗΣ, ΚΩΝΣΤΑΝΤΙΝΟΣ ΚΟΥΣΤΡΟΥΠΟΣ, ΑΡΗΣ ΚΑΡΑΓΙΑΝΝΗΣ, </p><p style=\"\"><span style=\"\"></span><strong style=\"\">ΗΧΟΛΗΨΙΑ - ΗΧΗΤΙΚΟΣ ΣΧΕΔΙΑΣΜΟΣ:</strong></p><p style=\"\">ΠΑΝΤΕΛΗΣ ΖΩΙΔΗΣ, ΚΩΝΣΤΑΝΤΙΝΟΣ ΚΑΛΕΜΟΣ, ΗΛΙΑΣ ΑΡΒΑΝΙΤΗΣ, ΔΗΜΗΤΡΗΣ ΤΕΛΚΕΡΙΔΗΣ, ΔΗΜΗΤΡΗΣ ΚΡΑΒΒΑΡΙΤΗΣ, ΔΗΜΗΤΡΗΣ ΓΕΛΗΝΙΩΤΗΣ, ΔΑΒΙΔ ΣΑΝΤΟΓΙΔΗΣ, ΜΑΡΓΑΡΙΤΑ ΠΑΠΠΑ, ΜΑΡΙΑ ΚΟΤΑΚΙΔΟΥ</p><p style=\"\"><strong style=\"\">ΣΕΝΑΡΙΟ - ΕΡΕΥΝΑ:</strong></p><p style=\"\">ΒΑΓΓΕΛΓΣ ΚΑΛΟΓΙΑΝΤΣΙΔΗΣ, ΗΡΩ ΜΙΝΤΟΥ, ΑΦΡΟΔΙΤΗ ΧΑΤΖΑΚΗ, ΚΩΣΤΑΣ ΜΥΛΩΝΑΣ, ΚΑΤΕΡΙΝΑ ΚΟΚΚΙΝΙΔΗ, ΒΑΣΙΛΙΚΗ ΓΚΡΙΝΖΤΟΥ, ΒΑΣΙΛΗΣ ΧΑΤΖΟΠΟΥΛΟΣ, ΗΡΩ ΓΕΩΡΓΙΟΥ, ΑΛΕΞΑΝΔΡΟΣ ΛΑΖΑΡΙΔΗΣ, ΜΑΓΔΑ ΠΟΛΙΤΗ, ΝΙΚΟΣ ΚΥΛΑΔΙΝΟΣ, ΚΑΤΕΡΙΝΑ ΚΟΥΛΟΥΡΗ, ΓΙΑΝΝΗΣ ΚΟΚΟΡΗΣ, ΓΙΩΡΓΟΣ ΜΠΟΥΖΙΩΤΗΣ, ΑΘΑΝΑΣΙΟΣ ΜΙΧΑΛΑΚΗΣ</p><p style=\"\"><strong style=\"\">ΠΑΡΑΓΩΓΗ:</strong> </p><p style=\"\">ΡΑΦΑΗΛ ΣΑΜΑΡΑΣ, ΝΙΚΟΛΑΟΣ ΜΟΤΣΙΟΠΟΥΛΟΣ, ΕΥΑΓΓΕΛΟΣ ΚΑΛΟΓΙΑΝΤΣΙΔΗΣ, ΣΠΥΡΙΔΟΥΛΑ ΠΕΤΟΒΙΤΣ, ΔΑΝΑΗ ΑΡΙΣΤΟΠΟΥΛΟΥ, ΒΑΣΙΛΚΑ ΤΟΝΤΟΡΟΒΑ, ΑΝΤΙΓΟΝΗ ΣΚΕΥΗ, ΑΙΚΑΤΕΡΙΝΗ ΤΖΕΚΟΥ</p><p style=\"\"><strong style=\"\">PROMO VIDEO:</strong></p><p style=\"\">ΘΕΟΔΩΡΟΣ ΓΕΩΡΓΑΚΑΚΗΣ, ΑΡΓΥΡΗΣ ΖΑΧΟΣ, ΕΛΕΝΑ ΓΕΩΡΓΙΑΔΟΥ<br style=\"\"></p><p style=\"\"><strong style=\"\">ΠΕΡΙΕΧΟΜΕΝΟ ΓΙΑ ΤΗΝ ΠΛΑΤΦΟΡΜΑ UDEMY</strong></p><p style=\"\">ΣΟΦΙΑ ΜΟΥΤΑΦΗ, ΓΙΩΡΓΟΣ ΧΑΤΖΕΛΛΗΣ</p><p style=\"\">Επίσης ένα μεγάλο ευχαριστώ στους φοιτητές με την καλύτερη ποιότητα εργασιών σε σχέση με το περιεχόμενο του MOOC:</p><p style=\"\">ΕΛΕΝΗ ΑΔΑΜΙΔΟΥ, ΧΡΥΣΑ ΟΙΚΟΝΟΜΙΔΟΥ, ΓΕΡΑΣΙΜΟΣ ΚΑΛΑΦΑΤΗΣ, ΚΛΕΟΝΙΚΗ ΠΑΡΡΗ.</p><p style=\"\">Τα δικαιώματα του περιεχομένου ανήκουν στο Ιόνιο Πανεπιστήμιο και στους συντελεστές του μαθήματος. Επιτρέπεται  η αναδημοσίευση με προϋπόθεση αναφοράς της πηγής.</p>", 
    "end_date": null, 
    "title": "ΔΙΑΔΡΑΣΤΙΚΑ ΠΟΛΥΜΕΣΑ  (Interactive Multimedia in Greek)", 
    "price": 0, 
    "instructors": "Ioannis Deliyiannis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370570_8446_4.jpg", 
    "course_url": "https://www.udemy.com/interactive-multimedia-in-greek/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T09:12:38Z"
}