{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t                     Курс о том, как быстро находить людей в Интернете. По имени и фамилии, по номеру телефона, по фотографии и т.д.  </p>  <p>  \t                    Форма курса - лекции и видеоуроки с пошаговыми инструкциями. Теоретические сведения рекомендуется превратить в практические навыки с помощью простых упражнений.  </p>  <p>  \t                     Продолжительность курса - 30-40 минут. Вы один раз менее, чем за 1час освоите приемы быстрого поиска людей в интернете и получите навыки, которые всю жизнь будут беречь Ваше время.  </p>  <p>  \t                    Навык быстрого поиска будет полезен и в деловых, и в личных отношениях.  </p>  <p>  \t  Upon completion of the course you will be able to find information stored on the Internet about a particular person in a few minutes. During this course you will learn how to quickly recognize a real person dealing or fictional. What is his reputation in the web, not a crook if he. With a negative result, you&#039;ll also &quot;win&quot; because will save time for further searches, making sure that with real data network he does not attend. During this course you once in less than 1 hour will master the quick search on the internet and people get the skills that will protect Your time. The course consists of four parts devoted to the search by name, phone number, e-mail address and a photo.  </p>", 
    "end_date": null, 
    "title": "Как БЫСТРО находить людей в Интернете", 
    "price": "20.00", 
    "instructors": "Поиск Быстро", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188568_ee41_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-people-on-the-web-quickly/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-25T16:51:35Z"
}