{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  В ходе освоения данного электронного курса Вы познакомитесь с технологий создания электронных учебников, используя различные программы. В первом разделе пойдет речь о программе российской компании «ГиперМетод» - eAuthor (электронный автор). Это простая программа, с помощью которой Вы сможете создать электронный учебник с мудьтимедийными возможностями. Другими словами, Вы можете добавить содержимое любого формата при создании электронного учебника. Электронный учебник eAuthor позволяет также создавать задания в тестовой форме различных типов – с выбором одного или нескольких ответов (множественный выбор), дополнения (ввод значения), соответствия, последовательности (упорядочивания), а также такой тип заданий в тестовой форме как классификация. Кроме того, Вы можете легко добавить глоссарий при создании электронного учебника.  </p>  <p>  \t  Во втором разделе Вы познакомитесь с электронным учебником CourseLab, точнее с его бесплатной версией 2.4. Эта программа также позволит Вам создать электронный учебник бесплатно без дополнительных профессиональных навыков программирования. В этом разделе подробно разбираются вопросы создания слайдов в электронном учебнике CourseLab, добавлении мультимедийных файлов, заданий в тестовой форме (множественного выбора, установления соответствия, последовательности, дополнения и т.д.).  Несомненное достоинство данной программы – использование логики программы PowerPoint, а также добавление программированных объектов.  </p>  <p>  \t  Изучение данного курса позволит Вам научиться создавать электронные учебники с помощью бесплатных программ.  </p>  <p>  \t  ---------------------------------------------------------------------  </p>  <p>  \t  During the development of this e-course you will learn about technologies create electronic books using a free program. The first section will talk about the program of the Russian company  «HyperMethod» - eAuthor . This is a simple program with which you can create an electronic textbook with multimedia capabilities. In other words, you can add content in any format for the creation of an electronic textbook. Electronic textbook eAuthor allows you to create different types of test - with a choice of one or more answers ( multiple choice), additions (input value), matching sequence ( sequencing ), as well as a type of tasks in the test form as classification. In addition, you can easily add a glossary to create an electronic book .  </p>  <p>  \t  In the second section, you will meet with an electronic textbook CourseLab, more precisely with its free version 2.4. This program also allows you to create free electronic textbook without additional programming skills. In this section, detail the issues of creating slides in electronic textbook CourseLab, adding multimedia files test (multiple choice , establish compliance , consistency , additions , etc.). Doubtless advantage of this program - the use of logic program PowerPoint, as well as adding programmed objects.  </p>  <p>  \t  The study of this course will enable you to learn how to create electronic books using free software.  </p>", 
    "end_date": null, 
    "title": "Создать электронный учебник (eAuthor & CourseLab)", 
    "price": 0, 
    "instructors": "преподаватель Сергей Золотухин", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208716_79b3_6.jpg", 
    "course_url": "https://www.udemy.com/eauthor-courselab/", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-01T14:26:37Z"
}