{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">هل سمعت عن مدونات البلوجر؟ يمكنك الآن ومجانا الحصول على الكورس العربي التخصصى الأول الذى يشرح كيفية عمل مدونات متميزة على بلوجر واستخدامها للدعاية لنفسك أو شركتك أو للحصول على عائد شهري</p><p style=\"\">إذا كنت تهوى التسويق الإلكتروني أو تحب العمل عبر الإنترنت وتريد مجالا متميزا يمكنك أن تبدع  فيه فإن التدوين ينبغى أن يكون على قمة أولوياتك نظرا لسهولته حيث يمكنك أن تبدأ العمل به من الغد بدون أى قيود</p><p style=\"\"><strong style=\"\">احترف العمل على مدونات البلوجر عمليا وتطبيقيا وليس نظريا</strong></p><p style=\"\">فى هذا الكورس سوف تتعرف على</p><ul style=\"\"><li style=\"\">كيف تستخدم خدمات جوجل المختلفة</li><li style=\"\">كيف تهيئ مدونتك لمحركات البحث بأسرع الطرق</li><li style=\"\">أهم الإحصائيات التى تعتمد عليها عند تسويق المدونة</li><li style=\"\">كيف تحدث قالب مدونتك وتعدل تصميمها في دقائق معدودة</li><li style=\"\">كيف تراعي العناصر الأساسية لنجاح مدونتك: المحتوى والتصميم والتسويق</li></ul><p style=\"\">نعم! يمكنك الآن أن تحترف مدونات البلوجر التى تستخدمها كبرى الشركات العالمية لإدارة مواقعها بفاعلية. كن واحدا من المتميزين وامتلك أقوى المدونات على شبكة الإنترنت مجانا<span style=\"\"></span></p><p style=\"\">أقدم هذا الكورس لك بطريقة عملية وتطبيقية 100% بحيث لا تتجاوز مدة كل محاضرة عدة دقائق حرصا على تحقيقك للاستفادة الكاملة من الكورس مع دعم فني ومتابعة مستمرة لضمان جودة تنفيذك لما يتم شرحه</p><p style=\"\">ينقسم الكورس إلى ثلاثة اقسام وكل قسم يحتوى على 5 إلى 6 محاضرات بحيث تركز كل محاضرة على شرح خطوة عملية واحدة بالتفصيل مما يساعدك على سرعة الوصول إلى المعلومة التى ترغب في إعادة مشاهدتها وبحيث لا تتجاوز مدة المحاضرة عدة دقائق</p><p style=\"\">في نهاية المستوى الأساسي من كورس &quot;احترف مدونات البلوجر&quot; سيكون لديك القدرة على انشاء مدونات قوية ذات محتوى قوي وتصميم جذاب وستكون لديك كافة الأساسيات التى تحتاجها لبدء عملك عبر شبكة الانترنت</p>", 
    "end_date": null, 
    "title": "احترف مدونات بلوجر المستوى الأساسي Blogger Marketing", 
    "price": "20.00", 
    "instructors": "Mohammed Fakhry", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560364_784b.jpg", 
    "course_url": "https://www.udemy.com/blogger-marketing-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T11:36:01Z"
}