{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<ul>  \t<li>دليل من الالف إلى الياء لتصميم لرسم واختبار الدوائر الإلكترونية، وذلك باستخدام واحد من البرامج الأكثر شعبية في صناعة الالكترونيات، وبعد هذه الدورة سوف تكون على درجة عالية من المهارة في صنع لوحة الدوائر الكهربائية الخاصة بك.</li>  \t<li>سوف تصبح محترف في صناعة الدوائر الإلكترونية الخاصة بك، سوف تكون قادرة على السيطرة على إنتاج أي دائرة الإلكترونية تجدها مفيدة.</li>  \t<li>تشمل المحاضرات الفيديو والنص جنبا إلى جنب مع مجموعة من البرامج التي سيتم استخدامها في هذه الدورة.</li>  \t<li>تبدأ الدورة مع تقديم تصميم الدوائر الإلكترونية ثم دروس للمبتدئين للسماح لك أن تصبح خبيرا، ثم في نهاية سنقوم بعمل الدائرة أكثر تقدما وجعلها جاهزا لانتاج كميات كبيرة بمهنية عالية.</li>  \t<li>كل ما تحتاجه لهذه الدورة هو كمبيوتر محمول وسماعات الرأس.</li>  \t<li>هذه الدورة مفتوحة للتعليقات واقتراحات.</li>  \t<li>لماذا يجب أن تأخذ هذه الدورة، أيضا، لأنك سوف تتعلم عن طريق العمل وليس عن طريق الاستماع، وسوف تصبح خبيرا في صنع الدوائر الخاصة بك.</li>  \t<li>الكورس يتكون بصورة اساسية من دروس فيديو متتابعة الهدف منها ايصال المعلومة بابسط الطرق واكثرها فعالية</li>  </ul>  <p>  \t<strong>    الاهداف الاساسية  </strong>  </p>  <ul>  \t<li>تحويل الدوائر الالكترونية من الرسم على الاوراق للتجربة والمحاكاة من خلال الحاسوب</li>  \t<li>رسم الدوائر الالكترونية بمهنية عالية</li>  \t<li>تجربة الدوائر الالكترونية قبل شراء القطع وتصنيعها</li>  \t<li>تصميم دائرة الكترونية بسيطة واخرى معقدة</li>  \t<li>تجهيز الدائرة الالكترونية للتصنيع النهائي</li>  \t<li>صناعة لوحة دوائر مطبوعة</li>  </ul>", 
    "end_date": null, 
    "title": "احترف تصميم محاكاة وتصنيع اللوحات الالكترونية باستخدام بروتس", 
    "price": "20.00", 
    "instructors": "Ashraf Al-Madhoun", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331394_9390.jpg", 
    "course_url": "https://www.udemy.com/masterelectronicscircuitdesignproteus8/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-30T06:03:43Z"
}