{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t                      هذا الكورس يقدم لك الطريقة الامثل للتعامل مع المتحكمات الدقيقة من نوع بيك ميكروكنترولر من خلال استخدام لغة البرمجة ميكروسي وبرنامج تصميم ومحاكاة الدوائر الالكترونية بروتس باحدث اصداراته  </p>  <p>  \t                      من خلال هذا الكورس ستكون قادر على التعامل مع شتى المدخلات والمخرجات وتنفيذ مشاريع برمجية بلغة ميكروسي وباستخدام برنامج بروتس في المحاكاة  </p>  <p>  \t<strong>                    ستتعرف في هذا الكورس على التالي  </strong>  </p>  <ul>  \t<li>ربط البيك مع المدخلات والمخرجات </li>  \t<li>التعامل مع شاشات عرض ال سي دي </li>  \t<li>التعامل مع الكي باد </li>  \t<li>التعامل مع المواتير</li>  \t<li>التعامل مع المفاتيح والليدات </li>  \t<li>التعامل مع المقاطعات </li>  \t<li>التعامل مع التحويل من تماثلي لرقمي</li>  \t<li>التعامل مع شاشات عرض سفن سيجمنت لعرض الارقام</li>  </ul>  <p>  \t            المواد التي يحتويها هذا الكورس تتضمن فيديوهات تشرح بصورة مفصلة كيفية تنصيب برامج بروتس وميكروسي بالاضافة لكيفية تفعيل برنامج بروتس من ثم الانتقال الى كيفية التعامل مع ميكروسي وكتابة كود وتحويله وربطه بالمتحكم من نوع  بيك في برنامج بروتس وعمل محاكاة للدائرة الخاصة بك من ثم يتم الانتقال الى مواضيع متقدمة مثل التحكم في المواتير وشاشات العرض وشاشات سفن سيجمنت والمواتير من نوع ستيبر موتور  </p>  <p>  \t            في ختام هذا الكورس ستحصل على شهادة انتهاء دورة معتمدة ورسمية يمكن طباعتها واستخدامها في سيرتك الذاتية  </p>  <p>  \t                  بالاضافة لانك ستكون قد اضفت لخبراتك العديد من الامور التي لابد من معرفتها حين التعامل مع المتحكمات الدقيقة  </p>  <p>  \t                هذه الدورة تعتبر الدورة الثانية بعد نجاح الدورة الاولى والتي شرحت فيها كيفية تصميم وتصنيع لوحات الدوائر المطبوعة باستخدام برنامج بروتس 8 بروفيشينال  </p>  <p>  \t        الهدف من طرح هكذا كورسات هو تقديم محتوى عربي نقي واثراء المحتوى الالكتروني والهندسي العربي وزيادة الوعي لدى الطلاب العرب وتمهيد الطريق لهم لتطوير مهاراتهم وقدراتهم ودعم عجلة التطوير من خلال تقديم محتوى عربي هادف بتطبيق عملي لمباديء نظرية والدخول في صلب المواضيع البرمجية وتحويلها لواقع عملي من خلال استخدام البرامج والمحاكاة ودفع الطلاب لتطوير مهاراتهم والانتقال الى مرحلة جديدة من خلال توفير المواد اللازمة لبدء فهم المتحكمات الدقيقة والتعامل معها  </p>  <p>  \t                يسعدني انضمامكم وفي حال وجود اي استفسارات يرجى التواصل معي  </p>  <p>  \t                مع تحياتي  </p>  <p>  \t                م.أشرف سعيد المدهون  </p>  <p>  \t    مهندس ميكاترونكس  </p>  <p>  \t    خبرة ثلاث سنوات في مجال الميكاترونكس واكثر من خمس سنوات في مجال الويب والتطوير  </p>  <p>  \t    امتلك موقعين ملكش حجة ، مهووسو التقنية الحديثة  </p>  <p>  \t    احاول من خلالهما نشر العلم بالمجان وتوفير محتوى عربي قادر على المنافسة وقادر على تطوير الاجيال  </p>", 
    "end_date": null, 
    "title": "برمجة ومحاكاة المتحكمات الدقيقة باستخدام بروتس وميكروسي", 
    "price": "20.00", 
    "instructors": "Ashraf Al-Madhoun", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375642_6f01_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-master-proteus-and-mikroc-pic-microcontroller-engasm89/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T15:26:32Z"
}