{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>近年、子供のプログラミング教育が注目されています。世界的には、ITの発展に伴う人材育成などのために、すでにプログラミング学習が義務化している国もいくつかあり、日本でも義務教育への導入が検討され始めています。</p>    <p>プログラミング知識そのものの習得以外に、プログラミング学習には、創造力、問題解決能力、協調性などが育成される効果も期待されています。</p>    <p>ところで、これまでプログラミングに直接関わる必要があったお母様やお父様、そして、学校の先生は、それほど多くはいらっしゃらないのではと思います。プログラミングとはほとんど無縁だった皆様は、きっと、こんなふうに思っているのではないでしょうか。</p>  <p>「プログラミングって、具体的に、どんなもの？？？」</p>    <p>このコースを受講したお母様やお父様は、プログラミングとは何かを理解した上でお子様のプログラミング教育の方針を検討できます。さらに、その検討によってお子様にプログラミング教育を受けさせることに決めて学習対象となるプログラミング言語にScratch（スクラッチ）を選んだなら、このコースを受講したお母様やお父様は家のPCに予習復習用の環境を用意することができ、さらに、お子様の疑問を一緒に調べることができます。</p>  <p>また、このコースはオンライン講座なので、忙しい学校の先生でも仕事の合間にご自身のペースで受講を進められ、通常の教務や校務を行ないながらプログラミング教育の準備を始めることができます。</p>    <p>このコースでは無償の子供向けプログラミング言語Scratchの</p>  <ul>  <li>PCへの設定方法</li>  <li>基本事項と簡単なプログラミング</li>  <li>コミュニティーサイト上の情報閲覧、作品発表・討論の場などの利用方法</li> </ul>  <p>の３つを学習します。</p>    <p>このコースは、身近な子供たちのプログラミング教育を検討したり支援したりするための道具としてお使いいただくために作りました。</p><p>したがって、プログラミング学習が目的の方の場合は、大人なら物足りず、子供ならプログラミング以外の要素が多過ぎると感じると思います。</p>    <p>今回このコースで扱うScratchは、マサチューセッツ工科大学（MIT）で8歳から16歳の子供のIT教育導入用に開発された無償のプログラミング言語ですが、大人でも子供でも誰でも使用を許可されていて、商用でも使用できます。米国の名門大学のコンピューターサイエンスの導入教育の言語などとしても使用されています。40以上の言語で150以上の国の人々から使用されていて、ユーザー登録数もすでに1千万人を超えている非常にポピュラーなプログラミング言語です。Scratchには子供の好奇心をそそる、可愛いくかっこいい組み込みのアイテムが豊富にあり、また、Scratchではドラッグアンドドロップ中心の簡単な操作でプログラミングができるので、あっというまに楽しくアニメーションのプログラムができ上がります。実際、多くの子供は、Scratchを使える環境があり簡単なルール（文法や起動／修了方法など）を覚えれば、大人が思いもよらないようなユニークなプログラムを短期間で作り上げます。</p><p>このページをご覧になったのを機会に、身近なお子様のプログラミング教育を考えてみませんか。</p><p>それでは、コースへのご参加をお待ちしています。</p>", 
    "end_date": null, 
    "title": "うちの子のためにうちのPCにScratchを準備しよう", 
    "price": "20.00", 
    "instructors": "西村 由加利", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597936_ec8e_3.jpg", 
    "course_url": "https://www.udemy.com/setupscratchforkids/", 
    "currency": "USD", 
    "subject_name": [
        "Other"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T05:16:53Z"
}