{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to this journey. </p><p><strong style=\"\">The technique in this course work for new google update. </strong></p><p>Your website will not make any money if you cannot get it rank on page 1 no matter how beautiful or how much content you have.<br style=\"\">If you want to make money. I am showing you a way to make money by being a amazon affiliate.<br style=\"\">Watch the Promo video.</p><p><strong style=\"\">To make money </strong><br style=\"\">1) You can setup a complex and beautiful website, invest lot of money and resources into it and take years to build your brand and profile <br style=\"\"><strong style=\"\">or </strong><br style=\"\">2) Make use of google free platform and setup a 1 page blogger website. Does it look unprofessional? No if you are promoting a amazon product and not promoting your own brand, it is just a simple blogger website. The advantage is google own blogger and google give priority to blogger when it come to ranking.</p><p>Setup a 1 page (nothing more than 1 page as you see in the demo)<br style=\"\">Create 4 backlink of web 2.0<br style=\"\">Sit back and wait for 1 week<br style=\"\">Check for ranking and watch your amazon income go up</p><p>Zero maintanence require, as long as the product you are promoting still got searches and still have stock you will generate commission.</p><p>Want to make more.<br style=\"\">Setup 100 blogger website. 1 website with all web 2.0 backlink take 1 week to setup (that is if you are working 1 hour a day) (when you get familar with it you will need only 30 mins a day or infact about 5 hours to setup the complete blog)</p><p><strong style=\"\">do this everyweek and by the end of 1 year you will have 52 blog earning you 52 amazon commission. Do it for 2 years and 3 years. </strong></p><p>I personal guranteeed you will never have to look for another job ever again</p><p><strong style=\"\">Enrol Now I will see you on the other side</strong></p>", 
    "end_date": null, 
    "title": "100 Single Page Mini Websites 100x Profit - Amazon Affiliate", 
    "price": "20.00", 
    "instructors": "Chris Lu", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606572_568c_6.jpg", 
    "course_url": "https://www.udemy.com/master-google-seo-rank-make-money-with-amazon-clickbank/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T01:58:50Z"
}