{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to the Udemy <strong> '101+ ways to Side Hustle' Course.</strong></p>\n\n<p>This course looks at over 101 proven ways you can make money Online. If you're thinking you could do with some extra cash then this course is for you. </p>\n\n\n\n<p>What would you do with the money? Buy a new car, clothes, jewellery, a new home, new furniture or go on a luxury vacation?</p>\n\n\n\n<p>I've spent hundreds of hours researching the methods in this course so that you don't have to.  This course is designed to<strong><em> make you richer</em></strong>. We will go through methods that can, if used correctly, make you seriously wealthy.</p>\n\n\n\n<ol><li>Join over 1000+ successful students taking and benefiting from this course.</li><li>Over 4 hours of content</li><li>Learn my secret, Income boosting methods.</li><li>Over 101 ways to earn great income online.</li><li>As a bonus, I will give you a complete, Google Adwords Business In A Box, included in the cost of the course. That's right, absolutely free with the course.</li><li>Lifelong access to this regularly updated course and contents. Last updated April 2016</li></ol>\n\n\n\n<p>I'm so confident that<strong><em> you WILL make money</em></strong> that I'm prepared to offer you a <em>full 30 day money-back guarantee</em> should you take action and the secret methods in this course not work for you. So the course comes with absolutely no-risk to you. If in the unlikely event you're unhappy, just ask for your money back.</p>\n\n\n\n<p>Also, you get to benefit from the<strong> fantastic Business In A Box I'm including in this course.</strong> This includes a 66 page training manual, cheat sheet, mind map , templates and more.</p>\n\n\n\n<p>Imagine a life where you get up in the morning, at a time of your choosing, post on social media and get paid for it. Then, venture out for a fantastic lunch with a friend, or your partner, which will cost you nothing!. </p>\n\n\n\n<p>After lunch, you return home and open the post, which could be bringing you your latest, fat commission check , or other fantastic news, on a free car, or, holiday or maybe some other freebie in recognition of your social media standing. </p>\n\n\n\n<p>In the afternoon you relax by listening to some music (knowing you're being paid for listening). </p>\n\n\n\n<p>You sit down to work for a couple of hours (I say work, but in reality you know you'll be either checking your bank balance or creating more income streams to enhance your burgeoning finances). </p>\n\n\n\n<p>Afterwards you could go out again for a free dinner, or maybe have an early night at a beautiful Hotel, which of course, doesn't cost you a penny. You fall asleep and whilst you're sleeping, you're earning more passive income. <strong><em>No, this is not a dream</em></strong>.  This course will show you how you can make this a reality! The cost of this course is tiny in comparison to the <strong><em>wealth you can generate </em></strong>from my trusted methods.</p>\n\n\n\n<p>This course offers you over a hundred ways to make money online. You don't have to spend hours searching for them as they're all here in the course.</p>\n\n\n\n<p>Here's a couple of reviews my Students wrote about this course: </p>\n\n\n\n<p><strong><em>5 Stars *****</em></strong></p>\n\n\n\n<p><strong><em>Awesome course!</em></strong></p>\n\n\n\n<p><strong><em>I highly recommend this course. Very knowledgeable instructor. Great content!</em></strong></p>\n\n\n\n<p><strong><em>----</em></strong></p>\n\n\n\n<p>by Ricardo Párraga, 8 days ago ·</p>\n\n\n\n<p><strong>Fantastic Course</strong> 5 Stars *****</p>\n\n\n\n<p>Great course full of tips and bonuses on how to create an online income. <strong>Recommended for people who want to know ways to make some extra cash.</strong></p>\n\n\n\n<p>Take their words for it and Join me today to help you create multiple income streams to increase your wealth. Every day you take no action is a day when you could've been earning loads of extra cash.</p>\n\n\n\n<p>I hope to see you Inside. </p>\n\n\n\n<p><em>Michael</em></p>\n\n\n\n<p><em>Course updated April 2016</em></p>", 
    "end_date": null, 
    "title": "101+ easy work from home strategies", 
    "price": "30.00", 
    "instructors": "Michael Ingram", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412420_e847.jpg", 
    "course_url": "https://www.udemy.com/create-multiple-online-income-streams/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T17:18:06Z"
}