{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    What is the power of passive income?  </p>  <p>  \t    Think of this course as <strong style=\"\">Passive Income - 101</strong>  </p>  <p>  \t    It's a primer on what passive income is, the benefits of passive income, the five best ways to create it, and what passive income is not.  </p>  <p>  \t    This is not a program for getting rich quick.  </p>  <p>  \t    Although it will introduce you to five of the best ways to create passive income, this course is more about <strong style=\"\">why creating passive income is so important</strong>, how to position yourself to attract it and how to use it to enhance your life.  </p>  <p>  \t    Having money is great, but how you<strong style=\"\"> design your lifestyle to attract and use that money </strong>is even more important.<strong style=\"\"> </strong>That's what this course is about.  </p>  <p>  \t    It includes:  </p>  <ul style=\"\">  \t<li>3 success strategies for creating passive income</li>  \t<li>3 critical mindsets for attracting passive income</li>  \t<li>2 dangerous pitfalls on the road to creating passive income</li>  \t<li>5 top ways to create passive income</li>  </ul>  <p>  \t    It also includes a <strong style=\"\">bonus section</strong> with tips on handling success once you achieve it and <strong style=\"\">coupons</strong> with huge discounts off of my Kindle Publishing course.  </p>  <p>  \t    I have been studying and experimenting with strategies for creating passive income for over 10 years. In that time I have not only learned about <strong style=\"\">how to actually create passive income</strong>. I have also learned how to evaluate the quality of that income.  </p>  <p>  \t    I have learned that the value that I give back in exchange for that income and the quality of life that income creates for me are as important, if not more important than the income itself.  </p>  <p>  \tWhether you are new to the idea of passive income or have been chasing it for years like I did, this course will guide you to a better understanding of how to attract it and how to use it to enhance the quality of your life.  </p>  <p>  \tThis course is being offered FREE for a limited time.  </p>  <p>  \t    Click on the <strong style=\"\">Take This Class</strong> button at the top of this page and start your journey today.  </p>", 
    "end_date": null, 
    "title": "5 Powerful Passive Business Ideas to Work from Home in 2016", 
    "price": "20.00", 
    "instructors": "Steve McDonald", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410522_8a36_2.jpg", 
    "course_url": "https://www.udemy.com/power-investments-for-the-present-and-the-future/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T04:54:53Z"
}