{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Have You Ever Been Frustrated Because You Know That Product Creation Is A Genius Business Strategy, But You're Just Not Sure Where To Start?</strong><br></p><p>If that's the case, you're going to love this course.</p><p>You're going to brainstorm 7 different product creation ideas that work even if you have absolutely ZERO experience.</p><p><strong>So, Ask Yourself How This Would Feel.</strong></p><p><strong></strong>How would it feel if you finally had the confidence and freedom, to start creating your own information products, even if the gurus and amateurs said that you don't have enough experience?</p><p>Have you ever been heartbroken to learn that only \"gurus\" and \"experts\" can teach others</p><p><strong>My Philosophy Is That Anyone Can Teach. Anyone Can Publish.</strong></p><p><strong></strong>That's why you might love this course. So you can study alongside me, someone who has thousands of students, and over 30 books published.</p><p>It wasn't always this way. Not too long ago, I was too shy to publish anything. So I literally bent over backwards, studying like my life was on the line to determine what type of content I could publish, that actually provided value to the live's of my end users.</p>\n\n\n\n<p>If any of this sounds good, then I honestly believe that you'll love this course.</p>\n\n\n\n<p>Thanks for reading, and I hope to see you on the inside!</p>\n\n\n\n<p><strong><em>Enroll Now So You Can Start Building Your Own Online Empire Using These 7 Simple Product Creation Ideas That Are Perfect For Newbies!</em></strong></p>", 
    "end_date": null, 
    "title": "7 Proven Product Creation Ideas For Newbies", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785802_a2b4_2.jpg", 
    "course_url": "https://www.udemy.com/7-proven-product-creation-ideas-for-newbies/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T06:40:44Z"
}