{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em style=\"\">Thank you so much Montina, for the great course!! You really simplified the process to making my first $1000 Online! Great and Valuable Content. You Rock!! :) ~Travis</em>  </p>  <p>  \t <strong style=\"\">THIS IS NOT A GET RICH QUICK SCHEME COURSE. IF YOU ARE LOOKING FOR A QUICK WAY TO MAKE MONEY ONLINE PLEASE DO NOT ENROLL. </strong>  </p>  <p>  \tI am the author of<strong style=\"\"> </strong>HOW TO MAKE MONEY ONLINE: How to Grow a Passive Income in 20 Simple Steps, HOW TO MAKE MONEY ONLINE: How to Build a Passive Income Stream Marketing Funnel and \"YouTube Video Marketing Secrets Revealed: The Beginners Guide to Online Video Marketing\" - what I teach works if you apply it.  </p>  <p>  \t      Many start with one and forget to diversify.  Having one stream is just like having one job.  Don't put all of your eggs in one basket!  </p>  <p>  \t     Topics include: Defining your vision, Identifying client needs, choosing a profitable niche, multiple streams of income and so much more.  </p>  <p>  \t           In this course you will discover 8 streams of income that you can build to get to your first $1000 online. Some are passive while others are active yet they all work.  </p>  <p>  \t           Building a multiple income stream is much different than going to work everyday and getting a guaranteed paycheck in 2 weeks. The only guarantees that come from passive income streams are the effort YOU put into building them.  </p>  <p>  \t           This course is for people that want to build multiple income streams and are willing to put in the work now to get the reward later. I know what it's like to build a 2nd and 3rd job and I don't want you to make that mistake. If you are interested in building multiple income streams  than this is the #1 course that I would suggest you go through FIRST.  </p>  <p>  \t <strong style=\"\">This course is for you if...</strong>  </p>  <p>  \t         - Starting and growing a business is your priority.  </p>  <p>  \t         - You want to be in business yet simply don't know where to start.  </p>  <p>  \t         - You want to discover how to make money online.  </p>  <p>  \t         - You have a passion to help people and have no idea how to start making money.  </p>  <p>  \t         - You're ready to push past fear, doubt and discouragement.  </p>  <p>  \t         - You want to achieve financial freedom  </p>  <p>  \t         - You're ready to go further, faster.  </p>  <p>  \t <strong style=\"\">This course is NOT for you if...</strong>  </p>  <p>  \t         - You don't want to make money online.  </p>  <p>  \t         - You aren't interested in financial freedom or generational wealth.  </p>  <p>  \t         - You don't plan to follow through with it.  </p>  <p>  \t         - You're looking for a \"get rich quick\" program or system to solve your financial problems.  </p>  <p>  \t         - You're not willing to do the work.  </p>", 
    "end_date": null, 
    "title": "8 Different Ways to Develop a Business Online", 
    "price": "20.00", 
    "instructors": "Montina Young Portis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/217868_9739_3.jpg", 
    "course_url": "https://www.udemy.com/develop-a-business-online/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-13T23:00:24Z"
}