{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tDon't you find it weird how we’re trained as little kids, all the way up to adulthood, how to take our hard earned money and buy up all the junk around us, <strong style=\"\">but you're never taught the skills you need to make money for yourself</strong>.  </p>  <p style=\"\">  \t<em style=\"\">Have you ever seen ads claiming you can make money online? </em>They're all over the place.  </p>  <p style=\"\">  \tYou hear about blogging, MLM, network marketing, affiliate marketing, amazon, eBay, google, work from home, and hundreds of other things that <em style=\"\">don't seem to make any sense</em>.  </p>  <p style=\"\">  \tA family member came home one day telling me about an ad she saw that claimed you can work from home.  </p>  <p style=\"\">  \tI asked , \"Well if you you're working what do you have to do? \"  </p>  <p style=\"\">  \tShe said,  \"I don't know exactly, but all you have to do is post links.\"  </p>  <p style=\"\">  \t\"What does it mean to post links?\"  </p>  <p style=\"\">  \t\"I don't know, but you have to pay to start and she will show you how to do it.\"  </p>  <p style=\"\">  \tRight. <strong style=\"\"><em style=\"\">Scam!</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\">And that's why I created this course.</strong>  </p>  <p style=\"\">  \tI created this course for you to know <strong style=\"\">exactly what making money online is about</strong>, so you can make money online, legitimately, <em style=\"\">doing something you like</em>, and so you can avoid the scams out there.  </p>  <p style=\"\">  \tImagine John. He works a job he doesn't like so much, has many interests outside of work, and is intrigued by the idea of doing something for himself.  </p>  <p style=\"\">  \tBeing his own boss.  </p>  <p style=\"\">  \tHe wants to start making money online doing something he likes with the possibilities of making it a full time business.  </p>  <p style=\"\">  \tPicture Sue. She has a daughter, and with all the bills, she's been doing some Google searching. She sees all these ads about working from home but some of them seem really scammy. She's not sure what it's all about.  </p>  <p style=\"\">  \tShe wants to learn how to make some extra money online to support her family.<br style=\"\">  </p>  <p style=\"\">  \tThis course will help them and <strong style=\"\">you</strong> discover what making money online is all about.  </p>  <p style=\"\">  \tBy the end of this course you'll have a clear answer to how you’re going to make money online.  </p>  <p style=\"\">  \tYou’ll be able to say:  </p>  <p style=\"\">  \t<strong style=\"\">I’m going to start making money online doing XYZ and you’ll know where and how to start. </strong>  </p>  <p style=\"\">  \tI’m going to <em style=\"\">demystify</em> all the vaguness behind making money online.  </p>  <p style=\"\">  \tYou'll become a moneymaking guru by understanding the landscape, vernacular and strategies of making money online.  </p>  <p style=\"\">  \tMore importantly, this course is going to give you deep insight into how people make money online that seems mysterious and show you how you can practice the same strategies using your own skills and talents.  </p>  <p style=\"\">  \tWe're really going to dive <em style=\"\">deep</em>.  </p>  <p style=\"\">  \tIn this course you'll learn:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">How to actually make money online the real way</strong> if you have no major budget or experience or no product or service.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\"><strong style=\"\">Why our minds are not programmed to understand money</strong> and what you have to do about it. In module 1, you'll receive a solid moneymaking education so you can learn to make money anytime, and any place, something most make money courses never teach you. This is worth several classes on economics at your local university.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">How to never beg and borrow from others, but <strong style=\"\">get people to actually pay you real money for what you’re worth</strong>. <br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\"><strong style=\"\">How to instantly tell the difference between a scam and a real moneymaking opportunity</strong>. Plus I'll tell you a few stories on how I got scammed a few times. These will save you months of wasted time with people who have a bag of tricks up their sleeve.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">You're going to know what the <strong style=\"\">affiliate and network marketing</strong> craze is all about and how to make money that way if you choose, but I'll also be talking about many more opportunities for you.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">I'm going to help you <strong style=\"\">discover what you like and match it with a way to make money</strong>. This module alone can save you 2 years of sitting around trying to figure out what you should do in life.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">We're going to catapult your moneymaking skills through the roof by<strong style=\"\"> understanding the 3 pillar system that runs every real moneymaking venture in the world</strong>. I'm going to show you how if you put this system in place you can make $300 with good research, effort and a few hours. How fast you grow will depend on how much up front time and capital you have to invest in yourself.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">I'm going to give you some <strong style=\"\">Solid money making ideas that are real and relevant to you</strong> and your personal interests you can start implementing tomorrow.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">Finally <strong style=\"\">you'll learn about all the online tools you need to get started making money</strong> at your own pace such as how to get customers online, market your ideas, open up an E-commerce store for cheap and even get products from China for pennies.<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">You'll even <strong style=\"\">learn how to build a cool looking website</strong> without knowing code on the amazing Wordpress platform. <br style=\"\">  \t<br style=\"\">  \tThe Wordpress training alone is worth more than the cost of this entire course.</li>  </ul>  <p style=\"\">  \tYou'll be one giant step ahead of most of your peers and even some people who already run business. Keep in mind, your own results will vary depending on your circumstances, effort, skills, talent, persistance, etc, but you will have the thorough moneymaking know how that most of us never learn.  </p>  <p style=\"\">  \tSo what are you waiting for, go ahead and let's learn about making money online, the real way.  </p>  <p style=\"\">  \tAll videos are in High Definition, crisp and clear, even at Fullscreen, including crisp Audio.  </p>  <p style=\"\">  \t<strong style=\"\">P.S. </strong>If you're looking for a bag of tricks, this course isn't for you. If you want to learn the principles behind how you can make money online wherever you are, in any economy, through whichever direction you feel the most comfortable with then this is for you.  </p>  <p style=\"\">  \t<strong style=\"\">Click the green button that says \"Take This Course\" and I'll see you on the inside.</strong>  </p>", 
    "end_date": null, 
    "title": "A Beginner's Guide to Starting Your Own Online Business", 
    "price": "20.00", 
    "instructors": "Omar Elbaga", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50145_1243_8.jpg", 
    "course_url": "https://www.udemy.com/beginner-guide-to-starting-your-own-online-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-17T01:22:48Z"
}