{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Step By Step Multi Media Course Shows You How I made My </strong><strong>First $10,000 Online From Home…… Starting From Scratch</strong></p>          <p>Hi, I'm Alex Addo and what I'm about to show you is the same system I used to make my first $10,000 online...starting from scratch…<strong>with NO list, NO contacts, and NO help from anyone.</strong></p>    <p><strong>The secret to making big money online is to leverage the assets of other people.</strong> And in the next few minutes, I'm going to show you how to get thousands of people to send you traffic and build your list for free!</p>  <p>But first, I need you to answer one question, \"Have you worked hard at this Internet thing, but nothing ever seems to come from it?\"</p>  <p>Most people fail to make money online because they try to do all the work themselves. When a much smarter strategy is to set up a sales system and get other people to drive the traffic for you!</p>    <p><strong>And the most effective way to do this, is to sell a low-priced, high-quality product and get affiliates to promote your offer and build your list for you!</strong></p>  <p>But the difficult part is putting all the little pieces together to make it work...</p>    <p>And that’s why I’ve documented the entire process and compiled all the tools you need, <strong>so you can profit from everything I've done</strong>, without going through the painful learning curve and wasting time and money trying to figure it out yourself...</p>      <p><strong>“Work From Home- How I Made My First $10,000 Online”</strong> is my new, <u>multi-media</u> course where I show you how to create and launch a product in <u>just 7 days</u>!</p>  <p>You get to watch over my shoulder as I create a product, get new graphics, write a sales letter, set up an affiliate program, write promo emails, and set up the entire sales system in 7 days.</p>    <p><strong>I will show you how to build a list and make your first $10,000 online </strong></p>    <p><strong>\"Watch Over My Shoulder as I Show You, Step by Step, How to Make Your First $10,000 Online and Get Other People to Send You Traffic and Build Your List!\"</strong></p>    <p><strong>This course covers everything in great detail.</strong> <u>Nothing</u> is left out and no matter what level of experience you're at right now, you will quickly become a \"marketing machine\" in no time flat.</p>  <p>Each lesson is presented in multiple formats that can be played on multiple devices. This means you can learn in the car, on the train, in the air, walking the dog... anywhere.</p>      <p><strong>Here's what you're about to discover:</strong></p>  <p><strong></strong></p>  <ul><li><strong>How to produce a high-quality, hot-selling product in 24 hours or less</strong> without creating any of the content yourself...</li><li><strong>My 7-step system for writing sales letters that SELL</strong> – anyone can do this...just open the template and follow along as I walk you through the steps...</li><li><strong>The secret to building a huge list of <u>repeat buyers</u></strong> and a certain type of marketer who'll buy everything you sell!</li><li><strong>keys to getting <u>maximum response</u> from your emails </strong>– you'll get <u>more clicks</u> and <u>more sales</u> from the same number of subscribers!</li><li><strong>How to create an irresistible affiliate offer</strong> – your affiliates will <em>pummel their lists</em> to promote your products!</li><li><strong>How to create copy-and-paste affiliate tools </strong>and a cool trick for sending swipe copy to your affiliates that's customized with their affiliate ID!</li></ul>  <p><strong></strong></p>    <p><strong></strong></p>    <p><strong></strong></p>    <p><strong></strong></p>    <p><strong></strong></p>            <p><strong>Once you master my system for creating simple info products and getting other people to promote them, you can build a massive list and make money on autopilot!</strong></p>", 
    "end_date": null, 
    "title": "A Beginners Guide To Creating Your First Online Business", 
    "price": "20.00", 
    "instructors": "Alex Addo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593886_c0e4_2.jpg", 
    "course_url": "https://www.udemy.com/work-from-home-how-i-made-my-first-10000-online/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T11:03:12Z"
}