{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If I taught you how to build a website, I wouldn't be doing you any favors. There are nearly 1 billion active websites on the internet as we speak. </p>\n\n<p>What are the chances that someone is going to visit your website? You have a better chance of winning the lottery.</p>\n\n<p>If I taught you how to build a website, like everyone else does, then what could you do with it? <br>Probably not as much as you had hoped because all of those other teachers out there didn't set you up for success. <br>They completely leaped over the building block skills that you should have before you even start to think about a website.. <br>and they stopped as soon as that website was built, leaving you with the hope that \"If you build it, they will come\". Then they didn't.</p>\n\n\n\n<p>I've been making money online now for 7 years and I recently decided I was going to start teaching others how to do it. <br>So like any venture you decide to get in to, you need to do your research and find out where you can break through. <br>I was AMAZED, about how disappointed I was, with what I found. <br>Most of the material on \"How to Make Money Online\" is so out of date it's hardly useful at all and because of that, there are many unfortunate people out there disappointed and probably blaming themselves for not being able to get to where they were built up to believe they could. </p>\n\n\n\n<p>Here's what I know, you don't want build a website. You want to build something you can be proud of, passionate about, and make money while you're doing it.<br>Because doing anything other than what makes you happy, isn't living, it's only surviving.</p>\n\n\n\n<p>You only need three things to make that happen.</p>\n\n\n\n<p>1. Know your goal.<br>I thought mine was playing games, that is how I started out, but as we learn, and as we grow, we change. <br>We evolve into someone so much better. I am not the same person, I am so much better.<br>Jim Rohn is an entrepreneur and he said <br>\"Successful people do what unsuccessful people are not willing to do. <br>Don't wish it were easier; wish you were better. <br>Don't wish for less problems; wish for more skills. <br>Don't wish for less challenge; wish for more wisdom.\"</p>\n\n\n\n<p>2. Knowledge Foundation - It's the more you know. When you're informed and you have all your faculties about you, you are unstoppable.<br>Nearly any obstacle that stands in your way, you will find a way around it, under it, over it, and always get through it.<br>I have to say nearly because it's inevitable that there will be failures, some ideas just don't work out, but that doesn't have to end you.<br>\"Success is not final; Failure in not fatal, it's the courage to continue, that counts\" ~ Winston Churchill</p>\n\n\n\n<p>3. Community - This isn't a one-sided conversation. When you join this course, you are joining a community of people that have the same goal. <br>We all want to be better and we're going to make it happen.<br>\"Never believe that a few caring people can't change the world. For, indeed, that's all who ever have.\" ~ Margaret Mead</p>\n\n\n\n<p>You're not going to walk away from this thinking it's another broken promise.</p>", 
    "end_date": null, 
    "title": "A True Beginner's Guide to Making Money Online", 
    "price": "50.00", 
    "instructors": "Carlton Bryant", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/853118_16ee.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-on-how-to-make-money-online/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-18T14:56:52Z"
}