{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t       Amazon.com provides two main ways to make a very good living from home online. First is as an Amazon Associate selling their products from you affiliate sites. Second is becoming an Amazon Kindle author and publisher while selling your ebooks directly on Amazon&#039;s website which gets massive traffic from all over the world.  </p>  <p style=\"\">  \t       In this course I&#039;m going to teach you how to master both of these methods from beginning to end, including domains, hosting, wordpress, and plugin installation.  </p>  <p style=\"\">  \t       Though it is focused on beginner to intermediate I believe there are hidden gems in this course for anyone interested in making money with Amazon as an affiliate or publisher.  </p>  <p style=\"\">  \t     My course is split into four main parts that breaks down into twelve sections, thirty seven lectures, twenty seven quizzes, and just under three hours of video training content.  </p>  <p style=\"\">  \t     Part One: &quot;Amazon Money Maker&quot; = Three sections and ten lectures.  </p>  <p style=\"\">  \t     Part Two: &quot;Amazon + Facebook = $$$$&quot; =Three sections and nine lectures.  </p>  <p style=\"\">  \t     Part Three: &quot;Amazon Autopilot Traffic&quot; =Three sections and nine lectures.  </p>  <p style=\"\">  \t     Part Four: &quot;Amazon Kindle Bestseller&quot; = Three sections and nine lectures.  </p>  <p style=\"\">  \t     The course is structured this way to make it very easy to follow and every section contains actionable steps to take to start making money with Amazon right away.  </p>  <p style=\"\">  \t     There are a lot of downloadable materials included with this course; including videos, PDF&#039;s, and plugins that will help your Amazon affiliate site immensely.  </p>  <p style=\"\">  \t     I feel this course training is of great value and with a price point of a dollar per lecture I know you will too. Stay Tuned For Future Courses.  </p>", 
    "end_date": null, 
    "title": "A-Z Amazon Profits Blueprint", 
    "price": "20.00", 
    "instructors": "Barry North", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/211988_5ba5_10.jpg", 
    "course_url": "https://www.udemy.com/amazon-kindle-publish-to-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-07T02:12:33Z"
}