{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>  \t      You need online learners to enroll in your course and you need them NOW! Learning to effectively market Udemy courses is key to achieving financial success. With thousands of other instructors and some trying to sell the same course as you are, you need a competitive advantage. Optimizing a course for both Udemy onsite marketplace search as well as Google, Yahoo and Bing rankings can push you well-past competitors and fast!  </p>  <p>  \t            Getting your course to top search results on Udemy as well as search engines such as Google, Yahoo and Bing will have has the following benefits;  </p>  <ol>  \t<li>Brand exposure to buyers searching (by keyword) for specific, online learning opportunities</li>  \t<li>Beating out other instructors, with the same courses, for top placements</li>  \t<li>Dramatically increasing students enrollment counts and profits</li>  \t<li>Page #1 course rankings on Udemy's Marketplace</li>  \t<li>Page #1 search rankings on Google, Yahoo and Bing</li>  </ol>  <p>  \t            Core to success for online instructors is building a student base. With this comes financial success!  </p>  <p>  \t            Join us today and begin the process of optimizing each area of your course and strategically placing them where the real money is - HIGH SEARCH RANKINGS!  </p>", 
    "end_date": null, 
    "title": "Achieve Udemy Success with Course Marketing - Unofficial", 
    "price": "20.00", 
    "instructors": "Brian Dale", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65326_7880_7.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-seo-for-instructors/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-13T22:39:52Z"
}