{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do you want make up to $3000 every month by working few hours a day - If yes This course is for you, you will learn my secrets of design logo in 2 minutes and getting paid up to $990, Just retouching logo designs can make you more money by working few hours a day- what are you waiting for enroll now.</strong><strong></strong><br></p><p><strong>You Don't have to be a designer or design skills are not required this course for beginners.</strong><br></p><p>IN this course you will learn my secrets of professional logo design in just 2 minutes with out any skills required to this. you will learn my secret of getting logo design jobs worth up to $990 for every single logo designs just retouch.</p><p>At the end of this course, you'll be able to create PROFESSIONAL looking graphics for your home business... in 2 minutes, just like a professional logo designer. You'll quickly become the master of creating images for your own home business that'll make your customers love sticking around you.</p><p>You Don't have to be a designer or design skills are not required this course for beginners.</p><p>IN this course you will learn my secrets of professional logo design in just 2 minutes with out any skills required to this. <strong>you will learn my secret of getting logo design jobs worth up to $990 for every single logo designs </strong>  </p><p>Just retouching logo designs in few minutes  you can make up to $200 for every design you make.<br></p><p><em><strong>\"GOOD INSTRUCTIONS FROM GOOD INSTRUCTOR WILL KEEP YOU AWAY FROM DANGER\"</strong></em></p><p><em><strong>WE GUARANTEE ON OUR COURSES FROM DAY ONE YOU WILL SEE RESULTS.</strong></em></p><p>I screen record my entire secret methods of this Enroll now</p><p>and </p><p>Change your life style.</p><p>I waiting for you to be succeed in life.</p><p>Thank you</p>", 
    "end_date": null, 
    "title": "Adobe Illustrator for Beginners: Retouching Logo Designs", 
    "price": "20.00", 
    "instructors": "Ankam Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542140_4838_3.jpg", 
    "course_url": "https://www.udemy.com/adobe-illustrator-for-beginners-retouching-logo-designs/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T11:26:40Z"
}