{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong>Updated for 2016! </strong></p><p>Join the course to see step by step how I made over $1,000 in my first month as an Affiliate for Udemy. </p><p>You already have what it takes to succeed. You have a desire to try, and you are determined to make things work.</p><p>Now all that is left standing between you and your dream of making money with Udemy is getting the advice and guidance that you need to get you into the action!</p><p>If that is what you're looking for – something that can help you to gain a breakthrough in successfully making money as an Affiliate for Udemy – you've put yourself in the right place!</p><p>Join the course today! No prior web experience is needed, and best of all, this course isn't just for Americans, it works worldwide!  </p><p>Inside the course I show you step by step how I went from just signing up as an affiliate for Udemy to finding courses to promote, choosing your niche, getting free traffic without the use of complicated SEO, and how I made over $1,000 my very first month and become one of Udemy's top affiliates.</p><p>In the course you get access to my uncensored dashboard where I show you exactly which courses I promoted, the traffic source, and even how much I made from each sale. This allows you to easily replicate my success and not waste time.</p><p>I even share some of my own personal affiliate links with you inside the course so not only can I get credit for referring you to some of the products and services that I personally use, but so you can see first hand how to recommend affiliate products and courses in an earnest way that is truly a win/win for everyone involved! </p><p>Join the course and hope see you inside! This course may be exactly what you need to build a profitable online business that you can run from your laptop like it has for me and hundreds of other students!</p>", 
    "end_date": null, 
    "title": "Affiliate Marketing for Courses: The Success Secrets!", 
    "price": "40.00", 
    "instructors": "Johnny FD Jen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648736_6a28_7.jpg", 
    "course_url": "https://www.udemy.com/affliate-marketing-for-courses-the-secrets-success/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T10:26:01Z"
}