{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>One Hour To Affiliate Marketing Profits $$</strong></p><p>Join over 1100 other eager students taking this course and I will show you step-by-step in just an hour, how to make a start in the world of Affiliate Marketing. This is the same system I used to make hundreds of dollars in Affiliate Sales in just the first 24 hours of this year alone and the sales still come flooding in.</p><p>You've probably seen videos or products from Millionaires showing you how to make money on-line. They live in the biggest Mansions and drive cars like Ferraris and Lambourghinis or one of the other top-end Sports Cars. Their products proclaim how if you buy them then you can earn money over-night and join them in the Jet-set lifestyle.</p><p>The truth is a lot of the Millionaires you see on You Tube and elsewhere make their money through selling Affiliate products (products that aren't theirs, but they get a commission for selling).</p><p>This course will take just over an hour of your time, but, will teach you my successful Affiliate Marketing  system and how you can start making money from it.</p><p>It's produced in 24 easy-to-follow lectures and anyone who takes the necessary action can make money-on-line. If you follow the instructions in the course and apply what's being taught, then there is no reason why you cannot be making money almost immediately.</p><p>Enrol today and you will get life-time access to both the course and the frequent updates bringing you the latest innovations in the Affiliate Marketing World..</p><p>What's also great is that I offer you a full 30 day money back guarantee should the course not help you make affiliate sales.</p><p>The only certainty is if you do nothing you'll never succeed. </p><p>See you in the course.</p><p>Mike</p><p>Course Updated March 201</p>", 
    "end_date": null, 
    "title": "Affiliate Marketing: Affiliate Marketing Training", 
    "price": "20.00", 
    "instructors": "Michael Ingram", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516464_caad_3.jpg", 
    "course_url": "https://www.udemy.com/passive-income-from-affiliate-marketing-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T00:08:17Z"
}