{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you love the idea of <strong>making money publishing eBooks on Amazon Kindle</strong> but hate the idea of marketing, this course is for you.  I have published over 115 kindle books, and in this course I'll show you exactly how I did it and how <strong>I make hundreds of dollars a month</strong>. I have made <strong>over $43,000 to date.</strong></p>\n\n<p>  \t      Here's what students are saying about the course:  </p>\n\n<p> <strong><em>\"A direct and honest how-to for self-publishing - </em></strong><em>Steve provides complete coverage of the course and helps his students understand all of the help and resources that are available to accomplish your goals of self-publishing. He updates content regularly and is very responsive to his students.\" </em><em>   - </em><em>Cindy Holtom</em></p>\n\n<p><em> <strong>\"Everything you need to know - </strong>This course covers everything you need to get started. Steve is very generous in giving away the secrets to his system. Thanks Steve.\"    - JB Marwood</em></p>\n\n<p>  \t<em>\"...</em><em>I don't have time to sit through hours or even minutes of 'fluff' until  the main meal is served. <strong>Steve cut right through to the meat and  potatoes</strong> and shared his<strong> </strong>special ingredients for<strong> </strong>profiting with Kindle  eBooks. <em>I am so excited! I've already created my book template, signed up on KDP, and currently seeking the most active key words and most profitable search terms for <strong>my first book</strong>. <strong>Great stuff! </strong>Thanks Steve!</em>\"<strong> </strong></em>   <em> - Mike Schoebinger</em><em><strong></strong></em></p>\n\n<p> <strong><em>\"An awesome Kindle course on Udemy - </em></strong><em>Steve's Kindle course is simple and easy to follow. He is also prompt to answer every questions I have along the way. <strong></strong>I am sure that <strong></strong>if I follow everything the instructor outlined in this course,<strong> I will make $1500 a month.</strong> Well done. Highly recommended.\"    </em><em>- Korn Won</em></p>\n\n<p>  \t<em>\"<strong>Every Step from Start to Published, Paid Success!</strong> - Instructor Steve McDonald shows exactly how much revenue he's generated with his collection of ebooks on kindle. He shows how to find the topic, create the content, use a Word template, and outsource the writing and cover illustrations. <strong>He also gives a live demo of exactly how to publish your ebook</strong> in kindle and how to hire a writer on elance. Also, <strong>I loved the free template</strong>. I've written several ebooks but now with this system, I can really ramp it up and create more products, faster. Thank you Steve for shining the light on the path to financial freedom by </em><strong><em>doing what I love -- publishing books!    </em></strong><em> - Penelope Gold</em><strong><em></em></strong></p>\n\n<p>  \t                    ----------------------------------------------------------------------------------------------  </p>\n\n<p>  \t          Welcome to my course on <em>Amazon Kindle eBook Publishing</em></p>\n\n<p>  \t          I'm Steve McDonald.  </p>\n\n<p>  \t          I earn hundreds of dollars every month from eBooks. The best part is, this income is completely passive. Once the books are published, I don't have to do a thing. I could go surfing in Costa Rica for two months and not touch a computer the whole time and my eBooks would still be bringing in the money.  </p>\n\n<p>  \t                        Right now is an amazing time to <strong>make great money publishing and selling eBooks</strong>! Anyone can do it and that includes YOU!  </p>\n\n<p>  \t                        In this course I'll teach you a program that I have created from scratch for publishing and selling kindle books<strong></strong>. I'll walk you through the whole process, from coming up with a subject for your bookbook to writing your first eBook, to creating a great cover for under $10 or even FREE, to clicking the publish button and <strong>making money</strong>.  </p>\n\n<p>  \t<strong>I have published over 115 eBooks</strong> in the last 3 years.  </p>\n\n<p>  \t<em>You can see a list of them on Amazon by going to Amazon, then clicking on Wishlists &gt; Find Someone's Wishlist &gt; and search for Steve McDonald. You will see a lot of search results. Mine is the list called \"Steve's List of Published Books\". You can click on the free preview of any of those books and you'll see that they all say \"Copyright (the year) Stephen McDonald\". </em>  </p>\n\n<p>  \t          My name is on the copyright page because I published all of those books and I own the full rights to those books. Most of them I have published under the original author's name (I'll explain why I do that and the benefits of that strategy in the course).  </p>\n\n<p>  \t  Owning the copyrights to the books means<strong> I receive all of the continuing income from every one of those books</strong>. The authors are happy because they get recognition for writing the book AND I pay them up front to write it.  (In the course I'll show you how I've created an eBook passive income snowball so that I can pay writers using only the profits from other eBooks with <strong>little to no money out of my own pocket!</strong>)  </p>\n\n<p>  \t  The eBook passive income snowball is how I was able to publish over 115 eBooks and reach the level of success that I'm enjoying now. </p>\n\n<p>  \t  Imagine a tiny little snowball in your hand. It doesn't seem like much at first, but then you set it down in the snow and you roll it a little. Suddenly it's twice the original size. You roll it a little more and it gets bigger and bigger until you have a huge snowball. That's what I'm going to teach you how to do with eBooks in this course.  </p>\n\n<p>  \t  Sound difficult? It's not as difficult as you think, but the first book is always the hardest, and that's why <strong>this course will walk you step by step through creating it</strong>.  </p>\n\n<p>  \tI already have students who have published their first, second and many more eBooks on Amazon Kindle and are <strong>making money </strong>from them.  </p>\n\n<p>  \t              Here's what you can expect from this course:  </p>\n\n<ul>  \t<li>The eBook publishing process I'll teach you is fun, fulfilling and profitable. </li>  \t<li>It is a process you can feel great about doing because you are adding value to the world.</li>  \t  \t<li>Your mother would approve of all of the practices in this course. Many passive income generating systems involve trying to cheat the system or \"get away with something\". I don't encourage you to follow any practices that are against a company's terms of service, are unethical, or would in any other way keep my own mother from being anything less than proud.</li><li>You can repeat the process as many times as you want to create and publish more and more Kindle eBooks and more and more passive income.</li><li>This course is like a balun to get you from beginner to expert in no time.</li>  \t<li>I'll show you how to write useful books about a subject that you know and then grow your profits by hiring other writers to write more books for you about subjects that they know.</li>  \t<li>You can start creating and publishing eBooks today, even if you have no extra money to spend.</li>  \t<li>If you do have money to invest in your writers, you can fast forward your progress. I'll show you how to leverage it to produce a whole collection of income generating eBooks in no time.</li><li>I'll even share some simple marketing strategies with you that are easy to do and don't require any sales or social media skills.</li>  </ul>\n\n<p>  \t  It's as simple as that!  </p>\n\n<p>  \t                                  This course will short-cut all of the trial and error for you so you can get straight to creating passive income by publishing eBooks.  </p>\n\n<p>  \t                The other awesome thing is that there is no maintenance and no marketing. You'll have no products to ship, no emails piling up, no customer inquiries to answer. You can earn money in your sleep, on the weekends and even while you're on vacation.  </p>\n\n<p>  \t                          If that isn't enough, the course comes with a <strong>Full 30-day money back guarantee</strong>, so if you aren't totally blown away by the content in this course I'll happily give you a full refund. You have nothing to lose.  </p>\n\n<p>  \t                        If you follow the simple process I teach you in this course, you'll pay for the course with your profits and be making extra income from your Kindle eBooks in no time. If not, you can get a full refund within the 30 days. You have nothing to lose and only financial freedom to gain.  </p>\n\n<p>  \t                        The course also includes <strong>2</strong><strong> FREE BONUS pre-formatted Kindle eBook templates</strong> in Microsoft Word (and now in Open Office too!) so you can plug your book into the template, click a few buttons and upload it directly to Kindle Direct Publishing. This template makes writing and publishing eBooks so easy. It will <strong>save you tons of time</strong> on each and every book you publish, and as I'm sure you know, your <strong>time is your most valuable asset</strong>.  </p>\n\n<p>  \t                        Imagine just typing your book into a simple word document, saving it to Amazon, adding a cover that I'll show you how to get for $5 or less, previewing it for errors in Amazon's free previewing tool and clicking publish! It's really that simple.  </p>\n\n<p>  \t                                  Are you ready to start earning passive eBook income? Are you ready to create that first passive income snowball and roll it down the hill?<strong></strong><strong></strong></p>\n\n<p>  \t<em>I'm here to answer any questions you have. You can even message me if you have any questions or concerns before signing up for the class. I'm here to get you publishing books and making money.</em>  </p>\n\n<p>  \t          Simply scroll up, click the <strong>Take This Course</strong> button and <strong>get started on your first Kindle book today!  </strong>  </p>", 
    "end_date": null, 
    "title": "Amazon Kindle eBook Publishing - How to Succeed on Kindle", 
    "price": "20.00", 
    "instructors": "Steve McDonald", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375380_c801_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-retire-early-by-publishing-and-selling-kindle-ebooks/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T05:38:27Z"
}