{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>In this course you will learn the secrets I used to build a profitable Amazon business.</strong></p><p>Learn To Become A Best Seller On Amazon. One of the mistake that most sellers make is they only focus on making sales. To be successful on Amazon you need social proof, in other words you need reviews.</p><p><strong></strong></p><p>If you have taken another Amazon course and you are stuck and cannot seem to find success on Amazon, this course is the perfect solution for you. Most courses only cover the basics about Amazon FBA. This is one of the few courses that provide you with the really information to become a best seller on Amazon and take your success to the next level.<br></p><p><strong>You are going to learn:</strong></p><ul><li>How to properly manage your inventory.</li><li>Simple steps to build your contact list.</li><li>How to use other peoples contacts to build your own contact list.</li><li>What social media platforms you should be using.</li><li>How the Amazon Search to your advantage.</li><li>Simple steps to create a great Amazon listing.</li><li>How to use Crowdfunding websites to increase your Amazon Sales.</li></ul><p>This course (unlike others) is taught by someone who is actually making money from Amazon FBA. Most course only go through the basics of the Amazon FBA program.I walk you through the process I am using to make thousands on Amazon.<br></p><p><strong>Enroll Today </strong>and take your Amazon business to the next level.</p><p><em>Unrestricted 30 day, no questions asked, full money back guarantee from Udemy</em> if you are not happy with the course. <br></p><p><br></p>", 
    "end_date": null, 
    "title": "Amazon FBA:  New Secrets.  Increase Your Sales Every Month.", 
    "price": "20.00", 
    "instructors": "Devon Campbell", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626512_c25a_2.jpg", 
    "course_url": "https://www.udemy.com/advanced-make-money-with-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T01:12:38Z"
}