{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>FINALLY! A COURSE FOR CANADIANS ON HOW TO MAKE MONEY THROUGH RETAIL ARBITRAGE. THIS IS YOUR COMPLETE GUIDE ON HOW TO SELL ON AMAZON FBA IN CANADA. <em>**Last Updated: April 23, 2016***</em></strong></p>\n\n<p>Things work differently when you're selling on Amazon FBA in Canada - you need to consider different product prices, shipping costs, methods, and processes for preparing your Amazon FBA Canada shipments.  </p>\n\n<p>When I was first selling on Amazon FBA, <em class=\"redactor-inline-converted\">I had trouble finding any useful resources for Canadians</em> on how to make money with this.  I would spend hours watching videos on YouTube only to find out that some of the material did not apply because I was in Canada. </p>\n\n<p>I specifically created this course to provide you with a <strong>complete and comprehensive step-by-step guide for how to sell on Amazon FBA in Canada</strong><em class=\"redactor-inline-converted\">.</em> Learn from my experience to make more profits and keep more money in your pockets.<br></p>\n\n<p><br></p>\n\n<p><strong><em class=\"redactor-inline-converted\">Master Retail Arbitrage In Under 3 Hours Using these Detailed Video Lessons and Tips Taught in This Course.</em></strong><br></p>\n\n<ul><li><em class=\"redactor-inline-converted\">Create your own Amazon Seller Account and connect it to your bank account so you can get PAID!</em></li><li><em class=\"redactor-inline-converted\">Master the use of the Amazon Seller App for scanning products at the store<br></em></li><li><em class=\"redactor-inline-converted\">Identify which items will make you more profits when selling on Amazon FBA in Canada<br></em></li><li><em class=\"redactor-inline-converted\">Ship your items for FBA selling using Canada Post with the proper sticker labels<br></em></li><li><em class=\"redactor-inline-converted\">Avoid losing money with these saving hacks that specifically apply to Canadians (cuz things are more expensive here!)<br></em></li><li><em class=\"redactor-inline-converted\">Properly package and prepare your Amazon FBA Canada shipment so it does not get damaged on the way to the fulfillment centers</em></li></ul>\n\n<p>I am so grateful I get to be your guide through all of this. We will go through every step together: we'll make sure you have the right tools to get started, we'll go scanning for products together at Walmart, we'll print the labels together and stick them on properly, we'll go to Canada Post together and ship your package....</p>\n\n<p>And of course, we'll <strong>make sales together</strong>! </p>\n\n<p>This Amazon FBA Canada course is also complete with <strong>check-in points </strong>so you can easily digest this information and take action on it. </p>\n\n<p>I will also be adding an entire section on <strong>ninja strategies for making more money</strong> - I have a few tips up my sleeves and have already planned more videos that will be coming down the pipeline soon! :)</p>\n\n<p><strong>Let's do this my fellow Canadians! </strong></p>\n\n<p><em class=\"redactor-inline-converted\">Click on the \"Take This Course\" button and I look forward to meeting you inside.</em></p>\n\n<p>- Jewel Tolentino</p>", 
    "end_date": null, 
    "title": "Amazon FBA Canada: Your Complete Canadian Guide To Profits", 
    "price": "50.00", 
    "instructors": "Jewel Tolentino & Auret Esselen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761290_57fa_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-sell-on-amazon-fba-canada/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T06:35:22Z"
}