{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>2011</strong> gab Amazon Autorinnen und Autoren in Deutschland mit \"Kindle Direct Publishing\" (KDP) die Chance, ihre eBooks ohne Verlag direkt in den Amazon-Store zu stellen. Heute erwirtschaften Selfpublisher 40 Prozent aller eBook-Verkäufe auf der Plattform.</p>\n\n<p><strong class=\"redactor-inline-converted\">2016 startete der Anbieter \"Amazon Video Direct\" (AVD)</strong>. Darüber kann jeder Videos auf Amazons Film-Plattform hochladen und weltweit verkaufen. Wenn Sie jetzt starten, sind Sie unter den ersten, die diese großartige Möglichkeit nutzen, die wohl die Filmbranche ähnlich verändern wird wie KDP die Buchbranche. Sichern Sie sich jetzt Ihren Platz!</p>\n\n<p>Dieser Kurs erklärt Ihnen alles, was Sie dazu wissen müssen. Sie erfahren:</p>\n\n<ul><li>Wie Sie einen Account bei AVD anlegen</li><li>Welche Inhalte Sie hochladen können</li><li>Wie der Upload von Videos funktioniert</li><li>Womit Sie bei Amazon Video Direct Geld verdienen (und wieviel)</li><li>Auf welche Weise Sie Untertitel erstellen</li><li>Wie Sie sich die Arbeit mit Amazon S3 erleichtern</li></ul>\n\n<p>Das Drehen und Schneiden von Videos ist nicht Kursthema.</p>\n\n<p>Der Kurs führt Sie zunächst in Amazon Video Direct ein. Grundlagen und Fakten bringt Ihnen der Dozent in Form von Präsentationen bei. Danach geht es direkt an die Arbeit: Sie können die verständlichen Erklärungen sofort an Ihrem eigenen Bildschirm in die Praxis umsetzen. </p>\n\n<p>Der komplette Kurs wird Sie nicht länger als einen Tag beschäftigen. Danach stehen Ihnen alle Wege offen, als Regisseur, Autor und Hauptdarsteller die Videowelt zu erobern. Falls Sie bereits als YouTuber oder Hobbyfilmer Material gesammelt haben, können Sie dieses noch am selben Tag bei Amazon veröffentlicht haben. Kosten entstehen in diesem Prozess nicht.</p>", 
    "end_date": null, 
    "title": "Amazon Video Direct: Selfpublishing für Filme und Serien", 
    "price": "20.00", 
    "instructors": "Matthias Matting", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/865876_4e85.jpg", 
    "course_url": "https://www.udemy.com/amazon-video-direct/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T15:44:47Z"
}