{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Amazon FBA - Product Sourcing Amazon FBA eBay</strong></p><p><strong>STUDENT REVIEW:</strong></p><p><strong><em>\"This is an incredible course, showing that Dave is a true authority on product sourcing. It is jam-packed full of tremendous tips and resources.\"</em>  - George Nieves</strong></p><p>-------------------------------------------------------------------------------------------</p><p><strong>Are you an Amazon FBA or eBay seller? </strong></p><p><strong>(or do you want to make money with Amazon FBA &amp; eBay?)</strong></p><p><strong>Would you like the \"Keys to the Kingdom\" when it comes to finding high-profit products to resell?</strong></p><p><strong>How would you like to work less, yet make more with your business?</strong></p><p>You can turn Amazon FBA &amp; eBay into your very own amazing selling machine - when you know how to source merchandise and inventory (products) for your Amazon FBA / eBay business!</p><p>That's because <strong>Amazon FBA and eBay both put you in front of MILLIONS OF BUYERS</strong> - buyers with credit card in hand, eager to buy your products...</p><p><strong>So all you have to do is get good at FINDING HIGH-PROFIT PRODUCTS and you're in business!</strong></p><p>REVEALED in this Amazon FBA / eBay Product Sourcing Master Class are 33 of the best, proven, powerful product sourcing strategies for Amazon FBA and eBay, such as:</p><ul><li>The one highly-profitable product I made <strong>$38,000 PROFIT</strong> on. (And how you can do the same!)</li><li>How to use little-known, automated tools that actually ALERT YOU WITH HOT, AMAZING DEALS</li><li>The A______ M___ Buyout Offer and how to do it for massive profits</li><li>New, improved ways to do eBay &gt;&gt;&gt; Amazon arbitrage (no shipping!)</li><li>Unknown strategies for doing Amazon &gt;&gt;&gt; eBay arbitrage</li><li>A case study where <strong>I reveal the actual product</strong> I've made a ton of money with in the last couple of years (Steal this and run with it!)</li><li><strong>How to “SPY\" on top Powersellers</strong> (On eBay AND Amazon FBA) to make money the same way they are!</li><li>How to take advantage of the massive goldmine in “G--------- A-------“ so that you get your share of this massive, untapped source of BILLIONS worth of merchandise!</li><li>How to <strong>easily source products online</strong>, (At least 7 ways) so you never have to touch products again!</li><li>How to use my “eBay Hacks\" tactics to “hack\" your way into eBay, <strong>finding</strong> little-known <strong>“unfindable\" deals</strong> – killer deals no one else can find (but you can) and profiting wildly in the process!</li><li>My ingenious “D--- Go-----g\" strategy that will uncover “3-minute profit\" deals <strong>(Make money in 3 minutes on your computer)</strong></li><li>My proven system (I've bought tens of thousands of collectibles this way) that <strong>delivers super-high-profit products TO YOU</strong></li><li>How to access little-known “offline auction\" sources where you can find product sourcing GOLD to resell on the amazing selling machines known as Amazon / eBay</li><li>How to create your own <strong>exclusive dropshipping arrangements</strong> so you never have to ship anything</li><li>Like Storage Wars? I've been to hundreds of storage auctions and I'll show you <strong>how to profit massively!</strong> (I auditioned for the Storage Wars TV show!)</li><li>The deal I made $12,300 on (on one item!) and how it was so amazing that it ended up <strong>on the cover of a major magazine!</strong></li><li>Take a peek inside the world of “B-----g E----s\" and how this strategy alone can make you a six-figure business.</li><li>How to set up exclusive product-sourcing arrangements so you have <strong>ZERO COMPETITION</strong> on Amazon FBA OR eBay</li><li>How to find suppliers of PROFITABLE PRODUCTS that <strong>no one else knows about</strong> and who CAN'T WAIT to give you GREAT deals that you can make money on!</li><li>How to easily turn Craigslist into your automated profit center!</li><li>How I sold over $20,000 worth of perfectly legal drugs on Amazon in 60 days!</li><li>How to use <strong>“reverse engineering\"</strong> to find hot, profitable products and grab your share of those profits!</li><li>You've heard of auction sniping? That's so 2005... You should try <strong>B _ _ Sniping!</strong></li><li>Newbies on eBay screw up their listings MOST of the time. Here's how you can swoop in and <strong>snag these \"error listings\" and make huge profits!</strong></li><li>Why look anywhere else? I'll show you how to easily create amazing wholesale deals on Amazon FBA AND eBay!</li><li>4 types of “shows\" that can deliver bank-busting income for you</li><li><strong>Tons and tons of ways to source profitable products from the comfort of your own recliner!</strong></li><li>And a whole lot more!</li></ul><p>In short, after taking this course, you'll be a product sourcing Jedi with the equivalent of a PHD in profitable Amazon / eBay product sourcing! (and you'll know exactly what you need to do to turn the amazing selling machine of amazon FBA &amp; eBay into massive profits for you and your family!)</p><p>Enroll today and take advantage of Udemy's 30-day, no-questions-asked, money back guarantee, so you have no risk.</p>", 
    "end_date": null, 
    "title": "Amazon FBA & eBay - 33 Hot Product Sourcing Strategies", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348940_1af2_3.jpg", 
    "course_url": "https://www.udemy.com/amazon-fba-source-products-for-amazon-ebay/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T02:44:58Z"
}