{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>[Course is up-to-date with April, 2016 information!]</em></strong></p>\n\n<p>  \t<strong>FULL STEP-BY-STEP BLUEPRINT TO ABSOLUTELY CRUSH IT ON AMAZON BY SELLING YOUR OWN PRODUCTS! - <em>WORKS NO MATTER WHERE YOU LIVE IN THE WORLD!</em></strong>  </p>\n\n\n\n<p>  \t<em><strong>\"You can start selling YOUR products and making money in just 48 hours from now!\"</strong>  \t</em><strong></strong>  </p>\n\n\n\n<p>  \t                                   You'll discover how you can <strong>EASILY</strong> get companies to create products for <em>YOU</em>! So these are gonna be <em>YOUR</em> products with <em>YOUR</em> name on it! I'll show you how to get them to do it for <strong>PENNIES</strong> on the dollar!  </p>\n\n\n\n<p>  \t                                 I'll show you how to turn around and sell <strong>YOUR OWN PRODUCTS</strong> on Amazon for HUGE profits!  </p>\n\n\n\n<p>  \t                                 You will learn how to use <strong>Amazon FBA</strong>! They are going to handle shipping, customer support, and everything else... So you don't have to! - All you have to do is just sit back and collect the checks!  </p>\n\n\n\n<p>  \t<strong>In this system you'll learn:</strong>  </p>\n\n\n\n<ul>  \t<li><em>5 step formula to pick smoking hot products</em> that are guaranteed to stuff your bank account with cash!</li>  \t<li>You'll discover the <em>15 second mind hack</em> that lets you pick million dollar niches instantly!</li>  \t<li>You'll learn how to easily <em>find out which products are winners</em> and will make you boatloads of cash... and which ones you should avoid at all costs!</li>  \t<li>You'll discover how to <em><strong>get started with just $5!</strong></em></li>  \t<li><em>I'll show you how you can get your <strong>own products created for pennies!</strong></em></li>  \t<li>And how you can quickly turn around and <em>sell it on Amazon for MASSIVE profits!</em></li>  \t<li>You'll learn the 5 step method I use to rake in cash from selling everything from tweezers, to spatulas, to clothing, to candles... The sky is the limit here!</li>  \t<li>You'll learn how to run this business from anywhere in the world... So even if you live overseas you can do this!</li>  \t<li>You'll discover a <strong>sneaky little trick to get hundreds of rave reviews</strong> <em>for your Amazon products </em>on demand... (It's not what you think!)</li>  \t<li>You'll discover how to get monsoons of traffic, boatloads of sales!</li>  \t<li>I'll show you how to use YouTube to get lots of traffic for Amazon and how to rake in huge commissions!</li>  \t<li>Not only that, you'll learn how to <strong>DOMINATE the billion dollar supplement industry! </strong>(This has been one of my closely guarded secrets that I was prepared to take to the grave with me...)</li>  </ul>\n\n\n\n<p>  \t                               But for the first time ever, I'll come clean and show you how you can start selling your own products supplements in just 48 hours or less. This is a HUGE cash cow that the guru's don't want you to know about!  </p>\n\n\n\n<p>  \t<strong>You'll get the unfair advantage and learn everything you need to know about supplements and how to get started!</strong>  </p>\n\n\n\n<p>  \t<em><strong>And I'll even reveal 1 trick that I recently used to make a staggering $113,749 (6 figures) from just 1 ugly video on YouTube!</strong></em>  </p>\n\n\n\n<p>  \t                         You can't find this information anywhere else. I am going to show you how to absolutely destroy the competition on Amazon, how to get started selling your own products online, how to get them listed at the top of Amazon, how to get lots of traffic from Youtube, get lots of traffic from Google, and how to rake in huge income!  </p>\n\n\n\n<p>  \t<strong>This is completely newbie friendly!</strong> It doesn't matter how old you are or  if you're not a computer savvy... As long as you can follow single  steps, copy &amp; paste, you can do this!  </p>\n\n\n\n<p>  \t<strong>Think this takes a lot of money to get started? Think again, <em>it doesn't!</em></strong> In this system I show you an easy way to get started with just a few dollars! <strong>You can find products for as cheap as <em>56 cents</em> to make!</strong> <em>I show you how to sell that for big profits!</em>  </p>\n\n\n\n<p>  \t<strong>The beauty in this method is that it doesn't matter where you live,</strong> because Amazon shipping the products for you, and they are going to be handling the customer service and everything else so you don't have to!  </p>\n\n\n\n<p>  \t<strong>And I STILL Haven't Even Gotten To The Best part...</strong>  </p>\n\n\n\n<p>  \t<strong>You don't need...</strong>  </p>\n\n\n\n<ul>  \t<li>Your own website</li>  \t<li>To be seen as an expert</li>  \t<li>Sales skills</li>  \t<li>To slave long hours</li>  \t<li>To be an affiliate (we're not going to waste our time with lousy $2 commissions!)</li>  \t<li>Any experience (it doesn't matter if you are brand new to the computer!)</li>  \t<li>To ship stuff out or store it in your garage (I'll show you how to set it all up on autopilot!)</li>  \t<li>To deal with any customers... (I'll show you how to get Amazon to handle all of that)</li>  \t<li>To spend lots of money buying expensive inventory!</li>  </ul>\n\n\n\n<p>  \t<em>This method is way more powerful than all of that!</em> <strong>I'll show you how to get started with just a few bucks!  </strong>  </p>\n\n\n\n<p>  \t        Once you set this system up,<strong> it runs complete autopilot!</strong> So you can take a vacation, sleep in, and still get paid - because this system runs for you and it runs autopilot so that way you don't even need to be there!  </p>\n\n\n\n<p>  \t<strong>Azon Cash Bomb Is A Multiple Award Winning Amazon Training Program!</strong>  </p>\n\n\n\n<p>  \t      The information inside this training are insider secrets that take regular guys like you and me and multiplies our cash-generating ability 100X instantly.  </p>\n\n\n\n<p>  \t      Secrets that put you on the same playing field as CEOs, tech startups, super affiliates and entrepreneurs who've been banking 6 and 7 figures for years already.  </p>\n\n\n\n<p>  \t<strong><em>Oh, and just to make this a complete no brainer... I'm removing all the risk!  \t       Azon Cash Bomb comes with a 30 Day Full Money Back Guarantee!</em></strong> <em><strong>If you are aren't blown away by the information inside it, you'll get 100% of your money back!  </strong></em>  </p>\n\n\n\n<p>  \t<strong>Start to profit like a boss NOW!</strong>  \t<em><strong></strong></em>  </p>", 
    "end_date": null, 
    "title": "Amazon FBA: Complete Guide To Start Your Own Home Business", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Silvio Sucow", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404753_a939_3.jpg", 
    "course_url": "https://www.udemy.com/amazon-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T21:50:08Z"
}