{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>$180,000+ On Amazon While Travelling The World</p>\n\n<p>\n</p>\n\n\n\n\n\n<p>Get Ready To Take Your Amazon Business To The Next Level</p>\n\n\n\n\n\n<p><strong>Welcome to Part 2 of AzonUniversity</strong></p>\n\n\n\n\n\n<p>In part 2 of AzonUniversity you will learn how to skyrocket your success. Your amazon business is a goldmine. In this course you will learn how to cash in. </p>\n\n\n\n\n\n<p>You already know how to research the perfect product, get suppliers and setup your listing on Amazon. Now its time to turn that into a money machine. </p>\n\n\n\n\n\n<p><strong>Here’s what you’ll learn in part 2 of AzonUniversity:</strong></p>\n\n\n\n\n\n<ul>\n<li>How to get such high conversions that your product runs out of stock fast</li>\n<li>How to stand out from the crowd with professional photos </li>\n<li>How to boost ranks and sales by advertising on Amazon, Facebook and Google and make immediate sales</li>\n<li>How to double your income by bringing your product to new Amazon markets (This is HUGE)</li>\n</ul>\n\n\n\n\n\n<p><strong>Why You Need This Course</strong></p>\n\n\n\n\n\n<p>In the first course you learned how to start the business and upload your product. These advanced principles will build on your strong foundation and take your business to six figures.  This is where your dreams come true and the business is built to last. </p>\n\n\n\n\n\n<p>Now it’s time to have fun, and make tons of money. With a long-term sustainable online business, you are free to travel and spend time with the people you love. </p>\n\n\n\n\n\n<p><strong>Amazon has changed my life, and now it’s changing yours. </strong></p>\n\n\n\n\n\n<p>Don’t wait any longer, take action now. Click the ‘Take This Course’ button now and try out the course. </p>\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n<p>Your investment is 100% protected with a 30-day money-back guarantee!</p>\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n<p>I can’t wait to see you in the course, on the path to building your 6 figure Amazon business. </p>\n\n\n\n\n\n<p>See you on the inside…</p>\n\n\n\n\n\n<p>Yours Truly,</p>\n\n\n\n\n\n<p>Shimmy &amp; Joshua Morris</p>", 
    "end_date": null, 
    "title": "AzonU: Look Into our 6 Figure Amazon Business! - PART 2", 
    "price": "50.00", 
    "instructors": "Shimmy Morris, Josh Morris", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/809486_3d56_2.jpg", 
    "course_url": "https://www.udemy.com/azonu_part2/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-31T20:30:34Z"
}