{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \t****SPECIAL PROMO NOW 85% OFF**********  </p>  <p style=\"\">  \tLIMITED TIME DEAL <br style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \tSTART A 6-FIGURE BUSINESS .  I WILL SHOW YOU EXACTLY HOW!  </p>  <p style=\"\">  \t       Imagine doing what you love to do, while your business takes care of itself. Travel around the world, spend time with your family, read books,go to events, live your life the right way ! <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t<br style=\"\">  \t          Work beside me and learn exactly how to build a 6-figure business in 6 months or less from scratch in a very easy to follow instruction plan.  </p>  <p style=\"\">  \t<strong style=\"\">I have gone through the trial and error in each business plan, and will share with you years of knowledge and experience I have acquired to build 6-figure companies</strong>  </p>  <p style=\"\">  \t                         Never ran a business before? No problem. I will go over every detail, in the exact process that I used to start multiple 6-figure companies. I am not here to create a flashy video that looks good but does not teach. My passion is teaching, and I made the video simple and easy to follow. Let’s get started!  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">Customer Responses: </strong></em>  </p>  <p style=\"\">  \t <em style=\"\">“Thank you ! Roy taught me his business plan, and within two days my new company was making profits” </em>  </p>  <p style=\"\">  \t <em style=\"\">– </em><strong style=\"\">Andrew Kim,  Entrepreneur</strong>  </p>  <p style=\"\">  \t <strong style=\"\">“</strong><em style=\"\">Being able to earn money whether I am sleeping, working or travelling has been great, highly recommended”</em>  </p>  <p style=\"\">  \t <strong style=\"\">- Sarah Drimes, Investor  </strong>  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">“</em></strong><em style=\"\">What a great learning video, I used the strategy to improve sales and ended up quitting my job only to earn more”</em>  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">- </em>Mike James,Banker, Entrepreneur</strong>  </p>  <p style=\"\">  \t <strong style=\"\">“</strong><em style=\"\">What more can I say, I followed the steps in the course and I now have multiple #1 best seller books online with my partner”</em>  </p>  <p style=\"\">  \t <strong style=\"\">-Martha Strudney, CEO, Start-up Advisor</strong>  </p>  <p style=\"\">  \t <strong style=\"\">“</strong><em style=\"\">Not just a business course, it is a life style changer ”</em>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">-</em>Steve Newton, Manager</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t                         This course is for people that want to:  </p>  <p style=\"\">  \t                         -Learn how to build a 6-figure Business from scratch  </p>  <p style=\"\">  \t                         -Learn multiple business plans to achieve this success  </p>  <p style=\"\">  \t             -<strong style=\"\">EARN REAL CASH EVERYDAY</strong>  </p>  <p style=\"\">  \t                         -Escape the 9-5  </p>  <p style=\"\">  \t                         -STOP the slave, save, retire motto (Do you only want to be rich once you are old enough to retire, did not think so)  </p>  <p style=\"\">  \t                         -Be more productive  </p>  <p style=\"\">  \t                         -Live the Good Life  </p>  <p style=\"\">  \t                         -Experience Cool bonus features on health, free eating, and more!  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">FAQ (Doubters read this)</strong></em>  </p>  <p style=\"\">  \t <br style=\"\">  \t <em style=\"\"><strong style=\"\"></strong></em>  </p>  <p style=\"\">  \t <strong style=\"\">I am not technical, are you sure I can handle and learn this business? </strong>  </p>  <p style=\"\">  \t                         $)Yes. I am confident in you ! I will break down the course as simply as possible, and all you have to have is an internet connection then you just follow along! I have taught my grandmother how to create a business, I am quite sure you are capable too.  </p>  <p style=\"\">  \t <strong style=\"\">Why are you teaching your methods for earning a huge sum of money?</strong>  </p>  <p style=\"\">  \t                         $)I have various companies that earn 6 figures with minimal effort, and I am confident they will continue to do so. To be honest, I created this course because a)my friends and family always wondered how I was traveling and affording these expensive things and I got tired of re-explaining myself b)because I want my friends to earn more money (traveling alone is not nearly as fun) and c) I love teaching, and I realized this a few years back.  </p>  <p style=\"\">  \t <strong style=\"\">What is the fastest you have seen somebody from your course earn 6 figures?</strong>  </p>  <p style=\"\">  \t                         I showed my buddy my business plan, and he managed to start a drop shipping company that earned nearly $250,000 in his first year. He followed my advice, found a better product than me and now he has joined the new rich.  </p>  <p style=\"\">  \t <strong style=\"\">Do I need to have a post-secondary degree to start these businesses?</strong>  </p>  <p style=\"\">  \t               $) No, the course is designed so anybody can follow very easily step by step. I will also go over the fact that a post-secondary education is not necessary to succeed, and how I hacked the entire system.  </p>  <p style=\"\">  \t <strong style=\"\">Why is this course different compared to others? </strong>  </p>  <p style=\"\">  \t                         $)People make courses to sell; I make courses for my friends and friends of friends for their benefit. I have a proven success record, and they asked me to make the course to help them. Let my trial and error be shared with you. I will show you the best techniques I have found useful over years and years of experimenting.  </p>  <p style=\"\">  \t                         I have multiple books that was a #1 best seller on amazon.  When people are buying thousands of copies it can add up nicely. It will also always be available, so I never have to touch it again and I will always be generating more income, whether I am sleeping or traveling.  </p>  <p style=\"\">  \t                  You are already special because you have the ambition to be here as an entrepreneur. <strong style=\"\">Nobody that started these million dollar companies was smarter than you, they just had the guidance I am willing to provide you. As Steve Jobs once said, the people that think they can change the world are usually the ones that do. </strong>  </p>  <p style=\"\">  \t                  Since I am recently releasing this course, I started on a lower price range to teach people I know for a cheap price. If you are still reading this, you are in luck, because soon the price will go up, so hurry up and take advantage of the good deal!  </p>  <p style=\"\">  \t                  Remember, I will be with you the whole way.  </p>  <p style=\"\">  \t<strong style=\"\">The BIGGEST key to success is getting started, Period. </strong>  </p>", 
    "end_date": null, 
    "title": "Become a Digital Nomad: Work from Anywhere in the World", 
    "price": "20.00", 
    "instructors": "Roy Kolodziejski", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107598_7c35_9.jpg", 
    "course_url": "https://www.udemy.com/beachmillionaire/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-18T17:14:42Z"
}