{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Start your own online freelance writing/ghostwriting business without ANY experience or ANY up front cost!</strong>  </p>  <p>  \t  Yes, believe it or not, the online freelance writing business is a lucrative opportunity for those who have good grammar and spelling skills, the ability to research and good time management skills.  </p>  <p>  \t  A few years ago, I was laid off from my job. At the time, I was having health issues, my husband was a stay-at-home father and we homeschooled three kids. So you could say I was just a tad busy!  </p>  <p>  \t  I have a degree in Journalism (which is NOT necessary to make tons of money as a freelance writer online), so I decided to use those skills to start building a business. I floundered a lot as I tried this and that, working businesses online that never amounted to anything but a loss of time and money.  </p>  <p>  \t  And then I found online freelance writing. Since that time, my family has survived on income from writing. In fact, I brought my husband into the business a few years ago, and he has personally written THOUSANDS of pieces of content since then! And guess what? He&#039;s a high school graduate and never went to college, but his writing is all over the Internet from articles to books.  </p>  <p>  \t<strong style=\"\">YOU can do it too!</strong>  </p>  <p>  \t<strong style=\"\">If you&#039;re looking for a business that you can literally start TODAY and have money in your account a few days from now, this is IT.</strong>  </p>  <p>  \t  In fact, I don&#039;t know of any other business that can provide the income and time freedom that writing can. Even with eBay (another of my businesses), you have to buy inventory, list it and wait for it to sell.  </p>  <p>  \t  With writing, you can have money within days! And my course is going to take you by the hand and show you how to do it.  </p>  <p>  \t<strong style=\"\">  Click the TAKE THIS COURSE button at the top right of this page to get started today!  </strong>  </p>", 
    "end_date": null, 
    "title": "Become a Professional Writer", 
    "price": "30.00", 
    "instructors": "Charity  Cason", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392540_5fe1_2.jpg", 
    "course_url": "https://www.udemy.com/make-money-as-an-online-freelance-writer-without-experience/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T23:43:58Z"
}