{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>***SPECIAL LAUNCH DISCOUNT. TAKE THIS COURSE NOW FOR ONLY $9*** </strong></p>\n\n<p><strong><em>NOTE: THIS IS THE LOWEST PRICE I CAN SELL THIS COURSE FOR ON UDEMY UNTIL APRIL. SO TAKE ADVANTAGE OF IT NOW!       ADDITIONAL COUPONS WILL NOT WORK. </em></strong></p>\n\n\n\n<p><br></p>\n\n\n\n<p> These 20+ Training Videos will walk you through the exact step-by-step system you will use to start earning a six-figure income on Kindle today. </p>\n\n\n\n<p> This includes… </p>\n\n\n\n\n\n<p> <strong><em>The “Buried Treasure” Secret</em></strong> that lets you effortlessly spot red hot Kindle publishing niches where you can easily rank your books. </p>\n\n\n\n\n\n<p><strong><em> The 5-Star Secret to “modelling” proven bestsellers in your niche, so you can publish irresistible, well reviewed books every time. </em></strong></p>\n\n\n\n\n\n<p> <strong><em>The Secret Of The 48 Hour Bestseller</em></strong> you will use to publish your book - rocket up the Amazon rankings in your niche - and start earning within TWO days. </p>\n\n\n\n\n\n<p> Plus other training like… </p>\n\n\n\n\n\n<p> <strong><em>How to come up with a “must read” title for your book</em></strong> that will practically force people to buy and open your books - even if they’ve never heard of you. </p>\n\n\n\n\n\n<p> <strong><em>The secret to outsourcing your books</em></strong> to native U.S. english writers for under $80 per book - giving you a library of 5-star bestsellers for pennies on the dollar. </p>\n\n\n\n\n\n<p> <strong><em>One technique I use to get very high quality reviews</em></strong> - from the most trusted reviewers on Amazon - so your book rockets to the top of the search results. </p>\n\n\n\n\n\n<p> I even give you a trick for building an email list in your niche BEFORE you publish your book. You can use your list to promote DOZENS of books.  </p>\n\n\n\n\n\n<p><strong>Here is what you will discover in the course...</strong></p>\n\n\n\n\n\n<ul><li><strong><em>6 Secrets to Becoming a Best Selling Author<br></em></strong></li><li><strong><em>How to Come Up with Effective Title and an Outline<br></em></strong></li><li><strong><em>How to Create Professional Covers for as little as $1</em></strong></li><li><strong><em>How to Create a Highly Targeted Buyers List for Free</em></strong></li><li><strong><em>Secrets to Getting Tons of Positive Reviews</em></strong></li><li><strong><em>How to Publish a Paperback - Increase Your Sales by 30% or More<br></em></strong></li><li><strong><em>How to Turn Your Book into an Audiobook and Earn Even More Money</em></strong></li><li><strong><em>How to do a Book Promotion Outside of Amazon and Get Tons of Sales </em></strong></li></ul>\n\n\n\n\n\n<p><strong>Plus lots… lots… lots… more.<br></strong></p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Become A Best Selling Author On Kindle", 
    "price": "20.00", 
    "instructors": "Emran Saiyed", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/727670_bb12_4.jpg", 
    "course_url": "https://www.udemy.com/kindlepublishing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T05:41:47Z"
}