{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Content Writing</strong> is more like an art than a profession, the person who has this art is successful in all online businesses. It is just not only about becoming a content writer, it is about having command and grip on all the online businesses. Tell me one online business that doesn't require you to be good in writing stuff. Let me make this clear to you</p><ul><li>Let's say you're a blogger, then content writing is the most important skill that you need to have. Without it, you can never be a successful blogger.</li><li>If you're an Internet Marketer then you know this really good that how much content writing is important for you. If you can't write attractive content you can never be a successful internet marketer</li><li>If you're a graphic designer, and you offer your services at different freelancing website, you really need how you have to write effectively that gets you clients and sales.</li><li>If you're a person who works on Ebay, Amazon or any arbitrage based Business online. <em>Content Writing </em>can change the number of sales you're getting and multiply your profit because you would know how to communicate with words and make people want to buy stuff.</li><li>Let's go beyond all that and say that you're a Udemy Instructor. Can you be a successful instructor if you're not a good content writer? I don't think so. You need to be a good content writer to communicate with your students in an efficient way and to write an effective title, sub title and description. Sounds lame? It really is not. This little stuff matters a lot and it can change the earning figures that you're getting.</li></ul><p><strong>So what you're going to learn in this course?</strong></p><ol><li>I will tell you about some things that you really need to know before you start with content writing</li><li>I will cover how you can become a content writer.</li><li>I will provide you with a practical stuff section and you will learn everything in motion.</li><li>The most awesome part is the one in which I will tell you how you can earn money by the skills that you've gained.</li></ol>", 
    "end_date": null, 
    "title": "Become a Productive Content Writer and start working today", 
    "price": "20.00", 
    "instructors": "Syed Hassan Bukhari", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620076_525a_2.jpg", 
    "course_url": "https://www.udemy.com/content-writing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T06:53:18Z"
}