{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Did you know that there are billions of people using the internet every day?</strong></p><p>Having a website is a NECESSITY for every small business to increase their income in a worldwide market. Websites are also MUST for individuals who want to increase their income by selling their services and products. People even need websites for their: cultural project, dance business, band, photography, as a wedding celebrant, hobbies, pets, and so on.</p><p>Most website building companies will charge thousands of dollars for a website because they're building complicated Javascript or Html websites. But website building doesn't have to be complicated and expensive any more.</p><p><strong>I'll show you how easy it is to build and edit a website in this course!</strong></p><p>In this course, I'll show you how to build websites on 2 different Website Building Platforms. (That way you can choose which one you like best and which one suits your business or project best).</p><p>Please note: This course is a beginner's guide to building websites, so in this course we cover all you need to know to <strong>build <em>small </em>websites</strong> - not big ones. :)</p><p>*****</p><p><strong></strong></p><p>P.S. If you upgrade your website building skills to a professional level you can BUILD WEBSITES for businesses and make money, and build websites that make money through affiliate marketing and so on. Website building is an excellent extra income stream - it's a great way to build your Diverse Career Portfolio. In this course I cover many different ideas on how you can build websites and make money. </p><p>PSSST! Udemy has a 30-DAY MONEY BACK GUARANTEE so you can feel confident joining the course. You also have LIFETIME ACCESS so any time you want to refresh your memory on website building and editing you can pop back here and watch a lecture. </p><p><br></p>", 
    "end_date": null, 
    "title": "Beginner Level Website Building to Boost Your Small Business", 
    "price": "40.00", 
    "instructors": "Carmen Wyld", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553888_024a.jpg", 
    "course_url": "https://www.udemy.com/beginner-level-website-building-to-boost-your-small-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T01:36:07Z"
}