{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Learn How to Source Ship and Sell Products From Anywhere in the World to Anywhere in the World From Comfort of Your Own Home</strong></p><p>The eCommerce revolution is happening! Amazon and other massive marketplaces are coming!  Retail will soon be dead and everyone will be buying the majority of their products online. </p><p>That may seem like a drastic statement to make, but the evidence is all around us. With huge international sales days like Black Friday, Cyber Monday and online market places almost exploding at Christmas you would be crazy not see the potential as more and more people turn to internet for their commerce needs.</p><p>This course will introduce you to the world of importing products from, primarily from China, to sell on these market places for huge profits. You will be taught what to sell, where to sell  and how to sell to maximize your profits.</p><p>You are also going to learn in detail how to use one of the worlds biggest marketplaces known as Alibaba. We will Cover:-</p><ul style=\"\"><li>What sort of products to look for.</li><li>How to know that you are going to be able to sell your products.</li><li>Choose only the factories that are trusted and are not going to con you.</li><li>Learn the shipping techniques that will get your products safely to their destination.</li></ul><p>Once you have received your products we will also be covering how to easily sell them to those all important initial sales. We will also look into how to take your importing to the next level with private labelling and bonus products.</p><p>So if you are ready to get started in the fast growing, very exciting world of importing then <strong style=\"\">Join Now!</strong></p><p><strong style=\"\">30 DAY MONEY BACK GUARANTEE </strong></p>", 
    "end_date": null, 
    "title": "Beginners Guide to Importing Products From Alibaba", 
    "price": "45.00", 
    "instructors": "Danny Guerin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535076_9151_2.jpg", 
    "course_url": "https://www.udemy.com/alibaba-to-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T13:01:59Z"
}