{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">STUDENT REVIEW:</strong>  </p>  <p>  \t<strong style=\"\">&quot;Beyond eBay - Leverage the power</strong>  </p>  <p>  \tHi Dave  just got done going through this course... This  information is priceless. Wish I would have known about it when I first  started.&quot;  </p>  <p>  \t---------------------------------------------------------------------------------------------------------------------  </p>  <p>  \tAlthough millions of people across the U.S. saw me on my eBay infomercial, what a lot of people don&rsquo;t know is that, prior to being &ldquo;discovered&rdquo; and asked to appear in that infomercial, I was quietly making up to $15,000 a week on eBay using one <strong style=\"\">extremely powerful</strong> strategy.  </p>  <p>  \t At the time, I called it going &ldquo;Beyond eBay&rdquo; because it allowed me to sell my collectibles &ldquo;OFF-eBay&rdquo; and sell them a LOT faster than on eBay by using the power of email marketing&hellip;  </p>  <p>  \t It was a revolutionary &ldquo;hybrid&rdquo; eBay / Internet Marketing strategy that literally transformed my eBay business overnight&hellip; And I will show you how you can do the same...  </p>  <p>  \t <strong style=\"\">I mean, instantly upon implementing these super simple steps, you&#039;ll be able to:</strong>  </p>  <ul style=\"\">  \t<li>Dramatically accelerate your eBay sales. (I sold out of my entire eBay inventory within 48 hours by simply sending out ONE EMAIL!)</li>  \t<li>Watch your PayPal account flood with cash.</li>  \t<li>Transform your single-purchase eBay customers into ongoing, repeat customers (some of my repeat customers went on to happily spend many thousands of dollars with me)</li>  \t<li>Pump your auction prices much higher by sending a FLOOD of crazed bidders to your auctions (this applies to ALL of your auction items)</li>  \t<li>Increase the sell-through rate on all of your FIXED PRICE items, as well!</li>  \t<li>Get rid of those high eBay fees &ndash; legally &ndash; by sending your customers to your own website!</li>  \t<li>Gain far more control over your eBay business</li>  \t<li>Be able to &ldquo;take your customers with you&rdquo; &ndash; away from eBay, if need be and onto your own website, your Amazon listings or any other marketplace you wish.</li>  </ul>  <p>  \t And&hellip;  </p>  <p>  \t This is the same exact strategy that turned my little $1,200 a month vintage Hot Wheels &ldquo;hobby&rdquo; business into a $15,000 a week BEHEMOTH of a business, complete with hungry, ready-to-buy, repeat-customers who have bought from me over and over and over again over the last 14 years!  </p>  <p>  \t &hellip;And the funny thing is, it is SO SIMPLE to implement; I&#039;ll show you how, step-by-step, in this course!  </p>  <p>  \t <strong style=\"\">But Dave, How Do We Achieve These Powerful Results?</strong>  </p>  <p>  \t It&rsquo;s simple, we use a &ldquo;hybrid&rdquo; marketing strategy&hellip;  </p>  <p>  \t As you know, the word &ldquo;Hybrid&rdquo; just means a great combination of two or more distinct elements.  </p>  <p>  \t Well, in this hybrid strategy, we are going to combine the awesome power of eBay (to generate new, first-time customers) with another super-powerful strategy &ndash; email marketing.  </p>  <p>  \t That&rsquo;s right, we are going to create an email list of your eBay customers so that you will be able to easily email them (all at one time) to let them know that you have listed new, related items on eBay &ndash; each time you list.  </p>  <p>  \t And that&rsquo;s it! I told you it was simple!  </p>  <p>  \t <strong style=\"\">Once you&rsquo;ve created your list, (following the simple steps that I lay out for you in these videos) you can now:</strong>  </p>  <ul style=\"\">  \t<li>Send your eBay customers to your latest eBay listings</li>  \t<li>Send your eBay customers to your Amazon listings (oh, the irony&hellip;)</li>  \t<li>Send your eBay customers to YOUR OWN WEBSITE, (where they can buy from you over and over again) without you incurring eBay fees</li>  \t<li>Send your eBay customers wherever you want &ndash; you have complete control  \t<p>  \t\t Believe me, this strategy looks almost TOO SIMPLE&hellip; (and it is easy to do) but oh, how POWERFUL it is!  \t</p>  \t</li>  </ul>  <p>  \t By the way, I&#039;ve purposely left several of the lectures unlocked and available for you to check out because I want you to see the insane benefits of adding this powerful strategy to your eBay business.  </p>  <p>  \t In one of the lectures, you will see results like this:  </p>  <ul style=\"\">  \t<li>The increases in number of bids &ndash; from 25 bids to 69 bids! <br style=\"\">  \t (a 176% increase in ONE DAY!)</li>  \t<li>The increases in number of &ldquo;watchers&rdquo; &ndash; from 64 to 163 watchers! <br style=\"\">  \t (a 154% increase in ONE DAY!)</li>  \t<li>The increases in total bid amounts &ndash; from $122.12 to $816.04 <br style=\"\">  \t (a 568% increase in CASH, in ONE DAY!)  \t<p>  \t\t AND&hellip;  \t</p>  \t</li>  \t<li>Check out the increase in the bottom item &ndash; Hot Pink Turbofire  \t<p>  \t\t (a 2,383% increase in that one item&rsquo;s bid amount &ndash; IN ONE DAY!)  \t</p>  \t</li>  </ul>  <p>  \t One more point...  </p>  <p>  \t The SOONER you begin to do this in your business, the better.  </p>  <p>  \t When I first discovered this strategy, I realized that I had &ldquo;lost&rdquo; the ability to communicate with about 500 of my customers &ndash; simply because I didn&#039;t discover and implement this strategy earlier!  </p>  <p>  \t Had I started from the beginning (getting EVERY customer onto my email list) I would have been so much better off.  </p>  <p>  \t So, whatever you do, do not hesitate to learn and implement this in your eBay business AS SOON AS POSSIBLE.  </p>  <p>  \t This way you will be able to capture ALL your customers onto your email list and be able to market to all of them, not just a small portion.  </p>", 
    "end_date": null, 
    "title": "Beyond eBay - How To Build An eBay Buyers Email List - eBay", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/100762_7545_7.jpg", 
    "course_url": "https://www.udemy.com/beyond-ebay/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-03T01:45:36Z"
}