{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Looking to launch a home-based business?</em></strong></p><p><strong><em>Having trouble launching an online Bitcoin based business?</em></strong></p><p><strong><em>Maybe you’ve purchased a faucet and now want to grow its traffic and income?</em></strong></p><p>Whatever your motivation to set up a home-based Bitcoin business, you’ve come to the right place to get set-up and generating an income online.</p><p><strong><em>Bitcoin Faucet Blueprint: Your Guide To Launching A Faucet</em></strong>, is the most comprehensive Bitcoin faucet course you’ll find on the internet.</p><p>It’s the one place with everything you need to successfully create your Bitcoin faucet website, and get it generating an income passively online!</p><p>This is an <strong><em>effective and practical course that takes you from no home-based business, to an active income generating Bitcoin faucet website, which you can run from the comfort of your own home.</em></strong></p><p>While there are plenty of video tutorials on the web showing you how to set-up a Bitcoin faucet, it’s hard to find a comprehensive Bitcoin faucet course like this one, which takes you further than just setting up a Bitcoin faucet, but to generating an income from your new online business.</p><p>Nothing is kept a secret. <strong><em>I reveal everything there is know about launching and generating an income from a Bitcoin faucet site. I will also be adding new lectures to this course at no extra cost!</em></strong></p><p>This course is designed for anyone who wants set-up an online home-based income generating business, specifically, within the Bitcoin field. So if you’re a complete newbie to the Bitcoin industry, or someone who is currently running a Bitcoin faucet, you’re in the right place.</p><p><em>- COURSE UPDATED FEB 2016 -</em></p>", 
    "end_date": null, 
    "title": "Bitcoin Faucet Blueprint: Your Guide To Launching A Faucet", 
    "price": "20.00", 
    "instructors": "Ravinder Deol", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679524_b8b7_14.jpg", 
    "course_url": "https://www.udemy.com/bitcoin-faucet/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T15:11:07Z"
}