{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>What exactly does \"branding\" mean? Simply Brand can be a name, term, sign, symbol or design, or a combination of these elements that identify products or services of a seller. your brand is your promise to your customer. It tells them what they can expect from your products or services, and of course it deferent form your competitors. Your brand is derived to your customer who you are, and what you do.</p><p>Branding is not only about getting your target market to select you over the competition, but it is about getting your prospects to see you as the sole provider of a solution to their problem or need.</p><p><strong>Your brand name is very improtance, your brand name should:</strong></p><ul><li>Clearly delivers the message</li><li>Confirms your credibility </li><li>Emotionally connects your target prospects with your product and service.</li><li>Motivates the buyer to buy</li><li>Creates User Loyalty.</li></ul><p>But now days finding a good brand name is very deficults. We literally scratch our head over 100 time before we find any good name for our business. And in this short class I'll show you how to find good brand name with available domain names without scratching our head. In this class I'll show you how to used some free tools to find a good brand name that hold your business value within 20 minutes or less. So what are you waiting for enroll the course now.</p>", 
    "end_date": null, 
    "title": "Branding 101: How To Find Brand Name Ideas For Your Business", 
    "price": "20.00", 
    "instructors": "Somenath Sen", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690420_2188_2.jpg", 
    "course_url": "https://www.udemy.com/branding-101-how-to-find-brand-name-ideas-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T17:51:29Z"
}