{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Have you created an online course, but just aren't making enough to quit your day job and support yourself fully?</p><p style=\"\">Are you the type of author who has written a book, but never turned it into a video course? </p><p style=\"\">Or maybe you have a successful podcast and some coaching clients, but no courses, books, or audiobooks for them to continue learning from your style of teaching in your absence?</p><p style=\"\">Perhaps you have thought about launching one of these products or services, but just don't know where to start?</p><p style=\"\">If any of these describe you, then there's no question that you know the value of hard work, and are aware of the financial rewards that could result from your burning desire to help your audience. Otherwise, you wouldn't have started down this path in the first place!</p><p style=\"\">But let us ask you this:</p><p style=\"\">Are you really reaching the biggest audience possible? Are you truly experiencing the fullest measure of enjoyment and satisfaction from helping the people you care about the most? </p><p style=\"\">And are you really creating the levels of wealth, freedom, and financial independence you know you deserve? </p><p style=\"\"><strong style=\"\">Let us tell you something that may </strong><strong style=\"\"><em style=\"\">shock</em></strong><strong style=\"\"> you:</strong></p><p style=\"\">Even though we may not know you personally, the answer to most of these questions is probably “no.\"</p><p style=\"\">But like the creators of this course - both bestselling authors, top-earning instructors, and renowned podcasters - you have the potential to achieve financial freedom and design your own independent lifestyle. And it can all start today, simply by understanding and using the same resources and techniques we've used to create our own six figure businesses. </p><p style=\"\">And it's not just about having no financial worries, traveling the world and essentially doing what we please at a moment's notice. </p><p style=\"\">It's about creating value for others, improving lives, and touching entire communities. When you do that, your income explodes, and you can help even more people in ways that give you even more free time. It's a perfect circle.</p><p style=\"\">If building a business like this interests you, then listen to each and every word we have to say, because this may be the most important message you ever hear: </p><p style=\"\">A short time ago, the ability to publish a book, or teach your own courses to tens of thousands of people, or produce your own radio show with worldwide syndication, and put those creations in front of the masses was unheard of. But there's a new industry growing like wildfire on the Internet. </p><p style=\"\">Today, you can take something like a book and multiply its impact by making it available in different forms on different media platforms to generate incredible - and passive - income streams for yourself. The \"ground floor\" opportunities to take part independently is enormous.</p><p style=\"\">And the projections for future growth are almost unbelievable. </p><p style=\"\"><strong style=\"\">But here's the thing:</strong></p><p style=\"\">Almost no one is multiplying their media across multiple platforms! Even some of the top-earning, New York Times Bestselling authors and thought leaders are leaving money on the table due to a lack of understanding and the misconception that all of this is “really quite difficult.\" It is not!</p><p style=\"\">That means that you as a content creator have an exciting opportunity. </p><p style=\"\">And in this course, we are searching for those of you who are ready to enjoy higher earnings, reach more people and most importantly, start Branding You™. We will teach you the highly sought after science behind the Branding You™ 5+ Pillar Ecosystem Strategy, a paradigm that allows you to simultaneously create and manage various forms of media, to drive traffic and create cross-pollination between all of your assets. We will teach you how to build your own ecosystem from the ground up, turning it into a self-managing powerhouse of impact, revenue, and growth.</p><p style=\"\"><strong style=\"\">You'll learn:</strong></p><p style=\"\"><strong style=\"\">• How and why to set up your own blog and website</strong></p><p style=\"\"><strong style=\"\">• How and why to set up your own email list and social media</strong></p><p style=\"\"><strong style=\"\">• How and why to set up your own books, eBooks, and audiobooks</strong></p><p style=\"\"><strong style=\"\">• How and why to set up your own online courses</strong></p><p style=\"\"><strong style=\"\">• How and why to set up your podcast</strong></p><p style=\"\"><strong style=\"\">…and most importantly…</strong></p><p style=\"\"><strong style=\"\">• Exactly how to link all of these properties together to accelerate the growth, profits, and exposure of each individual product line</strong></p><p style=\"\">You'll also become part of the Branding You™ community, a lively group of up-and-coming information entrepreneurs collaborating and supporting one another to generate tens of millions in revenues! </p><p style=\"\">Take it from us: all of this is within your reach, and given the proper instructions and guidance, you can achieve your own multimedia empire quickly and painlessly. </p><p style=\"\"><strong style=\"\">Want to learn more? </strong><strong style=\"\"></strong><strong style=\"\"></strong>Join us on this incredible journey, the journey towards Branding You™. Scroll up and click to join this course now.</p>", 
    "end_date": null, 
    "title": "Branding You™: How to Build Your Multimedia Internet Empire", 
    "price": "25.00", 
    "instructors": "Jonathan Levi, Anthony Metivier", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557358_f3fa.jpg", 
    "course_url": "https://www.udemy.com/branding-you-building-an-internet-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T17:19:09Z"
}