{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">Forget SEO, Facebook or YouTube, </em></strong><strong style=\"\"><em style=\"\">Dominate Any Market In Less Than 90 Days…</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">You need a solid plan and a proven blueprint to follow, right?</em></strong>  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\"><em style=\"\">If you want to build a profitable business in a competitive niche market, then you must position your uniqueness and sell from that exact angle.</em></strong>  </p>  <p>  \t<em style=\"\">            Let me ask you a few simple questions:  </em>  </p>  <ul style=\"\">  \t<li>Do you want a business that creates a <strong style=\"\">never ending cash flow?</strong></li>  \t<li>Do you want the <strong style=\"\">freedom</strong> to choose when you take time off?</li>  \t<li>Do you want to <em style=\"\">control &amp; drive more</em> <strong style=\"\">sales</strong> to your pockets than anyone else?</li>  \t<li>Do you want a system that enables you to <em style=\"\">go into any market and make a killing</em>?</li>  \t<li>Do you want the <strong style=\"\">security</strong> of knowing that <em style=\"\">no one else can take your share</em>?</li>  \t<li>Do you want a business that <strong style=\"\">makes you money on autopilot</strong> while you sleep?</li>  \t<li>Do you want to know how to do all this <strong style=\"\">quicker</strong> than you ever imagined possible?</li>  </ul>  <p>  \t                After having massive success with this system myself, I analyzed, refined and defined my process <em style=\"\">so I could share the exact formula I used.  </em>  </p>  <p>  \t                To prove this works for others I had to find some people who needed help and now I am looking for more.  </p>  <p>  \t                I have now used this with other peoples businesses and the r<strong style=\"\">esults have been nothing short of incredible.  </strong>  </p>  <p>  \t                It’s taken me over a year to put this together in a <strong style=\"\">step-by-step and easy to follow format anyone can use.  </strong>  </p>  <p>  \t                Now you have the chance to <strong style=\"\">use this powerful system in any niche</strong> to <em style=\"\">absolutely dominate and crush it in any market.</em>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Now… Will This Work For YOUR Business?</em></strong>  </p>  <p>  \tAs long as you have a business that has a market to dominate…. <strong style=\"\">this will definitely work for you. </strong>  </p>  <p>  \t<strong style=\"\">You can cash in big time easier and quicker than you ever thought possible.</strong>  </p>  <p>  \tGo ahead right now and grab the exact steps you need to transform your life and create for yourself a solid, <strong style=\"\">massively profitable and dependable business</strong> <em style=\"\">that will eagerly and effortlessly provide for your family for generations to come.</em>  </p>  <p>  \t<strong style=\"\">&quot;It honestly feels so good knowing that if I went broke tomorrow, I would just refer to the same formula I am sharing with you today and I would make my money all over again… quickly and easily!&quot;</strong>  </p>  <p>  \tImagine the feeling of knowing that you can make money on demand.  </p>  <p>  \t<strong style=\"\"><em style=\"\">You can rinse and repeat this over and over again.</em></strong>  </p>  <p>  \tHere’s what is included in this profit building system…  </p>  <ul style=\"\">  \t<li>11 step-by-step, over the shoulder, fully professional HD quality videos</li>  \t<li>A 27 page companion eBook</li>  \t<li>Lifetime Support: I will personally answer all of your questions within a few hours!</li>  \t<li>30-Days Money Back Guarantee.</li>  </ul>  <p>  \tSee you inside,<br style=\"\">  \tBrett &amp; Sandor  </p>", 
    "end_date": null, 
    "title": "Build Profitable Business In a Competitive Niche Market", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Peter Brett Hitchcock", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415774_8aa0_3.jpg", 
    "course_url": "https://www.udemy.com/profitable-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T13:12:31Z"
}