{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Discover How To Create An Online Passive Income Business That Generates Income In As Little As 7 Days!</strong></p><p>Are you struggling to make money online?</p><p>Have you tried different methods of making passive income to supplement your current job but none have really worked?</p><p>Did you know that creating non-fiction books and selling them online is one of the easiest ways to generate passive income?</p><p>This course will teach you how to generate at least $30,000 per year of passive income using a proven passive income formula that works time after time!</p><p><strong>Easily Create Books For Hungry Markets &amp; Earn Royalties For Every Time Someone Buys Your Book! (That's REAL Passive Income!)</strong></p><p><em>Picture this:</em></p><ol><li>You identify a hungry market ready and willing to buy information to solve a problem they have</li><li>You get your book written by a ghost-writer (you simply compile the book using my downloadable book template)</li><li>You get a professional designer to create a killer book cover for only $5</li><li>You publish your book on Amazon and start seeing sales roll in the next day</li><li>You do the previous 4 steps over and over again and start increasing your passive income exponentially!</li></ol><p>I had been struggling to make passive income online until I came across a system for creating books and selling them online. Since then I have refined the system to be able to create books in under 3 hours of your time.</p><p><strong>Contents and Overview</strong></p><p>This course contains 37 lectures which are straight to the point and easy to follow and understand. It is designed for anyone who wants to start creating a passive income business online.</p><p>By the end of the course you will know how to immediately start making money online by creating and publishing books online for hungry markets.</p><p>If you are wanting to create an online business or supplement your current income with passive income, then this course is for you!</p><p>I hope to see you on this inside!</p>", 
    "end_date": null, 
    "title": "Build An Online Business in 5 Easy Steps", 
    "price": "20.00", 
    "instructors": "Timothy Dickeson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339098_b06c_2.jpg", 
    "course_url": "https://www.udemy.com/ins-and-outs-book-royalties/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T07:17:51Z"
}