{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Do you need a way to market without spending money?</strong></p><p style=\"\">It only costs time to setup a YouTube channel but making it a professionally looking channel can sometimes take days if you are not sure about what you are doing. This course will show you how to find professional graphics for your channel for only 1 dollar and it only takes a few minutes to do. There is probably no way for people to be found on the internet better than YouTube and with simple YouTube search engine optimization you can make yourself stand out in your field.</p><p style=\"\">YouTube can advertise your web page by linking it to all your videos and your brand can be seen by thousands without paying a dime. </p><p style=\"\">The only thing you need for this course is a computer with a connection to the internet and it helps to have some videos to upload to YouTube because doing what I show you is the most important thing. </p><p style=\"\">This course was designed for you if you have videos that are relevant to what you are selling or if you just want to create a channel for what your interests are. It is not only for marketing but also for those who want share with others their interests and get in touch with viewers with similar mindsets.</p><p style=\"\"><strong style=\"\">Are you frustrated that what you pay for ads is not making any extra sales?</strong></p><p style=\"\">It is true that even though people advertise to their target groups it does not always end up being a success. One of the most common reasons why is because people are just not ready to buy when they see your ad even if it&#039;s something they need. When you have a successful channel on YouTube people know where to find you when they are wanting to buy. Also, you are reminding them every time they visit YouTube and most people visit YouTube daily.</p>", 
    "end_date": null, 
    "title": "Build and customize a YouTube channel", 
    "price": "20.00", 
    "instructors": "Runar Sigurdsson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540572_8978_2.jpg", 
    "course_url": "https://www.udemy.com/buildyoutube/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T19:57:20Z"
}