{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>137,000 new business are started every day – and every one of them needs a website!</em></strong>\n\n  </p>\n\n<p>Creating websites is one of the fastest growing business opportunities. However most people assume that this is the domain of computer experts with years of experience. Sure, that’s the case if you’re trying to create a complex website with special links to other business systems. However for most of these 137,000 businesses this is not what they need, which means that if you have the right tools and some simple training you can tap into this huge business opportunity.\n\n  </p>\n\n<p>In this course we will show you how to use one of the easiest to use website design tools, Weebly, for creating websites. I’ve been creating websites for years, but I wanted to see if my daughter, who is new to this could also do it, and in no time she had her own business up and running. Together we will show you how you can easily create websites for businesses. The best part is that the income you earn is annuity income – that means you create the website once, but the customer keeps paying you, because after all they don’t want to lose their website.\n\n  </p>\n\n<p>So, join us to learn how easy it is, without any coding skills or any previous experience, to setup professional websites for businesses that will not only impress them, but set you up in your own home-based business!\n\n  </p>\n\n<p>\"<em>Craig is possibly one of the most interesting presenters I have encountered. His students love him and in public forums he is unequalled</em>.\" (Prof. Maharaj)</p>", 
    "end_date": null, 
    "title": "Business in a Box", 
    "price": "25.00", 
    "instructors": "Craig Blewett", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/775880_88b6_2.jpg", 
    "course_url": "https://www.udemy.com/business-in-a-box/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T08:47:56Z"
}