{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        <strong>\"You can own your favorite dream cars every couple of years without coming out of pocket anything. In most cases you drive for free, in some cases you can turn a profit\"</strong></p>  <p>In this course, you will learn:</p><p>- HOW TO OWN YOUR DREAM CAR FOR FREE</p><p>- HOW TO ACTUALLY MAKE MONEY OWNING YOUR DREAM CAR</p><p>- EXACTLY WHAT BIG DEALERSHIPS ARE KEEPING FROM YOU</p><p>- HOW TO FIND THE RIGHT DREAM CAR</p><p>- HOW TO NOT GET RIPPED OFF ON YOUR NEXT CAR PURCHASE.</p><p>  \t        Buying and selling luxury and exotic cars is more than a business, its about the understanding of supply and demand, forecasting of future values and systematic approach to depreciation. While most ordinary people believe the old tales of buying cars at the end of the month to a get a better deal, or perhaps bluffing the dealer; those rules no longer apply. Today's car buying system is all based on numbers, time and supply and demand and these systematic ways dealers think in order to make a profit from you are available for you to ensure you make a profit for yourself.  </p>  <p>  \t        In this course, I extensively take you through all the following steps to ensure you can buy, sell, and trade luxury and exotic cars for fun and profit.  </p>  <p>  \t        - Everything you need to know about the US car market  </p>  <p>  \t        - The art of supply and demand, and its impact.  </p>  <p>  \t        - The buying process broken down step by step  </p>  <p>  \t        - How to become an expert negotiator.  </p>  <p>  \t        - All the financial loopholes you need to know, so you don't invest your own cash.  </p>  <p>  \t        - Each car brand and model broken down for you  </p>  <p>  \t        - How to avoid high repair costs.  </p>  <p>  \t        - Amazing case studies to help guide you.  </p>  <p>  \t        I have used this system to personally drive and enjoy some of today's most amazing exotic cars like Lamborghini, Ferrari, Maserati, Aston Martin and so many more. I have owned over 100+ cars in the past 8 years and continue to use this system to ensure I keep having fun without losing money, and in many cases as you will see, I actually make a nice profit.  </p>  <p>  \t        Stop falling for 0% deals and instead understand the true value of how money functions in the realm of the car industry and how you too can take advantage of it.  </p>  <p><strong>This course is backed by Udemy's 30 day money back guarantee</strong></p>  <p>  \t    PS: Keep in mind that even if luxury and exotic cars do not appeal to you, the information in this course will save you thousands on your next car purchase.  </p>", 
    "end_date": null, 
    "title": "Business Strategies and Tips: Buying & Selling Luxury Cars", 
    "price": "50.00", 
    "instructors": "Pejman Ghadimi", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/122016_2b89_3.jpg", 
    "course_url": "https://www.udemy.com/business-strategies-and-tips-buying-selling-luxury-cars/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-19T01:18:54Z"
}