{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>⇉ Gain Access to HOURS of videos and downloadable resources</strong> to see how I make HUGE profits on eBay and know that when you take this course, you can do it too!</p><p><strong>⇉ Join OVER 2000 students learning</strong> how make FAST CASH based on my experience of 35k+Sales on eBay! You can do it yourself if you have little time and money, and are willing to work on the weekends!</p><p>Upfront costs are minimal and your initial goal is $2,000 profit per month. </p><p>The secret to getting ahead is to get started</p><p>Your success will be determined by your ability to perfect STEP ONE! Everything after is BONUS CASH!!!</p><p>It doesn't cost anything to open an eBay account, to work with legitimate sell, and to list products on eBay. </p><p>You learn how to specific strategies used by successful resellers to GUARANTEE that your item will sell for more than you paid for it. </p>You'll learn how to make the deals COME TO YOU.<p>You'll learn the most important factors to getting the most profit on eBay. </p><p>You'll learn how to keep getting great ratings that improve your trust amongst buyers on the internet.</p><p><strong>Setting yourself up for success with </strong><strong>Udemy's 60 day money back guarantee.</strong></p><p>Buying items and selling them in the same day for FAST CASH. </p><p>Asking the instructor unlimited questions and getting the extra guidance you deserve to accomplish the initial goal of $2,000 profit per month. </p><p>There isn't a course like this anywhere else. That means you'll have limited competition in this area to maximize your probability for success.</p>", 
    "end_date": null, 
    "title": "Buying & Reselling Products Online with Popular Marketplaces", 
    "price": "20.00", 
    "instructors": "Forrest Neal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465222_0b71_2.jpg", 
    "course_url": "https://www.udemy.com/buying-and-reselling-products-online-with-popular-marketplaces/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T19:07:29Z"
}