{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Interested in learning how to start a life coaching business? Or are you already a life coach and want to learn how to make money on a more consistent basis?  Well you are in the right place! <strong>Course updated May 7, 2016.</strong></p>\n\n<p><strong>Coaching Business 101: How to Start a Life Coaching Business is for you if:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>You are currently a life coach and see the potential of starting a life coaching business but you want the best insight for how to get started.</li><li>You want practical strategies and advice on starting a life coaching business that have already been tested and proven to work.</li><li>You would like creative yet logical ways to grow your life coaching business from the ground up.</li><li>You would like to know how you can increase your life coach salary without working 90 hours a week.</li><li>You are ready for life as a business owner but just need to know the foundation pieces so you feel more comfortable with your decision to start a life coaching business.</li><li>You are committed to following through with what you're about to learn.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why Take Coaching Business 101: How to Start a Life Coaching Business Course?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>This is why you are here because you want to know how to become a life coach with paying clients without spending thousands of dollars and years to do it.</li><li>Now keep this in mind. Every piece of advice, strategy and logical approach to building a life coaching business has been tested; none of this is theory.</li><li>You get insider insight on how to make money and save money in your life coaching business.  Money problems causes most life coaches to fail in business and I don't want that to happen to you.</li><li>You learn what to do and what not to do based on my experiences having worked with thousands and thousands of clients over the past 25 years.  Here is a sampling of what you will learn:</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What\nis covered in Coaching Business 101: How to Start a Life Coaching Business?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol><li><strong>Section 1-</strong> shows you how to make the most of this Life Coaching Business course by giving you some simple exercises and activities that set you up for success.</li><li><strong>Section 2 - </strong> gives you the steps on how to prepare yourself for success as you start your life coaching business from home.  This often overlooked first step really is the difference-maker in your long-term business success.</li><li><strong>Section 3</strong> - You will learn how to develop a guiding mission and vision statement for your life coaching business</li><li><strong>Section 4</strong> - You will learn how to develop yourself into the kind of person who can run a  successful life coaching business</li><li><strong>Section 5</strong> - You will learn how to find and develop your Life Coaching Niche setting you up for business success</li><li><strong>Section 6 </strong>- You will learn the formula for finding your Life Coaching target market so that you can give them what they want</li><li><strong>Section 7</strong> - You will learn the step-by-step process for developing your Life Coaching Business as the only choice for your target market</li><li><strong>Section 8</strong> - Be Seen, Be Heard &amp; Be Quoted as a Life Coach; You will learn the step-by-step process for developing your Life Coaching Business platform</li><li><strong>Section 9 </strong>- Life Coach Salary - How to Sell Life Coaching; You will learn exactly what you need to do to sell your life coaching services and earn a great life coach salary</li><li><strong>Section 10</strong> - You will learn the website options available for life coaching business success and strategies to make them sell for you</li><li><strong>Section 11</strong> - Automate Your Life Coaching Businesses; You will learn how to run your life coaching business 24-7 without having to do any more work</li><li><strong>Section 12 </strong>- Business Systems for Busy Life Coaches; You will learn simple stress-free business systems that help you run your life coaching business easily</li><li><strong>Section 13-</strong> Marketing Fundamentals Every Life Coach Needs; You will learn marketing fundamentals to fearlessly market your life coaching business with confidence</li><li><strong>Section 14</strong> - Easy Strategies for Building Your Business; You will learn easy strategies to build your life coaching business so you make more money with less effort</li><li><strong>Section 15 </strong>- You will be provided with resources on an ongoing basis that will support your life coaching business success</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>How Will Coaching Business 101: How to Start a Life Coaching Business Benefit You?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>I know you are busy and I have meticulously created this course with your success in mind. This training is no-fluff essential information you need to succeed easily and quickly.</li><li>I understand how to start a life coaching business from the ground up.</li><li>I am a certified life coach but quickly learned that the life coaching training I received did not even touch on how to build a business. I had to learn that myself.</li><li>You learn the only 13 steps you need to know to start a life coaching business and build that business.</li><li>You get life coach salary insights that guide you past money making mistakes.</li><li>You get the inside track on what you need to do to start a life coaching business from nothing plus what you need to prepare to grow that business.</li><li>If that's something you would like to achieve, you have selected the right course to take.</li><li>If you complete this entire course and implement everything you learn you will have a good solid foundation to being successful in business.</li><li>Remember, it doesn't matter if you are new or already in full swing, I've been there and I can show you how to make it happen.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>When Can You Take Coaching Business 101: How to Start a Life Coaching Business Course?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>What are you waiting for? If you’re looking for the exact steps you need to start a life coaching business that makes money and makes a positive difference, then look no further.</li><li>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</li><li>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; NO EXTRA COST TO YOU.</li><li>REMEMBER: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</li><li>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>*************************************************************************************************************</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Still not convinced? Make sure you watch some of the FREE PREVIEWS available to learn more about the course and more about me your instructor. Plus you can check out some of the reviews. Here is just one of the many examples:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What people are saying about Coaching Business 101: How to Start a Life Coaching Business created by Louise Anne Maurice of Womanly Wealth Academy:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>\"</em></strong><em>Inside Track on Making Money Life Coaching - I have been struggling to make money as a Life Coach, feeling scattered because I joined a mish-mash of free training, listened to too many people and couldn’t put it all together. This course simplified it so I am not so overwhelmed and showed me everything in the right order. I have a plan now with the exact steps to take. You saved me time and money. Thanks!\"</em></p>", 
    "end_date": null, 
    "title": "Coaching Business 101: How to Start a Life Coaching Business", 
    "price": "25.00", 
    "instructors": "Womanly Wealth Academy, Louise Anne Maurice", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442218_9346_7.jpg", 
    "course_url": "https://www.udemy.com/make-money-life-coaching-how-to-start-life-coaching-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T21:40:40Z"
}