{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>4 Week Step By Step Guide To </strong></p><p><strong>Make Money Online (With Solo Ads)</strong></p>\n\n<p>This training is meant for newbies in internet marketing. If want to learn how start making money online, this course is for you. </p>\n\n\n\n<p><strong>What Isn't Required:</strong><br></p>\n\n\n\n<ol><li>No Special Skills Needed</li><li>No Selling Products</li><li>No Expensive Software To Buy (I Will Show You A FREE Service + Provide You The Tools)</li><li>A Lot Of Time (Just Dedicate <strong>1 Hour A Day</strong>, 30 Minutes To View Training Videos, 30 Minutes To Take Action)</li></ol>\n\n\n\n<p><strong>4 Week Plan Overview:</strong></p>\n\n\n\n<ul><ul><li>Week 1: Prepare Your Emails</li><li>Week 2: Prepare An Irresistible Free Gift</li><li>Week 3: Drag &amp; Drop Your Webpage </li><li>Week 4: Drive Traffic And Build Your Email List</li></ul></ul>\n\n\n\n<p><strong>Here Are Your Bonuses:</strong></p>\n\n\n\n<p><strong>Bonus 1: </strong>60 Minute Private Coaching <strong>($147 Value)</strong></p>\n\n\n\n<p>Let's face it. Most people just go through the videos and do not really take action. If you are serious about success, you need a coach to keep you on track.</p>\n\n\n\n<p>As my student on Udemy, you are entitled to 60 minutes of One On One, Private Coaching with me. </p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Bonus 2:</strong> Review Your Work <strong>($147 Value)</strong></p>\n\n\n\n<p>I have spent a few years figuring out Internet Marketing and Solo Ads. Now this is what I do for a living. </p>\n\n\n\n<p>Imagine This: </p>\n\n\n\n<p>Instead of being a newbie, you are getting the benefit of starting out with at least 2 years experience. </p>\n\n\n\n<p>I will hold your hand so you do not have to go through the entire learning process.</p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>Bonus 3:</strong> Access To My Library <strong>($2997 Value)</strong></p>\n\n\n\n<p>You do not need to spend loads of cash buying products on the internet. Over the years, I have accumulated great products to build my business. </p>\n\n\n\n<p>Now, you are given unlimited access to my entire library. </p>\n\n\n\n<p>Yes, I bought the rights to these products and I am giving them to you.</p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>Bonus 4: </strong>Internet Marketing &amp; Business Webinars ($997 Value)</p>\n\n\n\n<p>Full Of \"AHA\" Moments. That's what these webinars are meant to do for you. I will be covering various topics that are crucial to making money online. Each webinar is a summary of a standard video course (I pay $47-$297 to learn these topics)</p>\n\n\n\n<p>This section is ever growing, and the best part is....</p>\n\n\n\n<p><strong>You Get Unlimited Access To Them.</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>Unannounced Bonus: </strong>Additional Help For Action Takers <strong>($? Value)</strong></p>\n\n\n\n<p>It is my habit of rewarding my students who take action. Yes, I want to help you with your business.</p>\n\n\n\n<p>Show me your effort and I will guarantee your success.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>How Fast You Can Start: </strong>It is recommended that you spend 7 days to learn the entire process. Alternatively, you can complete the course in a day and implement the action steps after learning.</p>\n\n\n\n<p><strong>Step By Step Guidance.</strong> (Live Demo Included) I will be showing you the exact steps to build your business. You get to look over my shoulder while I set everything from scratch.</p>\n\n\n\n<p><strong>Why Take This Course:</strong> If you tried internet marketing, affiliate marketing or creating your own product but failed, it is normal. It takes a lot of skill to be successful at those.</p>\n\n\n\n<p>The good news: being a solo ad seller is the perfect stepping stone to learn and master the basics of internet marketing. Selling solo ads is the best way to generate income while learning the business.</p>", 
    "end_date": null, 
    "title": "Copy & Paste To Make Money Online (Solo Ad Business)", 
    "price": "20.00", 
    "instructors": "Jay Tiew Jin Jie", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777776_8e22_2.jpg", 
    "course_url": "https://www.udemy.com/copy-paste-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T14:24:21Z"
}