{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>  \t                Over 1000 successful students enjoying this course!  </strong></p>\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n\n\n<p>  \t                  <strong>Learn how to make money selling your stuff successfully on Craigslist, a popular and free site! </strong>  \t  \t              After taking this course, selling your stuff online will be both easy an profitable, and accomplished without any special software or skills.  </p>\n\n\n\n<p>  \t                  Every wonder why some folks sell their items much faster on Craigslist? Do you wonder how you could best get rid of the things you have laying around? How you can make your buyer feel like they got a great deal? </p>\n\n\n\n<p><strong>  \t                  At the end of this course, you will be able to:  </strong></p>\n\n\n\n<ul>  \t<li><strong>Sell your used items for the price they're worth.</strong></li>  \t<li><strong>Make quick sales. </strong></li>  \t<li><strong>Practice the best methods to posting photos </strong></li>  \t<li><strong>Write attention grabbing titles and descriptions</strong></li>  \t<li><strong>Remove the clutter from your life!</strong></li>  \t<li><strong>You will have the tools and methods that will make your spring cleaning not only profitable, but also a breeze, as well as fun!</strong></li>  \t<li><strong>Master selling techniques using Craigslist!</strong></li>  </ul>\n\n\n\n<p>  \t                  A great skill to have for both beginners and intermediate Craigslist sellers.</p>\n\n\n\n<p>  \t                  The format is video lectures with notes, that contain tips and bullet-ed summaries. Try the techniques in this course, and come back to tweak them and learn more.  </p>\n\n\n\n<p>  \t                  What this course is not: Selling services or techniques that go against Craigslist Terms of Service (TOS). In fact, I'll show you that you don't need to break any rules to get your stuff sold!  </p>\n\n\n\n<p>  \t                  I designed this course to be easily understood by both beginners as well as intermediate Craigslist users.  </p>", 
    "end_date": null, 
    "title": "Craigslist Secrets - How to Successfully Sell Your Stuff!", 
    "price": "20.00", 
    "instructors": "Sicco Rood", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/116328_00c3_4.jpg", 
    "course_url": "https://www.udemy.com/craigslist-revealed/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-07T01:55:58Z"
}