{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Do you have a manuscript, eBook or PDF you want to turn into a physical book?  </p>  <p>  \t  Does the cost of author formatting services put you off?  </p>  <p>  \t  Are you worried if you do it yourself, you might make mistakes, and end up looking like an amateur?  </p>  <p>  \t  Or do you want to learn to format books for print, and sell the service?  </p>  <p>  \t  If so, this course has been put together with you in mind.  </p>  <p>  \t  Book Typography will take you step by step from manuscript to print-ready PDF in Microsoft Word. From big decisions like trim size, typeface and font choices, through the technical aspects of setting margins and dealing with chapter pages, running headers, front and back matter and correct folio numbering, to fine-tuning issues such as dealing with widows and orphans while retaining a square footline, you will learn best practice without being overwhelmed with jargon.  </p>  <p>  \t  The bulk of the course consists of over-the-shoulder screencasts, showing how to apply each step to a living manuscript. These are supplemented with just enough theory lectures, including  text, PDF and audio lectures, to ensure you understand the choices available to make informed decisions.  </p>  <p>  \t  Time to complete will depend on the length of your manuscript, but if you want to watch the course from beginning to end before you get started, you should allow 2-3 hours.  </p>  <p>  \t  This course is managed by an active and engaged instructor, ready to answer your questions. So, if you have a completed manuscript (or one in the final stages of editing), a recent version of MS Word, or an open source equivalent, and the desire to turn it into something special, take this course today.  </p>", 
    "end_date": null, 
    "title": "Create Beautiful Book Interiors: Easy Typography in MS Word ", 
    "price": "40.00", 
    "instructors": "Gail Seymour", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387764_2a04_4.jpg", 
    "course_url": "https://www.udemy.com/book-typography-manuscript-to-print-ready-pdf-in-ms-word/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T16:03:59Z"
}