{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>ONLINE PRODUCT CREATION SIMPLIFIED.</strong></p><p><strong><em>Learn the simple steps to creating your own digital products for unlimited profit potential over and over.</em></strong></p><p>This course will show you how simple it is to create your own projects with resources you already have and can easily get access to.</p><p>If you have ever thought about creating your own products to showcase to the world then you are in the right place. </p><p><strong>Learn in 5 short videos how easy it is to:</strong></p><ol><li>Generate profitable ideas..Over and over.</li><li>The simple and highly effective 3 step formula to creating your own info products that will be UNIQUE to you.</li><li>How to take your products to the global stage.</li><li>Generate as much or as little revenue as you want from your products.</li><li>How to never feel overwhelmed or stuck on how to make all of this work for yourself ever again.</li></ol>And much more. This course is taught over 5 short and easy to follow videos with ebook and slideshow's attached to help not only aid the videos but so that you can choose to read the content if you wish instead.<p>You should enrol on this course if you:</p><p>Have always thought about creating your own course to put up on Udemy or elsewhere.</p><p>Want to start a business online.</p><p>Build a brand for yourself.</p><p>Grow or build an income stream for yourself.</p><p>Teach others how to do what you do but don't know how to get started.</p><p><strong>What's on the inside?!</strong></p><p><strong>Video 1 - Understanding the true power of YOU. (See how much you already have access to without even realising it)</strong></p><p><strong>Video 2 - Content creation Part 1 - Powerful Idea Generation M</strong><strong>astered. (Never get stuck on trying to get ideas on what to create again)</strong></p><p><strong>Video 3 - Content Creation Part 2 - Resources and Tools to Get Going....TODAY. (I'll show you how to utilise the tools you already have in you possession)</strong></p><p><strong>Video 4 - What now? Monetising! (Start to generate revenue today...or give your stuff away for free to help build your brand quicker)</strong></p><p><strong>Video 5 - Easily Become MORE PRODUCTIVE! (Procrastination kills all of us. It stops after today.)</strong></p><p><strong>What you will need:</strong></p><ol><li>A laptop.</li><li>An internet connection.</li><li>Ability to spend 45 minutes to an hour with me.</li><li>To take action and implement what you learn here.</li></ol><p><strong>Why take this course?</strong></p><p>This course will take no longer than 1 hour to go through and you can actually start using the contents of this course to your advantage within the next 2 hours from now. </p><p>I have created a simple easy to digest course that requires little effort on your part to go through. I have included reading material and downloads to go along with the videos should you benefit from the ebook and pdf versions instead. </p><p><strong>Who is the target audience?</strong></p><ol><li>Anyone who wants to easily make money online, following a step-by-step training.</li><li>Anyone looking to create a product or a course to call their own.</li><li>People from any country, any age or with any ability.</li><li>Anyone looking to get started online and to build a second income stream.</li><li>The course is suited for everybody from newbies to experts.<span></span></li></ol><strong>As a Student, what will I get from this course?</strong><ol><li>As mentioned above, you will get a 5 part easy to follow video series teaching how simply you can create your own products in any niche that you can generate revenue from and then scale to any size you wish.</li><li>As a student of this course, you will never struggle with 'where to start' ever again. I will show you how simple it is to generate your own ideas and turn them into profitable assets.</li><li>The ability to start implementing what you learn TODAY. As soon as an hour or 2 after going through this course.</li></ol>I look forward to interacting with you on the inside. <p><span></span></p><p><span></span>Sam.</p>", 
    "end_date": null, 
    "title": "Create a Course Easily and Quickly For Beginners", 
    "price": "20.00", 
    "instructors": "Sam Baz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545548_5e0d_3.jpg", 
    "course_url": "https://www.udemy.com/online-product-creation-simplified/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T15:07:08Z"
}