{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Cuando comencé a crear este curso no me dí cuenta que podría ser un potente marco de trabajo <strong class=\"redactor-inline-converted\">para llevar a alguien desde sus inicios</strong> <strong class=\"redactor-inline-converted\">a lo más alto de su propio negocio online</strong>. \n</p>\n\n<p>Este curso tiene casi 4 años en línea, <strong class=\"redactor-inline-converted\">varias actualizaciones</strong>, más de <strong class=\"redactor-inline-converted\">1.500 alumnos</strong> y <strong class=\"redactor-inline-converted\">muchos casos de éxito</strong>. </p>\n\n<p>Gracias a este pequeño resumen y a lo que he podido ver a lo largo de estos años, me doy cuenta del potencial de plataformas de enseñanza como Udemy, donde podemos  ayudar a los que vienen detrás en el aprendizaje de Internet para lograr el éxito.</p><p>-----------------------------------<br></p><p><strong class=\"redactor-inline-converted\">SIN RIESGOS</strong></p><p>Antes de que sigas, porque sé que no podrás parar después de leer esta introducción, te quiero decir algo: <strong class=\"redactor-inline-converted\">Tú éxito es mi éxito</strong>. </p><p>Si mi curso te gusta y te ayuda, yo obtendré dos cosas: </p><p>1) la satisfacción de ayudar a alguien a tener una vida mejor, y  </p><p>2) una buena calificación en Udemy.  </p><p>Por eso, te quiero hacer dos recordatorios:<br></p>\n\n<ul><li>Udemy tiene una <strong class=\"redactor-inline-converted\">garantía de devolución del dinero de 30 días</strong>. Si no te gusta el curso, Udemy te devuelve el importe.<br></li><li>ADEMÁS: En el final del curso hay una <strong class=\"redactor-inline-converted\">guía de control de garantía</strong>, si te gusta el curso y no quieres exigir un reembolso de udemy o ya pasó mucho tiempo, PERO has aplicado todos los conocimientos aprendidos aquí y no has generado ni un céntimo de $ o €, yo personalmente te devolveré el importe del curso.<br></li><li>Por último: El 10% de las ganancias que haga con el curso durante el mes de mayo serán donadas a <strong>Charity Water</strong>. Una asociación que pone en manos de los más necesitados la posibilidad de tener agua potable.</li></ul><p>-----------------------------------</p><p>\"<strong class=\"redactor-inline-converted\">¿Qué puedo aprender en este curso?</strong>\"... preguntas. Y yo te respondo: </p><p>\"En este curso encontrarás <strong class=\"redactor-inline-converted\">todo lo que necesitas saber</strong> para poner en marcha <strong class=\"redactor-inline-converted\">tu primer negocio online</strong>.\"<br></p><p>Estos son <strong class=\"redactor-inline-converted\">algunos de los aprendizajes que obtendrás</strong> con el curso:</p><ul><li>Aprenderás a crear <strong class=\"redactor-inline-converted\">conceptos</strong> e <strong class=\"redactor-inline-converted\">ideas de negocios exitosos que te ayuden a generar buzz en un corto período de tiempo. </strong>Cosas como delimitar tu proyecto, crear el concepto, definir tu público target, elegir un nombre (y un dominio, ¡claro!), y poner en marcha los primeros mensajes de tu proyecto.<br></li></ul><ul><li>Aprenderás sobre <strong class=\"redactor-inline-converted\">planificar contenidos y marketing online para atraer usuarios a tu proyecto</strong>. Cosas como redacción web, definición de formatos de divulgación de tu proyecto, SEO (posicionamiento en buscadores), calendario editorial, manejo de redes sociales, instalación y uso de herramientas para creación y gestión de contenidos (keyword planner, adwords, etc.), instalación de wordpress y mejores prácticas de redacción web. <br></li><li>Aprenderás sobre <strong class=\"redactor-inline-converted\">monetización</strong>. Cosas como: venta de publicidad directa o indirecta, gestión de programas de afiliados, donaciones, cómo vivir de tu proyecto, etc.<br></li></ul><p><strong class=\"redactor-inline-converted\">¿Por qué deberías confiar en mí?</strong></p><p>Hace 7 años comencé un proyecto de una editorial de viajes y tras muchos traspiés (que tú te puedes ahorrar haciendo este curso) hoy puedo decir que soy mi propio jefe, de hecho, soy el capitán de un barco con gente maravillosa que está en camino a convertirse en una de las editoriales de viajes online de mayor éxito del mundo hispano y lusoparlante. </p><p>Hoy por hoy, mi proyecto (guiajando.com) cuenta con más de 2 millones de visitantes y 28 millones de impresiones de publicidad, además de ser un proyecto actualmente rentable y con proyecciones muy buenas.</p><p>Aprende cómo he logrado hacer lo que me gusta y disfrutar cada minuto. Tú también puedes hacerlo.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Si tu web demora algún tiempo en despegar, lo bueno es que todo <strong class=\"redactor-inline-converted\">lo que aprenderás en este curso te servirá también para prestar servicios como redacción web, online marketing, publicidad online, mail marketing, etc.</strong> Así <strong class=\"redactor-inline-converted\">podrás $acarle provecho</strong> a tus nuevos conocimientos rápidamente ofreciendo estos servicios.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br>Te explico más:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tHay una revolución detrás de los negocios online que <strong class=\"redactor-inline-converted\">sólo un porcentaje de personas muy pero muy pequeño conoce</strong>.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tEn un principio, este curso fue llamado \"Habla de tu ciudad y vive de ello\", pues se enfocaba en el turismo, pero pronto me di cuenta que era útil en prácticamente cualquier área de negocios.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tLa mejor confirmación de que <strong class=\"redactor-inline-converted\">este es un curso que le cambiará la vida a muchas personas</strong> es que, de todas las personas que conozco que se están desarrollando en este campo TODAS generan dinero a costa de sus experiencias.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tEl curso incluye, además de soporte en vídeo con demostraciones de las acciones específicas que debemos hacer y capturas de pantalla paso por paso, un repositorio central de materiales que te ayudarán a organizar el contenido, ideas para aprender a escribir tanto para Google como para tu usuario tipo, elegir tu nicho, aprender cuestiones técnicas sobre cómo instalar un blog, cómo y dónde buscar al programa de afiliado que necesitas (y cómo convencerlos de que te necesitan), cómo generar tráfico rápidamente.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tEn el curso también hablo sobre las formas de monetizar tu sitio, asociaciones con comercios de tu ciudad, fuentes de ingresos paralelas (ideal para los que estáis desempleados y necesitáis dinero YA), conversión online y un sinfín de otras cosas más. Los que me conocen saben que no soy ningún holgazán a la hora de crear material útil.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tNo te preocupes si no sabes cómo rentabilizar contenido online, porque yo te diré cómo disfrutando y escribiendo sobre lo que te gusta, porque la idea es que ganes dinero con tu hobbie, con lo que te apasiona.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">El truco está en lograr diferentes fuentes de ingresos</strong> a través de tu blog o guia de tu ciudad y que cada una de estas fuentes genere dinero por su cuenta. Sumando pequeños montos podrás llegar a cientos de dólares a final del mes. Y si eres lo suficientemente bueno y constante como yo, probablemente miles de dólares al año.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tNo. <strong class=\"redactor-inline-converted\">Tan sólo necesitas saber escribir</strong>. Otras personas pueden optar por editar videos o hacer programas de radio online (podcasts).  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tPara aplicar mis métodos sólo necesitarás tener la capacidad de abrir un blog. Si no sabes cómo abrirlo, no te preocupes, que yo te enseñaré.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tLa mayoría de los métodos para generar ingresos online son sumamente complicados. Muchas veces se requiere tener una tienda online y alguien con conocimientos técnicos. Con mi curso podrás dominar muchos aspectos técnicos, pero nunca tendrás que programar o hacer cosas complicadas.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tEl primer año que yo hice todo lo que aprendí para hacer este curso hice casi USD 3.500$ – Con tu pasión estoy seguro que puedes igualar o sobrepasar este retorno de inversión. Además, ya sabrás de antemano todas las cosas que yo no sabía en ese momento.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t¡Así que anímate y únete a todos aquellos que ya hablan y viven!  </p>", 
    "end_date": null, 
    "title": "Crea una web exitosa: desarrollo de negocios online de cero", 
    "price": "50.00", 
    "instructors": "Flavio Amiel", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/100716_08e5_5.jpg", 
    "course_url": "https://www.udemy.com/habla-y-vive-desarrolla-tu-propio-negocio-online/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-02T23:20:12Z"
}