{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Do You Want to Learn How I Make $1,000+ in One Hour Holding Webinars From the Comfort of My Home? </strong><strong style=\"\">More Importantly, Do You Want to Learn How You Can Easily Do This Too? </strong></p><p style=\"\">Then You <em style=\"\">NEED</em> to Dive in and Join This Course Now!</p><p style=\"\">**Fully Updated For July 2015**</p><p style=\"\"><strong style=\"\">Webinars are the NUMBER 1 way to make money online.</strong> I have no doubt about it.</p><p style=\"\">What is a webinar you ask? It is basically a seminar that you hold online, instead of attending in person, guests log on and watch from their computer.</p><p style=\"\">Why is this absolutely the easiest, fastest, and best way to make money online and/or build and online business? Glad you asked...</p><ul style=\"\"><li style=\"\"><strong style=\"\">You can hold webinars from the comfort of your home- </strong>You don't need to go any where or do anything special, literally all you need is a laptop and internet connection.  You can even do one in your pajamas if you want!</li><li style=\"\"><strong style=\"\">Webinars typically only last between 60-90 minutes-</strong> I've found that people enjoy webinars the most when they are between an hour or an hour and 30 minutes tops.  That means webinars WON\"T take up tons of your precious time.</li><li style=\"\"><strong style=\"\">It utilizes the power of \"One to Many\"-</strong> You can literally get HUNDREDS of people to attend your webinar, meaning you can pitch one product to these guests at the end, and take advantage of multiple sales at once. Just think, if you sell a product or program that cost $497 (I'll show you how) and make 5 sales, that's $2,485 in your pocket...all in one hours work!</li></ul><p style=\"\"><strong style=\"\">Can you see the power of doing webinars now?</strong> All you have to do is choose the topic you want to present on (something you have a decent knowledge about), drive people to register and attend, create the presentation, and hold the webinar, where you will pitch a product or service at the end!</p><p style=\"\">And I will show you how to do the entire process...THE RIGHT WAY!</p><p style=\"\"><strong style=\"\">Here's what you will learn by the end of the course:</strong></p><ul style=\"\"><li style=\"\">Choose a Webinar Topic That People Can't Wait to Attend and Listen to YOU</li><li style=\"\">Create a Registration Form That Will Flood Your Webinar With Hundreds (or even thousands!) of Attendees and Buyers</li><li style=\"\">Structure the Perfect One Hour Webinar That Will Have Your Attendees Practically Lining Up to Buy Your Offer</li><li style=\"\">Create a Product That Your Attendees Can't Resist to Buy at the End of Your Webinar</li><li style=\"\">The Places to Go to Quickly Fill Your Webinar with Guests to the Max</li><li style=\"\">Set up the Almighty Follow-up Emails and Recordings That Will Sell Your Products on Auto-Pilot With Out You Working a Single Second!</li><li style=\"\">And Much More!</li></ul><p style=\"\"><strong style=\"\">This course is meant to be a <em style=\"\">Quick Start Guide</em> to holding your very first profitable webinar as <em style=\"\">quickly</em> as possible. </strong> My goal is to teach you the material in short, easy to understand steps, so you can learn the material and make money from your own webinar as fast as possible!</p><p style=\"\">I want you to experience the power of making the kind of money I am with your very own webinar.  So if you are ready to learn exactly how to do that, step by step, with my guidance every bit of the way, then <strong style=\"\">register for this course now</strong>, and I can't wait to teach you!</p><p style=\"\"><strong style=\"\">JOIN THE THOUSANDS OF PEOPLE MAKING A FULL TIME LIVING WITH WEBINARS. </strong></p><p style=\"\"><strong style=\"\"><span style=\"\"></span>ENROLL IN THE COURSE NOW!</strong></p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Create, Host, and Promote Your Own Online Webinars", 
    "price": "35.00", 
    "instructors": "Jeremy Sandow", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428244_9e44_9.jpg", 
    "course_url": "https://www.udemy.com/create-host-and-promote-your-own-online-webinars/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T04:34:02Z"
}