{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong>5 Star Review - Andrew Lo says <br></strong></p><p><strong>\"Simply Awesome!!!</strong></p><p><strong>Short and concise. Awesome! Thank you so much for taking time to share this great piece of knowledge of yours!\"</strong><br></p><p>Do you struggle to come up with new ideas for courses, products, or even services? Are you wanting to come up with the next million dollar or even billion dollar idea?</p><p>Let your creativity flow and grab your journal or notebook and start writing!</p><p>You are about to discover how to easily spot ideas easily - CREATE has been designed to be a step by step system to continuously come up with ideas. You will be shown how to look at your existing hobbies and even your current job for ideas - ideas are all around you, you just need a system to harness the power to CREATE your own ideas.</p><p>You will learn how to spot ideas on television, radio, Internet and even Amazon and the library. Finally recognize the psychology of the Rabid Buyer - once you understand this you will be able to find ideas specifically for them.</p><p>You will be exposed to how to narrow down your ideas so that you can focus on the ones that have the most profit potential. Learn to ask specific questions that will give you the answer you are looking for that will determine if your product idea has the desired profit potential you are after (you will also learn what bottlenecks may be present and how to work around them if possible)</p><p>Finally you will learn how to narrow down the format of the product idea - whether it will be physical, digital or a combination of multiple components.</p><p>Take this course today - you are protected by a no questions 30 day money back guarantee so you have nothing to lose and everything to gain.</p><p><br></p>", 
    "end_date": null, 
    "title": "Create: Discover How to Be an Idea Machine", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646348_46d3_2.jpg", 
    "course_url": "https://www.udemy.com/idea-machine/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T01:39:47Z"
}