{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>_________________________________________________________________________</strong></p>\n\n<p><strong>✓ Course Updated as of Sunday May 1st, 2016<br>✓ Teacher has more than 1,5K happy students.<br>✓ 100% Student questions solved. Also via Skype.<br></strong><strong>✓ Free access to my How to Create your Professional Email Course</strong></p>\n\n<p><strong>_________________________________________________________________________</strong></p>\n\n<p>Students, just need a computer, an internet connection to get started.</p>\n\n<p>100% Beginner-Friendly.</p>\n\n<p>No matter where you are located, what your nationality or age is, you will get a vast knowledge and entire description on the process of how to create a beautiful, stable, and impressive professional website. It's 2015. Let's face it. No matter if you have a car shop or a multi million dollar cake-shop business, you need a website. There is no other way that people are going to find you.</p>\n\n<p>In this course, I commit to teaching you how to:</p>\n\n<ol><li>How to study this course.</li><li>How to create your Wix account.</li><li>How to find out how you want your website to look like</li><li>Correctly identify the template that most fits your taste.</li><li>Select and successfully save that template.</li><li>Edit your website from all over the world. Easy.</li><li>Spotlessly operate with links, images, and textfields.</li><li>Edit the Heather and the Footer in optimized manner.</li><li>Test your website</li><li>Publish your website, under your very own domain.</li><li>Integrate Google Analytics to track and learn about your users and clients.</li></ol>\n\n<p><br></p>\n\n<p>The terminology utilized in this course is easy to understand for non-native english speakers, for the purpose of making the learning of this course possible for anyone who has a basic english level. There is no necessary previous experience for taking this course. You will learn absolutely everything necessary in this course, and you will earn a huge knowledge on how to create your <strong>very own and high-end professional website</strong>. As your teacher, I commit, to solving any doubt wherever it might appear. Please use this service at all times! It should take a couple of days, on an average, to effectively complete the course, since it's structured on easy-to-follow lectures put in a chronological order for the ease of learning. Make the most out of your free time. It will be a very easy beginning, and those who show enthusiasm and are constant on the course instructions, will feel very well compensated.</p>\n\n<p>Ready for a change?<br>Get yourself a website.</p>\n\n<p>Best,<br>Gonzalo</p>", 
    "end_date": null, 
    "title": "Create a Professional Website in a Day with WIX. [NO CODING]", 
    "price": "20.00", 
    "instructors": "Gonzalo F", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593008_5730_3.jpg", 
    "course_url": "https://www.udemy.com/website-in-a-day/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T15:22:42Z"
}