{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>FREE FOR A LIMITED TIME!!!</strong><br></p><p>\"<em>I need to supplement my monthly income but need some help and advice?</em>\" You've come to the right course.<br></p><p>Do you currently have a course with little sales or looking to create a new course?<br></p><p>This course delivers the information you will need to use to better build your courses; and ultimatly get better sales. It doesn't matter if your building  your first course or if  your looking to improve the quality of existing courses; the information in this course will offer  you the information on what you need to improve to improve your sales.<br></p><p>This course will help you build a successful course portfolio which will help supplement your current mostly income.</p><p>Some of you will even go one further and move to making courses as your primary source of income. This course gives you all the tricks and info you will need to understand what courses you can create, how to keep a flow of course ideas happening and then what you need to concentrate on to maximise your profits.</p><p>This course is comprised of the techniques I have now used successfully to generate a healthy supplementary income; and these techniques can be used by you to do the same.</p><p>Once completed; use this knowledge and you will be creating and earning with ease.</p><p><strong>26/08/15</strong> - I've added a new lecture number 20 (currently) which is on course reviews; some ideas to how to action your students to leave reviews and what to do if you get negative reviews.</p><p><strong>03/09/15</strong> - I've added social proof of my August earnings. I plan to try and do this monthly just to show you how this course info can deliver; does deliver.</p>", 
    "end_date": null, 
    "title": "Create Online Courses: A Simple How-To Guide", 
    "price": "20.00", 
    "instructors": "Sean McCammon", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/586446_8927_3.jpg", 
    "course_url": "https://www.udemy.com/create-online-courses/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T15:06:57Z"
}