{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Freelancing is a great way to <strong style=\"\">make extra money on the side</strong> while working a full time job for some. For others, freelancing produces the full time income and sets them free from the corporate world. Whether you travel around the world while working or spend a few hours before or after work freelancing, this course is for you.  </p>  <p>  \t  By following the steps highlighted in this course, you will learn how to:  </p>  <ul style=\"\">  \t<li>Create an account on one of the leading freelancing platform;<br style=\"\">  \t</li>  \t<li>Create a professional profile to attract more clients;<br style=\"\">  \t</li>  \t<li>Monitor your stats to increase your value in the community;<br style=\"\">  \t</li>  \t<li>Write a compelling description of yourself and your services;<br style=\"\">  \t</li>  \t<li>Setup your settings for maximum efficiency; and<br style=\"\">  \t</li>  \t<li>Write personalized proposals to compete with others in your market.</li>  </ul>  <p>  \t  This course is for you if you want to learn how to add to your freelancing arsenal and bring your freelancing game to the next level. By joining a community of 260+ people all learning together, you will get your questions answered and start making money freelancing on Elance rapidly.<br style=\"\">  </p>  <p>  \t<strong style=\"\">Course Benefits</strong>  </p>  <ul style=\"\">  \t<li>Over 260 happy students;<br style=\"\">  \t</li>  \t<li>Unlimited earning potential;<br style=\"\">  \t</li>  \t<li>Work from anywhere;<br style=\"\">  \t</li>  \t<li>Get Started Today<br style=\"\">  \t</li>  \t<li>No website required;<br style=\"\">  \t</li>  \t<li>All your questions will be answered;<br style=\"\">  \t</li>  \t<li>Free periodical content update; and<br style=\"\">  \t</li>  \t<li>Satisfaction Guaranteed.</li>  </ul>  <p>  \t<br style=\"\">  \t  Everyday you wait to get started, things become harder for you. Thousands of people are getting started with freelancing every single day. Your potential clients are building relationships with everyone but you. Don’t let fear or excuses get in the way of your financial success and your freelancing career. Join now.  </p>  <p>  \t  Don’t miss the boat. No experience is needed. I’ll teach you everything that you need to know to get started.  </p>  <p>  \t<strong style=\"\">Stop wasting your time</strong> and get started by joining this <strong style=\"\">Make Money Freelancing on Elance</strong> before the next price increase.  </p>  <p>  \t  I’m looking forward to teaching you all I know about Elance.  </p>  <p>  \t  See you inside.  </p>  <p>  \t  Steven Leconte  </p>", 
    "end_date": null, 
    "title": "Create Your Career by Freelancing on Elance", 
    "price": "20.00", 
    "instructors": "Steven Leconte", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288056_e123_2.jpg", 
    "course_url": "https://www.udemy.com/make-money-freelancing-on-elance/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T09:47:49Z"
}