{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>★★★★★ <strong>Hola </strong> ★★★★★<br></strong></p><p><strong><br></strong></p><p><strong>¿Te gustaría poder generar un ingreso extra con Facebook?</strong><br></p><p>Te enseñare como puedes crear y administrar tu página en Facebook para que puedas vender por esta gran red social, puedes tener un negocio físico o solamente virtual, no importa si en este momento no estás trabajando o si lo estas, puedes hacerlo como una fuente de ingresos extra y hacer crecer tus ahorros muy rápidamente, te ayudare con algunas estrategias para que puedas cotizar tus productos y encontrar a tus mejores clientes de manera muy fácil gracias a Facebook, no es necesario que tengas mucha experiencia para esto, tampoco necesitaras inversiones grandes de dinero, aprenderás exactamente cómo lo realizo yo, puedes adaptarlo a muchos negocios, también es una manera muy buena por si tienes deudas ya que el dinero extra que generes de esta manera te ayudara a salir de tu deuda (me ha ayudado mucho a mi).</p><p><strong>Este curso es sincero</strong>, tus ganancias serán conforme a tu dedicación, no te prometo millones en ganancias sin ningún esfuerzo (pero podría ser tu caso), aquí veras y aprenderás el conocimiento y experiencia que adquirí durante varios años, experiencia que te permitirá<strong> </strong><strong>ahorrar tiempo, dinero y frustraciones</strong>.</p><p>Por ultimo quiero decirte que mi curso cuenta con una <strong>Garantía total de 30 días</strong>, la cual si crees que el curso no fue de tu ayuda, se te devolverá íntegramente tu dinero.</p><p><strong>Este curso es 100% práctico y recuerda que estoy para ayudarte.</strong></p><p><br></p><p>★★★★★ <strong>Te espero dentro del curso, Muchas gracias :) </strong> ★★★★★<br></p>", 
    "end_date": null, 
    "title": "Cómo Ganar Dinero Extra Mes a Mes Vendiendo en Facebook.", 
    "price": "20.00", 
    "instructors": "Brandon Martinez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608292_1ba5_2.jpg", 
    "course_url": "https://www.udemy.com/ganar-dinero-extra-vendiendo-en-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T18:17:33Z"
}