{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Grab this course at it's current discounted price before it goes back to $97 soon!</strong></p><p>Technology and Internet use are prevalent in today's society. More and more kids and adults are using the Internet for learning, personal and professional business, entertainment, and information sharing. As the World Wide Web brings us closer together, we need to ensure that all users are safe, smart, and aware in the 21st century. Knowing, understanding and using the Elements of Digital Citizenship can help.</p><p>Our Digital Citizenship course will give participants the guidance needed in the ever changing digital world. As our lives are lived more and more online we all need to translate our social skills into the virtual world.</p><p>Digital Citizenship allows us to connect, collaborate, and share by using technology appropriately. In person meetings are on the decline which makes it necessary to engage people digitally. Being a good digital citizen means you have a set of skills to work in the digital world.</p><p><strong>This course will help you:</strong></p><p>        Define digital citizenship.</p><p>        Use technology appropriately.</p><p>        Use social networking to create your brand.</p><p>        Protect your reputation online.</p><p>        Practice safe use of technology.</p><p>        Understand digital etiquette.</p>", 
    "end_date": null, 
    "title": "Digital Citizenship", 
    "price": "30.00", 
    "instructors": "Adam Karchoufa", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441878_29cd_2.jpg", 
    "course_url": "https://www.udemy.com/digital-citizenship2/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T13:08:01Z"
}