{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          This simple and straightforward course will teach you how to start your own successful dog walking business - which means you can be your own boss and combine your passion for being with dogs into your own profitable enterprise.  </p><p><strong><em>What are our students saying:</em></strong></p><p>\n                                        <strong>\"Very good and comprehensive: Simple, clear and I love the handouts and especially the Word document you let us download.\"</strong></p><p><strong><em></em></strong></p><p><strong><em>\"If you want to start this kind of business this is an excellent course \nfor you. You learn about marketing and how to approach clients in a very\n professional way. Thank you Stephen.\"</em></strong></p><p><strong><em>\n                                        \"Covers everything! This course is a \nnice broad introduction to anyone who wants to start a business but \ndoesn't know business techniques. Takes you through everything you need \nto know and Stephen seems really friendly! Plus loads of cute dog \npictures ;) Great course!\"</em></strong></p><p><br><strong><em></em></strong></p><p><em></em></p>  <p>  \t<strong>Learn How to Become a Professional Dog Walker with this Comprehensive Course </strong>  </p>  <ul>  \t<li>Learn everything you need to know to start your business from scratch, so you can hit the ground running - and start earning money fast</li>  \t<li>Discover the best, cost-effective ways to promote your business - saving you time and money - on the way to your first paying clients</li>  \t<li>Build a business that is both enjoyable and profitable - love the work you do and make a profit</li></ul>  <p>  \t<strong>Everything you need to build your own successful dog walking business</strong>  </p>  <p>  \t          In an ever busier world, the demand for dog walking services has never been higher.  As a consequence of this huge demand, professional 'dog walkers' have sprung up in recent years - and now you can join them by combining your passion for dogs with your own business!  </p>  <p>  \t          This course is the ultimate guide to starting a dog walking business and leads you step-by-step through everything you need to know to start your own thriving business. Learn from my experience how to avoid the most common mistakes and get off to a flying start.  </p>  <p>  \t<strong>About the course</strong>  </p>  <ul>  \t<li>    I designed the Dog Walking Start Up course to be easily understood by absolute beginners - so that anyone with a love of dogs and desire to work for themselves can do it  </li>  \t<li>    As you complete each of the course modules, you will be able to put into place everything you need to build your new business - so you can get your business up and running quickly  </li>  \t<li>    Step-by-step, you will learn how to set-up your business the easy way using simple examples to demonstrate how to check out and beat the competition, and what are the best services you can offer - so you build you business faster  </li>  \t<li>    Keep your costs low by using simple and cost-effective marketing techniques shown in the course, both online and in the 'real world' - keeping your costs low, and profits high  </li>  \t<li>    Learn how to find you first customers, build trust with them and have them promote your business for you - the fastest way to build your income  </li>  \t<li>    By the end of the Dog Walking Business Start Up you will have saved time, by getting all the information you need in one concise course and you will have saved money by not making expensive errors going through a tedious trial and error process.  </li>  \t<li>    Most importantly, you will have learned all the skills you need to start your own successful dog walking business.  </li>  </ul>  <p>  \t<strong>Click on  'take this course' to enroll  -  get started without delay – and start building your dog walking business today! </strong>  </p>", 
    "end_date": null, 
    "title": "Dog Walking Business Startup: Launch Your Own Canine Company", 
    "price": "20.00", 
    "instructors": "Stephen Atkinson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422578_088a_6.jpg", 
    "course_url": "https://www.udemy.com/dog-walking-business-startup/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-15T17:03:09Z"
}