{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>E-Com-Dom – E-commerce Domination</strong></p>    <p>How would you feel if all throughout your day, you knew sales were coming in the background? You could be sleeping, eating, spending time with family, and in the back of your mind, cha-ching, cha-ching, cha-ching.  </p>    <p><strong>Change Your Money Reality</strong></p>    <p>Imagine your bills are a distant memory, and that holiday you’ve been dreaming of for years is now planned and booked. Perhaps you want the new iPhone, or you want to sleep like a baby knowing that money is coming in while you dream. </p>    <p><strong>Get More Out of the Time You Have </strong></p>    <p>When you know how to make passive income, you can spend more time with your loved ones or doing what you want. With a passive income stream, you can spend your time travelling, with your family, connecting with your friends or making a positive impact in the world. </p>    <p><strong>It’s pure FUN!</strong></p>    <p>Most of all, owning your own e-commerce business is FUN. The power of the Internet allows you to find profitable opportunities in seconds and quickly set up your own money making shop. It doesn’t take years of setting up a traditional brick shop or 10,000’s in rent fees or inventory. </p>    <p><strong>Here’s exactly what you will learn:</strong></p>    <p><strong>1. A Full Understanding Of Ultimate e-Com-Dom</strong></p>  <p>Gain a deep understanding of the e-Com-Dom so you can get started with absolutely no previous knowledge. You will learn how to get set up, make your store look beautiful and create the perfect plan to set you on your journey. </p>    <p><strong>2. Choosing the perfect product</strong></p>  <p>Learn the secrets for researching highly profitable and in demand products. With these unique tricks you will be able to find the low hanging fruit that will allow you to create easy income and a life of your dreams. </p>      <p><strong>3. Sourcing The Perfect Product</strong></p>  <p>Once you know how to find the perfect product, you will now learn how to source it. You can get these products really cheap and learn how to dropship them so there is no upfront investment. </p>    <p><strong>4. Prepare Store For Sales</strong></p>  <p>In this module you will learn how to optimize your store for more sales. You will learn how to fulfill sales through your store and how to get started selling your first product online. </p>      <p><strong>5. Getting Eyeballs On Your Product</strong></p><p><strong></strong>In this module you will learn how to make your product more visible in the marketplace and get people flooding to your site. You will learn how to leverage the power of Facebook’s billion daily users to get the sales rolling in every single day. Cha-ching.</p>    <p><strong>Don’t Miss Out</strong></p>    <p>If you read this far then it’s obvious you are interested in owning your own online store and making money online. However if you are still undecided then it’s likely because you are afraid. Afraid of failure, afraid of the unknown, or even afraid of success. </p>    <p>Don’t let your fears hold you back in life, invest in this course and if you don’t like it for whatever reason you can get your money back with our 30-day Money back guarantee. It’s 100% Safe.  </p>    <p>Start your success story right now! Click on the ‘Take This Course” link at the top right of the page <strong>NOW!.</strong> Don’t procrastinate another minute by not living your dreams. Enrol with us right now and take a piece of this amazing opportunity. </p>", 
    "end_date": null, 
    "title": "E-commerce Domination: Learn Proven Methods to Crush Shopify", 
    "price": "20.00", 
    "instructors": "Shimmy Morris", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632890_14c3.jpg", 
    "course_url": "https://www.udemy.com/e-comdomination/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T21:25:29Z"
}