{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong></strong><strong>Join the eCommerce Revolution Now! </strong></p><p style=\"\">That may sound like a bit of a dramatic headline but the fact is retail is dead. Every year more and more people are changing their shopping habits to eCommerce, Amazon, eBay and its only just getting started. </p><p style=\"\">With crazy new buying trends like Black Friday and Cyber Monday only prove that the world is starting to hit the online market places in a big way with <strong>Billions </strong>being spent every year. </p><p style=\"\">This course teaches you how to build a business importing hot selling high quality products from primarily China and sell them for <strong>HUGE</strong> profits. You will be taught in detail what to source, were to source it and how to sell it to maximize your sales and profits. </p><p style=\"\">You are going to learn in detail how to use one of the worlds biggest marketplaces known as <strong>Alibaba</strong>. We will cover:</p><ul><li><strong>What sort of products to look for. </strong></li><strong></strong><li><strong>How to know that you are going to be able to sell your products. Guaranteed!</strong></li><strong></strong><li><strong>How to communicate with factories and suppliers.</strong></li><li><strong>Master shipping techniques and know how to get your products safely to your door ASAP.</strong></li></ul><p style=\"\">Once you have your products you will be shown how to present them and sell them like the pros do, beating 90% of the competition hands down. We will cover:</p><ul><li><strong>Mastering product photography to take professional looking images of your products anywhere anytime.</strong></li><li><strong>Writing killer product descriptions that convert like crazy and are also keyword optimized.</strong></li><li><strong>Building hot selling titles. Having your product title structured correctly is vital to getting high amounts of traffic to your product listings. We will show you how.</strong></li><li><strong>Keyword Research is key to getting maximum exposure to your listings. You will learn how to find the best keywords for your product and use them to dominate. </strong></li></ul><p style=\"\">Once you have your products presented professionally, you will learn advanced techniques in selling on eBay and Amazon to take your sales to the next level. We also cover in detail branding and private labeling your products to differentiate yourself from the competition and truly create your own empire.  </p><p style=\"\">This course is the complete package for anyone looking to succeed in selling products online. I am constantly adding and updating the curriculum to give you the most up to date selling and importing techniques and methods. </p><p style=\"\">Also included is access to a private Facebook community for all students to interact, help and motivate each other to achieve their goals. </p><p style=\"\">So sign up now if you want to make this year the year you make it online or your money back.</p><p style=\"\"><strong>***30 Day Money Back Guarantee***</strong></p><p style=\"\"><strong>Course Update March: </strong></p><ul><li><strong></strong>I have just added some quizzes at the end of each section to make sure all of the key points have been taken in and you are on you A game! ;)</li></ul><ul><li>There is now a Course Resource area at the bottom of the curriculum that has the course downloads in it so students now have them all in one easy place. </li></ul><p style=\"\"><strong>Course Update April: </strong></p><ul><li>There is now a brand new private Facebook group for all members of the course to hangout, chat, exchange ideas and help each other. This will develop into a very powerful tool over time as you are only as good as the people you stand with. </li><li>A new promo video ;)</li><li>New Terapeak Masterclass section!</li></ul><p style=\"\"><strong>Course Update June: </strong></p><ul><li><span style=\"\"></span>New lecture on how to check what is selling on Amazon and at what price.</li><li>Over 100 members on the private Facebook group! </li><li>I have added a Conclusion lecture for students who complete the course. I really hope your one of them. </li></ul><p><strong>Course Update August:</strong></p><ul><li>200 members in the private Facebook Group</li><li>25 Awesome reviews from my happy students. :)</li></ul>", 
    "end_date": null, 
    "title": "E-Commerce Business Guide to Alibaba for eBay & Amazon", 
    "price": "45.00", 
    "instructors": "Danny Guerin", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366760_766c_5.jpg", 
    "course_url": "https://www.udemy.com/ecommerce-business-guide-to-alibaba-for-ebay-and-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T17:36:53Z"
}