{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>How would you like to be earning Bitcoins online without investing a single dime – simply by following the blueprint I layout in this course, and following it during your spare time?</p><p><strong>Don’t forget you’ll get $1 worth of Bitcoin from me, simply by enrolling!</strong></p><p>In this course I’m going to go over six methods in which you can earn Bitcoin online, for free. The six ways we are going to be going over are; Bitcoin Faucet Websites, Online Bitcoin Games, Doing Tasks For Bitcoin, Encouraging Bitcoin Tips, Freelancing For Bitcoin, and last but not least Peer To Peer Lending For Bitcoin.</p><p>As I go through all of these methods I’m going to be teaching you all about what the methods entail. I’m also going to be going over my recommend list of sites which you can use to start earning Bitcoins online straight away. On top of that, I’ll be going over additional hacks which will help you to maximize your Bitcoin earnings.</p><p><strong>You’ll be able to start earning Bitcoins online right from the word – go!</strong></p><p>This course is all about getting you earning bitcoins online without investing in any traditional currency or cryptocurrencies in order to get it.</p><p><strong>It’s guaranteed you will earn Bitcoins by taking this course!</strong></p><p>Remember, you will get $1 worth of Bitcoin for simply enrolling on this course as a paying student.</p><p><em>- COURSE UPDATED JAN 2016 -</em></p>", 
    "end_date": null, 
    "title": "Earn Bitcoins Online: How To Get Bitcoins In Your Wallet", 
    "price": "20.00", 
    "instructors": "Ravinder Deol", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659068_7ac2_12.jpg", 
    "course_url": "https://www.udemy.com/beginners-blueprint-for-earning-bitcoins-online/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T16:36:15Z"
}