{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">&quot;Discover the Secrets of High Converting Sales Webinars. Start Building Your Own Today!&quot;</strong>  </p>  <p style=\"\">  \t<br style=\"\">  \t  In this video series you will learn how to set up a webinar from start to finish. We will cover all the steps that will help you create compelling webinars that will bring you sales. We also teach you how to boost your sales with our secret strategies that have been proven to work!<br style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \t  Have you ever wondered how businesses are using webinars to generate leads?<br style=\"\">  \t<br style=\"\">  \t  Webinars are known for their high conversion rate because of the live social element and social proof. Questions can be answered in real time.<br style=\"\">  \t<br style=\"\">  \t  Average conversions can range from 10 to 35 percent or even higher.<br style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \t  Webinars are not just about selling products and services. They can also be used to build great relationships with customers and prospects...<br style=\"\">  \t<br style=\"\">  \t  ... Which often times is most overlooked.<br style=\"\">  \t<br style=\"\">  \t  Depending on your ultimate business goals, you can use webinars in various ways.<br style=\"\">  \t<br style=\"\">  \t  In this video course, we focus on showing you how to build sales webinars. This course will help you sell your product or get more leads via webinars.<br style=\"\">  \t<br style=\"\">  \t  The main aim with sales webinars is to gain your customers’ trust, to engage and interact with them in order to boost sales conversions.<br style=\"\">  \t<br style=\"\">  \t  If you are asking yourself how can you create high converting webinars that have high engagement that will yield higher sales conversions, you’ve come to the right course. <br style=\"\">  \t<br style=\"\">  \t  Not only will we take you by the hand to teach you how to get everything on how to build high converting sales webinars but we also how you can take your webinars to the next level!<br style=\"\">  \t<br style=\"\">  \t  But that’s not all. How do you get your webinar attendees to buy even after your webinar is over? <br style=\"\">  \t<br style=\"\">  \t  There are multiple ways that you can achieve this. <br style=\"\">  \t<br style=\"\">  \t  Email auto responder series is the most popular and easier way to communicate on an ongoing basis with your audience. But what do you tell them in your reminder emails? How you approach them in your emails is critical and we show you exactly how to do this. <br style=\"\">  \t<br style=\"\">  \t  In this course, we even give you access to our swipe files that you can simply copy and paste to use in your own webinar email auto responder series, regardless of what auto responder service you use.<br style=\"\">  \t<br style=\"\">  \t  Here’s what Easy Webinar Profit System will cover:<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Module #1: Introduction to Webinars and Recommended Tools</strong><br style=\"\">  \t<br style=\"\">  \t  In this video you will learn how it all works as well as the recommended tools and webinar platforms that we have tested.  </p>  <p style=\"\">  \t<strong style=\"\">Module #2: What&#039;s a Webinar Without An Audience?</strong><br style=\"\">  \t<br style=\"\">  \t  In this video we will be covering who your best prospects are and how to engage them, so that you can attract the people most likely to buy.  </p>  <p style=\"\">  \t<strong style=\"\">Module #3: Our Blueprint for a Sales Webinar</strong><br style=\"\">  \t<br style=\"\">  \t  In this video you will get to see an exact mind map of our recommended sales webinar.  </p>  <p style=\"\">  \t<strong style=\"\">Module #4: Finding Your Angle</strong><br style=\"\">  \t<br style=\"\">  \t  The angle is how you are going to ultimately sell your product or service in your sales webinar. In this video, we teach you the different angles you can use.<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #5: Who&#039;s the Host?</strong><br style=\"\">  \t<br style=\"\">  \t  It&#039;s very important to convince people of why they should listen to you. This is time to gain and reinforce their trust. In this video we teach you how to do this.<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #6: The Meat</strong><br style=\"\">  \t<br style=\"\">  \t  Here we teach you how you can convey the content or meaty part of your webinar.  We will be showing you specific strategies that you can use to really get people interested in your product or service or business.<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #7: The Pitch</strong><br style=\"\">  \t<br style=\"\">  \t  Now it&#039;s time to pitch or sell your product. Here we teach you how you can do it in such a way that people will be keen to know your product.  <br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #8: Justifying The Price</strong><br style=\"\">  \t<br style=\"\">  \t  If you have an expensive, high-ticket product, and you&#039;re worried that people are not going to buy it, in this video we show you a specific strategy that will help you justify the price.  <br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #9: Introduction to Webinar Conversions</strong><br style=\"\">  \t<br style=\"\">  \t  In this specific video series we are going to cover how this specific system works and what tools you need to get started.<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #10: Biggest Mistakes Webinar Hosts Make That Lose Sales</strong><br style=\"\">  \t<br style=\"\">  \t  In this specific video we are going to cover how to avoid some of the big mistakes that can potentially make you lose sales.<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #11: How to Increase Your Actual Attendee Rate</strong><br style=\"\">  \t<br style=\"\">  \t  In this video we show you how you can increase your actual attendee rate. <br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #12: Webinar Email Schedule</strong><br style=\"\">  \t<br style=\"\">  \t  In this video we will be covering a specific email schedule we recommend that works really well.<br style=\"\">  \t<br style=\"\">  \t  - Email a couple times before the Webinar to remind people.<br style=\"\">  \t  - Recommended Email schedule<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #13: Email Follow Up and Reminder Templates</strong><br style=\"\">  \t<br style=\"\">  \t  In this video you’ll get our email follow up and reminder templates.<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #14: Getting people to run through your door</strong><br style=\"\">  \t<br style=\"\">  \t  Often times we can use webinar replay, which basically allows previously recorded webinars to be sent to people so they can watch the webinar again. Though there is a specific strategy that we can employ that will help you increase your sales. This especially works with people who are on the fence and are unsure about buying your product or service because of certain objections.<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Module #15: After the Webinar Follow Up Templates</strong><br style=\"\">  \t<br style=\"\">  \t  In this video we give you access to our follow up templates specifically for after your webinar is over. This is crucial because you want to be able to reach those who attended your webinar as well as those who have not attended.  </p>  <p style=\"\">  \t<strong style=\"\">Plus you get all these templates  to make sure your webinar runs as smoothly as possible!</strong>  </p>  <p style=\"\">  \t<li style=\"\">An agenda for planning your webinar</li>  \t<li style=\"\">An agenda for assigning work to contractors</li>  \t<li style=\"\">Checklist for your assistant</li>  \t<li style=\"\">Checklist for locating guest speakers</li>  \t<li style=\"\">Fill-in-the-blank invitation template for guest speakers</li>  \t<li style=\"\">Follow up email for guests</li>  \t<li style=\"\">Fill-in-the-blank press release template to promote your webinar</li>  \t<li style=\"\">Fill-in-the-blank blog post template to promote your webinar</li>  \t<li style=\"\">2 Fill-in-the-blank Facebook Posts to promote your webinar</li>  \t<li style=\"\">2 Fill-in-the-blank Twitter Posts to promote your webinar</li>  \t<li style=\"\">Webinar announcement email</li>  \t<li style=\"\">Webinar reminder email</li>  \t<li style=\"\">Webinar thank you email</li>  \t<li style=\"\">Webinar sevice comparison chart</li>  \t<li style=\"\">Template for creating webinar handouts</li>  </p>  <p style=\"\">  \t<strong style=\"\">So....What are you waiting for? Jump this course today and start your own webinar today!</strong>  </p>", 
    "end_date": null, 
    "title": "Easy Webinar Profit System", 
    "price": "30.00", 
    "instructors": "Earners Classroom", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382200_d09a_3.jpg", 
    "course_url": "https://www.udemy.com/easy-webinar-profit-system/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T15:08:45Z"
}