{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do You Want The Ultimate Strategy For eBay Dropshipping That You've Ever Seen?</strong></p><p><strong>A strategy that automates your income, requires NO RISK, NO INVESTMENT, NO SHIPPING and that takes ONLY MINUTES TO DO?</strong></p><p>You've heard of dropshipping - and it sounds like an amazing way to make money on eBay...</p><p>But did you know about all the pitfalls involved in doing dropshipping the \"traditional way\"?</p><p>Most people who dropship end up experiencing negative feedback due to bad inventory management and making promises they can't deliver on.</p><p>But, did you know that there is a FAR BETTER way to do dropshipping?</p><p>In fact, this way is so amazing, I've used it to make many tens of thousands of dollars over the last 16 years!</p><p><strong>With my exclusive dropshipping strategy, you benefit in so many ways...</strong></p><ul><li><strong>You have ZERO investment in merchandise<br></strong></li><li><strong>You have potentially unlimited merchandise that you can sell<br></strong></li><li><strong>You enjoy HIGH PROFIT MARGINS<br></strong></li><li><strong>You enjoy full control over your business<br></strong></li><li><strong>You don't risk your eBay feedback rating<br></strong></li><li><strong>You do ZERO picking, packing and shipping</strong></li><li><strong><span></span>and most importantly...</strong></li><li><strong>You have ZERO COMPETITION because you OWN the market</strong><strong>!</strong></li></ul><p>If you are excited about dropshipping, be sure you take this course FIRST, because I'm going to show you the RIGHT way to do dropshipping so that you enjoy all the benefits I just described.</p><p><strong>You will also learn:</strong></p><ul><li><strong>How to automate your income so that all you do is process payments!<br></strong></li><li><strong>How I make $70 in 3 minutes.<br></strong></li><li><strong>How one of my students makes $14,000 a month with only 80 minutes of work<br></strong></li><li><strong>How to make eBay do all the \"heavy lifting\" for you and you just make the money!</strong></li><li><strong>How you can build multiple exclusive dropshipping arrangements (as many as you want) so that you have an ongoing, passive income from eBay!</strong></li></ul><p><br></p><p>Your mind will be blown by all the exciting things you will learn in this brief, power-packed course!</p><p>And, your enrollment today is full guaranteed!</p><p>You have Udemy's no-questions-asked, 30-day, money back guarantee, so you have nothing to lose and a whole new lifestyle to gain!</p><p>Enroll today!</p>", 
    "end_date": null, 
    "title": "eBay Dropshipping - The Ultimate eBay Drop Shipping Strategy", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/666344_5766_2.jpg", 
    "course_url": "https://www.udemy.com/ebay-dropshipping-ultimate-ebay-drop-shipping-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T01:00:13Z"
}