{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">The eBay Sellers Survival Guide Course will show you step by step how to build up a large 100% positive feedback score and perfect account rating on eBay and how to keep that perfect score for the rest of your eBay carrier! EBay has recently made some serious changes that are making it harder than ever for sellers to maintain a perfectly health account rating. This has caused a number of eBay sellers to lose sales and even be forced to leave the eBay platform.</span>  </p>  <p style=\"\">  \t      If you are a small home business eBay entrepreneur or a large scale seller using eBay to generate sales and revue for your company, the information in this course is Critical!!! There is no need for you to loose sales because of these new regulations.  </p>  <p style=\"\">  \t      I started out as an independent seller on eBay and then began consulting with large scale resale businesses and managing there eBay stores. When managing client’s eBay stores it was vitally important that I keep their feedback and account scores perfect. It was also a huge bonus if I could repair any damage that had already been done to their account. This is what lead me into tons of research and experimentation on how to handle eBay customers and how best to use the eBay platform.  </p>  <p style=\"\">  \t      The system I came up with saved my clients and I a ton of money. I know how frustrating it can be to have your sales and income directly affected by eBay’s account score system and account restrictions. So I’ve decided to share my eBay success system in this comprehensive video course. The course will teach you how to  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Repair and damaged account and remove bad feedback  </em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Build up a perfect feedback score and account rating in just 48 hours</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Maintain a perfect seller transaction score</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Become a Power Seller</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Turn a nightmare customer into your biggest fan</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Insure that all of your customers leave you positive feedback</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Remove any sales restrictions and limitations on your account</em></strong>  </p>  <p style=\"\">  \t      Now is the time to take action and build up a bulletproof eBay store. Enroll now and begin creating your own unstoppable eBay business!<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "eBay Feedback Domination: 0 to Power Sellers eBay Guide  ", 
    "price": "20.00", 
    "instructors": "Alex Suttle", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351246_f948_2.jpg", 
    "course_url": "https://www.udemy.com/ebaysurvivalguide/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T20:37:03Z"
}