{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">STUDENT REVIEW:</strong>  </p>  <p style=\"\">  \t<em style=\"\">\"Dave does a good job of relating his experience in a very easy-to-listen-to format. This course covers all the areas that one needs to be aware of when buying and selling cars for profit. Having been an eBay Powerseller for years, I was able to take away a lot of good information that I was not aware of. Unlike some Udemy courses I've taken, NO coffee was consumed while completing this course in one sitting as it was very well paced.\" -Chuck Vitak</em></p>  <p style=\"\">  \t<span style=\"\"></span>-----------------------------------------------------------------------------------</p><p style=\"\"><strong style=\"\"><em style=\"\">Wow, excellent course...</em></strong></p>  <p style=\"\">  \t<em style=\"\">\"Even if you're completely new to car flipping, this course will give you the confidence to jump in. No theory here, learn from a successful doer.\"</em>  </p>  <p style=\"\">  \t  -----------------------------------------------------------------------------------  </p>  <p style=\"\">  \t  If you like cars and want to discover the secrets to making money by flipping cars on eBay, then this is the Udemy course for you!  </p>  <p style=\"\">  \t     In this course, you'll get the real story on how to effectively and profitably sell cars and other vehicles on eBay Motors.  </p>  <p style=\"\">  \t     You will learn from Dave's real-life examples as he shows you what has worked for him over the years.  </p>  <p style=\"\">  \t     Dave has been fortunate to earn $89,000 (profit) over the years by selling \"real\" cars on eBay Motors!  </p>  <p style=\"\">  \t     In fact, Dave says: “Selling cars on eBay Motors has been one of the most profitable things I've done!\"  </p>  <p style=\"\">  \t     And... not only is it a profitable business, it's also a ton of fun!  </p>  <p><strong style=\"\">In this course, Dave will show you:</strong></p><ul style=\"\"><li>His real-life examples from cars he's bought and sold on eBay.</li><li>What are the most profitable cars to flip? Dave shows you.</li><li>The absolute best listing formula to use when selling cars on eBay.</li><li>The 3 proven “Rules\" that will squeeze the most profit out of your vehicle transactions.</li><li>How to remove financial risk when buying or selling a car on eBay \"cross-country\"</li><li>How to easily transport vehicles cross-country</li></ul><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">And, you'll also get:</strong></p><ul style=\"\"><li>The true story of how Dave made $28,000 on a legendary 1969 Shelby, and how eBay made it possible to reunite this rare car with an original owner...</li><li>Dave's amazing “Barn Find Camaro\" story... It was so amazing that Hot Rod Magazine decided to put Dave's '69 Camaro on their cover! You'll get the amazing \"behind the scenes\" story behind this killer find &amp; photo shoot. (Dave bought this '69 Camaro for only $1,700!)</li></ul>  <p style=\"\">  \t     <strong style=\"\">Little or no cash to invest in cars? No problem.</strong>  </p>  <p style=\"\">  \t     You'll also learn how to get started flipping cars with ZERO investment.  </p>  <p style=\"\">  \t     Get started today on the road to high profits by flipping cars on eBay.  </p>  <p style=\"\">  \t     With Dave showing you the way, you can do it!</p>", 
    "end_date": null, 
    "title": "eBay - How To Find Buy & Flip Classic Cars On eBay", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/106344_81f2_5.jpg", 
    "course_url": "https://www.udemy.com/ebay-how-to-find-buy-and-flip-classic-cars-on-ebay/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-15T21:52:10Z"
}