{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Would an extra $600 - $700 per month working from home 4-5 hours per week help you?  </p>  <p>  \t<strong style=\"\">What about $10,000 per month or more full time?</strong> Interested?<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Over one million people make a full time living selling on eBay and Amazon!</strong> Some make over $1,000,000 per year profit on eBay and Amazon. In this 8 hour course I will show you how they do this: what products are hot, how to determine what's trending and what's getting the most bids and the most watchers, how to evaluate a product, the secrets to category use, how to build a fantastic title for your item, how to list your product and how to place a video in your listing to attract more bids and so much more.  </p>  <p>  \t<strong style=\"\">Please take advantage of my 15 years selling experience on eBay and Amazon!</strong>  </p>  <p>  \t<strong style=\"\">As an added bonus we have a complete section on coins:</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <h4>Users Of Our System Often Find Silver Within 24 Hours!</h4>  <h4>With our simple system you can find silver coins at your local  bank almost immediately. The tellers do not even know the secret and  there are over one billion silver coins that most people do not know  about and our course shows you how to get them now.</h4>  <h4>Learn How To Sort Through Change and Finds Coins Worth A Bundle</h4>  <p>  \t<br style=\"\">  \t  In my new course, \"Learn How Power Sellers Make Millions On eBay\": I show you the easy and proven way to find valuable  silver and error coins in ordinary loose change. I show you step-by-step  how to sell them on eBay for tens, hundreds or even thousands of times  their face value.  <br style=\"\">  \t<br style=\"\">  \t  With over 40 years of experience as a coin collector, I've created  and perfected a realistic extra-income system for the average person  looking to earn $600.00 to $700.00 per month or more, working about  three to five hours per week. <br style=\"\">  \t<br style=\"\">  \t  You can work this system while watching TV or relaxing at home. No  coin collecting or eBay experience is necessary for you to profit from  it.  <br style=\"\">  \t<br style=\"\">  \t This course shows you  the inside secrets, tips, and techniques to find valuable coins in  ordinary pocket change. You can profit from this simple program while  simply watching TV or relaxing at home.  No coin knowledge is necessary.  I tell you exactly what to look for and how to find it.  <br style=\"\">  \t<br style=\"\">  \t  Quickly learn the secrets to finding valuable silver and error  coins. Find out how to sell them on eBay for tens, hundreds or even  thousands of times their face value. Learn when to sell, what categories  to select, how to write auctions that will get bids, how to create  stunning images, and much more.  </p>  <p>  \tYou can run your own eBay business, and EARN MONEY ASAP! <br style=\"\">  </p>  <h4>You'll quickly learn:</h4>  <ul style=\"\">  \t<br style=\"\">  \t<li>How to transform your local bank into a cash cow</li>  \t<br style=\"\">  \t<li>The secret wealth in an unpopular and widely available coin (you'll be surprised!)</li>  \t<br style=\"\">  \t<li>How to create a powerful eBay auction listing</li>  \t<br style=\"\">  \t<li>The top six reasons why eBay auctions fail</li>  \t<br style=\"\">  \t<li>The best (and worst) times to start and end your auctions</li>  \t<br style=\"\">  \t<li>How to save big bucks on shipping coins</li>  \t<br style=\"\">  \t<li>How to automate your auction business including shipping, packaging, and repeat auctions</li>  \t<br style=\"\">  \t<li>How to make big profits from error coins</li>  \t<br style=\"\">  \t<li>How to create stunning photo images of every coin you sell, and  why having a certain type of image on your auction listings can  significantly increase bid prices</li>  \t<br style=\"\">  \t<li>And Much Much More</li>  \t<br style=\"\">  \t<br style=\"\">  \t<h4>This course covers all this and you'll even find sample auction listings you can use as the framework for your own.</h4>  \t<p>  \t\t<br style=\"\">  \t\t<br style=\"\">  \t\t  Anyone looking to make extra cash, extra income, work from home,  start a home based business, coin roll hunt, find silver, gold,  treasure, rare coins, error coins, Indian Head Pennies, metal detecting,  work on ebay or Amazon or Etsy will benefit from this course.  \t</p>  </ul>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "eBay Selling Home Business Powerseller Secrets and Hacks", 
    "price": "20.00", 
    "instructors": "Sam Sommer MBA", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61392_0cb5_7.jpg", 
    "course_url": "https://www.udemy.com/how-you-can-profit-on-ebay-from-pocket-change/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-21T21:52:11Z"
}