{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>          JOIN OVER 1,400+ SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE</strong></p><p><strong>----------</strong></p><p><em>\"<strong>Made My First Sale!!! It Really WORKS!!!!</strong> </em><em>Hey Jake and Fellow Classmates: </em><em>Course was Great! Jake over delivered! <strong>He cares!</strong> The quality was excellent and he kept it all meat and potatoes! </em><em>I watched Jake's videos. I had questions, I asked him for help. Jake went out of his way to help me. I put what he taught to work in a just a short time, <strong>I made my first sale!</strong> I made my first sale and <strong>netted around $22.99</strong>. Now my goal is to do that 30 times a month! </em><em>Sky Is The Limit! </em><em>Thanks Jake! Massive Action = Massive Results!\" - Michael Black</em></p><p><em>\"Passionate, Smart and a Great Teacher.. Great course but an even greater teacher. Jake's passion shines through in each and every module and it is clear his ethos is to provide as much value to <strong>each and everyone person</strong> taking the course. For me he is one of the best instructors on Udemy and <strong>I purchased his other courses with the money I made of this one!</strong>\" - Will McG</em></p><p><em>\"One of the best courses of its type on Udemy. </em><em>This course has everything needed for beginners to eBay, or online marketing in general, to make a <strong>successful and profitable business</strong>. Even experienced online marketers can add this system very easily to their repertoire, without it distracting from their other business and what's more - <strong>make money now</strong>. </em><em>Thanks Jake for putting this course together.\" - </em><em>Tony Parzakonis</em></p><p><strong>----------</strong></p><p><em><strong>LATEST:</strong> Course Updated with Real Case Studies!</em></p>  <p>  \t                        Start making money, no experience whatsoever, immediately - just like my current <strong>1,400+ students</strong>!  </p>  <p>  \t<em>Please - if you're looking for \"instant easy get rich quick\" money, don't take this course. You'll need to study the course and take action, following the simple video modules. </em><em><strong>You only need a computer and an internet connection, and you can start earning money as soon as you complete the course and decide to take action.</strong></em>  </p>  <p>  \t                        No website is needed!  </p>  <p>  \t<em><strong>NEW!</strong> Now includes updated modules to speed up the process for making fast and easy dropshipping sales by quickly expanding your inventory!</em>  </p><p><em>--------------------</em></p><p><em>My current Udemy courses have members from <span><strong>1</strong></span><span><strong>19 different countries</strong></span> around the world!</em></p><p><em></em>+++++++++++++++++++++++</p>  <p>  \t                        About this course:  </p>  <ul>  \t<li><em><strong>Over 1,400+</strong> very happy students</em></li>  \t<li><em><strong>No</strong> website, no technical experience or anything else is required</em></li>  \t<li><em><strong>Dozens of 5 Star Reviews</strong> from VERY satisfied students</em></li>  \t<li><em>Full, <strong>unlimited lifetime</strong> access</em></li>  \t<li><em>All future extra lectures and upgrades are always <strong>included for free</strong></em></li>  \t<li><em>Unconditional <strong>Udemy 30 day money-back guarantee</strong> - that's our personal promise of your success!</em></li>  \t<li><em>On-screen, over the shoulder view of where to go, what to click, and how I set everything up from <strong>start to finish</strong></em></li>  </ul>  <p>  \t                        SEE HOW I GET:  </p>  <ul>  \t<li>Hundreds of thousands of physical products available to sell and ship from my living room without ever touching a single package myself</li>  \t<li>Ready, willing and able customers searching for these products and paying me their hard earned money before I ever purchase the item myself</li>  \t<li>Exclusive discounts on the items I sell, allowing me to increase my profits on every single sale that I make</li>  </ul>  <p>  \t                        .... all very easily, day after day, after day!  </p>  <p>  \t                        Today, you can start to make good money, easily, using this little-known strategy, with <strong>ZERO prior experience</strong>!  </p>  <p>  \t<em>This complete course has been taken by <strong>over 1,400+ students</strong> already - see the amazing reviews below!</em>  </p>  <p>  \t                        You will need no websites, authority blogs, sales funnels, email series, paid advertising, or bulky and confusing softwares.  </p>  <p>  \t                        Follow along by looking right over my shoulder, on my screen, and see exactly how I set this up quickly and effectively, from start to finish.  </p>  <p>  \t                        The best part - you never pay in advance for a single item that you sell, only after you get paid by the customer. So there's no way you can actually lose money..  </p>  <p>  \t                        You'll learn  </p>  <ol>  \t<li>How to set up your very own seller account on eBay if you don't have one</li>  \t<li>The exact format I use to set up every single one of my listings</li>  \t<li>Where to get your insanely huge inventory of physical products at no cost to you</li>  \t<li>How to find products that are already selling on eBay</li>  \t<li>How to quickly and easily ship each item you sell without ever actually touching the item</li>  \t<li>How to make sure you never run out of stock for an order</li>  \t<li>How to outsell the other dropshippers on eBay</li>  \t<li>How to get your money from PayPal faster when getting started</li>  \t<li>How to get a discount from the supplier on items you sell to rapidly increase your profits with no extra effort</li>  \t<li>How to put this entire process into action starting today</li>  </ol>  <p>  \t                        ... and much, much more!  </p>  <p>  \t                        So, you've read this far! <strong>Thank you</strong>.  </p>  <p>  \t                        The third, fourth, fifth, and sixth video in this course <strong>can be seen by everyone below</strong> and explain the process of dropshipping on eBay and why it's so effective.  </p>  <p>  \t<em>One final, very important point</em>.  </p>  <p>  \t                        You may be struggling to make money online or to make sales in your current dropshipping business, and I'm going to explain why this is happening inside this course. As you will learn, <strong>it's not your fault</strong>.  </p>  <p>  \t                        You can start making money with your very own dropshipping business as soon as you complete this course!  </p>  <p>  \t                        Click the '<strong>take this course'</strong> button, top right, now ... <em>every hour you delay is costing you money </em>...  </p>  <p>-Jake</p>", 
    "end_date": null, 
    "title": "eBay DropShipping: An A-Z Guide for All Levels", 
    "price": "50.00", 
    "instructors": "Top-Rated Instructor: Jake Statler", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235808_1aa5_6.jpg", 
    "course_url": "https://www.udemy.com/dropshippingblueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T18:40:02Z"
}