{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><em><em><em><em><em><em>Course fully up-to-date and new lectures added as of this month.</em></em></em></em></em></em></em><br></p>\n\n<p><strong>JOIN 1,000s OF AUTHORS, STORYTELLERS, AND INFORMATION PROVIDERS WHO ARE NOW GENERATING ROYALTIES AROUND THE CLOCK. </strong><strong></strong></p>\n\n<p>1. Would you like to attract <strong>passive income</strong> every month working <em>part-time</em>?</p>\n\n<p>2. Do you aspire to make more, <strong>tens of thousands</strong>, on your way to becoming a <em>top 100 bestselling</em> self-published author?</p>\n\n<p>3. Are you interested in <em>publishing a great selling ebook</em> or building a<strong> publishing empire</strong>?</p>\n\n<p>If you answered \"yes\" to at least one of these questions, then this course is for you!</p>\n\n<p>From month-to-month, self-publishers account for<strong> more than 25% of the top 100 </strong>bestselling books on Amazon. In other words, thousands of self-published authors are attracting thousands in royalties every month. Furthermore, drawing a six to seven-figure income is possible, just ask Barbara Freethy, James Altucher, and Hugh Howey. These three, among many others, have become million-dollar <strong>self-publishing success stories</strong>.</p>\n\n<p><em>Ebook Publishing Profits</em> is the complete self-publishing mastery course, and it tackles a wide arrange of topics to help you to succeed. We'll discuss: writing and manuscript development, pricing, pre and post-launch strategies, online platform development, and various proven strategies used by other top authors and me. This course is designed to take your <strong>ebook revenues and royalties to the next level</strong>.</p>\n\n<p>As you navigate this course, you'll gain insights and learn the strategies I use to make thousands every month with minimal effort. Upon successful completion of this course, you'll be able to:</p>\n\n<ul><li>Understand the key drivers of success and how they relate to your desired income</li><li>Understand how the six and seven-figure authors make their riches</li><li>Write, develop, and position your manuscript for optimal sales</li><li>Build an effective online author platform to build your fan and subscriber base</li><li>Employ a sound launch strategy to become a real bestselling author</li><li>Capitalize on the entire Amazon author ecosystem with emphasis on KDP</li></ul>\n\n<p><br></p>\n\n<p>Sign up and experience the most <strong>comprehensive self-publishing course</strong> found on the web.</p>\n\n<p><strong>Start Learning!</strong></p>\n\n<p>Enroll now and start making money with ebooks TODAY!</p>", 
    "end_date": null, 
    "title": "Ebook Publishing Success: Amazon Kindle Publishing Empire", 
    "price": "20.00", 
    "instructors": "Chad Tennant, Make Money Online - Home Business", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437458_fb96_11.jpg", 
    "course_url": "https://www.udemy.com/ebook-publishing-success-amazon-kindle-publishing-empire/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T12:15:39Z"
}