{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hi, my name is Matt Bernstein, successful Udemy instructor with over 45,000+ students across 186 countries. But, I'm going to make the proper assumption that you have no idea who I am.</p><p>So listen, I have a booming voice and like to get straight to the point.</p><p>From a business standpoint, I sold over $750,000 in retail products in the last 2 years.<br></p><p>Learn how to sell on eBay, gain access to retail products at wholesale prices and spend no money upfront.</p><p>It doesn't cost anything to open wholesale accounts, to work with legitimate wholesalers. You don't need to buy any inventory upfront.</p><p>You'll learn how to gain access to any product at wholesale prices. You'll be able to list wholesalers inventory, for free.</p><p>Only after you make a sale the wholesaler will ship your order to your customer. You never need to keep an inventory and you only buy the customers order after you make a sale.</p><p>You make a profit.</p><p><strong>At the end of the course you'll learn how to…</strong></p><ul><li>Set up an eCommerce store.</li><li>Gain access to any retail product at wholesale prices and have them drop shipped to customers.</li><li>Validate their retail product ideas and prove they sale by using eBay, Amazon, and Google.</li></ul><p><strong>Who should take this course? Who should not?</strong></p><ul><li>Students with full-time incomes, who want to supplement with a part-time passive income, selling online.</li><li>Students must develop patience and discipline to know that success does not happen overnight, you have to put in the work.</li></ul><p><strong>As a very small token of my appreciation:</strong></p><p>When you scroll down the page, you'll see some lectures are available to watch for free.</p><p>You'll get a look over my shoulder (step by step guide) to learn exactly how I became successful selling online.<br></p>", 
    "end_date": null, 
    "title": "eCommerce for Beginners: A Guide to Dropshipping Products", 
    "price": "20.00", 
    "instructors": "Matt Bernstein, Skillhance, LLC", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310754_649a_9.jpg", 
    "course_url": "https://www.udemy.com/dropshipping-with-bigcommerce/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T13:05:23Z"
}