{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\"><strong style=\"\"><em style=\"\">Online selling is one of the easiest ways to make money from home!</em></strong></span>  </p>  <p style=\"\">  \t<span style=\"\"><br style=\"\">  \t</span>  </p>  <p style=\"\">  \t<span style=\"\"></span><span style=\"\">So... You're ready to take the plunge and begin selling online - but you don't know where to start?</span>  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Do you begin by selling on eBay, Amazon, Etsy, Craigslist?</span></li>  \t<li style=\"\"><span style=\"\">What about setting up your own ecommerce website?</span></li>  \t<li style=\"\"><span style=\"\">What about shopping carts and payment systems?</span></li>  </ul>  <p style=\"\">  \tIf you are brand new to the idea of selling online, this introductory course will give you those initial answers you are looking for.  </p>  <p style=\"\">  \tI've been selling on these platforms for over 15 years and in this course, I will walk you through over a dozen of the top ecommerce websites and selling platforms and show you what's good and not so good about each of them!  </p>  <p style=\"\">  \tYou will clearly understand these top online selling venues and, when you complete this course, you will have a much clearer understanding of the best place for you to get started.  </p>  <p style=\"\">  \tIf you are already well-versed in the ecommerce world, then this isn't the class for you.  </p>  <p style=\"\">  \tBut if you want an excellent course that shows you, step-by-step, where the best places to sell online are, then this is the course for you!  </p>  <p style=\"\">  \tAlso included - a PDF of the entire presentation so you can click on the links and immediately go to the sites and resources.  </p>  <p style=\"\">  \tTake this course and benefit from Udemy's 30-day money back guarantee - you'll be glad you did!  </p>", 
    "end_date": null, 
    "title": "Ecommerce - Introduction To The Top 12 Ecommerce Platforms", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372108_eef1_3.jpg", 
    "course_url": "https://www.udemy.com/ecommerce-introduction-to-the-top-12-ecommerce-platforms/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T05:29:54Z"
}