{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  You Don't Have To Be An Internet Whiz To Make Consistent Money From Home—You Just Need The Right System  </p>  <p>  \t  Dear Frustrated Worker,  </p>  <p>  \t  Does it ever seem like everybody is making money on the internet except you?  </p>  <p>  \t  If so, I know exactly how you feel. When I first tried my hand at earning money online, it seemed like there were too many obstacles. Either it cost too much to get a system in place, or it was too complicated, or I'd hear about a hot method that was supposed to make a ton of money but I had no idea where to begin.  </p>  <p>  \t  After months of trial and error (it felt like a lot more error than anything else), suddenly it happened—I checked my dashboard and discovered that I had earned money.  </p>  <p>  \t  And I earned money the next day…  </p>  <p>  \t  And the next…  </p>  <p>  \t  And it just kept coming in.  </p>  <p>  \t  As I honed my methods and figured out my own system, it wasn't long before I could count on earning  $997  per day, for doing next to nothing!  </p>  <p>  \t  I Was Overjoyed! Finally I'd Found A System That Works!  </p>  <p>  \t  Finally I could say that I was one of those lucky guys who gets to stay at home and rake in the bucks.  </p>  <p>  \t  When my friends found out how much I was making, they begged me to let them in on my secret, and pretty soon they were earning money too.  </p>  <p>  \t  That's when I realized that I couldn't keep my system secret any longer. There are too many guys out there who are looking for a strategy that works, but they end up chasing dead ends and wasting a lot of time and money.  </p>  <p>  \t  Stop wasting your time trying to figure out complicated systems that never bring in any money.  </p>  <p>  \t  Stop spending your time and money on systems that only scratch the surface of online marketing.  </p>  <p>  \t  It's Time To Start Earning Daily With \"List Building Luxury\"  </p>  <p>  \t  What is \"List Building Luxury?\" Simply put, it's the launching point for all of your future internet marketing endeavors.  </p>  <p>  \t  This powerful video course provides easy to follow, step by step instructions not only to list building, but how to MAKE BIG MONEY while you're at it.  </p>  <p>  \t  Learn the basics of email marketing.  </p>  <p>  \t  Discover the most reliable strategy for making money online.  </p>  <p>  \t  Learn about all facets of online marketing.  </p>  <p>  \t  Establish your base for future online marketing plans.  </p>  <p>  \t  MAKE MONEY, EVERY DAY, FROM HOME!  </p>  <p>  \t  There are a lot of list building courses out there, but almost all of them focus solely on how to send the emails.  </p>  <p>  \t  They leave out the most important part! HOW DO YOU MAKE THE MONEY?!?  </p>  <p>  \t  That's what \"List Building Luxury\" will teach you—everything you need to know to start down the path to consistent online earning.  </p>  <p>  \t  Learn How To Earn $179.15 Per Day—And Save While You're At It  </p>  <p>  \t  When I first started offering \"List Building Luxury\", it was selling fast for $49.00, which is a small investment when you consider how much you'll earn in a single day.  </p>  <p>  \t  But I've decided to offer my program at a special price to my fellow Warriors.  </p>  <p>  \t  For a limited time, you can get this course CHEAP!  </p>  <p>  \t  But be warned—this special price is limited to the first 100buyers who take advantage. After that, it goes back up to its original price (or maybe even higher).  </p>  <p>  \t  So act fast to get \"List Building Luxury\" for less, and in no time at all you'll be on your way to earning consistent money online, right from the comfort of your own home.  </p>", 
    "end_date": null, 
    "title": "Email Marketing: Grow Your Business by Sending Emails", 
    "price": "25.00", 
    "instructors": "Kyle Custis", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424466_124e_3.jpg", 
    "course_url": "https://www.udemy.com/emailmarkerting/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T01:09:09Z"
}