{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>--&gt; Stick with an instructor who has over 15 years of experience selling online, and over 250 5-star reviews on Udemy for his Amazon training courses!<br></p>    <p>  \t<strong>Do you want to find out how to go from <u>$0 in sales to $1.2 million</u> in less than one year?  </strong>I can show you, as I have done this with my own Amazon business and also with my first Ebay business!  </p>    <p>  \t                                   Are you <strong><em>tired</em> </strong>of all the <strong><em>empty</em> </strong>promises from other courses and instructors who have promised you the world and to help you learn how to earn thousands of dollars, but have little experience doing just that themselves!?  </p>  <p>  \t                                   If you answered \"<strong>YES</strong>\" to the questions above, then you have just clicked on the last page you will ever have to click on as you embark on your journey of learning how to sell online from anywhere in the world!  </p>    <p><br></p><p>My name is Anthony Monfet, and I have the experience and knowledge in every facet of online retailing and business success in general.  I will ensure that your internet business is a success, or your money back!<br></p>  <p>  \t                                                                                                                         This course will teach you in layman's terms how you can make a steady income selling whatever you want on a variety of marketplaces online.  </p>  <p>  \t                                                     Don't waste your time or money with other courses from \"<em>online marketers</em>\" anywhere else online!  </p>  <p>  \t        Instead, learn from someone who taught himself everything he knows about selling online -- I will teach you <u><strong>all</strong></u> my insider secrets when it comes to product sourcing, inventory management and also how to increase your sales to make your online business and turn it into a career!  </p>  <p>  \t                                                                                                                         This is <strong><u>NOT</u> </strong>a get-rich-quick scheme.  This is a real <u><strong>money-making opportunity</strong></u>, where I will guide you from Day 1 through D-Day...D-Day is the day that you will launch your online store(s) on Amazon, Ebay, Sears and beyond!  </p>  <p>  \t        After you launch, I will also be with you every step of the way, as I offer <u><strong>weekly webinars</strong></u>, where you can continue your E-Commerce education and continue to learn new ways of making more money on various online marketplaces!  </p>  <p>  \t                                                                                                                         I will get into the positives and negatives about selling on each and every marketplace out there.  You know why?  Because I have sold on nearly <strong>EVERY </strong>marketplace out there at one point or another, so I know first hand which marketplaces are right for which products!  </p>  <p>  \t                                                                                                                         There are many ways to get there, but only one way to find out...and that is by enrolling in my course.  </p>  <p>  \t                                                                                                                         You <strong>CAN </strong>be your own boss, and one day in your near future you will begin to see a steady stream of sales coming in from multiple marketplaces online...  </p>  <p>  \t                                                                                                                         My video training will only take up a few hours of your time, but study hard because if you follow what I teach you will learn how to make a steady living online...also, I will be adding new content every week as I post the webinars that I host weekly for this course (covering new topics each week)!  </p>  <p>  \t<strong>ADDITIONAL BENEFITS:</strong>  </p>  <ul>  \t<li>My <em>Personal  </em><u><strong>Wholesale and Dropshipper Supplier List</strong></u> of over <strong>1,700 Suppliers</strong> (all of which I have personally vetted over the past 15 years).  This list is not just any ordinary list, this list normally sells for <strong>$300</strong>, but you will get it <strong><em>FREE </em></strong>with this course!</li>  \t<li><u><strong>Microsoft Excel Files</strong></u>:  These are included throughout the course as supplements to the lectures to help you run your business more efficiently and successfully.  </li>  \t<li><strong><u>Weekly GoToMeeting Sessions</u></strong> or <u><strong>Webinars </strong></u>with me <em>personally</em>...this is your opportunity to spend time with me each week and ask me anything about selling online -- or simply sit back, relax, and learn from someone who has done it successfully many times before.  I will be covering new topics each week -- all of which I will post to the course so you never miss a beat!</li><li><strong><u>Access to my Private Facebook Group</u></strong><u></u> - access this and learn from other top sellers who are all part of the same community, learning and selling together to make their lives better and sales increase! </li>  \t<li><u><strong>Personal Tutoring</strong></u>:  I will give you 30 minutes <em><strong>FREE </strong></em>of <em>personal</em> one-on-one tutoring via Skype, Google Video Chat, email or on the phone as I help you get your business started and work with you on a game plan so you can get off the ground running.  </li>  </ul>  <p>  \t                                   -----------------------------------------------------------------------------------------------------------------  </p>  <p>  \t        Want to <strong>compare </strong>my course to other similar courses on Udemy or elsewhere?  While most other courses answer \"<strong>NO</strong>\" to the below features, I answer \"<strong>YES</strong>\" to every one of them!  </p>  <p>  \t<u>Weekly Webinars</u>:                 <strong>YES </strong>  </p>  <p>  \t<u>Supplier List</u>: <strong>YES </strong>  </p>  <p>  \t<u>Excel Files</u>:                       <strong>YES </strong>  </p>  <p>  \t<u>Real-life experience</u>:         <strong>YES </strong>  </p>  <p>  \t<u>Detailed Email Replies</u>:     <strong>YES </strong>  </p>  <p>  \t<u>All 5-Star Reviews</u>:            <strong>YES </strong>  </p><p><u>Private Facebook Group</u>:  <strong>YES</strong></p>  <p>  \t                                   ---------------------------------------------------------------------------------------------------------------  </p>  <p>  \t                                                 So whether you are just looking to make an extra <strong>$500</strong> of income per month, or <strong>$5,000</strong>, I will show you what it will take to achieve either one of these goals or greater!  </p>  <p>  \t                                                                                                                   Now don't delay and take a look below at my outline of how I will teach you to go from a novice to an expert in selling online!  </p>  <p>  \t                                                   You have <u><strong><em>NOTHING</em></strong></u> to lose, thanks to <u><strong>Udemy's 30-day Money Back Guarantee</strong></u>!  So don't delay and act <u><strong>TODAY</strong></u>!  </p><p><strong><br></strong></p><p><strong></strong><strong>STUDENT REVIEWS:</strong><br></p><p>\"Wow, I have spent $1000's on how to sell online, and this course has beaten all of the courses I have purchased in the past by far. Mr. Monfet accurately details how to sell on every major platform...If you learn from the best...you will be the best.\" -- Yolanda Lawson</p><p>====================================================================</p><p>\"Anthony is a very clear and engaging instructor. He explains everything you could possibly want to know...and then some! I would highly recommend it to anyone who wants to start on a new and profitable venture!\" -- Julia Jasper</p><p>====================================================================</p><p>\"I tried so many courses before but nothing worked well for me...Finally, I decided to give it one more try and got blown away. This course is a game changer...one of the best courses out there!\" -- Isanganino M'Butho</p><p>---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>", 
    "end_date": null, 
    "title": "Entrepreneur's Course on Building a Business with Amazon FBA", 
    "price": "20.00", 
    "instructors": "Anthony Monfet", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274148_2001_4.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurs-course-on-building-a-business-with-amazon-fba/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T14:53:07Z"
}