{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong><em>This is the best and most comprehensive Udemy course about Etsy period, 6 hours of content. L</em></strong></em><em><strong>atest information about social media marking &amp; making money on etsy.</strong></em><br></p>\n\n\n\n<p><em>Features the most complete etsy course guide covering marketing, sales &amp; social media. Actual hands on lessons screen capture where i use video to show you how to sell on etsy with real tutorials no boring slides to listen handsdown the best course on etsy</em></p>\n\n\n\n\n\n\n\n<p><em><strong>LARGE PORTION OF THIS COURSE FOCUS IS MARKETING ON SOCIAL MEDIA</strong></em></p>\n\n\n\n\n\n\n\n<p><em>Did you know that last year Etsy made 1 billion dollars in sales and got over 50 million users! The amount of money you earn in this market place is potentially unlimited. In this course you will learn how to make money in Etsy using EVERY possible way to your success</em></p>\n\n\n\n\n\n\n\n<p><strong>About this course</strong></p>\n\n\n\n\n\n\n\n<p>Did you know that many people are making good money selling on etsy stuff they love to create or vintage stuff they enjoy collecting. Some of the largest sellers on this site are making a living doing just that. With etsy your degree of success is 100% depended on what you put into advertising and marketing. </p>\n\n\n\n\n\n\n\n<p>Ultimate Etsy stores marketing and sales strategy guide. This course will teach you how to create listings that sell, how to use social media to boost sales and taking marketing to the next level. With Etsy you can either market your own shop or pay them to market you. To create this course we combined the best Udemy marketing experts Sergey and Alex to take your selling to the next level. </p>\n\n\n\n\n\n\n\n<p>What we did is study some of the best sellers on Etsy and created a course that will take your selling to the next level. After taking this course you should be able to get ideas what product to sell on etsy, how to creating an attractive listing and where to market your etsy shop. </p>\n\n\n\n\n\n\n\n<p>To get you started you will get 40 free listings that stay active for three months, each listing on etsy costs 20 cents enrolling in this course saves you $8 in listing fees. Etsy also has the lowest commission rates in the whole ecommerce industry final value fees are only 3.5% vs ebay average of 10% and amazon 15%.</p>\n\n\n\n\n\n\n\n<p><strong>Class highlights....</strong></p>\n\n\n\n\n\n\n\n<p><em>40 Free listings on Etsy</em></p>\n\n\n\n\n\n\n\n<p><em>Complete sales guide to etsy</em></p>\n\n\n\n\n\n\n\n<p><em>Social media marketing strategies</em></p>\n\n\n\n\n\n\n\n<p><em>Dominate twitter and facebook marketing</em></p>\n\n\n\n\n\n\n\n<p><em>Etsy special features and listing tips</em></p>\n\n\n\n\n\n\n\n<p>Every minute you are waiting to decide you could be making money. Why let a competitor get this knowledge before you? Etsy been around for ten years but only lately it has seen a surge in interest in fact it expended so much that it had its Initial Public Offering this year IPO on the stock market keyword \"etsy\" and it is now in the money making business. </p>\n\n\n\n\n\n\n\n<p>This course will prepare you how to market and get your story ready before the busy holiday season once you learn all those neat tricks of the trade you should be very profitable around that time of the year.</p>\n\n\n\n\n\n\n\n<p>As always to your success see you on the inside,</p>\n\n\n\n\n\n\n\n<p><em>Sergey &amp; Alex</em></p>", 
    "end_date": null, 
    "title": "Etsy shop complete marketing and social media strategy guide", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov, Alex Genadinik", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461100_d4ff_12.jpg", 
    "course_url": "https://www.udemy.com/learn-to-sell-on-etsy/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T01:15:36Z"
}