{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p> <strong style=\"\">JOIN THE 3000+ PEOPLE I HAVE CONSULTED ON ECOMMERCE AND HELPED INCREASE THEIR SALES VIA ETSY!</strong> </p><p> Three reasons to TAKE THIS COURSE right now! </p> <ol style=\"\"><li>You get <strong style=\"\">lifetime access</strong> to lectures, including new lectures every month (<strong style=\"\">content is added constantly</strong> as updates to Etsy and software roll out).</li><li>You can <strong style=\"\">ask me questions</strong> and <strong style=\"\">see me respond</strong> to every single one of them thoughtfully in the course discussions section!</li><li>What you will learn in this course is original, tested, and very detailed! Learn the Etsy seller strategies I implement for clients daily, including where to start, what products to sell, how to source them, how to list them on Etsy, then how to get your products ranking in the first position! This course will also layout how to optimize your Etsy product listings and enable you to reach any type of keyword for that product! Why burden yourself with creating a new .COM for your eCommerce store and driving traffic to it? Use the eCommerce search engine GIANT Etsy! People go to Etsy with one thing on their mind...BUY! Learn how to make money using Etsy starting today! </li></ol><p>In this course, you will learn <strong style=\"\">How to Sell on Etsy </strong>from beginner level to advanced!</p><p>You will be able to optimize your Etsy listings for increased sales and decreased advertising costs. You will be able to find top selling products and source them yourself to sell on Etsy. You will learn from my mistakes so you are in the driver seat to top Etsy seller status! You will be able to grow your current brand or new Etsy shop via the mass traffic Etsy provides and he Social Media Marketing tactics I teach you! Join this course now to learn how to earn a second income on Etsy! </p><p><strong style=\"\">TAKE A STEP IN THE RIGHT DIRECTION WITH YOUR LIFE AND LEARN HOW ETSY CAN PROVIDE YOU WITH THE FINANCIAL FREEDOM WE ALL SEEK! ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "Etsy 101: Set Up a Shop and Promote It on Social Media", 
    "price": "20.00", 
    "instructors": "Coursenvy Online", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537484_f275_2.jpg", 
    "course_url": "https://www.udemy.com/etsy-101-set-up-a-shop-and-promote-it-on-social-media/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-25T22:11:25Z"
}