{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>[Course Updated on Sunday May 1st, 2016]</em><br><strong>No matter Who or Where you are. Make money from Home.<br>Import from China, sell on Amazon FBA. The Complete Course.<br></strong><strong>✓ 30 Day, No questions asked, Money Back Guarantee.</strong><strong><br></strong><strong>✓ 100% Student questions solved. Also via skype.<br></strong>Students, just need a computer, an internet connection to get started.</p>\n\n<p><strong>This is a 100% Beginner-Friendly Step by Step guide on How to make Money online. From home. Easy to Follow, Easy to Understand, Easy to Start.</strong></p>\n\n<p>No matter where you are located, what your nationality is, or little money you want to convert into your first and initial investment, you will get a vast knowledge and entire description on the process of how to generate a new, stable, scalable source of income. It's 2015. Becoming a product middleman is just a few clicks away.</p>\n\n<p>In this course, I commit to teaching you how to:</p>\n\n<p>1. Correctly identify best selling items<br>2. Correctly source items from Low-cost factories overseas<br>3. Correctly <strong>import products</strong> into the United Estates<br>4. Effectively list items<br>5. Have Amazon to all the tedious work for you!<br>6. Market items to your target audiences<br>7. <strong>Sell your products<br></strong>8. Correctly perform and follow up on sales<br>9. <strong>Obtain profits<br></strong>10. Declare your taxes<br>11. Repeat, expand, grow</p>\n\n<p>The terminology utilized in this course is easy to understand for non-native english speakers, for the purpose of making the learning of this course possible for anyone who has a basic english level. There is <strong>no necessary previous experience</strong> for taking this course. You will learn absolutely everything necessary in this course, and you will earn a huge knowledge on how to start your own importing business. As your teacher, <strong>I commit</strong>, to solving any doubt wherever it might appear. Please use this service at all times!It should take about a week, on an average, to effectively complete the course, since it's structured on easy-to-follow lectures put in a chronological order for the ease of learning. Make the most out of your free time. It will be a slow beginning, but those who show patience and are constant on the course instructions, will soon start seeing a compensation, which can be grown with follow ups.</p>\n\n<p>Ready for a change?<br>Now you are an Entrepreneur.</p>\n\n<p>Best,<br>Gonzalo</p>", 
    "end_date": null, 
    "title": "Extra Salary, hands free: Import from China, sell on Amazon.", 
    "price": "25.00", 
    "instructors": "Gonzalo F", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553734_168e_17.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-money-from-home-on-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T21:23:11Z"
}