{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Over 1,000 students enrolled in the first two weeks! </strong></p><p><strong>Ready to make some extra money from home? </strong>Need to increase your income, pay down debt, beef up your savings, or just want to <em>get paid</em> to get rid of clutter? Then this course is for you.</p><p>Almost 900 million people use Facebook every single day. What better place to find people to buy your stuff?  Stop having yard sales in your neighborhood and start having them in the world's biggest community. You will sell your stuff faster and for more money when you list  your items on Facebook. </p><p><strong>This course includes...</strong></p><ul><li>Detailed descriptions, including step-by-step screen shots, that walk you through everything you need to know</li><li><strong>Zero fluff.</strong> We get to the point and teach what you need to know so you can get to it. </li><li>Instructions on how to find lots of buyers on Facebook</li><li>Example scripts on what to say to buyers when negotiating sales that will make your life easier</li><li>Directions on how to create your listings that will attract those who will actually buy your stuff, including real life examples of good and bad listings. </li><li>Information to turn this into a real business so you can continue to make extra money even after you run out of your own stuff to sell</li><li><strong>Tons of tricks and tips for fitting this business into your busy life</strong></li><li>Includes bullet pointed print-outs and full transcripts of lectures</li></ul><p>Learn from experienced Facebook sellers.  This course was created by two busy ladies who have learned to balance full time jobs, families, and Facebook selling. We teach you what we've learned to help you sell your stuff quickly, easily, and without headaches.</p><p><strong>Enroll with confidence! </strong></p><ul><li>You will earn back the money you spend on this course by selling just one or two small items on Facebook. </li><li>Udemy offers a 30 day, no questions asked, money back guarantee. So if you enroll and then feel it isn't a good fit simply request a refund.</li></ul>", 
    "end_date": null, 
    "title": "Facebook Profit: Sell Your Stuff On The World's Largest Site", 
    "price": "45.00", 
    "instructors": "Ashley Barnett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483404_fb20_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-sell-stuff-on-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T16:17:01Z"
}