{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is designed to inspire those students who want to start a business on Amazon, either part-time or full-time. This course will cover the most relevant aspects of the FBA Program, in a fun and engaging way. You will discover strategies that will allow you to create a business that can profit and grow. I started selling on Amazon part-time, then gradually started to increase the amount of products I send to Amazon&#039;s Fulfillment Centers. The more time I dedicate to Amazon by sourcing products and shipping them in, the more profit I see. The profit you make on Amazon can vary from month to month, some of the determining factors are:</p><ul style=\"\"><li style=\"\">The consistency in which you are sending products to Amazon </li><li style=\"\">The demand for the products you are sending in</li><li style=\"\">Competitively pricing your products</li><li style=\"\">The best time to buy inventory, sales increase dramatically during the 3rd and 4th quarters.</li></ul><p style=\"\">This course will guide you through the basics of the Fulfillment by Amazon Program. </p><ul style=\"\"><li style=\"\">You will learn how to create your seller account.</li><li style=\"\">The difference between selling as an individual or professional.</li><li style=\"\">The steps you must follow to sell in closed categories.</li><li style=\"\">Show you how to source products, at low prices and sell them for a profit.</li><li style=\"\">You will learn how to add products to your Amazon store and price them competitively.</li><li style=\"\">Determine if you want to ship sold products using FBA or ship them yourself.</li><li style=\"\">The different FBA fees and how they are deducted from your account.</li><li style=\"\">Use Amazon guidelines to prepare and ship products to the Fulfillment Center.</li><li style=\"\">Supplies you will need to prep and ship your products to Amazon.</li><li style=\"\">Additional tips that will help you create the Amazon store you want.</li></ul><p style=\"\">Building your Amazon business will require you to be creative when choosing products to sell. The more time and dedication you put into Amazon, the quicker you can profit and grow your business. The Amazon FBA Program is an awesome platform for entrepreneurs who might not have any sales or marketing experience to start quickly building the type of business they want.</p>", 
    "end_date": null, 
    "title": "FBA: A Beginners Guide To Selling On Amazon", 
    "price": "20.00", 
    "instructors": "Mary Johnson-Kaminsky", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588872_5064_2.jpg", 
    "course_url": "https://www.udemy.com/fba-a-beginners-guide-to-selling-on-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T21:58:48Z"
}