{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>+++++++ UNCONDITIONAL 30-day money back guarantee! +++++++</strong></p><p><strong></strong><strong>Over 1800 Students are talking about the techniques used in this course:</strong></p><p><strong>\"Great Tech For Finding Work at Home Employment -</strong> <em>I tried this before without having any solid plan. No success. This course provided a great many tips and explanations as to what is working now and why. Getting offers for employment. Now considering freelancing because of the numbers. Great course.\"</em></p><p><strong>\"Best money I ever spent.  - </strong><em>Rachel absolutely covers all bases, and the course would be useful for anybody searching for a job, not just telecommuters. While I was already doing most of Rachel's suggestions before starting the course, a key point that I saw in this class convinced me to make a simple adjustment in my searches. I immediately saw a listing that I hadn't seen before, which I pursued, and landed the job! The course fee was, without a doubt, the best money I ever spent.\"</em></p><p><strong>Do you want to find a job where you can work from home?</strong></p>  <p>Are you tired of commuting to and from your job, wasting time and energy when you could be doing more important things?</p><p>  \t                                      Do you see others working from home? How did they do it?  Do you want to have a telecommuting job just like they do?</p>  <p>  \t                                               To find a telecommuting job, you just have to follow my simple steps that I reveal in one easy to learn course.  Every single technique that I reveal in this course is easy to put into place in minutes - and can give you instant returns.  </p>  <p>  \t                                    I am keeping nothing a secret, I am revealing everything I know.  As I continue to research and try more work from home techniques, the ways that are successful are added at no extra cost to you!  This course will continue to grow.  </p>  <p>  \t                                    If you are looking to improve your work / family balance, if you are looking to save on gas and mileage on your car, if you are looking to start your job every week day by just getting out of bed and walking over to your computer, then this course is for you.  </p>  <p>  \t                                               Simply watch these videos to understand the secrets of how myself and others have found work from home job postings with this easy to use, fact-filled course.  </p>  <p>  \t                                               No shortcuts and no nonsense.  Real telecommuting job postings, not work from home schemes.  </p>  <p>  \t                                               Very simple, proven steps to finding telecommuting jobs easily, quickly and simply.  </p>  <p>  \t                                  If you want my personal \"insider\" information - I have fully telecommuted or partially worked from home for six companies - you need to buy this course...right now.  </p>  <p>  \t                                  All future updates of this course are free – you are “locked-in\" for at the current price of $79 and you will not pay more if you enroll today.  </p>  <p>  \t                                              Try the course out and see if it's a good fit for you.  <strong>If you are not satisfied with this product for any reason, there is a 30 day, unconditional, full money back guarantee.  </strong><strong>You have my personal promise that you will be wowed and amazed by what you will learn.  You will be kicking yourself that you did not buy this course sooner once you complete it.  </strong><strong>This is my personal assurance of your success!</strong>  </p>", 
    "end_date": null, 
    "title": "Find Telecommuting Jobs and Work From Home", 
    "price": "40.00", 
    "instructors": "Rachel Bicknell", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296458_890e_13.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-a-telecommuting-job/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T16:41:15Z"
}