{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t I tried for years to do this Internet Marketing thing, by building tons of websites and struggling to get them any real traffic, all the while not earning enough to make ends meet.  </p>  <p>  \t So one day, I decided to scrap all that and try my hand at creating Fiverr Gigs.  </p>  <p>  \t Once I got into marketing on Fiverr, I was blown away!  </p>  <p>  \t If you're new to Fiverr, you need to realize that it's one of the hottest places to make great money on the web right now. There are thousands of people making a good living, sitting at home, creating Fiverr Gigs, and making thousands of dollars!  </p>  <p>  \t Fiverr truly can be a cash machine on autopilot, but you have to offer the right types of Gigs, set them up correctly, and streamline your order fulfillment processes.  </p>  <p>  \t <strong style=\"\"><em style=\"\">That's exactly what you'll learn in this course.</em></strong>  </p>  <p>  \t The easiest way to learn is by watching \"over-the-shoulder\" training, and that's how this course is delivered. We hold nothing back in this training. We have perfected these methods down to a science, so you're sure to discover what we have: that Fiverr is one of the easiest ways to make money online, even for a complete newbie!  </p>  <p>  \t We'll take you by the hand and walk you through the entire process, from setting up your Fiverr account, to completing your Seller profile, to posting your first Gig. We'll show you how to get more exposure for your Gigs to increase your sales, how to deliver your Fiverr Gigs professionally and efficiently, and how to work your way up to becoming a Top Seller.  </p>  <p>  \t  In the <strong style=\"\">Fiverr Profit Plan ADVANCED</strong> section, you’ll get our personal Fiverr Resource Rolodex and video walkthroughs of the types of Gigs we are actually using to make money on Fiverr!  </p>  <p>  \t  We will show you the actual products and services we use for our own Fiverr Gigs, most of which can be completed with minimal time and effort on your part.  </p>", 
    "end_date": null, 
    "title": "Fiverr Business Plan: Become a Freelance Professional", 
    "price": "20.00", 
    "instructors": "Veronica J. Kirchoff, MyBizBuilders Team", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164084_6c51_3.jpg", 
    "course_url": "https://www.udemy.com/fiverr-profit-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-14T05:44:24Z"
}