{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Discover The Two Secrets To Making Money On Fiverr That The Experts Don't Want Anyone To Know About. </strong>This video course is ideal for beginners that want to know the quickest and most efficient way we know of to becoming a successful seller on the Fiverr website. The level of detail and unique teaching approach used in this video course makes it possible for anyone to become a seller on Fivver with no experience or skills required.</p><p><strong>Get The Insider Information About The Fastest And Easiest Way To Create A Successful Gig.</strong> The video lessons explain the details of the gig, what to do in order to perform the gig, and then walk the student through an example gig creation while on the Fiverr website. By following the guidance provided in these videos, a newbie will be able to create their first gig in less than five minutes. The first gig features the following:</p><ul><li>Nothing To Buy - No materials or supplies. No additional tools or software</li><li>No Travel Required - This gig can be performed at home/work/school, even a different country</li><li>Time Friendly - This gig can be anytime (day/night) and it will typically take anywhere from two to five minutes to perform.</li></ul><p><strong>Next, We Reveal The Most Profitable Type Of Gig That You Can Sell On Fiverr.</strong> This type of gig is easily the most profitable gig that anyone can create. Not only do we share the internal details of the gig, but we also provide a semi-scientific mathematical approach to prove our assertion.</p><p>This video training course is a goldmine that is crammed full of useful and actionable information. It has been called \"<em>the perfect way to begin a successful career on Fiverr!</em>”</p>", 
    "end_date": null, 
    "title": "Fiverr for Freelancers: Simple Tricks for Long-Term Success", 
    "price": "20.00", 
    "instructors": "Dr. Jim Reynante", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697360_f11d_4.jpg", 
    "course_url": "https://www.udemy.com/fiverr-secrets-unlocked/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T18:33:18Z"
}