{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em><em><strong><em></em><strong>LATEST: Course Updated Again for May  2016</strong></strong></em></em></strong></p>\n\n<p><strong>Fiverr Seller, if you’re ‘playing by the book’ then…</strong><strong></strong><strong> </strong>“You’re Losing THOUSANDS of Dollars Every Day You Sell on Fiverr!”<strong>Find out how selling on Fiver the old fashioned way is <u>bleeding your paypal account…</u></strong><strong>And discover the PROFITABLE way to sell on Fiverr …</strong><br></p>\n\n\n\n<p><strong>Learn Secrets to Increase Profit, Fans, Engagement &amp; Reach on  Fiverr</strong></p>\n\n\n\n<p><strong>Fiverr lays back, sits pretty – and then takes a HUGE 20% cut of your final gig!</strong><br></p>\n\n\n\n<p>That’s right, after you go through the painstaking trouble of putting together the gig and delivering the work, they take 1/5th of the final payment.</p>\n\n\n\n<p>Then to make matters worse, they make you wait 14 days before you can even withdraw your meager $4.</p>\n\n\n\n<p><em>And don’t forget, paypal gets a cut too!</em></p>\n\n\n\n<p>So I bet you’re thinking to yourself –</p>\n\n\n\n<p><strong> “Wow, you’re right!  Why WOULD anyone want to sell on Fiverr?  Sounds like only an idiot would go on there.”</strong></p>\n\n\n\n<p>And if you signed up on fiverr just to slave over endless gigs to earn $4, I’d agree with you.</p>\n\n\n\n<p>The GOOD NEWS is..........</p>\n\n\n\n<p> If you have a talent or skill that you think you could use to make a little extra money and gain some work experience, then why not give Fiverr a try? </p>\n\n\n\n<p>Fiverr is sort of like a cross between an Internet classified website a temp agency and auction website all rolled into one. The website takes its name from the fact that the price for most jobs start out at just five dollars .</p>\n\n\n\n<p><strong>WHAT YOU WILL GET INSIDE THIS COURSE:</strong></p>\n\n\n\n<p><strong><em>Road to Top Rated Seller: </em></strong>I share some tips on how to become a Top Rated Seller as well as share my story on how I did it and how you can too.</p>\n\n\n\n<p><strong><em>In-Demand Gigs: </em></strong>You’ll see what gigs are in demand and what to sell. You will know how to sell them with minimal skill and effort. Most gigs I recommend don’t require a specific set of skills or talents.</p>\n\n\n\n<p><strong><em>100% Positive Rating: </em></strong>You will know what to do to get only positive reviews from buyers on Fiverr as well as ways to get your first orders and reviews on all your new gigs to get the ball rolling.</p>\n\n\n\n<p><em><strong>Secret Sauce: </strong></em>My secret ingredient. This one thing blew up my Fiverr literally overnight. This could change the amount of sales you receive on Fiverr really quickly by making one simple but key change.</p>\n\n\n\n<p><strong><em>... and a whole lot more!</em></strong></p>\n\n\n\n<p>It's a place where anyone can use the skills or information they possess to make money. It can range from saying someone happy birthday over the telephone or picking up someone's dry-cleaning or helping them learn a foreign language, or writing a press release or article or providing art for comic books or T-shirts and even doing voiceover work and anything else you can imagine from writing cookbooks to poetry. If you have a skill or underutilized talent that you feel has a market then Fiverr is the place to be!</p>\n\n\n\n<p>This course will teach you everything you need to know to be a successful entrepreneur on Fiverr, including the very basics such as how to set up an account and get your first gig and then moving on to advertising and swapping gigs.</p>\n\n\n\n<p><strong>Easy To Sell And In-Demand Gigs</strong></p>\n\n\n\n<p><em><strong>This course cleanly lays out for you 5 highly in-demand gigs, many of which do not require any special skill or talent, and show how exactly to sell them. I hold your hand and go through everything from the gig title to the description to keywords and even what gig extras work best for each type of gig. I go into every little detail for 5 gigs</strong></em></p>\n\n\n\n<p> You will also learn things like advertising your skills and getting as many gigs any specific market niche as possible to increase your maximum amount of profits.</p>\n\n\n\n<p> So if you are looking for an entertaining and exciting way to use your unique skills to make a little extra cash, or even run a full or part-time business, then you should give <strong>Fiverr</strong> a try and start your online entrepreneurial career today!</p>\n\n\n\n<p><strong>This course could easily sell for hundreds of dollars. I personally know of gurus out there who are charging hundreds, even thousands of dollars for a fraction of the information contained in this Udemy Course.</strong></p>\n\n\n\n<p><em>As with all my courses:</em></p>\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently $ 45, but will next increase to $ 397</li><li>You have unlimited lifetime access at no extra costs ever !!!</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money back in full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy.</li></ul>\n\n\n\n<p>PSS: Do you really want to be a <strong>\"Successful Fiverr\" </strong>? Do you really want to enjoy a lifestyle that you only dream about now?</p>\n\n\n\n<p>PSSS: It will take hard work. It will take perseverance. But if you can honestly answer “Yes\" then there is no reason why you can't start building your <strong>Fiverr Empire</strong> today.</p>\n\n\n\n<p>This will be a truly interactive course with additional bonus routines added over the course of the first year, inspired by the feedback from students.</p>\n\n\n\n<p><strong>Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...Scroll up and Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "Fiverr : The Ultimate Top Rated Fiverr Marketing Class", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610996_8c1a_2.jpg", 
    "course_url": "https://www.udemy.com/making-money-on-fiverr/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T19:43:38Z"
}