{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em><strong>************************************************************************************</strong></em></p><p style=\"\"><em><strong>FIVERR GIGS EXPLAINED IN A STEP-BY-STEP MANNER. </strong></em></p><p style=\"\"><em><strong>Become a Fiverr Seller Today and Earn a Full-time Income on Fiverr! </strong></em></p><p style=\"\"><em><strong></strong></em><em><strong>[New Fiverr Gig ideas posted on a weekly basis]</strong></em></p><p style=\"\"><em><strong>************************************************************************************</strong></em></p><p style=\"\"><em><strong></strong></em><strong>FIVERR  is a GOLDMINE for sellers!</strong></p><p style=\"\"><strong></strong>Fiverr is a global online marketplace where people can buy and sell services (known as Gigs) starting at just $5. From a seller's point of view, Fiverr offers a great opportunity to make nice profits with almost zero investment. You can start selling gigs today – gigs related to social media banners, voice-overs, eBook covers, business cards, photo sketches, fun gigs, word-clouds, testimonials and much more.. and the best part however, you can deliver these kind of gigs in less than 10 minutes without requiring any special skills for the same.</p><p style=\"\"><strong>AMAZING FIVERR GIG SECRETS REVEALED! </strong></p><p style=\"\"><strong></strong>In this course, I will take you by the hand and show you how to create hundreds of evergreen Gigs that are in great demand on Fiverr. I will show you how to utilize free tools online that are used by top sellers to sell your Gigs and make great profits! </p><p style=\"\"><em>NOTE: All the online tools discussed in this course are closely related to the course material and are necessary to enhance your learning. Some of these tools may require you to signup for free to access them.</em></p><p style=\"\"><strong>BE A FIVERR ROCK-STAR!</strong></p><p style=\"\">By the end of this course, you'll be on your way to selling Gigs left, right and center without having to worry about the next gig idea or spending hours on delivering a Gig!</p><p style=\"\"><strong>COURSE STRUCTURE</strong></p><p style=\"\">The course is structured into 3 key sections:</p><ol><li>Introduction: includes details about setting up an account and various levels in Fiverr and their benefits </li><li>100+ Killer Gig Ideas and Execution – which are further organized into various sub sections</li><li>Conclusion: includes next steps and course of action. </li></ol><p style=\"\"><strong>COURSE MATERIALS:</strong> Videos + Text</p><p style=\"\"><strong>COURSE DURATION:</strong> Approx. 2 Hours</p><p style=\"\"><em><strong>Be a part of Fiverr awesomeness... See you on the other side!</strong></em></p>", 
    "end_date": null, 
    "title": "FIVERR: Become a Success on Fiverr with 100+ Gig Ideas", 
    "price": "20.00", 
    "instructors": "Smartpreneur Academy ✪", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557354_f3cb_10.jpg", 
    "course_url": "https://www.udemy.com/fiverr-gigs/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T17:16:51Z"
}