{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you struggling to make money on Fiverr?</p>  <p>  \t       You get orders, but you don't earn enough money you want to?  </p>  <p>  \t       You have a great gig, but you don't get much traffic, or you get a load of traffic but only a few buys your gig?  </p>  <p>  \t<strong> Now It Is the Time to Change Your Perspective and Take Your Micro Freelance Business into the Next Level.. </strong>  </p>  <p>  \t       This course will cover a range of subjects aimed to help you sell more and ultimately making more money on Fiverr.  </p>  <ol>  \t<li>How to optimize your Fiverr gig for success</li>  \t<li>How to double your gig traffic</li>  \t<li>How to double your conversion rate</li>  \t<li>How to get featured on Top Gigs in your category</li>  \t<li>Networking with clients in a way that gets you repeat sales and upsells</li>  </ol>  <p>  \t       I will explain to you precisely what gig title, descriptions and also keywords should work with in addition to the best solutions to optimize your current gigs that attract most sales possible. My secret active ingredient. This can adjust how many sales you receive on Fiverr genuinely swiftly simply by making easy but necessary modifications.  </p>  <p>  \t       I provide numerous tips and solutions to enhance your current gigs for far more orders, a better typical selling price and much more profit.  </p>  <p>  \t       ________________________________________________________________________________________  </p>  <p>  \t       This is not the course where you learn how to create a gig or setup Fiverr profile. I have cut a lot of unnecessary things that makes this course Quantity without Quality. So All you have with you is Pure Value!  </p>  <ul>  \t<li>This course is set out in Three Important Sections.</li>  \t<li>Each will be more important to help you achieve the result you want.</li>  </ul>  <p>  \t<em> Thank you for reading so far..</em> Looks like you really need this course. Get in and I assure your time and money will not be wasted, rather it will be worthwhile!  </p>  <p>  \t       So what are you waiting for? <strong>TAKE ACTION NOW!!!</strong>  </p>", 
    "end_date": null, 
    "title": "Fiverr Success: Effective Freelancing Strategies", 
    "price": "30.00", 
    "instructors": "Snehal Wagh", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334560_092d_6.jpg", 
    "course_url": "https://www.udemy.com/fiverr-success-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T05:50:18Z"
}