{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Fiverr: In this course, we'll tackle everything, from set up to getting more exposure, so you'll be able to create a hugely successful Fiverr business from scratch or enhance an existing one.</p><p><em>Student testimonial: </em><em>★★★★★ </em><em></em><em><strong>This Fiverr Course is Amazing! \"..</strong>.</em><em>Whether you're new to Fiverr or already well acquainted, this course is worth every cent.\" - Peta-Ann Smith</em></p><p><strong>Design a Hugely Popular and Highly Profitable Fiverr Service</strong></p><p><strong></strong>✔ How I Became a Top Rated Seller in 6 Months &amp; You Can Too!</p><p>✔ How to get started selling on Fiverr even if think you have no marketable skills</p><p>✔ 6 Tactics That Will Help You Get More Sales on Fiverr</p><p>✔ 5 Strategies to Gettting More Reviews on Fiverr</p>Once enrolled, you'll also have access to myself, a Top Rated and Featured Fiverr seller, so you can get feedback, advice and support as implement these strategies.<p><strong></strong></p><p><strong>Save Yourself Time by Knowing What Works on Fiverr</strong></p><p>This course will show you what it takes to be a truly successful Fiverr seller. You'll cover the ins and outs of developing your offer so you'll understand what it takes to create and launch a service that sells. With the tips and strategies you'll learn, you'll be able to save time and effort so you can generate a second income from one or more Fiverr services</p><p><strong>Content &amp; Overview</strong></p><p><strong></strong>Whether you're looking to build a side income, get paid to learn a new skill or test business ideas at a micro level, this course will help you achieve your goal.</p><p>I'll reveal every tactic, trick and secret that I have learnt over the last 1.5 years selling on Fiverr.</p><p>This course is a valuable investment to make in yourself especially when you can earn back the cost of it in just a quick few sales on Fiverr.<br></p><p>So when you're ready to start your Fiverr business go ahead and hit the <strong>\"take this course\" </strong>button and <strong><em>join the 2500+ students already enrolled</em></strong>.<span></span></p><p>But don't wait too long, because every moment you hesitate you're missing out on cold hard cash!</p><p>Believe me, the only regret you're going to have is that you didn't find this course 6 months ago <em>or your money back!</em></p><p><strong>See you inside the course!</strong></p><p><em><br></em></p><p><em><strong></strong></em></p>", 
    "end_date": null, 
    "title": "Fiverr Freelancing: Learn from a Fiverr Top Rated Seller", 
    "price": "20.00", 
    "instructors": "Daragh Walsh", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517404_b22c_10.jpg", 
    "course_url": "https://www.udemy.com/fiverr-freelancing-learn-from-a-fiverr-top-rated-seller/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T19:51:39Z"
}