{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<strong>Are you already selling on Fiverr?\n\n</strong><p><strong>Or do you plan to?</strong></p>\n\n<p>What if we show you how to scale up your Fiverr business... and generate a five figure monthly income?</p>\n\n<p>In recent years Fiverr has quickly become the #1 favorite platform for freelancers to kickstart their online careers.</p>\n\n<p>... And for some, this is the stepping stone to their first business empire!</p>\n\n<p>Way we see it, there are 2 types of Sellers on Fiverr:</p>\n\n<p>The first type is the Freelancer. The one who sells his or her service.</p>\n\n<p>Do it right, you can make good income doing what you do best.</p>\n\n<p>But what if you are to scale to $5,000... $10,000... $15,000 a month or more?</p>\n\n<p>No matter how efficient you work, there's only so much you can do and so many clients you can take on.</p>\n\n<p>This is how the second type of Sellers do DIFFERENTLY from the rest...... And if you want to know how to scale your income without clocking in extra hours...You owe it to yourself to see this.</p>\n\n<p>We  have created this blueprint on what we call the Fiverr Brokering Secrets. </p>\n\n<p>Our  blueprint shows how you can become a Fiverr Broker and build a business WITHIN a business.</p>\n\n<p>You see, not everyone on Fiverr is finding the clients they're looking for, and most of them, not enough.</p>\n\n<p>You can help get clients - and GET PAID for it!</p>\n\n<p>And the best part is: this will leverage your business and generate more profits!</p>\n\n<p>In a more conventional term, you're the middle man where you get freelancers to do the work for your clients you've found (that they otherwisewouldn't be able to)</p><p>This frees you from having to do every gig on Fiverr yourself.\n\n</p><p>You will learn:</p><ul><li>How to get started as a Fiverr broker.</li><li>How to outsource your gig to another freelancer.</li><li>How to generate traffic to your profile.</li></ul><p><br></p><p>Ultimately build a scalable business from this...as this is, in our opinion, the fastest and smartest way to cash in massively from Fiverr - and that is to be that second type of Seller.</p>\n\n<p>The reason why we releasing this blueprint is because we see so many Sellers on Fiverr, and even more potential clients scouring the site.... Ironically, this looks somewhat imbalanced and most Sellers are under-exposed.</p>\n\n<p>So if we can train you to become a Broker, you are in turn helping other Fiverr Sellers to get clients they otherwise wouldn't had been able to.</p>\n\n<p>Talk about win-win! </p>\n\n<p>we want to make this affordable so that you can make this happen for you and heck, achieve financial freedom!</p>\n\n<p>If you decide this is for you, just click on the buy button now.</p>\n\n<p>See you inside!</p>", 
    "end_date": null, 
    "title": "Fiverr Easy Brokering ", 
    "price": "20.00", 
    "instructors": "Dynamic Business Solutions (dbs)", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/805542_0ae9_3.jpg", 
    "course_url": "https://www.udemy.com/fiverr-brokering-secrets-m/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-27T17:41:37Z"
}