{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever had the sudden thought to quit whatever you’re doing now? </p><p>Feeling tired and bored with your current 9 to 5 conventional job? </p><p>Sitting on the same old desk for 5 to 10 years… </p><p>Working on the same routine day by day… </p><p>Being underappreciated by your boss and paid peanuts for a pile of tasks you have done… </p><p>Most importantly, you lost your direction and passion. You’re not doing something you like for life. You lack of a platform to show of your skills and talents. </p><p>Working is a lifetime event. If working life is torturing, you’re not going to be happy with it for the rest of your life too. Instead of doing something that you hate, why not working on something you are truly passionate? </p><p>How about starting your own independent career at a platform where you can make use of your skills and talents to earn top dollars in a wealthy and profitable way? </p><p><strong>Top 6 Benefits You Can Gain From My Blueprint</strong></p><ul><li>Flexible Working Hours</li><li>Work At The Comfort Of Your Home<span><br></span></li><li><span>Extra Income Stream<span><br></span></span></li><li><span><span>Show Off The Talents You Possess<span><br></span></span></span></li><li><span><span><span>Sharpen Your Skills<span><br></span></span></span></span></li><li><span><span><span><span>To Achieve Financial Freedom<span></span></span></span></span></span></li></ul><p>Get this course today and you're getting one giant step closer to your dream!</p><p><br></p>", 
    "end_date": null, 
    "title": "Fiverr Blueprint: How to Work From the Comfort of Your Home", 
    "price": 0, 
    "instructors": "edu Ocean", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787518_08cf_3.jpg", 
    "course_url": "https://www.udemy.com/fiverr-blueprint/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T16:51:17Z"
}