{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>JOIN THE FOODIE REVOLUTION - START YOUR OWN FOOD TOUR TODAY!</strong></p>\n\n<p><em>Update: Course last updated April 2016</em></p>\n\n\n\n<p><strong>You can make money with literally no previous experience, no start up money needed, and you can get started on it today!  And you can do it anywhere in the world you want! </strong></p>\n\n\n\n<p>You will need to have a sincere love of meeting and hosting people as well as tasting and sharing various foods. </p>\n\n\n\n<p>The best part of this all is that you can grow this into a 6 figure business and have other tour guides do all the work for you! </p>\n\n\n\n<p>If you want to <strong>make an extra $1000 a month</strong>, this is very doable. If you want to scale this up and <strong>make $10,000 a month or more</strong>, this is also very realistic! We'll show you how in the course! </p>\n\n\n\n<p>One of the biggest benefits to owning a food tour business is that you can work and live literally anywhere in the world</p>\n\n\n\n<p>If you wish, you can relocate to your dream city and start a food tour with nothing but a little hustle and be well on your way to creating a 6-figure business. </p>\n\n\n\n<p>Or maybe you prefer to keep it close to home. Having your own culinary tour is a great way to make a great living while working from home (or from your favorite eateries!) </p>\n\n\n\n<p>This course is taught by two people who both live what they teach. Both instructors own their own lifestyle businesses and make great incomes while working only a few hours a week. </p>\n\n\n\n<p>Emily has a culinary background and created multiple tours and hired tour guides to run the daily tours. </p>\n\n\n\n<p>Sean created his business over 5 years ago and now makes a great living, is traveling world (currently in Europe), and works about 10 hours a week. </p>\n\n\n\n<p>Together, we'll share our business and food tour expertise with you to get started quickly. </p>\n\n\n\n<p><strong>Real World Experience</strong></p>\n\n\n\n<p>This course will answer questions like: </p>\n\n\n\n<p>What is a food tour business? </p>\n\n\n\n<p>How do I start a food tour business? </p>\n\n\n\n<p>What kind of food tour is the best to start?</p>\n\n\n\n<p>How much can I make?</p>\n\n\n\n<p>What should I include on my food tours?</p>\n\n\n\n<p>How can I find other tour guides to do the daily tours?</p>\n\n\n\n<p>How do I price my food tour?</p>\n\n\n\n<p>How do I choose which restaurants &amp; food operators to include on the tour?</p>\n\n\n\n<p>All these questions and more! </p>\n\n\n\n<p><strong>The best part - when you join the course, you get to ask us any questions you want! </strong></p>\n\n\n\n<p>We'll help you with any questions that may come up when starting our own business. This is an interactive course and we'll be adding more content as we go along. </p>\n\n\n\n<p><strong>Get Started Today! </strong></p>\n\n\n\n<p>Just hit the \"Take This Course\" button today and enroll in the course. We look forward to helping you create your own profitable food tour business!</p>", 
    "end_date": null, 
    "title": "Food Tour Business: How to Create Your Own Culinary Tour", 
    "price": "25.00", 
    "instructors": "Sean Marshall, Emily Egge", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456990_4b6a_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-food-tour-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T19:03:25Z"
}