{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Just like our other courses, some of the course videos are available for free preview so that you can get an advanced idea of the teaching techniques and the materials. The demand for technical and non-technical skills is increasing day by day. As a result, freelance industry is booming everyday. In the freelancing world, sky is the limit. You can offer different services as a freelancer including: graphic design, web development, translation, mobile app development, video editing, animation, voice over and much more. In this course, all the fundamentals and advanced concepts of freelancing are discussed including: introduction to freelancing, secret freelancing techniques, Strategies to search for jobs, effective bidding techniques to get your first few jobs, additional strategies to achieve success, overview of top freelancing platform, additional effective freelancing platform (a lot of people don't know about this), and much more. Whether you want to generate some extra income or quit your full-time job, freelancing is the right way to go. Millions of freelancers around the globe work as a freelancer and work from home. Now you can also work from home and be your own boss. You can make money online through freelancing and choose the career of your choice.</span>  </p>  <p style=\"\">  \tFreelance statistics are a great way to show how you’re not alone in wanting to do freelancing, and how freelancers contribute to the overall economy. According to a research study and statistics, there are 53 million people doing freelance work in the US- 34% of the national workforce and people who freelance contribute an estimated $715 billion in freelance earnings to our economy. Also,  </p>  <p style=\"\">  \tTwice as many freelancers have seen an increase in demand in the past year as have seen a decrease – 32% experienced an increase versus 15% who have seen a decrease (BEN MATTHEWS, 2014). If you are passionate about becoming an entrepreneur and work from home, then this is the right course for you.  </p>", 
    "end_date": null, 
    "title": "Freelancing from Home for Beginners: How to Start a Business", 
    "price": "20.00", 
    "instructors": "QAEversity .", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367790_bca6.jpg", 
    "course_url": "https://www.udemy.com/freelancingfromhomeforbeginners/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T03:52:08Z"
}