{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you ready to invest in yourself? Learn how to earn your first $$$–and more–through freelancing</p><p>For the last many years, the #1 request from my linkedin/twitter followers has been “how to earn MORE money” because they told me most of the “earn money” courses they see are sleazy  and or worthless courses that give you the same information you could find on Google.  </p><p>I enquired them what questions they wanted me to answer, and here were some of the most common:</p><p>“I already have a full-time job. Can I really earn extra money on the side without spending 40 hours/week?”</p><p>“I don’t know whether my skills could actually earn me money. How do I decide what to do?”</p><p>“What can you teach me that’s new? I already know the stuff on Google.”</p><p>Their questions were really interesting.</p><p>That’s when I started seriously thinking about building the single-best course in Udemy on earning money through freelancing. Not just high-level advice, but specific strategies and tactics to help you succeed.  </p><p>You DON’T need to spend 60 hours/week to earn $1,000 on the side…</p><p>You DON’T need to set up a sophisticated website or become an SEO master…</p><p>You DON’T need to get 10,000 Twitter followers or set up a YouTube/Facebook/LinkedIn page…</p><p>You DON’T need to create an ebook or product to earn your first $1,000…</p><p>You DON’T need to become a legal expert on business licenses…</p><p>Instead, you need to spend the majority of your time GETTING PAYING CLIENTS. Amazing when you eliminate all the BS.</p><p>It’s not just about the money</p><p>When I asked readers why they wanted to earn more money, the biggest reason across the board was NOT just about the money.</p><p>Actually, the #1 reason I got from you was to be able to eventually leave your job and work for yourself or travel.</p><p>Knowing this, I focused on not only new tactics to earn more, but the psychology of your own barriers — the barriers that are keeping you in a “meh” job. Are you too busy? Not sure where to start? Nervous about investing thousands into an unproven idea? The Earn1k course breaks it down step-by-step.</p><p>All these barriers (and more) can be systematically tested and used to help grow your side income.</p><p> This course contains all-new, step-by-step content. This isn’t the kind of material you can find by Googling “freelancer” or “earn more money” (try it, you’ll see). To create the single best course on the market, we…</p><p>Surveyed thousands of freelancers and full-time employees to see where the biggest barriers are</p><p>Assembled a team of top freelancers to help put the course together, including specific solutions for turning your idea into income, finding your first clients, setting your rates, and marketing yourself</p><p>You can’t find this material anywhere else. It’s an investment to help you earn your first $1,000 on the side — and remember, you can make that income over and over again.</p><p>What’s in this course</p><p>Here’s how I put the course together:</p><p>All-new, super-specific material in hours of professional HD video to demonstrate a structured process to help you earn money, crush psychological roadblocks, and take the years of tactics I’ve been developing and apply them to your market. Perfect if you want to learn the material at your own pace.  </p><p>Ready-to-use, field-tested scripts that we’ve used to ramp up our own freelancing and consulting businesses. We deliver detailed, ready-to-go scripts that we’ve tested and refined over years of successful freelance work. Including:</p><p>Pitching via cold email, with real-world examples and followup scripts</p><p>Questions to ask your client to build trust and uncover hidden problems, overcome objections and speak to desires</p><p>Actual questionnaires used to get inside your customers’ heads and get a deep understanding of your clients’ business (I use this in my own)</p><p>How to charge a firm price and handle price objections</p><p>Scripts with Key Convincer Phrases to use with your clients so they acknowledge your value and happily pay your fee (most people never use these)</p><p>Upselling &amp; getting more work at the end of the engagement</p><p>How to end unprofitable engagements without burning bridges</p><p>The most effective way to follow up with clients that are slow to pay (or aren’t paying at all)</p><p>How to ask for referrals that will snowball your freelance business</p><p>This is premium, never-before-released material, and because we’re teaching you how to earn money, you can re-use the system over and over again. How much is it worth to learn how to increase your earning power, earn extra money whenever you want, and replicate your money-making month after month and year after year?</p><p>We give you lifetime access to the course material once you’ve joined as a member. Use it now to grow your business, and refer to it whenever you like.</p><p>UPCOMING:</p><p>Powerful real-life case studies. Learn how people just like you are earning serious side income doing freelance project management, graphic design, software engineering, writing, Excel consulting, dog walking, professional room-organizing (really), and more. Comprehensive case studies where we ask them all the questions you want to — How much are you really making? What was the biggest waste of time? How’d you convince your customers to pay? Listen to them on the go or read the transcribed versions we’ve put together for you.</p><p>Office hours with me. Private access to ask your questions and get specific answers — including how we’d write that pitch email or phrase your pricing increase. We’ll be here to make sure you have a helping hand in starting to earn money on the side</p><p>Inside stories that we’ve never revealed before. This isn’t some college textbook. We’ve added our own stories of ridiculous clients, tricks and techniques we’ve heard from other freelancers, and case studies on how others earn money on the side. Think of the best college class you ever had, where people wanted to be there.</p>", 
    "end_date": null, 
    "title": "Freelancing Online: Find Your Passion and Your Clients", 
    "price": "20.00", 
    "instructors": "Premanand Doraiswamy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403162_079c_2.jpg", 
    "course_url": "https://www.udemy.com/freelancingonline/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T21:11:29Z"
}