{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Freelancing Course Review: </strong></p><p><em><strong>\"I really like the course as it is very well structured and presented. I got some insights and practical solutions for my freelancing career. Thank you Dave for such a great job!</strong></em><strong><em></em> -Gulnara</strong></p><p>In the \"old days\", freelancing was something you tried when you couldn't find a \"real job\". Not anymore!  </p>  <p>  \t  Today, over 60% of Americans are or have been freelancers!  </p>  <p>  \t  Freelancing is not only a fast-growing world of opportunities, but in this introductory course, you'll discover why there is a \"perfect storm\" brewing that is making online freelancing an even more lucrative opportunity for you.  </p>  <p>  \t  If you've ever wondered \"Where did all the jobs go?\" well, many of them are now available to freelancing pros like you!  </p>  <p>  \t  You will discover the wide variety of jobs, tasks and \"gigs\" that are available to you as a freelancer and you will also discover the fascinating world of \"micro jobs\".  </p>  <p>  \t  We cover the top services you can provide as a freelancing professional and also cover the best websites for each category of services so that you save time and frustration.  </p>  <p>  \t  Also included in this course is a bonus 111-page eBook titled: Freelancing Profits, as well as the entire presentation in PDF form so you can take notes as you go.  </p><p>Take a look at the course curriculum below and be sure to sample some of the free lectures, too!</p>  <p>  \t  This course is backed by Udemy's 30-day. money-back guarantee, so there is no risk in enrolling today!  </p>", 
    "end_date": null, 
    "title": "Freelancing - How To Work From Home Doing Freelance Gigs", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361868_7770.jpg", 
    "course_url": "https://www.udemy.com/freelancing-how-to-work-from-home-doing-freelance-gigs/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T00:43:21Z"
}