{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>Join One of the Web's Leading Professional Development Communities! </strong></em></p><p><em>Course Version 2.2 fresh as of Aug. 28, 2015</em>  </p>  <p>  \t<strong>Learn Skills &amp; Power Your Successful Freelance Business or Startup</strong>  </p>  <p>  \t      Free yourself to grow a meaningful business doing what you love as a solo entrepreneur or freelancer. Tailored to the needs of creative people, developers, and consultants, this course includes real, practical tools including 30 beautifully-designed HD video modules, guides on customer contracts, drafting proposals, business planning, and more, and interviews with already-successful freelancers working in design, web development, and consulting.  </p>  <p>  \t<strong>Build Your Winning Strategy</strong>  </p>  <p>  \t      During the course, you'll develop a customized strategy that will power the growth of your business. As you learn topics like customer intelligence, product design, sales in the web 2.0 world, and strategic service design, you'll apply your knowledge and power your business strategy. This course is not a “get rich quick\" scheme--it is for people who have real ambition to make money doing what they love on their own terms.  </p>  <p>  \t<strong>Lifetime Access to a Supportive Community and Updated Content</strong>  </p>  <p>  \t      After enrolling in this course, you'll have lifetime access to:  </p>  <ul>  \t<li>The Eazl community on Udemy &amp; Facebook, a community of <strong>30,000+ ambitious people worldwide</strong>. You will also have access to free professional development events.</li>  \t<li>Regularly updated content: As the platforms used in this course (Podio, Google Alerts, etc.) evolve, this content evolves with it. </li>  </ul><p><em><strong>Version Update Journal</strong></em></p><p><em>What's new in version 2.1?</em></p><ul><li>You now have access to the Eazl Marketing Mastermind Group! In March 2015, Eazl built a flagship Growth Hacking course in partnership with Udemy. Now, participants in the freelancing course have access to the Marketing Mastermind Group that's shared with the Growth Hacking Masterclass. Use the Marketing Mastermind Group to refine your marketing strategies, get feedback on branding questions, and collaborate with smart marketers!</li></ul><p><em>What's new in version 2.2?</em></p><ul><li>We've added two lectures linking to EazlVlogs that address issues surrounding social proof and personal branding on social media platforms! Enjoy!</li></ul>", 
    "end_date": null, 
    "title": "Freelancing: Launching Your Career as a Freelancer from Eazl", 
    "price": "25.00", 
    "instructors": "Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425094_22b4_3.jpg", 
    "course_url": "https://www.udemy.com/bodega-bay/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T17:23:40Z"
}