{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Are You Ready to Make Money With Your Words and Replace or Supplement Your Current Income?</em></strong></p><p><strong><em>Tired of Commuting and Sitting in Traffic When You Could Be Writing Online and Making Money for Yourself?</em></strong></p><p>\"Make Money With Your Words\" is a course that teaches you the ins and outs of writing content online and making an immediate income from your efforts. And here's the best part...</p><p><strong>You DON'T have to have professional experience or a degree in writing to create an awesome new career for yourself!</strong></p><p>Did you know that there are all kinds of writing opportunities online that you can start applying for today and making money almost immediately? The types of content needed range from short blog posts to full blown ebooks, and employers are looking for people just like you right now.</p><p>I've built a massive freelance writing business online from scratch, and this course teaches you about the different opportunities including certain sites that will pay you top dollar for your content.</p><p>The course is broken up into sections to make it easy to get started and build your business over time. First, you'll learn about websites that will pay you for your writing quickly. Then, you'll learn about creating your own service packages and how to market them to potential clients. You'll learn about a certain kind of writing that you can do once and get paid over and over again for years to come. You'll learn how to expand your business so that you aren't working yourself ragged but are still making great money.</p><p><strong>You can complete this course in a day or so and start offering your services as a writer as early as tomorrow!</strong></p><p>Click on the TAKE THIS COURSE button so we can get started building your writing empire!</p>", 
    "end_date": null, 
    "title": "Freelancing for Writers: Use Your Words to Start A Business", 
    "price": "30.00", 
    "instructors": "Charity  Cason", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679706_ef3b.jpg", 
    "course_url": "https://www.udemy.com/make-money-with-your-words-writing-for-big-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T18:13:33Z"
}