{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    This course will show you how to start your freelance life by the websites for the online job you can find on the web. I will show you the ways to start using tools like Upwork, Twago, Peopleperhour and many others.  </p>  <p>  \t    I will show you the skills most requested from customers, the most profitable job categories where to improve your skills to earn more. You will learn how to choose the best customers to work with, the site or micro jobs and how to improve your self branding working  on this kind of sites. English is the language most used for the online working, but is not the only.  </p>  <p>  \t    This course is available in French and Italian too, and I will show you the sites where to work in other languages, like German, French and Italian.  </p>  <p>  \t    You will learn:  </p>  <p>  \t      - how to improve your self branding  </p>  <p>  \t     - how to choose the best clients  </p>  <p>  \t     - the sites where to work on line  </p>  <p>  \t      - the languages most used  </p>  <p>  \t     - how to work if english is not your mother tongue  </p>  <p>  \t     - the most requested skills  - the most profitable skills and job categories  </p>  <p>  \t     - how to work with gigs, hourlies and micro task  </p>  <p>  \t     - how much you can earn from online work  </p>", 
    "end_date": null, 
    "title": "Freelance life: start and manage your business from anywhere", 
    "price": "20.00", 
    "instructors": "Valentina Porcu", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309522_49ea_6.jpg", 
    "course_url": "https://www.udemy.com/freelance-life-start-and-manage-your-business-from-anywhere/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-28T16:48:15Z"
}