{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<strong style=\"\">Twice Money Back Guarantee - </strong>This Works! Check out the Proof of Earnings Lesson for Free Below.  <p style=\"\">  \t              ------------------------------------------------------------------------------------------------  </p>  <p style=\"\">  \t<strong style=\"\">Make $2000-3000 a Month, in Your Underwear, With Your Own Freelance Business - ZERO Prior Skills Required!</strong>  </p>  <p style=\"\">  \t                    Tired of slaving away in a job you hate?  </p>  <p style=\"\">  \t                    Wouldn't you rather work whenever you want, where ever you want, and still make more then you do at your dead end job?  </p>  <p style=\"\">  \t                    Better still, how about making a legitimate, idiot-proof, scalable business that generates autopilot, hands-off cash whilst you live the life of your dreams?  </p>  <p style=\"\">  \t                    Have I got your attention now?  </p>  <p style=\"\">  \t<strong style=\"\">I have excellent news for you, YOUR PAIN STOPS HERE!</strong>  </p>  <p style=\"\">  \t                    I walk you through exactly what I did to start a freelance business earning an easy $2000-3000 a month, and then how to take yourself out of the business, automating it so you can spend your time actually enjoying life, instead of slaving away for cash!  </p>  <p style=\"\">  \t                    This unique course won't teach you how to become an overnight millionaire, or even allow you to quit your job in a week. What it will show you are <em style=\"\">tangible, actionable steps to starting your own Sustainable, Scalable freelance business</em>, that I have personally validated through copious amounts of my own time and money, revealing all of the strategies I've learned in order to save you the countless hours lost, dollars lost, and failures made in order to succeed.  </p>  <p style=\"\">  \t<strong style=\"\">This step-by-step course covering everything you need to know to create any sort of freelance business,</strong> and then should you wish, to start hiring employees for that business so that you get paid more and more, for less and less work!  </p>  <p style=\"\">  \t<strong style=\"\">Nothing is left out – I tell you everything.</strong>  </p>  <p style=\"\">  \t                    I walk you through the exact steps I followed to success, dropping anything out that didn't lead there.  </p>  <p style=\"\">  \t                    I am personally here to provide support after purchase, have a question? I will answer it as soon as I can.  </p>  <p style=\"\">  \t                    I am so confident that this works, that if you try these methods and fail for a full 30 days and can show me that, I will personally coach you until you succeed, or if you prefer, I will give you 100% of your money back – on top of Udemys 30 day money-back guarantee! <strong style=\"\">That's right, if there is some crazy reason you can't succeed with this</strong>, <strong style=\"\">YOU WILL GET TWICE YOUR MONEY BACK</strong> – that's how confident I am that these methods work, <u style=\"\">there's absolutely nothing for you to lose</u>! This is my personal promise that you will succeed!  </p>  <p style=\"\">  \t                    If you follow the steps in this product, <strong style=\"\">I guarantee that within a month you will get your first freelance client</strong>, covering the cost of this course many times over.  </p>  <p style=\"\">  \t                    Following the simple, inside steps I cover in this course you can easily earn between $2000 - $3000 a month. Imagine this, <em style=\"\">in just 30 days you will be able to untether from your life</em>, hopping on the next plane to anywhere with an Internet connection, able to work a couple of hours a day and then DO WHAT EVER YOU WANT FOR THE REST OF THE DAY! Trust me, it's great fun!!  </p>  <p style=\"\">  \t                    I know, I know, you're wondering if this is even possible?  </p>  <p style=\"\">  \t                    I will show you EXACTLY how to achieve all of this:  </p>  <ol style=\"\">  \t<ol style=\"\">  \t\t<p style=\"\">  \t\t\t                    -  My story, exactly how I failed and most importantly, how I overcame each of those failures on my way to creating a successful freelance company.  \t\t</p>  \t\t<p style=\"\">  \t\t\t<strong style=\"\">- Get paid to be a freelancer, with ZERO prior experience and ZERO prior skills.  </strong>  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    -  The secret to letting your customers triple what you charge them!  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    - Find a skill that is in demand, that anyone can do, and then still have people pay you a fist full to do it for them!  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    - Can't find a skill you like? I show you exactly how I make products, with an accompanying 55 page eBook I've written, <strong style=\"\">showing ANYONE how they can make money writing.</strong> Honestly, anyone can do this!  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    - Find the perfect marketplace to sell your freelancing service, allowing you the quickest route to skyrocket your profits.  \t\t</p>  \t</ol>  </ol>  <ol style=\"\">  \t<ol style=\"\">  \t\t<p style=\"\">  \t\t\t                    - How to effectively analyze your competition, and then how to adapt your service to blast past their success.  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    - Get Gurus backing you – allowing you to <strong style=\"\">charge through the roof rates.  </strong>  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    - How to write a killer sales page, with three full examples and 45 pages of content, showing how emotions, benefits, motivators and more. can be intertwined to compel people to buy from you!  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    - I Provide Professional Photoshop graphics that can improve your sales 50%!  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    - Produce professional quality videos with ZERO money invested, no fancy cameras or sound equipment needed!  \t\t</p>  \t\t<p style=\"\">  \t\t\t                    - SUCCESSFULLY employ freelancers to take your job, and managers to look after those freelancers, and then get paid on autopilot as they do the work!  \t\t</p>  \t</ol>  </ol>  <ol style=\"\">  \t<ol style=\"\">  \t\t<p style=\"\">  \t\t\t                    - Finally, I cover a method to <strong style=\"\">get all of these results, by learning ZERO skills, and working next to no time</strong>, (it's something you can get started with right now!).  \t\t</p>  \t</ol>  </ol>  <p style=\"\">  \t                    This list will continue to grow. As common questions come up, I will make custom videos to resolve them, which you will receive for 100% free, forever.  Access to this course it only going to increase in value over time, so get in whilst it's cheap.  </p>  <p style=\"\">  \t<strong style=\"\">I can't wait to hear about your Freelance Success!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"> - See You on the Inside,</strong>  </p>  <p style=\"\">  \t<strong style=\"\">      Connor</strong>  </p>  <p style=\"\">  \t<strong style=\"\">PS: </strong>Again, there is ZERO risk to you. I stand by my first class refund policy. If you can't make this work in 30 days and get your first client, I will personally help you to succeed. If for some crazy reason you still can't, you will get TWICE YOUR MONEY BACK!! You have everything to gain by taking me up on this amazing offer!  </p>", 
    "end_date": null, 
    "title": "Freelance Business: How to Be Fulfilled and Successful", 
    "price": "20.00", 
    "instructors": "Connor McCreesh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365152_2f3c_4.jpg", 
    "course_url": "https://www.udemy.com/freelance-business-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-07T11:43:34Z"
}