{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">JOIN OVER 700+ SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE!</strong></p><p><strong style=\"\">----------</strong></p><em style=\"\">\"This course has a little bit of something for everyone - from newbies to saavy IMers.. <strong style=\"\">I started applying some of the methods taught in the course before even finishing it and had</strong> <strong style=\"\">4 gig orders within 2 days on fiverr!</strong> Now after completing the course in full, I have a list of notes from all different sources provided that will help me not only create a great passive income, but an <strong style=\"\">entire online business</strong> that I hadn't thought of before. THANK YOU Jake for your very easy to follow course!\"</em> - <em style=\"\">Natalie Disque</em><em style=\"\">\"<strong style=\"\">GET THIS TRAINING</strong>.. Jake brings an insane amount of VALUE in this training. I'm gonna make this short, spend your money on learning these strategies, <strong style=\"\">beyond worth it</strong>. This guy knows his stuff. Thanks for putting this out in the market place man!!\" - Tara Gansrich<p>-----</p></em><p><em style=\"\">\"Outstanding! <strong style=\"\">The only Fiverr Income Course You'll ever need</strong>. This course is by far the best ever course I've seen related to making an income from fiverr. Jake is at a masters degree level with fiverr and how you can use different ways to make a decent income from the methods he is showing. I especially like the outsourcing section where we can <strong style=\"\">make free money and the secret method to cross-sell</strong> as well. I am a seller at fiverr, and I've already implemented some of the methods I've learned from this course and <strong style=\"\">I am already getting the results that I expected</strong>. Seriously. I am now a <strong style=\"\">level 2 seller</strong>! If you are looking for a fiverr income and don't know what to do or how to start and most importantly make money then this is in my opinion is the <strong style=\"\">best video course you'll ever need</strong>.\" - Erol Ozvatan</em><em style=\"\"></em></p><p><strong style=\"\">----------</strong></p><p>  \t<em style=\"\"><strong style=\"\">LATEST:</strong> Course Updated for 2015</em>  </p>  <p>  \t          Start making money, with no experience whatsoever, immediately - just like my current 700+ students!  </p>  <p>  \t<em style=\"\">Please - if you're looking for \"instant easy get rich quick\" money, don't take this course. You'll need to study the course and do as it shows for success, following the very simple video modules. </em><em style=\"\">You just need a computer and an internet connection, and you can start to earn money as soon as you complete the course.</em>  </p>  <p>  \t<strong style=\"\">    No website is needed!  </strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">NEW!</strong> Now includes POWERFUL BONUS modules revealing little-known strategies to increase your income by selling Fiverr gigs on other websites for instant profits!</em>  </p><p><em style=\"\">--------------------</em></p><p><em style=\"\">My current Udemy courses have members from <span><strong style=\"\">1</strong></span><span><strong style=\"\">19 different countries</strong></span> around the world!</em></p><p><em style=\"\"></em>+++++++++++++++++++++++</p>  <p>  \t          About this course:  </p>  <ul style=\"\">  \t<li><em style=\"\"><strong style=\"\">Over 700+</strong> very happy students</em></li>  \t<li><em style=\"\"><strong style=\"\">No</strong> website, blog, email marketing, articles or anything else is required</em></li>  \t<li><em style=\"\"><strong style=\"\">Dozens of 5 Star Reviews</strong> from VERY satisfied students</em></li>  \t<li><em style=\"\">Full, <strong style=\"\">unlimited lifetime</strong> access</em></li>  \t<li><em style=\"\">All future extra lectures and upgrades are always <strong style=\"\">included for free</strong></em></li>  \t<li><em style=\"\">Unconditional <strong style=\"\">Udemy 30 day money-back guarantee</strong> - that's my personal promise of your success!</em></li>  \t<li><em style=\"\">On-screen, over the shoulder view of where to go, what to click, and how I set everything up from <strong style=\"\">start to finish</strong></em></li>  </ul>  <p>  \t          SEE HOW I GET:  </p>  <ul style=\"\">  \t<li>My gigs ranked quickly, over all the other sellers in my category</li>  \t<li>Other people to fulfill my orders and do all the work for me </li>  \t<li>People to buy other sellers' Fiverr gigs from me on other websites to make easy money again and again without doing any of the work</li>  </ul>  <p>  \t          .... all very easily, month after month, after month!  </p>  <p>  \t          Today, you can start to make good money, easily, as a seller on the Fiverr platform, with no technical skills - and with <strong style=\"\">ZERO prior experience</strong>!  </p>  <p>  \t<em style=\"\">This complete course has been taken by <strong style=\"\">over 700+ students</strong> already - see the amazing reviews below!</em>  </p>  <p>  \t          You will need no websites, authority blogs, sales funnels, email series, paid advertising, or bulky and confusing softwares.  </p>  <p>  \t          Follow along by looking right over my shoulder, on my screen, and see exactly how I set this up quickly and effectively, from <strong style=\"\">start to finish</strong>.  </p>  <p>  \t          <strong style=\"\">The best part</strong> - you can build an empire of Fiverr gigs that can be sold and delivered to your customers <strong style=\"\">without actually creating any of the content yourself</strong>..  </p>  <p>  \t          You'll learn  </p>  <ol style=\"\">  \t<li>Why Fiverr is such a lucrative selling platform for anyone</li>  \t<li>The quick and easy way to build social proof and increase sales</li>  \t<li>How to start ranking your gigs above your competitors</li>  \t<li>How to quickly setup your account and optimize it to make the best impression</li>  \t<li>How to quickly set up gigs again and again</li>  \t<li>The 3 Golden Rules of selling on the Fiverr platform</li>  \t<li>How to sell and deliver gigs that require absolutely no work on your park</li>  \t<li>How to sell and deliver gigs that are \"done for you\"</li>  \t<li>How to increase your profit per sale up to 10x with one secret method</li>  \t<li>How to sell others' Fiverr gigs to customers on other websites for easy profits</li>  </ol>  <p>  \t          ... and much, much more!  </p>  <p>  \t          So, you've read this far! <strong style=\"\">Thank you</strong>.  </p>  <p>  \t          The third, fourth and sixth video in this course <strong style=\"\">can be seen by everyone below</strong> and reveal what numbers you will need to produce to reach your income goal and a simple tip to increase your conversions and make more sales.  </p>  <p>  \t<em style=\"\">One final, very important point</em>.  </p>  <p>  \t          You may be struggling to earn an income on the internet right now, and I'm going to explain why this is happening inside this course. As you will learn, <strong style=\"\">it's not your fault</strong>.  </p>  <p>  \t          You can launch your Fiverr business and start generating sales as soon as you complete the training!  </p>  <p>  \t          Click the <strong style=\"\">'take this course'</strong> button, top right, now ... <em style=\"\">every hour you delay is costing you money </em>...  </p>  <p>-Jake</p>", 
    "end_date": null, 
    "title": "Freelancing Success Tips: Build Your Business on Fiverr", 
    "price": "50.00", 
    "instructors": "Top-Rated Instructor: Jake Statler", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238964_fa00_4.jpg", 
    "course_url": "https://www.udemy.com/easyfiverrblueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-07T15:32:59Z"
}