{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever felt stuck and out of ideas? do you own a blog? do you need new ideas for your Social Media posts? and you need to get ideas that are tested and already working and on fire? then this course is for you!</p><p>using the SpyFy app you will be able to generate unlimited profitable ideas in minutes! and the best part? you get to use the software for free as long as you are a student in this course! </p><p>you will be able to get ideas for:</p><p>- google trends</p><p>- Twitter trends and how to monetize them</p><p>- Brainstorm ideas from Pinterest and Instagram</p><p>- Facebook ads (and know what types of ads is your competetion creating right now! and what is converting best!)</p><p>- Facebook page search (know what your competetion is posting and what is working for them so you study your competetion and study your target market)</p><p>-Social Media posts</p><p>- Blog posts</p><p>- Amazon products</p><p>-shopify products</p><p>-Teespring t-shirts</p><p>- Zazzle,Cafepress and Skreened eCommerce products</p><p>- Quotes to post to social media </p><p>- YouTube rank checking and keyword generation for your YouTube videos</p><p>- SEO tips and keyword suggestion and a backlink checker too!</p><p>so what are you waiting for? get your hands on that idea gold mine now and click the take this course button! </p><p>I'll see you on the other side ;)</p>", 
    "end_date": null, 
    "title": "Generate profitable ideas for any online business in minutes", 
    "price": "20.00", 
    "instructors": "Kenz A.Soliman, Manar Helmy Mohamed", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/838004_813f_4.jpg", 
    "course_url": "https://www.udemy.com/generate-profitable-ideas-for-any-online-business-in-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-02T23:31:49Z"
}