{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          The surest way to achieve anything, is to follow the proven success of someone who has already done it. Right? And if it is your current life that needs sorting, here is your solution. This course delivers a proven and simple step-by-step plan to get you moving forward.  </p>  <p>  \t          We have all been stuck in life at some time, maybe it’s a job you hate or a partner that does not see life as you do, or some other situation that just sucks. What every your situation this information there is a way to improve it. This course will show you:  </p>  <ul>  \t<li>How to reduce stress and have more fun in your life.</li>  \t<li>Clearly identify which areas of your life you need to get in balance.</li>  \t<li>Help develop an action plan to overcome obstacles holding you back.</li>  \t<li>Identify options available to improve your current situation.</li>  \t<li>Find low-cost, and work from home opportunities that give fast returns.</li>  \t<li>Take action to overcome fear, procrastination and build confidence.</li>  </ul>  <p>  \t          This is a straight to the point course with real-life information. Each lecture is short, and the exercises are easy, yet grouped together becomes a powerful step-by-step plan to improve your lifestyle.  </p>  <p>  \t    This will give you the insight into how to get your life in balance and then show you how to find and match money opportunities that will set you up for life. All this in less than one hour of learning.  </p>  <p>  \t          If you want to get your life sorted and back on track with clarity, have direction with less money worries then here is your solution.  </p>", 
    "end_date": null, 
    "title": "Get Your Life Sorted and Start a Work-from-Home Business", 
    "price": "25.00", 
    "instructors": "David Bunney", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294376_5ffb_3.jpg", 
    "course_url": "https://www.udemy.com/getyourlifesorted/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T04:55:09Z"
}