{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   This is a course about joining Amazon&#039;s Fulfillment By Amazon (FBA) program and learning how to sell on Amazon.  The FBA program is great for those who are interested in selling on Amazon but don&#039;t want to worry about packaging and shipping to their buyers.  You send your products to the Amazon warehouse and they will take care of the rest.  </p>  <p>  \t    There are a lot of expensive courses out there that charge hundreds of dollars to teach you how to sell on Amazon.  My goal is to create a course that is more affordable for those who are interested in selling on Amazon without making such a huge investment. Whether you would like to make a little extra money from things in your home you don&#039;t need any more or would like to make supplemental income on the side, this course will get you up and running in one (1) day.  </p>  <p>  \t  There is no fluff or up selling involved - in fact I move quickly through my tutorials.  I know I hate when I&#039;m watching a tutorial and it takes 2-3 minutes to get through an obnoxiously wasteful intro to get to the reason why I&#039;m watching a video. I hope you will appreciate that too!  </p>  <p>  \t  This course is divided into two sections.  The first section I will walk you through setting up your account, adjusting your settings and talking about how important aspects of the program.  The second section I will walk you through adding products to your inventory, preparing your shipments for Amazon, pricing strategies, and where you can find products to sell.  </p>  <p>  \t  All students will be able to contact me with questions and feedback so I can make sure your getting the most out of this course.  </p>", 
    "end_date": null, 
    "title": "Getting Started With Amazon FBA", 
    "price": "20.00", 
    "instructors": "Nick Marks", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206810_a935_3.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-amazon-fba/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-28T21:09:50Z"
}