{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>*** Proof Of Earnings Inside ***</strong></p><p><strong><em>*** 60+ minutes of content offered as a bonus for limited time ***</em></strong><br></p><p>Discover How I Made $38,248 On Fiverr - 25 Gig Ideas To Sell course description<br></p><p>“<em><strong>Discover How I Made $38,248 On Fiverr - 25 Gig Ideas To Sell</strong></em>\"\n teaches you everything you need to know about creating your own business on Fiverr . No skills required and you get 25 gig ideas that you can develop to thousands of dollars business.<br><br>You\n will learn the professional tactics and gig ideas that I use every day\n in my successful Fiverr business. So you too will be able \nto build a successful business on Fiverr with no big efforts.<br><br>By\n using the 25 gig ideas you will learn in this course \nyou will have the ability to earn money and life your dream life soon!<br></p><p><br>These strategies and gigs can be \nimplemented in the next couple of hours and your first commissions will \ncome very soon. It's a great feeling signing into your Fiverr account\n in the morning and seeing those sales rolling in every day.<br><br><strong><em>Let's\n face it: Money keeps our motivation levels up and gives us the desire \nto progress every single day, learning more and earning more.</em></strong><br><br>Your\n online income is very important because it dictates you what you can \nand can't do with your life and can help you reach the day when you can \nsack your boss!</p><p>You are going to get all the 25 gig ideas detailed and everything you need to know about how to do a professional research including increasing your sales ! So basically you get everything from scratch just to begin or continue your Fiverr business to the next level.<br><br><strong><em>By\n the end of this course you will have all the knowledge and skills \nnecessary to build and grow a successful online business on Fiverr.</em></strong><br><br>I really appreciate feedback from my students me and <strong>always</strong> respond to questions.</p><p><strong><em>Click the blue button that says “Take This Course\" now and I'll see you on the other side.</em></strong></p><p><em><strong><strong><em></em></strong></strong></em><em><strong>Discover How I Made $38,248 On Fiverr - 25 Gig Ideas To Sell</strong></em> by Scrembo<br></p>", 
    "end_date": null, 
    "title": "Gig Ideas to Help You Succeed as a Freelancer on Fiverr", 
    "price": "20.00", 
    "instructors": "Scrembo Scrembo", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632394_4f4f_5.jpg", 
    "course_url": "https://www.udemy.com/draft/632394/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T13:54:49Z"
}