{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>I designed this course to help solopreneurs and small business owners to set effective goals and consistently achieve them.</p><p>The course is structured in three stages.</p><p><strong>How to set effective goals</strong></p><p>We'll start off with what makes and effective goal. This will help you set clear and measurable goals that you can easily work with.</p><p>Next we'll move onto actually setting your goals, from your ultimate goals, yearly goals, right through to your daily goals.</p><p>And we'll finish off with some clear methods to help you stay focused on your most important goals, the one's that will really move your business forward each and every business day and ensure you consistently achieve your goals.</p><p>This course is ideal for anyone who feels stuck in their business, procrastinates or feels overwhelmed. The course will ensure that you know exactly what needs doing each day to move you forward in your business, you'll have a strong and clear action plan in place so that you greatly avoid procrastination and each of your goals will be presented in a way that you will reduce, if not totally eliminate overwhelm.</p><p>At the end of this course, you will have clear goals and an action plan in place to consistently work on your goals and focus on those goals that are most important.</p><p>There is a full workbook to printout to help you set clear and effective business goals.  You can use this business goals workbook as you watch the video's and work on setting your goals. </p><p><br></p>", 
    "end_date": null, 
    "title": "Goal Setting for Business Success", 
    "price": "30.00", 
    "instructors": "Wendy Tomlinson", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590948_036c_2.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-for-business-success/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-23T11:09:31Z"
}