{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Selling on eBay can be fun and profitable! I've been selling on eBay for well over a decade now, and it has been life changing for me and my family. The great thing is that you can go to your local thrift store right now and spend $5-$10 and start your business.</strong></p><p><strong>NOTE: This is a FULL course! This will take you from beginner to advanced and beyond. You don't need to buy another eBay course after this one. Get all the info you need, plus a private Facebook group for my students ONLY so we can continue the conversation/help far beyond this video course!</strong><br></p>  <p>  \t<em>Hundreds of students have already taken this course and are running their own eBay businesses!</em>  </p>  <p>  \t                   Have you ever wanted to sell products on eBay and actually make a good income doing it? Too scared to try because you don't know what to sell or how to avoid LOSING money? Then this course is for you!  </p>  <p>  \t<strong>      In the 40+ videos inside of this course, you will learn:  </strong>  </p>  <ul>  \t<li>How to set up your eBay account and payment methods</li>  \t<li>How to actually list a product on eBay</li>  \t<li>How to research which products sell the best so you can find those hidden niches no one else knows about</li>  \t<li>Which products I've personally sold during my 10+ years in the eBay business and how you can cash in immediately after watching the videos!</li>  \t<li>How to use eBay to find products and then resell them right on eBay</li>  \t<li>Finding products at thrift stores and garage sales</li>  \t<li>Behind the scenes live videos of my own recent finds</li>  \t<li>And much more!</li>  </ul>  <p>  \t<strong>Have you been SCARED to start your own eBay business? Have other courses OVERWHELMED you with information and kept you from taking action?</strong>  </p>  <p>  \t           I've been selling online for well over 10 years, and trust me - some of the eBay courses I've seen are too complicated for a beginner and too time-consuming for an advanced eBayer! You don't need all the fluff and filler, right? You need the right information at the right time and nothing else so that you're brain isn't full of useless junk that won't make you money.  </p>  <p>  \t           I'm one of those kinds of instructors who cuts to the chase and tells you EXACTLY what to do. No filler, no fluff!  </p>  <p>  \t<strong>FAQs:</strong>  </p>  <p>  \t<strong>Can I really make money selling on eBay?</strong>  </p>  <p>  \t    Absolutely! I've consistently made a great income on eBay for over 10 years now. It's about understanding and doing the right research and then taking action!  </p>  <p>  \t<strong>Is this course about dropshipping?</strong>  </p>  <p>  \t      This is NOT about dropshipping. I do not dropship in my business (although I tried it a long time ago and didn't enjoy it), so I do not teach on that subject.  </p>  <p>  \t<strong>Will you show me how to set up my LLC or corporation, handle my taxes, etc?</strong>  </p>  <p>  \t    This course does not cover taxes, setting up a business, etc as you should be talking to a professional tax or financial planner for those things. Be careful who you take advice from.  </p>  <p>  \t                   If you've ever wanted to sell on eBay, but just didn't know how to make it a business, this course will get you pumped up and ready to make money online!  </p>  <p>  \t<strong>Ready to join us? Click the TAKE THIS COURSE button in the upper right hand corner now and get ready to make some eBay cash!</strong>  </p>", 
    "end_date": null, 
    "title": "Guide to Selling Products on Your Own eBay Shop", 
    "price": "40.00", 
    "instructors": "Charity  Cason", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337026_e450_5.jpg", 
    "course_url": "https://www.udemy.com/guide-to-selling-products-on-your-own-ebay-shop/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T23:05:31Z"
}