{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">  STUDENT REVIEW:  </strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">Been using ebay for years and learned some new things.</strong></em>  </p>  <p>  \t<em style=\"\">\"This  lecture definitely gives a very good all around approach on how to flip  items. There are areas of internet selling I would have never thought  of.\"</em>  </p>  <p>  \t-------------------------------------------------------------------------  </p>  <p>  \t<strong style=\"\"><em style=\"\">Excellent Ideas</em></strong>  </p>  <p>  \t<em style=\"\">\"I've been selling part-time on ebay since 2010 and I learned so much from this course that I am encouraged to set much higher goals and sell full-time.\"</em>  </p>  <p>  \t  -------------------------------------------------------------------------------------------------------------------  </p>  <p>  \t  How would you like to walk into a flea market, confident in knowing that you will walk out that day with $500 or $1000 worth of merchandise that you only invested $20 - $50 for?  </p>  <p>  \t   How would you like to turn tiny investments in merchandise into giant paydays on eBay?  </p>  <p>  \t   Imagine being able to walk into a flea market on a daily basis and do this?  </p>  <p>  \t   When you complete this course, you will be a master at knowing exactly what to buy at flea markets that you can resell for high profits on eBay.  </p>  <p>  \t      You will learn, from real world examples, which categories and niches do best on eBay and you will also learn about the hottest markets on eBay that will bring you an excellent return on your investments.  </p>  <p>  \t      Created by the Nation's leading authority on eBay, this 80 minute course will walk you through many of Dave's actual deals so you can get up to speed quickly and make your next trip to the flea market a very profitable one.  </p>  <p>  \t   Dave grew up selling at flea markets in Southern California and he has consistently turned small $20 - $40 investments into $300, $500 and even $1,000 profits on eBay and Amazon, just by doing what he teaches you in this course!  </p>  <p>  \t      This course consists of 8 videos and a PDF containing tons of examples from Dave's actual transactions in the real world.  </p>", 
    "end_date": null, 
    "title": "Home Business: Flip Flea Market Finds on Amazon FBA & eBay", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/89300_5082_8.jpg", 
    "course_url": "https://www.udemy.com/home-business-flip-flea-market-finds-on-amazon-fba-and-ebay/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-07T05:43:51Z"
}