{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do you want to start a home-based business?</strong></p>  <p>  \t              Maybe you are tired of your job, even though you make a lot of money. Or you might want to create an additional source of income. It does not matter what your reason may be. The truth is starting a home-based business is not as hard as you might think.  </p>  <p>  \t<strong>.</strong>  </p>  <p>  \t<strong>Why start a home-based business now?</strong>  </p>  <p>  \t              Right now has never been a better time to open up your own online business. You may be skeptical but it really is true. More advanced technology has led to significantly lower costs throughout the entire supply chain.  </p>  <p>  \t              .  </p>  <p>  \t              Now you can order high quality and inexpensive products directly from Alibaba (in China) and sell them on Ebay. This was an entrepreneur's dream only 5 years ago.  </p>  <p>  \t              .  </p>  <p>  \t<strong>Clear and straightforward</strong>  </p>  <p>  \t              If you have been searching for how to start a home-based business you have probably been overwhelmed with information. If you have begun to take some courses you probably became lost and realized people were giving you conflicting instructions.  </p>  <p>  \t              .  </p>  <p>  \t              This course was created to be clear and straightforward. I purposefully left out a lot of information because it is pointless to teach you stuff that won't help you reach your goals. Giving you too much information is actually harmful because it makes it less likely for you to have the confidence to take action.  </p>  <p>  \t              .  </p>  <p>  \t<strong>What you will learn in this course</strong>  </p>  <ul>  \t<li>What wholesaling is</li>  \t<li>How to find profitable products to sell</li>  \t<li>What dropshipping is and why you should avoid it</li>  \t<li>And other relevant topics...</li>  </ul>  <p>  \t              .  </p>  <p>  \t<strong>What you will not learn in this course</strong>  </p>  <ul>  \t<li>How to find suppliers that have gone out-of-business</li>  \t<li>Outdated selling techniques that won't apply to you in 2015</li>  \t<li>Pointless anecdotes that don't help you create an Ebay business</li>  </ul>  <p>  \t              .  </p>  <p>  \t<strong>It is easy for you to get started</strong>  </p>  <p>  \t              You will be surprised at how easy it is to import products and sell them on Ebay. If you are new to this subject don't worry; this course is designed for beginners.  </p>  <p>  \t      .  </p>  <p>  \t      Simply click on the blue 'Start Learning Now' button in the top right hand corner to instantly start learning how you can make money on Ebay.  </p>", 
    "end_date": null, 
    "title": "Home-Based Business Tips: Getting Started Selling on eBay", 
    "price": 0, 
    "instructors": "Eric John Campbell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164850_a853_15.jpg", 
    "course_url": "https://www.udemy.com/ebay-profits/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-15T18:57:54Z"
}