{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">LEARN FROM SOMEONE WHO IS ACTIVELY RUNNING A SUCCESSFUL WEB DESIGN BUSINESS! I will teach you everything that has made my business successful and created a 6-figure income for me.</strong></p>\n\n<p>Unlike other courses, this course focuses on how to acquire and keep new customers that will bring in <strong class=\"redactor-inline-converted\">thousands of dollars every single month in residual income</strong>. After all, your customers are what determine your success.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">You will learn the 3 keys to success that have worked for me:</strong></p>\n\n\n\n\n\n\n\n<ol><li>Relationships - How developing relationships with your clients will grow your business.</li><li>Referrals - How to actively pursue referrals which will result in explosive growth.</li><li>Residuals - How to earn a monthly residual income from all of your clients.</li></ol>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">About this course:</strong></p>\n\n\n\n\n\n\n\n<ul><li>Complete Step By Step Plan to Start Your Business Immediately</li><li>Full, free lifetime access</li><li>All future extra lectures and upgrades are always included for free</li><li>Unconditional Udemy 30 day money-back guarantee</li></ul>\n\n<p><strong>See How:</strong><br></p>\n\n<p>\n\n</p>\n\n\n\n\n\n\n\n<ul><li>I make over $100,000 a year simply building websites for other businesses</li><li>The steps I have taken to build my 6-figure business over the last few years </li><li>You can build a residual income that brings in thousands every month</li><li>With a residual income, you can take time off anytime you like and travel the world</li><li>To find the best software and online solutions to make your business run efficiently</li><li>To outsource work when you get overloaded</li><li>You can be your own boss and work from home or anywhere you choose</li></ul><p>\n\n</p>\n\n<p>If you are reading this, then you are already interested in building your own web design business. <strong class=\"redactor-inline-converted\">Now is the time to take action.</strong> Check out my video preview to get an idea of what to expect from this course. Then simply click \"<strong class=\"redactor-inline-converted\">Take this course</strong>\" button at the top right of the screen. </p>", 
    "end_date": null, 
    "title": "Home Business - Build a successful web design business.", 
    "price": "20.00", 
    "instructors": "Jason Lucas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801416_3359.jpg", 
    "course_url": "https://www.udemy.com/build-a-successful-web-design-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T23:14:30Z"
}