{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Do you have </strong>Tablets, Laptops, Desktops, Camera&#039;s Accessories, Mobiles, Headphones, Mini Camcorders , Bags &amp; Cases, Computer components, Memory Cards, Watches, Fashion Jewelry, Car Electronics, Car Accessories, Tools Maintenance <strong style=\"\">or whatever that you want to sell online but don&#039;t know how to build online store ? so this course is for you.</strong>  </p>  <p style=\"\">  \t                                              This course is for people that are serious about starting an online store &amp; start online  business .If you want to start online business and don’t know where to start so this course for you. No matter if you don’t know how to write the world most difficult web development languages e.g PHP , Java  , etc .  </p>  <p style=\"\">  \t                                              With this course a anyone can also build professional online store  and can sell products online and earn thousand dollars monthly .  </p>  <p style=\"\">  \t<strong style=\"\">What i will learn in this course ?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">You will learn building a complete online store step by step . 100% guaranteed</li>  \t<li style=\"\">You will learn that from where to order product online in wholesale price .In this course i will walk you through world trusted online vendors .</li>  \t<li style=\"\">You will learn step by step developing a complete website and also will learn how to deal with order once a customers order the product.</li>  \t<li style=\"\">You will learn to give awesome design to your website that will attract visitors</li>  </ul>", 
    "end_date": null, 
    "title": "Home Business : Build Online Store & Sell Products Online", 
    "price": "25.00", 
    "instructors": "David Gabriele", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/159926_470c_14.jpg", 
    "course_url": "https://www.udemy.com/home-business-online-store/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-07T17:48:22Z"
}