{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>**Note** This course has not been updated in a while and some of the information is outdated, but still relevant. New modules are currently being developed and this course will be updated in early January 2016.</p><p>  \t                              This course is a click-by-click, step-by-step setup of a website and back office to help entrepreneurs and anyone else looking to save money on costs when running a business or selling a product.  </p>  <p>  \t<strong>**Get your lifetime access at this super-low price now!</strong> The cost will increase Feb 2015 as new content is being added!<strong>**</strong>  </p>  <p>  \t<strong>Review from Chakib CM</strong><strong>: </strong>  </p>  <em>Great course for people with low budget !</em>  <em>\"Great course that show how to set-up a complete business  online without spending a dime with a great free resources, thank you  very much\"</em>  <p>  \t<strong>             Review from Vincent Harris:</strong><br>  </p>  <p>  \t<em>Outstanding!!!         </em>  </p>  <p>  \t<em>\"I feel like I was taken by the hand into building a  website!  Concise, informative, and practical.  The techniques on how to  save money are priceless!\"</em>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t            No matter what your business is, whether it's a service-based business or you have a hundred products to sell, you'll be able to benefit from the lessons in this course and tweak it to work for you and your business. In it we'll learn:  </p>  <ul>  \t<li>  How to set up a website using Wix; a super simple, user-friendly platform (I'll tell you why I use this particular one in a later lecture)  </li>  \t<li>  How to set your website up with your own online store, completely free  </li>  \t<li>  How to set up payment buttons with options, a shopping cart, subscriptions, and you can even track inventory  </li>  \t<li>  How to get a business telephone number completely free, that rings up to 6 lines. You can schedule the times it rings to specific lines!  </li>  \t<li>  How to set up simple email marketing and newsletter  </li>  \t<li>  How to create forms/polls/questionnaires with results sent directly to a spreadsheet and how to bring it into your website. (you'd be surprised how useful this is!)  </li>  \t<li>  How to create a calendar/schedule with registration (perfect for events, meetings and even restaurant seating!)  </li>  \t<li>  How to create webinars/virtual conferencing and even broadcast a show LIVE! (This comes in handy for remote meetings/collaborations, video marketing and training sessions)  </li>  \t<li>  I'll show you how to link these resources together so keep your back office running smoothly at no cost  </li>  \t<li>  I'll also show you how to create a simple text logo for your business as an added bonus.  </li>  </ul>  <p>  \t                              Now, there will be a few other things we'll get into, but these are the major points we focus on in this course. I've personally seen this system and these resources work for all types of business in all types of markets: Gyms and personal trainers, event planners, beauty supply store, martial arts studio, food truck pre-ordering system, hair/nail stylists and even a major insurance marketing agency...this list continues to grow!  </p>  <p>  \t                              You'll watch a series of screencasts that will walk with you through every step from beginning to end. I'm sure you'll pick up some great ideas for your business along the way! You'll be able to watch, follow along and then do it yourself before moving on to the next section/lecture. Each phase is divided into small, manageable lectures so that if you need to refer back to something you can find it quickly and easily. This isn't a course that hands out general information in hopes that you go purchase a more comprehensive course that contains 'the real' information you need. I'm not telling you what you should do, I'm simply providing the information and resources you need to get it done. By the end of this course, you'll be able to completely set up and manage your back office and website without having to shell out your hard-earned money on services that can cost nothing but a little elbow grease. Go ahead and click the blue 'Take This Course' button on this page and let's get your back office built!  </p>", 
    "end_date": null, 
    "title": "Home-Based Business on a Budget: Build a Free Website & More", 
    "price": "20.00", 
    "instructors": "Sheila Bowen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188528_2105_3.jpg", 
    "course_url": "https://www.udemy.com/buildanocostpremiumwebsite/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-25T16:31:30Z"
}