{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Student Reviews:</strong><br></p><p><strong>\"This is a great introduction to the tools that online entrepreneurs should be using to manage their daily activities. Well presented, structured and to the point.\" - </strong>Ioannis Tsiokos<br></p><p>This course is for <strong>home and small business owners</strong> who are <strong>just getting started out</strong> or <strong>those who do not have an established software tools portfolio for managing various functions of their business</strong>. If you are small business owner with a software tools portfolio already working well for you, you do not need this course.<br></p><p>Setting up and running a successful small or home business is always challenging. While there are many different and unrelated aspects that make or mar business success, it all boils down to two key factors. One, how good the product and/or service being offered is. Two, how effectively this product and/or services fits into and meets a market demand or a customer need.</p><p>The core competence of every successful entrepreneur should be to build and improve her product and services. However, there are many other <strong>business functions</strong> that need to be addressed, managed and mastered to make the business successful.</p><p>Small and home business owners, like you, have very common challenges across the board. You have a <strong>limited budget</strong>, you have <strong>limited time</strong> and you have <strong>limited </strong><strong>resources</strong>. It's very easy for small and home owners to get sidetracked from their product/service core competence and spend inordinate amounts of time on miscellaneous front office and back office functions for the business.</p><p>It need not be so. There are a lot many <strong>software tools and platforms</strong> available for entrepreneurs today that make managing multiple business chores a breeze. In fact, there are so many software tools available, business owners who are just getting started out can get lost in the maze of choices available.</p><p>In this course, you will learn about <strong>effective software tools</strong> to help you <strong>effectively manage two key aspects of your business</strong>: Building and growing your business and managing your typical work day effectively. </p><p>By the end of the course, you will have a clear roadmap of <strong>the most effective software tools to use for key back office and front office functions of your business</strong>. You will be on the highway to managing the time that you spend on various aspects of your business more effectively, and of course, get started with earning more money!</p>", 
    "end_date": null, 
    "title": "Home Business Success: Save Time & Be Productive", 
    "price": "20.00", 
    "instructors": "Rupali Rajhans", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446408_34a0_2.jpg", 
    "course_url": "https://www.udemy.com/home-business-success-save-time-earn-more-be-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T09:28:35Z"
}