{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>  \t<strong>UPDATE: This course is completely updated and current through Augus 2015!</strong> </p><p> <strong>OVER 1,800 NEW STUDENTS HAVE JOINED THIS COURSE AND ARE STARTING THEIR BUSINESSES - JOIN THEM, DO NOT MISS OUT!</strong>  </p>  <p>  \t  You should join this active course - I am extremely responsive inside the course answering questions from students and helping build their own businesses. I look forward to working with you, as well.  \t  \t      --------------------------------------------------------------------------------------------------------  </p>  <p>  \t<strong>Would you like a REAL WAY to make money?</strong> </p><p>Can you follow easy directions that are included in this course and create your own online business that will pay you for years to come? </p><p>Do you want to start your own business that you can be proud of - starting today? </p><p> If you answered “Yes\" to either of the questions above then you are well on your way to your own financial freedom.  \t  \t<strong></strong></p><p><strong>There is a gold rush happening right now!  </strong>  \t  \t<strong>In fact, in the last few months I have personally made almost $9,000 just from selling courses on Udemy! </strong></p><p><strong></strong> This is an opportunity that you cannot afford to pass up!  Get your slice of this huge pie - and, make some serious money for yourself.  \t  \t<strong></strong></p><p><strong>If this is you – then you should definitely get this course: </strong></p><p><strong>•   Do you need more money?  •   Do you want to quit your current job?  \t         •   Do you need money to catch up on your bills?  \t         •   Do you have a family that is depending on you?  \t         •   Do you just need extra money?  \t         •   Do you want to buy a new care, go on vacation, or start saving for retirement?  \t         •   Are you worried about the economy and need a second income?  \t         •   Do you want to have a business that you can be proud of?  \t         •   All of the above?</strong> </p><p>This course will teach you everything that you need to know. It is jam-packed with the EXACT STEPS that you need to easily follow to create your own make money from home business.  \t  \t<strong></strong></p><p><strong>This course is your road map to success.</strong> </p><p> Oh, and as a student of this course – you will get my help as well. </p><p>I will be with you every step of the way. You will be able to ask me any question(s) that you may have in the member's area. </p><p>This course will reveal to you all of the insider secrets that I have learned to create my own business that you can apply directly to your business. </p><p>You will not have to fumble around trying to figure out how this business really works - I hand it to you on a silver platter! </p><p> It will show you exactly how to be successful and make money. You will learn how to create a four to five-figure monthly business.</p><p>Within a few months you could quite possibly quit your job if you like – with the knowledge that you are going to learn from this course. </p><p>You will have the freedom to make that choice!  \t  \t      This easy-to-follow course is going to expand and get bigger as well. </p><p>I will constantly be updating it. </p><p>Why – well, because I am not just teaching this business. I actually run a successful business creating and selling courses, as well. </p><p>I am always testing new ways to expand this business – and, I share all of my insider secrets with my students!  \t  \t      With my complete support of you every step of the way, you can easily become a real “make money from home\" success story. </p><p>You can be one of those people that you see that has it all – all you need to do is take this course and you will be on your way. </p><p> Also, I want to remind you that you have a 100% totally unconditional money-back guarantee with this course that completely protects you. </p><p>Take my course – study it, test it, implement it…and, if for whatever reason you are not happy then you can get a 100% “no-questions asked\" refund. </p><p>You will have 30 days to test drive my course and be covered by this 100% money-back guarantee. </p><p>So, you have absolutely no risk!  \t  \t      So, take the next step and get access - starting today.  \t  \t<strong></strong></p><p><strong>This is opportunity knocking on your door! So, do not get left behind. Join the other successful students that are already cashing in – join now!</strong> </p><p>To your success, </p><p>Austin Hilton  \t  \t<strong></strong></p><p><strong>PS - Don't just take my word on how great this course is...check out the reviews below on this page and see for yourself.</strong>  </p>", 
    "end_date": null, 
    "title": "Home Business Tips: Sell Udemy Courses Online - Unofficial", 
    "price": "20.00", 
    "instructors": "Austin Hilton", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431306_216d_3.jpg", 
    "course_url": "https://www.udemy.com/unofficial-home-business-tips-sell-udemy-courses-online/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T20:08:55Z"
}