{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4><strong>Over 1300 students have joined in and growing, and 37 ★★★★★ reviews!</strong></h4>\n\n<p>  \t                                         *****************************  </p>\n\n<p>  \t<strong>How is this course different from those “get rich quick schemes?”</strong> Well, this is NOT one of those. In fact, there’s no “scheme” here. This course instead teaches you HOW to find opportunities for yourself, instead of falling for the next “hot all-in-one business plan” from the “financial gurus.”  </p>\n\n<p>  \t                                             This course is a <em>realistic</em> method of earning extra money from home in your <strong>spare time <u>online</u></strong>. It will not make you a millionaire overnight, however it can definitely help pay that monthly mortgage or put aside money for your children’s future college education.  </p>\n\n<p>  \t                                             Here is a quick overview of what you get:  </p>\n\n<ul>  \t<p>  \t\t<em>                    - How to develop the right <strong><u>MENTAL STRATEGY</u></strong> to find opportunities – I will be asking you to think about a few examples  </em>  \t</p>  \t<p>  \t\t<em>                    - I will show you exact methods I use to this day that helped me pay off my university tuition of over $50,000 and raised another $200,000 in under 2 years (with daily dedication of course)  </em>  \t</p>  \t<p>  \t\t<em>                    - You will get the exact <strong><u>RESOURCES and KNOWLEDGE</u></strong> you need to start right NOW  </em>  \t</p>  \t<p>  \t\t<em>                    - You will learn how to take advantage of your life experience and convert into extra income (outside of work)</em>  \t</p>  </ul>\n\n<p>  \t<strong>Why do you need this course? </strong>Because, despite the belief of most people, making money online is not hard. You simply need the right mindset and need someone to provide you with “the fishing rod instead of a fish,” so to speak, and that is what this course does. Although this teaches you how to make money online; you can apply the exact same mindset to finding opportunities that don’t have to do with the internet as well.  </p>\n\n<p>  \t                                         *****************************  </p>\n\n<p>  \t                                             If you’re still skeptical, bear in mind that there is <strong>30-day money back guarantee</strong>; no questions asked.  </p>\n\n<p>  \t                                             I hope to see you join and take your first step to developing a new mindset. Good luck and have a wonderful day.  </p>", 
    "end_date": null, 
    "title": "Home Business Startup Guide to Online Opportunities", 
    "price": "20.00", 
    "instructors": "Vlad Kay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267026_c6c5_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-easily-make-money-online-with-no-risk-and-very-low-cost/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T03:21:28Z"
}