{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Course updated January 9th, 2015.</em></p><p><strong>Brokering: Make a Commission for Making the Connection</strong></p><p>This course will reveal to you the business of brokering international trade deals, without ever having to put any of your own money down. </p><p>You'll learn how to create a connection between your buyer and seller so you can step out of the way and allow them to negotiate a deal. </p><p>When a deal's been made, you will earn a commission fee--just for making the connection!</p><p><strong>Learn How to Take the Best Seat in The House &amp; Reap the Benefits While Sitting Comfortably During the Negotiation</strong></p><ul><li>Set up your own business from home</li><li>Start ahead of the pack with the right product to trade</li><li>Successfully locate the eager buyers</li><li>Discover the suppliers to work with on Alibaba</li><li>Hone your skills to help you unite your ideal buyers and sellers</li></ul><p><strong><br>Step Into the World of International Trade Using Alibaba</strong><br></p><p>In your brokering business, you'll never have to deal with logistics, packing, or shipping. You'll never have to handle the product. </p><p>You likely won't even meet the buyer or supplier in person; all you need is an Internet connection and an email account. </p><p>On Alibaba, the world's biggest online marketplace, there are tens of thousands of buyers posting buy requests daily, just waiting for someone who can supply them with a product. </p><p><strong>Contents and Overview</strong></p><p>This course will walk you through all the steps you need to get yourself set up and ready to earn your commission fees as a broker. </p><p>First, you'll learn all the tricks to starting a home brokerage business on Alibaba, from naming your business and registering the company to setting up your website. Then you'll learn how to choose the right product to trade. </p><p>Next comes how to find the buyers that want your product and the suppliers that have it. You'll use the proven-successful script that even the instructor uses to get buyers to commit. </p><p>Background checks is a valuable topic in which you will learn how to effectively research the import/export activities of the companies you want to do business with. </p><p>Avoid wasting time on projects that won't succeed by learning how to identify red flags.</p><p>The best part is letting your buyer and supplier do the messy work involved in negotiating.</p><p>You just need to set up the connection between the two. </p><p>You'll learn the 7-part process in making profitable connections. </p><p>Towards the end of the course, you'll learn how to get paid, including what to charge and how to collect. </p><p>By the time you complete the course, you'll be ready to set up your business, start making those connections, and collecting your commission fees. </p><p>Soon you will be taking the best seat in the house--the seat that allows you to reap the benefits while sitting comfortably during the negotiation. </p>", 
    "end_date": null, 
    "title": "How to Run a Successful Online Business Using Alibaba", 
    "price": "25.00", 
    "instructors": "Dr. Eric Kaufman", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556542_84a5_11.jpg", 
    "course_url": "https://www.udemy.com/how-to-run-a-successful-online-business-using-alibaba/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T18:15:04Z"
}