{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.</p>\n\n<p>  \t<em><strong>Over 1480 students have already enrolled!</strong></em>  </p>  <p>  \t<em><strong>Updated On: Feb 9, 2015</strong></em>  </p>  <p>  \t<em>I have published <strong>15 courses</strong> on Udemy to which <strong>more than 23,000 students</strong> have enrolled.</em>  </p>  <p>  \t              This is a course which includes baby step by baby step videos in which you will learn exactly how I have been able to enroll so many students.  </p>  <p>  \t            I will teach you every single secret that I know to maximize the potential of your Udemy course, so you will be able to constantly attract new students  </p>  <p>  \t              Every method that I teach in the course is super easy to implement, and if you implement my methods you will be able to enroll thousands of students to your Udemy courses.  </p>  <p>  \t              I will keep updating this course all the time, and once you join the course you will get lifetime updates for 100% free.  </p>  <p>  \t              There is simply zero risk with Udemy 30 day guarantee.  </p>  <p>  \t              This course is perfect for people who have created online courses, and want to know exactly how to get more students to enroll to their courses.  </p>  <p>  \t              Please notice:  </p>  <p>  \t              I am not going to cover basic things like creating videos uploading them to Udemy, etc...  </p>  <p>  \t              Now, because I am fully aware that one of the biggest problems that beginners encounter when they try to make money online is \"Information Overload\" I have kept each video extremely short, so you will not be overwhelmed with information.  </p>", 
    "end_date": null, 
    "title": "How to Attract Students to Your Udemy Course - Unofficial", 
    "price": "50.00", 
    "instructors": "Amir Rimer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361240_4542_3.jpg", 
    "course_url": "https://www.udemy.com/unofficial-how-to-attract-students-to-your-udemy-course/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T07:42:09Z"
}