{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you're looking for a simple, laid back approach to making money in your spare time without spending one single penny, then this course is for you!</p><p>Follow along as I demonstrate how to to have fun on Facebook and earn an income at the same time. <strong> Instructor available to answer discussions inside</strong>.</p><p><strong>Create profitable Facebook pages on topics you are already interested in. Get tons of genuine followers without advertising and turn multiple pages into an extra income.</strong></p><ul><li>Create exciting and interesting Facebook pages with ease</li><li>Learn which niches and topics are magnets for attracting followers</li><li>Discover the best options for making money on Facebook</li><li>Learn about an awesome free tool for monetizing Facebook</li><li>Get amazing Facebook cover images for free</li><li>Learn exactly how to monetize Facebook pages without losing followers</li><li>Find out how to turn a part-time income into a full-time income or more</li></ul><p><strong>You don't need an existing Facebook following. This course shows you everything from scratch.</strong></p><p>Learning how to use Facebook to your advantage can really be a lot of fun. Most of us spend time on Facebook anyway, so why not put that time to good use and turn it into cash!  </p><p><strong>Course Content and Overview</strong></p><p>The course is suitable for everyone and is completely beginner friendly. It doesn't even matter if you don't have a Facebook account, providing you are able to create one.  Right now the course has 20 lectures and the videos range from 4 minutes to 12 minutes in length.</p><p>After completing the course you will be able to choose the best topics and niches for your Facebook pages, set up as many pages as you like and fill them with interesting content that will attract hoards of likes, shares and comments. You will be able to monetize those pages effectively and use an awesome free tool to increase your income.</p><p>Enroll in the course today at the special introductory price. Fully covered by Udemy's full 30-day, no questions asked money back guarantee :)</p>", 
    "end_date": null, 
    "title": "How to Create, Monetize, and Market Popular Facebook Pages", 
    "price": "20.00", 
    "instructors": "Theo McArthur", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667816_c6c2_2.jpg", 
    "course_url": "https://www.udemy.com/simple-approach-part-time-business-on-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T13:06:35Z"
}