{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Almost \"JOIN OVER 1080+ DELIGHTED STUDENTS in less than 2 Hour \" WHO HAVE ALREADY TAKEN THIS COURSE</strong></p><p><strong>Start making money with no experience whatsoever, immediately - just like my current 1080+ students!</strong></p><p><strong><strong></strong><em>UPDATE : 25 SEPTEMBER</em> 2015 TACTICS! BRAND NEW &amp; 100% UP TO DATE CONTENT!</strong></p><p>You will not believe how ordinary people making decent online money easy.</p><p>In this course you will get unique ideas for different ways to make money online with practical strategies and you will get a passive income from your home.</p><p>It doesn't mater whether you are technical or non-technical; this course will have all the practical strategies that give you passive income right from your home.</p><p>In this course, you will learn how you can correctly use that strategy to make money.</p><p><em><strong>Sign up</strong></em> and experience <strong>the unique ways to make money online that are very practical and possible.</strong></p><p>We've created a remarkably simple, easy-to-follow blueprint course that reveals strategies and how anyone can start making online money success strategies with just simple and ordinary skills!</p><p>We've designed the course from the ground up so it's easy to implement everything you're learning as you go.</p><p><strong>Start Learning!</strong></p><p><strong>Enroll now</strong> and <em><strong>Start making money right from your home and get financial freedom </strong></em><strong>TODAY!</strong></p>", 
    "end_date": null, 
    "title": "How to Use Basic Skills to Run a Home Business Online", 
    "price": "20.00", 
    "instructors": "Sachin Kumar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576426_1801.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-basic-skills-to-run-a-home-business-online/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T10:28:53Z"
}