{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">This is a step by step Guide to make your First sale online today without spending a dime.</strong>  </p>  <p>  \t  This course is for newbies who are struggling to make money online.With this course you will be able to make a sale right after you are done with it and eventually make a passive income. We <strong style=\"\">GUARANTEE</strong> that you will make money after finishing this course if you follow the steps mentioned.  </p>  <p>  \t <strong style=\"\">Please note that a LOT more content will be added to this course and the price will go up so get in while the price is low. I promise you won&#039;t be disappointed. </strong>  </p>  <p>  \t<strong style=\"\">What You Will Learn?</strong>  </p>  <p>  \t  The course is designed to teach you:  </p>  <ul style=\"\">  \t<li>How to find the best product to promote</li>  \t<li>How to get that product ready to sale</li>  \t<li>How to make a website for FREE</li>  \t<li>How to promote your site for FREE</li>  \t<li>How to setup a targeted Twitter account</li>  \t<li>How to Get your first sale today!</li>  \t<li>How to Scale it up and make a passive income</li>  \t<li>Exclusive bonuses that will blow your mind off</li>  </ul>  <p>  \t<strong style=\"\">Who Should Take This Course?</strong>  </p>  <p>  \t<strong style=\"\">Beginner&#039;s</strong> guide to making money online with internet marketing.  </p>  <p>  \t<strong style=\"\">If you have any questions, you can ask us any time and we will always be there to answer your questions.</strong>  </p>", 
    "end_date": null, 
    "title": "How To Get Your First Sale Today In 7 Steps For Newbies!", 
    "price": "20.00", 
    "instructors": "ASN Tech", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220812_83ec_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-your-first-sale/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T18:47:54Z"
}