{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>According to scientific research, over 65% of people are <em>visual</em> learners.  That's <em>two thirds</em> of your students!  Yet, many ecourses have boring and unappealing visuals that put their audiences to sleep.  Plain text on plain background?  How is that better than writing an article?  As a result, students never complete courses, drop out, ask for a refund, and otherwise never get the benefit of your ecourse that you worked so hard creating for them.</p><p>You've taken your time to learn how to put videos together for your ecourse - make it count!  Don't leave it at the 'article with a voice' stage.  With just a little extra effort you can convert plain and boring looking materials into stunning, professional looking, fully animated ecourse.  Powerpoint allows you to do that with ease.    </p><p>Keep your students excited, engaged, and looking forward to your next lesson and - your next ecourse!</p><p><strong>Discover the Power of PowerPoint</strong></p><ul><li>Learn to create stunning text effects</li><li>Quickly create an endless variety of shapes, styles and designs</li><li>Learn how to add 3D objects in Powerpoint</li><li>Learn to work with video and images in your presentation</li><li>Add tables, charts and diagrams to present data in a visual way</li><li>Save a ton of time by working with templates and learn other time-saving tricks</li><li>Animate ANYTHING instantly!  It's fun and super-easy!</li><li>Download animated templates that we create in this course in Powerpoint (.pptx) format</li></ul><p>Don't settle for boring looking slides that your students will have to suffer through.  Make your materials exciting and engaging for your course participants.<br></p><p><span></span>Make your eCourse STAND OUT.</p>", 
    "end_date": null, 
    "title": "How to Design and Animate your eCourse in Powerpoint", 
    "price": "45.00", 
    "instructors": "Nata Aliyeva", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653536_6458.jpg", 
    "course_url": "https://www.udemy.com/designanimatepowerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T15:51:40Z"
}