{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will reveal to you the simplest, most straightforward formula to dominate e-commerce and make $300/day in just one week from now!</p>    <p>It’s safe to say that if you want to truly live the Internet Marketing lifestyle, setting up your e-commerce shop and selling products using FB ads is as close as you can get to constant passive income for years to come.</p>    <p>Everyday people are buying products left and right, searching for presents for their family and friends, and just eager to spend money on personalized items. </p>    <p>In fact, the e-commerce market has officially become a TRILLION dollar market, dwarfing any other Internet Marketing niche by 100 times.</p>    <p>E-commerce is a virtual goldmine, and it’s only getting better every day. </p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Reap the Benefits Of Having Your Own E-Commerce Business</strong></p>    <ul><li>Set up your own e-commerce business from home</li><li>Start ahead of the pack with the right niche</li><li>Sell &amp; promote high quality products with Facebook Ads like a pro </li></ul><p><br><strong>Contents and Overview</strong></p>  <p>This course explains how to build a highly profitable e-commerce business that brings in hundreds of dollars per day and can be scaled further.</p>    <p>First, you’ll learn the fundaments of setting up your e-commerce business in the first section of this training. I’ll show you which platform to select, how to create mandatory pages, the best free plugins and how to customize your online store further.</p>    <p>Next, we’ll cover how niche ideas, where to find great products, how to get these products onto your site and how to set up product shipping.</p>    <p>Then, we’ll move one to promoting your e-commerce store with Facebook ads. I’ll walk you through the process of creating your first campaign, audience research and best practices to get instant results.</p>    <p>Last but not least, we’ll cover how to scale your profits with retargeting, efficient email campaigns and how to outsource some of your daily tasks so you can focus on the important stuff. </p>", 
    "end_date": null, 
    "title": "How To Build A Successful E-Commerce Business", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Stefan Ciancio", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718680_ce3b_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-successful-e-commerce-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T20:01:36Z"
}