{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">This course teaches eBook publishers how to find and hire quality freelance writers.</strong></p><p>With numerous freelance writers advertising on the Web, how do you know which one to hire? Are they all as good as they claim? Not likely. This course provides training and direction for finding and evaluating the best freelance writers available. It also explains the benefits of hiring a freelance writer instead of writing your own eBooks. With growing competition in the eBook industry, you don&#039;t want to waste your efforts trying to design a publishable product that can be far better handled by a skilled freelance writer. Hiring a professional writer for your eBooks is one of the best budget and marketing decisions you will ever make. </p><p><strong style=\"\">Learn how to use Freelancer websites to find qualified freelance writers</strong></p><p>Learn how to develop appropriate and relevant search terms to get optimum results. Browse well-designed websites to find experienced freelance writers for your eBooks and know which ones seems to be the best fit for your purpose. </p><p><strong style=\"\">Learn how to create compelling job announcements that will attract quality freelance writers</strong></p><p>Discover the power of language in crafting job ads that will have freelancers competing for your projects. You&#039;ll be surprised to know what professional writers who are looking for projects to work on value most. </p><p><strong style=\"\">Learn how to evaluate freelancer proposals and select a freelancer</strong></p><p>Explore ways of developing a meaningful call for proposals and establish useful criteria for evaluating the proposals received. </p><p><strong style=\"\">Learn how to negotiate fees with freelance writers</strong></p><p>Become informed about how to get the best value for your freelance writing investment. </p><p><strong style=\"\">Learn how to work effectively with freelancers</strong></p><p>Study the best practice techniques for working productively with freelancers to achieve your objectives while meeting deadlines and staying within the budget. </p><p><strong style=\"\">Learn what you should do to proofread and edit submitted manuscripts</strong></p><p>Find out how to edit and polish a submitted manuscript to make it publisher-ready. Also learn what you should do when the submitted manuscript is not up to your standard. </p><p><strong style=\"\">Learn about the benefits of outsourcing eBook writing</strong></p><p>There are numerous reasons to outsource your eBooks. First, you&#039;ll save valuable time that can be spent on managing operations and developing a vision for your business. Second, you can save money by having an expert write eBooks that you are not quite comfortable doing on your own. Third, your published eBooks will attract more appreciation and viewer responses than if you had written them yourself, because they will be professionally written by skilled freelancers who do this for a living. </p>", 
    "end_date": null, 
    "title": "How to Outsource your eBook Content", 
    "price": "20.00", 
    "instructors": "Jaye Seay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538198_efb4_2.jpg", 
    "course_url": "https://www.udemy.com/kindle-ebook-outsourcing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T19:51:30Z"
}