{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>**Updated February 2016**</strong></p><p><strong>There are now 120 lectures in the course and over 8.5 hours of content!</strong></p><p>I've added over 60 brand new lectures which cover topics such as additional tools, prospecting methods, working with clients, reporting, organization and much more. </p><p><strong></strong><strong>Have you ever thought about starting your own SEO Agency?</strong></p><p>When I first started out I learned about as much as I could about how to properly run my own agency.</p><p>What I quickly realized was that there were so many questions I had unanswered.</p><p><em>How do I build an agency website to offer my services?</em></p><p><em>How do I establish a business?</em></p><p><em>How do I get clients?</em></p><p><em>What tools do I use to track leads or invoice clients?</em></p><p><em>How do I create SEO work proposals?</em></p><p>These were a lot of the challenges I faced and I spent many months trying to understand.</p><p>Once I figured it all out I put a system into play, I repeated my actions and the work started to roll in.</p><p>I decided to create this course on exactly how I did it, providing the exact steps A-Z of what I needed to do in order to start profiting with SEO and Web Design services.</p><p><strong>This is what you get inside this course:</strong></p><ul><li>How to start and build your own agency website using Wordpress</li><li>How to properly setup your business as an LLC</li><li>My top tips and methods for getting clients for your SEO Agency - I even include template emails and lead generation tools</li><li>I walk you through a live case study on EXACTLY how I use sites like LinkedIn to find good prospects</li><li>I include real prospecting examples of how I closed web design and SEO clients</li><li>The exact tools I use for both tracking your leads and invoicing clients - I took out all the guesswork and found the most affordable tools to get started.</li><li>How to outsource all of your SEO work and become a true middleman</li><li>I include my exact client proposal template and how to close sales</li><li>I explain how you can become an authority when cold calling businesses and stand out from every other agency out there</li></ul><p>This is not a \"get rich overnight\" course. I explain exactly how you can build a real business with massive growth potential.</p><p><strong>Check out these awesome testimonials!</strong></p><p>\"Hard to believe you're able to get great information like this on Udemy. The course cleared up a lot of questions I had about starting my own digital agency. I like that John Shea takes about the complex world of online marketing, SEO, and how to make money doing the, and puts everything into easy to understand, plain English. Looking forward to other courses from him!\" - <strong>Xavier</strong></p><p>\"John takes you on a journey from the very beginning - starting from nothing. He delivers all the background information that you need to launch a Marketing Agency, AND make it profitable. It is no get-rich-quick scheme – this is a real blueprint to help you launch a profitable business. I highly encourage anyone that has an interest in running an agency to check out this course.\" - <strong>Doug Cunnington</strong></p><p>\"John goes into depth about everything you need to know to start up your own digital marketing agency. The content is well explained and is in bite sized chunks so you can go back to any section you need to revise. John runs an agency himself and that shows in the course as he lets you know about potential pitfalls as well as the sales and success. Great tutorial, highly recommended.\" - <strong>Trevor Dumbleton</strong></p><p>\"I already own a digital marketing agency, but I bought this course as I thought I may find some useful stuff for me. And, I was very happy that I did it - my investment in this course was well worth. I wish such course existed 5 years ago when I started my digital marketing agency! This is a no BS, straight to the point course which will guide you in a very detailed manner how to start and run your web agency. </p><p>It will clearly show you the action plan for setting up a real business, and demonstrate how to prospect for clients using many proven tactics. It is indeed very useful and valuable information you'd need to run a successful digital marketing agency. As John shares his own experiences in setting his own digital marketing agency, you can learn how to avoid many of the pitfalls, saving your time and money. If you are planning to start a web agency selling services to offline businesses, I'd highly recommend you to enroll in this course. This course is packed full of useful actionable information. Whether you are a newbie or an experienced marketer.\" - <strong>Raaj Paatkar</strong><strong></strong></p><p>\"I've taken some other courses by John Shea, so when I saw this new course--his most comprehensive yet--I didn't hesitate to buy it. Why you may ask? Because of the two words that come to mind when I think about John and his work: Authenticity and Actionability. Firstly, John is real--he's not just another mass course-producing vending machine that relies on flashy videos and slick promises, but with little substance. </p><p>John actually works full-time in real life, doing exactly what he's teaching in this course. And he takes you right along with him, like he would an apprentice in his own office, and shows you everything with great honesty. Secondly, you will discover many valuable, actionable strategies in this course--from starting up your LLC and website to finding clients and writing up contracts to outsourcing work. Even already established web or seo businesspeople are likely to discover useful tips. So if you want a fluff-free, non-sugar-coated look at what it's really like to have your own digital online marketing agency, and want all of John's insight into how he made his successful, then I strongly recommend for you to sign up now.\" - <strong>Dr. Phillips</strong><strong></strong></p>", 
    "end_date": null, 
    "title": "How To Start Your Own Digital Marketing Agency", 
    "price": "20.00", 
    "instructors": "John Shea", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580316_1097_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-your-own-digital-marketing-agency/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T16:57:26Z"
}