{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Start bringing in a second income using just your computer, an Internet connection and your own time. </strong></p><p>In this course students learn several different methods to make cash by:<strong> </strong></p><ul><li>Doing small computer based jobs using gig or freelancer platforms</li><li>Providing a social media manager service to several companies at once</li><li>Creating digital products that can be made once and sold many times automatically</li><li>Selling real products either by purchasing ad selling stock or by drop shipping</li><li>Learning new skills which you can then convert to more money making methods</li></ul><p><strong>Contents and Overview</strong></p><p>This course was made for anyone that wishes to earn money from home, whether they are a student with spare time but can't work a 'traditional job', a stay-at-home mum or dad who has a little time while the kids are away, or whether they have a full time job but want to build a second income, or build a business that they can leave their day job for.  The only requirements are a flexible mindset and a commitment to working hard. </p><p>Enrollees in this course will have access to the five sections which detail different ways to make money. The sections cover very broad subjects but some aspects are interchangeable. The first section covers the very basic way to make money:</p><ol><li>Find problems</li><li>Solve them</li><li>Don't charge a fortune...</li><li>...but don't work for pennies</li></ol><p>Each of the sections explores the concept and why it makes money. Each also then explores practical and realistic ideas or how-to's so that students can start making money easily as quickly as possible - the only time is to figure out what goods or services to provide and then to create your online profiles and pages as required.</p><p>If students feel that they don't have the skills required to make money online then they should not worry - the first section covers the skills that anyone has to offer if they can just read, write, talk, sing, type <em>or </em>draw!</p><p>Students who complete this course will be mentally prepared and full of ideas to create their second income. The course is motivating and shows how easy it is to create an income with no capital - just time and effort.</p>", 
    "end_date": null, 
    "title": "How to Run a Business with Your Home Computer ", 
    "price": "30.00", 
    "instructors": "Kim Debling", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639080_d9d7.jpg", 
    "course_url": "https://www.udemy.com/make-money-at-home-online/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T10:05:55Z"
}