{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5><strong><span>Full Disclosure About How I use my Simple BluePrint To Snatching Up Easy $197 Payments By Setting Up Local Cash Machines</span><br> </strong></h5>\n<h5><strong>- Watch Live Case Studies Unfold Before Your Eyes</strong></h5>\n<h5><strong>- Building A Local Cash Machine</strong></h5>\n<h5><strong>- Marketing A Local Cash Machine</strong></h5>\n<h5><strong>- Getting Paid from A Local Cash Machine</strong></h5>\n<h5><strong>- Nothing Is Left Out... Just Copy Me and Succeed!</strong></h5>\n<h5><strong>- Learn from Someone Who Has Actually Made Money from \"Offline Marketing\" <br></strong></h5>\n<p><strong> </strong></p>\n<h5><strong><br> </strong><strong>Here Is Exactly What You Get:</strong></h5>\n<ul>\n<li>Step By Step Over The Shoulder Video Instruction Showing You Exactly How To Start Making Easy $197 Payments Setting Up \"Local Cash Machines\"</li>\n<li>Over 6 Hours of Webinar Recordings To Watch Over and Over Again</li>\n<li>Everything Is Covered, from Getting Hosting, To Closing The Deal (Don't Worry Because You Don't Need To Be A \"Closer\")</li>\n<li>You Don't Need To Be A Techy Either, If You Can Copy and Paste and Unzip A Folder, You CAN Do This</li>\n<li>A Blueprint To Outsource 95% of The Work, You Basically Have To Cash The Checks and Do A Little Bit of Promotion</li>\n<li>You Get The Actual Marketing Material I Have Used To Land Clients</li>\n<li>My Best Postcard, Email, Flyer, Business Card and Advertisements</li>\n<li>You Get A Complete Offline/Local Business Money Making Machine and An Almost Guaranteed Method To Make Money with \"Local Cash Machines\"</li>\n</ul>\n<p><strong>************************************************************************************************<br> </strong></p>\n<p><strong>Module 1:</strong> An Introduction – What are Local Cash Machines and why does this work so well. How to use Simple and functional local websites ranked on the first page of Google. Offer it to targeted businesses for $197 setup plus a small monthly fee of $49</p>\n<p><strong>Module 2:</strong> Choosing The Right Locations – Understand the strategy of start small, build confidence and expand. “Local” doesn’t  have to be local to you. This is easy, almost everywhere.</p>\n<p><strong>Module 3:</strong> Choosing Business to Target– Marketing to service type businesses. High dollar value per customer(Contractors-Roofers, plumbers….etc.). Avoid retail and lawyers and general health or dentists.</p>\n<p><strong>Module 4:</strong> Build Local Cash Machine – Develop your 1<sup>st</sup> Local Cash Machine. What to avoid and what to target at. Start to build templates, select hosting account, configure domain server, build backlines…etc.</p>\n<p><strong>Module 5:</strong> Marketing and Cashing In with Your Local Cash Machine – Variety of ways to promote your cash machines ( Sites, email, direct mail..etc). Cash in at least $197 and then a $49 monthly fee.</p>\n<p><strong>Module 6:</strong> Expanding Your Local Cash Machine Empire – How to go deep and go wide. The right strategy for successful outsourcing. How to add additional services to boost the income.</p>", 
    "end_date": null, 
    "title": "How to Build and Market a Local Cash Machine", 
    "price": "25.00", 
    "instructors": "Gary Smith", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20170_344e_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-and-market-a-local-cash-machine/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-26T15:44:30Z"
}