{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p> In this course we'll be taking you through the whole procedure on what you need to start a home business in the t shirt transfer printing business. We'll show you exactly the things we do and show you the equipment and the different procedures you'll need to know including the correct materials and equipment you'll need to produce successful decorated t shirts.</p>\n\n<p>We cover the following:</p>\n\n<p><strong>SECTION 1</strong><br></p>\n\n<ul><li><strong>Introduction</strong> - A bit about how we started in the T Shirt Transfer Printing Business including the mistakes we made and why Transfer Printing is the most cost effective way to get into the T Shirt Printing Business.</li><li><strong>The Different Types of T Shirt Printing</strong> - In this section, we look at the other ways to print onto T Shirts and explain the pro's and con's with each method.</li><li><strong>The Equipment Needed</strong> - In this section we look at the equipment required and share the equipment we use and are still using.</li></ul>\n\n<p><strong>SECTION 2</strong><br></p>\n\n<ul><li><strong>The Transfer Paper</strong> - In this section we reveal the transfer papers we use and the differences between the papers for printing on different color garments.</li><li><strong>Creating Your Designs</strong> - In this section we show how we use the cutter software and actually get an image onto transfer paper and produce the cut lines for the cutter to automate the job.</li></ul>\n\n<p><strong>SECTION 3</strong><br></p>\n\n<ul><li><strong>Using The Heat Press</strong> - In this section we show you how to use the heat press to produce the finished garment including some important pre press procedures to ensure there is no moisture present when pressing images onto T shirts.</li><li><strong>Black T Shirt Transfer Application</strong> - In this section we take you through the differences when printing on a black or coloured T shirt compared to printing on a White T shirt.</li><li><strong>Conclusion, Marketing And Resources</strong> - In this section we give you some tips that we used when we started off by generating local customers on a limited budget.</li></ul>\n\n<p><strong>SECTION 4</strong></p>\n\n<ul><li>Heat Press Facts - In this section we show you why you shouldn't buy an inferior heat press and what to check for when you buy this important piece of equipment.</li></ul>\n\n<p><strong>SECTION 5</strong></p>\n\n<ul><li>We finish off with some course notes and additional material. Don't skip this.</li></ul>", 
    "end_date": null, 
    "title": "How To Start A T Shirt Transfer Printing Business From Home", 
    "price": "35.00", 
    "instructors": "Martin Butler", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/52153_ecdd_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-t-shirt-transfer-printing-business-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-03T06:29:30Z"
}