{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">**Over 350 enrolled students in the first 24 hours. This award-winning course is available at $25 for a limited time**</strong>  </p>  <p>  \t    How about selling top products on Ebay and Amazon without worrying about inventory, shipping and returns? What if  someone else takes care of all these things for you? It sounds too good to be true but there are some effective, proven and legal ways of doing it and a lot of us don't know about these amazing resources yet! It's not too late yet to establish your real work from home job. Please note: this is NOT a quick money making scheme! You will need to invest quality and dedicated time in order to establish your e-commerce business, but you don't need any prior e-commerce experience to achieve success. It's a gold mine of information that can change your life. This course demonstrates all the effective and secret strategies on how to sell products online without an inventory. If you always wanted to sell products online but could not do it because of inventory, investment and time, then this is the right place for you. You can become one of the top Ebay and Amazon sellers as well by selling top products that are currently in demand. The best this is that you don't need a single dollar investment to start your e-commerce business! You can do it as a part-time or full time job since you can eliminate the headache of shipping and returns as well! Earn extra money or quit your job by using these techniques to work from home and be your own boss. E-commerce industry is booming everyday and this is the future of shopping. You can also become a part of this E-commerce boost worldwide by following some authentic techniques. This course demonstrates all the steps you need to establish a successful e-commerce business. Also, this course will show you how to create your own e-commerce website without any programming whatsoever! If you are passionate about utilizing the available techniques to become your own boss, then let's enroll and dig into it and make money online selling on Ebay and Amazon without an inventory. Make extra 2K-3K per month without an inventory.  </p>", 
    "end_date": null, 
    "title": "How to Succeed on Amazon and eBay Without Inventory", 
    "price": "20.00", 
    "instructors": "QAEversity .", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363708_de0c_3.jpg", 
    "course_url": "https://www.udemy.com/succeedwithoutinventory/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T09:23:23Z"
}