{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                        Learn the tips and little known strategies that successful home based business owners use to build thriving businesses.<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">The Home Based Business Success Course:  Advice, Tools &amp; Strategies to Help You Earn Full-Time Income From Home</strong>  </p>  <ul style=\"\">  \t<li>Developing an Entrepreneur&#039;s Mindset</li>  \t<li>Goal Setting and Achievement</li>  \t<li>Cold, Hard Facts About Success</li>  \t<li>Developing a Daily Method of Operation</li>  \t<li>Working With a Mastermind Group</li>  </ul>  <p>  \t<strong style=\"\">A Road Map for the Serious Entrepreneur That Wants to Shorten Their Learning Curve and Dramatically Increase Their Chances for Success</strong> <strong style=\"\">in a Home Based Business</strong>  </p>  <p>  \t                            Learning the fundamentals of running a successful home based business will give you powerful and useful information that you can use daily. The strategies taught are easy to learn and critical to success in business.  </p>  <p>  \t                    By learning the strategies and implementing the suggestions, you will vastly improve your chances for success in business and being able to earn a full-time income from home.  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \t                          Suitable for new entrepreneurs and those planning to start businesses in the future.  Those entrepreneurs that have been running home based businesses but who have not had the type of success they would like to, will also benefit from this course.  </p>  <p>  \t                    You will learn both the good and bad things that happen when running a home based business and how to handle the inevitable challenges.  This course focuses on teaching you proven strategies to help you succeed in business.  </p>  <p>  \t                          This course was designed to help entrepreneurs gain knowledge and avoid the  pitfalls that many uninformed entrepreneurs experience. The information included in this course is presented in a clear and  concise method with lectures, resource material and quizzes.  </p>  <p>  \t                          Students that complete the course will have the knowledge to start and operate a home based business and will receive a verifiable certificate of completion.  </p>", 
    "end_date": null, 
    "title": "How to Run a Successful Home Based Business", 
    "price": "20.00", 
    "instructors": "Rhonda Jordan", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360058_0cc6_2.jpg", 
    "course_url": "https://www.udemy.com/the-home-based-business-owners-success-course/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T22:34:32Z"
}