{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Fiverr</strong> is a home based business that has changed the lives of hundreds of people around the world. It is rich with opportunity but so many sign up, create their service or product, and wait for sales that never come. It is one of the few online home based businesses that literally anyone can do if you have the right knowledge, skill set, and talents. Current Fiverr sellers include artists, graphic artists, voice over artists, entertainers, video editors, book editors, writers, marketers, as well as professionals offering legal advice, career advice, and so much more. The sky really is the limit when it comes to Fiverr.  </p>  <p>  \tThis course is not only designed for new <em style=\"\">Fiverr</em> sellers, or those thinking about joining, it is also designed for current Fiverr sellers as well. This course goes from A to Z. I will show you everything from registration to processing orders. You will learn what Fiverr is and how you can earn a living with it. I will even show a little talked about technique for coming up with products and services using your own talents, skills, and passions. Other topics will include choosing the proper user name, creating a profile that sells, how to make sales, increasing sales for more revenue, marketing your gig, legal and copyright info, customer service, and tips for expanding your Fiverr home based business into a full time career.  </p>  <p>  \tMy name is Mike M Burke and I have been a successful Fiverr seller for nearly three years. I am best known for my Santa Claus gig each year. Fiverr has allowed me to use my experience and love as a performer to earn a living through voice recordings and video. I have learned much in the last three years and in this course I will teach you all of it. I hold nothing back!  </p>  <p>  \tMy approach to teaching is through video in a one to one format. When needed I will also show you live examples from the Etsy website. Each lecture covers just one topic full of informative details as well as my own personal stories and experiences related to my own home based business and my Etsy shop. I have nearly 25 years of experience in front of and behind the camera. I speak clearly with passion and energy. The videos are well lit with broadcast quality sound. We start with the basics and end on more advanced topics such as expanding your Fiverr <em style=\"\">home based business</em> and secrets to reaching success.  </p>  <p>  \tThere will be a total of 20 video lectures. They go from 5 minutes up 20 minutes in length and you are welcome to watch any or all the videos however many times you need. Also included is printable documents to help serve as a guide as you go through each lecture. You will also find a quiz at the end of each section.  By going through two to three lectures a day you can complete this course in as little as two weeks or less! Once you complete the course you will have everything you need to start creating your own Fiverr gigs and reach success in your very own <strong style=\"\">home based business</strong>!  </p>", 
    "end_date": null, 
    "title": "How To Run A Successful Fiverr Business From A To Z", 
    "price": "20.00", 
    "instructors": "Mike M. Burke", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402436_2d27_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-run-a-successful-fiverr-business-from-a-to-z/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T19:17:54Z"
}