{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is designed for anyone who has the desire or goal to work from home and make money online from any location.  In this course you will discover the possibilities of finding real companies that hire people to work from home in customer service, tech support, virtual assistants and so much more.  </p><p>You will also be equipped with all of the tools that you need to find a work at home job, detect and avoid work from home scams and several other money-making opportunities that I have personally used and tried that has worked for me.</p><p>You should take my course if you have been struggling to find a work at home job, legitimate companies that hire and pay for the work you do online, if you are looking for other methods to make money, start your own business, have the goal of making part time or full time income online.  I am a professional researcher and stay at home mom who has been able to help many people find and get a work at home job and make money online to help support themselves and their families.</p><p><strong>This course will take just an hour and a half of your time!</strong></p><p><strong><strong><strong>After this course you will be fully prepared, motivated and inspired to start your work at home journey.</strong></strong></strong></p><ol><li><strong></strong></li></ol>", 
    "end_date": null, 
    "title": "How to Find Legitimate Work at Home Jobs", 
    "price": "25.00", 
    "instructors": "Alicia Washington", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634074_172b_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-legitimate-work-at-home-jobs/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T21:00:08Z"
}