{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>What disappoints you most about trying to work on sites like oDesk?</strong>  </p><p>  \t   Not enough jobs available that you want to do? The jobs you like are paying too little? The clients or companies you’ve worked with haven’t been great at communicating? Or maybe it’s that your profile is turning off your prospective clients…  </p>  <p>  \t   Well I’ve got good news for you. You don’t have to be disappointed in these things anymore!  </p>  <p>  \t   You’re about to be shown a step-by-step PROCESS of how to increase your job offers via your freelance profile so you get promoted by sites like Upwork, find and land the high paying jobs you want and build a quality profile that has clients asking to work with YOU.  </p>  <strong><em>Introducing How to Pimp Your Freelancing Profile</em></strong>  <p>  \t   Think about your ideal freelancing job. Now think about your ideal client – what are they looking for in a freelancer? What expectations do they have when they land on your profile? If you don't know, that's ok. I'm going to show you exactly how to find this out, then I'll show you how to implement the strategies I used to replace my full-time income by landing great paying jobs on oDesk (now Upwork).  </p>  <p>  \t   I work with freelancers on a daily basis and the one strategy that is consistently overlooked when it comes to making money via sites like Upwork <strong>is their profile – making sure it is 100% completed.</strong>  </p>  <p>  \t <strong>There is no better (or faster) way to gain the trust of prospective clients and freelancing site staff than having a profile that clearly shows you know what you’re doing and that you back everything with a 100% guarantee.</strong>  </p>  <p>  \t   In this course I will show you the EXACT strategies I've used to <strong>replace</strong> my full-time income through landing jobs and ongoing clients via oDesk (now Upwork).  </p>  <p>  \tI still use Upwork to this day.  </p>  <p>  \t   After this course, you'll know how to:  </p>  <ul>  \t<li><strong>Ensure that your profile photo gets approved</strong></li>  \t<li><strong>Get featured on Upwork as a top freelancer</strong></li>  \t<li><strong>Save time by avoiding the wrong clients - I'll show you how to spot the red flags</strong></li>  \t<li><strong>Fill your portfolio even if you haven’t published anything yet</strong></li>  \t<li><strong>What to put in your proposal to clients that will land you an interview</strong></li>  </ul>  <p>  \t <strong><em>Why did I create this?</em></strong>  </p>  <p>  \t   It would be easy for me to keep everything to myself and let everyone else try and figure out what I've spent the last few years doing. And I'd probably make a lot more money. But one of my fundamental values is to help as many freelancers as possible – it’s all about giving back for me.  </p>  <p>  \t   So since I can't take on every single freelancer as a client, I've done the next best thing. This course is packed with bite-sized action steps that you can use immediately. And you WILL see results. If you don't or you're unhappy for any reason - let me know within 30 days and I'll give you a full refund, no questions asked.  </p>  <strong><em>What Other's are Saying:</em></strong>  “Speaking as someone who was already earning money via SEO writing (low four figures), I thought that Lise’s stuff was going to be too basic for me and not really add that much value, but I decided to give it a shot anyway and I’m glad that I did.  Just a few of the suggestions she provided opened up an entirely new marketing avenue for my business and has led to a nice double in my revenue, even with my incredibly small amount of marketing effort over the past month.” <strong><em>Henry Habgood, SEO Writer</em></strong>  <p>  \t   =====  </p>  <p>  \t <strong>Finally! Someone Has Made oDesk Easy.</strong>  </p>  <p>  \t   Lise is clear, honest, and straight to the point. If you want to get started as an oDesk Freelancer, this is the course for you. Implement the action steps and you'll be making money as a freelancer in no time! <strong><em>Miss Y Grant Cooke</em></strong>  </p>  <p>  \t <strong></strong>=====  </p>  <p>  \t <strong>Great Actionable Advice</strong>  </p>  <p>  \t   I've followed Lise's advice and found it was really easy to start getting clients on oDesk right away. This course is great, and highly recommended. <strong><em>Liz Froment</em></strong>  </p>  <p>=====<br></p><p>  \t   Yes, I realize that you can take the entire course, implement what I teach to land your first gig and client and still ask for a refund...but I'm trusting you to be cool and actually take action. :)  </p>  <p>  \t   You have nothing to lose. I'm looking forward to seeing you inside!  </p>  <p>  \t <strong>Lise</strong>  </p>", 
    "end_date": null, 
    "title": "How to Pimp Your Freelancing Profile", 
    "price": "20.00", 
    "instructors": "Lise Cartwright", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/196650_de17_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-pimp-your-odesk-profile/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-10T00:25:21Z"
}