{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn how to start working for yourself from someone who's done it. I got away from all bosses in March 2013 and haven't looked back!</strong></p><p>In this course, I will teach you everything you need to know to start <em><strong>working for yourself, from home and from coffee shops</strong></em>, like I do, and make $5,000 - $6,000 per month. You will learn the following critical skills:</p><ul><strong></strong><li>How to find your ideal niche so that you would actually enjoy working</li><li><strong>How to make sure your home-based business idea is a </strong><strong>winner by testing it quickly</strong></li><li>Beginner-to-intermediate marketing and selling skills that avoid high-pressure or anything uncomfortable for you or for your prospective clients <strong><br></strong></li><li><strong>How to differentiate yourself from your competitors so that you could command higher fees from the start, even if you are a beginner in a new field</strong></li><li>How to get a great website on the cheap</li><li><strong>Easy ways to start getting clients with NO technology at all</strong><strong><br></strong></li><li>How to get high-paying clients quickly </li><li><strong>How to make one irresistible offer after another so as to make the most money the fastest way possible</strong><strong><br></strong></li><li>How to keep your clients coming back to you for their needs, even if you charge more than everyone else</li><li><strong>How to raise your fees without worry and get more money from new</strong><strong> and existing clients</strong></li><li>How to manage your work days without stress and overwhelm</li><li><strong>My professional secrets that enable me to command high fees from my clients without worrying that they might hire someone else</strong></li></ul><p> <br><strong></strong></p><p><strong>Course Structure</strong></p><p>In about 3 hours of the course content, you will learn the skills that most people who want to work for themselves will never learn and will continue to struggle from job to job.</p><p><em><strong>I will give you the shortcuts.</strong></em> Who said you need to start from the bottom? Nonsense! Start as high as you can. Be humble later - when you no longer need money. </p><p>In the mean time, let's get together, and I'll show you, step-by-step, how to start with nothing and end up with a lucrative self-employment practice.</p><p>You don't need any prior knowledge of anything in the business world. You only need one marketable skill - and in the course I will show you that you definitely have more than one, even if you think you don't.</p><p><em><strong>Hate technology? No problem - I make it easy. </strong></em></p><p>Still don't want to deal with technology - that's fine, too. The right mindset will be your profit driver. And I'll illustrate in the course how I created an entire marketing system for my client in his office of physical therapy - without the use of the internet.</p><p>If you can pick up a phone, place a simple ad in a newspaper, and make a commitment to excellence, you can start making money today!</p><p><em><strong>Have no money for advertising?</strong></em> I show you a simple way to start getting clients without any money!</p><p>All you need is to get started. The more you delay, the longer it will take you to start working for yourself, making a great living and having the freedom to do things you love!</p><p><em><strong>Enroll in the course and start working for yourself today!</strong></em></p>", 
    "end_date": null, 
    "title": "How to Launch Your Home-Based Business in 30 Days or Less", 
    "price": "20.00", 
    "instructors": "Mr. Philip Saparov", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560748_a0b3_6.jpg", 
    "course_url": "https://www.udemy.com/self-employment-101-make-5-6kmonth-working-for-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T18:22:20Z"
}