{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you thinking to create an online course, but don’t know where to start?<br> <br> In this training, you’ll learn from two Udemy instructors with more than 60,000 students how to create an online course that sells!</p>    <p>Discover a step-by-step system that will walk you through the process of mass-producing high quality online courses like bestselling teachers!</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Discover A Simple Way To Create Bestselling Online Courses</strong></p>    <ul><li>How to make an outstanding course in less than 2 days</li><li>Step-by-step instructions to build a high quality course from scratch </li><li>5 Hacks to outsmart your competition  </li></ul><p><br><strong>Contents &amp; Overview</strong></p>    <p>This course will reveal to you a proven &amp; tested way to create a bestselling online course from scratch.</p><p> First, we’ll cover 4 fundamental principles to build a quality online course and get a competitive advantage. For instance, you’ll discover why it’s important to assume nothing when you create a course, and why you should create a great, not a perfect course. <br> <br> Next, I’ll reveal to you the system we used to create 35 bestselling courses in less than 5 months. You’ll learn how to study your competitors, how to evaluate their courses to make a superior product and an easy way to create a course outline, based on which you’ll record your course.</p>    <p>Last but not least, we’ll cover 5 hacks that will help you building your digital product faster. We’ll even provide you with our closely guarded course evaluation checklist to ensure an outstanding learning experience for your students! <br></p><p>By the time you complete the course, you’ll be equipped with all tools to create a course that sells in less than 2 days from now!</p>", 
    "end_date": null, 
    "title": "How To Create An Online Course That Sells", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786162_2875_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-online-course-that-sells/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T14:04:23Z"
}