{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Imagine being able to live wherever you want while earning a great income doing something you love.</strong><strong style=\"\"></strong>  </p>  <p>  \t  From the beaches of the tropics to the bustling cafes of Europe, it is very possible to earn a full time income writing for 15-20 hours a week.  </p>  <p>  \t<strong style=\"\"><em style=\"\">I know, I&#039;ve been doing it for over 3 years.</em></strong>  </p>  <p>  \t  In this course I&#039;m going to introduce you to the world of writing and I&#039;ll share with you my own experiences being a full time writer.  </p>  <p>  \t  Over this time I have worked as a freelance copywriter, article writer, and author. I&#039;ve done everything from print advertisements to sales letters to website copy.  </p>  <p>  \t<strong style=\"\">I&#039;ve also published 11 of my own books</strong> which now provide a significant passive income, and I&#039;ve also built a loyal audience through writing my own blog and newsletter.  </p>  <p>  \t  In fact, writing has funded the last 3 incredible years of my life during which time I&#039;ve lived all over the world...  </p>  <p>  \t  Including the tropical paradise of <strong style=\"\">Costa Rica</strong>, and literary destinations like <strong style=\"\">Italy</strong>, <strong style=\"\">Barcelona</strong>, <strong style=\"\">Prague</strong> and <strong style=\"\">New</strong> <strong style=\"\">York</strong>.  </p>  <p>  \t<strong style=\"\">I was inspired to create this course after working with aspiring writers and discovering how little knowledge they often had about the industry. </strong>  </p>  <p>  \t  Which might I add, is huge.  </p>  <p>  \t  Writing is essentially communication...which in a way is, well, everything. So this creates a tremendous opportunity for income, as well as a tremendous opportunity for confusion and mistakes.  </p>  <p>  \t<strong style=\"\">So where is the best place to start?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Is it better to write books for yourself, or articles for companies?</li>  \t<li style=\"\">If you&#039;re tight on cash, what&#039;s the best route to get started so you can support yourself? </li>  \t<li style=\"\">What kind of clients are best to work with?  \t<ul style=\"\">  \t\t<li style=\"\">Who pays the best? </li>  \t\t<li style=\"\">Who is the biggest pain in the ass?</li>  \t</ul>  \t</li>  </ul>  <p>  \t  There are all these different avenues to go down, all using essentially the same core skill: Your words.  </p>  <p>  \t  The unfortunate thing, at least for those who haven&#039;t found this course, is there is huge gap between the different opportunities.  </p>  <p>  \t  Some areas pay absolute garbage while offering little in the way of stability or satisfaction...  </p>  <p>  \t  Whereas other kinds of writing work can be really fun and fulfilling, while <strong style=\"\">paying upwards of a $100 dollars an hour. </strong>  </p>  <p>  \t  Similarly, some kinds of work is great to start with an allows you to jumpstart your career at $40-60 an hour...but then you risk getting stuck there.  </p>  <p>  \t  Whereas other areas are tough to get started, but once you do, the sky really is the limit in terms of income.  </p>  <p>  \t  Once you join you&#039;ll learn about each area of writing as an income opportunity. You&#039;ll learn about the kind of work you can do, and the kind of clients you&#039;d be working with.  </p>  <p>  \t  From here you&#039;ll be in a much better position to evaluate writing as a potential career for you, and, if you decide it is for you, you&#039;ll be in a great position to plan out your next 6-12 months.  </p>  <p>  \t  You&#039;ll have the knowledge you need from the start to bypass many of the hurdles and challenges facing new writers, and save yourself from wasting time and money.  </p>  <p>  \t<strong style=\"\">Once inside, here are some of the things you&#039;ll learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">You&#039;ll learn all the different kinds of work you can do as a writer, what kinds of companies you can work for, and what kind of money you can expect to earn. As I said earlier, there is a big difference in pay rates between different kinds of work, so this part is really important.</li>  \t<li style=\"\">You&#039;ll learn the basics of getting new clients and marketing. This course isn&#039;t focused on this area, but I&#039;ll teach you enough to get started and get your first 2-3 clients, and at least $1,000 in income so you can get a taste of what it feels like to write for a living. </li>  \t<li style=\"\">You&#039;ll learn about client management: The different ways you can be charging and how to bill. When should you charge by the word? The page? The hour? By the project?</li>  \t<li style=\"\">We&#039;ll take a look at ghostwriting. When is it better to writer under the clients name, and when should you insist on writing under your own name?</li>  \t<li style=\"\">You&#039;ll find out what your day to day life could, and perhaps should, look like when we go through lifestyle aspect of writing in terms of productivity and staying focused. You&#039;ll learn the best way set up your days to be a productive and successful writer.</li>  \t<li style=\"\">I&#039;ll also share with you some of my own insights into what makes a successful writer. <em style=\"\">Why do some writers seem to breeze along making 6-figures while others are just barely scraping by? What is the real reason for this difference and how can you be the kind of writer that prospers?</em></li>  </ul>  <p>  \t  There&#039;s a lot more, but I think by now you have a good idea about who I am and what this course is about.  </p>  <p>  \t  By the end of this course you&#039;ll have a much better understanding of what life is like as a writer, and all the opportunities available to you today to begin your career as a writer.  </p>  <p>  \t  By taking this course you&#039;ll <strong style=\"\"><em style=\"\">avoid making painful beginner mistakes</em></strong> like:  </p>  <ul style=\"\">  \t<li style=\"\">Charging too little money.</li>  \t<li style=\"\">Going through painful dry spells with no income.</li>  \t<li style=\"\">Working in the wrong area, or with the wrong kinds of clients.</li>  \t<li style=\"\">Doing work that kills your soul, when you could be getting paid better to do interesting work you actually enjoy!</li>  </ul>  <p>  \t<strong style=\"\"><em style=\"\">By the end of this training you&#039;ll be well on your way to being a professional writer. </em></strong>You&#039;re going to understand the industry, the opportunities, and around how much you should charge prospective clients for different kinds of work.  </p>  <p>  \t  You&#039;ll also know which areas are the most suited to your current situation, based on the income potential, income steadiness, and the ease in which you can get started.  </p>  <p>  \t  Watch a few of the free videos, or better yet, trust your instincts and join today.  </p>  <p>  \t  Remember, you&#039;re protected by a 30 day money back guarantee so if you join and decide after a few days that you really don&#039;t like me, or the content isn&#039;t for you, you can always get your money back.  </p>  <p>  \t  I think you&#039;ll find this course really inspiring and encouraging. It is something I&#039;m really passionate about, and I hope that comes through in the lessons.  </p>  <p>  \t  Oh, and one more thing. Once you&#039;re inside, feel free to ask lots of questions in the discussions. I&#039;m here to help and I do my best to provide individual feedback for everyone, based on your unique situation.  </p>  <p>  \t<strong style=\"\">Congratulations on taking the first step, and I look forward to seeing you inside. </strong>  </p>  <p>  \t  Dan Johnston.  </p>", 
    "end_date": null, 
    "title": "How To Become a Full Time, Well Paid Writer From Scratch", 
    "price": "35.00", 
    "instructors": "Dan Johnston", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402890_2d4f_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-earn-an-income-as-a-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T11:33:51Z"
}