{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Are you tired of spending countless hours and dollars on ways to create money that don&#039;t work? Are you looking for a way to <strong style=\"\">make some money on the side</strong> or maybe even to <strong style=\"\">substitute your full-time job</strong>? Stop spending your valuable time on things that don&#039;t work and start working with things that will actually make you money and save you time.  </p>  <p>  \t    If you know how to read and write and know what things of value are you can instantly start making money with this course. <strong style=\"\">YOU DO NOT NEED ANY PRIOR EXPERIENCE</strong> of making money on the internet and this course will help you know the foundation of making money on ebay.  </p>  <p>  \t    Some methods of making money simply don&#039;t work and so I&#039;m here to steer you in the right direction. Without good direction you can be lost like a paperbag flying away in the wind. I am here to act as the net and catch you and put you on to the road of success. I&#039;m here to serve as your guru or teacher and to get you back on to the path of success.  </p>  <p>  \t    With this course you will learn how to:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Start Making Profits Selling Your Items Quickly</strong></li>  \t<li style=\"\"><strong style=\"\">How to Make Money Online</strong></li>  \t<li style=\"\"><strong style=\"\">How to Start a Business </strong></li>  \t<li style=\"\"><strong style=\"\">Understand How to Make eBay Profit<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Evade CommonSeller Mistakes</strong></li>  \t<li style=\"\"><strong style=\"\">Ship Your Items Efficiently and Save Money</strong></li>  \t<li style=\"\"><strong style=\"\">Advice and Tips That Will Save Dear Dollars In The Future</strong></li>  \t<li style=\"\"><strong style=\"\">And More!!!</strong></li>  </ul>  <p>  \t    I would like to be your guru or mentor and put you on the road to success with ebay. I have<strong style=\"\"> more than 3 years of experience on eBay and know the in&#039;s and out&#039;s of business on ebay</strong>. I would like to give this valuable information to you that way you can start benefitting from it.  </p>  <p>  \t    This valuable information is <strong style=\"\">FREE</strong> and <strong style=\"\">Will Be Yours FOREVER</strong>. <strong style=\"\">So Please Sign Up Today</strong> by clicking on the<strong style=\"\"> Start Learning Now Link in the Right Corner</strong>.  </p>", 
    "end_date": null, 
    "title": "How to Start a Business on eBay 2.0", 
    "price": 0, 
    "instructors": "Daniel Lemieux", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/281906_48de_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-business-on-ebay/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-16T07:00:58Z"
}