{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The website I built while creating this course has now made me over $10,000 and generates around $3,000 per month.  Simply put, the process works and though i won't guarantee the same results, I'm confident the course will pay for itself if you follow along and do the things that I recommend.</p>\n\n<p><strong class=\"redactor-inline-converted\">What are people saying about this course?</strong></p>\n\n\n\n<p><em>Wow!</em><br></p>\n\n\n\n\n\n<p><em>\"I just got done with 2 sections of this course and the value is incredible. As a person who just started an authority site, Ron's explanations and expertise will help me rank better in the search engines. I had been using the Google Keyword Planner for my research and did not even know I was not being efficient. Thanks Ron ! Oh, the animated videos are an excellent and innovative touch.\"</em></p>\n\n\n\n\n\n<p><em>-Gertrude N.</em></p>\n\n\n\n\n\n<p><em>Everything you need to know about an Authority Website!</em></p>\n\n\n\n\n\n<p><em>\"This course doesn't hold back, it gives you everything you need in detail without getting confusing or wasting your time with filler content. After completing it I feel ready to dig in and get started on my new authority website.\"</em></p>\n\n\n\n\n\n<p><em>-Margaret S.</em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Who should take this course?</strong><br></p>\n\n\n\n\n\n<p>This course is for those that want to create their own website in a specific subject or topic that they are passionate about.  Otherwise known as an \"Authority Website\", this course is a great option for beginners because authority websites have a low startup cost and if done correctly, can continually generate income on a monthly basis.</p>\n\n\n\n\n\n<p>This course covers:</p>\n\n\n\n\n\n<ul><li>What you need to know before you begin</li><li>How to complete keyword research</li><li>How to complete competitive research</li><li>How to choose the right website domain and hosting plan</li><li>How to make your website look good on a budget</li><li>How to create get content and ways to get it seen</li><li>Next Steps to take to further your website</li></ul>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What went into producing this course?</strong><br></p>\n\n\n\n\n\n<p>In total, this course is about 4 hours of total content. This course took a tremendous amount of work and has a very high production value. There was a team of five people who worked a total of 130+ hours on this course.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is this course about?</strong></p>\n\n\n\n\n\n<p>Many people have tried to create authority websites before and failed.  This course aims to change that.  The curriculum is the exact process that I took to create my own successful authority website and can be considered a blueprint of what you should do too.  </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What kind of materials are included in this course?</strong></p>\n\n\n\n\n\n<p>This course has two different types of videos in the lectures.</p>\n\n\n\n\n\n<p>The first type of videos explain general concepts and uses animations and call-outs to illustrate key concepts.<br></p>\n\n\n\n\n\n<p>The second type of videos are screen recordings with call-outs that show you exactly what you need to know to use Google Analytics with your course.</p>\n\n\n\n\n\n<p>Every lecture also has audio transcripts and certain lectures include a PDF download to assist students in learning key concepts.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why take this course?</strong></p>\n\n\n\n\n\n<p>If you finally want a successful website that continually generates income on a monthly basis and have grown tired of listening to other people who have never actually created their own successful authority website, then this course is for you.<br><br></p>", 
    "end_date": null, 
    "title": "How to Create a Niche Website That's a Successful Business", 
    "price": "40.00", 
    "instructors": "Ron Stefanski", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615324_929c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-website-thats-a-successful-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T22:54:48Z"
}