{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   Learn how to quickly research a niche that you know you can make money in, quickly build a website in that niche, and sell that site for quick profit.  </p>  <p>  \t   Flipping websites is not a common thing that you hear about on daily basis in normal business circles. Those who do teach these concepts, teach old outdated methodologies that no longer work or will earn you minimum return on your investment.  </p>  <p>  \t   The blueprint that we layout in this course will walk you through the proper way to maximize the amount of money you can make with this strategy. Several hundred or even several thousand dollars can be made within a matter of days using these strategies.  </p>  <hr style=\"\">  <p>  \t Hey - I&#039;m Joe Fier, co-founder of one of the most successful and profitable web development and marketing firms online.  </p>  <p>  \t Register now by clicking on the “<strong style=\"\"><em style=\"\">Take This Course</em></strong>” button to begin learning a hidden little secret to our online profits.  </p>  <p>  \t With our site-flipping strategy, you will learn how to find where the money is, quickly create a relevant site in that niche, and bank awesome profits.  </p>  <p>  \t It’s fast, it’s amazingly simple, and it’s something that anyone with a computer and an internet connection can do. In fact, we’re going to demonstrate exactly how to have the majority of it done for you by other people.  </p>  <p>  \t This simple step-by-step formula will give you a new income-generating tool to add to your arsenal. With this knowledge you’ll have a straight-forward strategy that you can return to time and time again whenever you need some extra funds.  </p>  <p>  \t So click the “<strong style=\"\"><em style=\"\">Take This Course</em></strong>” button right now and we’ll get started teaching you this awesome and fun little technique.  </p>", 
    "end_date": null, 
    "title": "How To Flip A Website", 
    "price": "20.00", 
    "instructors": "Matt Wolfe, Joe Fier", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/79340_dee9_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-flip-a-website/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-16T00:02:03Z"
}