{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is an introductory course that teaches you how to use your language abilities to work for yourself. You will learn how to earn a living on your own terms, so you can work on projects of your choosing, and can still be available for life's moments. </p>\n\n<p><strong>Learn How To Earn A Living Working Independently Through Freelance Translation. </strong></p>\n\n\n\n<ul><li>Use your knowledge of languages to earn money</li><li>Learn how to become an independent translation professional</li><li>Find out how to work both yourself and for translation agencies, so you can get the best of both worlds</li><li>Become familiar with what agencies and clients look for, so you can be better positioned to get hired by them</li></ul>\n\n\n\n<p><strong>Learn to view your second language as a second degree</strong></p>\n\n\n\n<p>Your second language truly is worth just as much as another university degree. It is a skill that is in high demand, and that can earn you more money and a more comfortable life. This course aims to help you use this skill to its full potential.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>This course covers the preparation, how to be discovered by clients, as well as the translation process and, obviously, getting paid. Do you know where to find clients? How do you discern the useful clients from the wastes of time? How can you make sure they pick you as a translator? How will you get paid, and get paid on time? How can you avoid working for a pittance?</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Content Overview</strong><br></p>\n\n\n\n<p>This course is structured to serve as reference material, so you can get through the whole course in around one week, but, as your career progresses, you will probably want to go back for refreshers, so to see how various steps can apply to your new situation. </p>\n\n\n\n<p>Most of this course will be taught via videos, with some written notes and explanations for those wishing to go further in depth. </p>\n\n\n\n<p>By the end of this course, you will be able to use your knowledge of languages to earn your own money online. You will know what is important in working for yourself, how to make yourself employable to new clients, and how to retain them once they have chosen you.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><em><strong>The world is becoming increasingly global, while jobs are less and less secure, and the Internet is, by now, near universal. Combine all these factors, and you have a perfect storm of opportunity for people who speak more than one language.</strong></em></p>\n\n\n\n<p>You've learned your language, and this course concentrates on what to do next, so you can use your abilities to choose jobs and clients that interest you.</p>", 
    "end_date": null, 
    "title": "How to be a Successful Freelance Translator", 
    "price": "20.00", 
    "instructors": "Robert Gebhardt", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/586186_ae68_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-successful-freelance-translator/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T09:46:07Z"
}