{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>==The course is ON SALE for a limited period of time!==</strong></p><p><strong></strong><strong>JOIN to learn how to Growthhack your blog, attract 1000+ readers and earn reputation of an Expert!</strong></p><ul><li>Would you like to earn for a living writing for a blog? </li><li>Would you like to be famous for your articles? </li><li>Would you like to attract first 1000 subscribers?</li></ul><p>You need to <strong>Growth Hack your Blog</strong>, using technics that allowed best tech companies to score millions.</p><p>And it is never late to <strong>learn from the best</strong>!</p><p>In this course we will learn technics used by three extremely popular bloggers of out times to become popular, attract readers and growth hack their way to the bloggers' Olymp. </p><p><strong>Leo Babauta</strong>, <strong>Oliver Emberton</strong> and <strong>Tim Ferri</strong><strong>s</strong> shared their secrets of growing. I analysed them, picked the very best and showed you how to use them to the advantage of your blog. </p><p><strong>With this course you will be able to:</strong></p><ul><li><strong>Make your blog profitable</strong> without spending a single penny (cent? yuan? whatever) for promotion</li><li>Learn from the best bloggers and use their <strong>technics to grow your audience</strong></li><li>Get <strong>1000+ subscribers </strong>and make a good start for much more</li><li><strong>Become an expert</strong> in your field and show people that you can be trusted</li><li><strong>Become a better writer</strong>. And this is priceless</li></ul><p>If you are new to blogging, then the course is for you. </p><p>If you blog for some time but would like to make it better and attract more readers - this course if also for you. </p><p>If you only think about writing and publishing online - come join us and see for yourself that this is something worth doing!</p>", 
    "end_date": null, 
    "title": "How to Grow your Blog to Get first 1k Subscribers", 
    "price": "20.00", 
    "instructors": "Mark Marchenko", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479630_2200_4.jpg", 
    "course_url": "https://www.udemy.com/growth-hack-your-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T09:16:10Z"
}