{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>[February 14th 2016 UPDATE: <strong><em>FREE channel consultation NOW</em></strong> available for first 100 students to complete course THIS WEEK! <strong>25 spots left@19:36 EST</strong>]</p><p><em>--<strong>I earn while I sleep</strong> &amp; you can too! It will take HARD work &amp; dedication but I can guide you &amp; you WILL see results</em><em>-</em>-<br></p><p>What could you do with <strong>an extra $14,000</strong> considering the money you make now is probably enough to cover all your expenses? Go to Italy or Hawaii? A down payment on a new house or your dream car? Well you can make this money and possibly much more and I can show you how! I made $14,000 in my SPARE time while working a demanding high level corporate job. What could YOU do in your spare time?<br><br>I run over 15 YouTube channels and have been on YouTube for over 10 years. What started as a hobby, turned into a source of real cash that a lot of people could really use. <strong>I've made over $2400 on just ONE video</strong> that took me about 4 hours total time to make. I have many videos that ranked #1 in search and with views from 300,000-700,000 on single videos. Over 14 MILLION people have watched my videos.</p>This course is the result of not just me simply being on YouTube for 10 years but hours and hours of extensive research and analysis. I've analyzed many channels and many things about YouTube. I've shoot videos at YouTube's studios. I've also been part of Google product research efforts. I will show you all the good, bad and ugly about YouTube. I'll cover things like:<p><br><br></p><ol><li>How I rank high in search</li><li>How I get a quarter of a million in views on my videos</li><li>How I outranked a major global automotive company who likely spends millions in advertising</li><li>I'll show you test cases and reveal the secret to how some channels experienced explosive growth in short order</li><li>How to get brand deals where you can get checks from $50-$5000 or MUCH more just for mentioning or reviewing a product</li><li>How to get subscribers fast</li><li>How to get noticed</li><li>How to cross promote</li><li>How to avoid scary pitfalls like getting your channel deleted over night with no warning</li><li>I'll also reveal YouTube's dark secrets and trust me, it's soap opera level drama and you need to be aware of it. It's not all flowers and everything nice on YouTube<br>11. How to get free trips and other perks<br><br>In my course<strong> I will be showing you the real data that nobody will show you, like exactly how much I make</strong>. I'll also show you how much other YouTubers are making and dispel popular myths about pay. We will be looking at a lot of stats.</li></ol><p><br><br></p><p><br></p><p><br><br><br><br></p>", 
    "end_date": null, 
    "title": "How to Launch and Maintain a Successful YouTube Channel", 
    "price": "20.00", 
    "instructors": "Carlyle Frank", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746028_bd65_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-launch-and-maintain-a-successful-youtube-channel/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-29T16:15:08Z"
}