{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul>  \t<p>  \t\t<strong><strong><strong><strong>**This course is completely updated and tailored to help you achieve great results in 2016! Let's make this year a great one guys**</strong></strong></strong></strong></p><p><strong><strong> </strong></strong>I will offer Skype support to every student who asks for it. If you have a problem/question, send me a private message and we will set a time for the call.  \t</p>  \t<p>  \t\t<strong><em><strong>-----------------------------------------------------------------------------------------------------------</strong></em></strong>  \t</p>  \t<p>  \t\t<strong><strong>Would you like to learn how to create an instantly profitable information-selling business, that generates income day-in and day-out ?</strong></strong>  \t</p>  \t<p>  \t\t                         Would you like to finally start making real money from the comfort of your home ?  \t</p>  \t<p>  \t\t                         Can you follow the easy instructions I will lay down for you in order to setup your very own cashcow business that will pay for years to come ?  \t</p>  \t<p>  \t\t                         If you answered « yes » to any of the questions above, congratulations. You are already on your way to financial freedom.  \t</p>  \t<ul>  \t\t<p>  \t\t\t<strong><strong>Let me help you !</strong></strong>  \t\t</p>  \t\t<p>  \t\t\t                         In this course,<strong><strong>I will teach and DEMONSTRATE every step of the process from easily creating your very first valuable digital product, to witnessing your first PayPal deposit.</strong></strong>  \t\t</p>  \t\t<p>  \t\t\t                         The internet doesn't care who you are: If it worked for me, it will work for you, regardless of where you live.  \t\t</p>  \t\t<p>  \t\t\t                         Now I can already hear you say :  \t\t</p>  \t\t<p>  \t\t\t                         « Howard, I don't think I have anything valuable to teach »  \t\t</p>  \t\t<p>  \t\t\t                         If that's how you think, then think again. I personally believe every person has something that others are looking for. From a hobby to an advanced skillset, we all posess knowledge that is in high-demand. And there is no better place to sell this knowledge than through the internet.  \t\t</p>  \t\t<li> Do you need/want more money?</li>  \t\t<li> Do you want to quit your job ?</li>  \t\t<li> Do you need money to catch up on your bills ?</li>  \t\t<li> Do you want to own a business that you can be proud of?  \t\t  \t\t\t                         If you answered « yes » to <em>these </em>questions, <strong><strong>then consider this course to be your blueprint to success.</strong></strong>  \t\t  \t\t  \t\t\t<strong>This course is tailored to every student. We will discuss, and demonstrate different ways you can go about the information contained in this course.</strong>  \t\t  \t\t  \t\t\t<strong>You will choose to either create your own product and sell it, to resell pre-made quality products, or to teach on Udemy. Every path comes with step-by-step instructions.</strong>  \t\t  \t\t  \t\t\t                         Upon enrolling, you will get my personal help. I will answer any question that you may have in the member area, and I also offer Skype support if needed.  \t\t  \t\t  \t\t\t<strong>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund.</strong><strong><strong> You take absolutely no risk !</strong></strong>  \t\t  \t\t  \t\t\t                         You can get started right after you have taken my course -That means <strong><em><strong>TODAY!</strong></em></strong>  \t\t  \t\t  \t\t\t                         This is opportunity knocking on your door. Many have succeeded before, and I have too.  \t\t  \t\t  \t\t\t                         Click the \"Take This Course\" button now. That's your first step to building a solid online income. Every minute that goes by without action is <strong><strong>one less paycheck</strong></strong>.  \t\t  \t\t  \t\t\t                         Cheers!  \t\t  \t\t  \t\t\t                         Howard  \t\t  \t\t</li>  \t</ul>  </ul>", 
    "end_date": null, 
    "title": "How to Create & Sell Digital Products Online for Beginners", 
    "price": "25.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362210_77e5_7.jpg", 
    "course_url": "https://www.udemy.com/create-and-sell-your-first-digital-product-a-complete-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T12:03:46Z"
}