{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">The  ShoeMoney System: How to Make Easy Money Fast Online will take you though nine  modules teaching you the essentials of online marketing and how to better your  small business by building a presence online. Our videos will take you  through a simple step by step instructions on what you need to do as well as  inform you on terms that you may not be familiar with. </p>    <p style=\"\">Our  How to Make Easy Money Fast Online course includes:</p>    <p style=\"\"><strong style=\"\">-Getting Started:</strong>  Get your mind right and teach you some of the Internet basics before we begin.</p>    <p style=\"\"><strong style=\"\">-Making Big Money  with Arbitrage:</strong> Setting up a PayPal account and start making money on eBay.</p>    <p style=\"\"><strong style=\"\">-Affiliate Marketing:</strong>  What affiliate marking is and tips on how to make money using it.</p>    <p style=\"\"><strong style=\"\">-Making Money with  Facebook:</strong> Step by step on creating a Facebook fan page and advertising on  Facebook.</p>    <p style=\"\"><strong style=\"\">-Building Your Brand:</strong>  Finding people to create your company logo for cheap and using the one you like  best.</p>    <p style=\"\"><strong style=\"\">-List Building:</strong>  Why building up a list of customer’s emails is important and what to do with  them once you have them.</p>    <p style=\"\"><strong style=\"\">-Local Affiliate  Marketing:</strong> How to make money in your own neighborhood.</p>    <p style=\"\"><strong style=\"\">-Building your Own  Product:</strong> Building a website for your company/product.</p>    <p style=\"\"><strong style=\"\">-Search Engine  Optimization:</strong> Tips on how to rank higher on search engines such as Google  and Bing. </p>    <p style=\"\">Take  this ultimate ShoeMoney System course now and learn how to make easy money fast  online.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "How To Work Online With Arbitrage, Affiliates, and More", 
    "price": "20.00", 
    "instructors": "Jeremy Schoemaker", 
    "commitment": "19 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15892_40c4_6.jpg", 
    "course_url": "https://www.udemy.com/the-shoemoney-system/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-03T19:53:50Z"
}