{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Up to Date as at: 9 February 2016.</strong></p><p><strong>This course is for WordPress website owners only.</strong></p><p><strong>Welcome to the \"How much is good ranking keywords worth to your website?\" Course.</strong></p><p>This multiple keyword ranking course, will show you EXACTLY how I run my Google Keyword Ranking and SEO business. It is a step by step course showing you the processes and systems I have used to develop my Affiliate income form Google Rich Keywords that will rank in less than 30 days</p><ol><li>Let you know which keywords are ranking for your site</li><li>Which keywords unique visitors use to land on your site</li><li>from which country do these visitors come</li><li>How to define a Google Rich Keyword</li></ol><p>We have included links to 2 important FREE WP Plugins as well as provide you with 2 important plugins we had developed to improve you experience.</p><p>The course is about 60 min long and we will add Case Studies on a regular bases.</p><ul><li>Your FREE WP Auto Keyword Ranker Plugin Dev License is included in this course</li></ul><p><strong><br></strong></p><p><strong>I Want You to Be Successful</strong></p><p>I very much enjoy hearing from my students and I welcome you reaching out to me with questions, discussions and private messages. I always do my best to answer questions as soon as I see them. I love helping you and I am passionately committed to your success.</p><p><strong>No Risk - No Quibble Money Back Guarantee</strong></p><p><em>Udemy provides a 100% 30 day money back guarantee which I fully endorse. You can take this course today and if it does not deliver for you - get a complete refund. This is more than just a guarantee, this is my commitment to your success....which is why I have thousands of Udemy students in my courses.</em></p><p><strong>What You Should Do NOW!</strong></p><p>Enroll in this Course Now, before you miss the opportunity and discover how easy it is to increase your website ranking in this Udemy Courses. Enroll today!</p>", 
    "end_date": null, 
    "title": "How much is good ranking keywords worth to your WP website?", 
    "price": "20.00", 
    "instructors": "Philip Viljoen, Cyril Gupta, Clive McGonigal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448592_3498_4.jpg", 
    "course_url": "https://www.udemy.com/which-keywords-are-your-sites-ranking-for-know-google-keyword-ranking/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T15:00:14Z"
}