{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">This is a 90-minute course, broken into 10 lectures. There are  4 accompanying PDF’s full of resources for your use to create your multiple streams of income.</p>  <p style=\"\">You will learn which of your ideas, experiences and opinions  have merit and can easily be transformed into   a  residual  income opportunity for you. You’ll learn how close Insta-Cash really is and how to tap into  it. </p>  <p style=\"\">After you go through the Idea Fest and Insta-Cash lectures, you’ll see the potential profit centers that you can tap into. Using  your Self-Inventory information, you’ll be able to identify the things that  you can do to start flowing more money to you instantly. </p>  <p style=\"\">Side note: Our video editor, just doing some fact checking while publishing this course for us,  ended up making over $200 by following one lead. It’s just that easy...</p>  <p style=\"\">EJ Thornton &amp; John Clark Craig have written dozens of  books between them and helped hundreds of authors realize their dreams. After  teaching those authors how to capitalize on the income streams that are  generated from having a book project, they realized that you don’t have to have  a book project to capitalize on this money. You just have to have an idea.  Using their real-life experience as a case study, they demonstrate how quickly  and easily anyone can start creating their own new paychecks. They then ask you  to compare your life experiences with their’s, so that you realize how much you  have to offer this world. Then they give you the tools to start mining your own  money. </p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "How to Bring the Right Business Ideas to Life ", 
    "price": "20.00", 
    "instructors": "Ej Thornton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23231_d2d4_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-bring-the-right-business-ideas-to-life/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-20T03:58:03Z"
}