{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn Skills &amp; Power Your Successful Freelance Business or Startup</strong></p><p>Free yourself to grow a meaningful business doing what you love as a solo entrepreneur or freelancer. Tailored to the needs of creative people, developers, and consultants, this course includes real, guides on customer contracts, drafting proposals, business planning, and more, and interviews with already-successful freelancers working in design, web development, and consulting.</p><p><strong>This course will guide to in how to freelance full-time and enjoy benefits like:</strong></p><ul><li>Earning nearly 150% higher than regular full-time workers</li><li>Working from home or private office</li><li>Working closer to your loved ones</li><li>Working with maximum flexibility</li><li>Traveling around the world as much as you need.</li><li>Serving clients from all around the world</li><li><em>and much more...</em></li></ul><p>Wouldn't you rather work whenever you want, where ever you want, and still make more then you do at your dead end job?<br></p><p>Better still, how about making a legitimate, idiot-proof, scalable business that generates autopilot, hands-off cash whilst you live the life of your dreams?</p><p>Have I got your attention now?</p><p>I have excellent news for you, YOUR PAIN STOPS HERE!</p><p>I walk you through exactly what I did to start a freelance business earning an easy $8000, and then how to take yourself out of the business, automating it so you can spend your time actually enjoying life, instead of slaving away for cash!</p><p>If you are looking for a get rich quick scheme - DO NOT take this course. This course is for serious people who want to put in the work it takes to start a business.</p><p>This unique course won't teach you how to become an overnight millionaire, or even allow you to quit your job in a week. What it will show you are <em>tangible, actionable steps to starting your own Sustainable, Scalable freelance business</em>, that I have personally validated through copious amounts of my own time and money, revealing all of the strategies I've learned in order to save you the countless hours lost, dollars lost, and failures made in order to succeed.</p><p>This step-by-step course covering everything you need to know to create any sort of freelance business, and then should you wish, to start hiring employees for that business so that you get paid more and more, for less and less work!</p><p>Nothing is left out – I tell you everything.</p><p>I walk you through the exact steps I followed to success, dropping anything out that didn't lead there.</p><p>I am personally here to provide support after purchase, have a question? I will answer it as soon as I can.</p><p>Hopping on the next plane to anywhere with an Internet connection, able to work a couple of hours a day and then DO WHAT EVER YOU WANT FOR THE REST OF THE DAY! Trust me, it's great fun!!</p><p>I know, I know, you're wondering if this is even possible?</p><p>I will show you EXACTLY how to achieve all of this:</p><p>- Produce professional quality videos with ZERO money invested, no fancy cameras or sound equipment needed!</p><p>- SUCCESSFULLY employ freelancers to take your job, and managers to look after those freelancers, and then get paid on autopilot as they do the work!</p><p>- Finally, I cover a method to get all of these results, by learning ZERO skills, and working next to no time, (it's something you can get started with right now!).</p><p>I can't wait to hear about your Freelance Success!</p>", 
    "end_date": null, 
    "title": "How To Start a Successful Freelance Business or Startup", 
    "price": "20.00", 
    "instructors": "Jaymin Shah", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480150_0dc0_4.jpg", 
    "course_url": "https://www.udemy.com/start-a-freelance-design-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-19T04:57:00Z"
}