{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    The target audience for this course are virtual assistants, virtual personal assistants and others who already work with business owners in a business-to-business capacity (whether its remotely or on-site). If, however, you don&#039;t have any entrepreneurial or business experience - that is still OK because this course covers mindset and how business owners think.  </p>  <p>  \t    The course is about how to start a telephone / call answering service and what related services you can also offer. It covers the advantages of starting this type of business, how to run this type of business and how to grow it. We cover the financials that can be expected from running this type of business - both price list for the service and profit projections.  </p>  <p>  \t    The materials included are a 69-page e-book to print and follow.  </p>  <p>  \t    The course will take approx 1-2 hours to complete. The course is structured as a series of lectures, which you follow and implement. It shows you step-by-step how to start and what to do.  </p>  <p>  \t    This course is ideal if you are interested in started a telephone answering service business, working from home. It is flexible, it doesn&#039;t have to be run as a full time business. You are not expected to employ the receptionists yourself, you don&#039;t need to buy, rent or lease the expensive equipment and systems - the course shows you how you can get started with minimal fuss and cost.  </p>  <p>  \t    The lecturer herself has been running a thriving call answering service for the past 5 years and has written the book <strong>How To Start And Run A Telephone Answering Service</strong> which you get a copy of, as part of this course.  </p>  <p>  \t    If 2015 is the year that you want to make a change, add an additional income stream to your life, start a new business and be successful, enroll on this course!  </p>  <p>  \tThe goal of this course is to start a telephone answering service business from home.  </p>", 
    "end_date": null, 
    "title": "How To Start & Run A UK Telephone Answering Service Business", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371822_4393_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-and-run-a-telephone-answering-service-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T22:19:35Z"
}