{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em>Join over 2300 students who have left several 5 star reviews!</em></p>\n\n<hr>\n\n\n\n\n\n\n\n<p><strong>\"I really enjoyed this course.  </strong>At first, it feels like it's going to be just another \"Here's how you post your stuff on Amazon, iTunes, etc.\"  But it really goes past that into the methodologies and thinking behind creating digital products that people will love.  Great quality, conversational style.<strong>\" </strong>- Taylor Gulley<br></p>\n\n\n\n\n\n\n\n<hr>\n\n\n\n\n\n\n\n<p>  \t                                           Creating digital products is a great way to earn an income online.  </p>\n\n\n\n\n\n\n\n<p>  \t                                            Although it does take work, it's one of the most effective ways to break free from the corporate world.  </p>\n\n\n\n\n\n\n\n<p>  \t                                            This course will show you exactly how to create a product of your very own.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Common fears people face include:</strong>  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Not knowing how to make a video</li>  \t<li>Thinking they can't write an ebook</li>  \t<li>Being oblivious about creating audio products</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t                                            It's time to end those fears, once and for all.  </p>\n\n\n\n\n\n\n\n<p>  \t                                            I'll also use my 7+ years experience as a video creator to show you simple tweaks that will make your videos stand out.  You don't even have to appear on camera!  </p>\n\n\n\n\n\n\n\n<p>  \t                                            We'll also cover <strong class=\"redactor-inline-converted\">step-by-step</strong> how to create your own ebooks. I'll even provide you with an easy-to-follow template you can use.  </p>\n\n\n\n\n\n\n\n<p>  \t                                            Simply replace my information with yours, and you'll be one step closer to success.  To sweeten the deal, the template will also be updated over time.  </p>\n\n\n\n\n\n\n\n<p>  \t                                            In addition to that, I'll show you how to make an audio-only product, simply and easily.  </p>\n\n\n\n\n\n\n\n<p>  \t<em>Please note</em>, this is <strong class=\"redactor-inline-converted\">not</strong> a \"get rich quick\" method, although it can certainly pave the path to financial wealth.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                  Furthermore, this course is updated often with additional lectures and bonuses - at no extra cost to you!  Once you become a student, you have lifetime access to all future updates for free!  </p>\n\n\n\n\n\n\n\n<p>  \t                                            You even have a <strong class=\"redactor-inline-converted\">30 Day Money Back Guarantee</strong> with no questions asked.  </p>\n\n\n\n\n\n\n\n<p>  \t                                            Every minute you delay puts you another minute further from success.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                  Find out how to work smarter, rather than harder.  </p>", 
    "end_date": null, 
    "title": "How to Create Quality Digital Products for Long-Term Success", 
    "price": "20.00", 
    "instructors": "Clif Burrell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346978_161a.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-digital-products/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T03:55:21Z"
}