{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course shows you how to build your own online store with the objective of making at least $60K in profit annually. For many people, this store can replace your current income. It can provide flexibility in your schedule and freedom from the gridlock and other problems that most people face when they are working regular 9-5 types of jobs.</p><p style=\"\">This course takes a hands-on approach. It is expected that you will follow along and complete the assignments that are given to you so that you can see your store come to life. It is expected that by the time you finish the assignments in this course, you will have a store that is on its way to netting you an income of $60K.</p><p style=\"\">I will use a few examples of stores I&#039;m currently building (Custom Vinyl Decor and Online Safety Depot) from the ground up so that you can see the progress I&#039;m making and motivate yourself to follow the formula.</p><p style=\"\">Here are some of the topics you will learn about as you build your $60K store:</p><ul style=\"\"><li>How to set up a business entity</li><li>Determining what products to sell</li><li>Setting up dealer accounts</li><li>Setting up hosting for your website</li><li>Setting up a shopping cart system</li><li>Getting a merchant account</li><li>Publishing products on your store</li><li>Driving traffic to your store through search engine optimization (SEO) and social media</li><li>Fulfilling orders for your customers</li></ul><p style=\"\">This course is made up of instructions and assignments that make use of those instructions.</p><p style=\"\">In order to succeed in this course, you&#039;ll need a strong desire to learn.  It also is useful to know a few things about some of the following topics, but they&#039;re not absolutely necessary. If you don&#039;t already know these things, I&#039;ll provide you with the resources to learn what you need to know:</p><ul style=\"\"><li>Getting around on a computer and on the internet</li><li>SEO</li><li>Social media: Twitter, Pinterest, LinkedIn, Google+, Facebook, etc.</li><li>Writing</li><li>Link building</li><li>Web design</li></ul><p style=\"\">Some of these things can also be outsourced, and I&#039;ll show you how to do that as well.</p><p style=\"\">Good luck on the course.</p>", 
    "end_date": null, 
    "title": "How to Build a Profitable Ecommerce Drop-Shipping Store", 
    "price": "25.00", 
    "instructors": "Richard Robbins", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444470_8cb0_4.jpg", 
    "course_url": "https://www.udemy.com/build-a-60k-annual-profit-online-store/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T05:33:49Z"
}