{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>FLIPPA - Make Money Online selling websites</strong><strong></strong></p><p>  Everyone that enrolls in this course during November and December of 2015 will receive free Coupons to my courses (still under development) about SEO, Keyword research, Quality content and Backlinks during 2016. </p><p>___________________________________________________________________</p><p>With This Flippa course you will learn everything you need to know from building a website (with wordpress) and all steps you need to focus on: how to monetize the website, the right content, backlinks and everything you need to know about<strong> Flippa </strong>- we will look inside the website and check how things work around there. I focus on Flippa because I sold about 10/15 websites with them and made more than $10 000 in 3 months. You can use what you learn to:</p>  <p>  \t      Make a extra cash flipping and <strong>selling websites</strong>. so you can <strong>Work from Home</strong>, like me! </p>  <p>  \t      Make the best and most profitable Auction on <strong>Flippa</strong>  </p>  <p>  \tI am going to cover in this course all about established blog flipping, that's number one. There will be topics such as traffic, conversions, etc which will be universal i.e. you can apply them in any kind of website you flip, not just blogs and on any Flipping Market, not just Flippa.  </p>  <p>  \t    This course have lessons with powerpoints and Videos explaining the Flipping process and how Flippa Works. I Will talk about my experience with real examples. Because I am not an English Native (but have a very sexy accent...or not...) all Lectures have a downloaded PDF with all the information I say, all writen below each slide!  </p>  <p>  \t    <strong>In the end of this course you will be able to start selling websites like a Pro!</strong>  </p>", 
    "end_date": null, 
    "title": "How to Create an Online Business with Flippa", 
    "price": "20.00", 
    "instructors": "C Line", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333760_b26a_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-online-business-with-flippa/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T00:55:54Z"
}