{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Start building the life you would like to live and become an eBay entrepreneur.</strong>  </p>  <p style=\"\">  \tNot only will you discover the steps needed to start your own eBay business, but you’ll also get have a great understanding on where to buy inventory and what to sell.  </p>  <p style=\"\">  \tAs we go through this course, you’ll have the chance to see step by step instructions on basic eBay tasks and then dive into more advanced topics. You will be able to watch me as I guide you through each lesson, and pause to complete each new task. Since we will cover each stage of setting up your eBay business, by the time you are done with the training, you will be set up to start making sales right away.  </p>  <p style=\"\">  \tThousands of students have gone through the face to face version of this course, but this is the first time it’s offered on Udemy as a virtual class.  </p>  <p style=\"\">  \tThis training will take you through 16 video modules, showing you exactly how to set up an eBay business. This training will guide you, starting with the eBay basics and then strategically moves into more advanced topics. This course also comes with a top selling eBay eBook titled, \"The Keys to a Successful Business\" which will showcase where you can find items to sell, and more importantly, what to sell.  </p>  <ol style=\"\">  \t<li style=\"\">All of the video lectures and eBooks are download enabled, so you are able to take this with you on your laptop, smartphone or other portable devices.</li>  </ol>  <ol style=\"\">  \t<li style=\"\">You will get over 2 hours of video content along with a companion eBook.</li>  </ol>  <p style=\"\">  \t<strong style=\"\">Are you ready to take control of your destiny and be in control of the amount of money you make? If so, sign up for this training today and make the change you’ve been looking for.</strong>  </p>", 
    "end_date": null, 
    "title": "How to Start a Successful eBay Business", 
    "price": "20.00", 
    "instructors": "Tristen OBrien", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164576_f102_2.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-creating-ebay-business-right-away/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-15T02:12:48Z"
}