{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><u>Course fully updated for June 2016</u><strong></strong></p>\n\n<p>Over 1,600 HAPPY STUDENTS SO FAR!!!</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Learn how I make my fortune in the stock market!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>What if you could buy any stock you want, and never have to worry about losing money on that stock? What if you could win 100% of your stock trades? Even if the stock price drops to zero, you could immediately turn around and sell your shares at the exact price you bought them at.  There is a guaranteed way to do this, but surprisingly very few people know the secret.  I'm not talking about using stop-loss orders, because these don't always work.  Stocks can \"gap down\" past your stop-loss order, resulting in your order being filled at a much lower price.  Other times, the stock price can move so fast, your stop-loss order doesn't get filled and you end up suffering more losses than you had initially planned. </p>\n\n\n\n\n\n\n\n\n\n<p> In this course, I will show you why you need to stop using stop-loss orders for your stocks, and how to make much more money with much less risk, starting today!  Plus, I will teach you how to turn a losing trade into a winner with very little effort.</p>\n\n\n\n\n\n\n\n\n\n<p>Enroll in the course NOW so you can start making money right away! Every minute you wait is money you could have been putting in your pocket.</p>\n\n\n\n\n\n\n\n\n\n<p>You also get unlimited email access to ask me any questions along the way, in addition to all future course updates. </p>\n\n\n\n\n\n\n\n\n\n<p>If you're not completely convinced that this is the best way to make a fortune in the markets, you are entitled to a no-questions-asked 30 day 100% money-back guarantee. </p>", 
    "end_date": null, 
    "title": "How to Never Lose a Stock Trade - Ever", 
    "price": "25.00", 
    "instructors": "Jeff Tompkins", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450694_4033_4.jpg", 
    "course_url": "https://www.udemy.com/stocktrading/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T22:59:01Z"
}