{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you sick of your boring job?</p><p>Do you want to take charge of your career by starting your own business?</p><p>Have you tried some of these get rich quick programs only to lose steam?</p><p>If you have answered yes it is time to click the take this course now button.</p><p>You are a prime candidate to start a company of your own and determine how much money you are going to make each month. I will show you how to get started with zero start up costs.</p><p>All you need is a laptop and the willingness to take action.</p><p>If you are not interested in making a change don&#039;t bother taking this course.</p><p>I will guide my students step by step through starting a company to provide voice over IP services to businesses. The time is now for voice over IP, many legacy providers are forcing their clients off their traditional phones lines because they do not want to support it any longer.</p><p>This is your chance to move in and help clients make the transition from legacy products to the new world of voice over IP.</p><p>In my course you will learn how to build a working PBX, setup IP phones and connect it to SIP carrier services. </p><p>You will also learn about free tools on the internet to automate billing and invoicing for your clients. Included in this is the capability of taking credit cards all for free without any monthly costs.</p><p>Click the take this course button to get started.</p>", 
    "end_date": null, 
    "title": "How to Start a Home Voip Business & Quit Your Job in 90 days", 
    "price": "25.00", 
    "instructors": "Jon Manning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424302_28fe_2.jpg", 
    "course_url": "https://www.udemy.com/start-a-business-selling-providing-voip-to-clients/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T21:32:32Z"
}