{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">STUDENT REVIEW FOR \"Udemy Course Creation - Easy Video Audio &amp; Ebook Creation\":</strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"Fantastic information - </em></strong><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">As a new instructor, this information is invaluable. Dave's advice is backed by knowledge based on his 32 (and counting) courses published on Udemy. We are going to be implementing much of his advice on future courses and can see some tweaks we need to make on our current course. Thanks, Dave.\"</em> - Ian Usher</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Want to learn how to quickly create your Udemy course...</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">From a Udemy instructor who has published 32 Udemy courses?</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"This course is not sponsored by or affiliated with Udemy, Inc.\" (disclaimer required by Udemy) </em>Over the last 16 years, I've developed a super-simple way to create \"how-to\" videos, audios and ebooks and I now apply these strategies to my Udemy course creation process. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">For a new Udemy instructor, the Udemy course creation process can seem like an impossible task, right?</strong><br></p>\n\n\n\n<p>There are so many things to learn, for example:</p>\n\n\n\n<ul><li>What is the best microphone to use so that Udemy approves of the sound quality?</li><li>What is the best way to record my screen and create screencast videos, preferably a way that is cost-efficient, not too techie (easy to use) while also giving great video and audio that Udemy will approve?</li><li>What is the easiest way to record audio for use in my Udemy courses?</li><li>How can I easily add PDF course elements to my Udemy course so as to add variety of lectures and additional helpful tools for my Udemy students?</li><li>What would be the best way to record live, \"face-to-camera\" videos for my Udemy course?</li></ul>\n\n\n\n<p>These are all common questions that new Udemy instructors have and all of them are answered (in great detail) in this course.</p>\n\n\n\n<p>But the Udemy course creation process does not have to be difficult, painful or exasperating!</p>\n\n\n\n<p>I've been teaching online for over 15 years and I've discovered &amp; developed these amazing, proven ways to create the various course elements you'll learn to create in this course!</p>\n\n\n\n<p>As a result of having these course creation strategies, I've published 25 Udemy courses to date!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Not only will you get answers to how to create course elements, but you will be walked, step-by-step, through the actual creation of:</strong></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Udemy course Screencast Videos (You'll get a demonstration of the best and most cost efficient way to record your screen - one of the best and easiest ways to product your Udemy courses!)</strong></li><li><strong class=\"redactor-inline-converted\">Udemy course Live Videos (You'll learn about the preferred camera and cost efficient solutions)</strong></li><li><strong class=\"redactor-inline-converted\">Udemy course Audios (You'll see demonstrations of 3 ways to get high-quality audio for your courses)</strong></li><li><strong class=\"redactor-inline-converted\">Udemy course eBooks / PDFs (You'll get demonstrations of 2 ways you can easily create PDFs for your courses)</strong></li></ul>\n\n\n\n<p> You see, although Udemy requires that at least 60% of your course be in video format, (and screencast video is great for this) the Udemy review team also wants you to add in a variety of different lecture formats (such as audio, text, PDF) to your Udemy courses.</p>\n\n\n\n<p>This Udemy course will walk you through the process - through real-world demos!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">It will be as if you are looking over my shoulder, watching me create various course elements, in the simplest, easiest ways possible!</em></strong></p>\n\n\n\n<p>You'll also learn the most cost effective (cheap!) ways to get your courses created - methods that do NOT sacrifice quality and in fact, methods that have proven to get me 5 star reviews across 32 courses!</p>\n\n\n\n<p>Enroll today at no risk and in complete confidence - because your enrollment is covered by Udemy's 30-day, no-questions-asked, money-back guarantee!</p>\n\n\n\n<p>Discover how to easily create your Udemy course lectures in Screencast video format, webcam video format, audio format or PDF format, today!  </p>", 
    "end_date": null, 
    "title": "How To Easily Create Online Course Videos Udemy -Unofficial", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451950_3ff3_3.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-creation-easily-create-videos-audios-pdfs/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T04:36:47Z"
}