{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\"> &quot;OVER 590,000 PEOPLE HAVE TAKEN <a href=\"https://www.youtube.com/watch?v=8_lNi4BFlrg\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"></a>PART 1 of THIS COURSE ON YOU-TUBE </em>  </p>  <ul style=\"\">  </ul>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">IN JUST SIX DAYS OVER 740 STUDENTS ON UDEMY</strong></em>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t  The job market is becoming extremely insecure these days. Large companies are shedding employees and you may be thinking you&#039;re the next to go. You need extra income and you do not want to travel and be stuck in traffic all day to earn that extra money. You may be tired of office politics and your boss and want to have more time with your family, working flexible hours.  </p>  <p style=\"\">  \t  So, you&#039;re thinking of starting your own business working from home. But here is the dreadful statistics: 8 out of 10 small businesses fail within the first year. Why is that so?  Well, here are some main reasons for failure:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  1.Lack of understanding how to run a business  \t</p>  \t<p style=\"\">  \t\t  2.Bad business idea in the first place  \t</p>  \t<p style=\"\">  \t\t  3.The business is not based on your passion, so you quickly lose interest  \t</p>  \t<p style=\"\">  \t\t  4.Invested too much money to start a business and can&#039;t pay it back  \t</p>  \t<p style=\"\">  \t\t  5.Not up-to-date with the latest technologies (such as Internet marketing )  \t</p>  \t<p style=\"\">  \t\t  6. Lack of clear and concise business plan  \t</p>  \t<p style=\"\">  \t\t  7. Do not have a mentor or coach to guide you through a process. ( making costly mistakes)  \t</p>  </ul>  <p style=\"\">  \t<span style=\"\">This course specifically designed to address the main causes for business failure and set you on the right path to success.</span>  </p>  <p style=\"\">  \t <strong style=\"\"> Learn how to start a business based on your passion.</strong> It can be an online business that you can work from home online or an off-line business still enjoying the comfort of your own home. If you have ideas around business that you feel passionate about but have not been able to put it into practice in this course you will learn the practical steps to make it happen. With easy step by step guidance many proven business examples this course will inspire to step into action.  </p>  <p style=\"\">  \t             For Example: :  </p>  <p style=\"\">  \t             - Learn how I started a home publishing business going from $0 to $150,000 per year.  </p>  <p style=\"\">  \t             - An online coaching and consulting business teaching worldwide  </p>  <p style=\"\">  \t             - An art publishing business online  </p>  <p style=\"\">  \t             and much more.......  </p>  <p style=\"\">  \t         If you already have a business idea and want to start a business, in this course you will learn how to write a business plan  in just a few hours. A business plan that will cover all the important aspects of your new business and can help you to raise founding.  </p>  <p style=\"\">  \t          IMPORTANT:  I know your time is valuable and you want to pick right business course, so please watch these testimonials before you enroll into the course.  </p>  <p style=\"\">  \t<a href=\"https://www.youtube.com/watch?v=XgSsPV84LhU\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Testimonial 1 - Artist and Healer</a>  </p>  <p style=\"\">  \t<a href=\"https://www.youtube.com/watch?v=p9J_VLkQdMM\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Testimonial 2 - Relationship Counselor </a>  </p>  <p style=\"\">  \t<a href=\"https://www.youtube.com/watch?v=nnqZBQ07b8k\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Testimonial 3 - Professional Organizer</a>  </p>  <p style=\"\">  \t          The course will take approximately 3 hrs to complete. It is broken up into 4 modules. each module begins by identifying objectives and provides specific home work for you to complete. The modules based on an easy step by step learning with no technical jargon and plenty of proven real life examples. The fifth additional module covers how to male money in art and photography business. However the strategies you will learn apply to many business models.  </p>", 
    "end_date": null, 
    "title": "How to Start a Home Business : Turn Your Passion into Profit", 
    "price": "50.00", 
    "instructors": "Vitaly Geyman (MBA)", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204058_e864_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-home-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-23T18:21:46Z"
}