{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>LATEST: Course Updated Again On 15th of January 2016</strong></p>  <p>  \t<strong>      Are you a car lover?   \t                                                                      A Hands-On kind of guy..or gal?  \t  \t</strong>Grab this training today right here on Udemy and watch as this seasoned pro, guides you through the process of how to tint car windows<strong>.</strong>  </p>  <ul>  \t<li><strong></strong>You will learn what tools you need - and the expensive ones that you don't.</li>  \t<li>Discover what brands of film that are most user friendly for beginners.</li>  \t<li>You'll learn the simple techniques, that you can practice to perfection as you start your journey towards a new and exciting career. </li>  \t<li>Work in a industry, where as long as the sun keeps on shining - you will have customers looking for what you offer. </li>  \t<li>Start from your own garage at home, keeping overheads low and profits high.</li>  </ul>  <p>  \t                                                      You will get up-close and personal with these professionally produced videos.   \t          With a systematic approach that's designed to build your confidence.   \t          These simplified teaching methods break down the techniques you will need to practice and master to capitalise on the massive business opportunity that awaits the victorious!  </p>  <p>  \t  \t<strong>What Have Udemy Users Been Saying About This Course?</strong>  </p>  <p>  \t<strong>\"</strong>Well delivered course by a very knowledgeable tutor\"  </p>  <p>  \t          The course was highly informative, very interesting and the information was put across in an excellent manner thank you Nick Roberts! - 5 Stars  \t<strong>(Michelle  - Udemy student)</strong> <br><br> \t  \t          \"Nick obviously is an expert in this - AND he's a natural teacher.   \t          He shows real tricks of the trade and his lessons help avoid pitfalls and costly mistakes.\" 5 Stars  \t<strong>Rob A.  - Amsterdam ( Udemy student)</strong>  </p><p><strong>\"Fantastic window tinting course\"<br></strong>This course is exactly what I needed to get started in tinting windows. The list of tools and materials and where to buy them was such a great help. All of the lectures really give attention to detail of each phase of cutting, fitting and applying the film. I also really appreciate the section on what could go wrong. After viewing the course in its entirety, I am beyond confident that I can successfully tint windows as a profession - <strong>from Harley Sitner</strong><strong></strong></p><p><strong>Amazingly good and clearly explained<br></strong>I'm a car wrap guy and have never done window tinting. Guess i'm now complete ! Everything to start and practice by yourself is very well explained. Can't wait for the upcoming videos though ;) - <strong>Maurice Nguyen</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong><br></strong></p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>                                        WHO SHOULD SIGN UP FOR THIS TRAINING?  </strong>  </p>  <p>  \t                                                  Anyone who wants to make money using their own skills  </p>  <p>  \t                                              English speaking people from any country  </p>  <p>  \t                                                  People of any age or ability with a natural aptitude for \"Hands-On' work.  </p>  <p>  \t                                                  This course is probably not for you if you want instant success! You must take this course seriously if you want to hit your goal.  </p>  <p>  \t<strong>LATEST: Course Updated Again On 15th of January 2016</strong></p>", 
    "end_date": null, 
    "title": "How to Establish a Business Tinting Car Windows from Home ", 
    "price": "50.00", 
    "instructors": "Nick Roberts", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308380_ee48_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-establish-a-business-tinting-car-windows-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T14:22:19Z"
}