{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Working from home isn't difficult.</p><p>They say that you need a product in order to become successful as an online marketer.<br></p><p>This Is Not True anyone can become a great internet marketer selling other people's products.</p><p>The truth is people are quietly <strong>making money from home</strong> selling other people's products.</p><p>Whether it's <strong>selling information product</strong> or products sold on Amazon, anyone can get started with very minimal experience, tools and resources.<br></p><p>We definitely <strong>NOT </strong>going to talk about how to make 50 Adsense sites or how to build Amazon sites or anything ridiculous like that only to earn you $10 to $20 a day.<br></p><p>I'm here to teach you how i made a <strong>legitimate online business</strong> that's making me <strong>$500 to $1000 a day </strong>and you can make it too if you work at it and continue to build it up.<br></p><p>I'll go ahead and give you kind of <strong>disclaimer</strong> here. \"This does require a little bit of work it's not something you can plug in play. <strong>I definitely recommend you approach any system that guarantees to make you any money without work, with serious caution!</strong> That stuff is <strong>99% crap</strong> and you will be wasting your money and time.<br></p><p>I've been there, I've done that and I don't wanna see you making the same mistake so we definitely not gonna do that same stuff.<br></p><p>I've been <strong>making money online</strong> for the past few years. I made this course for <strong>YOU</strong> because, I was tired of seeing tons of courses on <strong>Udemy &amp; JVZoo</strong> that didn't give people an <strong>easy way to reach a full-time income</strong>.<br></p><p>In this course I'll take you by the hand and show you <strong>Step-by-Step</strong> what you need to do, you'll literally watch over my shoulders.<br></p><p><strong>So, Click the order button now, and become an Affiliate Marketing Ninja in any industry.</strong><br></p>", 
    "end_date": null, 
    "title": "How to Work from Home as an Affiliate Marketing Pro", 
    "price": "20.00", 
    "instructors": "Dr. Richard Williams", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596700_99d0_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-work-from-home-as-an-affliate-marketing-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T15:02:11Z"
}