{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">If you&#039;ve ever dreamed about publishing a book in print you know how overwhelming it can seem. In fact, it used to be almost impossible to get a book into print without laying out 1,000&#039;s of dollars upfront or already being a famous author. </p><p style=\"\">Now, thanks to new technologies and print-on-demand, you can take an existing eBook or book manuscript and, following the steps outlined in this course, publish your first paperback in less than a week using CreateSpace.</p><p style=\"\">If you&#039;re not familiar with CreateSpace, it&#039;s an Amazon company that allows everyday people to easily create paperback books to sell on the Amazon marketplace and many other retailers. The amazing thing about it is that CreateSpace is FREE to use, and it even includes a free, easy-to-use cover creator with photos that you can use on the cover of your book free of charge. But as with anything, there is a learning curve to it and it can be frustrating trying to get everything in your book just right.</p><p style=\"\">This course is designed to walk you through the entire paperback book creation process and help you get the full use out of the free tools that CreateSpace has to offer. </p><p style=\"\">This course includes:</p><ul style=\"\"><li style=\"\">Coming up with a title for your book to help it sell on Amazon</li><li style=\"\">How to write a winning book description </li><li style=\"\">Using keywords to help your book sell itself</li><li style=\"\">Formatting your book using a pre-formatted template so it looks great in print</li><li style=\"\">Creating a free cover with CreateSpace cover creator</li><li style=\"\">Outsourcing a custom cover on Fiverr or Elance (optional)</li><li style=\"\">How to turn an existing Kindle eBook into a Print book to increase your sales</li><li style=\"\">How to turn your Print book into a Kindle book to increase sales </li><li style=\"\">What types of books sell best and why</li><li style=\"\">My recommendations for minimum length, color vs. black and white, cover quality and more...</li></ul><p style=\"\">This course is for you if you have a novel or non-fiction book that you have written or want to write and you want to  see it published in print. Whether you want to sell it through Amazon or just create it for friends and family, this course will walk you through to completing your book.</p><p style=\"\">This course is for you if you have published Kindle books for profit and want to take your income to the next level. By converting your eBooks into print you increase the visibility and professional appeal of you book.</p><p style=\"\">You can go through this course in just a few hours. Using what you learn here, you can have your book available in print format on the Amazon marketplace in under a week. In under two weeks you can be holding a physical copy of your book in your hands.</p><p style=\"\">If you&#039;ve taken my other courses here you&#039;ll know that I&#039;m readily available in the discussions to answer your questions and help you over any hurdles you encounter along the way. And I frequently add new lectures to help clear up questions and keep you up to date on what&#039;s happening.  We&#039;re in this together!</p><p style=\"\">Plus, every Udemy course comes with a full 30-Day Money Back Guarantee, so you have nothing to lose and only the future to gain!<br style=\"\"></p><p style=\"\">What are you waiting for? Click on the Take this Course button and get started today!</p><p style=\"\">Or, if you haven&#039;t taken one of my other courses, feel free to view some of the FREE preview lectures to make sure my teaching style and  the course content will be a great fit for you. See you in there!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "How to Self-Publish Your Book in Print and Sell it on Amazon", 
    "price": "20.00", 
    "instructors": "Steve McDonald", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450884_db70_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-self-publish-a-book-and-sell-print-on-demand/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T03:31:52Z"
}