{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hi, Gavin Birchall here.</p>    <p>And I truly want to welcome you today, to this full and intensive training program on, <strong>“How To Build A Successful And Profitable Online List Building Business Starting From Scratch”.</strong></p>    <p>And the one main reason I decided to create this full and complete, A-Z, no holds barred, intensive list building training program, is so that YOU the viewer can literally glide past all the obstacles, all the myths and the pitfalls that can come with trying to learn this business through trial and error learning alone.</p>    <p>You see, I've been making a full time income online now since way back in 2011.</p>    <p>And I've actually been making money online part time even way further back in 2007.</p>    <p>2007 is where it all started.</p>    <p>So, you could say that I've pretty much tried, tested, FAILED and have seen success with 99% of the 'Make Money Online' opportunities that are out there.</p>    <p>So I know.........that learning through trial and error methods are not only time consuming, frustrating and very costly.........</p>    <p>….....But also that they're FATAL and can be very costly to anyone's desire for success!</p>    <p>So why take the risk?</p>    <p>Why try and figure this out all on your own when you can have ME by your side, giving you the tools, the know how and step by step instructions to help you every step of the way.</p>    <p>And I'm sure by now you've figured out that this is the only one true path to success with almost anything in life right?</p>      <p>You see, I LOVE email marketing and list building.</p>    <p>Why?</p>    <p>Because I know it works!</p>    <p>Like I said before, I've tried countless online business strategies in the past and YES, even though I made money from them........</p>    <p>….....None of them gave me any kind of consistent, predictable, reliable, scalable and even LIFE CHANGING RESULTS!</p>    <p>Yes, finding and using list building and email marketing as an online business tool, has completely changed my financial life forever.</p>    <p>Thanks to list building and email marketing I've managed and coached students from all over the world, I've sold multiple thousands of digital download information products online, built HUGE buyers email lists and have managed to achieve “High Authority” status in my chosen niche.</p>    <p>All thanks to this simple but highly effective list building and email marketing strategy that I'm about to share with you today!</p><p><strong>SO, WHAT IS EMAIL MARKETING AND LIST BUILDING EXACTLY?</strong></p>    <p>In a nutshell, “list building” is where you advertise a specific offer to someone who visits your website, who is actually needing and wanting your specific offer.</p>    <p>Once they've decided that they want your offer enough, they are asked for their email address in return for this item.</p>    <p>They are then added to your email list database via what is known as an “Email Auto-Responder” and we'll be discussing those in much greater detail throughout this course.</p>    <p>After this process has been taken care of, now it comes down to you as a marketer to take care of the “Email Marketing” side of things.</p>    <p>You'll basically send out emails to your new lead or prospect or even CUSTOMER depending on what level these new leads are at with you and this is where you get to GROW a HUGE fan-base of people who get to know you, like you and trust you!</p>    <p>Once you have all these 3 elements in place, that is when you can start to make sales on complete demand, day to day, week to week and month to month all thanks to this amazing list building system.</p>    <p>That's email marketing and list building in a nutshell.</p>        <p>By the end of this program, you'll have everything you need to be able to build a highly responsive email marketing lead system, that sends you automatic sales every single day that are........</p>    <ul><li>Predictable</li><li>Measurable</li><li>Scalable</li><li>Controlable</li><li>And most of all - “PROFITABLE”</li></ul>            <p>Does that sound like a system you would like to have in your life?</p>    <p>Okay with that said, let's get started.</p>    <p>I've been Gavin Birchall, and again I want to thank you and congratulate you in deciding to invest into my intensive course here today.</p>    <p>Take care,</p>    <p>And I'm looking forward to seeing you in video training number 1.</p>", 
    "end_date": null, 
    "title": "HowTo Build A Profitable List Building Business From Scratch", 
    "price": "20.00", 
    "instructors": "Gavin Birchall", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639500_2137_2.jpg", 
    "course_url": "https://www.udemy.com/howto-build-a-profitable-list-building-business-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T18:13:51Z"
}