{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>**2015 VERSION UPDATED - JOIN 7,500+ SUCCESSFUL STUDENTS!**</strong></p><p>  \t<strong>MY BOOK RESULTS UPDATE: </strong>The  weight loss book I create with you inside this course with you has now become an Amazon Kindle Bestseller in 6 different categories and has made over $3730 in it's first 30 days!!!</p>    <p>  \t<strong>Do you want an extra $10,000 of passive income this year?</strong>  </p>  <p>  \t<strong></strong><strong>Do you want to become an </strong><strong>Amazon</strong><strong> Best Selling Author?</strong>  </p>  <p>  \t<strong>Best of all... Do you want to accomplish this in just 72 hours?</strong>  </p>  <p>  \t                         Ummm yeah!?...  </p>  <p>  \t                   Then you are in the perfect place!  </p>  <p>  \t                You have found the ultimate guide revealing the simplest, and quickest strategies to becoming a best seller, and making an extra $10,000 over the next 12 months!  </p>  <p>  \t                   Within this video course I  reveal to you the exact proven step-by-step blueprint that I, and many other successful authors have used to create $10,000 Best Selling Amazon Kindle eBooks in only 72 hours.  </p>  <p>  \t<strong>Start making money immediately with no financial outlay, and zero experience needed!</strong>  </p>  <p>  \t               Not only will I show you exactly how to set up this new passive income that pays you while you sleep... you can use this exact method to copy my success of becoming an <strong>'Amazon #1 Best Seller'</strong> Imagine adding this to your resume! (It's easier than you think...)  </p>  <p>  \t <strong>So Let's create a book together :)</strong>  </p>  <p>  \t         The great thing about this video course is that I literally take you by the hand, and walk you through the entire process step-by-step by demonstrating each stage by creating a brand new eBook from scratch! Everything is shown as I put this book together, and list it on Amazon Kindle nothing is held back!  </p>    <p>  \t <strong>The Exact Secrets I Reveal in this Comprehensive Video Course:</strong>  </p>  <ul>  \t<li>See exactly how to research and pick a successful niche!</li>  \t<li>Discover how to leverage your competitors success!</li>  \t<li>Learn what 3 elements make up the best selling book titles!</li>  \t<li>Learn how to create or outsource the perfect eBook cover!</li>  \t<li>Learn how to create an 'Ideastorm' and 'Content skeleton' that forms the foundational structure of your best selling ebook!</li>  \t<li>The complete checklist for optimising the inside of your book for more sales!</li>  \t<li>See a walkthrough of how to edit and format your book suitable for Kindle!</li>  \t<li>The smartest way to enlist your ebook on KDP backend for success!</li>  \t<li>No outlay or expenses are necessary and nothing is hidden!</li>  \t<li>At the end of the 72 hours you will have a professional eBook listed on Amazon and it will be making you up to $10 000+ in passive profits.</li>  </ul>  <p>  \t <strong>Grab This Course Now and See Exactly Why I Have Been So Successful On Kindle!</strong>  </p>    <p>  \t            After my previous success on the Amazon store people have constantly been asking me how I did it! If I am being honest it was quite simple... I used the amazing advice from best selling writers, and people much smarter than myself. I started doing some research myself and spent a endless hours analysing writing systems and methods that the most financially successful authors are all using to write books. Once I used this method and saw phenomenal results with my books I decided to put together this ultimate video course that reveals ALL of these secrets and strategies for you to achieve the same results!  </p>  <p>  \t<strong>                     I know what you're thinking...</strong>  </p>  <p>  \t    This sounds too good to be true...  </p>  <p>  \t    It's not!  </p>  <p>  \t    Amazon Kindle is now identical to the opportunity that Google presented in the early 2000's!  \t    Amazon get more traffic than Google did back then, but the only difference now is that unlike google people on Amazon are only looking to buy! Don't miss out on this opportunity!  </p>  <p>  \t     My amazon sales dashboard (which I show inside the video course), and the thousands of students who have already taken and loved my course reveal just how simple creating your $10,000 ebook can be.  </p>  <p>  \t    Get your book written and let Amazon do the work for you! No shipping, and no hassles, You can literally get started today with $0 and zero experience!  </p>  <p>  \t    This video course is of course covered under Udemy's unconditional 30 day 100% money back guarantee if you are dissatisfied in any way! That means that this is a RISK FREE investment in your financial, and professional future. <strong>How come you have not signed up yet?</strong>  </p>  <p>  \t<strong></strong>Once you know the secrets... These strategies are really very simple, and only require a little bit of hustle and a little bit of brains... but let's be honest - we both know you can knock these ebook writing secrets out of the park!  </p>  <p>  \t    Whether you are a stay at home mom, a young entrepreneur, or a professional looking to expand their resume and income stream at the same time... this course is perfect for you!  </p>  <p>  \t<strong>Scroll up the page and join my course now to start our $10K eBook's together now!</strong>  </p>  <p>  \t    See you on the inside :) I am excited to get you to see the same success that I have had with Amazon Kindle.  </p>  <p>  \t    - Benji  </p>", 
    "end_date": null, 
    "title": "Kindle Secrets: How I Wrote a Best Selling eBook In 72 hours", 
    "price": "40.00", 
    "instructors": "BenJamin Wilson", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236832_f09d_19.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-kindle-best-seller/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-04T01:06:31Z"
}