{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">                       Course Priced at $9 For Limited Time Only !</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Why Should You Buy This Course?</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong><span style=\"\">There are a lot of Kindle courses on Udemy but I developed this course to fill a gap in the information provided by other course tutors.  In this course you will learn how to double or triple the profits you get from your Kindle eBooks by developing a Back End Monetisation Strategy.  This is not to be confused with a marketing strategy.</span>  </p>  <p style=\"\">  \t<strong style=\"\">What is a Back End Monetisation Strategy?</strong>  </p>  <p style=\"\">  \t        A  Back End Monetisation strategy puts automated money earning systems in place to mulltiply the earnings you get from your Kindle eBooks. I teach you how to really use your creativity to come up with loads of ideas to make more money from your eBooks.  </p>  <p style=\"\">  \t        By putting in place these systems you will protect your income in case your book doesn't hit best seller status and you will make tons more money if you are fortunate enough to have a best seller on your hands.  </p>  <p style=\"\">  \t<strong style=\"\">Is The Course Complicated?</strong>  </p>  <p style=\"\">  \t        This course is extremly simple to follow and you need only basic knowledge of how to create and upload a Kindle eBook to get the benefit of this course.  However the people who will get the most benefit are those who want to really amp up the earnings they get from each and every eBook they create.  </p>", 
    "end_date": null, 
    "title": "Kindle eBooks: A Back End Monetization Strategy", 
    "price": "20.00", 
    "instructors": "LR Thomas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355102_b32d_4.jpg", 
    "course_url": "https://www.udemy.com/kindle-ebooks-a-back-end-monetization-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T08:07:06Z"
}