{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you missed out on the internet boom of the 2000's...</p><p>If you've been on the outside looking in as big opportunity after big opportunity has passed you by, then read this carefully because you do not want to miss this one:</p><p><b>Introducing: Kindle Empire -Publishing to create freedom:  A practical guide to building wealth online by creating, designing, and marketing successful Amazon kindle eBooks</b></p><p><b><em>A home based business opportunity unlike anything you've ever seen before.</em></b></p><p><b>Discover How to Turn Your Hobby or Passion Into a Simple eBook That Floods Your Bank Account With Cash 24 Hours a Day Automatically...</b></p><p>Now, you can learn all you need to know to run your own independent publishing house from home on the kindle platform. From how to set the vision and general direction of your company, to creating the content for your book(s), then formatting and cover design, on to listing it on the kindle platform and getting it ranked for optimum success, Kindle Empire have you covered.</p><p>Now before you pooh pooh all over this opportunity and say this is just like one of those eBook programs you need to <strong>pay close attention:</strong></p><p>I've created several bestselling books in the fiction and non fiction side,and i have helped other students just like you to achieve financial success through publishing. I have publishing courses that cost well over $1000 and Clients pay me up to $5000 to help implement these strategies for them. I'm no one trick pony.</p><p><em>This course is my way of giving back, and i will be working with a small group of student only.</em> </p><p><strong>DON'T WASTE ANY MORE TIME! </strong><strong>When was the last time you heard of a great opportunity and never took advantage of it?Consider the fact that you can take this information and make an extra $1000-$2000 per month. What will that do for the quality of your life?</strong></p><p><strong><em>Don't let this be like the last time! </em>Take action NOW</strong></p><p><strong>Take this course now and lets create the future.</strong></p>", 
    "end_date": null, 
    "title": "KINDLE EMPIRE -Publishing to create freedom.", 
    "price": "50.00", 
    "instructors": "Osamede Arhunmwunde", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462654_7cad_2.jpg", 
    "course_url": "https://www.udemy.com/kindle-empire-publishing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T05:05:51Z"
}