{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Kindle Pre-orders to Get To Kindle Best Sellers before actual launching!</strong></p><p><strong>Rosa's Online School:</strong></p><ul><li><strong>Teaching 8 Courses on Kindle &amp; Udemy Successes!</strong></li><li><strong>Teaching 32 Courses on Music &amp; Piano Courses!</strong></li></ul><p><strong>OVER 15,000</strong> Successful students have already taken my online courses since July 2014 with <strong>382</strong><strong> - 5 Star Reviews</strong></p><p><strong>Course Updated:</strong> January 1, 2016<br></p><p><em><br></em></p><p><em></em></p><p><em>I thank people for taking their time to write reviews for my courses. They help me to become a better instructor. After reading reviews, I realize for 'business courses' students do not want long introduction with case studies. This new course goes straight to the point.  The lectures are direct and focused with immediate action plans right at the beginning. No long case studies!  Thank you for all your feedback.  Enjoy! </em></p><p>------------------------------------------------------------------------</p><p><strong>Listen to what her students are saying:</strong></p><p><strong> Jamie Brigg:</strong></p><p><strong>High Quality &amp; Actionable</strong></p><p><em>I have purchased several of Rose Suen's kindle books on Amazon and was delighted to see her here on Udemy. This Instructor is as professional and business savvy as they come. I learned a lot about Kindle in this course and HIGHLY recommend everything from this DYNAMIC teacher! 10-STARS</em></p><p><strong>Kim Regan:</strong></p><p><strong>Very Good Course</strong></p><p><em>Lots of great strategies and tips in this course. You will learn the WHY behind the suggestions of a pro author.</em></p><p><em>-------------------------------------------------------------------------</em></p><p><strong> Kindle Preorders - </strong>Little known marketing tactic with correctly timed campaign to take your Kindle Books to Best Sellers even before Launch. This Kindle technique dramatically increases your Kindle sales.<br></p><p><strong>Ever since I started Kindle Publishing back in 2009, my interest has always been wanting to get my books into the Best Sellers Pages.</strong></p><p>I've written many books and conducted different seminars to teach people how to launch their books so that their Kindle books get to the <strong>Best Sellers</strong> pages and <strong>stay</strong> there.</p><p>Earlier this year in January, I created a course on <strong>30 Day Launch</strong> to help Kindle publishers to revive their old books and to get their new books into the <strong>Best Sellers</strong> within first 30 day Launch.</p><p><strong>Half a year has passed,</strong> and I've tested more things and discovered something even more fantastic - You can actually get your Kindle books onto the Best Sellers even <strong>BEFORE </strong>the actual launching!  Have you ever heard of this?  This is 'too marvelous' for words.  How does it work?  <strong>Use the \"Pre-order Feature\" with correctly timed campaign in Amazon Kindle.</strong></p><p><strong>I reveal to you real live books that are now on Best Sellers Pages</strong> during the Pre-ordering Stage.  Imagine!  You can have a head start before everyone when you have your book ranking so high up already <strong>before </strong>the actual releasing date.<strong></strong></p><p>I discuss effective promotion and marketing so that you don't waste your time. Use my powerful method of <strong>PPP</strong> marketing for pre-order books!  It works all the time and give you amazing results!</p><p>Have you ever thought you could get your book into Best Sellers even before the book is released?</p><p>This is a long awaited dream many Kindle authors had longed for and you can make this dream come true for you today!</p><p><strong>These are the topics that are covered in this course:</strong></p><p>1.  5 Things you must understand about Pre-order books</p><p>2.  How Kindle Pre-orders work</p><p>3.  How to upload Pre-order books</p><p>4.  One Mistake you must avoid</p><p>5.  How to do Rescheduling</p><p>6.  The Importance of Meeting Dealines</p><p>7.  Difference between Draft Manuscript &amp; Final Version</p><p>8.  4 Big Advantages in doing Pre-ordering books</p><p>9.  General effective promotion &amp; marketing</p><p>10. The Big Secret Tip of doing cross promotion with Pre-order books</p><p>11. How to train your customers to KEEP buying your books</p><p>12. Use my 90 Day Action Plan</p><p>13. Use my 90 Day Calendar to meet deadlines</p><p>14. Pricing strategies &amp; KDP Select</p><p>15. Pre-order report in the KDP Dashboard</p><p>Treat me coffee when your books keep appearing on the front page of Best Sellers in your category!</p><p>Enroll into the course and I will see you inside,</p><p>Rosa</p><p>***************************************************************************</p><p><strong>About Rosa's Piano Online Course:</strong></p><ul><li><em>Over </em><strong><em>15,000</em></strong><em> </em><em>very happy students already in my Udemy classes</em></li><li><em>See the </em><strong><em>5 Star Reviews</em></strong><em> from VERY satisfied students</em></li><li><em>You get free lifetime access</em></li><li><em>All videos are at your finger tips to watch anytime &amp; anywhere</em></li><li><em>All future extra lectures and upgrades are </em><strong><em>always free</em></strong></li><li><em>Unconditional Udemy </em><strong><em>30 day money-back guarantee</em></strong><em> and that's my personal promise to your success!</em></li><li><em>Join this happy family of students </em></li><li><strong><em>Enroll into this course</em></strong></li></ul><p><br><em></em></p>", 
    "end_date": null, 
    "title": "Kindle Secrets #2: Kindle Pre-orders to Kindle Best Seller", 
    "price": "25.00", 
    "instructors": "Rose Suen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559196_59b4_9.jpg", 
    "course_url": "https://www.udemy.com/kindle-secret-tip-use-pre-orders-to-become-best-sellers/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T06:46:14Z"
}