{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em></em><em>Kindle formatting doesn't have to be difficult!</em></strong></p><p><strong>With the information contained in this course you will discover how YOU can perfectly format your own Kindle books, quickly and easily, using free, readily available software.</strong></p><p>When it comes to Kindle formatting, the internet is awash with confusing, outdated, contradictory, and sometimes, just plain wrong information! Amazon don't help the situation, with Kindles of different screen sizes and resolutions, different device capabilities, and different file formats. It's no wonder that so many people end up with formatting problems that result in low ratings and bad reviews for their books.</p><p><strong>Easily avoid that happening to you by taking this course and and applying the information you are going to be shown.</strong></p><p>You're going to be learning from an instructor who is an established Amazon Kindle author, who uses these very techniques to update and submit his own book to Amazon.      </p><p>This is not a course about teaching you how to make text bold, italicised, or any of the other basic text formatting you've probably been doing for years. Anybody who has ever used a word processor or text editor knows how to do that stuff, so you aren't going to have your time wasted by being shown the basics that you already know! This course is about teaching you the things that you NEED to know in order to get your Kindle book well formatted, accepted by Amazon, and help you <strong>avoid the 1-star ratings and bad reviews you could end up with</strong> - <em>just because your book wasn't properly formatted</em>.</p><p>You see, the truth is, it doesn't matter how good the content in your book is, or how long you slaved away writing it, all it takes is a table of contents that doesn't work, an image that is too small, or even some text that is badly laid out, to stop many readers dead in their tracks. It doesn't matter how little they have paid for your book - they expect quality. If your poor formatting spoils their reading experience, they will be very quick to leave you a 1-star rating and a bad review. And it doesn't take many of those to drive away potential buyers, lose you money, and ruin credibility for both you and your book.</p><p><em>Check out the curriculum to see what the course currently offers, and take advantage of the free preview lectures. Inside the course you will find a discussion area where you can interact with the instructor and other students, ask questions, and get help on any problems you might have. Your instructor is also very open to suggestions from students for new lecture topics they might wish to see covered.</em></p><p><strong>Why risk throwing away months of hard work? Learn how to format your Kindle book properly, and <em>take this course now</em>. </strong> </p>", 
    "end_date": null, 
    "title": "Kindle Formatting : How To Do It Properly", 
    "price": "20.00", 
    "instructors": "Chris O'Connor", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631008_fdf0_3.jpg", 
    "course_url": "https://www.udemy.com/kindle-formatting-how-to-do-it-properly/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T05:46:58Z"
}