{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Join the 500+ students already taking this very unique course.</strong></p><p><em style=\"\">\"<strong style=\"\">Worth it! </strong></em><em style=\"\">If you ever wondered how to get your books published in foreign markets, this course will explain it all :)</em></p><p><em style=\"\">After finishing it, I was able to get my book into the process of translation immediately. Never thought that it will be so simple to get it done, and hopefully it will <strong style=\"\">lead to great profits</strong>.\" </em>UDEMY Student.</p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">Take your Kindle sales to a whole new level through foreign translations.</strong></p><p style=\"\"><em style=\"\">The real secret to expanding your Kindle sales? Expand your reach.</em></p><p style=\"\">Worldwide there are currently 13 kindle stores with only three of them in English speaking countries (four if you include India), yet the majority of authors totally ignore what is essentially an untapped goldmine. Kindle Direct Publishing has made it very simple to get your book to market, however this has also resulted in much more competition; it's increasingly difficult to be heard through the crowd. </p><p style=\"\"><strong style=\"\">So what's the alternative?</strong></p><p style=\"\"> If you are willing to put in the work, there is a distinct lack of competition in the foreign language Kindle stores. This is due to less people in these countries releasing books and a higher barrier to entry for English speaking authors. <strong style=\"\">This is absolutely great news</strong> for those willing to venture into the unknown and jump the hurdle of getting their book translated. </p><p style=\"\"><strong style=\"\">With this course you will easily:</strong></p><ul style=\"\"><li>Find an experienced and talented translator at a <strong style=\"\">great price</strong>.</li><li>Get a quality translated version of your book that you can be proud of and that makes money.</li><li>Understand the different markets and choose a country that suits your goals.</li><li><strong style=\"\">Save money</strong> and time by using simple tips on preparing your document and getting your cover translated.</li><li>Easily set up your online 'foreign' presence with websites and author pages (author central).</li><li>Expand into other eBook platforms such as Ingram Spark (with their <strong style=\"\">huge international reach</strong>).</li><li>Open up totally <strong style=\"\">new revenue streams</strong> through up-selling and foreign versions of your      audio-books and paperback books.</li><li><strong style=\"\">Avoid costly errors</strong> when formatting (especially with Japanese eBooks).</li><li>Plus much more…</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">Due to the fact there is <strong style=\"\">a lot less competition</strong> in many of these markets there are also some 'hidden' <strong style=\"\">benefits</strong>. </p><ul style=\"\"><li>It is a lot easier to become a bestselling author, and once you have achieved this you can use it as a badge of honor.</li><li>Also, it is easier to win the Kindle All Stars, where you receive a bonus for having a popular author name or book. I have won this twice with books in a very specialized niche (very difficult to do in the US). Also the German All Star bonus is the second largest after the US and a lot bigger than the UK one.</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">Through publishing 15 books, each one translated in up to 5 different languages I've encountered all of the obstacles to getting a quality translation online and selling. This course covers every problem you will face how you can easily overcome them. If this course was available when I got started I would have saved an awful lot of blood, sweat and tears…not to mention money!</p><p style=\"\">As there is a money back guarantee there is absolutely no risk on your part which is great. </p><p style=\"\">So get started today and literally <strong style=\"\">skyrocket your kindle sales</strong>.</p><p style=\"\"><strong style=\"\">*Bonus: </strong>All my students are able to contact me directly with their genre and I'll be happy to research it and give my opinion and a few pointers.</p>", 
    "end_date": null, 
    "title": "Kindle Writing: Translating Books for International Markets", 
    "price": "40.00", 
    "instructors": "Isaac Perrotta Hays", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429874_64b6_3.jpg", 
    "course_url": "https://www.udemy.com/kindle-massively-increase-sales-through-book-translations/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T12:24:42Z"
}