{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul>  \t<p>  \t\t            This course is completely updated and current through 2016, and is guaranteed to give you amazing results once implemented</p>  \t<p>  \t\t             I will offer Skype support to every student who asks for it. If you have a problem/question, send me a private message and we will set a time for the call.  \t</p>  \t<p>  \t\t<strong><em><strong>-----------------------------------------------------------------------------------------------------------</strong></em></strong>  \t</p>  \t<p>  \t\t<strong><strong>Would you like to learn how to find high-quality public domain content, rebrand it in a few minutes, and sell it </strong></strong><strong><em><strong>as your own </strong></em></strong><strong><strong>for huge profit ?</strong></strong>  \t</p>  \t<p>  \t\t             Would you like to finally start earning money from the comfort of your home ?  \t</p>  \t<p>  \t\t             Can you follow the easy instructions I will lay down for you in order to setup your very own cashcow business that will pay for years to come ?  \t</p>  \t<p>  \t\t             If you answered « yes » to any of the questions above, congratulations. You are already on your way to financial freedom.  \t</p>  \t<p>  \t\t             Selling Public Domain materials means <em><strong>no work </strong></em><em><strong>involved. </strong></em>It means you can take a book that took years to write and resell it <strong>right away.</strong>  \t</p>  \t<ul>  \t\t<p>  \t\t\t<strong><strong>Let me help you !</strong></strong>  \t\t</p>  \t\t<p>  \t\t\t             In this course,<strong>I will teach and DEMONSTRATE every step of the process</strong> from finding public domain videos, music, ebooks and even videogames, to flipping them for a very high price.  \t\t</p>  \t\t<p>  \t\t\t             The internet doesn't care who you are: If it worked for me, it will work for you, regardless of where you live.  \t\t</p>  \t\t<p>  \t\t\t             I will also show you many different secrets to make money with these public domain materials, form effortlessly growing an email listing to reselling them as bulk products though sales pages.  \t\t</p>  \t\t<p>  \t\t\t             I will also teach you the art of driving converting traffic to these sales page in no time at all, so you can start profiting within days.  \t\t</p>  \t\t<p>  \t\t\t             I will take you by the hand and show you how to <strong><strong>make up to 4,000$ a month </strong></strong>by reselling great masterpieces, that can be yours for FREE.  \t\t</p>  \t\t<li> Do you need/want more money?</li>  \t\t<li> Do you want to quit your job ?</li>  \t\t<li> Do you need money to catch up on your bills ?</li>  \t\t<li> Do you have a family that relies on you ?</li>  \t\t<li> Do you want to own a business that you can be proud of?  \t\t  \t\t\t             If you answered « yes » to <em>these </em>questions, <strong><strong>then consider this course to be your blueprint to success.</strong></strong></li></ul></ul><p> Upon enrolling, you will get my personal help. I will answer any question that you may have in the member's area, and I also offer Skype support if needed. </p><p> \t\t  \t\t  \t\t\t             I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. </p><p>You take absolutely no risk ! </p><p> \t\t  \t\t  \t\t\t             You can get started right after you have taken my course -That means <strong><em><strong>TODAY!</strong></em></strong> </p><p> \t\t  \t\t  \t\t\t             This is opportunity knocking on your door. Many have succeeded before, and I have too. With the information contained in this course, you could quit your job in a couple months, if you so desire. </p><p> \t\t  \t\t  \t\t\t             Click the \"Take This Course\" button now. That's your first step to building a solid online income. Every minute that goes by without action is <strong><strong>one less paycheck</strong></strong>. </p><p> \t\t  \t\t  \t\t\t             Cheers! </p><p> \t\t  \t\t  \t\t\t             Howard</p>", 
    "end_date": null, 
    "title": "Launch and Sustain a Business Reselling Public Domain Stuff", 
    "price": "20.00", 
    "instructors": "Howard Lynch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399024_bec9_2.jpg", 
    "course_url": "https://www.udemy.com/launch-and-sustain-a-business-reselling-public-domain-stuff/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T10:36:22Z"
}