{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Many people envision starting their own business as a terribly difficult endeavor. But in reality, it doesn't have to be...</p>  <p>\t<strong style=\"\"> Did you know that, right now, people are making $100,000+ every MONTH....by the simple business model of selling T-shirts! </strong>And on top of that, they hold no inventory, and there is no financial risk involved whatsoever.</p>  <p>\t<em style=\"\"> Sound too good to be true? </em><strong style=\"\">It's not.</strong> It's called Teespring - a new platform which has given rise to millionaires in the few short years of its existence, and it is just waiting for you to hop on board and take things to the next level financially.</p>  <p>\t In this course this course you be learning from Derek Pankaew, who made over $36,000 in PROFIT the week before this course was filmed. <em style=\"\">Imagine that, what some people make in a YEAR made in ONE WEEK. </em>  </p>  <p>\t<strong style=\"\"> This course is designed to take from knowing NOTHING about Teespring (never heard of it before? that's ok!) all the way through your first profitable campaign. </strong>  </p>  <p>\t Specifically you will learn:</p>  <ul style=\"\">\t<li>How to find successful shirt ideas (hint: you don't have to think of these yourselves)</li>\t<li>How to have your T-shirts designed (without doing it yourself)</li>\t<li>Launching your first successful campaign</li>\t<li>Common mistakes that your competitors are making</li>\t<li>How to scale your business to become the next Teespring millionaire</li>  </ul>  <p>\t Note: This course is NOT for people who aren't willing to put in the effort. Teespring can make you tons of money, but only if you follow through with what you learn in this course!</p>  <p>\t So enroll today, an take that first step towards exponentially increasing your income.</p>  <p>\t - Derek and Grant</p>", 
    "end_date": null, 
    "title": "Launch on Teespring: How to Make In-Demand T-Shirts", 
    "price": "20.00", 
    "instructors": "Grant Weherley, Derek Pankaew", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390104_f25e_2.jpg", 
    "course_url": "https://www.udemy.com/teespring-travel-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T04:20:46Z"
}