{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Did you know that you can have your own website without coding, or perhaps you know some HTML and CSS and want to create your own.  We demonstrate some quick alternatives to coding your own website from scratch as well as what it takes to create them from scratch.</p><p>This course is designed to provide an overview of options that are available to get online and have your own website.  It will showcase popular approaches to getting a website and getting online.  Compare and see what it takes.</p><p>Learn what it takes to get your own website, options, questions answered, best solutions, resources and lots of great information to help you make informed decisions.  With so many options to get your own website this course will help you become more aware o what you can expect and what are some of the most popular options.</p><p>This course is designed to <strong>help you better understand options </strong>when it comes to setting up your first website.</p><p>When it comes to setting up a website there a plenty of options.  I've created this course to help people make better decisions on what technology they should use, what they can use and what is involved in getting a website.  This is for all skill levels whether you already know HTML and CSS or have no experience at all with HTML.  </p><p>Did you know that you can have a website up in <strong>under 10 minutes</strong> on any host, a fully functional website of your own.  Its easy and most of all the experience of setting up your own site is amazing.   <strong>Do it yourself, create your own website.  No HTML required!</strong></p><p>If you already know HTML or want to go a step further there are several really great frameworks that can help you develop websites faster.  Mobile responsive websites are essential now, being mobile ready is something every website needs.  Its surprising easy to set this up with so many options online.</p><p><strong>This course is designed as a guide to help you and inform you what is possible and what you can expect.</strong></p><p>The above are the 3 main options that you have to decide and should look at when making that decision to create a website.  It all depends on how much coding you want to do. If you are just starting out and want to get up and running quickly there is an option for that.  You can use Content management systems like Wordpress which is relatively easy to setup and doesn't require coding knowledge. Let me show you how to get online quickly.<br></p><p>All websites are based in HTML, which is the fundamental structure for the web. HTML to structure the site, CSS to style and design the look and JavaScript for interaction. If you use a framework like bootstrap it will make it easier to format sites to be responsive to the screen size. Creating sites with bootstrap is quicker, but does require some knowledge of HTML and CSS.<span></span><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Learn how to get your own website quickly", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722400_a1ef_3.jpg", 
    "course_url": "https://www.udemy.com/quick-website-learn-how-to-get-online-have-your-own-website/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T03:02:43Z"
}