{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          Self-publishing is the wave of the future for authors. With greater creative control there are greater levels of responsibility for the self-publishing author. While the traditional publishing route takes longer, many of the more difficult aspects of the process are taken care by the big publishing house. With the technology available today, publishing a book is easier, but the task of creating great looking books can become costly for independent authors with little to no design experience and limited funds.  </p>  <p>  \t          This course is designed to help authors finish their projects. Many authors take a lot of care in writing and editing, but sometimes forget to invest as much in the overall look. This course will focus on how to create books that look great in a shorter amount of time.  </p>  <p>  \tIf you have already written a book and are ready to move to the final stages of your books journey, this course will help you learn the basics of using the built in functions of Microsoft Word to maximum effect. Most people have Word on their laptops at home or desktops at work. The reality is that Word is the most accessible word processing software available. The step-by-step lessons in this course will walk you through the process of creating a “print-ready” document to provide to the many Print-On-Demand companies you can chose from.  </p>  <p>  \t          Each lesson in the course includes information about the various aspects of the design process. You will walk with the teacher through each step, watching as they show you how to do each of the step. Even if you have never used some of the functions in Word before you will learn some important ideas about what it takes to create great looking books.  </p>  <p>  \t          In the end we believe that the price of this course will save you hundreds of dollars in the long run and may even become a source of income for you!  </p>", 
    "end_date": null, 
    "title": "Learn How to Format & Publish Your Book in Microsoft Word", 
    "price": "20.00", 
    "instructors": "Victor Scott", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311714_6cfd_3.jpg", 
    "course_url": "https://www.udemy.com/format-publish-your-book-in-1-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T18:30:02Z"
}