{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This is not a programming course. </strong></p><p>This course is created for aspiring web entrepreneurs and non-tech professionals willing to get started with designing and managing a website for their online business and internet marketing purpose.</p><p> <strong>“Learn How to Design and Manage a Website in 21 Days”</strong>– is an ultimate guide for developing start up prototypes, blogs, business websites and e-commerce stores.</p><p>It is not just a course about common details; in fact it is a complete guide for learning full stack website design from scratch. The course provides all the necessary details and tutorials about setting up a website, ranging from the basic HTML and CSS webpage to hosting a domain to managing and backing up the files.</p><p>It is a very fruitful guide for the beginners as it provides the pictorial guidance including lecture notes, snapshots and screen cast video tutorials.<strong> It also provides one year of free web hosting and a virtual mentor program</strong> to help resolve issues and provide complete guidance and support to the developers.</p><p><strong>This is the course for you if you ever wanted to learn what it takes to set up or manage a business website, start an e-commerce store, blog or make money online – It is the Ultimate DIY guide to website design and management for business owners and aspiring web entrepreneurs</strong><br></p><p>Register for this course today, <strong>claim your free hosting package</strong> and get yourself an amazing experience of web designing – see below for more details</p>", 
    "end_date": null, 
    "title": "Learn How To Design and Manage a Website  ", 
    "price": "20.00", 
    "instructors": "Manifest Company", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623218_fb5a_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-design-and-manage-a-website-in-21-days/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-26T18:48:03Z"
}