{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this <strong>productivity </strong>course you will learn how to become a <strong>location independent entrepreneur</strong> by mastering a wide range of<strong> tools and resources, automating tedious and repetitive tasks and increasing your productivity 10x times.</strong><strong></strong></p><p>By the end of the course you will know how to <strong>run a location independent business, </strong><strong>manage a remote based team</strong>, <strong>where to find the best resources</strong> and how to leverage different industry standard tools that will help you in<strong> saving time and money.</strong></p><p><strong></strong>Thanks to what you'll learn through the course, you will have more time to focus on what really matters for your success.</p><p><strong>Audience</strong><br></p><p>If you are an <strong>entrepreneur</strong>, a <strong>development manager, or an online freelance</strong>, this course is for you. No matter if you are not familiar with any of the topics and the tools mentioned in the course because <strong>we will guide you step by step through each one of them, from setting up your account to the most interesting features</strong>. </p><p><strong>Content and Overview</strong><strong></strong><br></p><p>This course covers various aspects of running a modern online business. The sections, at the minute, are covering the following topics:</p><p><br></p><ul><li><strong>Location Independent Lifestyle</strong></li><li><strong>Video conferencing</strong></li><li><strong>Remote Based Teams</strong></li><li><strong>Virtual Assistants</strong></li><li><strong>Coworking Spaces</strong></li><li><strong>Virtual Addresses</strong></li><li><strong>Project management</strong></li><li><strong>Team communication</strong></li><li><strong>Mail Automation</strong></li><li><strong>Social Automation</strong></li></ul><p><br></p><p>For each tool presented you will learn the advantages and the functionalities of each different plan available and you will get the best out of the free plans.</p><p><strong>Each section is accompanied by a practice activity</strong> that will help you becoming familiar with the tool.</p><p><strong>By the end of the course</strong> <strong>you will have learned how to use a wide range of online tools to maximize your productivity</strong>. </p><p>You'll discover how to improve in project management, communication with customers and your team; </p><p>You'll learn how to create, manage and send newsletters as well as analyze the effectiveness of your campaigns.</p><p><strong>Online Services and tools covered in this course</strong></p><p><strong>Appear</strong> - One of the easiest webconferencing service. No registration is required to start using it!</p><p><strong>Slack</strong> - 100% team communication! Hardly you will find a tool as powerful as Slack is. </p><p><strong>Asana</strong> - One of their motto is \"Working without email\", maybe they're right!</p><p><strong>Mailchimp</strong> - This is one of my favorite tool for managing newsletters and mailing list. Try how can be easy send email campaign.</p><p><strong>Buffer</strong> - The tool that allows you to manage and schedule the publication of your posts on the main social media</p><p>At the end of this course you will be completely autonomous and able to manage your time online in the most effective way.<span></span></p><p>See you inside the course!</p>", 
    "end_date": null, 
    "title": "Learn How To Work From Home, Be Productive And Escape 9-5", 
    "price": "20.00", 
    "instructors": "Alessandro Russo, Stefano A. Rossetti", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631712_d88d.jpg", 
    "course_url": "https://www.udemy.com/web-productivity-hacks-learn-how-to-run-an-officeless-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T20:43:39Z"
}