{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  You are about to discover the secrets to making money with public domain.  </p>  <p style=\"\">  \t  The Public Domain is a world of free content and resources that you can exploit, use, sell, and give way to build your online empire.  </p>  <p style=\"\">  \t  You will learn how to use the public domain as is or to create new products. You'll find out what is in the public domain.  </p>  <p style=\"\">  \t  This is a great way to start a business, or to use in your existing business.  </p>  <p style=\"\">  \t  You'll find out:  </p>  <ul style=\"\">  \t<li style=\"\">How to find material that's free and clear for you to use.</li>  \t<li style=\"\">How to locate and verify public domain works.</li>  \t<li style=\"\">What topics sell.</li>  </ul>  <p style=\"\">  \t  You will learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to get started making money with public domain.</li>  \t<li style=\"\">How to package your work for sale.</li>  \t<li style=\"\">Where to sell you products.</li>  \t<li style=\"\">Everything you need to know to monetize your public domain works.</li>  </ul>  <p style=\"\">  \t  You will find everything you need to know to get started making money in the public domain,  </p>  <ul style=\"\">  \t<li style=\"\">from finding copyright-free books, photos, illustrations, art, music, videos</li>  \t<li style=\"\">to preparing  them for sale</li>  \t<li style=\"\">to selling your products online.</li>  </ul>  <p style=\"\">  \t  You'll also get lots of links to essential web resources.  </p>  <p style=\"\">  \t  And best of all, you don't have to spend another dime of your own money to profit from the public domain!  </p>  <p style=\"\">  \t  You will be given homework after each section.  </p>  <p style=\"\">  \t  The homework is designed to guide you through the process to making and selling your own product.  </p>  <p style=\"\">  \t  Do the homework as we go along and you will have a completed project ready to sell at the end of the course.  </p>  <p style=\"\">  \t  You will get the PDF for each section.  </p>  <p style=\"\">  \t  You will get a PDF of URLs for each section.  </p>  <p style=\"\">  \t  You will get a PDF of resources.  </p><p style=\"\">I have updated the course as of Aug. 28, 2015.  If you signed up for the course before then please read the update in Section 8 Lecture 30.  I have also added a bonus lecture 27.<br></p>", 
    "end_date": null, 
    "title": "Learn How To Profit With Public Domain", 
    "price": "20.00", 
    "instructors": "Linda Tremer", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/205720_7c22_5.jpg", 
    "course_url": "https://www.udemy.com/profiting-with-public-domain/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-26T23:57:06Z"
}