{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you want to leave your dead-end job but fear that you can't earn a great income to sustain your lifestyle?  You Are In the Right Place because this brand new online course by Louise Anne Maurice of Wealth Coach Academy called Lifestyle Business: Become a Life Coach Work from Home was created for you!  Keep reading..</p>\n\n<p>Maybe you are at that point in your life where you want to stop the 9-5 grind, stop wasting hours of your life in rush hour traffic and stop doing things you hate just to make a buck.  </p>\n\n<p>I know that is how I felt and becoming a Life Coach was the perfect solution.</p>\n\n<p>The problem is Life Coach Certification Courses don’t teach enough about the business or money side of coaching.  They don't teach you how to have a lifestyle business.</p>\n\n\n\n<p>Wealth Coach Academy has helped many new Life Coaches and Certified Life Coaches from other programs feel competent with the business of Life Coaching.\n</p>\n\n\n\n<p>Plus with me as your guide, you will experience less stress and more confidence dealing with the sales, marketing and money side of Life Coaching.</p>\n\n\n\n<p>This course is a perfect blend of a high-level training seminar and hands-on workshop, I developed this course to be a $149 value.</p>\n\n\n\n<p>By the end of this course you’ll know how to implement proven techniques plus much more. \n</p>\n\n\n\n<p>The usual approach to starting a Life Coaching Lifestyle Business doesn’t work for some people.</p>\n\n\n\n<p>In this course I walk you through my 7 part in-depth WEALTHY Framework for building a successful Life Coaching Empire.   \n</p>\n\n\n\n<p>I then show you exactly how to apply this framework to have the lifestyle business that makes money and makes a positive difference\n</p>\n\n\n\n<p>My WEALTHY framework works even with Life Coaches who have been coaching for years yet are struggling financially. \n</p>\n\n\n\n<p>This course is ideal if you want the simple lifestyle business blueprint and an easy step-by-step plan to follow\n</p>\n\n\n\n<p>As a bonus, you walk away with extra resources and a 46 page manual complete with usable activities to keep as your guide plus lifetime access to coaching and consulting – all from your one-time low course enrollment fee.  \n</p>\n\n\n\n<p>Click on the \"START LEARNING NOW\" button and begin the journey to becoming a successful Life Coach the Wealth Coach Academy way.</p>", 
    "end_date": null, 
    "title": "Lifestyle Business: Become a Life Coach Work From Home", 
    "price": 0, 
    "instructors": "Wealth Coach Academy, Louise Anne Maurice", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/860928_1981_3.jpg", 
    "course_url": "https://www.udemy.com/lifestyle-business-become-a-life-coach-work-from-home/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-26T21:03:21Z"
}