{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em><strong>Special Promo Price THIS MONTH only! The price will increase by $10 on July 1st 2016!</strong><br></em></strong></p>\n\n<p><strong><em>There is a reason why this course is LITERALLY the following:</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>#1 TOP PAID Business Course across the board!</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>#1 EBAY course on the internet!</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>#1 MOST POPULAR Business Course <strong>across the board!</strong></em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>#1 HIGHEST RATINGS  and HIGHEST # of REVIEWS in the business category!</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>My most favorite stat, the #1 HIGHEST ENGAGEMENT COURSE! (Thank you to all the students inside the course, it is a REAL community)</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Happy students = Happy reviews. The most comprehensive course with nearly 7 hours of lectures, nothing is left out in this course! </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>More importantly, there is a reason why you landed here today to read this. We both understand how precious time is, and I assure you I am not here to waste your time or have you waste mine. Read on.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>JOIN OVER 13,000 STUDENTS WHO HAVE ENROLLED IN THE FIRST 12 MONTHS!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>We are creating a real community of online entrepreneurs.</strong><strong></strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>LATEST: Course updated on July 2016 with more lectures.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Is your goal to earn more income in 2016? Can you believe how fast last year went by? If <strong>increasing your income</strong> while decreasing your work time is one of them, then look no further this course is your ticket!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You can start learning the proven methods I have used for the past 2 years to earn over $10,000 a month, that's over $100,000 a year. The infamous 6 figures everyone chases!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In 2014 I earned over $100,000 in profit my first year doing this! Please see preview video for proof of income. I'm just a normal guy if I can do it you can too.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Did you know in 2014, close to <strong>18 billion dollars</strong> was spent on Ebay alone? Currently there are <strong>155 million people</strong> active and shopping on Ebay! What that means is millions of transactions happen resulting in millions of dollars in sales per day world wide! These numbers are HUGE!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So what does that spell out for you? Big opportunity! Please preview the course video (1st lecture for Free!)</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I'll be frank this course is NOT a get rich quick scheme. This course outlines a simple proven way to earn a part time, or even significant full time income. Your earnings will be based on your ability to learn and <strong>EXECUTE</strong>. You can sign up for a gym membership but sitting around at home watching TV will not get you fit &amp; in shape right?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>NO hype. NO BS. NO gimmicks. You may have heard this before, however this time is different. This is a transparent gloves off A-Z 1 2 3 blueprint. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What would an extra $2,000 a month do for you &amp; your family? How about $14,000? Would that be life changing? Keep reading! You might be saying yea right that's great for you, but could it really happen for me? I have already helped hundreds of students from all over the world do this and receive messages daily from them with their success stories and sales!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This business requires very little time which gives you something more precious than money…TIME FREEDOM! Think about what you could do if you had that? You could spend more time with your family, travel, or finally pursue that passion you have always wanted to.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Be one of the students to enroll and learn all of my closely guarded secrets! Am I going to guarantee you overnight success? Absolutely not, that would be unrealistic, we're all mature enough to know that there are no guarantees in life. Anyone promising that is lying. This is a real business that requires real work that can take months to even a year to produce the income you're looking for. Here is what I can promise you…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you're coach-able with a good attitude, a willingness to work, and you follow my system you will earn income. Even after your first 90 days the profits can be awesome!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>How much capital will you need to invest to start? Next to nothing, because the strategy I use requires no up front capital! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What you will learn:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>1. How to setup an ebay store and optimize the correct settings</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>2. The core concepts of Drop Shipping</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>3. The core concepts of creating a \"Lifestyle Business\"</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>4. A view of my store, products I sell, ebay back office.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>5. Why and where I source products from</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>6. How to scale up your business to work 15 mins a day or less</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>7. Start to finish guide on how to do every aspect of the business</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>…and much more!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What you will need:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>1. A computer or laptop</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>2. Open minded</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>3. 5-10 hours per week to start, you must master the skills before you can teach someone else to do it. Then it can be 15 minutes a day of maintenance.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What you will get:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>1. On going support from me through the Udemy platform including chat discussions and private messages. One caveat: Im human and not a robot so response times may vary especially if we're in different times zones.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>2. My formulas and systems I have created for success</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I applaud you for reading this far. This course will be unlike anything you have ever seen, and is a simple business model just about anyone can run.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What's my motivation for teaching it? I have always been passionate about helping others, and in the past 2 years I have had my first real taste of it. I personally mentored 6 of my close friends (students) with this system but on another business to see if it was truly duplicateable, and it is! Two out of the 6 are making over $100,000 a year. One of them did it in their 1st year making $114,000 in profit! Now as an update since the launch of this course, literally hundreds and hundreds of students are making $500-1000 per month. Some have even reported making $4000-5000 per month! All the case studies have been tested hundreds of times and it works. The only missing ingredient is for you to get in and work it!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It brings me much joy to hear their success stories and their expressed gratitude warms my heart.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Reminder: Udemy has an unconditional 30 day money back guarantee so there is no risk. You have everything to gain and nothing to lose! I will stress this as well and stand behind this course, if you feel that you have gained NO VALUE at all within 30 days, I will personally guarantee you a refund! I am confident in what I have created. This course took several weeks, 8-10 hours per day, recording and editing. I have poured my heart and soul into this course and left nothing on the table. Everything I know and have done is all here.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Lets create your success story together! Click on the “take this course\"</strong> link at the top right of this page right <strong>NOW!</strong> Don't let another minute go by not living your dreams. Enroll right away to be one of our students in our online entrepreneur community, and stake your claim in this wide open market!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>David Vu </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Serial Entrepreneur, Fisherman, World Traveler, Happiness Ambassador</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>UPDATE:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Here is a review from one of my students that just blows me away. We have created <strong>THOUSANDS </strong>of success stories similar to this. Shaine Warren is a real student on Udemy, message her! :)</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Shaine writes: Made over $5,000 and Quit my 'Day Job' :)</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course has literally changed my life for the better. David does an awesome job teaching this system and makes it really easy to follow. Plus he is very active in the discussion board and always answers any questions you have.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I started this course about 5 months ago and I am so glad I took action and followed what is taught. I have since made over $5,000 Net Profit... $3,000 of which has been made this month alone which is what led me to quit my manual labor warehouse 'day job' because I am now making way more on eBay.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This business model is by no means a get rich quick scheme. It does take some effort and work to build it up, but once you get it going there is no looking back :)</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Whether you're just looking to make some extra income or looking for an escape from a not so enjoyable day job, this course may be the solution you need. Just make sure you actually take action and follow the steps provided.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I wish you all the best! :)</p>", 
    "end_date": null, 
    "title": "Lifestyle Business: eBay Drop Shipping Guide Work from Home", 
    "price": "40.00", 
    "instructors": "David Vu", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419658_42ce_4.jpg", 
    "course_url": "https://www.udemy.com/learn-exactly-how-to-work-from-home-purely-selling-and-drop-shipping-on-ebay/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T21:54:08Z"
}