{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Special Promo Price THIS MONTH only! The price will increase by $10 on June 1st 2016!</strong><br></p><p>  \t    What  is your New Years resolution for 2016? If <strong>increasing your income</strong> while  decreasing your work time is one of them, then look no further this  course is your ticket!  </p>\n\n<p>  \t    You can start learning  the proven methods I have used for over 5 years to earn over $10,000 a  month, that’s over $100,000 a year. The infamous 6 figures everyone  chases!  </p>\n\n<p>  \t    In 2014 I earned $205,000 in profit! Please see preview for proof of income. I’m just a normal guy if I can do it you can too.  </p>\n\n<p>  \t    The  Gift Card industry is booming! In 2015 over $100 billion was spent in  gift cards in the US alone. By the end of 2016 that number will be  approximately $120 billion, and is increasing year after year!  </p>\n\n<p>  \t    Somewhere  in the ball park of 10% of those cards go unused…That’s <strong>$10 plus  billion dollars!</strong> So what does this have to do with you? Everything,  less than 5% of the population knows you can sell those cards for cash  and that spells huge opportunity for you getting positioned early  because that number is growing quickly.  </p>\n\n<p>  \t    Here’s  how it works…have you ever received a gift card you didn’t want, and it  stayed in your wallet, purse, or drawer forever collecting dust because you didn't know  you could sell it for cash? Of course you have, and millions of others  have too.  </p>\n\n<p>  \t    I’ll be frank this course is NOT a get  rich quick scheme. This course outlines a simple proven way to earn a  part time, or even significant full time income.  </p>\n\n<p>  \t    What  would an extra $2,000 a month do for you &amp; your family? How about  $16,000? Would that be life changing? Keep reading! You might be saying  yea right that’s great for you, but could it really happen for me? I have already helped other people just like you do the same!  </p>\n\n<p>  \t    This  business requires very little time which gives you something more  precious than money…<strong>TIME FREEDOM!</strong> Think about what you could do if you  had that? You could spend more time with your family, travel, or finally  pursue that passion you have always wanted to.  </p>\n\n<p>  \t<strong>NO  hype. NO BS. NO gimmicks.</strong> You may have heard this before, however this  time is different. This is a transparent gloves off A-Z 1 2 3 blueprint. This  is the first time ever in The Gift Card industry that anyone that has  achieved this level of success buying &amp; selling gift cards has been  willing to to teach it. Still don’t believe it? Try a search on Udemy or  even Google for a gift card selling course, you won’t find it. It doesn't even exist until now!  </p>\n\n<p>  \t<strong>Be one of the first  students to enroll</strong> and learn all of my closely guarded secrets! Am I going  to guarantee your overnight success? Absolutely not, that would be  unrealistic, we’re all mature enough to know that there are no  guarantees in life. Anyone promising that is lying. This is a real  business that requires real work that can take months to even a year to  produce the income you’re looking for. Here is what I can promise you…  </p>\n\n<p>  \t    If  you’re coach-able with a good attitude, a willingness to work, and you  follow my system you will earn income. Even after your first 30 days the  profits can be big!  </p>\n\n<p>  \t    How much capital will you  need to invest to start? That depends on how fast you want to go? When I  started I was broke and only had $50, this was only an experiment to  save money on shopping at first before I quickly realized the potential  as a business. That $50 turned into $500 my first month, that $500 into  $5,000 after a few more months. This is called the snow ball effect,  which I will be teaching you how to do.  </p>\n\n<p>  \t    What you will learn:  </p>\n\n<p>  \t    1. Where to buy gift cards  </p>\n\n<p>  \t    2. The best sources to sell your gift cards for the highest profit margin  </p>\n\n<p>  \t    3. The art of negotiation  </p>\n\n<p>  \t    4. How to set up all the legal stuff, documents needed, accounting spreadsheets etc.. already done for you  </p>\n\n<p>  \t    5. How to advertise your business for FREE! No website required  </p>\n\n<p>  \t    6. Why I have succeeded from the beginning  </p>\n\n<p>  \t    7. Fraud Education, how to minimize losses  </p>\n\n<p>  \t    8. The secret of referral marketing  </p>\n\n<p>  \t    9. An effective trick utilizing business cards to retain customers &amp; increase transactions  </p>\n\n<p>  \t    10. What are bulk sellers and where to find them  </p>\n\n<p>  \t    11.  How to never pay full retail ever again! <strong>Top secret way to saving 5-70%  off almost anything from any store</strong> this alone will pay for this course  many times over, think about that!  </p>\n\n<p>  \t    12. How to become a financial stud not a financial dud  </p>\n\n<p>  \t    …and much more!  </p>\n\n<p>  \t    What you will need:  </p>\n\n<p>  \t    1. A mobile phone  </p>\n\n<p>  \t    2. A computer or tablet (not required, but will make things much easier)  </p>\n\n<p>  \t    3. Any transportation from a car to a skateboard  </p>\n\n<p>  \t    4. Open minded  </p>\n\n<p>  \t    5. 5-10 hours per week  </p>\n\n<p>  \t    What you will get:  </p>\n\n<p>  \t    1.  On going support from our team through the Udemy platform including chat  discussions and private messages. One caveat: we're human not robots so  response times may vary especially if we’re in different times zones.  </p>\n\n<p>  \t    2.  Every single document I've ever created including my personal  spreadsheet templates used to track your business profits and for taxes.  </p>\n\n<p>  \t    I  applaud you for reading this far. This course will be unlike anything  you have ever seen, and is a simple  business model just about anyone  can run.  </p>\n\n<p>  \t    What’s my motivation for teaching it? I  have always been passionate about helping others, and in the past 2  years I have had my first real taste of it. I personally mentored 5 of  my close friends (students) with this system to see if it was truly duplicatable,  and it is! Two out of the five are making over $100,000 a year. One of them  did it in their 1st year making $114,000 in profit!  </p>\n\n<p>  \t    **Update** That student will be joining forces with me, and will be a co-instructor so you will learn from the 2 very best!  </p>\n\n<p>  \t     The other 3 are  making between $1,500-6,000 every month on a very spare time basis. It  brings me much joy to hear their success stories and their expressed  gratitude warms my heart.  </p>\n\n<p>  \t    Reminder: Udemy has  an unconditional 30 day money back guarantee so there is no risk. You  have everything to gain and nothing to lose!  </p>\n\n<p>  \t    Lets  create your success story together! <strong>Click on the “take this course”  link</strong> at the top right of this page right NOW! Don’t let another minute  go by not living your dreams. <strong>Enroll right away to be one of the first  students ever,</strong> and stake your claim in this wide open market!  </p>\n\n<p>  \t    David Vu - Primary Instructor &amp; Jacob Mefford - Most Successful Student/Co Instructor  </p>", 
    "end_date": null, 
    "title": "Lifestyle Business: Reselling Gift Cards - Work from Home", 
    "price": "30.00", 
    "instructors": "David Vu, Jacob Mefford", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374368_bff4_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-make-16000-a-month-selling-gift-cards-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T08:04:20Z"
}