{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>How to Create Amazing Professional Images They’ll Think Cost You Thousands — For Free!</p>  <p>Dear fellow <strong>Interneteer</strong>, have you ever needed a super professional graphic but did <strong>not want to pay for one</strong>?  I <strong>have</strong>.  </p>  <p>Let me give you a list of places where I need <strong>FREE</strong> <strong>professional graphics</strong>…</p>  <ul><li><strong>Udemy</strong> Educational Announcements (and responses).</li><li><strong>Udemy</strong> Promotional Announcements</li><li><strong>Udemy</strong> Content PowerPoint Slides</li><li><strong>YouTube </strong>Channel Headers and Videos</li><li><strong>Blog</strong> Posts and Design Elements</li><li><strong>Pinterest</strong> Posts</li><li><strong>Facebook</strong> Headers and Posts</li><li><strong>Google+</strong> Headers and Posts</li><li><strong>LinkedIn</strong> Posts</li><li><strong>Twitter</strong> Posts</li><li><strong>Tumblr</strong> Posts</li><li>And much, <strong>much more</strong>! </li></ul>                        <p>I used to get super <strong>frustrated</strong> buying images and paying for subscriptions like <strong>Adobe Creative Cloud</strong>.  Let alone the time it took me to run <strong>complicated software</strong> to create branded images and videos for my online teaching campus here at <strong>Udemy</strong>.  </p>  <p><strong>Like Mana from Heaven!</strong></p>  <p>Then <strong>Daniel Hall</strong> showed me a couple of tricks that allowed me — and will soon allow you — to …</p>  <ul><li>Find amazing <strong>professional images</strong> at the push of the “enter” button on your keyboard for <strong>FREE</strong>.  </li><li>Add a stunning array of special effects in a fast point and click design environment to spit out <strong>insane graphics</strong> perfectly sized for any of the uses above.  And this is <strong>FREE</strong> too! </li></ul>    <p>Hi, I am <strong>Dr. Scott Brown</strong>.  I am the author of a number of top rated investing courses here at Udemy.  And I oversee the <strong>University of Puerto Rico Act 20 and 22 Guide</strong>.  </p>  <p>Hence, I find myself constantly <strong>training professionals</strong> to help me publish or co-author Udemy courses.  So, I created this course with national [and international] thought leader on internet marketing <strong>attorney Daniel Hall</strong>.  </p>  <p>Imagine having the power to put together a jaw-dropping Mona Lisa for your next post.  Create a stunning <strong>Udemy Promotional Announcement graphic</strong> in seconds to add high impact to your next post or project.  This is all <strong>waiting inside</strong> for you.  </p>  <p>In the meantime, here are some <strong>kind words</strong> from our student body.</p>  <p>“<em>Anyway, all the best and thank God you are doing what you do.  You are one of those few inspiring individuals that are in a sea of confusion</em>.” -J. C.</p>    <p>Enroll now while this course is <strong>FREE</strong>! </p>  <p>This is a <strong>no risk guaranteed offer</strong>.  If you don’t like the course you can unsubscribe as per <strong>Udemy policy</strong>.  You are also <strong>protected from any form of spam</strong> under Udemy policy.  </p>  <p><strong>Think This is Scarcely Worth Your Time? </strong></p>  <p><strong>Think</strong> again! I used to <strong>waste hours</strong> on graphics that take me less than five minutes today — literally.  </p>  <p>Enroll in this <strong>time saving little miracle course</strong> now for FREE!  How <strong>valuable</strong> is the time in your life?  </p>  <p><strong>-Scott</strong></p>  <p><strong>P.S. WARNING:</strong> Every day you delay learning the money and time saving <strong>graphic</strong> design tricks you’ll discover inside means doing more work and less fun!</p>  <p><strong>P.P.S.</strong> Click that button up there and <strong>enroll right now</strong> for <strong>FREE</strong>! </p>", 
    "end_date": null, 
    "title": "Make Amazing Free Viral Graphics for Facebook & Social Media", 
    "price": 0, 
    "instructors": "Dr. Scott Brown, Daniel Hall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674342_4890_2.jpg", 
    "course_url": "https://www.udemy.com/making-amazing-free-graphics-for-udemy-social-media-posts/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T11:33:56Z"
}