{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Welcome to the world of digital info product creation!</strong> <em style=\"\"><strong style=\"\">Warning</strong></em> - once you enter this world there is no turning back :) Truth is that discovering the secrets to digital product creation will open a world of opportunities for you that can <strong style=\"\">totally change your life.</strong>  </p>  <p style=\"\">  \t          There have been many success stories of regular people just like you and me that have created some basic info product online and the next thing they know, affiliates are promoting the living daylights out of it and sending massive profits into the creators bank account while they are sleeping.  </p>  <p style=\"\">  \t<strong style=\"\">Seriously it happens!</strong> One guy was interviewed on TV and able to retire off of a guide that was basically a compilation of knock off recipes to popular appetizers at well known chain restaurants so that people can make them themselves at home.  </p>  <p style=\"\">  \t       Well I&#039;m not going to say I was interviewed on TV but I certainly have learned the secrets to creating a high quality info product on any topic or in any niche and I do it all the time in my online business. In fact these courses you&#039;re taking on Udemy is one form of an online digital product and you can be replicating the simple tactics involved to create digital products of your own, over and over again. And when its done right will leave you with some <strong style=\"\">nice profits rolling into your bank account.</strong>  </p>  <p style=\"\">  \t           But that&#039;s not all. More importantly, with the power of product creation you also have the power to <strong style=\"\">positively impact peoples lives.</strong> And by using the internet and with the power of today&#039;s social media your reach can be enormous!  </p>  <p style=\"\">  \t          It&#039;s no secret that people are desperately searching the web every single day to find answers to the problems that are haunting their daily lives. Whether it&#039;s about how to make money online, how to cure insomnia, how to stop hair loss, how to lose weight, how to get through to rebellious kids, how to get your ex back, how to cope with a cheating spouse, how to pick up chicks, how to cope with death of a loved one, how to cook healthy food that tastes great, how to improve your golf swing, how to kill it at the black jack table, how to train your dog, how to stop your cat from scratching up your new furniture...<strong style=\"\">do I need to keep going???</strong>  </p>  <p style=\"\">  \t          Fact is that any problem that might cause people to lose some sleep or start searching the Internet for answers or information is a problem that you yourself can help with and also profit from! <strong style=\"\">The opportunity is truly endless.</strong> And don&#039;t think that just because there are already products out there on these topics that you can&#039;t create another one.  </p>  <p style=\"\">  \t          Truth is that <strong style=\"\">competition is a good thing</strong> and a sign you are on the right path. Why try and chop your way through a thick jungle full of nasty insects to reach your destination when you can cruise down a paved highway going 65 in your comfy air conditioned vehicle jamming to your favorite songs!  </p>  <p style=\"\">  \t           Hopefully you get my point by now and for those of you who are thinking that it&#039;s something that you can&#039;t do, <strong style=\"\">I&#039;m here to tell you you&#039;re WRONG!!</strong> Honestly if you&#039;ve made it though grade school or at least have the skills or persistence to pass the 6th grade than <strong style=\"\">you can create products online.</strong> No joke.  </p>  <p style=\"\">  \t          It&#039;s not as much of a mystery as everyone wants you to believe. It&#039;s actually very easy once you use a couple of basic mind hacks to instantly get you thinking like a product creator and with the <strong style=\"\">right guidelines and simple formula</strong> for doing so.  And once you do it once, you will have kicked the door of opportunity wide open and stepped onto a path of living the internet lifestyle. And with the right guidance and tools in your belt like digital info product creation will often <strong style=\"\">result in working only when you want</strong> <strong style=\"\">to</strong> and <strong style=\"\">from</strong> <strong style=\"\">anywhere in the world with an internet connection.</strong> Even airplanes can have internet connection these days! :)  </p>  <p style=\"\">  \t          So if this is something you may be interested in discovering for yourself then I highly suggest you check out this course that will teach anyone how to <strong style=\"\">easily make their own info products</strong> on any nearly subject <strong style=\"\">for</strong> <strong style=\"\">repeat profits online!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">You won&#039;t be disappointed ;)</strong>  </p>  <p style=\"\">  \t          To your success,  </p>  <p style=\"\">  \t          John  </p>", 
    "end_date": null, 
    "title": "Make Info Products Easy For Repeat Online Profits!", 
    "price": "40.00", 
    "instructors": "John Zapata", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/221504_4ec6_8.jpg", 
    "course_url": "https://www.udemy.com/make-info-products-easy-for-repeat-online-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-17T18:39:50Z"
}