{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>My Udemy courses have been taken 100,000 times by over 25,000 students, have been awarded countless 5 stars reviews.<strong class=\"redactor-inline-converted\"> </strong></p>\n\n<p><em class=\"redactor-inline-converted\">Course Up to date for 2016. Only fresh information.</em></p>\n\n<p>Let me show you how I run my businesses. You play the videos, sit back and relax while I run you through every step that is needed to craft beautiful 1080p videos using only free softwares, and sell them for a ridiculous profit.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">But let's not get stuck in 2D here.</strong></p>\n\n\n\n<p>Even though you can absolutely sell these videos as a service, earning up to $150 an hour (proof of this in the course), there is much, much more to video marketing, and it has the potential to elevate your life like it did mine.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">WATCH the promo video for a sneak peek into some of my earnings.</strong><br></p>\n\n\n\n<p>The video marketing world is on FIRE. If you can craft good looking videos, you are sitting on a pot of gold. There is so much demand out there it's ridiculous.</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">Let me show you how to..</em></p>\n\n<ol><li>Create stunning videos in three different formats that customers will jump all over, and using only free tools</li><li>Easily craft a great script that will keep your customers coming back</li><li><strong class=\"redactor-inline-converted\">The EXACT platforms and strategy</strong> I use to get much more business that I can possibly handle</li><li><em>A case study showing you over the shoulder my sales script and how I get free traffic from interested prospects</em></li><li>How to treat your customers right and turn them into repeat customers</li><li>..and much, much more</li></ol>\n\n<p>Every marketer's head spins at the thought of having to create their own video content. <strong>They think it's hard, so they would rather pay you $500 to do it.</strong><br></p>\n\n\n\n<p>So if that sounds good to you, we welcome you abroad. Oh and you get an unconditional 30 Days money back guarantee too.</p>\n\n\n\n<p>Enroll now and let's get started!</p>\n\n<p>-Howard</p>", 
    "end_date": null, 
    "title": "Making and Selling Simple Sales Video for Beginners", 
    "price": "50.00", 
    "instructors": "Howard Lynch", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818100_61ec_3.jpg", 
    "course_url": "https://www.udemy.com/making-selling-simple-sales-videos-method-case-study/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-10T19:24:29Z"
}