{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This course is not about freelancing.</strong></p><p><strong>This course is about marketing.</strong></p><p><strong>The best freelancers are NOT those with the best skill set or even the ones with the most education or experience.</strong></p><p>  \t<strong>Ultimately the best freelancers are those who can market themselves effectively.</strong></p><p><strong><span></span>______________________</strong></p><p><strong>Course Updated as of Jan 2016</strong></p>  <p><strong>30+ Excellent Reviews! Join 800+ Highly engaged students!</strong>  </p>  <p>  \t<strong>Get access to private FB group where course students share actual winning proposals!!</strong>  </p>  <p>  \t<strong></strong>_______________________  </p>  <p>  \t<em>\"</em><em>This course is a master class! All of the important factors of marketing and salesmanship that are necessary in all fields, presented for the Elance platform.\" -</em>Barry Reitman  </p>  <p>  \t<em>\"Salma is an expert at winning jobs on elance. So many valuable tips in this course. It's great even if you never plan to sell on elance but just want to sell yourself better anywhere else online.\" -</em>Scott Duffy  </p>  <p>  \t<em>\"The course gives great insights into the workings of the mind of the buyer and how to align yourself with her needs and feelings.\" -</em>Thrandur Arnthorsson  </p>  <p>  \t<em>____________________</em>  </p>  <p>If you've ever hit your head against making a healthy recurring income on freelancing sites such as Upwork (formerly called Elance), Freelancer, Guru, etc , then this course is for you! In it you'll learn that <strong>freelance success is all about how to market yourself</strong> so you leave a positive &amp; memorable impression on the client. You'll also learn how to <strong>stay away from horrible clients</strong> &amp; work only for the best ones who can <strong>pay your full market rates</strong>.</p>  <p>  \t                                                 We'll go through key areas such as:  </p>  <ul>  \t<li>How to find your \"Ideal Client\" &amp; pitch to them</li>  \t<li>The science behind why people say \"YES\" &amp; how to use that to differentiate your proposals</li>  \t<li>How to become the Most Favored Freelancer (MFF) so that clients choose you by instinct</li>  \t<li>Practical examples of my own winning proposals with awesome feedback</li>  \t<li>How to write proposals based on one of the 4 Proposal Templates</li>  \t<li>How to stop hustling after clients &amp; instead make them come to you</li>  \t<li>How to always charge your market rate prices &amp; not get bullied by low-balling clients</li>  </ul>  <p>  \t<strong>            DOWNLOADS &amp; TEMPLATES:</strong>  </p>  <ul>  \t<li>4 Proposal Templates (with sample templates filled out)</li>  \t<li>Buyer Persona Development Template &amp; Questionnaire</li>  \t<li>Pre-Bidding Checklist to Identify your Ideal Buyers &amp; Projects</li>  \t<li>Proposal Writing Checklist</li>  </ul>  <p>  \t<strong>            ACTIVITIES</strong>  </p>  <ol>  \t<li>BUILD A BUYER PERSONA for your Ideal Client</li>  \t<li>SHORTLIST 3 PERFECT PROJECTS according to buyer &amp; project checklists</li>  \t<li>WRITE A WINNING PROPOSAL &amp; share it with the course community for feedback</li>  </ol>  <p>  \t<strong>START</strong> working smarter, not harder by identifying who you really want to work with  </p>  <p>  \t<strong>START</strong> wowing your \"Ideal Client\" with unique insights into what will make them say yes to you  </p>  <p>  \t<strong>START</strong> charging what you're worth &amp; making at least $2000 per client  </p>  <p>  \t<strong>START</strong> enjoying the freedom and flexibility of freelancing  </p>  <p>  \t<strong>STOP</strong> wasting your time writing bid after bid &amp; getting rejected  </p>  <p>  \t<strong>  STOP</strong> feeling bad working with horrible low-paying clients  </p>  <p>  \t<strong>  STOP</strong> hustling for clients on a daily/weekly basis  </p>", 
    "end_date": null, 
    "title": "Marketing for Freelancers: Get Inside your Client's Head", 
    "price": "20.00", 
    "instructors": "Salma Jafri", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312764_780d_3.jpg", 
    "course_url": "https://www.udemy.com/freelancewithelance/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T09:50:02Z"
}