{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated on December 2015:</strong></p><p><strong>Enroll on this Course right now</strong>. You can be making more money next week that you are doing today.</p><p>__________________________________________</p><p>***** <strong>Top 50 Udemy Authors in the Business Finance Industry</strong> - <em>eSkillsToday Award</em> *****</p><p>***** <strong>Ricardo is one of the best Instructors and my favorite when we are talking about Passive Income and Business Development. Hands down.</strong> - <em>Mike Robinson</em> *****</p><p>__________________________________________</p><p><strong>Who is this course for and why you should take it (in 1 minute):</strong></p><p>Hello and welcome to the Course, where I’ll take you through the entire process of creating a professional looking website with no coding involved, from scratch.  My name is Ricardo Ribeiro and I’m an awarding winning Instructor in the Business Finance Industry, with more than 15 years experience, owner of several successful businesses, with thousands of dollars made on Passive Income, and an enthusiast of Personal &amp; Business Development. </p><p>This certified course is for you that seeks to create a great looking and professional website. Throughout the course we will cover techniques used by professional web designers throughout the world, and walk you through a step-by-step process for creating professional websites on your own, with a simple drag and drop interface using Wix, that can save you thousands avoiding hiring a professional, and… I’ll even include a few “secrets of the pros”.</p><p>--------</p><p>Do you want to build a <strong>Functional and Gorgeous Professional website in a few short hours, that gets results</strong>. And don't even have to know how to Code?</p><p>Then this course is just for you! It's perfect to improve your online business and get the web presence you need! You do everything, easily, online at the comfort of your home, <strong>with NO CODING</strong>.</p><p><strong>Save thousands on web designer services.</strong> Today, you need to be able to reach your customers where they are looking. <strong>If you're not on the internet today your business is as good as dead.</strong></p><p><strong>Stand out from the crowd!</strong> I will share with you my experience and the secrets of my success. I am confident you will be able to create a successful web presence for your business after going through this course, even <strong>with no money and no experience</strong>.</p><p>I'm here to walk you through the whole process and break it down in <strong>simple step-by-step videos to build your business website</strong>. At the end you will have a Professional looking website that is <strong>completely yours, with no extra fees</strong> at all, that <strong>gives your customers the confidence to purchase more from you</strong>.</p><p>In this course we will be using WIX, a platform that <strong>will get you free traffic and customers month after month</strong>, the most powerful, free, user-friendly, website building platform, and create amazing, professional looking sites, <strong>which can be updated and edited with the greatest of ease</strong>!</p><p>Absolutely <strong>no technical skills are required</strong> and the developed sites are 100% search engine friendly like Google or Bing, using the latest technology, called HTML5.</p><p>The easy to use editor allows you to create your site just as you want it, using a simple drag and drop method. Just choose the elements you want to add (images, text, contact forms etc) and drag them to the place you want on your site! It couldn't be easier!</p><p>I'm here to help you. I'm available to answer your questions and advice you along the way. Together we can make sure you have great success in your business! <strong>I'm with you on this!</strong></p><p>Thanks for your interest in this course. I put my hearth and soul on everything I do so you have my personal guarantee that you will absolutely love it as the happy students already enrolled, or <strong>you have 30 days money back guaranteed with no questions asked</strong>, so… you have nothing to lose. </p><p>I hope you’re as excited as I am!  If you’re ready to learn more and sign up for the course, <strong>go ahead and hit that Enroll button</strong>, or take a test drive by using the Free Preview feature. See you in the course!</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Mastering Wix: Easily Build a Professional Website in 3h", 
    "price": "20.00", 
    "instructors": "Income Mastering Ricardo Ribeiro", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455646_aa19_7.jpg", 
    "course_url": "https://www.udemy.com/professional-business-wix-website/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T11:23:20Z"
}