{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>The BEST Betting and Gambling Course on Udemy.</strong><strong>The ONLY RISK FREE Betting Course on Udemy. </strong><strong>Join the hundreds of students making risk free profits everyday! </strong>  </p><p>  \t                Finally the<strong> ultimate way</strong> to make <strong>risk free profits</strong> is revealed to the masses. This is not a betting system, it is not a tipster service, it is a simple method that exploits a <strong>loophole</strong> and the generosity of online bookmakers.  </p>  <p>  \t                This is a course that is suitable for people who are looking for a <strong>risk free, tax free second income</strong>. It is suitable for people who are looking to supplement a pension. It can be used a core pillar of a home business. You can profit from this course with just a few minutes of \"work\" a day.  </p>  <p>  \t                You need no experience of sports or betting, neither do you need to be good at mathematics as you use a free online calculator.  </p>  <p>  \t                There are thirteen comprehensive video lectures, supported by downloadable PDFs and online quizzes to test your understanding (we add to these lectures all the time.)  </p>  <p>  \t                Finally, specific details are given of how to use the knowledge gained to profit by £400 to £1000 in just one month.  </p>  <p>  \t                With the 30 day guarantee, this course has to be a no-brainer.  </p>", 
    "end_date": null, 
    "title": "Matched Betting Mastery make risk free profits from betting", 
    "price": "45.00", 
    "instructors": "Mark Garber", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/282678_d520_2.jpg", 
    "course_url": "https://www.udemy.com/matchedbettingmastery/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-17T18:16:22Z"
}