{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>All the big internet workers are making thousands of dollars every month through working Online. <br>You got to make the effort, use your knowledge in Microcontroller and Circuit design and believe in yourself and do hard work to make money online.<br>This course gives you many ideas for different and unique ways to make money online, all of them are valuable method that I use myself to make money Online, and after this course your will be able to use them as well.<br>In this course you will learn to make money in many different ways using your knowledge in Engineering, Microcontroller, Circuit design and programming, you will be able to show the world what you know and make money while doing this.<br><br>One thing to remember, you ll always need a set of skills to make a passive income online.<br>People Often hear about blogging, affiliate marketing, amazon, eBay, google, work from home, and hundreds of other things that don't seem to make any sense.</p>\n\n<p><br>So, I explained these in both theory and practical work, and I show you how I make money using such methods and my Microcontroller Knowledge, this is a really great mix of doing what you love and making money from it, so you will be able to live a perfect life.</p>\n\n<p>Thanks for joining with me and I'm sure you will enjoy your journey.</p>\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Microcontroller: Make 10K A Month Using your Skills", 
    "price": "20.00", 
    "instructors": "Ashraf Al-Madhoun", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806322_c899.jpg", 
    "course_url": "https://www.udemy.com/microcontroller-make-money-using-your-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T17:20:42Z"
}