{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">APRIL 4, 2016 UPDATE: </strong>Udemy has introduced a new pricing structure today. Please message me with any questions you may have regarding this.</p><p><strong class=\"redactor-inline-converted\">Inside you'll learn:</strong>\n\n</p><ul><li>How the Network Marketing platform differs from traditional business</li><li>What a good compensation plan looks like</li><li>How to harness the power of your natural abilities and personality type</li><li>Steps to setting achievable goals and achieving your dreams</li><li>Tried and true methods for promoting your MLM business</li><li>New-school internet marketing methods for online promotion</li></ul>\n\n<p>-</p>\n\n<p>I've been around the Network Marketing industry for nearly 20 years now, and have seen lives transformed through the residual income that is possible with hard work and a desire to grow.</p>\n\n<p><strong class=\"redactor-inline-converted\">My own father has made more than $250,000 a year in residual income through Network Marketing!</strong></p>\n\n<p>Some people say Network Marketing, also known as Multilevel Marketing is a scam. Well, I'm here to tell you that's just plain <em><strong class=\"redactor-inline-converted\">WRONG.</strong></em></p>\n\n<p>Network Marketing has been around for more than half a century and it isn't going anywhere. People are becoming millionaires right NOW, while you're reading this.</p>\n\n<p><strong class=\"redactor-inline-converted\">Still not convinced?</strong></p>\n\n<p>See what the <em>United States Federal Trade Commission</em> says about Multilevel/Network Marketing:</p>\n\n<p><em>\"There are multi-level marketing plans – and then there are pyramid schemes. Before signing on the dotted line, study the company's track record, ask lots of questions, and seek out independent opinions about the business.\"</em></p>\n\n<p><em>Source: United States FTC Website</em></p>\n\n<p><strong class=\"redactor-inline-converted\">My course will teach you exactly how to spot a pyramid scheme from a mile off, and equip you with the knowledge to generate real passive income with Network Marketing.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Enroll today and begin your journey toward a more independent financial future.</strong></p>", 
    "end_date": null, 
    "title": "Network Marketing 101", 
    "price": "20.00", 
    "instructors": "Cody Ray Miller", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480598_e71a_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-passive-income-in-network-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-19T21:19:31Z"
}