{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Das <strong class=\"redactor-inline-converted\">Social Media Marketing</strong> scheint zunächst keine große Herausforderung zu sein. Schließlich sind wir alle in den Sozialen Medien vertreten. <strong class=\"redactor-inline-converted\">Wir posten auf Facebook, sammeln fleißig Pins auf Pinterest und laden Fotos auf Instagram.</strong></p>\n\n<p>Wer das <strong class=\"redactor-inline-converted\">Social Media Marketing allerdings für sein Geschäft</strong> nutzen möchte, muss die Kniffe der einzelnen Plattformen kennen, um möglichst effektiv zu arbeiten.</p><p>Schließlich soll die Gewinnung neuer Kunden nicht viel Zeit kosten aber effektiv sein und unsere potentiellen Fans unterhalten.</p>\n\n<p>In diesem Kurs gibt es eine kurze Übersicht, welche Plattformen es gibt (Facebook, YouTube, Twitter, Instagram &amp; Pinterest) und für welches Geschäft sie geeignet sind. So stellt sich zunächst die Frage, ob man ein Geschäft hat, das sich durch Bilder repräsentieren lässt oder eher ein Geschäft, das seinen Kunden durch Informationen weiterhilft.</p>\n\n<p>Auch schauen wir uns an, wie man <strong class=\"redactor-inline-converted\">Fans und Abonnenten</strong> für seine Social Media Kanäle gewinnt und diese letztendlich dazu bekommt mit uns zu interagieren.</p>\n\n<p>Dieser Kurs bietet einen kurzen Überblick und gibt erste Tipps und Tricks rund um das Thema <strong class=\"redactor-inline-converted\">Social Media Marketing</strong>. Im Social Media Marketing Kurs gehen wir auf die einzelnen Plattformen ein und zeigen und erklären die Kniffe, die man benötigt, um die eigene <strong class=\"redactor-inline-converted\">Fanpage</strong> oder den eigenen Kanal wirklich voran zu bringen.</p><p>Aber in diesem Kurs beantworten wir auch noch die Frage, wie man seine Fans immer wieder mit neuen und vor allem <strong>interessanten Inhalten</strong> versorgt.</p><p>Am Ende gilt aber, dass wir als Geschäft nicht anders können als in den <strong class=\"redactor-inline-converted\">sozialen Medien </strong>vertreten zu sein.</p>", 
    "end_date": null, 
    "title": "Neue Kunden durch Marketing auf Facebook, YouTube & Co.", 
    "price": 0, 
    "instructors": "Monja Wessel, Online Lernen SimpleLife Stories", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700940_41fa_4.jpg", 
    "course_url": "https://www.udemy.com/neue-kunden-durch-marketing-auf-facebook-youtube-co/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-18T18:06:21Z"
}