{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">ATTENTION: THE PRICE WILL GO TO $97 SOON</strong>  </p>  <p>  \t<strong style=\"\">NO QUESTIONS ASKED, 100% <em style=\"\">MONEY BACK GUARANTEE</em>! IF YOU DON'T LIKE IT, YOU DON'T PAY FOR IT!</strong>  </p>  <p>  \t                    Welcome to my course where I will teach you the revolutionary way to make huge money on eBay. Go and watch a few of my <em style=\"\">free</em> preview videos for proof.  </p>  <p>  \t    I've taught almost 4 thousand people on udemy and you can be one of them too!  </p>  <p>  \t                    This isn't like anything you have seen before! I will teach you how to turn <strong style=\"\">5 dollar items </strong>into <strong style=\"\"><em style=\"\">over</em> 100 dollars </strong>over and over again!  </p>  <p>  \t                    What will you learn in this course?  </p>  <ul style=\"\">  \t<li>How to link PayPal and eBay</li>  \t<li>How to list an item</li>  \t<li>Get a professional video made for FREE</li>  \t<li>Put a video in an eBay listing</li>  \t<li>Secrets to easily get you a HOT selling item</li>  \t<li>Turn 5 dollars into <strong style=\"\">over 100 dollars</strong> every time</li>  \t<li>And much more!</li>  </ul>  <p>  \t                    You've probably heard to buy whole sale items and list them on eBay for a higher price or go to a thrift shop and buy cheap stuff to resell. Thats all well and good, but it is a TERRIBLY INEFFECTIVE way to make money! What I will be teaching all of you is how to take two items (each worth 2 or 3 dollars) and combine them into a product worth hundreds! If you don't believe me, watch some of my previews below!  </p>  <p>  \t                Just a little note about me: I have been doing business on eBay for over 3 years. It is actually the first thing that I ever did to make money online and it worked like a charm! I have tried many businesses like drop shipping, reselling whole sale goods, selling things from around the house, ebooks, and so much more. Out of all those, this is by far my favorite (and the most profitable) way to make money on eBay. I guarantee you have never heard of this before so tune in, you're missing out on big money! I wish to pass my eBay knowledge onto you in this course so you can start making lots of money too!  </p>  <p>  \t                    If you are ready to start making huge money on eBay enroll today!  </p>  <p>  \t                    Thank you for the interest! I'll talk to you in my course :)  </p>  <p>  \t                    -Andrew  </p>", 
    "end_date": null, 
    "title": "Online Business Strategies: How to Start & Run an eBay Store", 
    "price": "20.00", 
    "instructors": "Andrew Burich", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319092_5988_2.jpg", 
    "course_url": "https://www.udemy.com/online-business-strategies-how-to-start-and-run-an-ebay-store/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T20:14:10Z"
}