{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                           JOIN OVER <strong>3,000 STUDENTS</strong> ALREADY TAKING THIS COURSE! OVER <strong>100 5-STAR</strong> RATINGS! </p>\n\n<p>  \t<strong><em>Update: </em>Course last updated June 2016</strong></p>\n\n\n\n\n\n<p><em>***</em></p>\n\n\n\n\n\n<p><em>\"My wife and I bought your Udemy course a few days ago, and we just got our first client! It's merely $200 a month, but to me it means freedom!</em></p>\n\n\n\n\n\n<p><em>I don't really care to have millions, but what i want is freedom of time and place, and for the first time in my life, I feel like I am on my way...\"</em></p>\n\n\n\n\n\n<p><em>-Dustin M</em></p>\n\n\n\n\n\n<p>***</p>\n\n\n\n\n\n<p>This is one of the <strong>most comprehensive courses on creating an online marketing company</strong> in all of Udemy.  </p>\n\n\n\n\n\n<p>  \t                             By following the exact steps I lay out in this course, you'll be able to start a business that generates <strong>4-5 figure months consistently &amp; quickly</strong>. I know, I did it myself. <strong>And others who have taken this course are now doing it too!</strong></p>\n\n\n\n\n\n<p>  \t                         Imagine making a small investment now, &amp; <strong>getting your investment back within your first month</strong>! Or even weeks! It's possible if you take the steps taught in this course.  </p>\n\n\n\n\n\n<p><em><strong>\"Worth Every Penny\"</strong></em></p>\n\n\n\n\n\n<p><em>\"This course is an amazing starting point for starting an online marketing business.</em></p>\n\n\n\n\n\n<p><em>\"Important note: This is not a guide to how to be a freelancer but to build a productized business.</em></p>\n\n\n\n\n\n<p><em>\"It gives you the structure and direction you need but ultimately your success will be based on what you do with it, you need to hustle! The course takes you from defining your idea to getting customers and building a team. Really enjoyed the course and I know I have got a huge amount out of it.\"</em></p>\n\n\n\n\n\n<p><em>-Damien F</em></p>\n\n\n\n\n\n<p>  \t                             This course is about creating a new <strong>monthly recurring income</strong> source - your online marketing business. <strong>Imagine getting your first client who gives you $500 a month</strong>. And then you get another one. And another. Before you know it, you're <strong>making more than $9000 a month</strong> or more!  </p>\n\n\n\n\n\n<p>  \t<strong>Create a Fully Functioning Online Business That Allows You to Work Online &amp; Live Anywhere In the World</strong>  </p>\n\n\n\n\n\n<p>  \t                                   Owning an online marketing company is one of the easiest, most profitable businesses to get started.  </p>\n\n\n\n\n\n<p>  \t<strong>Real World Experience from Me to You</strong>  </p>\n\n\n\n\n\n<p>  \t                             In <strong>my first month with this business, I made $2,050</strong>. My very first client was for $400 a month. Not life changing at that point but it's grown every month since then! I've even landed clients with <strong>deals as big as $18,000!</strong> That's when it starts to become life changing!  </p>\n\n\n\n\n\n<p>  \t                             In this course, I break it all down how <strong>you can do the same</strong> literally in a matter of a couple of weeks.  </p>\n\n\n\n\n\n<p>  \t                             Because of the business I built, I was able to take off with my family and travel to some parts of the world we've always wanted to see. After living on the Caribbean island of Cozumel, Mexico for 2 years, we're now traveling through Europe – all thanks to this business.  </p>\n\n\n\n\n\n<p>  \t<strong>  The big value of this course is that it will show you how, step-by-step, to create your own online marketing business - all based on Real-Life experience</strong>  </p>\n\n\n\n\n\n<p>  \t                             You will learn everything from how to name your business to getting your first client to finding a great team to do all of the work for you. If you follow the steps outlined, you will be able to successfully create your own online marketing company and know all of the skills to scale it.  </p>\n\n\n\n\n\n<p>  \t<strong>No Previous Online Marketing Experience Necessary!</strong>  </p>\n\n\n\n\n\n<p>  \t          This course will walk you through the basics of creating your own online marketing business. It will show you how to create a team of experts to do the work for you. This way, even if you have no previous experience in online marketing, you'll still be able to grow this business!  </p>\n\n\n\n\n\n<p>  \t          It will require work on your part. But if you're willing to hustle, then the payoff of having a \"laptop lifestyle\" is huge! After getting everything set up, you'll be able to work from wherever you want, when you want, and have a great income to pay for it all.  </p>\n\n\n\n\n\n<p>  \t<strong>Check Out this Review from a Student already Starting on his own Business:  </strong>  </p>\n\n\n\n\n\n<p>  \t<em>This course really helped me understand the online marketing business a lot more. This lecture baby steps all the way through the initial start up of your company, to getting your first client, and eventually growing the company any size you want. Amazing Value! Would highly recommend. - Clayton O</em>  </p>\n\n\n\n\n\n<p>  \t                                                                Following the steps outlined in this course will remove all risk and doubt from the equation. <strong>This is a proven model</strong>. The nature of the business will allow you to work from home which allows for amazing freedom. Heck, you could even work on the business while living in another country. I do!  </p>\n\n\n\n\n\n<p>  \t<strong>Create a Lifestyle Business You Can Scale for Time and Financial Freedom &amp; Of Course, to Work From Home or Anywhere! </strong></p>\n\n\n\n\n\n<p>  \t                                                                The goal here is to take the mystery out of what it takes to create an online marketing service business.  </p>\n\n\n\n\n\n<p>  \t                                                                This course details exactly:  </p>\n\n\n\n\n\n<ul>  \t<li>What exactly an internet marketing service provider does</li>  \t<li><strong>How to create your own unique offer that will drive new business your way quickly</strong></li>  \t<li>How to set up shop on and offline</li>  \t<li><strong>How you can get your first paying client right out of the gate</strong></li>  \t<li>What tools you'll need to use on a daily basis</li>  \t<li><strong>How to create a solid cash-flow from day one</strong></li>  \t<li>Where to find great team members to do the work for you</li>  \t<li><strong>How to set up systems to run your business from anywhere</strong></li>  \t<li>How to scale your business big</li>  </ul>\n\n\n\n\n\n<p>  \t<strong>Get On Top of Your Business, Not In It - Right from the Start</strong>  </p>\n\n\n\n\n\n<p>  \t                                                                If you're willing to work hard (&amp; smart) initially, then you can realistically achieve a <strong>“4 hour workweek\".</strong> It's all based on how much you can hustle, create a great team to do the work for you, and put systems in place for massive growth.  </p>\n\n\n\n\n\n<p>  \t                                                                Most importantly, it's all about taking action! This course will give you the tools and knowledge you need. Now it's time to get started!  </p>\n\n\n\n\n\n<p>  \t<strong>Let's pretend you and I are having lunch together...</strong>  </p>\n\n\n\n\n\n<p>  \t                             You then say, “I'd sure love to ditch my job and have more time and money.\"  </p>\n\n\n\n\n\n<p>  \t                             I say, “Well, why don't you just copy my business? I could show you step-by-step all of the tools and resources you would need. I'll help you with everything from the business name to getting your first client to scaling big\".  </p>\n\n\n\n\n\n<p>  \t                             I've actually had this conversation! I've taught others how to successfully clone my business. They've all started their own online marketing companies and now they've all successfully left their jobs and are working on their businesses full time.  </p>\n\n\n\n\n\n<p>  \t                             Now, through this course, it's your turn!  </p>\n\n\n\n\n\n<p>  \t<strong>ENROLL IN THE COURSE NOW!</strong>  </p>\n\n\n\n\n\n<p>  \t<strong>::</strong>  </p>", 
    "end_date": null, 
    "title": "Online Marketing Business: Create Your Agency, Step-by-Step", 
    "price": "45.00", 
    "instructors": "Sean Marshall", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/291962_a6d7_4.jpg", 
    "course_url": "https://www.udemy.com/clone-my-online-marketing-business-make-5000-in-90-days/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-01T21:25:34Z"
}