{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\"></em></strong><strong style=\"\"><em style=\"\">We're traveling Africa for an entire year…yet our online income keeps rolling in!</em></strong></p><p>Wow, not another course on making money online! There are so many “get rich quick\" schemes that many people are understandably skeptical. However there are legitimate ways to make money online, and to prove it Hannah, who is just 16 is going to share real techniques that make her real money. Because they are real opportunities they need real work, just like a real job. But if you want to work from home, or want a steady passive income doing things anyone can do, then this is the real course for you!</p><p>We are going to tell you about legitimate ways to make money online. And like with any legitimate job you do you need to be prepared to put in some effort. So don't expect to just click one button and make money. Any course that tells you that I would not trust! However these techniques are not difficult, nor will that take you hundreds of hours. In fact many of the techniques we will share with you are really simple, and you can decide how much effort you want to put in.</p><p>What's really exciting about what we will share with you in the Dynamic Duo who will teach you. Craig, who has a PhD in technology will provide you with key insights and lessons into technical aspects…but in a simple and fun way. Hannah, at just 16 years of age, is an incredible example of what can be achieved. She has been hugely successful making money online…just see her Instagram account that now has over 16,000 followers. She's turned this in money money making opportunities and she will share them, and many more. </p><p>We are traveling Africa…for a whole year, and loving it. However the best part is even though we are not formally working, money keeps coming in. Hannah is loving it as she can keep buying the things she loves. Find out how she's doing it. This is our real story and real opportunities.</p><p><br style=\"\"></p><p><strong style=\"\">Who is this course for?</strong></p><p>If you are tired of being stuck in a job that pays to little. If you are unemployed. If you are a stay-at-home mom/dad. If you are a student. If you are a kid who really wants that new iPhone…anyone who wants to earn money online, anywhere, any time!</p><p><br style=\"\"></p><p><strong style=\"\">What's the course about?</strong></p><p>There are literally thousands of ways that you can earn money online. We do not wish to even attempt to be comprehensive in our coverage of all the ways you can earn money online. What we want to do is show you methods that have worked for us and will certainly work for you. Our focus is on money making methods that use things that you are familiar with or are easy for you to learn. This means that anyone, from 9 to 99 can do this. We will look at using Instagram, Udemy, Gumtree &amp; Ebay, Google, YouTube and others well known tools to make you money.</p><p><br style=\"\"></p><p><strong style=\"\">Why this course?</strong></p><p>There are lots of courses that teach you how to make money online, and this may surprise you, but we recommend you do them. The more you do courses the more you learn. However there are two things to consider – are these courses aimed at ordinary people, and secondly do they have other motives. This course is aimed at “ordinary people\", like 16-year old girls or stay-at-home parents, or budding entrepreneurs. You don't need any special skills, special magic gifts. Secondly we have no other motives. Many courses are merely there to get you to sign up for special affiliate programs that will earn the person selling the course extra money. There's nothing specifically wrong with this unless it causes these courses to focus only on things that earn the teacher money. There is one link in Selling Online Courses online that will earn us some money if you click it, but we would have shared this method anyway because it's been so amazing for us. We are only sharing what works, and is simple to do.</p><p>In addition to this, we make sure that our courses are fun. You are not only going to learn, you're not going to nod of while learning…like so many courses make me do. After all learning should be informative and fun!</p><p><br style=\"\"></p><p><strong style=\"\">What kind of materials are included?</strong></p><p>The course includes everything you need. The lectures are professionally created, as people have come to expect from Teachernology courses. The course is in HD video with high quality audio and images. We will show you everything we explain. </p><p><br style=\"\"></p><p><strong style=\"\">How long will the course take to complete?</strong></p><p>There are 9 sections to this course, with each section providing short powerful videos on individual concepts. Learning to become make money online is not difficult but as we said at the outset it does take effort. This is not a “get rich quick course\". This is a course on legitimate ways to make legitimate money. As such this course will take you just under 2 hours to complete…but the exciting news is that you can choose to focus on just one section and try that before moving on, because each section is a standalone money making opportunity!</p><p><br style=\"\"></p><p><strong style=\"\">How is this course structured?</strong></p><p>This is an action course. So the course, after an Introduction, starts with getting to the doing straight away. The course is structured in the following way:</p><ul style=\"\"><li><strong style=\"\">Section 1 – Introduction</strong> - The purpose of this first section is to introduce you to your teachers and also give you a brief overview of the course. Each section stands largely alone, so you can pick and choose, just like at your favorite deli.</li><li><strong style=\"\">Section 2 – Instagram</strong> – Known as the most engaged online social media platform this is an obvious choice to make money. Learn how easy it really is, even if you are just starting.</li><li><strong style=\"\">Section 3 – Online Courses</strong> – Just like this, learn how to make a course and turn it into some real money</li><li><strong style=\"\">Section 4 – Gumtree &amp; Ebay</strong> – Use these popular sites to your advantage and learn how to make money from them</li><li><strong style=\"\">Section 5 – Gumtree</strong> – This lesson focuses on Gumtree and how to setup an account and use it to make money like you learnt in Section 4</li><li><strong style=\"\">Section 6 – Buy to Sell to Earn</strong> – We revisit a tried and tested technique but with some great twists and advice that really make this work.</li><li><strong style=\"\">Section 7 – Getting a free wardrobe</strong> – This is an exciting section where Hannah shares how she got a free wardrobe, and lots more, and how you can also do this.</li><li><strong style=\"\">Section 8 – Google Ads</strong> – You've seen them, they are everywhere, now its time you stopped clicking them and started earning from them!</li><li><strong style=\"\">Section 9 – YouTube</strong> – Everyone loves YouTube, but you are going to love it a whole lot more when you see how easy it is to make money here.</li></ul><p><span></span></p><p><strong style=\"\">Why take this course?</strong></p><p>If I am looking for an online course there are 3 key things I look for. Firstly, the qualification/experience of the teacher. Secondly, the ability of the teacher to teach/present. Thirdly, the quality of the teacher's material. So here are my credentials.</p><p>1.  My Qualification/Experience - I have just completed a PhD in the use of IT for education. I've been involved in IT both as a university lecturer, IT consultant and entrepreneur for over 20 years. This includes starting up multiple businesses both online and offline. Yet it's more than this. You want to be taught simply and practically. That's why I've teamed up with Hannah, who at just 16 years of age has many successful online businesses. Together we will show you how you too can earn money online.</p><p>2. Ability to teach - In addition to having been a lecturer for over 20 years I have spoken around the world to everyone from business leaders to politicians to teachers to children. But don't believe me, here are what some of those who have heard me say:</p><p>\"<em style=\"\">Craig has the rare ability to engage personally with each member in his audience</em>\" (A. Byrnes, PDM Pty Ltd, Australia),</p><p>\"<em style=\"\">Craig is a dynamic speaker, out-of-the-box strategic thinker and professional</em>\" (R. van Rooyen, Associate Partner, Deloitte)</p><p>“<em style=\"\">Mr. Blewett is a pleasure to take in. The excitingly focused style by which he speaks keeps you on the edge of your attention</em>.\" (C. Stickney, USA)</p><p>“<em style=\"\">Craig is an experienced and highly competent teacher and presenter. He has the rare ability to convey innovative concepts in an engaging fashion that is packed with enthusiasm but also logic and balance</em>.\" (Dr. Alleyne, UK)</p><p>\"<em style=\"\">Craig is possibly one of the most interesting presenters I have encountered. His students love him and in public forums he is unequalled</em>.\" (Prof. Maharaj, UKZN, South Africa)</p><p>3. All the material presented in this course is professionally produced using HD video, high quality audio and specialist video editing software. Besides all this, you wont find a better value, easier course that will enable you to learn how to make money online!</p>", 
    "end_date": null, 
    "title": "Online Business: 9 Proven Ways to Build a Career from Home", 
    "price": "25.00", 
    "instructors": "Craig Blewett", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465620_01cf_4.jpg", 
    "course_url": "https://www.udemy.com/online-business-9-proven-ways-to-build-a-career-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T06:46:21Z"
}