{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Xmas Special Get This Course For $15 Using Coupon Code \"Merry+Xmas\"</strong>  </p>  <p style=\"\">  \t     eBay is one of the most used website online today, currently ranked at 21st on the entire web. Millions of people buy from eBay everyday, and we can get a commission from those people.  </p>  <p style=\"\">  \t     With the top eBay affiliate earning millions of dollars every year its not hard to sell on eBay. In fact eBay sells 40% of everything that gets listed. Now I hope that make you think about joining eBay.  </p>  <p style=\"\">  \t<strong style=\"\">\"I'll teach you more about how to create a powerful effective moneymaking website than your competitors will know in their entire careers.\"</strong>  </p>  <p style=\"\">  \t    Did you ever see a magician saw a lady in half? A sword swallower gobble down a 28-inch blade? A swami walk barefoot over a bed of fiery coals? These tricks are amazing. Mind-boggling. And seeming impossible. But the truth is, if you knew the secrets behind them, you could do them too.  </p>  <p style=\"\">  \t<strong style=\"\">Creating effective websites is no different!</strong>  </p>  <p style=\"\">  \t     So here I am going to take your hand and walk you through every step. The course will be structured with easy to follow along system, starting from the very beginning until you start making money.  </p>  <p style=\"\">  \t<strong style=\"\">Learn the 10 MUST have plugins for your website</strong>. You wont want to miss this.  </p>  <p style=\"\">  \t    If you're ready to learn the secrets  </p>  <p style=\"\">  \t    I'm ready to ready to teach you!  </p>  <p style=\"\">  \t     This course may take a day to complete or a month everyone works at their own pace, there is no pressure to complete this course.  </p>  <p style=\"\">  \t     I will be holding a Live Session on here for everyone to get a chance to talk to me and share their ideas as I share mine.  </p>  <p style=\"\">  \t      Also for people who purchase this course I will be giving away a very special domain and website fully designed with traffic going to it. All you have to do is add your own affiliate links to it. (Winner will be announced at the end of live session)  </p>", 
    "end_date": null, 
    "title": "Online Business: How to Become an eBay Affiliate", 
    "price": "25.00", 
    "instructors": "Wayne McDonald", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/127644_1b01_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-money-as-an-ebay-affiliate/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-01T14:44:05Z"
}