{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Are you struggling to make money on Etsy? Do you want to get more views, make more sales and start earning cash on Etsy?...Even if you have no social media followers and no money to spend on advertising?</strong>  </p>  <p>  \t                When you opened up your Etsy shop, you were confident that it would be an instant success, but things aren’t quite working out as planned. Your shop is barely getting any views, sales are few to none and your dreams of making money on Etsy seem totally out of reach.  </p>  <p>  \t                You’re in Etsy start-up hell and you’re getting frustrated — I know how you feel, I’ve been there…and I turned it around!  </p>  <p>  \t                In “24 Strategies I used to Make My First $1000 on Etsy ”, I will show you the simple tactics I used to:  </p>  <ul>  \t<li>Increase my views to 100+ per day with less than 50 items in my shop;</li>  \t<li>Get other shop owners to willingly promote my shop for me (without having to ask);</li>  \t<li>Boost my shop's traffic without lifting a finger;</li>  \t<li>And ultimately, make my first $1000 on Etsy!</li>  </ul>  <p>  \t<strong>All this without a social media following and with no money to spend on advertising!</strong>  </p>  <p>  \t                Etsy success is rarely overnight. It all starts with that first $1000. I will show you how I made mine.  </p>  <p>  \t                If you want to get your hands on my strategies and start implementing them in your shop today, click on the \"TAKE THIS COURSE\" button and I'll see you in the first lesson!  </p>", 
    "end_date": null, 
    "title": "Optimize Any Etsy Shop to Attract More Shoppers", 
    "price": "20.00", 
    "instructors": "Fierce 27", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296409_389d_4.jpg", 
    "course_url": "https://www.udemy.com/optimize-any-etsy-shop-to-attract-more-shoppers/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T15:41:31Z"
}