{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tRunning a business can be absolutely exhausting - whether you're seasoned or just starting out.  </p>  <p>  \tEven if you just want to create a website… you’ve got to buy a  domain, set it up with hosting, get it designed, have compelling copy on  it, figure out what content to post, how often to post…  </p>  <p>  \t…and then you have to get <em>visitors</em> to the darn thing!  </p>  <p>  \tAnd that’s just for ONE thing.  </p>  <p>  \tIt’s no wonder so many of us spend time on Facebook or YouTube,  looking at cat pictures, putting off what should really get done.<strong> It’s  just too freakin’ overwhelming!</strong>  </p>  <p>  \tThat’s why you should lighten your load and hire (inexpensive) help.  </p>  <p>  \tThere are thousands of capable, talented people out there. They’re  looking for work — and many of them will happily take care of whatever  it is you’ve been putting off.  </p>  <p>  \tIf you’d like to spend your time doing what YOU want to do – whether  it be watching TV, playing with your kids, or otherwise making the world  a better place – you owe it to yourself to outsource.<br>  \t<br>  \tThat's exactly what this course will help you with.<br>  \t<br>  \tIn Work Less To Live More, you'll learn how to get an army of people working on your business -- even if you're just starting out with no budget or if you're seasoned and want some advanced tips to get the most bang for your buck.<br>  \t<br>  \t    Check out the course goals and objectives... you'll be surprised at everything we're going to cover. :)  </p>", 
    "end_date": null, 
    "title": "Outsourcing Basics to Save Time and Hire the Right Pros", 
    "price": "25.00", 
    "instructors": "Rachel Rofe", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/196846_a031_3.jpg", 
    "course_url": "https://www.udemy.com/outsourcing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-10T12:16:26Z"
}