{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>You Know You Want to Be a Content Creator</strong></p>\n\n\n\n<p>You have amazing content that you want to share with other people. You know people like your stuff and its time for you to get paid to teach it. That is the life of a content creator and you know you want it. By being a successful content creator you have the freedom to live your life in the way that you want without working for anyone else.</p>\n\n\n\n<p>What happens when it’s time to create content; all of a sudden you freeze. You start to doubt that you might not know enough about your subject to teach it to other people yet. You start to second guess yourself and the voice inside your head starts to say why you can’t do it. </p>\n\n\n\n<p><strong><br></strong></p><p><strong>Every Single Content Creator Faces Fear</strong></p>\n\n\n\n<p>Every single content creators gets these thoughts at some point. There are a bunch of fears that get in the way from us sharing our great content with everyone else. These fears stop us from sharing our content and making the lives of the people around us better. </p>\n\n\n\n<p>The way past these fears to find out where they’re coming from and see them for what they really are; an illusion. By becoming aware of these fears you can start practicing the mindset needed to overcome them.</p>\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p><p><strong class=\"redactor-inline-converted\">Common Fears:</strong></p><ul><li>I’m not good enough to teach others</li><li>I’m not as good as my competitors (not even close)</li><li>I need to get more degrees, awards, etc.. before I can teach others.</li><li>I’m an imposter; sooner or later people are going to realize I don’t know what I’m talking about</li></ul><p><br></p>\n\n\n\n\n\n\n\n<p>We will talk about all of these fears in this course; everybody has them. The most successful content creators are the people that are able to identify what these fears are and move past them. The day you start to overcome these fears will be one of the most satisfying accomplishments you will have as a content creator </p>\n\n\n\n<p><strong><br></strong></p><p><strong>How Do You Get People to See You As an Expert </strong></p>\n\n\n\n<p>Once you overcome your fears of being a content creator you have made it past the biggest hurdle of becoming a paid content creator. The next biggest roadblock is establishing yourself as an expert. It’s not about how much you know; it’s all about how much other people think you know. </p>\n\n\n\n<p>That is what the word ‘authority’ means. Someone that has authority in their target subject is considered to be an expert in that field. Once you have authority people will hand you their trust and will do anything to hear more from you (including pay you).</p>\n\n\n\n<p><strong><br></strong></p><p><strong>Authority Is an Illusion That You Can Easily Create for Yourself</strong></p>\n\n<p>In this course we are going to focus on how authority is an illusion that anyone can create. It doesn’t matter if you don’t have the appropriate university degrees or if you haven’t written a book before. We are going to talk about all of the ways that you can establish yourself as an authority and have your target market look to you as the go to expert in your field!</p>\n\n\n\n<p>Once you become a content creator that has authority you will be surprised at the opportunities that come to you. Everyone wants to learn from the person they think is an expert in a certain field. You could share the exact same content that you have available now and people will pay you 10X as much for it. </p>\n\n\n\n<p><strong><br></strong></p><p><strong>It’s Not About What You Know; It’s About What Other People Think You Know</strong></p>\n\n\n\n<p>If people can trust that you are an expert in the subject they want to learn about they will do whatever it takes to learn from you.</p>\n\n\n\n<p>This course is for any new content creator that has either not made money from teaching yet or hasn’t made as much money as they would like. What’s getting in your way is most likely fear &amp; not being looked at as an expert by your audience. This course will take you past these hurdles and help you turn your content creating from hobby to full-time income. </p>\n\n\n\n<p><strong><br></strong></p><p><strong>In This Course You Will Learn:</strong></p>\n\n<ul><li>How to identify what fears are stopping you from creating content</li><li>How to overcome your content creating fears</li><li>What authority is and why it is so effective</li><li>Why becoming an authority is the best thing you can do for your audience</li><li>How to see yourself as an authority figure and not feel intimated by other successful content creators</li><li>How to build up your own authority so people see you as the expert in your field</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p><p><strong>You Will Be Completely Satisfied with This Course</strong></p>\n\n<p>If you are not 100% satisfied with this course you have 30-days to get an instant full refund. The link below will take you to an article that walks you through exactly how to get a refund (without having to talk to anyone)</p>\n\n\n\n<p>https://support.udemy.com/customer/portal/articles/1507981-how-do-i-get-a-refund-?b_id=3056<br></p><p><br></p><p><strong>The World Needs More Content Creators</strong></p><p>We need more content creators to share their expertise with the world. People want to learn from you. My hope is you get to overcome the fears that are stopping you from sharing your gift with the world. I also hope you become an expert in the minds of your audience so they will trust you and listen to what you have to teach them.</p><p>Have a great day,</p><p>-Eric</p>", 
    "end_date": null, 
    "title": "Overcome Your Content Creating Fears & Become an Authority ", 
    "price": 0, 
    "instructors": "Eric John Campbell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/807700_1e36_2.jpg", 
    "course_url": "https://www.udemy.com/authority/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-29T23:40:24Z"
}