{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><br></strong></p><p>Have you ever wanted to import products from China to sell them on Amazon?  </p><p>Have you ever had a dream about creating your <em>own brand</em>?  </p><p>Does the thought of importing products from China scare you because you don't even know where to begin? </p><p>Do the terms FOB, CIF, T/T and others confuse you or make you frustrated because you don't even want to bother with stuff like this...you just want to sell!?</p><p>If you answered YES to ANY of the questions above, or ALL of them...then this course is for YOU!</p><p>In this course, I will teach you from start to finish, STEP by STEP exactly how I teach my personal coaching clients how to sell their very own products on Amazon.  I walk you through the entire process, \"holding your hand\" throughout, so that there are NO gaps in your learning experience, and after you finish this course, you will be an EXPERT at the entire process that YOU will be able to teach OTHERS how to import, market and sell products on Amazon that you get from China through Alibaba.</p><p>This course is for anyone who needs to add another income stream to their household.  That is EVERYONE in my book!  I doubt there is anyone who is reading this summary who can honestly tell themselves that they have too much money and they don't need to learn this information!  So what is stopping you?  </p><p>Results don't lie folks--I have thousands of satisfied students from my other courses on Udemy, and this course is going to be no different--I have been working on this night and day to ensure that you get the highest quality and the MOST thorough course on this topic on the internet!  I have seen all the courses on this subject, and mine is by far the best one available--just as my previous course about selling on Amazon was as well...this trumps that course and you will be extremely happy you registered!</p><p>Register today and become one of my NEXT personal success stories!</p><p>Thanks for reading...</p><p><br></p><p>Anthony Monfet</p>", 
    "end_date": null, 
    "title": "Private Label Products: Create Brands & Sell with Amazon FBA", 
    "price": "20.00", 
    "instructors": "Anthony Monfet", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408524_dba5_2.jpg", 
    "course_url": "https://www.udemy.com/private-label-products/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-30T23:21:01Z"
}