{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>LATEST: Course updated was on <strong>April 2016</strong>.</p>\n\n<p><strong>There are currently over 3,000 students enrolled in this course!</strong></p>\n\n\n\n<p>This course is 100% free for now, but will cost $100+ in the near future. So get in while the iron is hot.</p>\n\n\n\n<p>Ebay is a Auction website full of opportunity and has more inventory to buy than your local Walmart! I have spent countless hours watching videos, searching google for information, reading articles, and coming up with strategies on my own to conquer ebay. </p>\n\n\n\n<p>In this course I have compounded some of the best stategies, tips, and tricks that I have learned to make money on ebay. This course will save you countless hours searching for the information yourself, and provide you with mind blowing tactics that you definitely want in your arsenal. </p>\n\n\n\n<p>Most people see Ebay as just a means to discard their junk that they have laying around the house. Because of this most people never come close to realizing the full potential of what is possible with ebay. My goal is to open your eyes up to what is possible.<br></p>\n\n\n\n<p>I believe that once people take my course they will have a whole new way of looking at ebay and the opportunity that it presents. If your not 100% satistied with the course, don't worry because you have a 30 day money back guarantee from udemy to get your money back no question asked.</p>", 
    "end_date": null, 
    "title": "Professional eBay Strategies You Can Apply to Your Shop", 
    "price": 0, 
    "instructors": "Justin McDonald", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656726_8a10_6.jpg", 
    "course_url": "https://www.udemy.com/ebay-training-course/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T03:27:19Z"
}