{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>Perhaps you have no course ideas? Perhaps you have one course? Perhaps you have many course ideas? Well, let me tell you this, you can be at any of those stages because on this course we’re going to walk through all three stages to help you generate a profitable course idea.</p><p><strong>I’ll be taking you from “Point A” with no profitable course idea, all the way to “Point B” which will be finding that all important profitable Udemy course idea.</strong></p><p>By the end of this course you’ll have generated a profitable Udemy course idea, which you can then go onto create and flesh out ready to publish live and earning a profit from. That’s the sole aim of this course, there are no beating around the bush lectures or waffle talk.</p><p>The first part of this course is going to be helping you to generate a list of course ideas, I’ll be going through various practical exercises which will help you to generate some great course ideas. Following on from there we’ll go into analyzing the course ideas you have, and work on picking the best one, which will then be followed by refining that specific course idea to ensure it’s the best one. Then we’ll go into how to ensure that the course idea you've chose has the best chances of being profitable.</p><p><strong>My aim for all of you enrolled on this course is, helping you to generate and select the most profitable course to teach on the Udemy platform.</strong></p><p>I’m sure you’ve heard this saying now, it goes like this, “one man’s junk, is another man’s treasure”. Let’s relate that to skills we’ll be teaching, of course we’re not calling our skills junk, we’re just using this to relate.</p><p>So a skill you think that is widely used, and isn’t valuable, simply because you’ve been using it for a long time, may be someone else’s treasure, hence they would pay good money to learn it. We can always learn something from someone, never forget that. So there is no doubt in my mind, you have a specific skill, or set piece of knowledge that someone out there is eager to learn.</p><p><strong>I’ll be helping you to generate profitable course ideas, because it’s better to teach one in-demand course, than seven courses that are not in-demand.</strong></p><p>And just something to end on. Many people think only those people such as Richard Branson, Tim Ferris, Tony Robbins and so on can teach a course. But that’s not true, you too can be an expert in your field and teach a profitable course, remember the dictionary meaning of an expert “a person who has special skill or knowledge in some particular field”.</p><p>That person teaching a profitable course on the Udemy platform could be you! Enroll on this course today to generate your profitable Udemy course idea.</p><p><em>- COURSE UPDATED JAN 2016 -</em></p>", 
    "end_date": null, 
    "title": "Profitable Online Course: Generate Niche Online Course Ideas", 
    "price": 0, 
    "instructors": "Ravinder Deol", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694918_3e67_13.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-idea/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-11T16:36:26Z"
}