{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span>Not really a strong writer? Not a problem! Even though “content is actually king” these days, there are plenty of different content articles which can be created as well as shared in your blog without </span><span>requiring extensive writing</span><span>.</span>  </p>  <p>  \tAs an Entrepreneur and a blogger, I’ve also been afforded a distinctive outlook generally speaking blogging like a business discussion. Bloggers check out blogging because something many people do pertaining to fun, pertaining to creative manifestation, for conference people, for producing money directly from promotion and affiliate marketer promotions or may be indirectly by means of promoting a company. Most writers are either not blogging for money or are smaller content writers. While there&#039;s nothing wrong with that, and I’ve also been living the self occupation life myself for an extended time, it’s not my objective.  </p>  <p>  \tBecause of my businessman mindset I always look at things from your strategic business perspective, not an employee mindset. This mindset has guided me to check business tactic and devices and implement what I learn both around my business and around my blogging. I doubt there are several other bloggers available who believe and work as I do in this regard, and that&#039;s why I enjoy currently talking about blogging like a business model a lot – it’s not territory a lot of people cover given that they just don’t think it&#039;s over.  </p>  <p>  \tThe relationship between content production, traffic and income are the core drivers of a successful blog, so if you intend to take your blogging business serious you need to know your numbers, at least to a basic understanding.  </p>", 
    "end_date": null, 
    "title": "Profitable Blogging: Not a writer? Not a problem!", 
    "price": "20.00", 
    "instructors": "Snehal Wagh", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381958_9ea4_3.jpg", 
    "course_url": "https://www.udemy.com/profitable-blogging-without-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T04:28:47Z"
}