{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do You Want To Make Money Blogging? </strong></p><p>In this course I've created a 4 week step by step blueprint that covers starting your blog, building a mindset for success, and promoting your blog to generate income.</p><p>It's easy to get overwhelmed with all of the information out there today. I've made this course simple and broke it down into 4 weeks of lectures. </p><p>Each week includes homework and assignments for you to complete as you progress through the course. </p><p><strong>Week 1</strong></p><p>I teach you how to get your blog setup with hosting, a domain, a quality theme and how to build your first Wordpress website. I explain how you can make money from your blog. </p><p><strong>Week 2</strong></p><p>I discuss the importance of mindset, focus, consistency and sacrifice in order to build a successful blog over time. This week sets you up for success so you are ready to conquer the world with your blog!</p><p><strong>Week 3 </strong></p><p>In this week I show you how to expand on your blog by creating important core pages and show you how you can build a high quality blog. </p><p><strong>Week 4</strong></p><p>I show you how I've leveraged interviews to build powerful business relationships, form joint ventures, launch products and much more.</p><p><strong>Exclusive Interviews</strong></p><p>Throughout the course I also include interviews with successful entrepreneurs such as Ramsay Taplin of Blog Tyrant and Corbett Barr of Fizzle Co. </p><p>You will learn how to generate traffic to your blog, build relationships with other entrepreneurs, guest blog and much more!</p><p><strong>Why should you enroll in this course?</strong></p><p>I've been blogging for over 5 years. I've taken everything that I've learned and shared it in this course. </p><p>Most of my success has been from building relationships with other entrepreneurs and turning these relationships into joint venture business opportunities such as product launches, and services we offered together. </p><p>I show you exactly how to leverage these same types of opportunities to build wealth with blogging!</p><span></span><ul><li><strong></strong></li></ul>", 
    "end_date": null, 
    "title": "Professional Blogging: A Step-by-Step Blueprint ", 
    "price": "20.00", 
    "instructors": "John Shea", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626016_3960_2.jpg", 
    "course_url": "https://www.udemy.com/professional-blogging-a-step-by-step-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T16:33:13Z"
}