{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>As a new Udemy instructor with no mailing list or target audience. I create my 1st course and got it approve in Mid October 2015. While udemy does a good job in promoting my course but I want to improve my udemy sales. <strong>I do not have any mailing list or any target audience</strong>. </p><p>Well my effort pay off. Promoting udemy courses on warrior forum have double my sales. Promoting on warrior forum cost $20. and I can easily breakeven just by having 2 sales. And often the 2 sales will come in just 1 hour after your WSO is approve. This is a no brainer to me. If I spend $20 for every advetisement campaign and it can bring me $100 - $200 of extra sales. I will do this forever. </p><p>We need to understand not all courses are suitable to be promoted on warrior forum. The forum is a internet marketing forum. Home business, SEO, Internet marketing on make money course sell very well there. Course like how to feed a dog, or eat healthy will not do well. So we need to understand which course we should promote.</p><p><strong>I take you hand by hand, from preparing to creating your very first WSO. you will see me walk you thru and look over my shoulder as I create a new WSO for my ebay course.</strong></p><p>So instructor if you want to increase your course sales. You have to seriously look at warrior forum as a promotional tools.</p><p><strong>This course is not just for udemy instructor, if you have a service or a ebook or product that you want to market or sell on warrior forum, the same strategy apply.</strong></p><p>Promoting your own udemy sales also bring up another good point you keep 97% of the profit. If you promote your course on warrior forum for $10. you get to keep $9.70. And as I mention you only need 2 sales to breakeven on the advertisement fees. And in the worst case your course do not sell, you only lose $20<strong></strong></p><p><strong>What are you waiting for? I will see you on the inside</strong></p>", 
    "end_date": null, 
    "title": "Promote Your Product or Udemy Course on WSO - Unofficial", 
    "price": "20.00", 
    "instructors": "Winston Wee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/666476_b658_2.jpg", 
    "course_url": "https://www.udemy.com/warrior-forum-promote-your-product-or-udemy-course-on-wso/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T04:37:31Z"
}