{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>O objetivo deste curso é ser o seu guia por dentro desta nova modalidade de negócios que é a Franquia Digital da Rede Natura. </strong> </p>  <p>Com linguagem simples e direta, abordaremos a Rede Natura desde o início. Desde o cadastramento como Consultor ou Consultora,  as atividades do dia a dia da Consultoria Digital, a utilização do Moip, o recebimento dos seus lucros, formas de divulgação do seu espaço e relacionamento com o cliente digital.<br></p>  <p>Vou lhe mostrar como administro a minha franquia, de consultora para consultora!</p><p>Este curso foi desenvolvido por consultora digital independente, e não tem nenhum vínculo com a Natura Cosméticos.<br></p>  <p><strong>Você vai fazer o curso no seu ritmo</strong>, assistindo quantas vezes quiser os módulos que lhe interessarem.  O curso é <strong>100% prático</strong>, em caso de dúvidas, basta voltar o vídeo e refazer o passo a passo demonstrado. Associando os conhecimentos deste curso ao seu trabalho dedicado e criativo, certamente você atingirá um novo patamar de vendas e sucesso como Consultora ou Consultor Digital.</p><p>Vou lhe mostrar, passo a passo, direto da tela do meu computador:</p><p>1. Como se cadastrar na Rede Natura, os documentos importantes e os requisitos necessários. O que acontece antes do seu Espaço ficar pronto, e o dia da abertura.</p><p>2. Vamos explorar todas as opções do Painel de Negócios, para que você visualize com rapidez suas vendas e clientes diários. Você também vai aprender a exportar seus dados de clientes e vendas para fazer seus controles internos e conferências. </p><p>3. Navegaremos pelo Moip, onde veremos os principais relatórios e como resgatar os lucros de suas vendas!</p><p>4. Veremos também como se cadastrar no Grupo Oficial da Rede Natura no Facebook, e como divulgar promoções deste grupo na sua página do Facebook. </p><p>5. Você também vai aprender a impulsionar a sua página para ganhar mais likes e mais clientes, e também vai aprender a impulsionar um post, para ter mais visibilidade em suas promoções.</p><p>No final do curso, você terá aprendido uma nova rotina de administração de sua franquia digital repleta de boas práticas. E da melhor maneira: aprender a fazer, fazendo!<br></p>  <p><strong>Clique no botão Fazer este Curso e vamos começar!</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Rede Natura - Guia Prático e Descomplicado", 
    "price": "20.00", 
    "instructors": "Patricia Garcia", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473644_c456_8.jpg", 
    "course_url": "https://www.udemy.com/seja-franqueado-rede-natura-ganhe-dinheiro-em-casa/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-11T17:01:38Z"
}