{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t         Are you looking for a way to make money in your spare time? Do you need to expand your already tight budget? Do you love treasure hunting and learning new things?  If so, this is the course for you!  </p>  <p style=\"\">  \t<strong style=\"\">In Resale Profits, I will share with you how to find great bargains and resell them for a profit. </strong>  </p>  <p style=\"\">  \t         Getting a second job will wear you down.  Starting a business can be expensive.  I will show you how to make a profit starting with just $10 (and have fun along the way).  I&#039;ll teach you how to spot the deals at yard sales, auctions, estate sales, moving sales and then turn right around and sell them at a fair and honest price.  </p>  <p style=\"\">  \t         The key to successful flipping is VALUE.  </p>  <ul style=\"\">  \t<li style=\"\">What is valuable? </li>  \t<li style=\"\">What determines value? </li>  \t<li style=\"\">What does one person value over another? </li>  </ul>  <p style=\"\">  \t         I&#039;ll teach you how to find and take advantage of value discrepancies and start making money.  </p>  <p style=\"\">  \t         I want to bring you lots of VALUE in this course. I&#039;ll use videos, presentations, audio, and resource documents to help get started flipping for profit. In the <strong style=\"\">20 lessons</strong> you&#039;ll learn the basics of finding deals, buying, selling, and I&#039;ll even go over the ethics of this whole thing.  </p>  <p style=\"\">  \t         Join me in this course and I&#039;ll show you a fun way to make money in your own time.  </p>", 
    "end_date": null, 
    "title": "Resale Profits: Flipping Made Easy", 
    "price": "20.00", 
    "instructors": "Matt Peyton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257612_e2fe_3.jpg", 
    "course_url": "https://www.udemy.com/resale-profits-flipping-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-08T10:08:34Z"
}