{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Você sabe como fazer com que a fada da prosperidade te ame? Deixe-a de lado, dê toda sua atenção á fada do conhecimento, e para tentar te conquistar a fada da prosperidade não largará do seu pé. </strong> <strong style=\"\">Existe uma frase empreendedora que diz &quot;Não existe almoço grátis&quot;</strong>, essa frase se aplica a muitos outros assuntos, pare para pensar, <strong style=\"\">investir nesse conteúdo é lançar-se ao sucesso, você ficará rico, apenas abdicando do valor de um almoço.</strong>  O foco desse curso é juntar todo conteúdo já criado com o intuito de lhe ensinar a <strong style=\"\">empreender</strong>, não apenas no meio virtual, como em qualquer oportunidade na vida,  e te mostrar todas as possibilidades existentes para que seja possível trabalhar de casa e ganhar dinheiro com isso. No decorrer do curso você aprende todas as técnicas de como iniciar um negócio digital, formas de como compactar o que você gosta de fazer com seu trabalho virtual. É um curso que foge dos padrões que buscam estagnar a pessoa em uma fórmula apenas, com ele você irá aprender todas as formas possíveis de se conseguir ganhar dinheiro na internet, aprenderá a se virar como webdesigner, para suportar criações de publicidade para sua empresa. Esse curso irá mudar todos os seus conceitos de trabalho.  </p>  <p>  \t  <strong style=\"\">O curso têm aulas com um foco especifico para quem quer ficar rico primeiro e filosofar depois, vamos direto ao ponto.</strong> No o último vídeo a criação de uma empresa virtual fictícia, que te mostrará exatamente todos os processos a serem percorridos. O material inclui, videos, textos, explicações minuciosas sobre os assuntos tratados e muita informação valiosa. Temos ainda um novo estudo que comprova que você pode exercer a mesma função que atua em uma empresa como funcionário, sendo agora, seu próprio chefe.  </p>  <p>  \t  O sucesso está em suas mãos, este curso contém a informação de muitos dos sites que ensinam como ganhar dinheiro com a internet. Evite comprar vários produtos que te prometem muito por um preço caríssimo. Faça um investimento inteligente, tenha sua independência financeira.      •Seja topo em sites de pesquisa    •3 bases da elaboração de negócios    <strong style=\"\">•7 segredos de SEO</strong>  •5 segredos para um marketing digital perfeito    <strong style=\"\">•7 segredos sobre como atrair clientes</strong>    •Ideias e oportunidades, domínios, logos já criados e dados em mãos.    <strong style=\"\">•Verdadeiro segredo dos R$500 por dia</strong>  •Formação de um empreendedor de sucesso</p>", 
    "end_date": null, 
    "title": "Seja seu próprio chefe, segredos revelados sobre a riqueza!", 
    "price": "25.00", 
    "instructors": "Victor Maranhão", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319256_3fd5_3.jpg", 
    "course_url": "https://www.udemy.com/sejaseupropriochefe/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T03:57:10Z"
}