{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          This course reveals how you can make a steady monthly income as a writer by creating ebooks for Amazon Kindle and paperbacks for Amazon CreateSpace.  </p>  <p>  \t<strong style=\"\">Self-Publishing Mastery</strong></p>  <ul style=\"\">  \t<li style=\"\">Foundations for Success</li>  \t<li style=\"\">Content Creation the Easy Way</li>  \t<li style=\"\">Formatting Made Simple</li>  \t<li style=\"\">Proven Promotion Secrets</li>  \t<li style=\"\">Real Examples &amp; Case Studies</li>  </ul>  <p>  \t<strong style=\"\">Reveals Shortcuts to Producing Both Quality and Quantity</strong>  </p>  <p>  \t              You will discover how to create demand driven content that sells! No more books that get left in the dust - supercharge your results.  </p>  <p>  \t              This course includes video lectures and instructional downloads that detail exactly how I make $thousands$ per month as a writer without begging for reviews and without spending a penny on marketing or promotion.  </p>  <p>  \t<strong style=\"\">Content &amp; Overview</strong>  </p>  <p>  \t        You know it&#039;s a fact, tons of writers struggle to gain decent compensation for their work. Maybe you&#039;ve spent days, months, even years toiling over a manuscript only to find that when its&#039; finally uploaded and available to the marketplace, the sales fail to materialize.  </p>  <p>  \t        Starting with market-proven principles as a foundation, this course provides an easy-to-follow system that will jumpstart your book publishing efforts towards a healthy and strong, residual income-producing business.  </p>  <p>  \t  All of the powerful principles from the lectures are accompanied by <strong style=\"\">live examples</strong> from the Amazon Books Marketplace. The video lectures are <strong style=\"\">accompanied with detailed downloadable PDF notes</strong> for clarity and learning retention.  </p>  <p>  \t        This course will guide you step-by-step towards becoming a successful and profitable writer!  </p>", 
    "end_date": null, 
    "title": "Self-Publishing Mastery", 
    "price": "20.00", 
    "instructors": "Patrick Doucette", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413582_4168_7.jpg", 
    "course_url": "https://www.udemy.com/self-publishing-amazon-course/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T22:12:41Z"
}