{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>                   Over 1200 delighted new students in the first month! Thanks Udemy students and followers! All you straggler on the sidelines: Join now! =)</strong></p>  <p>  \t<strong>Get INSTANT ACCESS TO MY PRIVATE MASTERMIND GROUP AND WATCH OVER MY SHOULDER AS I SHOW YOU THE BEST KEPT SECRET TIPS TO BECOME A #1 AMAZON BESTSELLER</strong>  </p>  <p>  \t<em> if you're looking for \"instant easy get rich quick\" money, don't take  this course. This course is for entrepreneurs willing to dedicate the time and effort to sourcing unique products.</em>  </p>  <p>  \t                                                                                                                                                      +++++++++++++++++++++++++++++++++++++++</p>  <p>  \t                                                                                                                                                     About this course:  </p>  <p>  \t                  For all my loving and dedicated students, I know that the journey in the beginning can be challenging but keep working hard! I am here to answer your questions and help you start CRUSHING IT! now. If you are already making $50k or more a month selling on Amazon, you probably don't need this course - keeping crushing it! The best part: <strong></strong></p>  <ul>  \t<li><em>Get inside tips from a #1 Amazon Bestseller  \t</em></li>  \t<li><em>Use free resources to source product from China for ridiculously cheap prices  \t</em></li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>Enjoy all future extra lectures and upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy 30 day money-back guarantee!</em></li>  </ul>  <p>  \t                    ---------------------------------------------------------------------------------------------------------------------------  </p>  <p>  \t<strong>UPDATE:</strong>  </p>  <p>  \t                    Although I now sell more passively on Amazon, I recently used this same technique to prove it still works and sold 394 units of one wireless accessory in ONE day! Yes, it is possible - Keep going!  </p>  <ul>  </ul>  <p>  \t                    You absolutely need to get this course now ... right this minute.  </p>", 
    "end_date": null, 
    "title": "Sell More on Amazon with Viral Product Marketing Strategies", 
    "price": "20.00", 
    "instructors": "Wes Smart", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417920_15ab_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-crush-it-on-amazon-product-sourcing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T02:45:24Z"
}