{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em><strong>Make Extra Money From Home: A Profitable Internet Business   </strong></em>course is about a new and original money making method which will bring you extra money each month.  Although the<strong> </strong>course is only 30 minutes long, the information is precise and <strong>ON SUBJECT !</strong>  </p>  <p>  \t  Itdoesn't matter if you are new to <strong>Internet Marketing</strong> and you don't know <strong>how to make money online</strong> because in this course you will find all the information to start a profitable <strong>home-based business</strong> on the internet.  </p>  <p>  \tThe course does require an investment and I do believe that in order to make money, you need to invest some money . The method does not require thousands of dollars and the <strong>return on investment is guaranteed !</strong>  </p>  <p>  \tYou will learn how to search for people and hire them to develop your ideas, for a reasonable price. By following my instructions, you will learn how to hire only the high rated and trustful people.  </p>  <p>  \tThe best way to monetize and promote your final product and slowly make it popular which will bring you money each month ALMOST on autopilot .<br>  </p>  <p>  \t<strong><em>What else is important about this course?</em></strong>  </p>  <ul>  \t<li>How to bring your ideas to life</li>  \t<li>How to monetize your ideas</li>  \t<li>How to promote your ideas</li>  \t<li>How to search for the best deals</li>  </ul>  <p>  \t   Take my course<strong> </strong>and after you finish,<em><strong> take action!</strong></em>  Action takers have made money online and you can do the same !<br>  </p>", 
    "end_date": null, 
    "title": "Set Up an Internet Business and Be Your Own Boss", 
    "price": "20.00", 
    "instructors": "Alexandru Costiug", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299526_5783_7.jpg", 
    "course_url": "https://www.udemy.com/make-extra-money-from-home-a-profitable-internet-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T07:18:07Z"
}