{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>*** UPDATED May 2015 to reflect changes to Fiverr platform (Lectures 6 and 12)***</em></strong></p><p>So you are thinking of starting and online business... You want to work from home, work the hours you want, make money doing what you are interested and good at, and be your own boss.</p><p>But...  Starting an online business can be a lot of work, complex and overwhelming - needing to learn how to make a website and market and promote yourself.  Right?  Wrong!!</p><p>Using Fiverr, you can have an online business up and running - for FREE - in 1 day!  </p><p><strong>No business or sales or marketing experience needed.</strong></p><p>I show you, step by step, how to build your online business and start selling straight away.</p><p>Fiverr is the world's largest online store selling ANYTHING you can imagine!</p><p>People, just like you, are using Fiverr to set up a FREE business to sell services that they <em>want </em>to provide others and are making money from it.</p><p>This course shows you the <strong>best way to use Fiverr. </strong></p><p>This Fiverr course will explain, step by step, how to:</p><ul><li>Set up your Fiverr business</li><li>Write your seller profile</li><li>Effectively write your service/product titles to attract more buyers</li><li>Design and write eye-catching and attractive service/product descriptions and offers</li><li>Conduct effective market research to learn from the best</li><li>Interact effectively and successfully with buyers to boost repeat sales and referrals</li><li>How to get up and selling ASAP</li><li>What I do to earn money, month after month</li></ul><p>Start doing what you love or are interested in and start getting paid for it! </p><p> <strong>NO upfront costs or previous online business skills needed.  All you need is YOU and your PASSION.</strong></p><p>1500 students are taking this very course! Check out the 5 star reviews.</p><p><em><em>Now includes the 'Make Extra Money Online' Checklist so you don't miss any steps!</em></em></p><p>So...</p><p>Click the \"take this course\" button now ...and start making money doing what you love.</p>", 
    "end_date": null, 
    "title": "Setting Up an Online Business by Selling on Fiverr", 
    "price": "25.00", 
    "instructors": "Emma E Knapp", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354808_80b6_3.jpg", 
    "course_url": "https://www.udemy.com/fiverr-learn-how-to-make-extra-money-from-home-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T23:53:09Z"
}