{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn the Secrets to Making Extra Income on Ebay</strong></p>  <p>  \t                                 Do you have the entrepreneurial spirit but don't know where to start? Have you tried other methods of making money online with little success? Take advantage of this course as taught by an Ebay PowerSeller with 6 years of experience.  </p>  <p>  \t    This course is the ultimate complete guide to selling on Ebay and walks you through step-by-step everything you need to know to make an additional income by selling on Ebay. Learn how to avoid the countless mistakes I have made through trial and error throughout the years.  </p>  <p>  \t              .  </p>  <p>  \t<strong>In this course you will learn</strong>  </p>  <ul>  \t<li>How to start a business on Ebay (by watching me guide you through every step of the way) and <strong>create an additional source of income</strong></li>  </ul>    <ul>  \t<li>Ideas for things to sell and where to get them which means <strong>you can avoid wasting hours looking for products in the wrong places (learn from my mistakes)</strong></li>  </ul>    <ul>  \t<li>The business side of Ebay and <strong>how to avoid losing $100's of dollars in beginner mistakes</strong></li>  </ul>    <ul>  \t<li>Best practices and strategies in selling so <strong>you can sell more products quickly and earn greater profits</strong></li>  </ul>  <p>  \t<strong>.  </strong>  </p>  <p>  \t<strong>Your Success and Satisfaction is Guaranteed</strong>  </p>  <p>  \t                                 In this course I, the instructor, will always be available to answer any questions you have. My ultimate goal is for my students to succeed. I want you to be proud of your Ebay business. If you do not get huge value from this course let me know and I will refund the full purchase, no questions asked.  </p>  <p>  \t                                 Click on the 'Take This Course' button in the top right corner to get started without delay. The fact that you are reading this shows you are already on the path to creating an additional source of income on Ebay, lets get started!  </p>  <p>  \t  .  </p>  <p>  \t<strong>You Do Not Have to Fear 'Getting Stuck'</strong>  </p>  <p>  \t  Have you ever signed up for some form of training in the past only to stop when you had a question that no one would answer. You do not have to fear being stuck and not knowing where to have your questions answered.  </p>  <p>  \t  This course is an open community where every question, no matter how simple it may seem, is valuable. I have already given countless thorough answers to all the questions I have received.  </p>  <p>  \t  All of these answers are listed in a FAQ that you have access too. This means in most cases you will get a thorough answer to your question instantly. </p>  <p>  \t             .  </p>  <p>  \t<strong>What Students are Saying About this Course:</strong>  </p>  <p>  \t                                 \"<em>I recommend this course. You can call it the bible of ebay commerce</em>\" – Evan  </p>  <p>  \t                                 “<em>Excellent course! Eric does a great job of explaining the material! He answers your questions thoroughly. Definitely learned things I didn't know before!</em>\" – Andres</p>  <p>  \t                                 “<em>Great in-depth course. Eric's a good teacher and it's awesome that he takes the time to answer everyone's questions and concerns.</em>\" - Sergiu  </p>", 
    "end_date": null, 
    "title": "Simple Yet Effective Methods for Starting an eBay Business", 
    "price": "20.00", 
    "instructors": "Eric John Campbell", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/218886_ab3d_12.jpg", 
    "course_url": "https://www.udemy.com/simple-yet-effective-methods-for-starting-an-ebay-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-14T22:57:34Z"
}