{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Wer ein kleines oder mittleres Unternehmen leitet, stellt sich früher oder später die Frage, wie und ob er auch durch das Internet neue Kunden gewinnen und damit mehr Geld verdienen kann. Denn das Internet ist allgegenwärtig und ihre Kunden sind mit dem Internet und oftmals auch mit einem <strong class=\"redactor-inline-converted\">Social Network wie Facebook, Twitter, Instagram, YouTube und Co. </strong>verbunden.</p>\n\n<p>Genau dort wollen wir ihre Kunden abholen, in den <strong class=\"redactor-inline-converted\">Sozialen Netzwerken</strong>. Gezielte Werbung und Präsenz dort kann für ein Unternehmen sehr wertvoll sein. Durch content-reiches <strong class=\"redactor-inline-converted\">Social Media Marketing</strong> wird eine Firma nahbar und bekommt ein Gesicht. Kunden können mit Mitarbeitern oder sogar dem Eigentümer persönlich in Kontakt kommen und so auch eventuelle Probleme mit Produkten klären. Dies erhöht die Glaubwürdigkeit und gibt zudem ein S<strong class=\"redactor-inline-converted\">ocial Proof. Genau darum geht es auf Facebook und Co. Als Firma wollen wir dort für unsere Kunden da sein, ihnen einen Mehrwert bieten und ihnen die Informationen geben, die sie benötigen, um sich für unsere Produkte zu entscheiden.</strong></p>\n\n<p>In dem Kurs versuchen wir ihnen die einzelnen sozialen Netzwerke wie <strong class=\"redactor-inline-converted\">Facebook, Instagram, YouTube und Pinterest</strong> näher zu bringen und ihnen  Tricks und Kniffe zu zeigen, wie ohne große Werbeausgaben oder Vorwissen neue Kunden erreichen. <strong class=\"redactor-inline-converted\">Social Media Marketing</strong> und damit Social Media Networking kann nur mit Zeiteinsatz betrieben werden und zur unmittelbaren <strong class=\"redactor-inline-converted\">Kundengewinnung</strong> dienen. Damit ist das Social Media Marketing eine der weniger Möglichkeiten kostengünstig Werbung zu betreiben und sich mit den richtigen Inhalten aus der Menge der Angebote heraus zu kristallisieren.</p>\n\n<p>Dabei kann man sehr kreativ vorgehen. Mit Videos aus der Produktion kann man den Kunden einen Blick hinter die Kulissen gewähren. Auch Fotos von einzelnen Produkten sind immer Willkommen. Genau darüber wollen wir in unsrem <strong class=\"redactor-inline-converted\">Social Media Marketing Kurs</strong> reden und mit ihnen gemeinsam einen Fahrplan entwickeln, wie Sie Ihr neugewonnenes Wissen nutzen, um effektives Marketing zu betreiben.</p>\n\n<p><strong class=\"redactor-inline-converted\">Social Media Marketing</strong> kann auch ihre Firma nach vorne bringen und dafür sorgen, dass sie ganz nah an ihren Kunden sind. Sobald sie eine gewisse Anzahl an Fans aufgebaut haben, können sie ihre Werbung ohne größere Streuverluste über Social Media erreichen. Wichtig ist nur, dass sie sich den <strong class=\"redactor-inline-converted\">Social Media Kanal</strong> aussuchen, der für ihre Firma das richtige Kommunikationsmedium ist. Dazu schauen wir uns im Kurs die verschiednen Plattformen an und Sie lernen die Vor- und Nachteile der einzelnen Plattformen kennen. So können Sie am Ende entscheiden, welcher Kanal für Sie der richtige ist und ob Sie bei <strong>Facebook, YouTube, Instagram, Pinterest oder Twitter</strong> vertreten sein wollen.<br></p>", 
    "end_date": null, 
    "title": "Social Media -Geld verdienen mit Facebook, Instagram und Co.", 
    "price": "20.00", 
    "instructors": "Monja Wessel, Online Lernen SimpleLife Stories", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673276_5eb2_5.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-fahrplan-fur-ihre-firma/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T12:49:11Z"
}