{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">Build a Profitable Blog  with Wordpress Easy To Understand</em></strong></p><p style=\"\">Take advantage of our <strong style=\"\">Free Wordpress Setup Offer</strong>.  Get your Wordpress installed Free ($99 Value). This cost no more to have us do it.  We use affiliate links to get paid.  Learn how inside the course.  In this course I share with you what has taken me over eight years to learn by myself.  This is a great way to get a jump start to learn all the needed knowledge to go straight to the top and earn six figures per year blogging from home.</p><p style=\"\">Use this course to <strong style=\"\">start your own money making blog or build your own business developing wordpress sites for others</strong>.  Both are great ways to make a living being your own boss from home.</p><p style=\"\">These are the exact methods we use daily in our business which earns over $4K monthly.</p><p style=\"\">Learn Wordpress Strategies from Simple To Advanced.  This could be your next job right at home. Use this knowledge to earn revenue many diufferenty ways.  The choice will ultimately be yours.</p><p style=\"\">Let us take you from the beginning and teach you how to customize Wordpress to look the way you want it too.  You aren't required to learn any coding skills, HTML or CSS. We teach this course.  We are taking a No Code Approach. Learn to build Responsive WordPress Sites and Customize without coding skills.</p><p style=\"\"><strong style=\"\">Students Will learn:</strong></p><ul style=\"\"><li style=\"\">Learn to <strong style=\"\">build website using Wordpress</strong></li><li style=\"\">Learn to <strong style=\"\">embed video</strong> in Pages or Post in Wordpress</li><li style=\"\">Learn to add images to post/pages</li><li style=\"\">Learn to <strong style=\"\">add url link to images</strong></li><li style=\"\">Learn How to <strong style=\"\">install Wordpress</strong> on Host Provider</li><li style=\"\">Learn how to <strong style=\"\">change header</strong> image for logo</li><li style=\"\">Learn to <strong style=\"\">customize layout </strong>of the pages using Wordpress</li><li style=\"\">How to add a <strong style=\"\">Favicon</strong> to your site</li><li style=\"\">How to <strong style=\"\">customize the sidebar</strong></li><li style=\"\">How To <strong style=\"\">Change The Font</strong> and Font Size</li><li style=\"\">Learn to add Social Media \"<strong style=\"\">Share</strong>\" Buttons</li><li style=\"\">Learn to add \"<strong style=\"\">Contact Page</strong>\"</li><li style=\"\">Learn all the important <strong style=\"\">SEO Factors</strong></li><li style=\"\">Learn to setup <strong style=\"\">MAMP for Wordpress</strong> Customizing Locally</li><li style=\"\">Learn to use<strong style=\"\"> Firebug developer</strong> tools</li><li style=\"\">Learn to add<strong style=\"\"> Google Maps</strong> in Footer or Sidebar</li><li style=\"\">Learn how to add a <strong style=\"\">Forum</strong></li></ul><p style=\"\">The List continues to grow more each month as we keep the content fresh monthly.  It's unbelievable just how much you will learn in this course.  We are teaching this course exactly how we would want to learn Wordpress if we was learning from the beginning.</p><p style=\"\">In order to customize Wordpress to this extent without knowing code students will need to buy a couple extra items.  One being <strong style=\"\">Genesis Framework and a Child Theme</strong> of your choice from StudioPress.  I am also recommending students buy the Styles for Genesis plugin.  If you do a bit of research you will find out these are highly recommended by all developers. </p><p style=\"\">Please use the links inside to purchase the items needed.  Our links are affiliate but will not cost you any extra.  By using our links you are helping us keep the price of the course at a minimal plus we are offering the free Wordpress setup.</p><p style=\"\">Students will also be invited to join our private Facebook group where we answer any questions you have day or night. Are you confused how to setup Wordpress with a hosting company. Reach out to us on here and we will setup your site FREE of Charge. We only require you choose from 3 of our top recommended providers. What are you waiting for hit that enroll button.</p><p style=\"\">Bonus: Ebook titled, <strong style=\"\">How to Speed Up Wordpress Site, </strong>at no extra charge.</p>", 
    "end_date": null, 
    "title": "Start an Online Business by Building a WordPress Blog", 
    "price": "20.00", 
    "instructors": "Mitch Stevens", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515450_fb79_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-wordpress-site-no-coding-skills-required/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T14:15:40Z"
}