{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The hookah industry has been <strong class=\"redactor-inline-converted\">BOOMING </strong>since the introduction of this Ancient Middle Eastern Tradition to the U.S.A. and around the WORLD. Combine that with the lightening fast growth of the Vape Industry and what do you get? 2 Giant Industries combined resulting in <strong class=\"redactor-inline-converted\">BILLIONS </strong>of dollars being spent year after year, and growing at a steady rate!</p>\n\n<p><strong class=\"redactor-inline-converted\">Bring Da Fire</strong>, is a company based in Orange County CA by 4 friends in a Garage, who found a niche renting Hookahs to Venues, Events, &amp; Nightclubs combining it with Vapor!  A few short years later, their business is <strong class=\"redactor-inline-converted\">generating nearly $300,000 a year in 2015!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Many people have requested them to be their business partners and seeked them out for mentorship to emulate and duplicate their business model! What does this spell out for you? <strong class=\"redactor-inline-converted\">HUGE OPPORTUNITY!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>For the <strong class=\"redactor-inline-converted\">FIRST TIME EVER</strong>, in the history of online courses, they have taken their system, their model, their business plan, their products, and turned it into an online course here <strong class=\"redactor-inline-converted\">FOR YOU TO LEARN and APPLY</strong> in your own city, hometown, or country!</p>\n\n\n\n\n\n\n\n\n\n<p>Please preview the first lecture to see a snapshot of the transparency and a behind the scenes look at their numbers. Documentation beats conversation all day long.</p>\n\n\n\n\n\n\n\n\n\n<p>I'll be frank this course is NOT a get rich quick scheme. This course outlines a simple proven way to earn a part time, or even significant full time income. Your earnings will be based on your ability to learn and <strong class=\"redactor-inline-converted\">EXECUTE</strong>. You can sign up for a gym membership but sitting around at home watching TV will not get you fit &amp; in shape right?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>NO hype. NO BS. NO gimmicks. You may have heard this before, however this time it's different. This is a transparent gloves off A through Z, 1 2 3 blueprint.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>What would an extra $2,000 a month do for you &amp; your family? How about $14,000? Would that be life changing? Keep reading! You might be saying yea right that's great for you, but could it really happen for me? I have already helped <strong class=\"redactor-inline-converted\">OVER 15,000 </strong><strong class=\"redactor-inline-converted\">STUDENTS</strong> from all over the world do this and receive messages daily from them with their success stories and sales with other courses and other business models.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This business model shows you how to start part time with a few hookahs learning the basics and goes over everything, all the way to ADVANCED teaching you their system on how they manage and run 30 events a week, with dozens of night clubs and over 20 part time employees allowing them to have…TIME FREEDOM! Think about what you could do if you had that? You could spend more time with your family, travel, or finally pursue that passion you have always wanted to.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Be one of the students to enroll and learn all of their closely guarded secrets! Am I going to guarantee you overnight success? Absolutely not, that would be unrealistic, we're all mature enough to know that there are no guarantees in life. Anyone promising that is lying. This is a real business that requires real work that can take months to even a year to produce the income you're looking for. Here is what I can promise you…</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>If you're coach-able with a good attitude, a willingness to work, and you follow their system you will earn income. Even after your first 90 days the profits can be awesome!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>How much capital will you need to invest to start? This depends on you and how fast you want to grow, it can be several hundred dollars or more.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What you will learn:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>1. Basics of Hookah.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>2. How to contact Venues &amp; Nightclubs and get in their door.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>3. Learn all the products used to run this business successfully.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>4. Where to buy all the products used.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>5. Understand how to setup hookahs at these venues &amp; nightclubs.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>6. Learn how to maintain and store your Hookah Equipment.</p>\n\n\n\n\n\n\n\n\n\n<p>7. Start to finish guide on how to do every aspect of the business, accounting, &amp; systems.</p>\n\n\n\n\n\n\n\n\n\n<p>8. How to build a team, hire employees, expand, &amp; grow</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>…and much more!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What you will need:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>1. Some money to invest in products.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>2. Transportation.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>3. 5-10 hours per week to start, you must master the skills before you can teach someone else to do it. Hire, outsource, build a team and build a HUGE business. We show you all that too.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What you will get:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>1. On going support from 4 of the business partners at Bring Da Fire, through the Udemy platform including chat discussions and private messages. One caveat: We are human and not a robot so response times may vary especially if we're in different times zones.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>2. Their formulas and systems they have created for success.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I applaud you for reading this far. This course will be unlike anything you have ever seen, and is a simple business model just about anyone can run.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>What's our motivation for teaching it? I have always been passionate about helping others, and in the past several years I have had my first real taste of it. I (David Vu) have personally mentored dozens of individuals making over 6 figures of income with a variety of different businesses and courses. It absolutely warms my heart to hear their success stories and I want to create more, starting with you!</p>\n\n\n\n\n\n\n\n\n\n<p>Whats Bring Da Fire's motivation? The same, BUT, they are also looking to expand their footprint, looking for serious students that will eventually become Joint Venture partners to help expand around the country here in the USA, and other parts of the world!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Reminder: Udemy has an unconditional 30 day money back guarantee so there is no risk. You have everything to gain and nothing to lose! I will stress this as well and stand behind this course, if you feel that you have gained NO VALUE at all within 30 days, I will personally guarantee you a refund! I am confident in what we have created. This course took several hundred collective man hours, 8-10 hours per day, recording and editing. We have been conspiring to create this course since April of 2015 and nearly 1 year later, its finally coming into fruition and launching May 2016! We wanted to make this the best course it possibly can!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Lets create your success story together! Click on the “take this course\"</strong> link at the top right of this page <strong>RIGHT </strong><strong class=\"redactor-inline-converted\">NOW!</strong> Don't let another minute go by not living your dreams. Enroll right away to be one of our students in our HOOKAH online entrepreneur community, and stake your claim in this wide open market!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Karim Mahmoud, Vincent Dinh, John Vega &amp; Gabriel Salera (Bring Da Fire)</p>\n\n\n\n\n\n\n\n\n\n<p>Family men, Entrepreneurs, Hookah Enthusiasts</p><p>&amp;</p><p>David Vu<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Serial Entrepreneur, Fisherman, Diver, World Traveler, Happiness Ambassador, Youtube Film Maker</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Start a Hookah Rental Business & Party - Work From Home", 
    "price": "40.00", 
    "instructors": "David Vu, Bring Da Fire Enterprise, Vincent Dinh, Karim Mahmoud", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/439282_6c30.jpg", 
    "course_url": "https://www.udemy.com/start-a-hookah-rental-business-party-work-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-05T06:56:08Z"
}