{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Note: Over 4,800 paying students since the course was published - and already over 120 x 5 Star Reviews. See below.</em></p>\n\n<p><em>Course fully updated 13th June 2016</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Finally. A home business that really works - and no selling!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>The ultimate, easy to run, no selling, monthly repeat income Home Run Business!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>Udemy Instructor Alun Hill writes</em></strong>: <em>I've known Chris Towland, who prepared this course, for many years.</em><br>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong>I've seen him develop this entire business from nothing</strong></li><li>I've seen him <strong>overcome every obstacle</strong> </li><li>I've seen him refine the business to the point where <strong>he already makes $3,000 every month, month after month</strong> </li><li>... and with just for a <strong>few hours work</strong> every month.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>No-one would call Chris a salesman - and that's the real beauty, in my mind, of this course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It's no good knowing how to make really good money working from home if you also need to be any sort of salesman. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And <strong>absolutely no sales skills are required</strong> to make a success of your life - if you follow in Chris's footsteps in the way he shows. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>There's no need to ever visit anyone, no need to \"cold-call\"</strong> etc - you just follow the <strong>included simple templates</strong>, please.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>I spent some considerable time convincing Chris to add this course to Udemy as it takes many, many hours of intense work to create a course of this high quality and detail.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>However, the end result is <strong>wonderfully easy for you to follow</strong> and Chris is delighted to not only offer the course here, but is also available to <strong>answer any questions you may have</strong>, at no extra cost, of course!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>++++++</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>FAQ's:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Question: Chris, can I do this in (insert country!)</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Answer: </strong>Yes, you can make this money, and more, wherever in the world you live. I live in the UK but<strong> I have clients all over the world</strong> - and you can too!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br>\n</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Question: Chris, how soon can I start making money, from this?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Answer: </strong>Realistically, it will take a couple of hours to set up the first time (following the detailed course lectures and any free help you need), but you're then able to<strong> start charging your professional fees immediately (with no other knowledge or experience, you just study the simple but comprehensive course!)</strong> - and <strong>clients pay you month after month</strong> - and even recommend their business friends to pay you too!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br>\n</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Question: Chris, what do I need to get going today, please?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Answer: </strong>A computer and any speed of internet. And about $30 to $40 to start (then just a couple of dollars a month, regardless of the number of clients!)</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br>\n</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Question: Chris, will this become \"saturated\"? What about when thousands of people start doing this?</strong><br>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Answer:</strong> I'm not in the slightest bit worried about you competing, as almost every local business IN THE WORLD will love it - and you or I will never cover .000001% of them .. and you don't need to, of course!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Question: Chris - this sounds perfect for me! Tell me more!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Answer: </strong>I am currently earning <strong>well over $3000 every month</strong> from the business that I show you in this course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This is also with less than 20 clients so it leaves me plenty of spare time to spend with friends and family. It also leaves me plenty of time available to take on more clients if I decide I want to increase my income at any point - but at the moment, I love my life / work balance and so am happy with the clients I have.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The great thing is - that <strong>the income is recurring</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My clients happily <strong>pay me every month</strong> - so the only time I need to go to find new clients is if I DO decide to grow the business further.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The businesses that are my <strong>clients start by paying me $60 per month</strong> for the service I provide for them, but as the results come quickly, this figure rises to $150 per month or even more.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I also offer additional services to my clients that means <strong>some of them pay me $300 per month up to $600 per month</strong>, every single month.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course <strong>I show you everything </strong>that I do in this business so that you can do it too.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You'll see <strong>how I get new clients</strong>, how I get great results for them quickly, and even the additional services that I offer them.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You'll watch over my shoulder</strong> and see me set everything up so that you can duplicate it and get your own profitable business up and running quickly!<br>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>++++++</strong><br>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>And the full 30 day no-questions-asked Udemy instant guarantee is your assurance of the quality and potential of this course.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Every hour you delay, therefore, in registering for this course is actually COSTING you money!</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Delight your family!</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Impress your friends!</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>Get started today by clicking \"Take This Course\" and g<strong><em>et full, lifetime access with all future updates and all current and future course materials included!</em></strong></em></strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em></em></p>", 
    "end_date": null, 
    "title": "Start & Run a Local Viral Email Marketing Service from Home", 
    "price": "20.00", 
    "instructors": "Chris Towland", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437658_dd5f.jpg", 
    "course_url": "https://www.udemy.com/home-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T16:21:26Z"
}