{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>**COURSE UPDATED FOR JUNE 2016**</em></strong><br></p>\n\n<p><br></p>\n\n\n\n<p><strong><em><strong><br></strong></em></strong></p>\n\n\n\n<p><strong><em></em></strong>I consistently earn about $167 per day which is about $5367 per month.<br></p>\n\n\n\n<p>That’s not gross revenue. That’s cash in my pocket that I can use for anything I want. </p>\n\n\n\n<p>And that’s EVERY month… not just one amazing month!</p>\n\n\n\n<p><br></p>\n\n\n\n<p>Hi. My name is Viktor and I was once in your position. </p>\n\n\n\n<p><strong>I was struggling with Bills and Debt.</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>Exactly 1 year later, I was consistently earning $5k+ per month – on the side.</strong></p>\n\n\n\n<p>And I want to share those secrets with you right now so you can do it too…</p>\n\n\n\n<p><strong>You see not all that long. I was Broke. </strong></p>\n\n\n\n<p><br></p>\n\n\n\n<p>I was working full time, but still couldn’t get ahead. I couldn’t afford what I really wanted…</p>\n\n\n\n<p>I finally got sick and tired of my lifestyle. I had had enough!</p>\n\n\n\n<p><strong>I decided to take matters into my own hands… </strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p>I spent the next year buying courses, products, softwares and got nowhere. I read books on business.</p>\n\n\n\n<p>I tried it all and still ended up where I started.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>And that’s when I stumbled upon something…</strong></p>\n\n\n\n<p>I couldn’t believe what I had found.</p>\n\n\n\n<p><strong>If I was correct, I found my ticket out of the hell I was living in.</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><em>Before we learn what I found...</em></p>\n\n\n\n<p><strong>Let's Hear from a Happy and Successful Student:</strong></p>\n\n\n\n<p><em>\"I don't review courses. This one I had to review. Excellent job on providing valid money making ideas and how to implement them. The instructor has done an excellent job and the time invested is well worth it.</em><em>\"</em><br></p>\n\n\n\n<p>-Leah</p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>Here is Another Successful Student:</strong></p>\n\n\n\n<p><em>\"Wow! This Stuff Works. This course seems to be a great fit for those who are venturing into the online world and trying to discover some ways to make income online.\"</em></p>\n\n\n\n<p>-George Morgan</p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p>Not only one but many Ways to make money consistently, month in and month out.</p>\n\n\n\n<p>I decided to put this idea of mine to the test… </p>\n\n\n\n<p><strong>Soon after, I made an extra $1000 per month. Then, an extra $3000 per month. Finally, I was making $5k per month…. All on the side. </strong></p>\n\n\n\n<p>I was shocked to find how easy it had been.</p>\n\n\n\n<p>I felt like I had hit the jackpot!</p>\n\n\n\n<p>I couldn’t believe an average guy like me could do it!</p>\n\n\n\n<p><br></p>\n\n\n\n<p>I paid off my debts quickly and had the freedom to do what I wanted when I wanted </p>\n\n\n\n<p>I could make more than $5,367 per month but I decide not to… I want to spend my time doing other things…</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>At that moment, I knew I had to share my secret and help others…</strong></p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>In this course, we will go over 167+ proven ways to make more money and achieve your dreams. </strong></p>\n\n\n\n<p>You only need to apply a few in order to change your life forever.</p>\n\n\n\n<p>I go into detail with scripts, walkthroughs, and, tools on each of these so you can get started immediately! </p>\n\n\n\n<p><strong>This Course ISN’T for you if you are looking for a magic bullet or a quick fix… these methods are proven and work for my students.</strong></p>\n\n\n\n<p><em>But they do take work.</em></p>\n\n\n\n<p>I have tried these for myself and make it as easy possible for my students to start making money.</p>\n\n\n\n<p>But you still need to put in the effort.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><em>Each video is short and to the point-</em> </p>\n\n\n\n<p>even if you are busy and can only spend a few minutes every day on this course, </p>\n\n\n\n<p>you can make more money on the side.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong></strong><strong>Here is the Truth:</strong></p>\n\n\n\n<p><strong>Even if you only make 10% of me which is $500 per month, then this course will still be worth it for you…</strong></p>\n\n\n\n<p>Imagine what $500 would allow you to do…pay off debt? Travel more? Work less? </p>\n\n\n\n<p>You can do all that and more…</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong><em>Before you Click that 'Enroll Button'</em></strong><strong><em>, let's Hear from one Last Happy Student:</em></strong></p>\n\n\n\n<p><em>\"I really liked the way you explained, and I think that the topics are well covered. The proven way no.16 was a bless! Thank you for it ^_^ , also I got some ideas for the future.\"<br></em></p>\n\n\n\n<p>-Lucian Pasca</p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>ENROLL NOW!</strong></p>\n\n\n\n<p><strong><strong>****UDEMY INSTRUCTOR HAS 7 COURSES with 7500+ Students and 200+ 5-Star Review****</strong><br></strong></p>\n\n\n\n<p><strong>P.P.S. IF FOR ANY REASON YOU DON'T GET THE RESULTS YOU WANT, YOU HAVE 30 DAYS TO GET YOUR MONEY BACK. NO QUESTIONS ASKED.</strong></p>", 
    "end_date": null, 
    "title": "Start a Home Business with the Skills You Already Have", 
    "price": "20.00", 
    "instructors": "Viktor Jiracek", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625270_c756_2.jpg", 
    "course_url": "https://www.udemy.com/start-home-business-with-skills-you-already-have/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T22:46:53Z"
}