{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\"><em style=\"\">                 OVER 560,000 PEOPLE TAKEN MY COURSES ONLINE</em></strong>  </p>  <p style=\"\">  \t If you are looking for a way to make money online then selling domains is <em style=\"\">one the <strong style=\"\">most profitable ways of generating extra income</strong></em>. You can <strong style=\"\">work from home</strong> eliminating the stress of travel or if you already have a job, then this can be a lucrative part-time business dedicating <strong style=\"\">only a few hours a week</strong>. It is up to you how much you put into it depending on your current workload.  </p>  <p style=\"\">  \t The secret to selling domains lies in finding high-value domains and then selling them to the right buyer. Many people experiment with collecting domains as a hobby but if you want to become a professional at this and actually make money then <strong style=\"\">you need to have a proven system</strong>. Such a system can only be taught by someone who actually practices buying and selling domains.  </p>  <p style=\"\">  \t I have personally spent countless hours researching in how to buy the best domains, speaking to other domains sellers and working out the best system for selling domains. In this course you will get a proven step-by-step for the best and most profitable way to make money from selling domains. <strong style=\"\">I have bought domains for less than $9 and sold for $5,000</strong>. Many of my colleagues have sold domains for up to $40,000 and above.  </p>  <p style=\"\">  \t In this cause I hold nothing back. I tell it how it is, exactly my recipe for successful domain trading. Sure, there are many intricacies and details on how to improve and make even more money with selling domains but in this course you will get all you need to know to <strong style=\"\">get quickly started and actually make some money online.</strong>  </p>", 
    "end_date": null, 
    "title": "Start Selling Website Domains from Home", 
    "price": "45.00", 
    "instructors": "Vitaly Geyman (MBA)", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/262838_9708_3.jpg", 
    "course_url": "https://www.udemy.com/build-a-business-selling-domains/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-16T20:04:38Z"
}