{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Fiverr Video Success: This course will show you exactly how I make a full time living as a video spokesperson doing work on Fiverr and through other sources. Simply put - I have the greatest acting job in the world, clients send me their scripts and I produce, direct and deliver a high quality commercial – with me as the spokesperson.I do it all from the comfort of my own home. No boss, no co-workers, no auditions – if they want me, they buy my gig and that’s it. You too can become a spokesperson by taking my course and learning exactly what you need to get started, how to get orders and succeed in the Fiverr marketplace. Why listen to me? Well because I am the only Fiverr Super Seller with a course on Udemy and I have delivered over 3,000 videos for satisfied clients. I made over $50,000 on Fiverr in just about 1 year and my average gig selling price is $33 and rising! Who said Fiverr only pays you $5?  </p>  <p>  \t</p><p>  \t\t</p><p>  \t\t\t      You can watch Lecture #2 of this course for FREE now and join me as I log into my Fiverr account and SHOW you my actual lifetime earnings and average selling price. This Udemy course will also walk you through joining Fiverr, creating gigs, optimizing your gigs for sales, adding gig extras, filming your videos, making a green screen studio and even how you can get private clients from other places that will hire you to be their spokesperson! Don’t think you have the skills to be a video spokesperson? Well WATCH the first HORRIBLE video that I made for a client on Fiverr – and then see how far I have come in a short time – YOU TOO can hone your skills and make some awesome money as a spokesperson from HOME!  \t\t</p>", 
    "end_date": null, 
    "title": "Start Your Business as a Video Spokesperson on Fiverr", 
    "price": "20.00", 
    "instructors": "Mr. Michael-John Wolfe", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360024_58a9_4.jpg", 
    "course_url": "https://www.udemy.com/start-your-business-as-a-video-spokesperson-on-fiverr/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T21:43:17Z"
}