{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  If you are interested in a simple, proven way to <strong style=\"\">make passive income online</strong>, then take a few moments to read the course description below!  </p>  <p style=\"\">  \t<em style=\"\">  Here's what this is about:</em>  </p>  <p style=\"\">  \t  My name is Steve Goldberg. I've been testing, failing, improving, and refining ways to make passive income online for the past 4 years.  </p>  <p style=\"\">  \t  And in this entertaining course, I'm going to let you peek over my shoulder as I setup a live passive income stream and you will see me make money at the end of the course!  </p>  <p style=\"\">  \t  This is not theory. This is authentic, real-world, look over my shoulder training that gives you every detail of exactly what to do. In fact, I just added another lecture as a bonus that walks you through how I created just <em style=\"\">one simple video that makes $360 per month</em>!  </p>  <p style=\"\">  \t<strong style=\"\">What's In The Course?</strong>  </p>  <p style=\"\">  \t  This is a course which <strong style=\"\">includes over 20 easy to follow, step by baby step videos</strong> in which you will learn exactly how to make passive income online without your own product or website, how to find money-making products to promote as an affiliate, how to get free traffic, how to track your results, and how to setup multiple passive income streams in your spare time.  </p>  <p style=\"\">  \t<strong style=\"\">Who Is This For?</strong>  </p>  <p style=\"\">  \t    The class is <strong style=\"\">perfect for total beginners</strong> who are new to making passive income, affiliate marketing, and making money online. The course is structured in Powerpoint overview videos, and look-over-my-shoulder screen capture videos.  </p>  <p style=\"\">  \t<strong style=\"\">What You Will Do:</strong><br style=\"\">  \t<br style=\"\">  \t    Your class project will be to find a product to promote as an affiliate, create a press release, submit your press release, and get traffic to your press release to make passive income. It will cost between $75-$150 to setup your first passive income stream, which could potentially make you $200, $300, maybe $500 per month. No guarantees though. Results may vary depending on your effort.  </p>  <p style=\"\">  \t<strong style=\"\">Why Take This Course?</strong><br style=\"\">  \t<br style=\"\">  \t    Since many people struggle with information overload when searching for a way to generate passive income, I kept these videos very short and to the point. I assume you know nothing and explain everything in simple terms so even a fifth grader with bad English can do this.  </p>  <p style=\"\">  \t<strong style=\"\">How Available Am I?</strong>  </p>  <p style=\"\">  \t  I'll be available about once or twice per week to answer any questions you might have. I've designed the course so even people with little internet experience can get results without any outside help.  </p>  <p style=\"\">  \t<strong style=\"\">Does This Really Work?</strong>  </p>  <p style=\"\">  \t  Yes! You will see every step from start to finish. Then at the end of the course, I show you the first sale I made in my real account to prove this works. There is no theory. No fluff. Just clear, simple steps to take.  </p>  <p style=\"\">  \tP.S. I've just created another Bonus Lecture about making passive income from YouTube. This lecture goes over how I created a YouTube video that <strong style=\"\">makes $360 per month on autopilot with no work involved</strong>.  </p>", 
    "end_date": null, 
    "title": "Start an Online Business in 4 Steps", 
    "price": "40.00", 
    "instructors": "Steve Goldberg", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109792_a54c_5.jpg", 
    "course_url": "https://www.udemy.com/start-an-online-business-in-4-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-23T19:16:39Z"
}