{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Creating a great looking website can be challenging when you do not have the time,knowledge and money to create one and that is why I created this course and that is why you are here reading this right now!</p>\n\n<p>In this course you will learn step by step how to create fully responsive amazing looking websites with lifetime hosting and ready made your website and a built-in blog ready for you to get started as soon as today! not only this but the online store inside your website is loaded with digital products that you can start selling for profit right now or even give it away to build your email list! all you need is this course and $3 budget to get started and 1 day of work to get everything done.<br></p><p>you will learn how to create these websites with a tool called : Video Store Pro that currently selles for over $100 per membership but as a student in my course you will get the membership for only $3!</p>\n\n<p>You will also learn my 3 day money plan where I teach you how to get started as soon as you finish the course and see some good results.</p>\n\n<p>All you need to do now is secure your place before the price rise and I'll see you on the other side.</p>\n\n<p>and remember....good things happens to those who wait but great things happen to those who take action! so take action now and join this course today</p>", 
    "end_date": null, 
    "title": "Start a home business: Build and sell websites in 1 hour", 
    "price": "25.00", 
    "instructors": "Kenz A.Soliman, Success Step Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/846548_514d.jpg", 
    "course_url": "https://www.udemy.com/start-your-own-business-the-1-day-and-3-dollars-website/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-11T22:15:47Z"
}