{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Do you have a passion for teaching a subject that you love? Do you want to earn extra income on the side? Do you want to start up a <em style=\"\">successful </em>tutoring business that provides one-on-one or group tutoring to students? Well, then today you have found the online course to help you achieve that goal!</strong>  </p>  <p style=\"\">  \t   My name is Dmitri and I am a full time tutor. As a current  tutor of  English Language for over 15 students on a full time basis, I have come  to realize all the details that have helped me get to this successful  position, and now I want to pass on all these secrets to you, the  aspiring tutor!<strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Did you know?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">You can start a tutoring business TODAY!</li>  \t<li style=\"\">Starting up can literally cost nothing (I show you how)!</li>  \t<li style=\"\">Advertising your services doesn&#039;t have to cost you any money at all!</li>  \t<li style=\"\">Tutoring on the side can be very lucrative!</li>  \t<li style=\"\">Your full time job won&#039;t be affected if you decide to start a tutoring business!</li>  \t<li style=\"\">The tutoring business sector is massive, and only having a small slice of this can generate large profits. </li>  </ul>  <p style=\"\">  \t<strong style=\"\">In this online interactive course, I show you from start to finish how to start up a successful tutoring business, and maintain it so you never run out of new potential students! The tutoring business is highly competitive, BUT, I show you how to cut through all of the competition and come out on top.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">In this course, I provide all the answers to these questions:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">What are all the legal requirements? Don&#039;t worry, this is actually quite simple. </li>  \t<li style=\"\">Which subject should you tutor students?</li>  \t<li style=\"\">How should I prepare for lessons?</li>  \t<li style=\"\">What guidelines should I set up for my students?</li>  \t<li style=\"\">How do I market/advertise my services?</li>  \t<li style=\"\">How do I ensure my students are long term?</li>  \t<li style=\"\">How can I make more money through add-ons? I explain this concept to you, so don&#039;t worry if you don&#039;t know what that means. </li>  </ul>  <p style=\"\">  \t<strong style=\"\">I also show you how to get to the top of Google, WITHOUT PAYING A CENT! This is my personal favorite marketing strategy and generated me many new students without spending a cent! I will show you this in my course. I also show you WHERE and HOW to advertise your services on FREE platforms!</strong>  </p>  <p style=\"\">  \t      This online course is entirely comprehensive, meaning that you can be a seasoned tutor and wish to grow your tutoring business, OR you can be someone who is just getting started today!  </p>  <p style=\"\">  \t             This is the type of course that you can decide to view in a day,  OR view certain lectures as necessary. Though generally speaking, I recommend you  go through the entire course at least once to get your money&#039;s worth.  </p>  <p style=\"\">  \t             I conduct this course through interactive PowerPoint videos, faced video presentations, as well as screen capture videos, so I actually <em style=\"\">TALK </em>to you on screen and explain every detail regarding starting up your own tutoring business.  </p>  <p style=\"\">  \t     PLUS! Once you have established yourself, I show you how to &#039;replicate&#039; yourself through Udemy (this platform) and by using this platform, you can reach more students than you thought possible!  </p>  <p style=\"\">  \t <strong style=\"\">So, if you want to create a <em style=\"\">successful </em>and <em style=\"\">fun </em>tutoring business, then get started with my online course today!</strong>  </p>", 
    "end_date": null, 
    "title": "Start a Profitable Tutoring Business - Steps to Success!", 
    "price": "20.00", 
    "instructors": "Dmitri Dalla-Riva", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248498_7c22_2.jpg", 
    "course_url": "https://www.udemy.com/start-a-tutoring-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-23T04:39:21Z"
}