{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>~30 days Money Back Guarantee~</strong></p><p>You know that feeling when you feel like you are digging a never-ending hole with no end in sight and really struggling to quit your job and start your own business from home?</p><p>Opening a recruitment agency is one such business that doesn't require any technical knowledge. You can run your company sitting at home.</p><p>In this course, we (Jyotsna and Harsh) give out the exact blueprint to start and run a recruitment agency. I interviewed Jyotsna and asked her some of the toughest questions and she revealed everything about her business. </p><p><strong>This course is an actionable approach to start and run your own job recruitment agency:</strong></p><p>✔ Create a blueprint to start your business</p><p>✔ Understand, how to start the business<br></p><p>✔ Get the exact script Jyotsna used to pitch her clients<br></p><p>✔ Learn how to get clients for your recruitment agency<br></p><p>✔ Clarify all the doubts about starting an agency<br></p><p>✔ Learn the craziest mistakes Jyotsna made</p><p>✔ Even better than a thousand dollar course</p><p>✔ Avoid the mistakes and hack your way to success</p><p>✔ Proven techniques and results</p><p>✔ Actionable tips that you can implement today</p><p>✔ Very easy to understand and implement</p><p>✔ Get 1-on-1 help from instructors</p><p><strong>How is this course structured?</strong></p><p>I have taken a whole new approach to making this course more interactive. You will find <em>Video Lectures, Audio Lectures, Visual Workbooks, Quizzes to Weekly Q&amp;A sessions.</em></p><p>It's really exciting once you get started with this course. I am waiting to see you on the inside....</p>", 
    "end_date": null, 
    "title": "Start a Recruitment Agency from Home", 
    "price": 0, 
    "instructors": "Harshajyoti Das", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541918_7dcc_3.jpg", 
    "course_url": "https://www.udemy.com/home-based-business-ideas/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T05:35:09Z"
}