{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>IMPORTANT COURSE INFORMATION</strong></p>  <ul><li><strong>Students of this course get access to our exclusive web design business Facebook group where we provide feedback and share tips and resources to help you start and grow your business.</strong></li><li><strong>Over 10,500+ successful students enrolled and 290 positive reviews!</strong></li><li><strong>Daily discussions for you to join in (Instructor is available inside for questions)</strong></li></ul><p><em>____________________________________________________________________</em></p><p>Learn what it takes to start your own web design business from home and start living life on your own terms. </p><p>If you've been thinking about working in web design, so you can do freelance work from home, or anywhere in the world, this course will give you all the tools you need to succeed.</p><ul><li>Get a Piece of the $20 Billion Dollar Web Design Industry</li><li>Learn the 3 different ways to make money as a web designer</li><li>Choose a niche, so you can charge 'expert' rates</li><li>Develop your client roster and keep the projects flowing</li><li>Gain 11 techniques for upselling clients and boosting profits</li><li>Turn Your Hobby Into a Profitable Business.</li><li>Get advice from a professional and skip the new business learning curve.</li></ul><p>It's easy to make mistakes when starting a new business, and this course is designed to save you time and money by minimizing those mistakes.</p><p><em>____________________________________________________________________</em></p><p><em>\"Pure Quality! Christine does a fantastic job in explaining what it takes to start your own web design business. Not only is the provided material of high value, but Christine goes above and beyond with offering additional assistance. If you have any questions, she is right there to help. I am more than satisfied with this course.\" - Vincent M Aceto</em></p><p><em>____________________________________________________________________</em></p><p>As a bonus, this course will give many of the documents you'll need in your business including: contracts, proposals, questionnaires and more. You will also get access to an exclusive web design business Facebook group.</p><p>If you've got some web design know-how, this course will help you establish yourself as a professional, so you can work from home, or remotely from anywhere. </p><p>This course won't teach you how to code, but it will teach you how to launch, manage, and run a profitable web design business.</p><p><u>Content and Overview</u></p><p>After a brief introduction, you'll learn how to establish yourself in the web design industry by working within a particular niche, so you differentiate yourself from your competition. </p><p>Then, you'll get tips for building your portfolio, if you don't already have one or are looking to update yours. You'll even get ideas for what to name your business.</p><p>Lay the groundwork for your success by learning how to productize some of your offerings that you can reuse to save time. You'll learn to package your work and upsell clients. </p><p>Plus, you'll also get tips and tools to help you better manage your finances.</p><p><em>____________________________________________________________________</em></p><p><em>\"Excellent Course! A very comprehensive course on how to start a home web design business. Christine is a great trainer that will guide you along the way to achieve your objective in taking this course. Highly recommended!\" - Vanda Chan</em></p><p><em>____________________________________________________________________</em></p><p>Communication is critical to the success of your business, so you'll get strategies for communicating with clients, creating long-term relationships, and establishing expectations that will ensure your continued success. </p><p>You'll also learn the key strategies to finding ideal customers and how to keep them happy.</p><p>By the end of this course, you'll be prepared to launch your web design business from home or from anywhere in the world. </p><p>You'll walk away with the skills to be able to minimize the risk of starting a new business and employ tried and tested techniques to boost profits. Best of all, you'll be on the road to being your own boss.</p>", 
    "end_date": null, 
    "title": "Start and Run a Successful Web Design Business from Home", 
    "price": "30.00", 
    "instructors": "Christine Maisel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310716_cd12_10.jpg", 
    "course_url": "https://www.udemy.com/start-a-home-web-design-business-and-make-1000-per-month/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T11:32:52Z"
}