{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">How to start your own bookkeeping business</strong></em> course is for all the would-be bookkeepers out there who dream of working for themselves one day and for all the aspiring accounting students who would like to have their own practice one day. It&#039;s not a silver bullet, and so if you&#039;ve already started your own bookkeeping business, you may still find value in the course but it is for the start-ups. </p><p>In the course we look at things such as mindset, what you need when you start a bookkeeping business, finding and keeping clients happy and how to get out of the game. There&#039;s various exercises to help you to test your bookkeeping / accounting skills/knowledge. </p><p>The best selling book &quot;<em style=\"\">How To Start Your Own Bookkeeping Business and be Successful</em>&quot; (as a PDF) is included. The course will take approx 2 hours to complete plus reading time. </p><p>The way the course is structured - you read a chapter from the book and then watch the video and have a go at any of the exercises / examples given.</p><p>The course is ideal if you are serious about embarking upon a career in bookkeeping. Even if you are currently a self employed bookkeeper, you&#039;ll still get value from this course because we look at running a bookkeeping BUSINESS and not just being employed as a bookkeeper and having a job - this is a completely different mindset.</p><p>We touch on academic skills -and being technically competent to be a bookkeeper, but this is not a &#039;bookkeeping course&#039; - this is a business course, focused on how to run a specific type of business - namely a bookkeeping business.</p><p>The lecturer began a bookkeeping business for £150, with no experience and ran and grew it successfully for 10 years so none of this material is theoretical or hypothetical. Its real, its practical and it works. </p>", 
    "end_date": null, 
    "title": "Start Your Own Bookkeeping Business", 
    "price": "45.00", 
    "instructors": "Lisa Newton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302478_2457_4.jpg", 
    "course_url": "https://www.udemy.com/start-your-own-bookkeeping-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:19:09Z"
}