{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Probably you heard many times about people that work from home and make money online. This course explains step-by-step how to start, grow and run a <strong>graphic design home</strong> <strong>business</strong> that works. </p><p>Even if you don't know anything about graphic design and without buying any complicated software!</p><p>You will learn:</p><ul><li>how to become this week an awesome graphic designer by using tools that simplify all the advanced graphic designs tasks</li><li>how to find out and use free tools that will get you immediate results (this week) and help you serve your customers</li><li>how to find out customers for your graphic design work, starting with simple jobs and going further as you gain experience to much more advanced jobs (an better paid too!)</li><li>how to develop online tools that will build your brand and position you as a graphic design authority, in step-by-step actions even if you don't know anuthing about marketing and sales</li><li>what are the best paid graphic designs gigs and jobs to start with, to gain experience and make your first money. And how can you fulfill each of these jobs vitually in minutes, efortless, exactly like a pro (well, almost exactly)</li><li>how to get your first customer, this is in most cases the most difficult part. You will know exactly what, how and when to do so that you land your number 1 graphic design customer even you you don't leave your home or hotel if you travel around the world. And number 2 client, number 3...</li><li>How to make your clients send you more referrals again and again. Even if you don't necessary ask them to do so!</li><li>and much, much much more</li></ul><p>This course will teach you how to start a graphic design home business as a freelancer and how to grow it as a business that works without depending on you to sell each day. Most people don't like to sell, so we will focus on how you can grow your grahic design home business without going out and begging people to buy from you. You will work smarter!</p><p>If you are like most people dreaming to work from home or from virtually anywhere you probably heard about other people doing it and always thought \"<em>these people are doing great, I would love to do the same, but I don't know how</em>...\"<br></p><p>This is not true. I saw a lot of people without any artistic sense at all that make money with graphic design. They know where to look, what to do and how and in the same time they know what exact free tools to use so that they will create professional works. I have friends that make $3-5,000 per month just because they know how. And they are not a graphic designer!</p><p>So, anyone can do the same, by using the same step-by-step copy-paste system. </p><p>You don't need any graphic design experience, just s<strong>tart from zero, start and run your own home graphic design business</strong> from your kitchen.</p><p>In your own pace.<br></p><p>To start, here's what you need to do next...<u><strong> click the Take this Course button</strong></u> top right and you'll be taken to our secure payment page.<br></p><p>Just <strong><em><u>Enter Your Regular Details</u></em> </strong>and complete your investment to have immediate access.<br></p><p><strong>Start mastering your home graphic design business </strong>now, just like a pro!</p><p><strong>Thank you for reading this and learning about my course</strong> ... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE </strong>to get started!</p>", 
    "end_date": null, 
    "title": "Start And Build a Graphic Design Home Business", 
    "price": "25.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722872_9798_2.jpg", 
    "course_url": "https://www.udemy.com/build-graphic-design-home-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T16:31:49Z"
}