{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   This course is about Freelancing your service to others without spending any money.In this course you will discover how to start your own freelancing empire at absolutely no cost. You will be introduced to some excellent steps and tools to develop yourself as an exceptional and highly paid freelancer . There is no domain name, hosting or auto responder fees involved, unless you want to. You will be shown killer tips to leverage micro job sites for more profits. You will also learn how to leverage various marketing techniques for promoting your expertise and generating a good income. The tips inside the course can change the way you thought about freelancing your services forever.  </p>  <p style=\"\">  \t   You will learn:  </p>  <p style=\"\">  \t     •How to run a successful freelancing business?  </p>  <p style=\"\">  \t     •Various services you can offer people.  </p>  <p style=\"\">  \t     •How to use freelance and micro job sites.  </p>  <p style=\"\">  \t     •The best free methods to promote your services.  </p>  <p style=\"\">  \t   The course is divided into 6 sections, with 10 lessons which includes videos, power point presentations and additional resources in pdf. The course can be completed in 2 hours time. However, it is recommended to re-visit various parts of the training to be thorough with the concepts.  </p>", 
    "end_date": null, 
    "title": "Start your own Freelancing empire at no cost.", 
    "price": "20.00", 
    "instructors": "Marketing Ripples", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/223322_d365_6.jpg", 
    "course_url": "https://www.udemy.com/start-your-own-freelancing-empire-at-no-cost/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-19T22:11:29Z"
}