{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course provides you with a simple 7 step system that will help you to start making Lot’s of Money on Amazon. You will even learn how to become a bestseller On Amazon in as little as 90 days.</p>  <p><strong><em>Why should you consider this business opportunity?</em></strong></p>  <ul><li>Amazon is the Number 1 Online retailer in the World.</li><li>Amazon makes over $20 Billion per quarter and 40% of their profits came from small business owners all over the world.</li><li>Amazon has created an amazing opportunity for anyone to start selling their products on Amazon.</li><li>Amazon will take care of the shipping, storage, returns, the customer service and all you have to do is ship your products to Amazon every few weeks. Once your products have been sold, Amazon will deposit your profits into your bank account every 2 weeks.</li></ul>          <p>In This Course Your Will Learn How To:</p>  <ul><li>Find the Best selling products on Amazon that everyone is buying like Crazy.</li><li>Why Amazon is the best place on the Internet to sell your products.</li><li>Where to find Suppliers that will make the product for you at the lowest price.</li><li>Easily test your products.</li><li>Setup your online account and start selling on Amazon.</li><li>Test your first few orders.</li></ul><ul><li><strong>Sign up Today!</strong></li><li><em>**30 day Udemy money-back guarantee Included ** </em></li><li>Sign up today, and start making Money with Amazon FBA.</li></ul>", 
    "end_date": null, 
    "title": "Start A Successful Business On Amazon. 7 Easy Steps.", 
    "price": 0, 
    "instructors": "Devon Campbell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/696134_e9a2_2.jpg", 
    "course_url": "https://www.udemy.com/7-simple-steps-make-money-with-amazon/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-13T04:36:29Z"
}