{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\">Two years ago I accidentally discovered a unique business opportunity that has helped me earn upwards of $200 in 2 hours daily, 7 days a week!</p><p style=\"\">The idea behind the business opportunity is very simple and has to do with distributing certain types of balloons to local businesses that sell complementary products.&nbsp;</p><p style=\"\">My course explains this idea further and is broken down as follows:</p><p style=\"\"><strong style=\"\">The first three lectures</strong>&nbsp;explain how I discovered&nbsp;my unique balloon distribution business&nbsp;idea, how I tested and validated it, and how I turned it into a profitable business&nbsp;(I know it sounds crazy, making serious money with balloons, but I think you&#039;ll be&nbsp;pleasantly&nbsp;surprised&nbsp;to know how simple it is and how I earn money with it daily, and have FUN while at it!)</p><p style=\"\"><strong style=\"\">Step by Step Instructions:</strong>&nbsp;My 5 step process illustrates point by point how you can start your own balloon distribution business right away (I&#039;ve left nothing to chance...I&#039;m spilling all my secrets here)</p><p style=\"\"><strong style=\"\">Tips &amp; Hints</strong>: Useful tips to help you avoid the mistakes I&#039;ve made (Becoming a Master Balloon-Smith wasn&#039;t easy, there were setbacks and pitfalls, but with all my experience I can now show you how to avoid every single one of them)</p><p style=\"\"><strong style=\"\">Photos:</strong>&nbsp;Photos showing the idea being implemented</p><p style=\"\">This is truly a very unique way to make money and anyone that lives in or near a metro / urban / suburban location can do it. Rural dwellers will need to find the closest city.</p><p style=\"\">My no non-sense course comes with a 100% money back guarantee. If you take the course, then take action and don&#039;t start earning money within 48 hours, just ask for your money back. Yes, I am that sure this works because I do it on a daily basis.</p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Steps to Start Your Own Balloon Distribution Business", 
    "price": "25.00", 
    "instructors": "Afzal Sharif", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49009_ea46_8.jpg", 
    "course_url": "https://www.udemy.com/how-i-earn-200-in-2-hours-daily-7-days-a-week/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-08T21:43:16Z"
}