{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p style=\"\">  \t    Have you published a UDEMY course? Now...struggling to make money?  </p>  <p style=\"\">  \t      Today is the day you'll learn all the promotion tactics used by myself, high income instructors and all UDEMY studio members.  </p>  <p style=\"\">  \t<strong style=\"\">I've researched and collected this list in 1 year. </strong>Tried each tactic (also showing you on my screen during this course) where some worked some didn't. Those that didn't work immediately worked in long term. So, it means all the tactics work.  </p>  <p style=\"\">  \t<strong style=\"\">Interesting facts I've discovered while producing this course:</strong><br style=\"\">  \t       1. I didn't know I was using 73 platforms to promote my courses (never counted before), so here I am sharing 73 platforms/sites/ideas.<br style=\"\">  \t       2. I desk recorded my course in 1 day and edited in 2 days, never created any course in 3 days before<br style=\"\">  \t       3. I never placed my course promotions in 73 platforms in 1 day, I was using the platforms irrationally on different days<br style=\"\">  \t        4. While desk recording my course, in one day I got $200 sales  (promoting the Udemy topic to people who might even never heard what  Udemy is)<br style=\"\">  \t       5. I've been contacted by 2 journalists, and been scheduled for interview in Jan<br style=\"\">  \t        6. After interview I've been promised to be featured on large mailing  list of life entrepreneur magazine for massive exposure including mentions on  sponsored social media posts<br style=\"\">  \t       7. I've  been invited as a speaker to 2 events<br style=\"\">  \t       8. I've counted total 15 coupon sites in my arsenal + 1 more similar to coupon but listing site  </p>  <p style=\"\">  \t      Fellow colleagues, but this is not all, <strong style=\"\"><em style=\"\">I am dedicated to this course</em></strong> and want to explore the ways to get students further and<strong style=\"\"><em style=\"\"> I will be adding updates in this course</em></strong> lecture by lecture and platform by platform until&amp;after I exceed 100 sites/ideas/platforms. So, if you get this course now, <strong style=\"\">YOU WILL STAY TUNED with promotion techniques. </strong>  </p>  <p style=\"\">  \t      So...<strong style=\"\">Let's get started!</strong>  </p>", 
    "end_date": null, 
    "title": "Strategies to Make Your Udemy Course Popular - Unofficial", 
    "price": "20.00", 
    "instructors": "Liya Bergen", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336186_b5ff_5.jpg", 
    "course_url": "https://www.udemy.com/unofficial-73-ways-to-promote-your-udemy-course/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T02:24:29Z"
}