{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>*******************************************************************************************************</strong></p><p><strong>EARN PASSIVE INCOME SELLING E-BOOKS, AUDIO-BOOKS &amp; VIDEO COURSES!</strong></p><p><strong>*******************************************************************************************************</strong></p><p><strong>WHY INFO PRODUCTS?<br></strong>Creating and selling Information products can be one of the most profitable ways of making money online. Information products can include reports, e-books, audiobooks, video tutorials or any other digital good. These products can and do provide a significant and recurring income that builds over time. Plus the more practice you put into it, the better you get, and the better your results.</p><p><br><strong>WHAT ARE THE HURDLES?<br></strong>In spite of the passive income potential, most of us get stuck and never create a product! We usually have the following questions which go unanswered!</p><ul><li><em>What topic and format should I choose for my info product?<br></em></li><li><em>How do I create my product?<br></em></li><li><em>Where do I sell my product?</em></li></ul><p>This course will answer these questions and much more to help you become an infopreneur starting today! <br><br><strong>COURSE MATERIALS</strong>: Videos + PDFs<br><br><strong>By the end of this course, you will:</strong></p><ul><li><em>Have an idea for the type of digital product you want to create<br></em></li><li><em>Know how to quickly and cost effectively create the type of digital product you want<br></em></li><li><em>Know how to get amazing covers for your digital products.<br></em></li><li><em>Know how to distribute and sell your information product online for passive income with almost no marketing!<br><br></em><strong><em>So what are you waiting for? Let's get started!</em></strong></li></ul><p><br></p><p>Key Terms: Digital product creation, Information product marketing, Make money online, Make money from home, Make money without a website, Infoproducts, Earn cash, Passive income, Infopreneur, Online income<span>, Digital Products, How to create ebooks, how to create videos, how to sell ebooks, how to promote videos, how to make money from ebooks, how to make money from videos, video courses, audiobooks, online marketplaces, Clickbank, JVZoo, Udemy, Amazon, Scribd, E-junkie, Smashwords, Mindbites, Skillshare</span>, Information products</p>", 
    "end_date": null, 
    "title": "Successfully Run a Digital Products Business Online", 
    "price": "20.00", 
    "instructors": "Smartpreneur Academy ✪", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613054_8c45_11.jpg", 
    "course_url": "https://www.udemy.com/make-money-online-from-information-products-passive-income/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T18:59:38Z"
}