{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Freelancing is an art, and more than an art, it's warfare - Learn the techniques that will give you the upper hand and change your freelancing career today.</strong></p><p>  \t<strong>- - - - - - - - - - - - - - - - - - - - - <strong>- - - - - - - - - - - - - - - - - - - - -</strong> <strong>- - - - - - - - - - - - - - - - - - - - -</strong> - - <br><em></em></strong></p><p><strong>This course provides you with the tools you need to succeed both as a local and as an online freelancer.<br><em></em></strong></p>  <p>Do you want to learn the secrets that make all the difference between the average freelancer and the extremely successful freelancer?<br></p><p>Do you want to get so many job offers that you can actually be selective and only work  the ones you want to work?</p><p>Are you ready to take the next step in your freelancing career and maximize your earnings?<br></p><p>If you answer yes to any of the previous questions, this is the right course for you.<br></p><strong><em></em></strong><p><strong>- - - - - - - - - - - - - - - - - - - - - <strong>- - - - - - - - - - - - - - - - - - - - -</strong> <strong>- - - - - - - - - - - - - - - - - - - - -</strong> - - </strong></p><p><strong><span></span></strong></p><p>  \t<strong><em>If you want to improve your skills as a freelancer, get not only more jobs, but also better paid jobs and make more money than you've ever made, you need to know the secrets I'm about to teach you in this course.</em></strong>  </p>  <p>  \t      Discover the secrets to stand out from the crowd and grow as a freelancer.  </p><p>Get ready to learn all of the following.<br></p><ul><li><strong><em>The pros and cons of freelancing, as well as the main differences between working a regular day-job and working as a freelancer.</em></strong></li><li><strong><em>The different mistakes that most freelancers make, regardless of their experience, and how to avoid them.\n </em></strong></li><li><strong>The most valuable tips that will change your freelancing career for the better.</strong></li><li><strong>How to create a working station that fits your needs and your budget.</strong></li><li><strong></strong><strong>Why, where and when to hold meetings with local clients.</strong></li><li><strong>How to increase your chances to land new projects easily and effectively.</strong></li><li><strong>How to master local freelancing and dominate your local market.</strong></li><li><strong>How to master online freelancing and dominate freelance job websites.</strong></li><li><strong>And a lot more valuable information that will help you become a successful freelancer.</strong></li><strong><em></em></strong></ul><p><strong>- - - - - - - - - - - - - - - - - - - - - <strong>- - - - - - - - - - - - - - - - - - - - -</strong> <strong>- - - - - - - - - - - - - - - - - - - - -</strong> - </strong></p>", 
    "end_date": null, 
    "title": "Superhero Freelancer: Work from Home and Make 4K-10K a Month", 
    "price": "20.00", 
    "instructors": "Moy Lobito", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635354_5a25_4.jpg", 
    "course_url": "https://www.udemy.com/superhero-freelancer-vol-1-freelancing-success-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T22:58:35Z"
}