{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>“This course is the missing link I've searched for years. This is one of the very best courses I've seen in a long time.” <strong class=\"redactor-inline-converted\">Sergiu Funieru</strong></p>\n\n<p>*************************************************</p>\n\n<p>Would you like to become a <strong class=\"redactor-inline-converted\">certified Teleclass Leader</strong>?</p>\n\n<p>Do you want to participate in <strong class=\"redactor-inline-converted\">telesummits </strong>as an expert?</p>\n\n<p>This class may just give you the <strong class=\"redactor-inline-converted\">edge </strong>you need to set yourself apart from others!<br></p>\n\n\n\n<p>This course has been my signature course for many years for countless reasons, one in particular: it's an <strong class=\"redactor-inline-converted\">easy-to-follow</strong> <strong class=\"redactor-inline-converted\">step-by-step plan</strong> that shows you how to <strong class=\"redactor-inline-converted\">work from home</strong> or anywhere on the planet with something you already use on a daily basis – your <strong class=\"redactor-inline-converted\">telephone</strong>.</p>\n\n\n\n<p>In this course I will share with you the <strong class=\"redactor-inline-converted\">technology</strong> you need to record your teleseminar, how to <strong class=\"redactor-inline-converted\">structure</strong> them, how to <strong class=\"redactor-inline-converted\">price</strong> them, and where to <strong class=\"redactor-inline-converted\">market</strong> them – all <strong class=\"redactor-inline-converted\">without</strong> extra additional cost to you!</p>\n\n\n\n<p>What's more important than you sharing your wisdom with the world?</p>\n\n\n\n<p>Now I will share with you how to capture that most important message of yours, how to set it up as a teleseminar and how to provide your audience with your wisdom for years to come. Not only to they benefit, but you have just created a passive income stream!</p>\n\n\n\n<p>Whether you want to create one teleseminar, a series of teleseminars or even an entire 3-month or 1-year mentorship program by telephone, I will show you how to put it all together.</p>\n\n\n\n<p>All tools recommended in this course are free, including your conference line.</p>\n\n\n\n<p>Please watch the free lectures available to you to get some of your questions answered.</p>\n\n<p><strong class=\"redactor-inline-converted\">Special Notice: </strong>If you want to become a certified <strong class=\"redactor-inline-converted\">Teleclass Leader</strong>, you will need to order your certificate from the Core Freedom Academy at the end of your course. You will need to register with Core Freedom Academy and pass a series of steps, including a test, in order to receive your <strong>Certificate of Leadership</strong>. Certificates are optional and not required in order to take this course.</p>\n\n\n\n\n\n<p>*************************************************</p>\n\n\n\n<p><em>“Excellent, inspiring course! This course has inspired me with so many ideas that my head is spinning! It is packed full of information on why and how to use teleseminars to increase business and created passive streams of income - no detail is spared!”</em> <strong class=\"redactor-inline-converted\">Jessica Barst</strong></p>\n\n\n\n<p>*************************************************</p>\n\n\n\n<p><em>“This course far exceed my expectations and was well worth my time. I now have all the tools I need to begin recording teleseminars. I highly recommend this Udemy course. The best one I have taken so far.”</em> <strong class=\"redactor-inline-converted\">Angel Walker</strong></p>\n\n\n\n<p>*************************************************</p>\n\n\n\n<p><em>“</em><em>Wow, this course is fun &amp; informative. Even though I have experience in this area, Cha~zay really simplifies the steps and creates a brilliant picture of how to succeed from anywhere with a telephone line. If I had known ALL of this years ago... it would have saved me a lot of time! The instructor presents well-structured content with a caring tone that makes the material easy to follow and absorb. Great way to leverage expertise with larger audiences and tap even greater income.”</em> <strong class=\"redactor-inline-converted\">Bodhi Horn</strong></p>\n\n\n\n<p>*************************************************</p>\n\n\n\n<p><em>“</em><em>Great course in every way! It is very well laid out and presented in a way that is very easy to understand. This is perhaps the best course - so far - that I have taken. Every area is fully covered and the author gets back to you quickly if you have any questions. The audio and video are both excellent. The author speaks very clearly and is easy to understand. If your desire to provide a service and make money through Teleseminars - then this is the course you will want to take. It is worth every dollar of the price. I would highly recommend this course.”</em> <strong class=\"redactor-inline-converted\">James Review</strong></p>\n\n\n\n<p>*************************************************</p>\n\n\n\n<p><em>“</em><em>This is the best course I have ever taken anywhere! Dr. Cha~zay is an awesome teacher and this course is a masterpiece of years of experience and love for helping people succeed in life and she stands behind it above and beyond. Everything you need is included and if by any chance you find something that is not she will even help you with that as well. This life changing course can deliver your greatest dreams if you just believe in yourself that is all you need to bring and she evens helps with that too. Amazing.”</em> <strong class=\"redactor-inline-converted\">Guy Girard</strong></p>", 
    "end_date": null, 
    "title": "Teleclass Leader Certification Course: Teleseminars Series", 
    "price": "50.00", 
    "instructors": "Cha~zay Sandhriel Ph.D.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569304_de22_4.jpg", 
    "course_url": "https://www.udemy.com/teleseminar/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T14:51:11Z"
}