{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you looking for strategies to consistently <strong>earn</strong> <strong class=\"redactor-inline-converted\">extra\nincome each month </strong>without quitting your job or taking on a ton of risk?</p>\n\n<p>\n\nIn the past, people have used money market accounts,\ncertificates of deposit, and bonds to generate a little extra income while they\nspent their time on other endeavors. But these tried-and-true strategies for\nincome just aren't true anymore.</p>\n\n<p>\n\n</p>\n\n<p>You will be extremely lucky if you can find a money market\naccount paying more than 1% annually, and the highest tiered CD might net you\n1.25% or so.</p>\n\n<p>\n\n</p>\n\n<p>Today, U.S. Treasury bonds are paying less than 2% \nannually, and one-third of the world's sovereign bonds are now in\nnegative-yield territory!</p>\n\n<p>\n\n</p>\n\n<p>Simply put, tying up your capital for such measly returns is\na losing proposition.... but that doesn't mean you don't have options!</p>\n\n<p>\n\n</p>\n\n<p>Enter: <em>The Option Game:\nSafe Income in Any Market</em></p>\n\n<p>\n\n</p>\n\n<p>This course is all about how to use options to generate safe\nmonthly income no matter the market conditions. The strategies we will use to\ngenerate income with options do not involve speculating or taking on a ton of\nrisk, however. In many cases, these strategies can actually reduce the risk of\nyour overall portfolio. </p>\n\n<p>\n\n</p>\n\n<p>Now we aren't talking about day trading. We aren't talking\nabout chasing little moves in prices. We aren't talking about cutting losses\nand trying to hit a big gain once in a while. We are talking about a\ncomprehensive, long-term strategy to generate extra income, month in and month\nout. </p>\n\n<p>\n\n</p>\n\n<p>By the way, this extra income will only require 20 minutes\nor so worth of work each month. That's it. Again, this is a conservative\napproach so it does not require aggressive action.</p>\n\n<p>\n\n</p>\n\n<p>These are the strategies used by hedge fund managers,\nproprietary Wall Street traders, and even Warren Buffet on occasion. But guess\nwhat – generating income with options is as easy as buying stocks normally if\nyou know what you are doing! </p>\n\n<p>\n\n</p>\n\n<p>This course will go over all of the fundamentals you need to\nknow before getting started. The course will present live demonstrations to\nshow you exactly how to implement the strategies discussed. The course will present\na comprehensive example to show you exactly how you can use the strategies to generate\nextra income every single month. Finally, the course will go over the risks and\ngood practices you need to know before implementing the Option Game.</p>\n\n<p>\n\n</p>\n\n<p>To add additional value to this course, the instructor is\ncompletely willing to answer any questions you may have as you go through the\nmaterial.</p>\n\n<p>\n\n</p>\n\n<p>Now to be clear, this course is not about getting rich quick.\nIt is about generating extra income month in and month out. Over and over\nagain. </p>\n\n<p>\n\n</p>\n\n<p>The Option Game is not about hitting home runs; it is about\nhitting for singles and maybe a double every now and then. Thus, this course is\nbest suited for people who are self-disciplined and willing to stick with a simple\nstrategy.</p>\n\n<p>So if you are ready to turbo-charge your monthly income without\ntaking big-risks do not hesitate to enroll in <em>The Option Game</em> today!</p>\n\n<p>\n\n</p>", 
    "end_date": null, 
    "title": "The Option Game: Safe Income in Any Market", 
    "price": "35.00", 
    "instructors": "Joe Withrow", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/839688_588b_2.jpg", 
    "course_url": "https://www.udemy.com/option-game/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-04T18:43:43Z"
}