{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Have you ever wanted to start your own online store or eCommerce business?</strong>  </p>  <p>  \t<strong style=\"\">Do you want to learn how to sell on Amazon?</strong>  </p>  <p>  \t<strong style=\"\">Do you want to set up a semipassive income stream?</strong>  </p>  <p>  \t<strong style=\"\">If you said yes, then this course is for you.</strong>  </p>  <p>  \t    This course is for anyone looking to learn how to use Amazon FBA and wanting to get started selling on Amazon. .  </p>  <p>  \t    Taught by two experts with 15 years online selling experience, using screenshots, slide shows, and videos tutorials, we will teach you:  </p>  <ul style=\"\">  \t<li>what Amazon has to offer for 3rd party sellers</li>  \t<li>the difference between Fulfillment By Amazon and Merchant Fulfillment</li>  \t<li>which type of seller account to choose</li>  \t<li>what is retail sourcing and how to start</li>  \t<li>explain bundles and how they work</li>  \t<li>how to maximize your profits in categories like Groceries and HBA</li>  \t<li>the importance of sales rank and the role it plays in choosing inventory</li>  \t<li>what is online sourcing </li>  \t<li>how to use a wholesaler and where to find them</li>  \t<li>how to use the Amazon Seller app</li>  \t<li>how to save money when sourcing inventory</li>  \t<li>what categories you can sell in</li>  \t<li>what activities will get you banned</li>  \t<li>common jargon used in the Amazon seller communities</li>  </ul>  <p>  \t    In this 2 hour course, with over 60 minutes of sourcing videos, you will become an expert in retail and online sourcing and have the skills to turn Amazon into a part time or full time income.  </p>  <p>  \t  This is not another \"get rich quick\" scheme or \"Make x amount' in a month class, this is an in-depth, living, breathing course. Taught by two real people who are continuously updating and adding new sections, insuring that you are always staying current on today's best practices.  </p>  <p>  \t  If you been dreaming about becoming your own boss, we challenge you start the journey today.  Start here. Start now.  </p>", 
    "end_date": null, 
    "title": "The Complete Business Tutorial to Using Amazon FBA", 
    "price": "20.00", 
    "instructors": "Xavier Tafoya", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331292_4433_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-business-guide-to-make-money-using-amazon-fba/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-30T03:54:23Z"
}