{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Join Over 200 Students to Learn the Basics and Specifics of Setting Up Your Elance Profile for Success!</strong><br style=\"\"></p><p style=\"\">Becoming a freelance writer on Elance, oDesk, or Guru can be difficult. And, if you're someone looking to solidify your skills, learn how to get jobs on Elance, and most importantly, how to make money on Elance, you've come to the right place! <br style=\"\"></p>    <p style=\"\">  \t                                          In this course, you'll learn about everything from optimizing your profile for clients to top writing practices, how to draft applications to managing clients and everything in-between.  </p>  <p style=\"\">  \t                                          The result? A comprehensive guide on how to become a freelance writer and make $2,000+ every single month.  </p>  <p style=\"\">  \t                                          We'll cover several key areas in this course, including:  </p>  <ul style=\"\">  \t<li style=\"\">How to <strong style=\"\">optimize your profile</strong> and proposals to appeal to clients</li>  \t<li style=\"\">How to <strong style=\"\">manage clients</strong> and <strong style=\"\">build up positive reviews</strong> for all of your projects</li>  \t<li style=\"\">How to draft proposals that will <strong style=\"\">get you more jobs than ever before</strong></li>  \t<li style=\"\">How to <strong style=\"\">land repeat clients</strong> that allow you to focus on your work rather than the job hunt</li>  \t<li style=\"\"><strong style=\"\">Examples of my proposals</strong> and <strong style=\"\">top writing practices</strong> to give you the upper hand from the beginning of your career!</li>  </ul>  <p style=\"\">  \t                                          It's time to <strong style=\"\">work smarter </strong>and <strong style=\"\">harder</strong> than you ever have before.  </p>  <p style=\"\">  \t                                          It's time to <strong style=\"\">stop the hustle for inconsistent work</strong> at low prices you don't deserve.  </p>  <p style=\"\">  \t                                          It's time to <strong style=\"\">start your bright future</strong> as a <strong style=\"\">successful freelance writer</strong>.  </p>  <p style=\"\">  \t                                          Once you complete this course, you'll have the tools and knowledge to do just that.  </p>  <p style=\"\">  \t<strong style=\"\">DOWNLOADS:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Proposal Writing Checklist </strong>to guide you through every proposal you write</li>  \t<li style=\"\"><strong style=\"\">Summary Sheet</strong> that keeps all key concepts organised in one, easy-to-reference location</li>  \t<li style=\"\"><strong style=\"\">5 Real Proposal Samples </strong>to demonstrate how I evaluate positions and respond using my winning proposal template</li>  </ul>  <p style=\"\">  \t<strong style=\"\">REFINE YOUR SKILLS, PROPEL YOUR WRITING CAREER</strong>  </p>  <p style=\"\">  \t                                          This course is designed as a series of presentations that provide guidance, screenshots, and real-life experience from my own time on Elance. This means that you'll get an inside look designed to translate useful concepts into easy-to-understand steps you can take to build your own Elance career.  </p>  <p style=\"\">  \t                                          By taking this course, you'll have lifetime access to 3+ hours of lectures and insider information you can't find anywhere else. This means you can refine your skills and propel your writing career quicker, more efficiently, and more effectively than you could on your own.  </p>", 
    "end_date": null, 
    "title": "The Elance Freelance Writing Guide for All Levels", 
    "price": "20.00", 
    "instructors": "Ashley Surinak", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406300_4f15_4.jpg", 
    "course_url": "https://www.udemy.com/the-elance-freelance-writing-guide-for-all-levels/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T07:48:42Z"
}