{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">   WHY TAKE THIS FLIPPING STUFF COURSE?</strong>  </p>  <p>  \t <strong style=\"\">If you&rsquo;re looking for a quick and easy way to earn some quick cash,</strong> then you are at the right place. My name is Cartess Ross, and today I&rsquo;m going to introduce you to the exciting world of flipping.  </p>  <p>  \t It&rsquo;s where I teach you how to find and buy the stuff people want and need, and how to quickly get it sold for a quick, and hefty profit.  </p>  <p>  \t Imagine going out and buying an entire bedroom suite&hellip; The bed, the dressers, sofas, chairs, armoire, and mirrors &ndash; all of it.  </p>  <p>  \t And imagine paying only a few hundred dollars for all of this, and then flipping it for $1,500.00 CASH&hellip; It happens everyday of the week, and I&rsquo;ll show you where local auctions and estate sales are happening in your area -- so you can find incredible deals like these!  </p>  <p>  \t Not just furniture, but what about handbags. In the past, we&rsquo;ve sold vintage Gucci handbags and vintage Chanel bags for HUGE profits!  </p>  <p>  \t We&rsquo;ve bought tons of gumball and candy machines too. Kept a few for ourselves to earn residual income, and sold the rest for quick profits.  </p>  <p>  \t In this business, you can flip anything&hellip;I&rsquo;d like to introduce you to the world of auctions and estate sales&hellip; They&rsquo;re happening everyday in your towns and neighborhoods. And it&rsquo;s a great way for you to earn an extra few hundred dollars each week.  </p>  <p>  \t There&rsquo;s absolutely no risk for you to try my course&hellip;&rdquo;If you follow the instructions outlined in my course, and you don&rsquo;t at least make back the money you spent on my program within 30-days, I&rsquo;ll give you your money back.&rdquo;  </p>  <p>  \t So, let&rsquo;s get signed up and let&rsquo;s make money!  </p>", 
    "end_date": null, 
    "title": "The Art of Flipping Stuff for Fun and Profit", 
    "price": "20.00", 
    "instructors": "Cartess Ross", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134876_ccc1_6.jpg", 
    "course_url": "https://www.udemy.com/flipping-stuff/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-17T17:44:17Z"
}