{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\">Are you struggling to make a passive income online?</em></p>\n\n<p><em class=\"redactor-inline-converted\">Are you fascinated by online business but just cant seem to make it work?</em></p>\n\n<p><em class=\"redactor-inline-converted\">Are you on your last try at passive income and need help identifying why it isn't working?</em></p>\n\n<p><strong class=\"redactor-inline-converted\">If your answer to any of those questions was YES, then this course is for you! </strong></p>\n\n<p>I have spent years learning how to build a successful passive income model in my online business, but it has come at a very high price. That price was a 3 year period where I spent countless hours sobbing in my failures. Every avenue of passive income that I tried to create ended up crashing in failure. </p>\n\n<p><strong class=\"redactor-inline-converted\">Now, I run a very successful passive income business online. </strong></p>\n\n<p>How did I get there you ask?<em class=\"redactor-inline-converted\"> I got there by picking myself back up, learning from my failures, and executing with excellence. </em></p>\n\n<p>I want you to experience the benefits of having a passive income online but without all of the failures that I had go through. <em class=\"redactor-inline-converted\">That is why I created this course.</em> I am going to share with you what I believe to be the <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Top 10 Reasons You Are Failing At Passive Income</em></strong> in hopes that you will not suffer the same failures that I did. </p>\n\n<p><em><strong>If you dont like the course, you can have your MONEY BACK. I don't care about the money. </strong></em></p>\n\n<p>I want you to learn, implement, and succeed at building your own passive income business. </p>\n\n<p>-Kendall Knight</p>", 
    "end_date": null, 
    "title": "The Top Ten Reasons You Are Failing At Passive Income", 
    "price": "20.00", 
    "instructors": "Kendall Knight", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/805746_0ade_3.jpg", 
    "course_url": "https://www.udemy.com/the-top-ten-reasons-you-are-failing-at-passive-income/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T01:05:13Z"
}