{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>STUDENT REVIEWS For \"The Complete eBay Course - Make $1000s On eBay\":</strong></p><p><em>\"Thanks Dave, enjoyed your class. Just finished putting some of your ideas to work, and my first week, sold almost $1000.00, and had a few small orders come in last night. I enjoy all your classes.\" - </em>S. Nelson</p><p><em>\"I wish there were more stars! The first lectures were enough for me to make a great income. This is perfect. Thank you so much for your complete course that anyone can learn from.\"</em> - Nancy Ann </p><p>-----------------------------------------------------------------------------------------</p><p>A recent Nielsen Research study (done for eBay) revealed that the average household has $3,100 worth of unsold merchandise just laying around the house!</p><p>How would you like to turn your common, household items into CASH by selling them on eBay, and then start making some real money by turning eBay into a business that you run from home?</p><p>Think it can't be done? Well, guess again!</p><p>Over the last 15 years, I've helped over 300,000 people learn how to sell on eBay and I can teach you how to be a successful eBay seller, too!</p><p>This course is designed to take you from absolute eBay beginner and turn you into an eBay superstar, by walking you, step-by-step, through several modules.</p><p><strong></strong></p><p><strong>Section 1 - Let's Get You Selling On eBay - The RIGHT Way</strong></p><p><strong>Here's what you get in Section 1 of The Complete Ebay Course</strong></p><ul><li>How to determine the eBay values of items (live demo)</li><li>How to list items on eBay (live demo)</li><li>How to determine whether to list an item in eBay's Auction Format or in eBay's Fixed-Price Format (get this wrong and you will lose money)</li><li>My \"Pyramid Of Value\" System, which shows you exactly where to sell your items FAST, (eBay, Amazon, Craigslist, etc.) and for the most profit! (This takes away all the guessing!)</li><li>Simple ways to find additional products to resell on eBay for BIG profits!</li><li>How to use your smartphone to make money on eBay / Amazon</li></ul><p><strong></strong></p><p><strong>Section 2 - How To List An Item On eBay - The RIGHT Way</strong></p><p><strong>Here's what you get in Section 2 of The Complete Ebay Course:</strong></p><ul><li>What are the elements of a perfect eBay listing? </li><li>Step-by-step demonstration where we actually list an item on eBay in a live demo</li><li>All about packing and shipping your eBay items</li><li>Step-by-step demonstration of how to use eBay shipping to print postage from home (live demo)</li><li>Advanced strategies for more efficient eBay listing</li></ul><p><strong>Section 3 - Advanced Listing Strategies - (eBay Hacks BONUS COURSE)</strong></p><p><strong>Here's what you get in Section 3 of The Complete Ebay Course:</strong></p><p>In this section, you actually get my FULL \"Advanced Listing Strategies - eBay Hacks\" course as an added bonus!</p><p>This course walks you through some of the most advanced eBay listing strategies - these are advanced eBay strategies that will dramatically improve your sales, profits and eBay search engine rankings.</p><p>In short, you will be able to easily dominate your competition on eBay with these little-known tips, tricks and strategies. In fact, many of these tricks will be demonstrated for you, step-by-step, right inside eBay, so that you can easily duplicate my results.</p><p>You'll discover eBay tricks that even the top eBay Powersellers do not know!</p><p><strong>Section 4 - How To Find Killer Deals On eBay, Amazon And The Internet - (eBay Hacks BONUS COURSE)</strong></p><p><strong>Here's what you get in Section 4 of The Complete Ebay Course:</strong></p><p>In this section, you ALSO get<em> a THIRD complete course</em>, titled: \"How To Find Killer Deals On eBay, Amazon And The Internet - eBay Hacks\".</p><p>This course shows you some of the most amazing ways to find incredible bargains on eBay, Amazon and the Internet.</p><p>Revealed in this section:</p><ul><li>How to buy wholesale from Amazon to resell on eBay (live demo)</li><li>How to find \"UNFINDABLE\" deals on eBay (live demo)</li><li>How to use special searches to find killer bargains on ecommerce sites all over the Internet</li><li>Newbie eBay sellers make these critical errors all the time - this means incredible opportunities for YOU</li><li>How to \"SPY\" on top eBay sellers to uncover their top-selling products (live demo)</li><li>How to \"reverse-engineer\" top eBay sellers' top-selling products and easily find those products to emulate their success (live demo)</li><li>You've heard of \"sniping\" auctions? Well, let me show you how to snipe \"Buy It Nows\"!</li><li>The Amazing NINJA strategy that allows you to just copy / paste your way to eBay success</li><li>How to sell items on eBay BEFORE YOU BUY THEM so that you invest NO MONEY in merchandise!</li><li>And much, much more.</li></ul><p>The bottom line is, if you want to learn how to sell on eBay, this is the FIRST and LAST eBay course you'll ever need because it is taught by a Nationally-Recognized eBay expert and is broken down, step-by-step, complete with live demonstrations on the eBay site itself!</p><p><strong>Remember, you not only get the eBay Apprentice Program, but you also get two bonus courses (you can look them up on Udemy) INCLUDED inside this course!</strong></p><p>You also get access to me by initiating discussions inside the course and can always reach me if you have any questions.</p><p>I've helped over 300,000 people, just like you, to make money on eBay, (with lots of 6-figure success stories) and I look forward to helping you!</p><p>Be sure to scroll down and review some of the free preview lectures and then, make the decision to change your life with this groundbreaking course!</p><p><strong>Your enrollment is backed by Udemy's 100%, no-questions-asked, money-back guarantee, so enroll today with confidence.</strong></p>", 
    "end_date": null, 
    "title": "The Complete eBay Course - eBay From Beginner To Advanced", 
    "price": "25.00", 
    "instructors": "Dave Espino", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337202_152a_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-ebay-course-ebay-from-beginner-to-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T04:39:58Z"
}