{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hello Friends,<br>Are you struggling to get new clients for your current business? Is online and newspaper advertising are hurting your budget? Then you have come to the right place. I am going to cover following industries in the series of ten chapters. Each Section is divided into two parts A and B.</p>\n\n<p>Section A: How the industry is formatted? How to become an expert in your field?<br>Section B: How to get new clients? How to reach your target audience? Ow to convert your communication into business? Some of the techniques are turnaround ones in which customers will come after you instead of you running behind them. Some of your business may be for higher end population; I will teach you how to find and reach to the affluent neighborhood of your city.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>I have covered following chapters, but you can use this idea to virtually any business. </p>\n\n\n\n<p>(1) Bookkeeping<br>(2) Greeting cards/ Jeweler business<br>(3) Medical Billing and Coding<br>(4) Travel Industry<br>(5) How to become a local tour guide?<br>(6) Food industry<br>(7) Juicing Business<br>(8) Photography<br>(9) Social Media Specialist ( Yes ! there is a business by using FB, Twitter )<br>(10) meetup</p>\n\n<p>You will learn hardcore techniques of getting new customers, some of them are little tough but I promise you its worth listening and trying !!!</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The Last Cover Letter", 
    "price": 0, 
    "instructors": "Manan Shah", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/849400_fe81_3.jpg", 
    "course_url": "https://www.udemy.com/the-last-cover-letter/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T23:09:01Z"
}