{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Selling used items online is different than selling face to face</strong> because your Ad is the <em>only</em> information potential buyers have when it comes to purchasing decisions. The Ad you show them can work for you, or against you. This course was designed to help you create more effective Ads that get attention… and results.</p><p><strong>This course begins</strong> with an Introduction to who I am, who it's for, topics covered and why you should want to sell your unused items.</p><p><strong>Each section will focus on one key area</strong>, and I break it down into everyday language to help you understand why it is so important, and how you can use it to improve your own selling efforts. Topics covered include:</p><p>     - The importance of proper images, and you'll learn you how to take better pictures regardless of what camera you are using.</p><p>     - How to price your item correctly so you don't miss a sales opportunity.</p><p>     - How to write emotional description that appeal to the buyer's various senses to increase your chances of landing the sale.</p><p>     - How to generate more traffic to your ad without spending any money.</p><p><span></span>You'll learn all that plus other tips, techniques and best practices!</p><p><strong>Also included with this course </strong><strong>are two Free eBooks: </strong><em>Selling Online, a Reality Checklist</em> and <em>Writing Descriptions that Sell.</em> </p><p><strong>One Man's Junk is Another Man's Treasure. </strong>There's a reason that old saying has been around for such a long time - because it's true! Items that were just collecting dust or I was going to throw away ended up selling rather quickly. I made a lot of money selling online and you can too!</p><p><strong>During this course I focus mainly on Kijiji</strong>, which is a Canadian company, because that's the site I use to Buy &amp; Sell locally, but keep in mind that the bulk of the information you will learn in this course is universal, and can help you create more effective Ads regardless of where you live or what website you are using, such as Ebay, Craigslist and so on.</p><p><strong>B</strong><strong>y the end of this course</strong> you'll know how to create effective ads that get attention, and results!<br></p>", 
    "end_date": null, 
    "title": "The Buy & Sell Money Tree (Create Effective Ads that Work)", 
    "price": "20.00", 
    "instructors": "Kenn Crawford", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596922_2cc5_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-buy-and-sell-locally-with-kijiji/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T21:32:29Z"
}