{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Learn STEP-BY-STEP How To Write (Or Find Someone To Write It For You), Publish And Market A Kindle E-Book And Become A Best-Selling Author!</strong></p><p>  \t<em>    Want To Make A Lot Of Money Online By Becoming  a #1 Amazon Bestselling Author By Publishing Your Book On Kindle?  </em>  </p>\n\n<p>This course is designed to help you write (or find someone to write it for you for cheap), publish and market your books the right way. <strong class=\"redactor-inline-converted\">I published over 100 books myself and I do this full time.</strong> I used to be a financial analyst (I was not making enough money) but decided to self-publish on Kindle Full-time!</p><p><strong class=\"redactor-inline-converted\">This is the Easiest an Fastest Way To Make Money Online By Far.</strong> <br></p><p><strong>This is A Step-By-Step System That Teaches You How To :</strong></p><ul><li><strong></strong><strong>How to outsource EVERYTHING so you don't even need to write the books yourself</strong></li><li><strong>How to easily find a profitable niche with extremely low competition</strong> (Used by all the best-selling authors for centuries). I show you step-by-step how to do this.</li><li>Exactly how to make a killing selling <strong>BOTH fiction and non-fiction</strong> (the strategies for each one are completely different).</li><li><strong>The sneaky little secret best-selling authors use to select a category for their book</strong> (Don't even think about making money with kindle without knowing this)</li><li><strong>Step-by-step how best-selling authors do their keywords research</strong> (You'll be amazed how efficient these techniques are)</li><li><strong>How to create a title and cover that sells like Apple products</strong>. (People DO judge a book by its cover. Don't worry, I'll show you how to outsource this).</li><li><strong>Cutting edge methods to promote your book that struggling Authors WISHED they knew</strong> (These guerilla marketing strategies will sky-rocket your earnings!)</li><li><strong>Sneaky techniques to help you get tons of positive reviews on your kindle e-books.</strong> (This way you can make even more money, quicker)</li><li>Step-by-step <strong>how to successfully market your Kindle e-books </strong>so they become best-sellers using the KDP platform. (There are A LOT ofdifferent techniques that you can use to massively increase your earnings)...</li><li><strong>Exactly what to do if you get a negative review on your kindle e-book.</strong> (This technique will build your credibility through the roof!)</li><li><strong>The correct and proven way to price your book to maximize the amount of money you'll make with each book.</strong> (You'll be surprised at first, but you'll thank me later)</li><li><strong>Step by step how to creating a Cash generating back-end with your kindle e-books.</strong> (This is the difference between a $5000 per month author and a $15 000 per month author)</li><li><strong>Step-by-step how to create a passive income producing Kindle e-book and publish it at the speed of light.</strong> (You'll be surprised how efficient and effortless these methods are. You could do this even if you do not speak English!)</li></ul><p><br></p><p><strong>FREQUENTLY ASKED QUESTIONS</strong><br> </p>\n\n<p>Q. Do I have to live in the U.S?<br> <br> <strong>A. No! It can work from anywhere in the world ( I live in Canada)</strong><br> </p>\n\n<p>Q. Is is only for Non-fiction books?<br> <strong></strong></p><strong>\n\n</strong><p><strong>A. No! This program is for BOTH Fiction AND non-fiction books!</strong><br> </p>\n\n<p>Q. Do I have to write the books myself?<br> <br> <strong>A. No! Of course you<br> can write the books yourself if you like to write, but most of my students outsource everything. Marketers make money, not writers. I also have students that are writers and joined my program to know exactly how to do the marketing for their books.</strong><br> <br> </p>\n\n<p>Q. What if it doesn't work for me?<br> <br> <strong>A. It works for everybody, but if for some reason you don't like the program, just contact Udemy and they will refund you.</strong><br> </p>\n\n<p>Q. I already know how to outsource books...Will I get any value from this program?<br> <br> <strong>A.<br> Yes. There are a lot of videos in this program...How to outsource the <br>books is only about 5% of the program. I go deep on how the Amazon <br>algorithm works and how to optimize your sales as quickly as possible.</strong><br> </p>\n\n<p>Q. How long does it take to make money with this method?<br> <br> <strong>A. <br>In my opinion this method is the easiest and fastest way to make money <br>on the internet by far. You can literally have a recurring income within<br> 7 days after you start this program.</strong></p><br><ul></ul><p><br></p><p><br></p><p><strong class=\"redactor-inline-converted\"><br></strong></p>", 
    "end_date": null, 
    "title": "The Most Complete Step-By-Step Kindle Publishing System", 
    "price": "20.00", 
    "instructors": "Max Valmont", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/828538_ab02_3.jpg", 
    "course_url": "https://www.udemy.com/the-most-complete-step-by-step-kindle-publishing-system/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-21T20:49:36Z"
}