{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>My Udemy courses have been taken 100,000 times by over 25,000 students, have been awarded countless 5 stars reviews. </strong><em>That is all the proof we need that our methods work!</em></p><p><em>LATEST: Course Up to date for 2016. Only fresh information.</em></p><p><em></em></p><p><em></em></p><p>My name is Howard Lynch and for the past 4 years, I've been a full time internet marketer, working from home. I run many many businesses, but I've had in particular massive success with simple launches, on a very simple-to-use platform called WarriorPlus.</p><p><strong>WATCH the promo video for an example of one of these launches, and the money it generated me in just one week.</strong></p><p>I'm going to show you -over my shoulder, how I put everything in motion, even if you have no experience in that domain. By the way, I have multiple launches going out every month. I've got this down to an exact science.</p><p><strong>I INSIST </strong><span>that you take action on the material in this course, and I am therefore offering completion bonuses worth $997 if you apply what's in the course (you heard me).</span></p><p>My first launch went very well. Follow through and expect the same.</p><p>About this course:</p><ul><li><em>No experience is ever needed to get further in the course.</em></li><li><em><em><em>Top rated instructors teaching VERY satisfied students</em></em></em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li><li><em><strong>You also get full, free, unrestricted, access to my ultimate traffic system, which sells here on Udemy for $297</strong></em></li></ul><p>ENROLL NOW and let's get started already ;)<br></p><p>Much Love,</p><p>Howard &amp; Antoine</p>", 
    "end_date": null, 
    "title": "The 2016 Marketing Method with Assignments & Case Study!", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776356_a580_3.jpg", 
    "course_url": "https://www.udemy.com/launch-your-first-successful-product-and-win-working-method/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T21:32:45Z"
}