{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>COMPLETELY UPDATED COURSE - OCTOBER 2015!</strong></p><p><strong>What's NEW?</strong></p><ul><li><strong>Filmed in our professional television studio with stunning HD broadcast cameras - No home made screen capture or poor quality cameras and audio!</strong></li><li><strong>More advanced skills and strategies to hire using Fiverr to stay on the cutting edge and ahead of competition</strong></li><li><strong>Still access the original course for even more great tips and tricks!</strong></li></ul><p><strong><br></strong></p><p>Discover how I use Fiverr to <strong>hire amazing experts</strong> to improve my business <strong>AND make money</strong> on selling the work to raving customers!<br></p>  <p>  \t<em>This is NOT a \"get rich quick\" course</em>, though with the right attitude and willingness to put skills and techniques learned into practice, <strong>I have been able to make a tidy profit </strong>every month.<br>  </p>  <p>  \t  Remember, you have a <strong>FULL MONEY BACK GUARANTEE</strong> on this course. No risk at all to buy. This course is a digital version of a live event which has been completed at conferences where ticket costs exceed $3000 per person.  </p>  <p><strong>Take the new 90 minute course, or access the original 90 minute course as an added bonus!</strong></p><p><strong>In this course, you will discover</strong> how to get professional tasks completed in your business (or life) on a shoestring budget. Specifically, we cover:  </p>  <ol>  \t<li>How you can get tasks done in your business for $5</li>  \t<li>Why you should be paying someone else to do jobs you can't do</li>  \t<li>At least 20 things you can get done today for $5, that would normally cost up to 200 times more</li>  \t<li>Hints and tips to save you time when hiring experts</li>  \t<li>Fatal mistakes to avoid when hiring experts to help</li>  \t<li>Live website examples to see exactly how I find and I hire staff</li>  \t<li>Jobs I get done on Fiverr and on sell to my customers for massive profits</li>  \t<li>Real examples of jobs I have profited from using Fiverr</li>  </ol>  <p>  \t<strong>The course consists of:</strong>  </p>  <ul>  \t<li>30 easy to digest training videos</li>  \t<li>A personal note book and check list to ensure you get the most out of what is taught</li>  </ul>  <p>  \t               The 30 videos include a <strong>combination of lectures and live examples</strong>, with personal stories and real-life jobs that have been completed using a simple website. They are broken into small chunks so you can watch them all in one sitting, or progress through them at your own pace whilst you learn to use the site.  </p>  <p>  \t<strong>This course is for individuals and business owners who:</strong>  </p>  <ul>  \t<li>Have never used, or have no idea how to find and hire experts online</li>  \t<li>Are frustrated with not having enough time to complete simple tasks</li>  \t<li>Would like to get professional help in their business, but don't have bottomless pockets</li>  \t<li>Love the idea of having someone else complete awesome work in their business for a very small amount</li>  \t<li>Have no skill or experience, though would like to start a business by finding the best providers on Fiverr and linking them to hungry customers for a profit</li>  </ul>", 
    "end_date": null, 
    "title": "The Ultimate Guide To Hiring Experts on Fiverr", 
    "price": "20.00", 
    "instructors": "Pete Kvist", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207680_293a_9.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-guide-to-hiring-experts-on-fiverr/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-30T03:21:05Z"
}