{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>STUDENT REVIEWS For</strong><strong> \"</strong><strong>Sell on Amazon - Work From Home And Make Money Online FBA\"</strong></p><p><em>\"This course is awesome so far! In less than a week I have already found some items, opened an Amazon Seller account, and have just shipped my first box! Waiting to see how the sales work out, but Diego makes everything super simple! There's no reason not to do this!</em><em>\"</em> - Rob Molloy<span></span><br></p><p><span><span><em>\"This is a brilliant course, it's an A-Z guide of how to set up an Amazon account, how to find the right products to sell and how to make money on Amazon. The videos are great and Diego explains step-by-step exactly what to do in order to run a successful business\" - </em>\n\nMaggie Styles<br></span></span></p><p><strong>--------------------------------------------------------------------------------------------------</strong><strong></strong></p><p><strong></strong><strong>Would you like to earn more money? </strong><strong>How much more?</strong></p>  <p>  \t                      Well, here you have a great opportunity of earning money as partner of Amazon, and the second question I asked you because the amount of money that you will earn depends exclusively of how much time you can put into the business. Start your Home Business today!  </p>  <p>  \t                      This training will teach you step by step, every single detail, of how I easily earn $1000s or more a month working form home, is so easy and so broken down that even my grandma can do it. Anyone can do this, no experience or knowledge required, all you need to do is follow the instructions on the training, put a little effort and wait for the money.  </p>  <p>  \t                          Let me tell you how I discovered the $1000 a month formula, I'm a computer network engineer and even with a high salary job I was always looking for the best strategy the best solution, the best path to be financially independent and avoid forever, angry bosses, frustrated clients, boring meetings, weird company policies, dealing with problems all the time and working the best hours of my day to build other guy's dream…  </p>  <p>  \t                          After years and years looking, searching, investigating and testing, I finally found the road map to success and the best strategies to reach financial independence.  </p>  <p>  \t                      I started with 5 hours a week, so Monday to Friday, instead of watching TV for 1 hour every day I worked on my Amazon business, and remember, I still have my weekends free! Just 1 hour a day working form home and making money online.</p>  <p>  \t                      And remember, there is no risk! if for any reason you are not 100% satisfied, or if you think the training is not for you (I can't imagine, why, but nevertheless!), no problem, you have 30 days 100% money back warrantied. No question ask! We just return the money to you immediately. You have absolutely nothing to lose. At least try it so you can finally change your finances and change your life.  </p>  <p>  \t                          You have a full 30 days to study and see the results. Work from Home and Make Money Online.</p>  <p>  \t                          See you on the training!  </p>  <p>  \t                          Diego.  </p>", 
    "end_date": null, 
    "title": "The Complete Amazon Seller Course - Master Amazon FBA", 
    "price": "30.00", 
    "instructors": "Diego Davila", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325686_749c_9.jpg", 
    "course_url": "https://www.udemy.com/learn-how-i-earn-1000month-selling-on-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T14:15:24Z"
}