{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    Three big factors affect our happiness: what we do, who  we’re with, and where we live. While we often focus on the first two, we tend  to overlook the influence our home has on our lives. Perhaps you’ve recently  moved and feel like a fish out of water, or maybe you’ve never felt comfortable  where you live.  </p>  <p style=\"\">  \t  Animals are very instructive when it comes to their living  space: They either adapt, migrate, or die. Learning from them, this home improvement seminar addresses key strategies to &quot;adapt&quot; to feel more at home, including  using Feng Shui to improve the energy of your living space; critical  &quot;migration&quot; (relocation) do&#039;s and don&#039;ts, and how to avoid  &quot;dying&quot; from unhappiness where you live by finding the courage to  move.  </p>  <p style=\"\">  \t<strong style=\"\">Featuring:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Nationally renowned Feng Shui expert, Loralee Makela, shows how to create an indoor and  outdoor home environment that supports who you are and what you want to have  happen in your life.<br style=\"\">  \t</li>  \t<li style=\"\">International relocation expert, Judith Kveton, outlines key tips  and strategies for settling in smoothly to your new or current community.<br style=\"\">  \t</li>  \t<li style=\"\">Laurie shares how to feel more comfortable where you  live or to get the heck out of Dodge.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">NOTE: </strong>This home  improvement ideas seminar is the 5th of 6 in Laurie Gardner&#039;s Courageous  U series, &quot;Big Shell or Bust: Making and Managing Change.&quot; Enroll in  each seminar separately or enjoy the whole series.  </p>  <p style=\"\">  \t    Also note that this home improvement ideas seminar was originally  offered as a live teleseminar. Udemy participants who have questions should  type them on Udemy rather than following the instructions for phone Q &amp; A.  </p>  <p style=\"\">  \t<strong style=\"\">What people are saying about &quot;There&#039;s No Place Like Home&quot;:</strong>  </p>  <p style=\"\">  \t<em style=\"\"><em style=\"\">&quot;I tried some of the feng shui tips, and they really worked! New opportunities and clients started coming in shortly after I made those changes in my home, which was really about changing my attitude!&quot; - self-employed entrepreneur, California</em></em><strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<em style=\"\"><em style=\"\">&quot;Having just moved to a new town by myself, I really appreciated the very real, doable tips on how to integrate into my new home more quickly and easily.&quot; - recent widow and retiree, New England </em></em>  </p>", 
    "end_date": null, 
    "title": "There's No Place Like Home", 
    "price": 0, 
    "instructors": "Laurie Gardner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40608_cffc_8.jpg", 
    "course_url": "https://www.udemy.com/theres-no-place-like-home/", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-08T01:18:26Z"
}