{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated on December 2015:</strong></p><p><strong>Enroll on this Course right now</strong>. You can be making more money next week that you are doing today.</p><p>__________________________________________</p><p>***** <strong>Top 50 Udemy Authors in the Business Finance Industry</strong> - <em>eSkillsToday Award</em> *****</p><p>***** <em><strong>Ricardo is one of the best Instructors and my favorite when we are talking about Passive Income and Business Development. Hands down.</strong></em> <em>- </em>Mike Robinson *****</p><p>__________________________________________</p><p><strong>Who is this course for and why you should take it (in 1 minute):</strong></p><p>Hello and welcome to the Course, where I’ll take you through the entire process of thinking Entrepreneur and shifting your life around, from scratch.  My name is Ricardo Ribeiro and I’m an awarding winning Instructor in the Business Finance Industry, with more than 15 years experience, owner of several successful businesses, with thousands of dollars made on Passive Income, and an enthusiast of Personal &amp; Business Development.</p><p>This certified course is for you that seeks to improve your life by breaking free from a job you probably hate and start working for yourself. Throughout the course we will cover techniques used by entrepreneurs throughout the world, and walk you through a step-by-step process for shifting your habits and thoughts, that you will successfully lead you to an entrepreneur thinking full of business opportunities, and… I’ll even include a few “secrets of the pros.”</p><p><em>“In a moment of decision, the best thing you can do is the right thing to do, the next best thing is the wrong thing, and the worst thing you can do is nothing.”</em><br>\n- Theodore Roosevelt</p><p>--------</p><p>Everyone has bad moments at some point of they’re lives, but a shift in ones perception can be the beginning of a change that will completely revolutionize your life. </p><p><strong>Probably you are not satisfied with your situation money wise, maybe you want to change jobs or even quit your current job and create one for yourself. Well, you have come to the right place. </strong></p><p>By the end of this course your mindset should be potentiating your development in a way that you may feel that everything is possible and the only person between you and success is just yourself. <strong>Change your life and think entrepreneur, experience a world of possibilities that you can make them yours.</strong></p><p>In this Certified Course <strong>we will dig deep and start poking around some attitudes, behaviors and techniques that you must have in order to be a successful entrepreneur.</strong> We will cover the advantages of working from home, how you can stop procrastinating, what you need to change in your life and start doing, identify, create and act on the many of opportunities that you deal every day and that can turn eventually into gold. For achieving this there are new habits and settings on your live that you must do first, and that along many other techniques will be covered in this Course also.</p><p><strong>If you want to run your own business and be independent, this is the Course for you.</strong> Being an entrepreneur is a high-risk, high-reward position to be in. Its has some stressful situations, but it's also full of rewards and a sense of accomplishment of seeing your hard work come to life and pay off. It's not as hard as it seems as long as you have perseverance, patience, and, of course, good ideas. You'll be your own boss sooner than you think, believe me.</p><p>Remember that <strong>you will be learning from someone that already have achieved these goals</strong>. And in my opinion this will serve you a shortcut to your success that will save you lots of time and falling and getting up along this Entrepreneur path. <strong>The value of this experience is immense and it will be shared with you along the Course</strong>.</p><p>I’m here to help you. I'm available to answer all your questions and advice you along the way. Together we can make sure you have great success. I'm with you on this!</p><p>Thanks for your interest in this course. I put my hearth and soul on everything I do so you have my personal guarantee that you will absolutely love it as the happy students already enrolled, or <strong>you have 30 days money back guaranteed with no questions asked</strong>, so… you have nothing to lose. </p><p>I hope you’re as excited as I am!  If you’re ready to learn more and sign up for the course, <strong>go ahead and hit that Enroll button</strong>, or take a test drive by using the Free Preview feature. See you in the course!</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Think Entrepreneur: Making a Living on a 4h Per Day Work", 
    "price": "20.00", 
    "instructors": "Income Mastering Ricardo Ribeiro", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556302_14f4_6.jpg", 
    "course_url": "https://www.udemy.com/think-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T13:55:33Z"
}