{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Trading in SPACE, the newest course by Trading School&#039;s Matthew Bell is a fresh new approach in trading using price action. As the markets continue to change and become more popular for everyday people, those in power manipulate them more. With Trading in SPACE however, you can put yourself on the winning side of trading. Learn to see the manipulation and trade with confidence as those around you continue to struggle and be victims of greed. </p><p>You will learn an explosive trading method that offers great risk to reward (6:1 Reward to Risk at times) on most trades, plenty of trades to keep you excited and on track... and will work across different time frames. Nothing will be left out of this &quot;Straight to the point&quot; course. </p><p>You won&#039;t be given useless and counterproductive information to confuse and slow your learning, that simply not our style. The course is designed for intermediate level traders however new traders are also encouraged to enroll as it will cut your learning curve down dramatically and keep you in the winners mindset and seat. </p><p>The course is a very relaxed 70 minutes. It will take you through the conditions required to trade the system including the setup, stop loss and take profit targets. </p><p>Don&#039;t wait too long and don&#039;t be a victim to the markets, put your finances back in your hands with this never before seen course and start building wealth for yourself today!</p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Trading in Space... The Forex Trading Method", 
    "price": "50.00", 
    "instructors": "Matt Bell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596680_c1a3_9.jpg", 
    "course_url": "https://www.udemy.com/trading-in-space/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T14:12:49Z"
}