{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em><em><strong><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></strong></em></em></strong></p>\n\n<p><strong>Interested in making money behind the wheel? You're in the right place.</strong><strong></strong><br></p>\n\n\n\n<p>Dear Rideshare Driver,</p>\n\n\n\n<ul><li>Are You Ready To Dominate Ridesharing In 2015?</li><li>Do You Want Insider Info On Surge Pricing?</li><li>Have You Mastered The Basics And Are Ready To Learn More Advanced Strategies?</li><li>Do You Want To Maximize Your Tax Write Offs?</li></ul>\n\n\n\n<p>You spend untold hours in the car the kind of hours they grind on and make you think \"there's got to be some way I can be more productive. </p>\n\n\n\n<p><strong>Have You Ever...</strong></p>\n\n\n\n<ul><li>Missed Out On The Big Surge Because You Weren't In The Right Place?</li><li>Wondered If It's Worth It To Buy A New Car For Uber?</li><li>Thought About Ways To Leverage Rideshare For Other Business/Networking Opportunities?</li></ul>\n\n\n\n<p>If you answered YES, then you're in the RIGHT PLACE!</p>\n\n\n\n<p>Behind the wheel\" well now there is thanks to the \"turning miles on the road into cash in your pocket. Course you will learn how to turn those endless hours in the car from boring unproductive time to cash in your pocket. </p>\n\n\n\n<p>I will reveal <strong>EXACTLY WHEN and WHERE</strong> I go to make the most money in the city<em>( Find your SWEET SPOT)</em><br></p>\n\n\n\n<p>By becoming an uber driver, you will learn the ins and outs of writing as a ride share professional. Everything from registering with the company to buying a car hiring driving partners and even choosing what level of uber driver you want to be.</p>\n\n\n\n<p><strong> I will REVEAL you how to Consistently make $500 in 24 hours using UBER!!!</strong><strong></strong><br></p>\n\n\n\n<p> You will learn other important ride share professional skills such as how to find the most profitable driving times and the importance of positive reviews as well as solid customer relations, which will help you build a high-quality profile and reputation by the end of this course. </p>\n\n\n\n<p>You will have built the basic foundation of knowledge necessary to have a successful career as an uber ride share professional.</p>\n\n\n\n<p><strong>This course could easily sell for hundreds of dollars. I personally know of gurus out there who are charging hundreds, even thousands of dollars for a fraction of the information contained in this Udemy Course.</strong></p>\n\n\n\n<p><strong>As with all my courses:</strong></p>\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently $ 297, but will next increase to $ 397</li><li>You have unlimited lifetime access at no extra costs ever !!!</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money back in full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy.</li></ul>\n\n\n\n<p><strong>PSS:</strong> Do you really want to be a<strong> \"Successful Uber Driver\"</strong> ? Do you really want to enjoy a lifestyle that you only dream about now?</p>\n\n\n\n<p><strong>PSSS:</strong> It will take hard work. It will take perseverance. But if you can honestly answer “Yes\" then there is no reason why you can't start building your <strong>Ride Sharing Empire</strong> today.</p>\n\n\n\n<p>This will be a truly interactive course with additional bonus routines added over the course of the first year, inspired by the feedback from students.</p>\n\n\n\n<p><strong>Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...Scroll up and Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "Uber: Learn to Max Out your Uber Rideshare Profits", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610852_7d9b_3.jpg", 
    "course_url": "https://www.udemy.com/making-money-with-uber/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T16:44:46Z"
}