{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Viele Coachs, Trainer/innen und Berater geben Tag für Tag ihr Wissen weiter - und mit Udemy-Kursen können sie daraus ein Zusatz-Einkommen machen. Viele scheuen allerdings den Aufwand. Und manchen bereitet auch die englische Sprache Probleme.</p><p>Wie schade!</p><p><strong style=\"\"></strong>Dabei geht das durchaus:<strong style=\"\"></strong></p><p><strong style=\"\">Udemy-Kurse hochwertig und trotzdem schnell zu produzieren!</strong></p>In diesem Video-Kurs lernen Sie, wie Sie als <strong style=\"\">Wissensarbeiter/innen</strong> Video-Kurse für Udemy entwickeln können und wie sich deren Vermarktung gestaltet. <p>In 46 Lektionen - verteilt über 12 Abschnitte - erfahren Sie, </p> <ul style=\"\"><li>wie Sie Udemy-Kurse in einem sinnvollen Zeitrahmen fertigstellen</li><li>welche Pannen und Fehler Sie vermeiden sollten – und wie das geht</li><li>wie Sie den Review-Prozess überstehen (und Krisen überwinden …)</li><li>wie Sie Ihre Udemy-Kurse erfolgreich vermarkten</li></ul> <p>In 10 Quizes können Sie überprüfen, was Sie von dem Gelernten behalten haben.</p><p><strong style=\"\">Alle Materialien sind herunterladbar. </strong></p><p><strong style=\"\"></strong>Die 23 vertonten Folien-Vorträge und 16 Person-Videos (in denen ich zu Ihnen spreche) sowie die 7 Text-Lektionen liefern Ihnen ein abwechslungsreiches Programm, an dem Sie hoffentlich viel Freude haben werden. </p><p>Es erwarten Sie zusätzlich Druck-Vorlagen und weitere <strong style=\"\">Materialien zur Vertiefung</strong>.</p><p><strong style=\"\">Zu 33 Lektionen gibt es umfangreiche Aufgaben für Sie!</strong></p><p>Schließlich wollen und sollen Sie aus diesem Kurs möglichst viel mitnehmen.</p><p>Alle Fall-Beispiele und Praxisberichte basieren auf meinen Erfahrungen: Dieser Udemy-Kurs ist der 8., den ich innerhalb von knapp 10 Wochen erstellt habe. </p><p><strong style=\"\">Was ich während der letzten Monate auf meinem Weg zur Udemy-Trainerin gelernt habe, erhalten Sie nun in komprimierter Form als Online-Kurs.</strong> </p><p>Für Sie heißt das, dass Sie <strong style=\"\">erprobte und bewährte Konzepte</strong> kennenlernen und keine abgehobene Theorie - und natürlich sollen Sie alles an Ihrem eigenen Video-Kurs ausprobieren. </p>", 
    "end_date": null, 
    "title": "Udemy-Kurse erstellen und vermarkten: exzellent + effizient", 
    "price": "25.00", 
    "instructors": "Anne Katrin Matyssek", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493192_c4b9_6.jpg", 
    "course_url": "https://www.udemy.com/udemy-kurse-erstellen-und-vermarkten-exzellent-effizient/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T11:02:06Z"
}