{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong>Are you excited and nervous about creating your first Udemy course?</strong> Are you dreading having to record yourself on camera? <strong class=\"redactor-inline-converted\">If so, you're in the right place!</strong></p>\n\n<p>This course is designed to teach you exactly what you need to know to <strong class=\"redactor-inline-converted\">create a Udemy course from scratch without ever having to appear on video</strong> yourself. The secret is to record Camtasia screencast videos instead of recording your own talking head. </p>\n\n<p>I have used this strategy in several of my own successful Udemy courses. And while I must admit that many students do enjoy seeing the instructor's face on the screen from time to time, <strong class=\"redactor-inline-converted\">appearing on screen just isn't necessary to create a successful Udemy course</strong>. </p>\n\n<p>If you need convincing of this, just look at some of the most successful courses on Udemy. Many of them are largely screencast courses.</p>\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">I'm going to show you how to create your first Udemy course.</strong> In fact, <strong class=\"redactor-inline-converted\">I guarantee it! </strong>If you aren't 100% satisfied with ANYTHING that you learn or you don't see for certain that <strong class=\"redactor-inline-converted\">you can create your first Udemy course</strong> within 30 days of signing up, <strong class=\"redactor-inline-converted\">I'll give you a FULL REFUND.</strong></em><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Why should you take this course?</strong></p>\n\n<ol><li><strong class=\"redactor-inline-converted\">It's a complete beginner's course.</strong> It will take you through the entire process step by step from a raw course idea to a published Udemy course.</li><li><strong class=\"redactor-inline-converted\">I don't hold anything back.</strong> I share all of my strategies, hacks and secrets. If you've taken my other courses you already know that I am an open book and I sincerely want YOU to succeed!</li><li><strong class=\"redactor-inline-converted\">I have a proven track record</strong>. I've published 11 courses on Udemy with over 8,000 students and 180 reviews, and I consistently earn over <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">$800 a month</em></strong> from my courses. </li></ol>\n\n<p><br>I started out on Udemy trying to create talking head style courses and it was like torture. It requires a lot more equipment, a larger dedicated recording space and a lot more perfection in your deliver to avoid major editing challenges. Worst of all, you have to enjoy sticking your face in a camera, holding still, and saying your lines eloquently with very few mistakes. </p>\n\n<p>I could go on, but I think you know exactly what I'm talking about.  To eliminate all of that misery,I began recording more screencast videos and using them as lectures.</p>\n\n<p><strong class=\"redactor-inline-converted\">Here is what I discovered:</strong></p>\n\n<ol><li>My students were still very engaged in my courses</li><li>I was getting lots of 5 star reviews </li><li>I was making lots of money from my courses</li><li>I was enjoying the process of teaching SO much more!</li></ol>\n\n<p><em class=\"redactor-inline-converted\">The bottom line is that creating screencast lectures is just as effective, it's much easier to record and to edit, and <strong class=\"redactor-inline-converted\">it's WAY more fun! </strong></em></p>\n\n<p><strong class=\"redactor-inline-converted\">Who is this course for?</strong><br></p>\n\n<p>This course is designed for anyone who is brand new to Udemy and wants to create their first course on Udemy in a fun and easy way that won't break the bank and doesn't require you to record yourself on camera.</p>\n\n<p>This course is also designed for instructors who have already created a course and want to find an easier way to record and edit their next course for increased success.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">What's included in the course?</strong></p>\n\n<ol><li>How to set up a simple, portable, professional recording area that fits on a desk or even a kitchen table.</li><li>Personal recommendations for the best value on a microphone that will make recording and editing a joy.</li><li>Complete walk-through of the Camtasia Studio software.</li><li>Quick guides to the Camtasia features that you will use the most</li><li>Mini tutorials on individual Camtasia features to make your recording and editing easier.</li><li>A 16 step action plan to take your course from raw idea to published Udemy course.</li><li>How to prepare the audio portion of your lectures using outlines, scripts, rehearsing or free-form lectures.</li><li>How to upload your lectures and create your complete course on the Udemy platform.</li></ol>\n\n<p>Thanks for taking the time to check out my course. I can't wait to help you <strong class=\"redactor-inline-converted\">get your first Udemy course published</strong>. If you have any questions about the course feel free to message me here or check out the FREE preview lectures to learn more. </p>\n\n<p>And if you're ready to get started now, <strong class=\"redactor-inline-converted\">click on the \"Take This Course\" button</strong> and I'll see you inside!</p>\n\n<p><em class=\"redactor-inline-converted\">Remember, I'm confident that<strong class=\"redactor-inline-converted\"> I can help you create your first Udemy course.</strong> In fact, <strong class=\"redactor-inline-converted\">I guarantee it! </strong>If you aren't 100% satisfied with ANYTHING that you learn or you don't see for certain that <strong class=\"redactor-inline-converted\">you can create your first Udemy course</strong> within 30 days of signing up, <strong class=\"redactor-inline-converted\">I'll give you a FULL REFUND.</strong></em><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Udemy Course Creation - Teaching Online Courses - Unofficial", 
    "price": "20.00", 
    "instructors": "Steve McDonald", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557586_8da4_3.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-creation-design-camtasia-techsmith-screencasts/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T23:03:41Z"
}