{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong>**JOIN 4,000+ SUCCESSFUL STUDENTS!**</strong><strong></strong></p><hr>   <strong> 6 Legitimate Udemy Strategies Guaranteed to Explode Your Udemy Revenues.</strong>  <hr>  <p>  \t   Is your Udemy course not performing as well as you hoped?.  </p>  <p>  \t  Do you want to 2x (or more!) your sales every day?...  </p>  <p>  \t  Are you interested in knowing the techniques I used to earn $321.81 in 1 day on my Udemy Course?  </p>  <p>  \t                       Do you want to do this quickly and without hassle?...  </p>  <p>  \t <strong>That is awesome because - I have good news for you!...</strong>Join our awesome community of Udemy Course owners and you too can gain twice the amount of paying students by applying the 6 proven technique outlined further down the page.  </p>  <hr>  <strong>IN THIS COURSE I AM GOING TO REVEAL HOW TO:</strong>  <ul>  \t<li><strong>Rank <u>FIRST</u> on the Udemy Search!</strong></li>  \t<li><strong>Rank <u>FIRST</u> on the Categories page!</strong></li>  \t<li><strong>Have other people selling your course for you!</strong> </li>  \t<li><strong>Understand and optimize your page for the buyers mindset</strong></li>  \t<li><strong>Stand out from the competition and be the #1 choice in your niche!</strong></li>  </ul>  <hr>  <p>  \t                     Does spending 2 hours of your time today in order to create a passive income of over $10,000 a year sound appealing to you??  </p>  <p>  \t                    I wanted to share the secrets, and simple strategies that I learned in order to save you the countless amount of hours, effort and mistakes that I repetitively made. So I have compiled them this unique step-by-step guide so that you can see the same results with your Udemy course too!  </p>  <hr>   <em>\"Knowledge is power only if a man knows what facts not to bother with\"</em> - Robert Lynd  <hr>  <p>  \t                               The Video course is unique. It is a very direct and clear presentation that most efficiently gets the knowledge from my brain to yours. I is broken into easy to learn modules that both explain the theory behind the techniques, and show LIVE demonstrations of my testing and experiments!  </p>  <p>  \t                                                  If you have, or are planning on creating a Udemy course, I <strong>GUARANTEE you that this investment will be the best you will ever make! It will pay you back almost every single day for the entirety of your courses life!!</strong>  </p>  <p>  \t                   I will also personally respond to all questions and queries (and even provide my personal email address!) so that you can implement these simple strategies in a fool-proof way.  </p>  <p>  \t                      I know the power of having these Udemy strategies, and I can't wait to help you get there!  </p>  <p>  \t <strong>                                   See you on the inside :)<br>  \t                                                  - Benji</strong><br>  \t <br>  \t <strong>PS:</strong> This decision is a no brainer. I have the best refund policy in the world!!<br>  \t                     If you do not double your Udemy sales - I will refund all of your money!! There is nothing to lose and everything to gain! Make this investment in the future of your course today...  </p>", 
    "end_date": null, 
    "title": "Udemy Marketing Strategies: Increase Enrollment - Unofficial", 
    "price": "20.00", 
    "instructors": "BenJamin Wilson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224800_0edf_23.jpg", 
    "course_url": "https://www.udemy.com/unofficial-udemy-marketing-strategies-increase-enrollment/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-21T06:22:44Z"
}