{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><em></em><strong class=\"redactor-inline-converted\"><em>Udemy Course Marketing - Optimize Your Udemy Course For More Sales</em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><em>Review:</em></strong><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>\"I found Dave Espino's course on Udemy Landing Page Optimization to be filled with good advice. I will now go and optimize each of my course landing pages using the hints, tips and great advice he gives in this course. I highly recommend you take it so you can easily optimize your own Udemy course landing page. Thank you!\"  </em>-- Teresa Greenway</strong><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are your Udemy course sales slow?</strong><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are you wondering if there's anything you could do to dramatically increase your Udemy sales?</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Do you wish a seasoned pro in the world of copywriting and online marketing would take you by the hand and show you the way to grow your Udemy course sales?</strong></p>\n\n\n\n<p>Well then, you're in the right place at the right time because this course will walk you, step-by-step to optimizing your Udemy course landing page and maximizing your sales!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In fact, by the time you complete the 2nd lecture, I believe you will know more about optimizing a Udemy course landing page and dramatically increasing your sales than 97% of the Udemy instructors who have courses on Udemy!</strong></p>\n\n\n\n<p>That's because I have been doing real-world Udemy course landing page critiques for months and have not seen anyone who is using these strategies to optimize their Udemy course landing page!</p>\n\n\n\n<p>These are proven strategies for:</p>\n\n\n\n<ul><li>Optimizing your Udemy course title for maximum Udemy search traffic.</li><li>Optimizing your Udemy course sub-title to grab the reader's attention and draw them in. (as well as for Udemy SEO benefit)</li><li>Optimizing the number of ratings for your Udemy course.</li><li>Optimizing the number of students for your Udemy course.</li><li>Optimizing your Promo video for maximum connection, conversion and sales.</li><li>Optimizing your Course description for maximum sales and conversions.</li><li>Optimizing your Instructor Bio for maximum sales and conversions</li><li>Optimizing the flow of your entire page by using the AIDA formula so that it hits all the hot buttons and almost forces your students to enroll!</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">--------------------------------------------------------------</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Student Review:</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>\"I love the presentation of this course! Dave walks you through several examples of existing landing pages with a step-by-step analysis of each. His recommendations are insightful and well explained, supported by powerful reasoning based on his own experience. I find this practical approach much more informative that generalized theory-type instruction.</em><em>\"</em></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">- Jessica Barst</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">--------------------------------------------------------------</strong></p>\n\n\n\n<p>When you implement the strategies you'll discover inside this powerful course, you will have the quite confidence in knowing that you've done everything possible to maximize every square inch of your Udemy course landing page!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">When you implement these proven strategies, your course will:</strong></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Attract a LOT more prospective students...<br></strong></li><li><strong class=\"redactor-inline-converted\">Show those prospective students the clearly defined benefits of taking your course...<br></strong></li><li><strong class=\"redactor-inline-converted\">Give those prospective students plenty of legitimate, solid reasons and compelling arguments for taking your course.<br></strong></li><li><strong class=\"redactor-inline-converted\">Enroll a lot more students because of this.<br></strong></li><li><strong class=\"redactor-inline-converted\">Generate tons more sales than you would otherwise.<br></strong></li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>Here's the bottom line...<br></p>\n\n\n\n<p>You need this course because Udemy is quickly becoming a competitive playing field and you need every advantage you can get.</p>\n\n\n\n<p>You also need this course because the Udemy opportunity is drawing in more and more instructors who <strong class=\"redactor-inline-converted\">do</strong> know some of these strategies, so the sooner you implement these, the better for you.</p>\n\n\n\n<p>And, lastly, you need this course so that you can help a lot more people with <em>your course, your message and your life-changing content!</em></p>\n\n\n\n<p>Enroll today, and you benefit from Udemy's no-questions-asked, 30-day, money-back guarantee.</p>\n\n\n\n<p>You have tons more students to gain and nothing to lose, so enroll today!</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Udemy Marketing - Write Persuasive Course Pages - Unofficial", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665292_5deb_3.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-marketing-optimize-udemy-course-page/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T23:34:02Z"
}