{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This Course is not sponsored by or affiliated with Udemy, Inc.</p><p>___________________________________________________<br><strong></strong></p><p><strong>Udemy Success 1:</strong>  Earn over 2K Revenue in 10 Days during Udemy Black Friday Sales.</p>\n\n<p><strong>Rosa</strong><strong>'s Online School\n-  Teaching 8 Courses on Kindle &amp; Udemy Successes!</strong><br></p>\n\n<p><strong>                                     Teaching 32 Courses on Music &amp; Piano Courses</strong></p>\n\n<p><strong>OVER 15,000 </strong>Successful students\nhave already taken my online courses since July 2014 with <strong>382</strong><strong> - 5 Star Reviews</strong></p>\n\n<p><strong>Course Updated: </strong>November 15, 2015</p>\n\n<p><em>Added New Section - Udemy Black Friday Challenge 2015</em><br></p>\n\n<p><strong>__________________________________________________________</strong></p>\n\n<p><strong>Review by Kimberly Sheridan</strong></p>\n\n<p><strong>Well-Done &amp; Highly Recommended</strong></p>\n\n<p><em>Rosa is a very likable instructor and always teaches at an easy-to-follow pace (I also took her Udemy Kindle course). She covers a great deal of information in the course itself, but she's also always active with answering questions in the discussion area to cover any clarification I need to make the most of what I'm learning. In this course, she shows behind-the-scenes, real-world examples of her multiple courses &amp; her earnings, so that you can get a real understanding of the Udemy earnings potential … even if you don't yet have your own course launched. And I think it's spot-on that she has launched this course in the summer with enough time for even brand-new instructors to *maximize* their earnings in the Black Friday sale in November. Well done and highly recommended.</em></p>\n\n<p><strong>_______________________________________________________________</strong></p>\n\n<p><strong>Udemy Success 1: Spike Over 2K Revenue in 10 days during the Black Friday Sales</strong></p>\n\n<p>Every year in November, <strong>Udemy </strong>runs a 10 Day Campaign Race to the Black Friday Sales. It is 'Big Time' for Udemy, Udemy instructors and Udemy students.</p>\n\n<p><strong>This Big opportunity</strong> is open right in front of all Udemy instructors. Even if you are new, you won't be left behind if you take action TODAY! The sad truth is that many seasoned Udemy instructors don't even make money with this wide open door opportunity.  They only have themselves to blame for NOT taking the right action to get BIG results!  This goes for existing and future Udemy instructors!</p>\n\n<p><strong>The Time is NOW!  </strong>Anyone can make money on Udemy if they leverage the massive influx of sales during the Black Friday. Black Friday is a frenzy.  Many instructors WILL make lots of money. It is there for you to take should you reach out and grab it! The good news is that anyone can.  </p>\n\n<p><strong>During Black Friday sales,</strong> many hungry buyers are waiting at your doorstep to buy your courses! Just Awesome. In this course, you will watch the amazing scenes behind my Udemy Revenue dashboard.  Not only that,  there are serial buyers there buying ALL of my courses at 'one go'! The sales dashboard keep jumping every minute. The results are there for you to see!</p>\n\n<p><strong>Many of these buyers will buy, but the question is: </strong>\"How do you make sure they buy YOUR courses and not your COMPETITORS?</p>\n\n<p>Many instructors don't make money, PERIOD. It is the truth.  There are so many bad courses on Udemy and even more clueless instructors. How do you go from 'clue-less to clued-in?  <br></p>\n\n<p><strong>The Good News </strong>is that you can make some changes right away TODAY if you take the right action.</p>\n\n<p>Even if you are a new instructor, you will see BIG result in a very <strong>SHORT time</strong>, especially during the 10 Day Black Friday Sales.  There is no up front cost to put a course at Udemy. </p>\n\n<p>My Revenue Earning hit over 2K in <strong>10 days</strong>.  2K may not be a great success but it is an achievement that fired off to subsequent Udemy successes.<br></p>\n\n<p><strong>Here's the Big Secret: </strong>One course hit to the Top Page and have now stayed on as #1 Top PAID in my category ever since November. Once you hit the sweet spot in the Top Paid, sales flow in 'automatically' every month effortlessly from then on.  So it is NOT just good for Black Friday but for your continual success in Udemy.</p>\n\n<p><strong>The experience of the Udemy Black Friday Sales</strong> turned many of us beginners to become seasoned successful Udemy Instructors as we quickly learned the ropes of becoming better instructors in course creation &amp; promotion.  You don't have to stay as a beginner for months or for years. I only started in July 2014 with $0 earning in August 2014. But came November 2014, I hit over 2K in 10 days alone.<br></p>\n\n<p><strong>This Udemy course is in response to students request.</strong> I thank you that you put so much faith and trust in me.  There is enough time for you to make some breakthrough! I hit over 2K in 10 days, and I am going to show you EXACTLY what I did so that you too can sell a ton of courses this Black Friday! <br></p>\n\n<p><strong>If you are having a difficult time with your Revenue earning in Udemy</strong>, you must TAP into the POWER of the Black Friday Sales to get that BIG BOOST to your online teaching career in Udemy.  Remember, during Black Friday, people are conditioned to spend money. Many instructors do not enjoy discounting their courses but the math is simple.  Would you rather sell 1 course for $129 or sell hundreds for $10,  hundreds for $11, hundreds for $12, etc!  <strong>The answer is simple</strong> when it comes to putting food on the table, a shelter on the head, and providing for the family. The choice becomes very clear. It is much more preferable to sell hundreds or thousands of courses at $10 rather than a few for high cost.</p>\n\n<p>On top of that, you gain <strong>MORE</strong> students who are now ready to buy your next course?  Get the idea? </p>\n\n<p>On the first day of Black Friday says, I had <strong>101 new</strong> students buying my courses for $10. I made $500 overnight while sleeping.</p>\n\n<p><strong>Know that Udemy is there to help you</strong>. You also need to know how to become successful yourself during the Black Friday Sales. The result is even more rewarding as you watch your courses climbing high into the No. 1 Spot Top Paid in the subsequent months. You also end up doing new launches ending into the New &amp; Noteworthy Section all the time without fail. Your courses get lots of exposure and FINALLY, you are able to enrich the lives of many people with lots of value and passion.<br></p>\n\n<p><strong>Learn from my experience!</strong> </p>\n\n<p><strong>Nothing happens haphazardly!</strong></p>\n\n<p>To win in the Race - You must<strong> </strong><strong>PREPARE WELL!</strong></p>\n\n<p><strong>Preparing Well</strong> is the Key.  Don't wait until October. Start Today!</p>\n\n<p><strong>***********************************************************************</strong></p>\n\n<p><strong>In this Udemy Black Friday Sales course you will get:</strong></p>\n\n<p><strong>7 Key Udemy Strategies</strong></p>\n\n<ul><li>course creation</li><li>not just multiple courses but how to brand them</li><li>get lots of students engagement</li><li>get Udemy's attention with your one BIG course</li><li>how to make more sales</li><li>get your buyers to buy ALL of your courses</li><li>turn buyers into followers</li></ul>\n\n<p><strong></strong><strong>31 Udemy Levers</strong> to pull on over &amp; over and crank up your Success</p>\n\n<p> <strong>2 FUN Activities </strong>to succeed in the Udemy Black Friday Sales</p>\n\n<p><strong>I wish you all success</strong> as we prepare and run the Udemy Black Friday Sales Race together.  Come on in and enroll into the course and we are going to have a lot of fun together,</p>\n\n<p>Rosa</p>\n\n<p>_________________________________________________________________<br></p>\n\n<p><strong>What other students are saying . . .</strong></p>\n\n<p><strong>Fabulous Course - By Denise Fletcher</strong></p>\n\n<p><em>This course is a great aid to understanding The Black Friday Sale. Rosa is a great instructor...very personable and very engaging. You can tell she loves teaching. Production wise Rosa smoothly navigates the Udemy platform showing amazing real examples. I enjoyed it so much I couldn't stop watching. I learnt so much. Thank you Rosa.</em></p>\n\n<p><strong>Excellent and fresh thinking by experienced instructor - By Paul Jenkins</strong><br></p>\n\n<p><em>As a fellow instructor, I really appreciate Rose's course. In fact, I was discussing its content and approach today with another instructor-friend, which ought to tell you something: Rose's course is one that provokes ideas and strategy, and that is valuable. Without giving the game away, there are at least a handful of really key strategies inside this course that I will be implementing myself. Well worth the journey.</em></p>\n\n<p><strong>Great Course! - By Jeremy Deighan</strong><br></p>\n\n<p><em>I am new Udemy instructor and found a LOT of valuable information in this course! I kind of already knew about the importance of the Black Friday sales, but Rose has really opened my eyes to a lot of great information that I can use to drive more sales to my courses. I am really pumped now and want to have a bunch of courses ready for launch in November. Definitely recommend this course!</em></p>\n\n<p><strong>Golden nuggets - By Anneke Camstra</strong><br></p><p><em>This course sets me on the road for the famous Black Friday sales. My golden nuggets from this course are: how much difference the Black Friday sales can make to your Udemy income. How to get students active with a fun task. And combine that with a launch strategy, and a contest. And finally: I have now committed to make three more courses in time for The Big Sales. So reader: come on in the course and join me. Thanks Rose.</em></p>\n\n<p><strong>Great tips! - By Karen Crowell </strong></p>\n\n<p><strong></strong><em>This course is great for those who want to take their courses to the next level and gear up for more sales in November. The instructor gives easy to follow tips and examples that will make a difference between ending the year with average sales or your top sales for the year! Don't wait til November to gear up for Black Friday because it will take some time to implement all the ideas presented in this course.</em></p>\n\n<p><strong>Really Useful Course - By Waller Jamison</strong></p>\n\n<p><em>I found this course very helpful - Rosa explains how Udemy promotions work and gives a clear strategy to help instructors take advantage of the Black Friday Sales. And she provides a great plan to help you take action. Excellent tips which will help with promotions all year round and with preparing courses well.</em></p>\n\n<p><em>___________________________________________________________________</em></p>\n\n<p><strong>Udemy Black Friday Sales Course Syllabus:</strong></p>\n\n<p><strong>A. Udemy's Campaign: The Race of the Black Friday Sales in November 2014</strong></p>\n\n<p>1. Udemy sends ads to targeted students for 10 days</p>\n\n<p>2. Breakdown of my 2K Revenue in November, 2014</p>\n\n<p>3. Think Outside the Box - 3 Smart Tips to Read Sales Revenue</p>\n\n<p>4. Hungry Buyers crashing in through the door from Day 1</p>\n\n<p>5. One BIG UNIQUE Course - More than 1 K</p>\n\n<p><strong>B. Key Strategy 1: Get Big Unique Course Featured by Udemy</strong></p>\n\n<p>1. Udemy Lever Tips to TAP into the POWER of Black Friday Sales</p>\n\n<p>2. Udemy Lever Tip 1: Get Featured on TOP Page - Lots of Sales</p>\n\n<p>3. Udemy Lever Tip 2: Become #1 TOP Paid in your category</p>\n\n<p>4. Udemy Lever Tip 3: Get into the New &amp; Noteworthy Section with the New Course</p>\n\n<p>5. Udemy Lever Tip 4: Requirements to New &amp; Noteworthy</p>\n\n<p>6. Udemy Lever Tip 5: Get Featured to Top 200 in Android App </p>\n\n<p><strong>C. Key Strategy 2: Udemy Course Creation Tips - 3 Musts</strong></p>\n\n<p>1. Udemy Lever Tip 7: Must grow your brand smartly</p>\n\n<p>2. Udemy Lever Tip 8: Habit of Impulse Buyers</p>\n\n<p>3. Udemy Lever Tip 9: Must Plan 'Progressive\" Courses</p>\n\n<p>4. Udemy Lever Tip 10: Must create ONE BIG Course - Outstanding &amp; Shine</p>\n\n<p>5. Fun Activity #1 - 4 Month Planning</p>\n\n<p>6. Get a Reward and Win a Prize</p>\n\n<p><strong>D. Key Strategy 3: BIG Course Strategy - Get Lots of Students Engagement</strong></p>\n\n<p>1. Udemy Lever Tip 11: Create a Fun project / Fun Hands on Task</p>\n\n<p>2. Udemy Lever Tip 12: Learn this Secret Tip: Get students involved EVEN Before Enrollment</p>\n\n<p>3. Udemy Lever Tip 13: Create a Big Buzz - Get them to the discussion board</p>\n\n<p>4. Udemy Lever Tip 14: Learn how to get Students Engage More and More</p>\n\n<p>5. Udemy Lever Tip 15: Power House to get students engagement</p>\n\n<p>6. Udemy Lever Tip 16: Must Do - To Rank high in Udemy</p>\n\n<p><strong>E. Key Strategy 4: BIG Unique Course - Plan 3 Launches To Rank High Immediately</strong></p>\n\n<p>1. Udemy Lever Tip 17: Pre-Launch - Create a Big Buzz </p>\n\n<p>2. Udemy Lever Tip 18: Early Bird Sales - Be Generous</p>\n\n<p>3. Udemy Lever Tip 19: Launching Sales </p>\n\n<p><strong>F. Key Strategy 5: Must Plan Ahead Now &amp; Start Scheduling</strong></p>\n\n<p>1. Fun Activitiy #2: Schedule the 3 Launches in November</p>\n\n<p>2. Get a Reward &amp; Win a Prize</p>\n\n<p>3. Get to Work - Print the November 2015 Calendar</p>\n\n<p><strong>G: Key Strategy 6: Udemy Marketing Tips - What kind of prices are people willing to buy?</strong></p>\n\n<p>1. Udemy Lever Tip 20: Big course can charge up to $249</p>\n\n<p>2. Udemy Lever Tip 21: Big discounts from $249</p>\n\n<p>3. Udemy Lever Tip 22: Sweet Spot Pricing for Big Course</p>\n\n<p>4. Udemy Lever Tip 23: Pricing Strategies for smaller courses</p>\n\n<p>5. Udemy Lever Tip 24: Do this the day BEFORE Black Friday Sales</p>\n\n<p>6. Udemy Lever Tip 25: Price Testing Continues</p>\n\n<p><strong>H. Key Strategy 7: Udemy Promotion Tips</strong></p>\n\n<p>1. Udemy Lever Tip 26: Pie chart reveals the power of Udemy Marketing Programs</p>\n\n<p>2. Udemy Lever Tip 27: Four Udemy Marketing Programs</p>\n\n<p>3. Udemy Lever Tip 28: My own promotion in November, 2014</p>\n\n<p>4. Udemy Lever Tip 29: Know where to put your Energy</p>\n\n<p><strong>I: Bonus Section: Check Your Udemy Profile Set-Up</strong></p>\n\n<p>1. Udemy Lever Tip 30: For Udemy Beginners - Premium Instructor</p>\n\n<p>2. Udemy Lever Tip 31: Set to PAID</p>\n\n<p>3. Udemy Lever Tip 32:  Apply for the Udemy Black Friday Sales Campaign</p>\n\n<p>4. Udemy Lever Tip 33:  Learn from other successful Udemy Instructors in the Studio</p>\n\n<p><strong>J:  Black Friday Sales 2015 Challenge</strong></p>\n\n<p><br></p>\n\n<p>***************************************************************************</p>\n\n<p><strong>About Rosa's Online School:</strong></p>\n\n<p>    <em></em></p>\n\n<ul><li><em>Over <strong>15</strong></em><strong><em>,000</em></strong><em> </em><em>very happy students already in my Udemy classes</em></li><li><em>See the </em><strong><em>5 Star Reviews</em></strong><em> from VERY satisfied students</em></li><li><em>You get free lifetime access</em></li><li><em>All videos are at your finger tips to watch anytime &amp; anywhere</em></li><li><em>All future extra lectures and upgrades are </em><strong><em>always free</em></strong></li><li><em>Unconditional Udemy </em><strong><em>30 day money-back guarantee</em></strong><em> and that's my personal promise to your success!</em></li><li><em>Join this happy family of students </em></li><li><strong><em>Enroll into this course</em></strong></li></ul>", 
    "end_date": null, 
    "title": "Udemy #1: Udemy Secrets in BF 2K Spike - Unofficial", 
    "price": "20.00", 
    "instructors": "Rose Suen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562720_6411_5.jpg", 
    "course_url": "https://www.udemy.com/unofficial-udemy-number1-udemy-secrets-in-bf-2k-spike/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T15:25:27Z"
}