{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>♚ Over 12300 satisfied students enrolled in our courses</p>\n\n<p>♚ Featured as the Nr #1 of Udemy's Top Trending Courses in Marketing </p>\n\n\n\n<p>♚ Over 185 5 Stars Reviews from very happy students</p>\n\n\n\n<p><strong>________________________________________________________________________</strong><strong> </strong><strong>♚ Would you like to rank your Udemy course #1 on Google?</strong></p>\n\n\n\n<p><strong>♚ How amazing would it be to have access to millions of students who can buy your course because you are in the top rankings on Google?</strong></p>\n\n\n\n<p><strong>♚ Would you like to have a step by step blueprint to show you exactly how to do it?</strong></p>\n\n\n\n<p><strong>________________________________________________________________________</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n<p><strong></strong></p>\n\n\n\n<p><strong>_________________________________________________________</strong>_______________</p>\n\n\n\n<p>Gain instant access to 22 training videos that will teach you step-by-step how to rank your Udemy course #1 on Google FOR FREE and have access to millions of new customers. The strategies are safe and up-to-date in 2015 to give you maximum results.</p>\n\n\n\n<p>Most instructors on Udemy are losing money because they rely on Udemy only. They could be using simple but effective techniques to rank their course #1 on Google for their keyword.. and it would give them access to millions of students…for FREE. In this course, we will show you exactly how to do that. It is packed with solid strategies and the best techniques to give you the best results in the least amount of time.</p>\n\n\n\n<p>Everyone can apply &amp; use these strategies even if you don't have any SEO skills! Everything is explained and it is really easy to put into practice!</p>\n\n\n\n<p>________________________________________________________________________ </p>\n\n\n\n<p><strong>WHAT YOU'LL LEARN</strong></p>\n\n\n\n<p><strong>In this course you'll learn many new skills including how to:</strong></p>\n\n\n\n<p>♚ Why you should care about the Top Google rankings for your Udemy coruse</p>\n\n\n\n<p>♚ How to select the best keywords for your course that will drive massive FREE traffic from GOOGLE. </p>\n\n\n\n<p>♚ The perfect ranking URL for your course </p>\n\n\n\n<p>♚ How to create a SEO friendly and high converting course title</p>\n\n\n\n<p>♚ How to SEO Optimize your course subtitle to drive many hungry customers from Google</p>\n\n\n\n<p>♚ How to write an amazing SEO sales copy for your course that Google will love </p>\n\n\n\n<p>♚ How to use the right titles in your Sections and Lectures </p>\n\n\n\n<p>♚ Everything you need to know about link building for your Udemy course</p>\n\n\n\n<p>♚ How to find out who your competitors are on Google and spy on them</p>\n\n\n\n<p>♚ How to track your rankings and conversions for more success! </p>\n\n\n\n<p>________________________________________________________________________ </p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>*You have nothing to lose and everything to gain. Try this course and if you can honestly say that you learnt nothing, just email Udemy and they will give you a 100% refund within 30 days.</strong><strong> </strong>________________________________________________________________________ </p>\n\n\n\n<p><strong>*If you don't act, you will never tap into millions of students that are willing to buy your course from Google. This course has not only the best SEO OnPage strategies for your Udemy course but once you will use the OnPage strategies in this course, it will skyrocket your Udemy course sales…FROM FREE GOOGLE TRAFFIC!*</strong></p>", 
    "end_date": null, 
    "title": "Udemy Marketing: How to Access New Students - Unofficial", 
    "price": "20.00", 
    "instructors": "Alain W., Harald Tschuggnall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431926_e69b_9.jpg", 
    "course_url": "https://www.udemy.com/unofficial-udemy-marketing-how-to-access-new-students/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T11:44:50Z"
}