{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>This course is not sponsored by or affiliated with Udemy, Inc.</em><br></p>\n\n<p><strong>Udemy Business Plan</strong></p>\n\n<p><strong>Udemy Business Success</strong></p>\n\n<p>Do you want to learn how to build a business selling online training courses on Udemy?</p>\n\n<p>Do you want to develope online residual income?</p>\n\n<p>That brings in money whilst you are with family, with friends, whilst you are sleeping, do you have expertise that others would pay you to share?</p>\n\n<p><strong>Udemy Earning Potential</strong></p>\n\n<p>The earning potential on Udemy can be astronomical.</p>\n\n<p>Of course, not everyone can reach those heights, but creating a full or part time residual income is a reality for many Udemy instructors.</p>\n\n<p><strong>Not Everyone On Udemy Succeeds</strong></p>\n\n<p>Yet some instructors seem to really struggle with making any money on Udemy and creating Udemy courses that sell and often give up after a short burst of effort.</p>\n\n<p>Why is this?</p>\n\n<p>Why do some succeed and some fail?</p>\n\n<p>A lot of the time it is because they lack an online residual income business development strategy...</p>\n\n<p>Or they do not understand how the Udemy business model works!</p>\n\n<p><strong>Learn How To Build A Successful Udemy Business</strong></p>\n\n<p>In this course, you will learn how to build a solid business strategy for selling Udemy courses.</p>\n\n<p>You will also learn how to plan and structure your business strategically and how to achieve long term success by using sound business building and marketing principles.</p>\n\n<p>We will teach you how to optimise the Udemy internal marketing funnel as well as help you understand how to set up an external marketing funnel for your Udemy business!</p>\n\n<p><strong>Udemy's 30 Day Money Back Guarantee</strong></p>\n\n<p>This course comes with the Udemy 30 day money back guarantee, so if you are not happy with the course for any reason whatsoever, you can get your money back, no questions asked.<br></p>\n\n<p><strong>Start Your Udemy Adventure Today</strong></p>\n\n<p>Join me on the other side and learn how to build your own successful Udemy business and create residual income that frees you to do the things in life that you want to do!</p>", 
    "end_date": null, 
    "title": "Udemy Strategy - Build A Business On Udemy - Unofficial", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618128_8142.jpg", 
    "course_url": "https://www.udemy.com/unofficial-build-a-udemy-course-creation-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T13:48:18Z"
}