{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is about use free charts ( Keepa and CamelCamelCamel) to make better sourcing decisions for Amazon FBA sellers. </p><p>You should be an Amazon 3rd party seller of plan on being an Amazon 3rd party seller to make use of the information that is taught in this course.</p><p>This course consists of over 2 hours of video lessons. </p><p>In this course you will learn about sales rank and why it isn't as important as many people think. </p><p>We look at different ways to check sales rank among different free tools and how accurate the tools are.  We also look at ways to come up with a usable sales rank when a product sales rank bounces around a lot.</p><p>Next you will learn about the different features that both charts offer. There are lot of features that many people over look or don't understand how to use.</p><p>After covering the basics of how to read the charts and the plus and minus of each one, we move into case example on using charts in the real world and the thought process that I use when sourcing. </p><p>In the first example we show an example of how a very basic check of the charts would help to avoid a product sourcing error. </p><p>The next example show that sales rank is related to price and how high sales ranks are not always a bad thing.</p><p>The next example we look at is sourcing product out of season and how the charts can help us predict what the sales will be like when the product comes back into season.</p><p>The last example shows how to forecast sales of products that we might be sourcing wholesale or making large out of season purchases.  It shows also how to use the charts of similar products when you are bringing new products to market. </p><p>Then the last thing we show is how to make it easier to access the charts when you are on a low budget and not using paid scanning apps. </p><p>This course show how to use charts for sourcing but more  importantly, it shows how to think like a full time FBA reseller like myself thinks and sources.</p><p><br></p>", 
    "end_date": null, 
    "title": "Using & Interpreting CamelCamelCamel & Keepa Charts For FBA", 
    "price": "25.00", 
    "instructors": "Full Time FBA Seller Jason Wilkey", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/876252_efc0.jpg", 
    "course_url": "https://www.udemy.com/using-and-interpreting-charts-keepa-and-camelcamelcamel-f/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-12T20:32:24Z"
}