{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>&gt;&gt; Special Price ONLY - Increasing to $147 Soon &lt;&lt;</strong></p><p><strong>&gt;&gt; Updated For October 2015 &lt;&lt;</strong></p><p><strong></strong><strong><em>Working your fingers to the bone and not making any measurable progress?</em></strong></p>  <p>  \t<strong><em>Losing out on time with your family and time to pursue your life's passions?</em></strong>  </p>  <p>  \t<strong>Guess what? Once upon I time,<em> I was just like you....</em></strong>  </p>  <p>I was stressed out, tired, and overworked. Everything revolved around me, and <em>I was working myself to death.</em><br></p>  <p>  \t<strong>Then, I discovered something that changed my life:</strong> the power of outsourcing my life using virtual assistants. I slowly incorporated these virtual rockstars in my life, and today, I have VA's working for me literally on every continent in the world.  </p><p><strong>Guarantee: </strong>By the end of this course you will learn how to find, interview, hire, and start working with your first Virtual Assistant. And, if you're currently using VA's, you'll find at least one golden tip that will help you work more effectively and efficiently with your VA's.</p><p><strong>Why take this course?</strong></p><p style=\"\">Arguably one of the best courses on Udemy. I really didn't know what I'd be in for when I first signed up for this however, it suffices to say that I was blown away...Faith in Udemy restored.<span> -- <em>Ismaila Neill</em><span></span><br></span></p><p><span><span>Join the <em>hundreds</em> of students who have learned how to outsource effectively and efficiently from my course!</span></span></p>  <p>  \t<strong>This course is the <em>best virtual assistance course</em> on Udemy and in this course I'll teach you:</strong>  </p>  <ul>  \t<li>Where to find a virtual assistant, including my personal recommendations on top outsourcing websites</li>  \t<li>How to effectively screen VA candidates to ensure that you have only the most talented VA's to choose from </li>  \t<li>The insider tips and tricks you need to know BEFORE you start interviewing your virtual assistant candidates</li>  \t<li>The best methods to work with your new virtual assistant, including strategies from my own personal VA rockstar, Angeline!</li>  \t<li>My personal list of the tools I use on a daily basis to coordinate work with my virtual assistants from around the world.</li>  </ul><p><br></p><p style=\"\">George (the instructor) covers each topic with amazing attention to detail in a lively voice. What impresses me most are the insights he shares based on his own experience - the practical tips that would save me a lot of time from having to figure it out myself. </p><p style=\"\">-- <em>Michael Choke</em><span></span><span></span><br></p>  <p>  \tThis course will take about less than a day to complete and the investment in saving your most valuable asset--time--will be invaluable!  </p><p><strong><br></strong></p><p><strong>The Better Than Money Back Guarantee</strong></p><p>As always there is a 30 day money back guarantee. But I believe that this guarantee is too weak so I propose this for you. If you do not get the results that you are looking for in this course then I will personally give you double your money back out of my own pocket. I am committed to only deliver the very best in my teaching and content and I am confident that your life will never again be the same once you discover your passion.</p>  <p>  \t<strong><em>Stop wasting your precious time on this Earth. Start working smarter by outsourcing your work to virtual assistants. Get this, the best VA course on Udemy, learn what you need to outsource effectively, and START LIBERATING YOUR LIFE TODAY.</em></strong>  </p>", 
    "end_date": null, 
    "title": "Virtual Assistants: The Ultimate Guide To Find & Hire A VA", 
    "price": "20.00", 
    "instructors": "George Smolinski M.D.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/269460_82a0_2.jpg", 
    "course_url": "https://www.udemy.com/virtual-assistant/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-27T10:30:42Z"
}