{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\"><strong style=\"\">Over 2500 students have already enrolled!</strong></em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Updated On: Feb 9, 2015</strong></em>  </p>  <p>  \t<strong style=\"\"><em style=\"\">In six months I have published more than 70 Apple iPhone / iPad apps by following this course.</em></strong>  </p>  <p>  \t                                       This is a course which includes <strong style=\"\">baby step by baby step videos</strong> in which you will learn exactly how to publish apps on the App Store to make passive income.  </p>  <p>  \t                                   Every method that I teach in the course is <strong style=\"\">super easy to implement</strong>, and if you implement my methods you will have an army of apps -  each app creating for you a new passive income stream.  </p>  <p>  \t                                 When I have just started this business it took me months to publish a single app, but now I will show you exactly how you can <strong style=\"\">publish a new app every single day</strong>!  </p>  <p>  \t                                   I will keep updating this course all the time, and once you join the course you will get <strong style=\"\">lifetime updates for 100% free</strong>.  </p>  <p>  \t                                   There is simply zero risk with Udemy 30 day guarantee.  </p>  <p>  \t                                   This course is perfect for people who know nothing about publishing apps, and also to people who have been publishing apps for a long time, but don&#039;t know how to publish a <strong style=\"\">new app every single day</strong>!  </p>  <p>  \t                                   Please notice:  </p>  <p>  \t                                   I am not going to cover basic things like setting up your Apple developer account, paying the Apple Fees, uploading your apps, revising your apps, and all kind of other technical issues which can easily be found by doing a simple search online or by contacting the Apple support team (I will show you how you can hire a person to do this for you).  </p>  <p>  \t                         Now, because I am fully aware that one of the biggest problems that beginners encounter when they try to make money online is &quot;Information Overload&quot; I have kept each video extremely short, so you will not be overwhelmed by information.  </p>  <p>  \t                                   If  you want to know <strong style=\"\">exactly</strong> how I have been able to publish more than 70 iPhone apps (also a few Android Apps, and Amazon Apps) <strong style=\"\">in just 6 months without needing</strong> a Mac, iPhone, Android, and knowledge in programming and design - Enroll Now!  </p>", 
    "end_date": null, 
    "title": "Winning the App Game: Publishing Apps Without Any Coding", 
    "price": "50.00", 
    "instructors": "Amir Rimer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338804_6fcc_2.jpg", 
    "course_url": "https://www.udemy.com/passive-income-online-no-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T20:58:40Z"
}