{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>WordPress for beginners: Finally a simple way to create beautiful $500+ WordPress Websites in a step-by-step way for those with no time, no money and no patience. <br><br>Ideal for local business owners, consultants and coaches, authors, and those who simply want to earn an income online.<br><br>In this picture rich video course  you will discover 10 Easy Ways to Make Money with your new, easily and quickly learnt WordPress skills. </strong></p><p><strong>Unlike other beginner WordPress courses, we cover topics that are key to creating professional-looking websites for others as a service business and charge $500 or more.<br><br>Would you like to see how people just like you earn $37,000 for simple WordPress skills?<br><br>Discover how to set-up everything you need to create awesome WordPress websites for yourself or your clients. This includes all the latest WordPress updates for 2016 – this is not a last year’s outdated course!<br><br>This is not WordPress theory. You can follow along by turning on your computer, put the keyboard on your desk, and in seconds start building your WordPress website today – no coding needed – no technical knowledge!<br><br>Join the thousands of people who are making $1,000+ per month making WordPress websites that you can make from home in your spare time with a $50 Computer.<span><br></span></strong></p><p><strong>Student Reviews:</strong></p><p><strong>Great Course</strong></p><p><strong>This\ncourse certainly deserve appreciation. Easy to understand and complete with\nperfection, which lead me to understand this course within a short period of\ntime. I thanks for such an amazing course and I enjoyed my learning experience.</strong></p><p> <em><strong>by Jebul Rahman</strong></em></p><p><strong>Very well structured and\nDetailed course</strong></p><p><strong>Wow...I\nam blown off with the little minute details this course is structed with. Nick\nis very prompt to mention that the use of this course knowledge can help you\nmake money by taking action and not false promising that you'll make guaranteed\nmoney by showing well-mocked pay reports.</strong></p><p><strong>I\nreally adore the minute details Nick has covered in the course. Especially the\nmenus and the static page for the site and 7 page website.</strong></p><p><strong>I've\nto thank Nick, by following this course I could get my worpress blog online.</strong></p><p><strong>Thanks\nfor the course and the great value you portray in the course. </strong></p><p><em><strong>by Ashok Kumar N Rao</strong></em></p><ul><li><strong>Wordpress Students over 5,000 enrolled on this course from 125 Countries!</strong></li></ul><ul><li> <strong>Full 30 day money back guarantee so no risk to you, if you are not happy with the course just ask within 30 days of buying and you will get your money back!<span></span></strong></li></ul><ul><li><strong>Would you like to see PROOF of how much people earn with Wordpress skills that are very easy to learn and i teach you these skills so you can start earning money tomorrow?<span></span></strong></li></ul><ul><li><strong>Would you like to see how people just like you earn $37,000 for simple Wordpress skills?<span></span></strong></li></ul><ul><li><strong>Would you like to see the exact skills in my videos that people use to do Wordpress jobs and earn $50 for an hours work?</strong></li></ul><ul><li><strong>We're also completely updated to the newest Wordpress 4.4 version as of January 10th, 2016. This means you're working in real-time right now with the most update version and menus you see inside Wordpress. </strong></li></ul><ul><li><strong>And we're the only course that teaches how to use the new updated  2016 Customizr Theme so that you can build professional websites faster, easier, with more features to give you a competitive edge against other web designers.</strong></li></ul><ul><li><strong>Support team ready to answer your questions usually in less than 24 hours.</strong></li></ul><ul><li><strong>Course updated regularly with the latest features and updates in the world of Wordpress Web Design.<span></span></strong></li></ul><ul><li><strong>Thinking of starting your own freelancer web design business? Then this quick course is for you and you can offer web design service straight away for $500 no coding needed.</strong></li></ul><ul><li><strong>WordPress is great if you want to start your own online business, blog, charity website, I include 10+ websites where you can get freelance web design and other Wordpress work after you finish the course.<span></span></strong></li></ul><ul><li><strong>Follow along with me as you  design the website. You watch the videos in one browser window like Chrome and quickly and easily create your own WordPress website in another.<span></span></strong></li></ul><ul><li><strong>You will quickly learn new WordPress skills to build your own beautiful, professional business website in 3 hours..</strong></li></ul>", 
    "end_date": null, 
    "title": "WordPress for Beginners: No Coding", 
    "price": "20.00", 
    "instructors": "Nick Walsh", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594488_67b0_6.jpg", 
    "course_url": "https://www.udemy.com/wordpress-for-beginners-how-to-build-professional-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T23:48:09Z"
}