{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Students From 102 Different Countries Are Enrolled in This Course! </strong></p><p><strong>Description</strong>:<br></p>\n\n<p><em><strong>Learn Step By Step How to Find Work From Home, Online Jobs and Telecommute Positions From Top Businesses in the World such as Amazon, American Express, Apple and More!</strong></em></p>\n\n<p><em><strong>Learn the Secrets of Finding Work From Home Jobs From a Business Expert Who Has Worked From Home for the Past 7 Years!</strong></em></p>\n\n<p><strong>++++++++++++++</strong></p>\n\n<p><strong>Get Out of the Rat Race of the 9-5 Office Life, and Get the Work/ Life Balance You’ve Always Dreamed of Having!</strong></p>\n\n<p><strong>Get the Freedom That You’ve Been Wanting! </strong></p>\n\n<p><em><strong>Enroll Now and Begin Finding Work From Home Jobs Today! Every Minute You Delay is Time You Could Be Finding Your Dream Job Working From Home!</strong></em></p>\n\n<p>In this course I will show you over 20 top companies that offer work from home, online jobs and telecommute positions. I’ll teach you what types of positions these companies often hire for, and show you step by step how to locate these jobs.<br></p>\n\n<p><strong>I’ll Teach You How to Find Work From Home, Online Jobs and Telecommute Positions Ranging From Entry Level Up to Professional.</strong></p>\n\n<p><strong>I’ll Show You How to Find Work From Home Jobs in a Variety of Popular Industries Such As:</strong></p>\n\n<ul><li><strong>IT</strong></li><li><strong>Customer Service</strong></li><li><strong>Education</strong></li><li><strong>Management</strong></li><li><strong>Sales </strong></li><li><strong>Retail</strong></li><li><strong>Healthcare</strong></li><li><strong>Hospitality</strong></li><li><strong>And Much More!</strong></li></ul>\n\n<p><em><strong>*** I’ll Even Show You One of My Favorite Companies That Will Actually Pay You to Test Out Websites!</strong></em></p>\n\n<p>You Can Stop Spending Hours Searching the Internet For Work From Home Jobs. I’ve Done All of the Work For You! I’ve Spent the Past 7 Years Compiling a List of Over 20 Top Companies, and I’ve Featured All of Them in This Course For You!</p>\n\n<p><strong>What You Will Get From This Course:</strong></p>\n\n<ul><li><strong>Over 43 Lectures!</strong></li><li><strong>A Step by Step Guide To Finding Work From Home Jobs for Over 20 Top Businesses!</strong></li><li><strong>A 30 Day Money Back Guarantee- My Personal Guarantee for Your Success!</strong></li><li><strong>A Website Link that Lists Hundreds of Work From Home Jobs!</strong></li></ul>\n\n<p> <strong><em>(</em><em>This site has been featured on ABC News, Good Morning America, USA Today </em></strong><em><strong>and more!)</strong></em></p>\n\n<ul><li><strong>A Coupon Code for 30% Off a Flexjobs Subscription!</strong></li><li><strong>Great Tips to Help You Avoid Work From Home Scams.</strong></li><li><strong>My Help Every Step of the Way! (I work hard to respond to each and every question from my students, as I truly want you to be successful!)</strong></li><li><strong>Plus Additional Businesses Coming Soon!- I’ll Be Adding Additional Businesses For You in the First Few Weeks After the Launch of the Course!)</strong></li></ul>\n\n<p><strong><br>By the End of the Course You Will be Equipped to Find Work From Home and Remote Jobs for Some of the Top Businesses in the World!</strong></p>", 
    "end_date": null, 
    "title": "Work From Home: Find Online Jobs with Apple, Amazon and More", 
    "price": "20.00", 
    "instructors": "Home Based Business Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753706_c8fe_2.jpg", 
    "course_url": "https://www.udemy.com/find-work-from-home-jobs-from-top-companies-like-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T19:25:40Z"
}