{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>YouTube has announced that <strong>\"<em>thousands of YouTube users make over $100,000 every year</em>\"</strong><em> </em>(almost $2,000 dollars a week!).<br></p><p><em>What if you could join those thousands of people earning on YouTube with less than part-time work?</em> </p><p>How about <strong>working just an hour a day from your home?</strong></p><p>In this course I will show you a mind-blowingly simple method that could earn you money month after month by uploading simple-to-make videos that tens of millions of people are actively looking for.</p><p><em>Best of all, you don't need to use a microphone or a camera, or even be creative!</em></p><p>The YouTube niche presented here is <strong>one of the fastest growing niches</strong> out there and it is so new it is <strong>almost untouched</strong>, making dominating search results very easy. Add to this that ever so often a new sub-niche is opening up and <strong>millions of new people are flocking to YouTube for this content every year</strong> and you have hit <strong>jackpot!</strong></p><p>Here is a simple analogy: <em>imagine being able to record and upload the best games from the soccer World cup or Superbowl for tens of millions of content hungry sports fans without any copyright issues. </em></p><p><em>What if I told you something very, very similar is possible? </em></p><p><strong>Simply hit the \"record\" button, wait for the content to end, stop recording, upload to YouTube, repeat several times a day and profit. </strong></p><p><strong>Yes, it's that simple!</strong></p><p>My intention was to lay this out as short and clear as possible and, more importantly, demonstrate it on a real life example so literally anyone can take the idea and knowledge gained and start the same second after finishing the course.</p><p><em>No financial investment is needed, on the contrary, I advise against it!</em></p><p><em>Absolutely no prior experience or knowledge needed with YouTube, recording or anything involved in this method!</em></p><p>With all of that said, <strong>you do need three things:</strong></p><p><strong>- an hour to watch this course (can't make it shorter than this, sorry!)</strong></p><p><strong>- 60 minutes of consistent (but very simple!) work a day</strong></p><p><strong>- access to a good enough computer with a 4 year old or newer nVidia or ATI/AMD dedicated graphics card, or Intel HD Graphics 4000 or better for integrated graphics</strong></p><p>I am determined to help my students succeed - you will be able to ask for guidance and advice and all the future extra lectures are free.</p><p>If you still harbor that bit of a doubt, you are completely covered with the uconditional Udemy 30 day money-back guarantee - there is no way to lose money with this - in the course I actually say several times not to spend any money!</p><p>See you on the other side :-)</p>", 
    "end_date": null, 
    "title": "Work From Home - YouTube Gaming Channel Home Business", 
    "price": "20.00", 
    "instructors": "A lan S ucur", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590236_05ab_4.jpg", 
    "course_url": "https://www.udemy.com/work-from-home-youtube-gaming-channel-home-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-22T10:20:44Z"
}