{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong>FIVE STAR REVIEW</strong></p><p><strong>\"Good Ideas for Working From Home - </strong><strong>I enjoyed this course. It was full of good information, \nit was organized perfectly, and the instruction was clear and enjoyable \nto listen to.\" - Fred Ferguson</strong></p><p>You are about to discover the lucrative opportunity of working from home. Thousands of people all around the world have discovered work at home opportunities. Is it your time?</p><p>Learn how to spot lucrative work at home opportunities and how to recognize work at home scams. Spotting scams will save you thousands of dollars.</p><p>You will find out how economic changes bring incredibly opportunities. Find out how to spot people and businesses most willing to do business with you.</p><p>You will be introduced to freelancing opportunities and how you can find some amazing methods to make sure you get paid!</p><p>You will discover how to focus on your passions and how to find problems that you can solve with your skills (or easily acquired skills)</p><p>There is so much more to learn on how to work from home. Take this course today and learn exactly how to start to work at home successfully.</p>", 
    "end_date": null, 
    "title": "Work From Home - Guide to a Successful Home Based Business", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646320_bac2_2.jpg", 
    "course_url": "https://www.udemy.com/home-based-business/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T00:58:01Z"
}