{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\"><span>STUDENT REVIEW:</span></strong>  </p>  <p>  \t&quot;This is an excellent course to grab if you, like me, want to have a work from home job...He takes the time to go through the job board resources as well as showing you in detail how to automate the process.&quot;<br style=\"\">  \t ------------------------------------------------------------------------------------------------------------  </p>  <p>  \tWould you like find AND get.real employment you can do from the comfort of home?  </p>  <p>  \tThese are <strong style=\"\">real jobs,</strong> NOT bogus or scammy work at home opportunities.  </p>  <p>  \tMore and more companies are letting their employees work from home. The time has never been better to find your own high paying work-at-home job.  </p>  <p>  \tSay goodbye to the hassles, costs, and frustrations of commuting to work.  </p>  <p>  \t<strong style=\"\">In this course you&#039;ll discover:</strong>  </p>  <p>  \t·How to find the right work-at-home job for your situation  </p>  <p>  \t·Free and low costs resources to find the right job  </p>  <p>  \t·How to put your job search on autopilot  </p>  <p>  \t·How to recognize and avoid scams  </p>  <p>  \t·How to apply and interview for work-at-home jobs  </p>  <p>  \t·Insider secrets to make you stand out and get hired  </p>  <p>  \tWhat if you could wake up, shower and leisurely enjoy your morning breakfast while millions of people are rushing off to work? Then you &quot;commute&quot; a few steps to your home office, relaxed and ready to start your day working at your dream job (in your underwear if you want :-)  </p>  <p>  \tAt the end of the day, instead of facing the stressful 30-60 min or more commute home, you spend that time anyway you want because you are already home.  </p>  <p>  \tIf that&#039;s not enough, imagine doing this from anywhere you want to live. Nearer to your family or children, in the climate of your choice, in the city or the county. Maybe in a place with a low cost of living and low crime rate. It&#039;s completely up to you where you live.  </p>  <p>  \tThis is a reality for millions of people who are working at their dream job from the comfort of home.  </p>  <p>  \tThis course will make it your reality also.  </p>  <p>  \tUSA Today says; People who worked exclusively from home earned more than those who worked only outside the home. Home-based state workers soared 133%, and federal workers, 88%. There was a 67% increase in employees working at home for private companies.  </p>  <p>  \tWorking from home in your dream job really can be a reality for you.  </p>  <p>  \tLet&#039;s start this wonderful journey together.  </p>  <p>  \tRon  </p>", 
    "end_date": null, 
    "title": "Work From Home: Find and Get Your Dream, Work-From-Home Job", 
    "price": "20.00", 
    "instructors": "Ron Ray", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/229908_c6be_2.jpg", 
    "course_url": "https://www.udemy.com/work-from-home-find-and-get-your-dream-work-from-home-job/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-26T15:49:48Z"
}