{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">If you&#039;re ready to find a real work from home job, then this course will show you how. Inside, you&#039;ll learn how to find work as an employee or as an independent contractor for a job that allows you to work from the comfort of your home. I&#039;ll also show you how to quickly spot and avoid scams during your job search.<br style=\"\"></p>  <p style=\"\">  \t<strong style=\"\">Find Legitimate Work at Home Jobs from Companies That Are Hiring Now</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t·Advantages to Working From Home<strong style=\"\"></strong>  \t</p>  \t<p style=\"\">  \t\t·Home Office Requirements<strong style=\"\"></strong>  \t</p>  \t<p style=\"\">  \t\t·Managing Your Online Reputation as a Job Seeker<strong style=\"\"></strong>  \t</p>  \t<p style=\"\">  \t\t·Find a Job on the Most Popular Job Search Sites<strong style=\"\"></strong>  \t</p>  \t<p style=\"\">  \t\t·Recognize and Avoid Job Search Scams<strong style=\"\"></strong>  \t</p>  </ul>  <p style=\"\">  \tI will not be selling you on a new business opportunity or encouraging you to sign up for jobs that pay per task. These are real jobs from real companies, like Xerox, UnitedHealth Group, Dell, Aetna, American Express, First Data, Humana, ADP, General Electric – GE, Symantec, Microsoft and a host of smaller ones, who are hiring for full or partial work from home positions (Source: FlexJobs).  </p>  <p style=\"\">  \t<strong style=\"\">These aren&#039;t just entry level jobs</strong> either. In addition to sales and customer service jobs, you&#039;ll also find opportunities for nurse case managers, marketers, analysts, accountants and more.  </p>  <p style=\"\">  \tMy husband and I have been working from home for over 6 years, securing contracts both as employees and independent contractors. This gave us the freedom to work on our own small business ventures while keeping our bills paid.  </p>  <p style=\"\">  \tBy the end of this course, you&#039;ll have the tools necessary to find, apply and be successful in a work from home job.  Each course section is packed with easy to digest lessons and recommendations that you can start implementing today.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">If you&#039;re ready to learn how you, too, can crack the work at home industry, purchase this course now.</em></strong>  </p>", 
    "end_date": null, 
    "title": "Work From Home: Find Legitimate Telecommuting Jobs that Pay", 
    "price": "20.00", 
    "instructors": "Dequiana Jackson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385460_c662_2.jpg", 
    "course_url": "https://www.udemy.com/work-from-home-find-legitimate-telecommuting-jobs-that-pay/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T07:19:33Z"
}