{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ever wonder how different life would be if you could successfully work from home? I'm not talking about surviving or having a business on the side when you aren't going through the 9-to-5 grind. <strong>I am talking about making a full-time income from the comfort of your home regardless of whether you are awake or sleeping in your pajamas.</strong></p><p>You want that lifestyle. You want to spend more time with the people who matter to you the most. You want to love your work and make a living from it.</p><p>Maybe you still go through the 9-to-5 grind but want to escape. You are limited on your time but are hungry for success. You have such a strong desire for success that you can't begin to put it into words.</p><p>However, you don't know how to get started. The vision looks grand but the steps to getting there are blurry.</p><p><strong>This course lays out the steps that will be critical as you strive to work from home full-time</strong>. The best part about this course is that you can implement these tactics and become successful regardless of whether you already work from home or have the 9-to-5 job.</p><p><strong></strong></p><p>In this course, you will discover how become successful working from home. You deserve to feel comfortable in your working environment and to pursue the work that you love to do. You can be your own boss.</p><p><strong>But only if you are ready to take action. </strong></p><p>If you wish to pursue the path towards successfully working from home from people who have made it happen for themselves, then click \"Take This Course\" now.</p>", 
    "end_date": null, 
    "title": "Work at Home and Run a Business That Works All Day", 
    "price": "20.00", 
    "instructors": "Marc Guberti, John Shea", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/704300_204e_3.jpg", 
    "course_url": "https://www.udemy.com/work-at-home-and-make-money-throughout-the-day-with-your-biz/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T01:22:38Z"
}