{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><span></span>Are you looking for a way to start <strong>earning online</strong>, doing things you love from the<strong> comfort of your home, without </strong>having to work in an<strong> office 9-5, </strong>having a <strong>boss </strong>over your shoulder? Do you have a skill that can be used to help you earn money by using just your laptop and Internet? Have you <strong>tried</strong> to earn online but found minimum or zero <em>success</em>? With this course, I will show you how to start using <strong>Fiverr</strong>, a powerful platform-website that allows you to sell small or big services online and earn money. At the end of this course or even before the end you will be in a position to sell your own gigs on Fiverr and make money.We will take things step by step, explore each element you need to have in order to get started, list your services (<em>Gigs</em>) in a way that sells and maintain a successful personal business by doing things you are good at or love doing. It is really easy and quick to get started and after taking this course, you can start hitting your first sales literally within hours or a few days. You will be shown how to:</p><ul><li><strong>Set up your Free Profile</strong></li><li><strong>Add gigs that sell</strong></li><li><strong>Manage your orders and deliver on time</strong></li><li><strong>Optimize your workflow - maximize productivity</strong></li><li><strong>Minimize your response time so you get even more sales</strong></li><li><strong>Maintain a top rating and reputation</strong></li><li><strong>Deal with difficult situations</strong></li><li><strong>Scale your personal business</strong></li><li><strong>Get 3 Bonuses, including a Done For You Gig</strong></li></ul><strong></strong>Wouldn't it be great if you could take your <strong>life and career in your own hands</strong>, work on things that you love and get paid? Or if you already have a job, wouldn't it be nice to spend a few hours per week doing things you enjoy and earn an extra income, working <em>part-time</em>? Of course, you also want to have <strong>flexibility</strong> with your schedule, work from your bedroom or anywhere in the world you are while <strong>traveling</strong>. Now you can achieve all that plus more, through Fiverr and this course gives you all the information you need to know in order to become a successful seller. So, what are you waiting for? You can <strong>start earning</strong> within hours or days after you complete this course. <em>Join now</em> and see you on the other side.", 
    "end_date": null, 
    "title": "Work from Home: A Guide to Using Fiverr to Find Jobs", 
    "price": "20.00", 
    "instructors": "Bob Raf", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555318_532b_3.jpg", 
    "course_url": "https://www.udemy.com/work-from-home-a-guide-to-using-fiverr-to-find-jobs/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T12:38:45Z"
}