{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   Here you will find <strong style=\"\">ALL topics covered to start your own handmade business</strong>. Interactive and with exercises to train your skills straight away. Gain experience by asking and sharing, study with like minded handmade entrepreneurs.  </p>  <p>  \t <strong style=\"\">After this course you will be able to find answers to the following questions</strong>:  </p>  <p>  \t               I can do something where should I start? How to plan the mission? Where should be my focus? Where can I get money? How can I build my online presence (website, online shop, landing page, social media, blog)? What content to publish? How to track your steps? Where to get stats? How does your customer look like?How to act properly on what you planned? How to follow up? Where to find the ideal customer and how to sell to him? How to use smart marketing and what it is? How to be a marketing campaign yourself? Where and how to PR? How to keep motivated, positive and on track?  </p>  <p>  \t             Course consists of:  </p>  <li style=\"\">Explanatory videos. </li>  <li style=\"\">Additional animated presentations to guide you in several important topics.</li>  <li style=\"\">Links to useful articles, free tools and resources to support you in your business.</li>  <li style=\"\">Inspirational Handmade ideas access.</li>  <li style=\"\">Access to several lists of business ideas (in case you don&#039;t have yours yet).</li>  <li style=\"\">Workbook on how to accomplish your goal with actionable steps (the workbook is a gift for every student joined).</li>  <span style=\"\">It will take you round 6-10 hours to complete the course including videos, additional readings and exercises. I highly recommend you to read and watch everything I offer in order to have full program overview.</span><br style=\"\">  <span style=\"\"></span><br style=\"\">  <span style=\"\"></span><br style=\"\">", 
    "end_date": null, 
    "title": "Your Ultimate Guide for Handmade Business", 
    "price": "50.00", 
    "instructors": "Daria Recker", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/262068_c0fb_4.jpg", 
    "course_url": "https://www.udemy.com/making-income-and-doing-what-you-like/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-15T20:56:41Z"
}