{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>IMAGINE TAPPING INTO THE MASSIVE TRAFFIC OF YOUTUBE AND USING A DEAD </strong><strong>SIMPLE FORMULA TO EASILY GENERATE A FLOOD OF CPA COMMISSIONS - OVER AND OVER AGAIN!</strong></p><p>This course is a complete blueprint to master YouTube as a marketing platform to promote the hottest niches in CPA networks.</p><p>You will be able to master this course in a few hours and put everything into action to see tremendous results in your CPA campaigns!</p><p>You will learn how to get into any CPA network using my strategies. </p><p>You will learn top ninja tactics, from picking out a hot CPA niche to getting an amazing video that converts YouTube traffic into cold hard cash. This course is a full package of top guru ninja secrets to be successful with YouTube+CPA marketing.</p><p>I was thinking of you when I made this course, the marketer who finally wants a breakthrough and start earning a full time income online. If you will follow through this course, you will do amazingly awesome!</p><p>Based on my huge successes with YouTube+CPA, I will let you look over my shoulder on how I setup everything in order to be profitable on YouTube.</p><p>The cool part about CPA is that you don't need to sell anything! When someone enters their email address or zip into your CPA offers, you get paid at the spot! I will show you how to be lazer targeted on YouTube in order to get the right people to see your offers!</p><p>You will be absolute boss when it comes to YouTube and CPA marketing!</p><p>I will see you on the inside.</p>", 
    "end_date": null, 
    "title": "YouTube & CPA Marketing: Make and Optimize Your Channel", 
    "price": "20.00", 
    "instructors": "Konstantin Elikh", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536884_78c7_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-and-cpa-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-25T05:58:25Z"
}