{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>You can make money from YouTube!</strong><br></p><p>You’ve probably heard that all kinds of people are creating YouTube videos and they’re making money from it. <em>YouTube is <strong>paying them</strong> for their videos on their channels!</em></p>    <p>By enrolling your YouTube channel in YouTube’s Partner Program, <strong>you can make money from your YouTube channel, too!</strong></p>    <p>However, they <strong>don’t</strong> accept all channel requests to monetize the channel (at least not right when the channel owner requests monetization).</p>    <p>But Udemy instructor Glory Borgeson’s three YouTube channels were approved for monetization <strong>within one day of her requests</strong>.</p>    <p><em>$€£$€£$€£$€£$€£$€£$€£$€£</em></p>    <p>In this course, Glory fills you in on why her requests for channel monetization were approved quickly.</p>    <p><strong>Then she shows you how to do the same for your channel.</strong></p>    <p><em>$€£$€£$€£$€£$€£$€£$€£$€£</em></p>    <p>Included in this course are tips for getting started with your own YouTube channel. You don’t have to spend a lot of money to get started!</p>    <p>Even if you already have a channel, this course includes many ideas for:</p>    <ul><li>Creating better videos</li><li>Gaining more subscribers</li><li>Increasing your views</li><li>Increasing your viewers’ watch times</li><li>Being strategic in how you manage your channel so that you make more money</li></ul>            <p><em>$€£$€£$€£$€£$€£$€£$€£$€£</em></p>    <p>YouTube’s Partner Program is a revenue sharing agreement between YouTube and their Partners (you!).</p>    <p>There are over 80 lectures in this course – designed to help you learn about building a YouTube channel <strong>and how to make money from it</strong> – without feeling like you’re drinking water from a fire hose.</p>    <p><strong>Let’s get started helping you create a fantastic YouTube channel and making money from your channel, too!</strong></p>    <p><em>(Udemy has a 30-day full money back guarantee. If you don’t like the course, let Udemy know and they’ll refund your money.)</em></p>", 
    "end_date": null, 
    "title": "YouTube Success: Monetize & Attract More Viewers", 
    "price": "40.00", 
    "instructors": "Glory Borgeson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677750_fdaa_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-secrets-monetize-and-attract-more-viewers/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T02:43:53Z"
}