{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><br></p><ul><li><strong>Este es un curso completamente nuevo PARA QUIENES QUIEREN GENERAR INGRESOS DESDE LA COMODIDAD DE SU CASA CON POCO O NADA DE DINERO. </strong></li><li><strong>Al finalizar el curso serás capaz de crear tu negocio con Facebook y tener tus primeros ingresos en cuestión de días. ADVERTENCIA: Para lograr resultados requieres tomar acción y aplicar la metodología del curso, este no es un curso para ganar dinero fácil y sin trabajo, como todo negocio autentico requiere trabajo y compromiso.</strong></li><li>Vas a aprender como adquirir inventario para vender sin tener que hacer ningún desembolso inicial lo cual es realmente bueno porque pocos negocios se pueden empezar sin dinero y lo mejor de todo vas a comprobar que si es posible ganar dinero aplicando correctamente las técnicas que vas a aprender en el curso.</li><li>No requieres tener ninguna experiencia previa para empezar, si te gusta Facebook y quieres usarlo como una herramienta de trabajo más que sólo una distracción  este curso es para ti.</li><li>Es una excelente oportunidad para quienes empiezan en los negocios por Internet.</li><li>Crea un negocio que puedes operar desde la comodidad de tu casa y en tu tiempo libre sin tener que hacer ninguna inversión inicial.</li><li>No importa en qué lugar del mundo vivas puedes sacar provecho de este curso que es simple, práctico y efectivo. Inscríbete ahora y compruébalo tú mismo.</li></ul>", 
    "end_date": null, 
    "title": "¿Cómo ganar dinero SIN dinero con Facebook?", 
    "price": "20.00", 
    "instructors": "Gibran Sanchez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678700_1508_2.jpg", 
    "course_url": "https://www.udemy.com/como-ganar-dinero-sin-dinero-con-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T21:35:41Z"
}