{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>※　当コースはUdemy, Inc. が提供または提携するものではありません。</p>\n\n<p>価値のあるテーマを正しく見つけ、レクチャーを効率的に作り、安定した販売が出せるセールスページを書き、受講生とWinWinの関係を維持することで売上を継続的に伸ばし、自由な成功を手に入れる方法をまとめました。<br></p>\n\n<p><strong>好きなことで作ったUdemyコースで自由に使える収入を得る。自宅のスキマ時間とあなたの経験を利益に変える方法とは？</strong></p>\n\n\n\n<p>当コースは、需要のあるテーマを掘り起こし、効率的にレクチャーを製作し、安定して売れるセールスページを書き、受講生との良好な関係を維持し、Udemyでの売上を何倍にも伸ばす方法を、Udemytop15入りした講師が4時間以上におよぶ動画講義で公開しています。</p>\n\n\n\n<ul><li>お金を生むテーマを見つける方法</li><li>２５倍の利益を出せる人＝始める人</li><li>コース発売を最短距離で実現する方法とツール</li><li>売れるセールスページの作り方</li><li>無料で動画レクチャーを作れるツールとデモ</li><li>失敗しない録音マイクの選び方</li><li>既存コースも新コースも売上UP｜受講生との交流</li></ul>\n\n\n\n<p><strong>こんな方に受講し成功していただきたい</strong></p>\n\n\n\n<ul><li>いまの仕事を辞めずに、新しく副収入を作りたい方</li><li>在宅スキマ時間でリスク無く始められるビジネスを探している</li><li>知識・経験を発信したいが、準備が面倒であきらめた経験のある方</li><li>ネット業を展開中で、さらに売上を伸ばしたい方</li></ul>\n\n\n\n<p><strong>成功し収益を上げる人が使う法則を、あなたのものにしてください。</strong></p>\n\n\n\n<p>サービスや商品を購入するとき、私達は気が付かないうちに一定の法則にしたがって、「買う・買わない」を決めています。一方、ビジネスで成功を収めている人や会社は、この法則を知り、うまく活用をしています。</p>\n\n\n\n<p>当コースでは、あなたがその法則を活用する側に回るために、大多数の人が購入を決定するまでのステップを分析し、もっとも成約率が上がる適切なコピーの書き方を、豊富な事例をもとに詳しく説明しています。</p>\n\n\n\n<p>見込み客があなたのUdemyコースを見つけ、セールスページに進み、自発的に購入し、あなたの受講生になるまでの具体的な方法をカバーするのは、当コースのみです。</p>\n\n\n\n<p><strong>日本人で初めてUdemyトップ15入りした講師が教えます。</strong></p>\n\n\n\n<p>当コースでは1,100人超の受講生をかかえ、コース販売総数が3,200件を超える実績をもつ私が全てのレクチャーを行います。</p>\n\n\n\n<p>2014年7月には日本人で初めてトップ15講師入りした実績にもとづく経験と、私自身が試して失敗したものを取り除き、成功した方法・法則だけを抜き出したエッセンスを初公開しています。</p>\n\n\n\n<p><strong>以下の方は受講をご遠慮ください：</strong></p>\n\n\n\n<p>価値のない情報をテクニックだけで売ろうと考えている方は、受講をご遠慮ください。当コースはマーケティングだけで短期的な売上を作ることを目的にはしておりません。</p>\n\n\n\n<p>痛みの解決や利益に直結する価値を講師自身の中から掘り出し、受講生と良好な関係を維持しつつWinWinの関係で安定的に売上を伸ばすという考え方に賛同いただける方の受講をお待ちしております。</p>\n\n\n\n<p><strong>30日間の返金保証付き</strong></p>\n\n\n\n<p>Udemy社公認の当コースには30日間の返金保証が付与されています。購入したけれど効果が無かった、思った内容と違った、払っただけの価値が無かったと思われた場合には、遠慮なくUdemy宛に返金の依頼を申し出てください。</p>\n\n\n\n<p>最後までお読み頂き、ありがとうございました。それでは、あなたと講義でお会いできることを、心より楽しみにしております。<br></p>", 
    "end_date": null, 
    "title": "ユーデミーで売れるコースを作る－自宅で自由な収入を得る方法（非公式）", 
    "price": "50.00", 
    "instructors": "佐々木徹 (Toru Sasaki)", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548776_ebcf_7.jpg", 
    "course_url": "https://www.udemy.com/the-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Home Business"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-08T07:53:59Z"
}