{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Información básica:</strong></p>\n\n<p>Este curso esta orientado a brindarte un amplio repertorio de herramientas y recursos para tus diseños y desarrollos web. Actualmente cuenta con más de 55, y cada uno de ellos es explicado con ejemplos.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Meta final:</strong></p>\n\n\n\n\n\n<p>Mi objetivo es darte la introducción y una capacitación de como utilizar dichas herramientas y/o código de JavaScript. </p>\n\n\n\n\n\n<p>Estos códigos y programas, te ayudaran a ahorrar tiempo y crear cosas increíbles que te tomarían mucho tiempo realizar sin el conocimiento de estos recursos.</p>\n\n\n\n\n\n<p>Comprenderás desde pequeños slideshows hasta crear unos muy robustos, desde efectos para letras, hasta animaciones, sin contar una gran colección de plugins únicos que he creado que han tenido muy buena aceptación en el mercado australiano y europeo.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Qué necesito saber?</strong></p>\n\n\n\n<ul><li>Es recomendable que sepan algo de jQuery, ya que la mayoría de los recursos son plugins de jQuery. Pero aquí te explicare como usarlos, así que no te preocupes.</li><li>Conocimiento de HTML, CSS y JavaScript al menos lo básico.</li><li>Hay un recurso que utiliza PHP, pero solo es necesario el localhost (igual solo es un recurso de más de 55 disponibles)</li><li>Hay una herramienta que necesitara poder editar archivos PSDs (Photoshop), pero de la misma manera, solo es un recurso de los más de 55 que están disponibles.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Algún costo adicional?</strong></p>\n\n\n\n<p>Todos los recursos utilizados en este curso, son gratuitos, no hay nada de pago. Los códigos creados por mi, yo respondo por las actualizaciones de los mismos. No hay costos adicionales.</p><p>Así que no veo razón alguna para que no te animes a tomar este curso!</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "55+ Herramientas de desarrollo y diseño web", 
    "price": 0, 
    "instructors": "Fernando Herrera", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/807580_7ae0_2.jpg", 
    "course_url": "https://www.udemy.com/recursos-web-plugins-y-utilidades/", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-29T20:39:57Z"
}