{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>APIs are an extremely powerful</strong> way to access content and interact with severs across the internet.   Within this course we show you how to use simple JavaScript and connect to popular web 2.0 APIs like <strong>Twitter</strong>, <strong>Google Map</strong>s, and <strong>Facebook.</strong>   We show you how <strong>AJAX</strong> works and how to use <strong>JSON</strong> to transfer and output data onto your webpage.</p><p>We use HTML and CSS to setup the webpage, and JavaScript to pull data onto the page. </p><p><strong>AJAX</strong> and how to connect and output file information into HTML using JavaScript.</p><p><strong>JSON </strong>- as a data source, how to check JSON and parse it using JavaScript.</p><p><strong>Google Maps</strong> - is done using JavaScript, we show you how to add interactive maps, set markers and more.   Basic JavaScript knowledge is used but not required.</p><p><strong>Twitter Developer API </strong>- We introduce you to the Twitter Developer console, how to create applications and widgets.  We show several ways to place Twitter data on your site, including Twitter Widgets, JavaScript only format for search, timelines and user info.   Twitter REST API, to pull user feed, search twitter for hashtags, post tweets and more.  PHP is used in this lecture but PHP knowledge is not necessary, the source code can be copied and updated with your own keys to access the API.  If you want to learn how to access Twitter and create applications that interact with Twitter this course will teach you how.</p><p><strong>Facebook </strong>- Using the JavaScript SDK, we show you how to login, access the Facebook API and pull back data.   Authorizing your applications with Facebook authorization.</p><p>All the source code is included, step by step learning and a 30 day money back guarantee.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "API introduction use JavaScript AJAX JSON Social Connections", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708170_ffc3_2.jpg", 
    "course_url": "https://www.udemy.com/api-introduction-use-javascript-ajax-json-social-connections/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T03:24:41Z"
}