{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>One of the major challenges while creating an application is adapting your application to run smoothly on all of the plethora of operating systems available. Docker is an extremely efficient technology that allows you to wrap all your code along with its supporting files into a single bundle; it also guarantees that your application will behave in the same way on any host powered by Docker. You can also easily reuse existing Docker containers or create and publish your own. Unlike Virtual Machines, Docker containers are lightweight and more efficient.</p><p>Beginning Docker starts with the fundamentals of Docker—explaining how it works, how to set it up, and how to get started on leveraging the benefits of this technology. The course goes on to cover more advanced features and shows you how to create and share your own Docker images.</p><p>You will learn how to install Docker on your own machine, then how to manage it effectively, and then progress to creating and publishing your very own application. You will then learn a bit more about Docker Containers; built-in features and commands such as volumes, mounts, ports, and linking and constraining containers; before diving into running a web application.</p><p>Docker has functionality such as the Docker web API to handle complex automation processes which will be explained in detail. You will also learn how to use the Docker Hub to fetch and share containers, before running through the creation of your own Docker powered mini-Heroku</p><p>Beginning Docker covers everything required to get you up and running with Docker, with detailed real-world examples and helpful tips to make sure you get the most from it.</p><p><strong>About The Authors</strong><strong></strong><br></p><p><strong>Donald Simpson </strong>is an Information Technology Consultant with over 15 years of experience in programming, Build Management, and process automation. He has worked with a wide variety of multinational companies to develop bespoke automated solutions using Docker and Virtualisation technologies.<br></p><p><strong>Jeff Lindsay </strong>is an independent, design-minded technologist who has been writing and designing software professionally for over 15 years. He has worked with Twilio, DotCloud/Docker, Transcriptic, Piston Cloud, CommerceNet, NASA Ames, and others to build prototypes, products, and platforms.<br></p><p>He also has a large open source portfolio, lots of speaking experience, and a history of starting communities and cultural institutions. These include SuperHappyDevHouse and Hacker Dojo.</p><p>His Specialities include systems thinking, experience design, platforms, tools, prototyping, python, ruby, distributed systems, messaging, information architecture, usability, domain modeling, systems infrastructure, API integrations and design, web development, and cloud stuff.</p>", 
    "end_date": null, 
    "title": "Beginning Docker ", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690872_aa77_2.jpg", 
    "course_url": "https://www.udemy.com/beginning-docker/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T09:18:25Z"
}