{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Un sistema de control de versiones debería formar parte de cualquier conjunto de herramientas de desarrollo.</p><p>Subversion es un robusto sistema de control de versiones <em style=\"\">open source</em> con una cuota de mercado cercana al 50%.</p><p>Éste curso te permitirá, tanto si nunca has usado el Subversion como si eres un usuario que crees que no &quot;exprimes&quot; suficientemente la herramienta, aportar a tú día a día una seguridad y agilidad que seguro te sorprende. Una vez incorporada una herramienta de control de versiones y unas buenas prácticas a tu trabajo diario <strong style=\"\">no hay vuelta atrás</strong>.</p><p>El curso dispone de más de 6 horas de vídeo, pero además hay pruebas y secciones que debes realizar tú mismo. ¡No creo en el aprendizaje pasivo así que prepárate para &quot;quemar&quot; la linea de comandos!</p><p>El curso está estructurado como sigue:</p><ol style=\"\"><li>Introducción al Subversion: En esta sección iremos con paso lento y seguro en la configuración básica de un primer repositorio.</li><li>Un día con Subversion: Introducimos los conceptos y las operaciones más básicas y usadas. ¡En éste espacio es donde pasas el 90% de tu tiempo con Subversion!</li><li>Metodología: Empezamos presentando que aspecto tienen dos herramientas y entornos muy usados en el mundo de Subversion. Creo, pero, que la forma de aprender la herramienta es trabajar directamente con ella, sin intermediarios. Estas y otras razones explican en esta sección la metodología usada durante el resto del curso. </li><li>Obteniendo información del repositorio. Muchos usuarios tienen una visión del Subversion limitada a la sección 2. No es necesariamente criticable: quizás sea lo único que necesitan. Pero en este curso aspiramos a más y en esta sección se empieza a entrar a fondo en los detalles viendo como recuperar cualquier rastro de historia de nuestro proyecto.</li><li>Working copy: figura central en nuestro trabajo diario. Veremos como Subversion estructura sus datos y recursos en el working copy. Estos conocimientos y otros comandos explicados nos permitirán aumentar el rendimiento y adaptar nuestro espacio de trabajo a nuestras necesidades.</li><li>Propiedades. Que son las propiedades y como gestionarlas. Referenciar otros proyectos y evitar molestos avisos de ficheros desconocidos pasarán a formar parte de nuestro arsenal de herramientas.</li><li>Opciones avanzadas. Seguro que sorprenderás a muchos colegas utilizando correctamente las <em style=\"\">peg revisions</em> o las <em style=\"\">revision keywords</em> para aumentar la fluidez de las interacciones con Subversion.</li><li>Concurrencia. Conocerás en detalle el protocolo utilizado por Subversion para gestionar la concurrencia, que tipos de situaciones de puede producir y como reaccionar a cada una de ellas.</li><li>Ramas y etiquetas. Y para el final lo mejor. Disponer de distintas versiones <strong style=\"\">simultáneas</strong> de tu proyecto te permite desarrollar libremente y sin miedo tu siguiente gran funcionalidad al tiempo que reaccionas rápidamente a cualquier parche de urgencia que necesite tu sistema de producción. ¡Olvídate de los días donde entregar una nueva versión era fuente de nervios y estrés!</li></ol>", 
    "end_date": null, 
    "title": "Control de versiones con Subversion", 
    "price": "20.00", 
    "instructors": "Domingo Sebastian", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349254_bed1_2.jpg", 
    "course_url": "https://www.udemy.com/subversion/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T07:33:47Z"
}