{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Git Complete</strong>  </p><p>  \t              This course is designed to be a comprehensive approach to Git, which means no prior knowledge or experience is required but students will emerge at the end   with a very solid understanding and hands-on experience with Git and related source control concepts.  </p><p><strong>Recent Course Updates</strong></p><ul><li>October 17th: Added <em>Updates and Errata</em> section</li><li>July 19th: Added <em>Tagging</em> section</li></ul>  <strong>Course Outline</strong>  <p>  \t<strong>Course Introduction and Overview</strong> provides an introduction to this course and the Git source control system and sets the stage for the rest of the course.  </p>  <p>  \t              After the introduction, the first thing we do is <strong>Git Installation</strong> for both Windows and Mac.  </p>  <p>  \t<strong>Quick Start</strong> a very quick (15 minutes), hands-on introduction to Git. We start off by signing up for GitHub, creating a repository there, the makiing  a local copy (clone), local changes (add/commit) and then update GitHub with our changes (push).  </p>  <p>  \t               In <strong>Basic Commands</strong>, we walk through all the foundational commands needed to start a new project managed by Git (or enable    Git for an existing project)     all the way through making commits, including common file operations like moving and deleting files.    We also cover how to exclude the wrong files from accidentally being committed and how to review your repository's history.  </p>  <p>  \t              With a strong foundation in place, we explore ways to make <strong>Comparisons</strong> in Git, including all the different local states, between commits,   and between local and remote repositories.  </p>  <p>  \t              We give great attending to <strong>Branching and Merging</strong> in Git. We start off with the simple \"happy path\" and learn about \"Fast-Forward\" merges   and how to control them. The we walk through common \"automatic\" merges. Finally, we cause trouble on purpose so we can step through   resolving conflicting merges with our visual merge tool.  </p>  <p>  \t  With a strong foundation in branching and merging, we will then cover a more complex topic, <strong>Rebasing</strong>. In that section, we cover several rebasing examples, including how to resolve a rebase conflict.  </p>  <p>  \tIn the <strong>Stashing</strong> section, we save our work-in-progress while we attend to more pressing issues, then pick up where we left off after that.  </p><p><em><strong>NEW:</strong></em> In the <strong>Tagging </strong>section, we mark important milestones or releases within our project. We also use those tags later for comparing differences between important milestones. We also look at how to use tags within GitHub.</p>  <p>  \t<strong>All tools</strong> have <em>installation </em>and <em>configuration </em>sections to ensure no one is left behind.  </p>  <strong>Course Features</strong>  <p>  \t<strong>Presentations</strong> provide audio/video training of conceptual ideas. Since few like slide-ware presentations, slide-presentations are kept to a minimum.  </p>  <p>  \t<strong>Screencasts</strong> provide a video of the instructor's computer system with any actions, commands, or screens displayed and narrated.   There is nearly 4 hours of screencast based video training in order to step through each command or action in sufficient detail.  </p>  <p>  \t                       Several <strong>attachments</strong> and <strong>document </strong>lectures throughout the course provide supplemental information, illustrations, or other reference material.  </p>  <p>  \t<strong>Moving Forward</strong>  </p>    <p>  \t  This course will expand periodically to include more topics, supporting materials and bonus content! Some content may be in direct response to student feedback or discussions -- so get engaged with the course discussions feature!  </p>", 
    "end_date": null, 
    "title": "Git Complete: The definitive, step-by-step guide to Git", 
    "price": "30.00", 
    "instructors": "Jason Taylor", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/221674_1411_4.jpg", 
    "course_url": "https://www.udemy.com/git-complete/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-18T02:20:55Z"
}