{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Git Nedir?</strong>  </p>  <p style=\"\">  \tGit bir versiyon kontrol sistemidir. SVN olarak da adlandırılan bir sistemdir. SVN, SubVersioN(alt sürüm) kelimesinin kısaltılmış halidir.  </p>  <p style=\"\">  \t<strong style=\"\">Peki bir SVN sistemi olan Git ne işe yarar? diyebilirsiniz..</strong>  </p>  <p style=\"\">  \tBir dosya üzerinde tek başınıza ya da ekip olarak çalıştığınızı düşünün. Siz ya da ekibiniz küçük veya büyük fark etmez, aynı dosya ile çalışmak ve hızla ilerlemek zorundasınızdır. Bu çalışmanızda en fazla sıkıntı veren durum ekipteki kişilerin yaptığı düzenlemelerin, yine ekipteki birisinin yaptıklarıyla çakışmasıdır. Sizin yaptığınız bütün değişiklikler, diğer ekip üyesinde var olmayacağı için o dosyayı farkında olmadan sizin yaptıklarınızın üzerine atar ve bir anda tüm yaptıklarınız ezilir, kaybolur. Aynı şekilde tek başınıza çalışıyor da olabilirsiniz. Mutlaka başınıza gelmiştir. Çalıştığınız dosya da bir değişiklik yapıp kaydettiğinizde ve sonrasında o değişikliğe ihtiyacınız olduğunda geri dönememeniz ve o verinin kaybolması da aynı durumdur.  </p>  <p style=\"\">  \tBu sebeple Git gibi versiyon kontrol sistemleri de bu sıkıntıları gidermek için oluşturulmuştur. Her ekip üyesinin yaptığı değişiklikler ayrı ayrı ele alınarak, üst üste gelmeyen(çakışmayan) değişiklikler(örneğin aynı satırda yapılmış değişiklikler) yoksa kolayca birleştiriliyor. Eğer üst üste gelen(çakışan) satırlar varsa bu konuda yardımcı olarak kolayca birleştirmemize yardımcı oluyor. Fakat dosya üzerinde yapılan tüm değişiklikleri, saklayarak ta istenildiğinde görülebilmesini ve istenilen revizyona geri dönülebilmesini de sağlıyor.  </p>  <p style=\"\">  \tKısaca yazılımcılar için olduğu kadar bir belge üzerinde sürekli revizyon yapanlar içinde geçmişe yönelik revizyonları tutan bir sistemdir.  </p>  <p style=\"\">  \tYazılımcılar için kodlamada yaptığınız bir değişikliği sonradan tekrar geri almak istediğinizde ya da önceki hali ile olan farkını görmek istediğinizde bunu sizin için yöneten harika bir sistemdir.  </p>  <p style=\"\">  \t<strong style=\"\">Peki GitHub nedir? </strong>  </p>  <p style=\"\">  \tGithub versiyon kontrol sistemleri için(örneğin Git) uzak bir depo(repository)dur. Uzak depo demek, bir havuz olarak da düşünülebilir. Birçok yazılımcının bir araya geldiği, bir projenin kopyası üzerinde çalışarak projenin alt sürümlerini çıkardığı ya da çeşitli ihtiyaçlarını giderdiği ve yaptığı değişikliği havuza gönderdiği bir sosyal kodlama alanıdır.  </p>  <p style=\"\">  \tGitHub üzerinde yapılmış bir projenin bir kopyasını alıp, bilgisayarınızda çalışıp yaptığınız değişiklikleri proje sahibine GitHub sitesi üzerinden gönderebileceğiniz gibi, sizde bir hesap oluşturarak GitHub üzerinde proje oluşturabilirsiniz. Github kullanabilmek için sitesinden hesap oluşturmanız gerekiyor. Bazı terimleri de bilmemiz gerekiyor. Repository, branch ve fork gibi. Respository dediğimiz, GitHub üzerinde bulunan her bir projemizdir. Branch ‘ı, repository’lerimizin(projelerimizin) farklı modülleri olarak düşünebiliriz. Fork etmek demek ise, başkasının oluşturduğu bir repository’i, kendi repository’imiz olarak kopyalamak (ayrıca bilgisayarımıza da klon etmeye hazır hale getirmek) demektir.  </p>", 
    "end_date": null, 
    "title": "Git ve GitHub Kullanmak ve Visual Studio", 
    "price": 0, 
    "instructors": "Kadir Murat BAŞEREN", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/175620_089c_8.jpg", 
    "course_url": "https://www.udemy.com/git-ve-github-kullanmayi-ogrenin/", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-03T09:53:40Z"
}