{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                  You have heard a lot about Git, and are excited to use it in your projects. But Git is vast and deep, and you don't want to go through its heavy documentation, books and tutorials. As a developer, you don't want to spend time and energy on that, rather than learning the new Java 8 features, or the Spring Boot framework.  </p>  <p>  \t                  What you exactly want is the<strong> concepts</strong> worth knowing, and <strong>a ready made workflow</strong> for  </p>  <ol>  \t<li><em>Maintaining the history of changes to your source code</em></li>  \t<li><em>Sharing your project with other developers for collaborative development - using GitHub or a similar service provider</em></li>  \t<li><em>Work on production and development branches</em></li>  \t<li><em>Contribute to other projects which are using Git</em></li>  </ol>  <p>  \t                  Also, you don't want to memorize the git commands. Instead, you want to use Git from within your <strong>favourite</strong> <strong>IDE</strong>, like <strong>Spring Tool Suite</strong> or <strong>Eclipse</strong>.  </p>  <p>  \t                  You have come to the right place. In this rapid tutorial, I am going to show you <strong>exactly what you should know about Git as a developer</strong>, with the minimum possible fuss.  </p>  <p>  \t                  This doesn't mean that we are going to skip anything essential - I am going to show you <strong>everything you should know</strong> to manage common, real world applications, having multiple developers.  </p>  <p>  \t                  This is a beginner's tutorial. No prior knowledge on Git is needed. If you want to go more advanced, you can then, after taking tutorial, go to the Git documentation, and it will be a lot easier for you to understand that after taking this tutorial.  </p>  <p>  \t                  I am going to use Spring Tool Suite (STS), an Eclipse based IDE for the demos. If you too are using an Eclipse based IDE, you are at home. If you are using a different IDE, no problem. Your menus and options could be different, but the concepts you are going to learn here would be the same, and so you should not have any trouble figuring out those menus and options in your IDE.  </p>  <p>  \t                  We are not going to learn Git command line syntax here - you will not need to use and remember those. But, if you must use command line Git, due to some reason, after taking this tutorial, figuring those out by looking at the Git documentation should be easy for you.  </p>  <p>  \t                  So, is this tutorial a good fit for you?  </p>  <p>  \t                  If you are new to Git and want to use it in your next project, then this tutorial is a perfect fit for you. You must use a version control system for maintaining your source code, and Git seems to be the most popular today. Have a look at the content of this course, watch the free preview videos, and you will know for yourself if you need this this course. If you are still not sure, you can try it out, you have Udemy's one month money back guarantee with you.  </p>  <p>  \t                  Don't delay in deciding. Take this course, and become ready to use Git within next couple of hours!  </p>", 
    "end_date": null, 
    "title": "Git Rapid Tutorial: Git In Practice Using Eclipse Or STS", 
    "price": "20.00", 
    "instructors": "Sanjay Patel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338398_7fde_6.jpg", 
    "course_url": "https://www.udemy.com/git-rapid-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T12:01:08Z"
}