{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>Cientos de estudiantes satisfechos han tomado este curso especialmente diseñado para principiantes y le han dado 5 estrellas de promedio y excelentes reviews:</span>  </p>  <ul style=\"\">  \t<li>&quot;Acabo de finalizar el curso, lo recomiendo 100%.&quot;</li>  \t<li>&quot;Es de los temas que cualquier desarrollador tendría que saber y Jorge lo explica muy bien!&quot;</li>  \t<li>&quot;Claramente explicado y de una forma muy simple y agradable.&quot; </li>  </ul>  <p>  \t                Inscríbete ya y aprende Git de una vez por todas y conviértete en un desarrollador completo.  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">                  Git se ha convertido en el sistema más importante y fundamental para el desarrollo de cualquier tipo de aplicación</strong>. Gracias a que es totalmente gratis y con el respaldo de la comunidad open source, ningún desarrollador, ingeniero en computación o gerente de proyectos debe ignorar este conocimiento. Git permite tener mejor control sobre el proyecto, facilita la cooperación entre miembros del proyecto y se convierte en un método avanzado de respaldo.  </p>  <p>  \t<strong style=\"\">                        Este curso te introduce, desde el nivel más básico y a través del poder del video</strong>, los fundamentos de Git desde cómo instalarlo hasta cómo usar las herramientas avanzadas y el portal Github.  </p>  <p>  \t<strong style=\"\">                      Si buscas en internet, puedes encontrar cientos de cursos, videos y otros recursos gratis, pero es un trabajo increíblemente tedioso y deja más dudas que respuestas.</strong> En este curso podrás aprender, de manera sencilla y sin saltos, los conceptos de Git, desde lo más básico hasta lo más avanzado junto con una comunidad de estudiantes que están aprendiendo el mismo concepto. Adicionalmente los instructores responden las preguntas que tengas en cada lección si te quedas atascado en cualquier lugar del curso.  </p>  <p>  \t                                                      El curso está dividido en 6 secciones:  </p>  <ul style=\"\">  \t<li>Introducción</li>  \t<li>Fundamentos de Git</li>  \t<li>Repositorios remotos</li>  \t<li>Ramificaciones en Git</li>  \t<li>Herramientas de Git</li>  \t<li>El portal Github</li>  </ul>  <p>  \t<strong style=\"\">                El curso cuenta con más de dos horas de video tutoriales y material de soporte en casi todas las lecciones.</strong> Puede completarse en un día pero es más óptimo tomar cada lección y luego practicar los conocimientos, así que una semana es el tiempo óptimo para completarlo (una sección por día). Sin embargo el material es tan completo, que estamos seguros que volverás una y otra vez a revisar los temas fundamentales.  </p>  <p>  \t<strong style=\"\">Adicionalmente, estamos actualizando el curso constantemente</strong>, añadiendo lecciones gracias al feedback de nuestros estudiantes.  </p>  <p>  \t<strong style=\"\">También tendremos Google Hangouts donde podrás preguntar al instructor</strong> cualquier pregunta que tengas sobre el curso o sobre Git en general.  </p>", 
    "end_date": null, 
    "title": "Git fundamental - Aprende lo importante desde cero", 
    "price": "20.00", 
    "instructors": "Jorge Escobar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287090_50d3_5.jpg", 
    "course_url": "https://www.udemy.com/git-de-cero-a-experto-en-una-semana-y-paso-a-paso/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-24T21:08:59Z"
}