{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>AKTION: Starte jetzt den Kurs und ich helfe dir bei Issues und Pull Requests in deinem GitHub-Projekt!</strong></p><p>Du kannst GitHub perfekt einsetzen um zu üben, um zu lernen, um mit anderen Entwicklern in Kontakt zu kommen, um Unterstützung für dein Open Source Projekt aus der Community zu bekommen und um dein Wissen zu vermarkten. Es ist somit ein Turbo für deine Karriere, deine privaten Softwareentwicklungsprojekte und deine Fähigkeiten im Bereich der professionellen Softwareentwicklung.</p><p>Das wichtigste ist jedoch, dass du es auch einsetzen kannst. Ein gepflegtes GitHub-Projekt und professionelle Issues und Pull Request können dein Ticket für einen neue Job sein. Einige Konzepte und Arbeitsschritte sind auf GitHub allerdings nicht unbedingt intuitiv. Das kommt auch daher, dass GitHub viele Freiheiten lässt.</p><p>In diesem Kurs zeige ich dir Schritt für Schritt wie du GitHub professionell verwendest um möglichst schnell zu den gewünschten Ergebnissen zu kommen. Alle Themen erkläre ich dir anhand vieler Beispiele. Dazu gibt es reichlich Übungen und Beispielprojekte, Issues und Pull Requests direkt auf GitHub.</p><p>Zusätzlich zu jeweils einigen Lektion bezüglich der Kernthemen GitHub-Projekt, -Issues, -Forks und -Pull Requests, gibt es einen großen Bereich mit Tipps und Tricks.</p><p>Als Entwicklungsumgebung verwende ich Visual Studio. Du kannst den Kurs auch verwenden, wenn du eine andere Entwicklungsumgebung nutzt. Allerdings sind mindestens 20% der Lektion auf Visual Studio ausgelegt.</p>", 
    "end_date": null, 
    "title": "GitHub für Entwickler: Mit Workflow und Technik Profi werden", 
    "price": "20.00", 
    "instructors": "Jan Suchotzki", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764154_df51.jpg", 
    "course_url": "https://www.udemy.com/github-fuer-entwickler/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T09:02:15Z"
}