{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is a very powerful guide to help you getting started with Google Webmaster Tools. Google Webmaster Tools is one of the most powerful tools available on the internet to rank your websites with very fewer efforts. <strong>As Google Developer Team maintains this tool, so it is much updated as per the algorithm of Google. </strong></p>\n\n<p><strong>This tool helps you a lot to manage all the errors that may cause you bad rankings. In this video course, you will learn A to Z of Google Webmaster Tools. I structured this course in such a way that both beginners and professionals could get to acquire new things.</strong> </p>\n\n<p>I have started this course with an introduction to the dashboard of webmasters tool so that you could easily recognize what are the functions that we could apply. <strong>Then you will explore each and every corner of webmaster tools; I have explained all the concepts with live examples from my sample blog so that you can easily apply to your website with no mistakes.</strong></p>\n\n<p>I have explained all the concepts in very detailed manner, but still you get any doubt on any of the part throughout this learning, then I am here to sort out all your doubts.</p>\n\n<p><strong>So, what are you waiting for? Enroll now and start learning this tool in just a few hours and see guaranteed results. <br></strong></p><p><strong>I see you inside.</strong></p>", 
    "end_date": null, 
    "title": "Google Webmaster Tools: All you need to know", 
    "price": "20.00", 
    "instructors": "Ankit Shrivastava, TweakCoder eLearning Solutions, Siddarth Kumar", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410170_fa28_4.jpg", 
    "course_url": "https://www.udemy.com/webmaster/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T19:48:37Z"
}