{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Let's face it, videos are the way of the future! weather you want to promote and expand your business, teach a course, disseminate information or make a feature film, your videos will be incredibly enhanced with the use of green screen! </p><p>Producing videos using a green screen will enhance and improve your final product in ways you never thought possible. Weather you are a seasoned videographer or a beginner, I will teach you everything you need to know about producing professional videos with the help of green screen.</p><p>In this  A-Z guide to producing professional videos using green screen technology we will cover, through a series of easy to follow videos:</p><p>1- How to buy the equipment you need on a budget. There is really no need to spend thousands of dollars. I will show you various tricks to getting the effects that you want spending as little as possible.</p><p>2- How to set up the green screen and the lighting in your own studio.  It is easy to set up a green screen studio in your own home (I did it!) and I will show you exactly how to go about it.</p><p>3- what camera to use for filming and how to film. There are many cameras that you can use to film green screen videos. In this course I will share with you the easiest and cheapest way to utilize what you probably already have to film your videos.</p><p>4- How to achieve perfect sound for your video. Sound recording and editing can be an intimidating proposition for beginner videographers. In this class ill will break it down into an easy to follow series of steps to  give your videos the professional sound that you want!</p><p>5- How to edit your video using Final Cut Pro X. Final cut is one of the most used software products in Hollywood today and the good news is that it is extremely affordable and fun to use! I will show you the basics of using Final Cut Pro X to edit your green screen video.</p><p>6- How to add tittles and music to your video. Adding tittles to your video will make it look and feel very professional. It is a lot easier to do than you may think and in this class I will show you exactly how to do it.</p><p>7- How to add music to your video. Soundtracks bring videos to life!  In this class I will show you how to pick a track and import it into your video. Then we will edit the music to adjust it to the needs of your film.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Green screen video production for beginners", 
    "price": "30.00", 
    "instructors": "Dr Ana Afzali", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629398_abde_3.jpg", 
    "course_url": "https://www.udemy.com/green-screen-video-production-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T04:39:58Z"
}