{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>For much longer than anyone cares to admit, it was easier to ship a physical container of coffee beans halfway around the world than it was to get all of the necessary bits and pieces needed for a software program from one machine to another. Then came Docker, and the problem was finally solved. This very interesting platform is fun and easy to learn, and gives an entirely new perspective on the world of programming. Plus, it’s another pretty bow to add to your CV.\n\n  </p>\n\n<p><strong>Your Complete Docker Crash Course</strong>\n\n  </p>\n\n\n\n<ul><li>Learn what Docker is and how to use it</li><li>Familiarise yourself with the Linux operating system</li><li>Get to grips with Docker Hub</li><li>Create your own Wordpress site with Docker</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>No Linux Experience? No Problem!</strong>\n\n  </p>\n\n\n\n<p>This course has been designed for anyone who wants to learn Docker regardless of their experience level, but if you’re not familiar with Linux (which Docker uses), never fear; we’ve included an extensive - but not overwhelming - overview. \n\n  </p>\n\n\n\n<p>You’ll start by taking a look at Docker’s infrastructure and – you’ll be glad to know – how to install it on OSX and Windows. Once that’s done, you’ll learn everything you need to know images and containers, creating an image and running a web server. Then it’s into the nitty gritty of Docker Hub, tag, push and pull images, customising an image, and Docker Commands. You’ll finish off by creating  a fully functional Wordpress website and running it, using Docker as the catalyst to make it happen.\n\n  </p>\n\n\n\n<p>With over 25 lectures and 2 hours of content, by the end of this course you’ll know exactly what Docker can do and how do it. Plus, you’ll be posed to use it in scenarios where it will most likely save you plenty of work. Not bad!\n\n  </p>\n\n\n\n<p><strong>About Docker</strong>\n\n  </p>\n\n\n\n<p>Basically, Docker allows you to ‘build, ship and run any app, anywhere’. It automates the deployment of apps inside software containers using various features of the Linux operating system (although it can be used on Mac and Windows). Think of it like a shipyard with a big cargo ship – it packages the various pieces of cargo needed for delivery (i.e software), then gets it onto the ship and off to its destination efficiently, safely and in one neat package.</p>", 
    "end_date": null, 
    "title": "Introduction to Docker", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738040_be59_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-docker/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T16:50:53Z"
}