{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><b>What is Apache Spark?</b></p><p>Apache Spark is the next generation open source Big Data processing engine. Spark is designed to provide fast processing of large datasets and high performance for a wide range of applications. Spark enables in-memory cluster computing which greatly improves the speed of iterative algorithms and interactive data mining tasks. </p><p><b>Course Outcomes</b></p><p>'Introduction to Apache Spark' includes illuminating video lectures, practical hands-on Scala and Spark exercises, a guide to local installation of Spark, and quizzes. In this course, we guide students through:</p><ul><li>An explanation of the Spark framework</li><li>The basics of programming in Scala, Spark's native language</li><li>An outline of how to work with Spark's primary abstraction, resilient distributed datasets (RDDs).</li></ul><p>Upon completion of the course, students will be able to explain core concepts relating to Spark, understand the fundamentals of coding in Scala, and execute basic programming and data manipulation in Spark. This course will take approximately 8 hours to complete. </p><p><b>Recommended Experience</b></p><p>Programming Languages recommended for this course:</p><ul><li>Scala (course exercises are in Scala)</li> <li>Java</li> <li>Python</li></ul><p>Recommended for:</p><ul><li>Data scientists and engineers</li> <li>Developers</li> <li>Individuals with a basic understanding of: Apache Hadoop, Big Data, programming languages (Scala, Java, or Python)</li></ul><p>For students unfamiliar with Big Data and Hadoop, the course will provide a brief overview of each topic.</p><p><b>Why Adastra Academy?</b></p><p>Adastra Academy is a leading source of training and development for Information Management professionals and individuals interested in Data Management and Analytics technology. Our dedication to identifying and mastering emerging technologies guarantees our students are the first to have access to these quality courses. For an exceptional learning experience, our programs include hands-on labs and real world examples allowing students to easily apply their new knowledge. </p>", 
    "end_date": null, 
    "title": "Introduction to Apache Spark for Developers and Engineers", 
    "price": "50.00", 
    "instructors": "Adastra Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526136_1382_4.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-apache-spark-for-developers-and-engineers/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T16:41:21Z"
}