{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><span></span>This is a comprehensive course designed to show how to setup and run a Jenkins CI server starting with continuous inspection (build, test and analysis) all the way through to continuous deployment. This course provides a strong foundation for implementing continuous inspection, continuous integration, continuous delivery, and even continuous deployment at your company or studio. In order to ikeep the course short and to-the-point, several decisions were made in order to provide a complete path from CI to CD.</p><p>The pipeline created in this course consists of the following:</p><ul><li>Jenkins CI server installed and configured on Windows</li><li>Git as the source control system</li><li>Java as the main programming language of build projects</li><li>Maven as the build tool</li><li>Findbugs, PMD, and Checkstyle as the static code analysis tools</li><li>Tomcat as the deployment server</li></ul><p>This set of tools provides a comprehensive, end-to-end implementation continuous deployment pipeline. Jenkins can be installed on many operating systems and supports a myriad of tools and technologies -- which means, this course provides tremendous value to those comfortable or interested in other operating systems and/or technologies. </p><p><strong>Course Outline</strong><strong></strong></p><p><em>Introduction </em>provides an overview for the course, which leas to the <em>Core Concepts</em> for Jenkins. This provides a foundation for the remainder of the course.</p><p><em>Installation </em>provides step-by-step instructions on how to setup Jenkins and all the related tools specifically on Windows. The same principles are applicable to other operating systems as well.</p><p><em>The Basics</em> provides a first look at Jenkins at work with a very simple \"freestyle\" project. This allows us to learn the Jenkins interface and the key features it provides.</p><p>After that, we dive into <em>Maven Projects</em> specifically -- since Jenkins natively understand Maven and thus provides special features for Maven projects.</p><p>Jenkins can do so much more than simply building. In <em>Test &amp; Quality</em>, we hook up a standard set of unit testing and quality analysis tools for Java projects. Then, we use that information to affect the build status based on established standards.</p><p>We also cover how to use Jenkins as an artifact repository which is used to store the build artifacts, like jars and wars, after successful builds. This is particularly useful when integrating Jenkins with other tools in a more comprehensive software delivery strategy.</p><p>Then, we bring everything together for <em>Deployment </em>to a running Tomcat server. Don't worry, I'll walk you through the complete setup and configuration to work seamlessly with Jenkins!</p><p>Finally, no course would be complete without talking about Security. In this final chapter, we setup Jenkins to allow users to login and only see their projects.</p>Course Features<p><br><br>Presentations provide audio/video training of conceptual ideas in each major area or introduction of new concepts.</p><p>Screencasts provide a video of the instructor's computer system with any actions, commands, or screens displayed and narrated. There are several hours of screencat video content -- it makes up the vast majority of the course. Any command line based screencast will include a command listing in the lecture downloads.</p>", 
    "end_date": null, 
    "title": "Jenkins Bootcamp: Fully Automate Builds Through Deployment", 
    "price": "20.00", 
    "instructors": "Jason Taylor", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538958_4971.jpg", 
    "course_url": "https://www.udemy.com/jenkins-continuous-integration-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T00:34:36Z"
}