{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Learn more about using Brackets as your code editor.</strong></p><p>A modern, open source text editor that understands web design.  Learn how to use <strong>Brackets</strong> and see all the functionality in action.  Learn about top extensions and addons.  Review of best setup techniques.</p><p>Learn how to use Brackets and how you can easily switch to using Brackets as your code editor.</p><p>I've been a web developer since 2000 and have used a number of code editors.  I was originally using Dreamweaver in a  number of my courses.  I found that there were many students who wanted to have the same editor and setup that I have as they follow along with course content.   I switched to several open source editors until I found Brackets.  I've been using Brackets on a regular basis and found that I don't open Dreamweaver as much anymore.  The best part of <strong>Brackets its free,</strong> so anyone who wants to use the same editor as I do in my courses can do so without barrier.  </p><p>I decided to create this course to illustrate how to get brackets, how to set it up and some of the advanced features available in Brackets.   In addition I wanted to list out top extensions to really power up your Brackets application.  </p><p>I also cover my XAMPP server setup which allows me to use localhost as my webserver.   XAMPP is really straight forward on getting going so most of the course is focused on using Brackets.</p>", 
    "end_date": null, 
    "title": "Learn Adobe Brackets Free open source code editor", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786760_a5bb.jpg", 
    "course_url": "https://www.udemy.com/learn-brackets-free-open-source-code-editor/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T01:15:38Z"
}