{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>What makes this course unique is the project based approach. All other course just talks about what selenium is and what it does( testing).However,  in this course you will learn another aspect of using selenium. There are 3  working projects and several upcoming bonus examples if you ever lack one.</p><p>With each technological advancement life becomes a little easier. However the frustration of multiple downloads, clicking on follow button on twitter or seeing everyone else being ranked number 1 for something makes life little uneasy because the heart feels why am I not the number 1. Well, say goodbye to that feeling now.  Here comes the Java and some programming tricks which will make your life easier. The course will teach you how you can rule the internet. To be exact \"You will learn to do things quicker on internet.\"</p><p>Say for instance :</p><p>1. A website contains many images and you want several of them. Will you go and download all of them one by one? The obvious answer is Yes Of course, right? But, what If I say NO,  I have another option in which you just click once and you are done. You are going to learn about that another option in this course.</p><p>2. Isn't it a frustration if you have to do the same thing again and again on internet. What if I say- You don't have to do one thing again and again . Just do once and rest is done by program. Wouldn't that make your life a little easier?  for eg. To follow 100 new people on twitter you have to click 100 times. That takes around 15 minutes. What if you click just once and 99 times is done by program. Once you have gone through the course you will spend only 10 seconds to do that. </p><p>3. Ever wanted to acquire specific things from the internet. for eg. Lets say there exists a webpage which has lot of information about billionaires but also has 100 top billionaires. Now you want to get just the names of 100 billionaires. Separating stuffs out of website will be easy once you have gone through the course. </p><p>This was just 3 example... You will be able to do more than 3 million examples yourself.</p><p>We will use Java+Selenium Webdriver</p>", 
    "end_date": null, 
    "title": "Rule the Internet- With Java+Selenium WebDriver", 
    "price": 0, 
    "instructors": "Programmer Prem Kumar", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544980_56fb_4.jpg", 
    "course_url": "https://www.udemy.com/rule-the-internet/", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T18:52:38Z"
}