{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>*** Course Updated on January 9, 2016! NEW quiz! ***</strong></p><p><strong>Are you a software developer who uses Git and GitHub, or needs to start using these tools for work or a side project? </strong></p><p>This 2-hour intermediate course takes away the guesswork. It builds on my free, introductory course <em>Short and Sweet: Get Started with Git and GitHub Right Now, </em>to tackle tough topics like collaboration, branching and merging. <strong>The intro course </strong><strong>has 200+ reviews and 8000 students.</strong></p><p><em>This course goes way beyond the intro course. </em>More examples and more practical knowledge - and the same simple, no-nonsense structure.  </p><p><strong>Save time and get productive with Git and GitHub - fast! </strong></p><p><em>In less than 2 hours, this Short and Sweet course will take you from beginner to intermediate skills, without a lot of filler. </em>At the end of the course, you'll be able to add collaborators to your own projects, clone and collaborate on other people's or companies' projects, use branching and merging to minimize conflicts, fork projects, and recover from errors by rolling back to prior versions the right way. </p><p>That's a great trade for 2 hours of your time! </p><p>What do students say about this course?</p><p><strong><em>“This is an excellent course on how to start using Git &amp; GitHub with clear examples throughout the course. Gives all the good practises to start coding and committing code to your own or multi-user project. Shows you how to do all the usual commands and scenarios when developing code in a project.</em></strong></p><p><strong><em>“It also shows where &amp; how things can go wrong and also VERY importantly shows what you must not do which could wreck other users’ submission of code or break the project.</em></strong></p><p><strong><em>“I would Highly Recommend this course as it covers the basics that you need to know. :-)”</em></strong> <em>—Mark Collins</em></p><p><em>-----------------------------------------------------------------------------------------------</em></p><p><strong>Why Git and GitHub?</strong></p><p>Using Git on the command line can seem difficult because the commands are exacting, and they can trip you up if you get out of sync - but Git and GitHub are very powerful <em>and absolutely essential for modern software developers. </em></p><p><strong><em>That's because Git and GitHub are a mainstay of modern software version control. </em></strong>Used together, they provide a backup mechanism, a record of your project's history, a collaboration mechanism, and a base for a public portfolio that could get you a job. </p><p><strong><em>\"I truly enjoyed taking this course and I am happy to say that I am using some of the best practices listed in the course. I strongly recommend the course for newbies and even to people familiar with using git.\"</em></strong><em> —Darknight</em></p><p><em>-----------------------------------------------------------------------------------------------</em><br></p><p><strong>Please note: </strong><em>This is a command-line-based course designed to get you productive FAST. This course assumes you already have a GitHub account, have installed Git on your computer, and have pushed your first commit. <strong>If you haven't</strong><strong>, please enroll for free</strong> in my 30-minute introductory course Short and Sweet: Get Started with Git and GitHub Right Now.</em></p><p>But if you've already taken the introductory course, or you're slightly familiar with Git and GitHub and want to look under the hood and get serious, <strong><em>this course IS for you and I hope you'll enroll.</em></strong></p><p><strong><em>“I was already familiar with Git, but had not used it in a workflow that used pull requests. Also, I’ve been trying to understand the rebase command, and no previous explanation made sense to me. This course satisfactorily described both pull requests and the most-likely situation where I would use rebase.”</em></strong> <em>—Steven Calwas</em></p><p><em>-----------------------------------------------------------------------------------------------</em></p><p><strong><em>Second note (for serious students ONLY!): </em></strong>This course tackles collaborative Git and GitHub topics that many online courses and tutorials don't: It covers the Fork &amp; Pull model (often used by larger, more established projects) <strong><em>and</em></strong> the Shared Repository model (often used by smaller or more informal projects).</p><p>Some of these topics are harder to study in an online course, because the best way to practice them is to <strong><em>have access as a collaborator </em></strong>to someone else's code repository. However, if you're new to Git and GitHub, you may not have that access. </p><p>Therefore, in this course, I encourage you to set up a secondary GitHub account and add your own primary account as a collaborator (<em>don't worry, I'll show you how to do this!</em>), so you can switch between accounts and practice collaboration that way. Is doing this a bit of a hassle? Yes. Is it the best way to learn the material in this course (at least, if you don't already have collaborator access)? <strong>Yes!</strong></p><p>In fact, <em>if you really want to go all the way and try everything</em>, please be willing to switch between two user accounts on your computer, so you can use one account with your regular Git configuration and your regular GitHub account, and the second account with a different Git configuration and your secondary GitHub account. </p><p>Of course, you can always just watch the lectures and take notes, which should prepare you to collaborate on projects in the future with some base of knowledge. </p><p>But I encourage you to choose the active approach. I'm here to support the course, and if you put in the work and reach out when you have questions, I will put in the work to help you succeed.</p><p><em>-----------------------------------------------------------------------------------------------</em></p><p><strong>2016 Updates</strong></p><p><strong><em>Update January 9, 2016:</em></strong> <em>New end-of-course quiz! </em></p><p><em>-----------------------------------------------------------------------------------------------</em></p><p><strong>How to Enroll</strong></p><p>My goal is to make this course the best-ever guide to getting <strong>GOOD</strong> at Git and GitHub. Please let me know if anything in the course could be clearer, and I'll be happy to help you. It also will help me improve the course. </p><p>If you're ready to learn more and sign up for the course, <strong><em>go ahead and hit that Enroll button - you’ll gain:</em></strong></p><ul><li><strong><em>Lifetime access to the course</em></strong></li><li><strong><em>Instant access to free updates</em> </strong>that<strong> </strong>I make to the course over time.</li><li><strong><em>Full support from me </em></strong>to address any questions you may have related to learning Git and GitHub. </li><li><strong><em>AND, Udemy offers a 30-day refund guarantee, so there's no risk to you! </em></strong><strong><em>Enroll now and let's get started!</em></strong></li></ul><p><strong><em></em></strong></p>", 
    "end_date": null, 
    "title": "Short and Sweet: Next-Level Git and GitHub - Get Productive", 
    "price": "20.00", 
    "instructors": "Stephanie Losi", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531846_3c17_4.jpg", 
    "course_url": "https://www.udemy.com/short-and-sweet-next-level-git-and-github-get-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T03:06:58Z"
}