{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Are you a software developer who wants to get started right now with Git and GitHub? If you've heard of Git and GitHub but aren't sure how to begin, this course takes away the guesswork. </p><p style=\"\"><strong>Save time and get up and running with Git and GitHub - fast and free! </strong></p><p style=\"\">Using Git on the command line can seem difficult at first because the commands are exacting, and they can trip you up if you get out of sync.</p><p style=\"\"><em><strong>But Git and GitHub are a mainstay of modern software version control. </strong></em>They provide a backup mechanism, a record of your project's history, a collaboration mechanism, and a base for a public portfolio that could get you a job. <br style=\"\"></p><p style=\"\"><em>In just 30 minutes, this \"Short and Sweet\" course covers the essential ideas you need to move forward</em>, without a lot of filler. At the end of the course, you'll be able to set up a GitHub account, install Git, create and configure new Git and GitHub repositories, create a change history for your software projects, and publish your software projects to GitHub. </p><p style=\"\">That's a great trade for 30 minutes of your time!</p><p style=\"\"><strong>Please note: </strong><em>This course does not cover intermediate and advanced topics. It's a free introduction for beginners, not a deep-dive into collaboration, branching and merging. If you're interested in those topics, please take an intermediate or advanced course. </em></p><p style=\"\">But if you're just starting out and you're looking for a step-by-step introduction that helps you sidestep common pitfalls, <strong><em>this course IS for you and I hope you'll enroll.</em></strong></p><p style=\"\">My goal is to make this course the easiest-ever introduction to Git and GitHub. Please let me know if anything in the course could be clearer, and I'll be happy to help you. It also will help me improve the course. </p><p style=\"\"> If you're ready to learn more and sign up for the course, <strong><em>go ahead and hit that Enroll button - the course is free, so there's no risk to you!</em></strong></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Short and Sweet: Get Started with Git and GitHub Right Now", 
    "price": 0, 
    "instructors": "Stephanie Losi", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/484342_667d_6.jpg", 
    "course_url": "https://www.udemy.com/short-and-sweet-get-started-with-git-and-github-right-now/", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-23T14:41:27Z"
}