{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Today the technology sector is experiencing a boom throughout the world. There are hundreds of startups launching every day.  In order to move fast - these startups need people who are skilled at automating as much as possible. Mostly progressive startups - favor implementing completely automated <strong>DevOps</strong> pipelines from the get go.  They realize that these practices of <strong>continuous integration (CI)</strong> and <strong>DevOps</strong> will yield tremendous benefits regarding speed and agility. The demand for these skills has been steadily rising over the last few years.</p>\n\n<p><strong>TeamCity</strong> is a very popular, mature and feature-rich toolset which enables us to build very sophisticated automated build pipelines very quickly. It has extensive community support which has augmented the core functionality of <strong>TeamCity</strong> by building and sharing hundreds of very useful plugins. Implementing continuous integration with <strong>TeamCity</strong> can help us immensely in reducing the risk within our software development lifecycle. It catches us bugs early and increases the quality of our software products. This, in turn, reduces the overall cost to develop innovative software in any environment - startups and enterprise alike.</p>\n\n\n\n<p>The demand for professionals who have experience with these tools has been growing steadily over the last few years. The salaries and consulting rates for these skills have also been rising and are only bound to go up as the demand for these skills remains steady or increases. Professionals with <strong>TeamCity</strong> experience can demand as much as <strong>$100K</strong> as their yearly compensation and these jobs pay more than majority of the jobs posted on US job boards.</p>\n\n\n\n<p>In this course we will:</p>\n\n\n\n<ul><li>Learn about <strong>CI</strong> and why it is important</li><li>Learn about <strong>TeamCity</strong></li></ul>\n\n\n\n<ul><li>Build an automated <strong>CI</strong> pipeline with <strong>TeamCity</strong></li><li>Learn how to version control and manage relational database schema</li><li>Run the <strong>CI</strong> pipeline to maintain build artifacts</li><li>Learn how to configure, secure and extend <strong>TeamCity</strong></li><li>Learn how to configure automated build notifications</li><li>Integrate CI builds with Git repositories hosted in GitHub</li></ul>", 
    "end_date": null, 
    "title": "TeamCity: Learn continuous integration with TeamCity", 
    "price": "20.00", 
    "instructors": "Manuj Aggarwal", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/817440_0a60_3.jpg", 
    "course_url": "https://www.udemy.com/teamcity-learn-continuous-integration-jetbrains-teamcity-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-09T19:29:59Z"
}