{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>This course provides you with the skills and knowledge to develop effective Requirements through Use Case Analysis and Design ...</strong></p><p>Software is Magic from the Mind … it’s the Opposable Thumb for technical entrepreneurship, innovation &amp; architecture … from the DNA Riddle, to television, computers, and the cell phone. Software is being used to develop solutions to our climate change problem with smart leaders like Steve Jobs, Bill Gates, &amp; Barack Obama … Celebrating Christmas &amp; what 2016 innovation can bring to our world!! Are you ready to begin your journey into the future?</p><p>In the development of modern business information systems, a growing list of acronyms seems to render the challenge seemingly all but unmanageable.</p><p>Please allow me to introduce myself, I'm Chuck Morrison, an MBA and PMP certified Senior Program/Projects Manager and Business Architecture Professional with extensive and diverse experience in Program/Project Management and Business Architecture.</p><p>Based on extensive related hands-on practical experience, this course provides you with the skills and knowledge to effectively and efficiently discover skills and knowledge needed to provide valuable solutions for business and IT.<br></p><p>Learn to Transform Requirements into UML Use Cases course authored by Chuck Morrison, MBA, PMP with over 25 years Program Management and Business Architecture experience in Silicon Valley California.</p><p>Frederick Brooks “Mythical Man Month\", George Santayana “Reason in Common Sense\", and Christopher Alexander “The Timeless Way of Building\" each shared key insights into how a system, software, and projects should be conducted to capture and elaborate the critical needs and wants of any enterprise … business, public, or political. Scoping, capturing and developing the right requirements for the right solution in an ever-changing environment is just as important if not more so then when they wrote about information technology.</p><p>All affected stakeholders including sponsors, subject matter experts, and other resources must be involved in collaborative development of the functionality and constraints of workflow model needed to support business automation and related make-buy decisions. This requires the leadership, skills, and knowledge or experiences analyst and architects capable of supporting an effective business requirements model.</p><p>Use case analysis and design is an effect method for capture, analysis, and development of an effective and appropriate business model and required technical architectures and support. Major keys emphasized during the course are collaboration, listening, analysis, and modeling techniques needed for effective business requirements and supportive information technology solutions. This course is based on insights pioneer winners of the Turing Award to help you support effective solutions and decisions regardless of your role.</p><p>If during this course, or after you’ve completed this course, you have any questions related to any part of a section, lecture, quiz, exercise, or in general please don’t hesitate to ask using Udemy’s Instructor Messaging to contact me. You have my promise to work with you to find an answer, which may include course enhancements and/or adjustments. I look forward to hearing your comments and suggestions.</p><p>Again! Please! You be the judge! If during this course or after you’ve completed this course, you have any questions related to any part of a section, lecture, quiz, exercise, or in general please don’t hesitate to ask using Udemy’s Instructor Messaging to contact me. You have my promise to work with you to find an answer, which may include course enhancement and/or adjustments. I look forward to hearing your comments and suggestions.</p><p>I’m looking forward to sharing with you the skills and knowledge to effectively and efficiently develop and deliver requirements-based business workflows and deliverables solutions needed to support your programs and projects to make you and your organization more successful. And, I now encourage you to take full advantage of the learning opportunities this course offers.</p><p>And, please if you find my course useful, please consider leaving a review and rating. Your review is much appreciated. You can go directly to the review page for this course then click and enter your review and rating.</p><p>Criteria for Writing a Review and Rating</p><p>Please remember my promise to you, if your have any questions about any part of this training or any related questions about this course or Udemy please don’t hesitate to ask using Udemy’s Instructor Messaging service to contact me.</p><p>Thank You and Best Regards, </p><p>Chuck Morrison, MBA, PMP</p>", 
    "end_date": null, 
    "title": "UML Use Cases: Transforming Requirements into Context Maps", 
    "price": "25.00", 
    "instructors": "Chuck Morrison", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467510_4e7f_11.jpg", 
    "course_url": "https://www.udemy.com/out-of-chaos-order-use-cases/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T18:00:08Z"
}