{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Based on extensive related hands-on practical experience, this course provides you with skills and knowledge needed for effective and development requirements-base workflows and deliverables needed to support valuable solutions for business and IT organizations.</p><p>Please allow me to introduce myself, I'm Chuck Morrison, an MBA and PMP certified Senior Program/Projects Manager and Business Architecture Professional with extensive and diverse experience in Program/Project Management and Business Architecture.</p><p>Based on my extensive related hands-on practical experience in Silicon Valley high tech, this course provides you with the skills and knowledge to effectively and efficiently design and develop needed requirements-based business workflows and deliverables solutions needed to support your programs and projects for business and information technology organizations.</p><p>Recently, I've authored and published 5 Udemy courses and 5 Amazon Kindle books and am in the process of authoring several more, because as I've discovered teaching and writing are truly my passions.</p><p>The “”Develop Requirements-based WBS, Workflows, and Deliverables” course is authored by Chuck Morrison, MBA, PMP with over 25 years Program Management and Business Architecture experience in Silicon Valley California.</p><p>Also Authored, Produced, and Published Udemy professional training courses and Amazon Kindle books by Chuck are: Learn to Transform Requirements into UML Use Cases, Learn to Analyze Business Application Issues Root Causes, Learn Agile SCRUM Development for Project Managers, Learn How the Project Management Office (PMO) Operate, Develop Requirements-based WBS, Workflows, and Deliverables.</p><p>Critical processes emphasized during this course are collaboration, listening, analysis, and modeling techniques needed for effective and efficient system operations solutions. This course helps you develop the skills and knowledge needed to support effective solutions and decisions regardless of your role.</p><p>As stated previously, “Develop Requirements-based WBS, Workflows, and Deliverables” provides you with the needed skills and knowledge to effectively and efficiently design and develop requirements-based business workflows and deliverables needed to support your programs and projects for business and IT organizations. During each lecture you’ll be presented with information and material found useful to others while developing workflows and deliverables for their own organizations. Remember, however, lectures and demonstrations can only help you so far. It’s up to you to learn then take advantage of the methods and tools presented.</p><p>If during this course, or after you’ve completed this course, you have any questions related to any part of a section, lecture, quiz, exercise, or in general please don’t hesitate to ask using Udemy’s Instructor Messaging to contact me. You have my promise to work with you to find an answer, which may include course enhancements and/or adjustments. I look forward to hearing your comments and suggestions.</p><p>All affected stakeholders including sponsors, subject matter experts, and other resources must be involved in collaborative development viable solution based on PMO operations and processes for any executive decisions. This requires the leadership, skills, and knowledge or experienced analyst and architects capable of supporting an effective business solution needed to return business systems to proper operation.</p><p>Again! Please! You be the judge! If during this course or after you’ve completed this course, you have any questions related to any part of a section, lecture, quiz, exercise, or in general please don’t hesitate to ask using Udemy’s Instructor Messaging to contact me. You have my promise to work with you to find an answer, which may include course enhancement and/or adjustments. I look forward to hearing your comments and suggestions.</p><p>I’m looking forward to sharing with you the skills and knowledge to effectively and efficiently develop and deliver requirements-based business workflows and deliverables solutions needed to support your programs and projects to make you and your organization more successful. And, I now encourage you to take full advantage of the learning opportunities this course offers.</p><p>And, please if you find my course useful, please consider leaving a review and rating. Your review is much appreciated. You can go directly to the review page for this course then click and enter your review and rating.</p><p>Please remember my promise to you, if your have any questions about any part of this training or any related questions about this course or Udemy please don’t hesitate to ask using Udemy’s Instructor Messaging service to contact me.</p><p>Are you ready to get started! See you inside J</p><p>Thank You and Best Regards,</p><p>Chuck Morrison, MBA, PMP</p>", 
    "end_date": null, 
    "title": "Workflow & WBS: Develop Requirements-based Deliverables", 
    "price": "25.00", 
    "instructors": "Chuck Morrison", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546792_6f86_6.jpg", 
    "course_url": "https://www.udemy.com/develop-requirements-based-wbs-workflows-and-deliverables/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T15:16:56Z"
}