{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Course Overview</strong></p>\n\n<p>Zero To Hero series on Apache Maven<strong>(3.3.9 LATEST VESRION)</strong> provides a concise introduction to Maven, the de facto standard for building, managing, and automating Java and JEE-based projects in enterprises throughout the world. The course starts by explaining the fundamental concepts of Maven and showing you how to set up and test Maven on your local machine. It then delves deeply into concepts such as dependency management, life cycle phases, plug-ins, and goals. It also discusses project structure conventions, jump-starting project creation using archetypes, and Lots! and Lots! of hands on practicals.<br><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Why Should You Learn Maven?</strong></p>\n\n<ul><li>If you are new to Java. This course is for you.</li><li>If you are student. This course is for you</li><li>Technology enthusiasts or technology skimmer, just testing the automated build world of Java, you will feel right at home.</li><li>Switching career, you need to learn this tool if you need to survive.</li><li>Tired of IVY or ANT. You will love this course.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Teaching Methodology</strong></p>\n\n<p>This a hands on course where you will be building projects from scratch and hence is suitable for all levels. I believe that the best way to learn any technology is by getting your hands dirty, so lecture:demo ration is 50:50.</p>\n\n<p><strong class=\"redactor-inline-converted\">Course Structure</strong> </p>\n\n<p>Every session begins with key learning, background on the feature and then goes on to show hands on demo that students can follow along or just download the code if they are stuck at any point during the course of the lecture.</p>\n\n<p><strong class=\"redactor-inline-converted\">How Long Will it Take To Complete this course?</strong></p>\n\n<p>The entire video lecture is a little over 120 minutes, however given the number of hands on demo, I expect that it will take between 4-6 hrs to complete the entire course. So you can practically finish this entire course over a weekend or in week during your lunch.</p>", 
    "end_date": null, 
    "title": "Zero To Hero: Apache Maven", 
    "price": "20.00", 
    "instructors": "Dinesh Arora", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830430_7ce0_4.jpg", 
    "course_url": "https://www.udemy.com/zero-to-hero-apache-maven/", 
    "currency": "USD", 
    "subject_name": [
        "Development Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T05:23:48Z"
}