{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\"><strong style=\"\">SPEAK JAPANESE LIKE A NATIVE IN A MONTH</strong></p><p style=\"\">In this course, you will learn the very basics of Japanese language. This is your perfect start to learning Japanese if you are not sure how to study it. This is an approximately 6 hour long course and should take around a month to complete if you study it half an hour every day. Everything you need to understand and master basic level Japanese is in this course!</p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">100% TAUGHT BY A NATIVE</strong><span style=\"\"></span></p><p style=\"\">This course is entirely taught by myself, a native speaker in Japanese, which means a lot when it comes to language learning. A native speaker knows all the tricks: what&#039;s to be prioritised, what is easily misunderstood, what part is the &quot;textbook Japanese&quot; that doesn&#039;t sound natural or even used in real life.</p><p style=\"\"><strong style=\"\">LEARN SMART WITH EFFECTIVE METHODS</strong></p><p style=\"\">Curriculum was designed based on best methods (from years of teaching experience) to start studying Japanese. A lot of Japanese tutorials and courses out there do not teach the language effectively, such as too much grammar, no exercises to practise and use your brain to think in Japanese, and giving too many example phrases without any grammar. </p><p style=\"\">From my experience of teaching beginners, it&#039;s proven that the best method is one that emphasises the balance of grammar-example-practice. And this course teaches you in exactly that manner.</p><p style=\"\"><strong style=\"\">RECOMMENDED FOR THOSE</strong><span style=\"\"></span></p><ul style=\"\"><li style=\"\">Who are considering studying Japanese but unsure where to start</li><li style=\"\">have not learnt much from other courses</li><li style=\"\">find other Japanese tutorials impractical &amp; not very useful</li><li style=\"\">want to be taught by a native who helps you to achieve the correct pronunciation</li></ul><p style=\"\"><strong style=\"\">UPON COMPLETION YOU WILL BE ABLE TO</strong></p><ul style=\"\"><li style=\"\">Read, write &amp; pronounce all Hiragana &amp; Katakana characters correctly</li><li style=\"\">How to pronounce Japanese phrases naturally like a native</li><li style=\"\">Understand how Kanji works</li><li style=\"\">Fluently use 50+ Japanese vocabulary in real life situations and contexts</li><li style=\"\">Listen and understand speedy Japanese speeches</li><li style=\"\">develop an ability to think in Japanese to some extent</li><li style=\"\">Introduce yourself and others in Japanese</li><li style=\"\">Describe and discuss about various objects and things around you</li><li style=\"\">Talk about what is happening and what you or others do/have done</li><li style=\"\">Ask simple questions on above topics in Japanese</li><li style=\"\">Get a sense of how Japanese can be studied effectively</li></ul><p style=\"\">This course can give you the <strong style=\"\">best foundation</strong> and introduction for beginners so they are starting their Japanese study on the right path.</p>", 
    "end_date": null, 
    "title": "Be Fluent & Confident in JAPANESE", 
    "price": "20.00", 
    "instructors": "Guang Chen", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449142_ab93_2.jpg", 
    "course_url": "https://www.udemy.com/fluentandconfident-in-japanese/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T04:54:31Z"
}