{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Learning the Japanese hiragana is much different than learning any other character set or alphabet. The brain is forced to think about the shapes and sounds much differently, and this can quickly overload our traditional memory. This course aims to overcome this challenge, but introducing a new form or memorization for the hiragana.</p><p><strong>Master The Hiragana Quickly Using the Magnetic Memory Method</strong></p><p>• Hiragana Specific Memory Palaces and Worksheets</p><p>• Principles of Location, Imagination, and Action</p><p>• Storing, Recalling, and Testing Memorized Hiragana shapes and sounds</p><p><strong>Master The Hiragana in 1.5 Hours Or Less By Using Simple Memory Techniques</strong></p><p>There are many benefits to knowing how to use memory techniques (mnemonics) as part of learning a language. You can quickly start sounding out words and often you can use the hiragana to sound out Japanese Kanji that you haven't learned yet. Having this ability means that you can travel in Japan with greater ease as you continue learning Japanese.</p><p>But mastering a completely different character set than your native alphabet can be time-consuming and difficult. That's why there are programs available to teach you how to train your mind to grasp new shapes and sounds. The Magnetic Memory Method, created by Dr. Anthony Metivier, makes learning a new language fun by using mnemonics, Memory Palaces, and other techniques for memorizing unusual characters like the hiragana.</p><p><strong>Contents and Overview</strong></p><p>This course contains over 15 lectures and 2 hours of content. It's designed for anyone, regardless of experience level, who wishes to improve their memory and learn the hiragana at the same time.</p><p>Students will learn the Magnetic Memory Method, and you'll understand what a Memory Palace is and how to build one. You'll then learn, using the principle of imagination, action, and Bridging Figures, how to populate your Memory Palaces with the hiragana you wish to master. And, finally, you'll learn how to test your recall of these characters and quiz yourself.</p><p><strong>Benefits<br></strong></p><p>By the end of this course, you'll have valuable skills that will help you quickly memorize and use the hiragana in a way that can be applied to any foreign alphabet. This will happen for you regardless of how good your memory is when you start.</p><p>You'll know how to memorize the hiragana, and how to memorize the correct sound of each and everyone, including those with diacritical marks.</p><p>You'll also receive bonus materials that reinforce the concepts you've learned and give you new tricks to improve your memory. With these lessons, you'll find that you're able to read, speak, and write the hiragana in a short period of time.</p><p><strong>Would You Like To Learn More?<br></strong></p><p>But there's really no time to lose. Every day that you're not using the Magnetic Memory Method for Japanese, you're missing out on the pleasures of reading, writing, speaking and understanding the hiragana all by using the natural abilities of your perfect imagination. Scroll up and join this course today. </p>", 
    "end_date": null, 
    "title": "How To Learn And Memorize The Japanese Hiragana In 1.5 Hours", 
    "price": "20.00", 
    "instructors": "Anthony Metivier", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606228_3278.jpg", 
    "course_url": "https://www.udemy.com/japanese-language-hiragana/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T19:11:34Z"
}