{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p class=\"PIN_1373042731178_hazClick\" style=\"\">  \tCan&#039;t quite seem to memorize all the kana characters?  Need some extra motivation to help you &quot;automate&quot; the stroke order of kana and make them &quot;stick&quot; better?  This course is packed with innovative videos to help you learn quickly and effectively.  Learn all 46 hiragana and 46 katakana in a series of 10 video lessons, each approximately 20 minutes long.  That&#039;s over 200 minutes of motivational instructional/practice videos and that not all...  </p>  <p class=\"PIN_1373042731178_hazClick\" style=\"\">  \tIncluded with the video lessons are downloadable practice paper specific to each set, the mp3 tracks used in the videos to help keep you motivated to practice (without my narration), 10-question quizzes for each set, and video &quot;KanaQuizzes&quot; to gauge how you are progressing.  The approximately 20-minute KanaQuizzes also have embedded mini lessons to go over how the basic 46 phonemes are altered to make all the sounds possible in Japanese.  Currently all 5 of the hiragana KanaQuizzes are developed.  I will continue to add new katakana video quizzes.  That&#039;s another 100 minutes of video tutorials.  </p>  <p class=\"PIN_1373042731178_hazClick\" style=\"\">  \tMost students find the repetitive practice needed to learn the writing systems a bit dull, so this video course is intended to motivate you through a musical approach with fun beats so that your regular practice sessions become more enjoyable.  The different approach in this course engages different parts of your brain other than those typically utilized with &quot;pencil and paper only&quot; practice so that you (theoretically) learn the characters faster and more strongly.  </p>", 
    "end_date": null, 
    "title": "Japanese - KanaBeats - Hiragana and Katakana", 
    "price": "20.00", 
    "instructors": "Michael Van Krey", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63979_7c28_8.jpg", 
    "course_url": "https://www.udemy.com/kanabeats/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-05T16:32:18Z"
}