{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Start speak Japanese Fluently in Less Than 3 Months!</p><p><span>Speak Japanese Fluently is a conversational focused Japanese language course. The goal of this course is to have you speaking functional Japanese that you can use in Japan in day to day life.</span></p><p></p><p>Discover How To...</p><ul style=\"\"><li><span>Move Beyond the Basics and Start Speaking Communicative Japanese</span></li><li><span>Master Hundreds of New Words and Set Expressions</span></li><li><span>Gain an Invaluable Insight To How Japanese Think and Communicate</span></li><li><span>Develop Listening Skills to Handle Normally Very Confusing Expressions and Service Language</span></li><li><span>Master Hiragana and Hundreds of Kanji without Putting Pen to Paper</span></li><li><span>Impress and Even Intimidate Japanese with Your Speaking Ability</span></li><li><span>Finally, Hold Engaging Conversations in a Variety of Social Situations</span></li></ul><p></p><p>This course is ideal for you, if you are</p><p></p><ol style=\"\"><li><span>Struggling to make progress with your study efforts</span></li><li><span><span>Having trouble conversing in Japanese</span><br style=\"\"></span></li><li><span><span>Soon to visit or are currently living in Japan</span><br style=\"\"></span></li><li><span>Sick of learning grammar and actually want to learn how to converse</span></li></ol><p></p><p></p><p><span>The core learning program of Speak Japanese Fluently is the 32 screen-capture video tutorials explaining spoken Japanese in real life settings. This is an Intermediate level program for people wanting to get past the basics and actually communicate effectively.</span></p><p><span>We go through the Speak Japanese Fluently Ebook (which you can download for free) lesson by lesson explaining in detail over 300 set expressions, questions and phrases. Everything is explained to you from the perspective of a Japanese native and foreigner who has studied and spoken the language for 10 years.</span></p><p><span>The course also has 32 listen and repeat audio drills you can download, a bonus Read Hiragana course and special section on Japanese verbs.</span></p><p><span>This program has been designed for you. So, depending on your motivation and the amount of time you have to&nbsp;commit&nbsp;to the course you can complete the course in 1 to 3 months.</span></p><p><span>The course is structure by topic based on real life situations would come&nbsp;across&nbsp;and experience in Japan.&nbsp;</span></p><p></p><p>Why should You Take This Course:</p><p></p><p><span>Living in or just visiting Japan can be an incredibly rewarding and a life changing experience,&nbsp;especially&nbsp;if you know how to speak Japanese! In fact, the opportunities are endless if you can speak functional and fluent Japanese.</span></p><p>Becoming proficient in Japanese will give you the opportunity to:</p><p></p><p></p><ul style=\"\"><li><span><span>Gain a deeper understanding of Japanese culture</span><br style=\"\"></span></li><li><span><span>Make many Japanese friends. Maybe, even meet your future partner</span><br style=\"\"></span></li><li><span><span>Understand Japanese dramas, Anime and Manga</span><br style=\"\"></span></li><li><span><span>Study at a Japanese university</span><br style=\"\"></span></li><li><span>Work in Japan</span></li></ul><p><span>That&#039;s what this course is all about - giving you the language skill set to converse like a native speaker.&nbsp;</span></p><p></p><p></p><p><br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Japanese Language Secrets: Speak Japanese Fluently Fast!", 
    "price": "20.00", 
    "instructors": "Nicholas Kemp", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62371_77b8_8.jpg", 
    "course_url": "https://www.udemy.com/speak-japanese-fluently/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-26T13:29:46Z"
}