{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>August 2015 Update: New downloadable Katakana audio lessons have been added!</strong></p><p>Read Japanese Fast is a Step-By-Step Online Coaching Method That Will Take You By The Hand And Show You How To Read Japanese in Less Than a Month.    Here is a quick preview of what you will achieve by talking our course:</p><ul><li>Read the entire Hiragana syllabary in less than a week</li><li>Quickly master how to read verbs - 20 different verb forms</li><li>Learn to read the Katakana syllabary, and pronounce words or phrases without being misunderstood</li><li>   Dramatically improve your understanding of grammar</li><li>   Learn hundreds of new Japanese words and phrases</li><li>   Save hundreds of hours of study time</li><li>   Memorize over 400 Kanji characters and learn their common readings </li><li>   Learn how to read real Japanese - not text book Japanese</li><li>   Actually read Kanji in context - read real Japanese</li></ul><p>Our philosophy is you need to place more emphasis on actually reading rather than memorizing kanji . For sure you need to know some kanji to get the ball rolling, but you shouldn't spend hours trying to memorize all the readings of individual kanji.</p>     Most teaches will tell you that you need to learn Kanji in order to read Japanese. Our Approach is \"Read Japanese In Order To Learn Kanji\"", 
    "end_date": null, 
    "title": "Japanese Lessons - Start Reading Kanji in Context in 30 days", 
    "price": "20.00", 
    "instructors": "Nicholas Kemp", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41585_cd63_7.jpg", 
    "course_url": "https://www.udemy.com/read-japanese-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-14T02:18:37Z"
}