{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Japanese In Context is a unique introductory level course.  You will learn to speak, read, write and understand modern, authentic Japanese -- and maybe have some fun along the way.</p><p><strong>110 Instructional Video Lessons in 9 Jam-Packed Sections With Over 7 Hours of Content</strong></p><ul><li>Basic Sounds and Writing Systems</li><li>People and Things</li><li>Daily Life Skills</li><li>Making Descriptions</li><li>Existence and Object Properties</li><li>Discussing Actions</li><li>Using the Past Tense</li><li>Complex Sentences</li><li>Japanese in Context</li></ul><strong>Supplementary Material Including Vocabulary and Grammar Lists with Activities and Solutions, Along With Audio and Video Demonstrations By a Native Japanese Speaker</strong><p><strong></strong></p><ul><li>Challenge yourself by writing and reading Japanese</li><li>Test your skills with a wide variety of written activities </li><li>Perfect your pronunciation by comparing it to a native speaker's audio recording</li><li>Watch video demonstrations of how to correctly write Japanese characters</li></ul>  <p>This course is designed to be self-paced but the ambitious student can finish it in 9-10 weeks.  Each section is divided into video demonstrations explaining core Japanese concepts in plain English, followed by supplementary vocabulary, activities, audio files and even more video demonstrations carefully showing how to properly write Japanese characters.</p><p>All material has been thoroughly reviewed and verified by a professional Japanese language instructor and native speaker.</p><p>If you are interested in learning Japanese to boost your career or just for fun, and appreciate a good challenge, this course is for you.</p>", 
    "end_date": null, 
    "title": "Japanese In Context - Elementary Japanese Course", 
    "price": "20.00", 
    "instructors": "Christopher  Bell", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47997_2673_7.jpg", 
    "course_url": "https://www.udemy.com/japanese-in-context/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-31T08:15:09Z"
}