{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  Hi everyone.  </p>  <p>  \t  Welcome to our course.  </p>  <p>  \t  We developed our course based on a book called “Minna no Nihongo”, which is a very  </p>  <p>  \t  common text book and a tutor’s guide. It introduces integrated approach to learning Japanese, but not just that.  </p>  <p>  \t  We have made this course enjoyable.  </p>  <p>  \t  Through the skits performed by native actors and actresses, you can be familiar to Japanese people's manners and behaviors.  </p>  <p>  \t  I have included many words and phrases that Japanese people often use.  </p>  <p>  \t  You will be able to sing some Japanese songs.  </p>  <p>  \t  The more you enjoy, the quicker you learn!!  </p>  <p>  \t  Of course, we will go through everything that you would learn in the first year of a language school.  </p>  <div>  \t  This course consist of three parts.  \t<p>  \t\t  In Part1, we will provied you with essensials of the Japanese language-pronaounciation,  \t</p>  \t<p>  \t\t  basic grammar, and short sentences. We show you a short skit and then explain details.  \t</p>  \t<p>  \t\t  In Part2, you will get to know Japanese for travelers. We will go through the all situations of traveling- get on a plane, buy ticket at a train station,  \t</p>  \t<p>  \t\t  make order at a restaurant, stay at a hotel, when you get lost and so on.  \t</p>  \t<p>  \t\t  In Part3, you will learn some more vocabularies and important basics that we couldn't cover in the skits.  \t</p>  \t<p>  \t\t  The first language teacher will affect your speech quite a lot.  \t</p>  \t<p>  \t\t  In this course, Japanese is spoken ONLY by native speaker so it will help you sound fluent! If you are new to Japanese language, start here!  \t</p>  </div>", 
    "end_date": null, 
    "title": "Japanese for total beginners", 
    "price": "35.00", 
    "instructors": "Maki Sakamoto, Daiki Katou, Shizuka Kasai, Maki Izumi, Natsumi Satozaki, Hana Hoshikawa, Daisuke Yasuda", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/277164_761e_3.jpg", 
    "course_url": "https://www.udemy.com/japanese-for-total-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-08T10:50:51Z"
}