{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t Become a better Japanese teacher by transforming your lessons into a fun and engaging learning hub using ACTLAN.  </p>  <h5 style=\"\">What&#039;s ACTLAN</h5>  <p style=\"\">  \t ACTLAN derives its name from “Action Language” - it &#039;s an innovative methodology to teach language. ACTLAN methodology mimics the way we learn to speak our first native language as children. When we first learn to speak, we use hearing and sight to understand what others are saying, and then use those senses to develop the skills to have a conversation.  </p>  <h5 style=\"\">What will I learn?</h5>  <p style=\"\">  \t In this step-by-step introductory course, you&#039;ll learn how to introduce ACTLAN into your classroom. Complete with lesson plans that maximize the student usage of language, they allow students to recognize and appreciate their own development as they begin to understand and speak more and more.  </p>  <p style=\"\">  \t Through ACTLAN method, students truly enjoy their lesson and instinctively develop a foundation/core for the language.  </p>  <h5 style=\"\">Why take this course?</h5>  <h5 style=\"\">Cultural Experience</h5>  <p style=\"\">  \t Drawing on the gestures of sign language and other body languages, ACTLAN incorporates the importance of learning culture to develop effective communication skills. It uses both current cultural trends and traditional stories and customs to offer rich opportunities to raise intercultural awareness.  </p>  <h5 style=\"\">Student &amp; Teacher Satisfaction</h5>  <p style=\"\">  \t ACTLAN is a powerful and proven teaching tool for teachers, and is beneficial to school and mature age students. Its success lies in the fun lessons full of original, modern and relevant class activities.  </p>  <h5 style=\"\"> Course Materials </h5>  <p style=\"\">  \tAs well as video, audio and text lectures, there are downloadable classroom resources included in this course. How to use these resources using ACTLAN method is explained in the lectures.  </p>  <h5 style=\"\"> Course Duration </h5>  <p style=\"\">  \tThis course consists of 14 lectures and should take between 10-12 weeks to complete.  </p>", 
    "end_date": null, 
    "title": "Learn ACTLAN: Teach Japanese using hand actions - Part 1", 
    "price": "50.00", 
    "instructors": "Chizuko Gomura", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170712_98b8_4.jpg", 
    "course_url": "https://www.udemy.com/actlan-japanese-part1/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-22T01:03:38Z"
}