{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>The goal of this course is to teach you Hiragana and Katakana the RIGHT way. The way it's taught in Japanese schools.</p><p>This course is good for anyone interested in taking their Japanese to the next level. A lot of textbooks don't give exact instructions on how to write these characters. They just show you the character and expect you to figure out everything on your own.</p><p>The purpose of this course is to take different approach - to really walk you through all the characters while holding your hand (not in a weird way! :D )</p><p>Riko-chan - our native speaker - has been overseeing the entire course so all of the content is genuine. She also prepared practice sheets which you can use to improve your handwriting.</p><p>The entire course is basically a video course. Plus you're getting the mentioned practice sheets in JPG format which you can print out.</p><p>In Module 1 we'll teach you Hiragana.</p><p>In Module 2 we'll move onto Katakana, and we'll show you how to write your name in Japanese.</p><p>In Bonus Module we'll teach you 22 Kanji characters (numbers 1-10, and the 12 Animals of the Japanese Zodiac).</p><p>Throughout the course we'll teach you well over 300 words.</p><p>Anyone aiming to write correctly, be able to read manga (world-wide popular Japanese comic books), children's books and eventually novels and newspapers will benefit greatly from this course.<br></p>", 
    "end_date": null, 
    "title": "Read and Write Japanese: Comprehensive Hiragana and Katakana", 
    "price": "40.00", 
    "instructors": "Richard Heiney", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699036_6b9a_7.jpg", 
    "course_url": "https://www.udemy.com/japanese-comprehensive-hiragana-and-katakana/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-16T12:51:10Z"
}