{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>It's quite common when learning a language that you suddenly realize you have knowledge in it, but<strong> you can't actually use it</strong>. You become frustrated by this realization. After all, there's no point in knowing a language if you can't utilize to communicate! This course prevents such problems from arising, and offers complete beginners a great way to start learning Japanese. It's a unique experience in which you can<strong> practice using Japanese</strong> in many realistic examples and situations.<br></p>  <p>  \t<strong>Master Introductory Level Japanese With A Fun, Interactive Course!</strong>  </p>  <ul>  \t<li>Realistic Exercises to Prepare You for Actual Use</li>  \t<li>Lots of Opportunities to Work With Your Fellow Learners</li>  \t<li>Useful Resources to Aid You in Your Learning</li>  \t<li>Minimal Use of English to Ensure Maximum Exposure to Japanese</li>  </ul>  <p>  \t<strong>This course will equip you all of the basic Japanese language skills you need!</strong>  </p>  <p>  \t<br>  \t  </p>  <p>  \tI designed this course with an emphasis on<strong> \"can-do\"</strong>. This means every section, every lesson has a specific goal in terms of what you'll be able to do upon completing them. After all, learning a language is pretty pointless if you can't utilize it in real life!  </p>  <p>  \t      Another great thing about this course is that you can have a <strong>step-by-step</strong> learning experience. Each lesson is kept short, so that you can concentrate on bite-sized contents at a time. This helps you acquire each skill completely before you move on to learning the next. No fears of being left behind in this class!  </p>  <p>  \t      Lastly, this course encourages <strong>active learning</strong>. You'll be playing an active role in this class, instead of just watching me lecture. Keeping your brain active at all times is the best way to learn!  </p>", 
    "end_date": null, 
    "title": "Speak, Listen, Read, Write JAPANESE for Beginners!", 
    "price": "25.00", 
    "instructors": "Nodoka Fujitani", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359690_09e4_3.jpg", 
    "course_url": "https://www.udemy.com/speak-listen-read-write-japanese-for-complete-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Japanese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T11:03:50Z"
}