{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>The course will help you learn how to THINK in Chinese and to speak Chinese that makes sense in most situations. It will also help you get beyond the greetings and you will be carry on with the conversation longer in a meaningful and engaging manner.</p>\n\n<p>I expect your proactive participation. In each video, I will tell you how to practice and usually there will be either a quiz after each unit to help you remember the key concepts of the unit, or an assignment designed to help you internalize what you learn in that unit. Sometimes I will have both a quiz and an assignment. Doing them will be extremely beneficial to you.</p>\n\n<p>Don't rush through the lessons. Make sure you practice every day, even if it's only 10 minutes a day. I recommend that you finish the course in 3 months, and then repeat it a couple more times until you can internalize the concepts conveyed in the course, instead of spreading it out to one year and only do it once. </p>\n\n<p>I can't emphasize the importance of mental preparation too much. You've got to prepare yourself mentally to learn Chinese. Don't dive into the technical aspect of the language without first realizing what you are doing. Thus, I often like to give you some background knowledge or information about a concept I am going to introduce in a lesson. You may choose to skip it, but I believe it's quite valuable to learn within a meaningful context.</p>\n\n<p>I am a professional conference and court interpreter. With my experience and training, I know how to help you unlock your brain to learning a new language successfully, instead of just teaching the language itself. I will share with you my experience and tricks of how to learn Chinese effectively. Sometimes, it will be the stories or advice of other language experts that I've collected over the years. It's the core value of this course and is what set this course apart from the rest. </p>\n\n<p>I am looking forward to working with you and seeing you succeed in this course.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Chinese Boot Camp", 
    "price": "50.00", 
    "instructors": "Edward Wung", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788826_1441_3.jpg", 
    "course_url": "https://www.udemy.com/chinese-boot-camp/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T20:31:14Z"
}