{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t<strong><em>LATEST: COURSE UPDATED IN JUNE 2016</em></strong>  </p>\n\n<p>  \t<strong><em>8600+ SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE!</em></strong>  </p>\n\n\n\n\n\n<p>  \t                          __________________________________________________________________  </p>\n\n\n\n\n\n<p>  \t                                                  Start learning Chinese with a completely new approach that will both make it <strong>fun</strong> and <strong>easy</strong>. In this course you will learn:  </p>\n\n\n\n\n\n<p>  \t                                                  - to recognize the most essential <strong>350 character </strong>and understand <strong>65%</strong> of the language  </p>\n\n\n\n\n\n<p>  \t                      - to read and even write at an <strong>intermediate level</strong>  </p>\n\n\n\n\n\n<p>  \t                                                  - to have a conversation about practically anything  </p>\n\n\n\n\n\n<p>  \t                                                  - useful insights into China and its culture  </p>\n\n\n\n\n\n<p>  \t                                                  ++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>\n\n\n\n\n\n<p>  \t                                                  About the course and us  </p>\n\n\n\n\n\n<p>  \t<strong><strong>The first foreign-run</strong></strong> Chinese (Mandarin) teaching company with a completely new approach to teaching Chinese. Our courses are constructed by foreigners for foreigners, and also include the wide experience of our Chinese teachers.  </p>\n\n\n\n\n\n<p>  \t<em>\"</em><em>Chinese Made Easy: Understand 65% of Chinese in 10 hours</em><em>\" </em>is an extensive Chinese course for anyone who wants to start learning Chinese or even if you have studied it but find it both boring and/or difficult.  </p>\n\n\n\n\n\n<p>  \t                                                  With our new approach we are able to make it <strong><strong>fun</strong></strong> through entertaining videos, and <strong><strong>logical</strong></strong> with the way we break down the language for you and you help us build it up. When you have finished building, we promise you, you will have a much greater understanding of the language and you'll even be able to teach it to others (more about how we convert our students to teachers in our brochure in the first lesson).  </p>\n\n\n\n\n\n<p>  \t                                                  It will start with the basics for anyone who is completely new to the language and quickly build up to a conversational level. We cover <strong><strong>speaking</strong></strong> as well as <strong><strong>reading</strong></strong> and <strong><strong>writing</strong></strong> so you get the whole package. The goal at the end of the course is that you should be able to read and even write articles <strong><strong>completely</strong></strong> in Chinese at an intermediate level. You should also have enough vocabulary and understanding of how the language works to be able to engage in discussions of most topics.  </p>\n\n\n\n\n\n<p>  \t                                                  If you haven't studied with us earlier I suggest you go to our first introduction course “Chinese Made Easy: An Exciting Start to Chinese\", it's completely <strong><strong>free</strong></strong> with over <strong><strong>4 hours</strong></strong> of video content and it should give you a good idea of how you will be learning with us. You can also find that course under my profile (Felix Lättman).  </p>\n\n\n\n\n\n<p>  \t        If you have read this much and don't know what to decide. Please have a look at our reviews. We are convinced that you will find this course great!  </p>\n\n\n\n\n\n<p>  \t        However, if you belong to the 0.0001 percentage that don't agree, remember that you always get a 30-day money-back guarantee!  </p>\n\n\n\n\n\n<p>  \t<em>Felix Lattman</em>  </p>", 
    "end_date": null, 
    "title": "Chinese Made Easy: Understand 65% of Chinese in 10 hours", 
    "price": "20.00", 
    "instructors": "Felix Lättman", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292628_c1c6_6.jpg", 
    "course_url": "https://www.udemy.com/dc-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T19:53:35Z"
}