{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>In this 4-hour course you will learn Mandarin Chinese from scratch. <br>The course helps you start communicating in Chinese as soon as possible. Start your life in China easy without fear of being unable to talk to the taxi driver. </p><p>This course uses games (<strong>Minecraft</strong>) to make learning more interesting and engaging. </p><p><strong>After the course, you will be able to</strong></p><ul><li>Greet in Chinese (lesson 1)</li><li>Pronounce Chinese characters according to Pinyin (Pinyin is the Chinese characters written in Roman letters and the representation of Chinese pronunciation system) (lesson 2)</li><li><strong>Introduce yourself in Chinese</strong> (lesson 3)</li><li>Count numbers in Chinese up to millions (lesson 4)</li><li>Tell the taxi driver where you want to go and where to stop (lesson 5)</li><li>Order food in a Chinese restaurant and <strong>ask for the bill</strong> (lesson 6)</li><li>Ask for prices and negotiate prices with Chinese sellers (lesson 7)</li><li><strong>Ask for direction</strong> if you are lost in China (lesson 8)</li><li>Tell people where you are from (lesson 9)</li><li>Learn the Chinese vocabulary of colours</li><li>Learn to <strong>teach yourself Chinese online</strong> and with mobile phone apps.</li></ul><p>Because Chinese write in characters, which represent meaning but not sound, learning Pinyin is emphasised and made easy in this course. With Pinyin, you will find it easy to pronounce Chinese correctly and to <strong>teach yourself Chinese in the future.</strong> </p><p>No matter you are preparing to visit China and want to communicate in basic Chinese, or you are attracted by Chinese language and culture, you have found the right course. </p><p>If you are here for a grander purpose, such as learning more about languages and researching Chinese linguistics, this course is beneficial for you too.<br></p><p>Enjoy the learning! <strong>Sign up now!</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Chinese for Beginners: Mastering Mandarin Basics in 4 hours", 
    "price": "20.00", 
    "instructors": "Qing Yang Cao", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596760_5bc8_3.jpg", 
    "course_url": "https://www.udemy.com/mastering-mandarin-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T17:14:39Z"
}