{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>\n   \n\nAs China, a nation of long-standing and rich culture tradition  rises to be the economic magnate of the world, Chinese has become the second most learned foreign language\nin American middle schools, high schools and universities. Chinese is the\nlanguage of business and management, government and education, politics and\ndiplomacy, as much as the language of literature and philosophy. Being\nproficient in spoken and written Chinese would win you a prominent advantage in\ncareer opportunities in today’s world. </p><p>    Are you a college student or adult open learner who cherished the hope to study college Chinese but hampered by the lack of time and exorbitant tuition to learn in a classroom setting? Have you been a middle school or high school student who found that 6 years of secondary school Chinese can only be tested into one year’s college Chinese in college placement test? This course is a perfect answer to your dilemmas: In as short as two months, you can learn the same range of vocabulary, grammar and situational dialogues, and achieve the same degree of proficiency as a classroom student enrolled for a whole year’s College Chinese Curriculum at beginners' level. You would save more than ten thousand dollars of tuition for such full credit course in one year, while greatly speed up your learning process, at the convenience of your home and time. </p>  <p>     The instructor is Professor Hong Zeng, an award-winning professor of Chinese. She has taught Chinese at all levels at highly prestigious liberal arts colleges and national universities in America for 16 years. She has two PhDs in Chinese and comparative language and literature, and has published 5 books in these realms in America, well-endorsed by world-renowned experts and book review journals in her field. She had twice more than doubled the classroom Beginning Chinese Course enrollment in just one year. This course adopts the same methodology and simulates the same degree of student-teacher interaction as she has taught at College classroom setting for years. </p>      This course is exceedingly thorough, methodological, and systematic, as well as easy and entertaining. It has 8 sections and 165 lectures, altogether 18 hours. By learning this course, you will be good at Chinese sound and writing system, fluent in most daily situations, such asgreetings, family, dates and time, hobbies, make appointments, school life, traffic, shopping, dining, weather, and party, etc. Hundreds of entertaining images will bring learning, reviewing, testing and application into quick circulation at every short turn as in the mode of immersion education. Following the beginning level of this online college Chinese course, there will be two courses at intermediate level and advanced level coming out soon. These three courses will allow you to learn altogether 3 years’ worth of college curriculum of Mandarin Chinese in just 6 months, and achieve the advanced level of Chinese which will allow you to be fluent in both daily and social topics, while save 30000 dollars of college tuition.", 
    "end_date": null, 
    "title": "College Mandarin Chinese Course on Your Own--Beginning Level", 
    "price": "25.00", 
    "instructors": "Hong Zeng", 
    "commitment": "18 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715744_4a62_8.jpg", 
    "course_url": "https://www.udemy.com/college-mandarin-chinese-course-on-your-own-beginning-level/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T16:41:12Z"
}