{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>    This course, College Mandarin Chinese on Your Own Intermediate Level 1 allows you to learn in just one month a full semester's (six months) college Chinese curriculum based on the same range of vocabulary, grammar and situational dialogue topics, and allows you to achieve the same degree of proficiency at the convenience of your home and available time. It is a sequence of my  course \"College Mandarin Chinese Course on Your Own Beginning Level\" published one month ago on Udemy, which is rated as a five-star course, and was praised unanimously by my students as \"an extremely thorough and  systematic introduction of Chinese language\". Through studying this course, you will be able to converse fluently on daily topics such as seeing a doctor; dating and courtship; renting an apartment; popular sports in China and America; Travel; booking air tickets from travel agency; checking in luggage and boarding at the airport; and the historic/mythic origin and real-life practice of major Chinese festivals, etc. in terms of methodology,  this course combines the benefits of Rosetta Stone Chinese, classroom teaching, and online Chinese courses and avoid their shortcomings. For example, it adopts the proficiency-based instantaneous instruction-testing methods at every short turn similar to that of Rosetta Stone, but avoids its lack of the presence of a personal instructor as in classroom setting who explains and clarifies; it has a personal instructor as in a classroom teaching and simulates the same degree of teacher-student interaction through its diverse, image-entertaining exercises which are adapted from classroom teaching methods, but avoids shortcomings of classroom teaching: the students' lack of individual attention and practice because of the class size, the hearing of many inaccurate pronunciation of other students,etc; it benefits from the convenience of online teaching, at the same time avoids most online language courses' lack of systematic and thorough introduction of grammar, sound and writing system, as grammar and systematic study are extremely important for the students' ability of re-creating and multiplying of language on their own, and the introduction of sound system is important for the students' accuracy of pronunciation, while the knowledge of writing system can immensely simplifying the students' memory of the written form of Chinese characters. <br></p><p>Through your persistent study in this sequence of college Mandarin Chinese courses at beginning, intermediate and advanced level, you will truly be able to learn three years' college Chinese curriculum in just six months and save 30000 dollars of college tuition and achieve the same degree of proficiency. You will be equipped to learn further in specialized Chinese such as business Chinese and advanced level of cultural and social Chinese  with me in my future published courses. Through learning this sequence of courses, middle and high school students will be well-placed in Chinese AP test and college placement test, college students can save tons of tuition while speeding up learning process. Any open learner would acquire a truly systematic and thorough knowledge and skill (both spoken and written) in Mandarin Chinese. As the students in my previous course in this language sequence proclaimed enthusiastically, \"it really works!\" <br></p><p><br></p>", 
    "end_date": null, 
    "title": "College Mandarin Chinese on Your Own Intermediate Level 1", 
    "price": "20.00", 
    "instructors": "Hong Zeng", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780114_e35f_7.jpg", 
    "course_url": "https://www.udemy.com/college-mandarin-chinese-on-your-own-intermediate-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T16:48:58Z"
}