{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">HSK</strong> (Hanyu Shuiping Kaoshi) or the Chinese \nProficiency Test is an international standardized exam which tests and \nrates Chinese language proficiency. It assesses non-native Chinese \nspeakers abilities in using the Chinese language in their daily, \nacademic and professional lives. HSK test was developed in 1984 and the \nfirst HSK test was held overseas in 1991. Since then, the Chinese \ntesting centers have spread all over \ndomestic and foreign lands.</p>\n\n<p><strong class=\"redactor-inline-converted\">The Major Uses of HSK Certification:</strong></p>\n\n\n\n\n\n\n\n<ol><li>certifying the necessary proficiency to enter a Chinese college or university as a graduate or undergraduate student</li><li>demonstration of competence in application for an HSK scholarship for support in academic studies</li><li>certification of exemption from taking Chinese language courses</li><li>admission to mainland companies for employment</li></ol>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">HSK Test Format</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The HSK test consists of a variety of test types. Tests are normally \ndivided into groups of 15 which all follow a common format: listening, \nwriting, reading, multiple-choice, rearrange-words-into-sentences, \netc..The time breakdown works out so that you have approximately 45 \nseconds per question across the entire exam. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Because the test is offered more broadly overseas, there is less \nconsistency in terms of what you can expect otherwise. Depending on the \nlevel, you may be able to listen to audio passages more than once, for \ninstance. There are also reports that the certain versions of the exam \noffered at very basic levels now include pinyin in some questions \ninstead of characters. Despite this, multiple choice questions continue \nto dominate the exam, so we recommend preparing using those.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">HSK Level 5</strong> \ndesigned for learners who can read Chinese newspapers and magazines, watch Chinese films and are capable of writing and delivering a lengthy speech in Chinese.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">HSK Level </strong><strong>6</strong> designed for learners who can easily understand any information communicated in Chinese and are capable of smoothly expressing themselves in written or oral form.</p>\n\n\n\n\n\n\n\n\n\n<p>In this course, we will study simple mandarin sentences and around 3800 vocabulary that commonly used in daily life, which 1300 of them \nbelongs to HSK 5 and 2500 of them for HSK 6 takers.</p>\n\n\n\n\n\n\n\n\n\n<p>In the following course, we'll discuss the topics about one popular Chinese phenomenon, and Chinese traditions. You're encouraged to tell teacher your opinion with new words and new sentence patterns. It's helpful to memorize and make your Chinese local.</p>", 
    "end_date": null, 
    "title": "Conversational Chinese Advanced Level for HSK 5-6", 
    "price": "50.00", 
    "instructors": "Miracle Media", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835724_ac0e_3.jpg", 
    "course_url": "https://www.udemy.com/mandarin-hsk-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-29T23:41:49Z"
}