{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">HSK</strong> (Hanyu Shuiping Kaoshi) or the Chinese \nProficiency Test is an international standardized exam which tests and \nrates Chinese language proficiency. It assesses non-native Chinese \nspeakers abilities in using the Chinese language in their daily, \nacademic and professional lives. HSK test was developed in 1984 and the \nfirst HSK test was held overseas in 1991. Since then, the Chinese \ntesting centers have spread all over \ndomestic and foreign lands.</p>\n\n<p><strong class=\"redactor-inline-converted\">The Major Uses of HSK Certification:</strong></p>\n\n\n\n<ol><li>certifying the necessary proficiency to enter a Chinese college or university as a graduate or undergraduate student</li><li>demonstration of competence in application for an HSK scholarship for support in academic studies</li><li>certification of exemption from taking Chinese language courses</li><li>admission to mainland companies for employment</li></ol>\n\n\n\n<p><strong class=\"redactor-inline-converted\">HSK Test Format</strong></p>\n\n\n\n\n\n\n\n<p>The HSK test consists of a variety of test types. Tests are normally \ndivided into groups of 15 which all follow a common format: listening, \nwriting, reading, multiple-choice, rearrange-words-into-sentences, \netc..The time breakdown works out so that you have approximately 45 \nseconds per question across the entire exam. </p>\n\n\n\n\n\n\n\n<p>Because the test is offered more broadly overseas, there is less \nconsistency in terms of what you can expect otherwise. Depending on the \nlevel, you may be able to listen to audio passages more than once, for \ninstance. There are also reports that the certain versions of the exam \noffered at very basic levels now include pinyin in some questions \ninstead of characters. Despite this, multiple choice questions continue \nto dominate the exam, so we recommend preparing using those.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">HSK Level 3</strong> designed for elementary-intermediate learners who can use Chinese to serve the demands of their personal lives, studies and work, and are capable of completing most of the communicative tasks they experience during their Chinese tour.</p><p><strong>HSK Level 4</strong> designed for intermediate learners who can discuss a relatively wide range of topics in Chinese and are capable of communicating with Chinese speakers at a high standard.<br></p>\n\n\n\n\n\n<p>In this course, we will study simple mandarin sentences and around 900 vocabulary that commonly used in daily life, which 300 of them \nbelongs to HSK 3 and 600 of them for HSK 4 takers.</p>\n\n\n\n\n\n<p>From this course, we'll focus on more longer and complicated sentence patterns. The topics included are describing and arrange one's schedule, location, describe a place's situation, etc. The learning suggestion is as same as before. Please practice under teacher's instructions. And also, the reading program is strongly recommended to start with this course.</p>", 
    "end_date": null, 
    "title": "Conversational Chinese Intermediate Level for HSK 3-4", 
    "price": "50.00", 
    "instructors": "Miracle Media", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835722_7649_2.jpg", 
    "course_url": "https://www.udemy.com/mandarin-hsk-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-29T23:39:09Z"
}