{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong>HSK</strong> (Hanyu Shuiping Kaoshi) or the Chinese Proficiency Test is an international standardized exam which tests and rates Chinese language proficiency. It assesses non-native Chinese speakers abilities in using the Chinese language in their daily, academic and professional lives. HSK test was developed in 1984 and the first HSK test was held overseas in 1991. Since then, the Chinese testing centers have spread all over <br>domestic and foreign lands.</p><p><strong>The Major Uses of HSK Certification:</strong></p>\n\n<ol><li>certifying the necessary proficiency to enter a Chinese college or university as a graduate or undergraduate student</li><li>demonstration of competence in application for an HSK scholarship for support in academic studies</li><li>certification of exemption from taking Chinese language courses</li><li>admission to mainland companies for employment</li></ol><p><strong>HSK Test Format</strong></p><p>\n\n</p><p>The HSK test consists of a variety of test types. Tests are normally divided into groups of 15 which all follow a common format: listening, writing, reading, multiple-choice, rearrange-words-into-sentences, etc..The time breakdown works out so that you have approximately 45 seconds per question across the entire exam. </p>\n\n\n\n<p>Because the test is offered more broadly overseas, there is less consistency in terms of what you can expect otherwise. Depending on the level, you may be able to listen to audio passages more than once, for instance. There are also reports that the certain versions of the exam offered at very basic levels now include pinyin in some questions instead of characters. Despite this, multiple choice questions continue to dominate the exam, so we recommend preparing using those.</p>\n\n<p>In HSK 1, test takers can understand and use very simple Chinese phrases, meet basic needs for communication and possess the ability to further their Chinese language studies. Meanwhile, HSK 2 require test takers to have an excellent grasp of basic Chinese and can communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters.</p>\n\n<p>In this course, we will study simple mandarin sentences and around 300 vocabulary that commonly used in daily life, which 150 of them belongs to HSK 1 and the rest are for HSK 2 takers.</p>\n\n<p>So this course formatted for beginner in learning mandarin, we still use English in the teaching while strongly recommended usage of Mandarin in the course. Professionals, students and casual learners are strongly recommended to take this course.</p>", 
    "end_date": null, 
    "title": "Conversational Chinese Elementary Level for HSK 1-2", 
    "price": "50.00", 
    "instructors": "Miracle Media", 
    "commitment": "21.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/813706_0d80_2.jpg", 
    "course_url": "https://www.udemy.com/mandarin-hsk-elementary/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-05T17:26:37Z"
}