{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">  </p><span style=\"\">&nbsp; &nbsp; &nbsp; &nbsp;This 3.5-hour course teaches you the most useful phrases with thorough explanations that best prepare you to have conversations in real life and make your travel and stay in China a breeze. It provides you with detailed and easy-to-follow instructions on Chinese tones and pronunciation that make you talk like a local; it also offers well-designed vocabulary review and essential tips for having a hassle-free travel in China. It contains 62 lectures, including 29 video lectures, 25 video review lectures, and 8 PDF review lectures for sections. For each small section there is a video review lecture: you can listen to the audio and repeat, and practice your spoken Chinese; and for each large section there is a PDF summary of the lectures.</span><br style=\"\"><ul style=\"\">  </ul>  <p style=\"\">  </p><p style=\"\">&nbsp; &nbsp; &nbsp; &nbsp;This course is taught from the perspective of an English speaker. It is so easy and practical that you can use immediately in your daily life while you are traveling or studying in China. Whether your interest lies in the language or the culture, the course has something for you. With a teeny-tiny fraction of the average costs in online and offline Chinese classes, you can access an even richer pool of practical materials and resources here. For the previous basic lessons, please visit Shuai’s&nbsp; FREE course&nbsp;<a href=\"https://www.udemy.com/chinese-01/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Essential Chinese for Travelers (1)</a>&nbsp;&nbsp; Finally, you have plenty of opportunities to practice spoken Chinese with the fun instructor&nbsp;Shuai FOR FREE via the smartphone app&nbsp;<a href=\"http://www.wechat.com/en/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">WeChat</a>&nbsp;!</p>  <p style=\"\">&nbsp; &nbsp; &nbsp; &nbsp;Have fun learning! ^_^</p><p style=\"\">&nbsp; &nbsp; &nbsp; &nbsp;</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Essential Chinese for Travelers (2)", 
    "price": "50.00", 
    "instructors": "Shuai Zhang", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47572_2e0e_5.jpg", 
    "course_url": "https://www.udemy.com/chinesewithshuai/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-27T07:32:36Z"
}