{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Pinyin is the core phonetic romanization system that represent Chinese characters (hanzi). Basically if you are not aware of Chinese characters at all, you are recommended to use Pinyin as your foundation to learn Mandarin. Beginners especially foreigners will find Pinyin as useful tools to help they progress their Mandarin study easily.</p><p>In this course we will cover everything about Pinyin, practice how to pronounce all Pinyin parts (initials, finals and tones) and combine all of them into making syllables, which is the sound of Chinese characters itself.</p><p>Once you learned Pinyin, advancing into more complex courses like grammar, nouns, pronouns will get easier.</p><p>For our students, Pinyin most commonly used to memorize Chinese characters easily, this way students can know how to read, speak and listen Chinese everyday. With Pinyin you can know how a particular Chinese character sounds, you pair the sound with each Chinese character including its sounds and extract them into a meaning in your own native language. It's easy.</p><p>One simple explanation we can provide :</p><p>English translation of 你好 ( nĭ hăo) is Hello.</p><p>nĭ hăo is the complete pinyin with tone marks, which tells you that 你好<span> sounds as nĭ hăo<span>. The meaning of nĭ hăo<span> in English is hello. So whenever you see this hanzi <span>你好, you will progress slowly to recognize it as <span><span><span>nĭ hăo</span></span>.</span></span></span></span></span></p><p>Pinyin is totally different than English, Pinyin isn't english but it's a very useful tool for you that wish to learn Mandarin quickly, you can easily understand Pinyin in less than 2 weeks.<br><span><span><span><span><span></span></span></span></span></span></p>", 
    "end_date": null, 
    "title": "Essential Basic Study Chinese Pinyin Guide for Beginners", 
    "price": "20.00", 
    "instructors": "Miracle Media", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754216_7941_3.jpg", 
    "course_url": "https://www.udemy.com/basic-mandarin-pinyin/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T10:08:24Z"
}