{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\"><strong style=\"\">What is the target audience?</strong></p><p style=\"\">Welcome to our course on Essential Mandarin for Novice Learners! I&#039;m very excited to have you to learn Mandarin language and explore Chinese culture with me. This course is designed for those language enthusiasts like myself, as well as those who are intrigued by the awesome, fun Mandarin language, and the exotic Chinese culture. You are someone who&#039;s adventurous, open-minded, curious, and most of all, you love to travel to experience diversity, richness, and refreshing cultures. If you are a true beginner who doesn&#039;t know the difference between pinyin and characters. This course is created for you. Let&#039;s dive into what we&#039;ll be covering in this course.</p><p style=\"\"><strong style=\"\">What are the requirements?</strong></p><ul style=\"\"><li style=\"\">Access to internet</li></ul><p style=\"\"></p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><p style=\"\"><span style=\"\"></span>The topics of this course covers introducing oneself, ordering food, taking a cab, asking for directions, and shopping in Mandarin.  This course emphasizes on interpersonal skills in the modes of speaking and listening. When you graduate from this course. You should be able to strike up a simple conversation with a local, and blend in the local culture while traveling in a Mandarin-speaking region, for example, the vibrant Chinatown in your city, or the dynamic, cultural and friendly Beijing. </p><p style=\"\">Each section of this course is designed for a specific scenario of introducing oneself, ordering food, taking a cab, asking for directions, or shopping. For each lecture under a specific section, you may start off watching the video of this lecture. After your brain is stimulated by Mandarin, you can then download and study the worksheet that aligns with the video&#039;s content. To review each lecture content, you can use the awesome Quizlet where flashcards, games and tests are available to aid absorbing and retaining the new content. All sections have quick assessments to help you understand your progress and modify your learning pace accordingly. </p><p style=\"\">This course extends our learning to twitter where you can post questions, answer questions, or comments regarding studying Mandarin. On our twitter account, You may also find links to fun facts of Mandarin language, Chinese culture, and authentic resources that help facilitating your process of learning Mandarin. In addition, you may download the free app &#039;Quizlet&#039; on your smart devices to have access to flashcards, games and tests customized for our course. I hope you enjoy this course and I will see you there!</p>", 
    "end_date": null, 
    "title": "Essential Mandarin for Novice Learners", 
    "price": "40.00", 
    "instructors": "Na Lu", 
    "commitment": "20 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403074_68aa_7.jpg", 
    "course_url": "https://www.udemy.com/essential-mandarin-for-novice-learners/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T18:25:19Z"
}