{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Survival Chinese</strong></p>\n\n<p>Short courses for a rapid introduction to Chinese.<br></p>\n\n<p>Survival Chinese is highly recommended to learn after learning Chinese pronunciation, which is suitable for beginners who are planning to travel in China, or get survived in daily life, or just experience Chinese studying. In this course, we are going to learn some basic expressions, including simple self-introduction, greetings, numbers and time, etc. Please don't be shy, follow your teacher's instructions and speak Chinese. You will find it's very helpful for your improvement.</p>\n\n<p>Contrary to popular belief, Mandarin is in many ways simpler than \nEnglish. There are fewer syllables (compare about 400 syllables in \nMandarin to 4,000 in English) which in terms of pronunciation also \nmostly exist in English. Therefore, any student can reasonably expect to\n acquire an excellent Mandarin pronunciation in a relatively short time.\n Mandarin also does not feature conjugation of verbs, just as there are \nno real tenses and accompanying verb forms.</p>\n\n<p>If you're <strong>traveling </strong>in <strong class=\"redactor-inline-converted\">China</strong>, don't miss out on the chance \nto learn all the language skills you need to survive, and see for \nyourself just how easy Mandarin really is to learn. In this fun and \ninteractive online course, you will learn the essentials to get around \nChina such as greetings, numbers, shopping and bargaining, ordering \nfood, and many more.</p>\n\n<p>This course is designed to give a basic and practical knowledge of Chinese to help you get around China. Even just a few words of Chinese, such as <em>Ni Hao [你好 Nee-How – Hello!] and XieXie [谢谢 Shay-Shay – Thank You]</em>, will impress your colleagues and friends, and help you to make the most of your China experience.</p>", 
    "end_date": null, 
    "title": "Quick Survival Chinese Perfect for Travelers to China", 
    "price": "20.00", 
    "instructors": "Miracle Media", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835730_2bc1_2.jpg", 
    "course_url": "https://www.udemy.com/survival-chinese/", 
    "currency": "USD", 
    "subject_name": [
        "Chinese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-29T23:49:02Z"
}