{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tThis course is about how to get the best growth for your page with the least amount of money.  </p>  <p style=\"\">  \tThe only reason you&#039;ve got a page on Facebook is because you want to market to relevant people in social media with a view to converting them into sales. This is the basis of everything I do in my campaigns. For me, the true measure of success of a Facebook ad campaign comes down to Cost per Action. You and I want the most sales with the least cost. <br style=\"\">  \t<br style=\"\">  \tI have adopted a process that I use for myself and for clients to quickly and effectively build a highly relevant and convertible fan base without breaking the bank. I&#039;ll show you how to get great results from a campaign with only a $5 budget per day. (see the event photo for an idea of what I did with $5 a day for 3 days). <br style=\"\">  \t<br style=\"\">  \tThis is not about buying cheap Likes in strange countries. It’s not about shady services. It’s about implementing a process to strategically target people who will flock to your Facebook Page and engage with you. They will learn to like and trust your brand and you&#039;ll have a proven campaign designed to convert them into revenue. I do this in a 7 step process. <br style=\"\">  \t<br style=\"\">  \tAll you need is a Facebook account and about an hour to complete.  By the end of the course you&#039;ll have an Ad of your own that will generate really great results within days.  </p>", 
    "end_date": null, 
    "title": "1 Dollar a Day Facebook Ads that Generate Real Leads", 
    "price": "25.00", 
    "instructors": "Phil McGregor", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/178864_ec63_6.jpg", 
    "course_url": "https://www.udemy.com/1-a-day-marketing-with-facebook-ads-to-generate-real-leads/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-08T03:31:30Z"
}