{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you want to make the most out of your Facebook marketing budget in 2016? Great, because in this course, I’ll show you 10 proven &amp; tested hacks that work right now!</p>    <p>You’ll learn proven &amp; tested strategies to improve your marketing and get better<em> </em>results on Facebook almost overnight. </p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Learn Proven Tricks From A Professional Facebook Ad Agency</strong></p>    <ul><li>Get more website visitors</li><li>Increase your reach &amp; conversions </li><li>Boost your engagement </li></ul><p><br><strong>Contents &amp; Overview</strong></p>    <p>This course will introduce you to 10 Facebook marketing tools, strategies and techniques that you can deploy instantly. <br> <br> First, we’ll cover how to harness the power of geo-targeting to reach a specific audience segment organically, while improving your ad performance with a 100% free tool called Facebook Page Insights.<br> <br> Next, you’ll discover how to use different location-based targeting options and 15 free image resources to get high-quality stock photos for your campaigns for free.</p>    <p>Then, I’ll show you how to use BuzzSumo to find the best content in your niche market with just a few clicks. </p>    <p>Moreover, we’ll cover how to identify when your fans are online to improve your fan page performance and why deploying calls-to-action button on your fan page timeline cover is important.</p>    <p>Last but not least, I’ll introduce you to the concept of duplicating ads and disclose the #1 trick I learned from a viral website owner who grew his website to millions of page views every month with Facebook ads! </p>", 
    "end_date": null, 
    "title": "10 Facebook Marketing Hacks That Work In 2016", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738340_39a1_2.jpg", 
    "course_url": "https://www.udemy.com/10-facebook-marketing-hacks-that-work-in-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T21:48:08Z"
}