{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    Welcome to my 10-lecture course detailing how to successfully generate revenue with your YouTube videos. First off, a little about me...  </p>  <p style=\"\">  \t<strong style=\"\">    With 8+ years of experience on YouTube, I currently hold 113,000+ subscribers with a total of 34+ million video views.</strong> Having created 1,500+ videos since joining YouTube in 2006, I have gained a ton of experience in the process -- especially in regards to discovering new revenue opportunities that not everyone is aware of.  </p>  <p style=\"\">  \t    Most users decide to focus on the obvious methods of generating revenue. While I do explain some of these methods in my course, <strong style=\"\">I also talk about the lesser known strategies.  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">    My course&#039;s videos are presented in an easy-to-view format, meaning they are short and to the point.</strong> Any links referenced can be conveniently found in the specific lecture&#039;s resources.  </p>  <p style=\"\">  \t    At the end of the course, <strong style=\"\">students will have the opportunity to promote their YouTube videos for free.</strong> This is simply my way of thanking anyone who has taken the time to learn what I have to offer.  </p>  <p style=\"\">  \t    I sincerely hope everyone enjoys my course! Please do not hesitate to contact me with any questions or feedback.  </p>", 
    "end_date": null, 
    "title": "10 Guaranteed Ways to Monetize Your Content on YouTube", 
    "price": "20.00", 
    "instructors": "David Di Franco", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397778_7862_2.jpg", 
    "course_url": "https://www.udemy.com/10-guaranteed-ways-to-make-money-on-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T06:25:05Z"
}