{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you want to double or even triple the engagement rate of your Facebook fanpage? Great, because in this course, I’ll show you 10 proven &amp; tested hacks that work right now!</p>    <p>You’ll discover powerful strategies to boost fan interaction and get better<em> </em>results almost overnight!</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Learn Proven Tricks Deployed By Brands Like Walmart &amp; Coca Cola</strong></p>    <ul><li>Get more likes, comments, shares &amp; clicks </li><li>Boost fan interaction by up to 300%</li><li>Increase your organic reach </li></ul><p><br><strong>Contents &amp; Overview</strong></p>    <p>This course will introduce you to 10 fan engagement hacks that work in 2016. First, we’ll cover how to measure when your fans are online to improve the timing of your posts. </p>    <p>Next, I’ll show you how to easily identify valuable content that gets shared and a sneaky trick to increase fan interaction for just $1.</p>    <p>Then, you’ll discover why asking your fans to caption a photo is an opportunity you shouldn’t miss out on and how to inspire your audience with inspirational quotes. <br> <br> Last but not least, I’ll show you how to make your fans curious with open loops, why you should keep your posts short and how to drastically improve your fanpage performance with a tool called Likealyzer. </p>    <p>You’ll also discover the power of fill-in-the-blank questions to measurably increase your fanpage performance, reach and engagement rate. </p>    <p>By the time you compete this course, you’ll be able to triple your fan interaction, increase organic reach and your fanpage performance like a professional marketing agency!</p>", 
    "end_date": null, 
    "title": "10 Hacks To Increase Fan Engagement On Facebook", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/778186_2a62_2.jpg", 
    "course_url": "https://www.udemy.com/10-hacks-to-increase-fan-engagement-on-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T20:25:47Z"
}