{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t  With the recent changes in how Facebook delivers content to news feeds, fan or business pages have seen a dramatic decrease in the reach of their content.  In fact, the organic reach of fan page content has been cut down to <strong style=\"\">6.5%</strong> according to recent reports. How does this impact your business?  </p>  <p style=\"\">  \t  As a fan page administrator, if you&#039;re using Facebook to attract new business leads and market to prospects, the <em style=\"\">majority </em>of those that have liked your page will not see your efforts organically anymore. The days of expecting your fan page content to reach all that liked your page have come to an end!  You must now <strong style=\"\">pay</strong> for that full reach and develop <strong style=\"\">new </strong>strategies.  </p>  <p style=\"\">  \t  This course will show you how to work around the algorithm that&#039;s blocking your fan page content and how to do it for free. It will also introduce you to Facebook ads, which too have undergone changes in the last few months.  </p>  <p style=\"\">  \t  Included in this course are:  </p>  <ul style=\"\">  \t<li style=\"\">7 instructional videos sharing overlooked Facebook marketing techniques </li>  \t<li style=\"\">A content creation resource guide in PDF format</li>  \t<li style=\"\">Bonus slide presentation introducing the new Facebook ads and the Power Editor</li>  </ul>  <p style=\"\">  \t  It will take approximately 1 hour to 1 hour and a half to view all course materials.  Taking notes is advisable so that you can begin implementing the information immediately.  </p>", 
    "end_date": null, 
    "title": "13 Fan Page Strategies That Trump Facebook's Algorithm", 
    "price": "20.00", 
    "instructors": "Alice Fuller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230068_c6cd_2.jpg", 
    "course_url": "https://www.udemy.com/13-strategies-that-trump-facebooks-algorithm/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-26T18:55:25Z"
}