{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t <strong style=\"\">Learn how to funnel responsive targeted buyers on demand to your offers using Facebook Ads at almost zero cost!</strong><strong style=\"\"></strong>  </p>  <p>  \t        If you&#039;ve done online advertising before, you will know that a winning ad campaign can literally <strong style=\"\"><em style=\"\">make</em> you a fortune</strong>, but a losing ad campaign <strong style=\"\">could <em style=\"\">cost</em> you a fortune</strong>.  </p>  <p>  \t   But the truth is, you should never be in a losing situation <strong style=\"\">if know what your doing</strong>.<strong style=\"\"></strong> Pay-per-click advertising, specifically FB Advertising, does not need to be risky or costly!<strong style=\"\"> </strong><strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t        As a matter of fact, it is possible to <strong style=\"\">get Facebook Ads for as little as 2 cents per click</strong>... today, and everyday, <strong style=\"\">without any tricks, gimics, or anything unethical</strong>.  </p>  <p>  \t <strong style=\"\">With 2 Cent FB Clicks you will master and learn... </strong>  </p>  <ul style=\"\">  \t<li>how to create highly targeted FB custom audiences and user lists</li>  \t<li>how to create, write, and optimize your Ads for maximum conversions </li>  \t<li>when and when not to use Facebook Ads for your offers and why </li>  \t<li>how to leverage the viral nature of social media to get more traffic</li>  \t<li>and most importantly how to get people to buy your offer</li>  </ul>  <p>  \t           It&#039;s always a good feeling to know that you can get quality traffic whenever you want it.  </p>  <p>  \t     This comprehensive series of <strong style=\"\">step-by-step training</strong> videos will walk you through the exact same process that we use to <strong style=\"\">profit &quot;big time&quot; with Facebook Ads</strong>... time and time again.  </p>  <p>  \t      Put this training to work for you now, and ensure your next level of success.  </p>  <p>  \t   Are you willing?  </p>", 
    "end_date": null, 
    "title": "2 Cent Facebook Clicks - Cheap Targeted Traffic", 
    "price": "20.00", 
    "instructors": "Crucial Advantage", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121346_a903_7.jpg", 
    "course_url": "https://www.udemy.com/2-cent-facebook-clicks-cheap-targeted-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-17T23:20:00Z"
}