{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>**NEW COURSE, JUST RELEASED** Includes 100 page E-book </em></strong></p><p>Whether you are starting your company and need to learn about social media marketing or you are a business owner who needs to become more <strong>competitive and increase</strong> the <strong><em>effectiveness</em></strong> of your social media efforts, this course will certainly teach you a few up to date strategies that will make a difference. </p><ul><li><strong>New to social media marketing? Start by learning our theoretical approach</strong></li><li><strong>Experienced social marketer? Stay up to date with our regular tactical updates</strong></li><li><strong>Learn from a top marketing consultant how to refine your social strategy </strong></li></ul><p><em><strong>**Students of the CIM / IDM marketing diploma seeking to gain more hands on experience: Join us to consolidate your knowledge**</strong></em></p><p>Perhaps you are already using social media marketing and your business is doing well. That’s great, but the truth is that your business could be doing even better if you fine-tuned your social media strategy, which is one of the aspects covered in this course. Given the ever-increasing use of social media in the younger generations but also in the older ones, the risk of not being represented on social media platforms is to be cut off both from the rest of society and from your share of the market too. However, it is no longer sufficient for every business to be represented on one or more social media platforms, but it is necessary to be well-represented. In this course, you will learn a lot of tactics to be more effective in your social media strategy.</p><p>Perhaps your business is already international, but the question is <strong>\"is it global?</strong>\" In this course you are going to learn tactics that will allow you to connect with customers worldwide. Small local independent businesses are disappearing swallowed by multi-national or large-scale competitors, and this will in due course happen to businesses that don’t reach out for the global market via social media.</p><p>It’s important to understand the difference between social media and social marketing. The difference lies in the fact that social media is a tool whilst social marketing is how the tool is used. People use social media to stay connected and interact with family and friends. Social marketing is also uses media to create connections but for different purposes: to network, to promote a brand, to find potential customers/clients, to gain insight into customer preferences just to mention a few. So the main difference is that when we use social media at a personal level we connect with people we already know, while when we do social marketing we have the potential to connect also with people we don’t know.</p><p><strong>Why is it important to understand this difference? </strong>Whilst friends and family are quite happy to click on the comments we make and the links we share simply because they love us, to connect with the world at large and gain their support you will need to up your game, acquire new strategies, work on the ones you already know and develop an action plan. So this course will teach you how to use social media to do business.</p><p>Another important thing that you will learn about in this course is that it’s not enough to do some social media marketing but it’s essential that every marketing campaign is social and involves the public at large. If only some of your marketing initiatives are social, the audience is only partially informed, partially engaged, and partially involved and as a consequence your business will only be partially increasing its revenue.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "2016 Certificate in Social Media Marketing for B2B and B2C", 
    "price": "20.00", 
    "instructors": "Adriaan Brits, BA, MA, MRes Francesca Stregapede", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/652258_8929.jpg", 
    "course_url": "https://www.udemy.com/certificate-in-social-media-marketing-for-b2b-and-b2c/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T11:00:13Z"
}