{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<span>Singers and Musicians! Are you on YouTube? Maybe you’ve just  started doing videos, and you’re struggling to boost the number of views on  your channel; or maybe you’re already an avid YouTube artist, but you haven’t  been too impressed with the number of views you’re getting. Maybe you haven’t  put out any cover videos yet, but you want to know how to make yourself stand  out right from the get-go. Wherever you’re at, our course– “25 Steps to ROCK  Your YouTube Views – How to Maximize the Views on Your Cover Video in 1 Week  Without Paying a Cent” – will take you one step further!</span>  </p>  <p>  \t<strong>What You  Get</strong>  </p>  <p>  \t1. Our detailed Ebook, which will  guide you through our 25 step strategy for maximizing the number of views on  your next cover video release  </p>  <p>  \t2. A set of 25 video tutorials to  go along with the action steps outlined in our Ebook  </p>  <p>  \t3. We’ll also show you what to do  BEFORE your cover video even exists so that it can have more of an  impact when it comes out; how to put your video on a few different sites in a  single upload; and specific actions that you need to do both online and offline  to really take advantage of this massive “world wide web stage” that you have  access to  </p>  <p>  \t4. The  printable “ROCK my Views” Checklist, which summarizes this guide into specific  action steps  </p>  <p>  \t5. Direct  access to us! You’ll be able to contact us directly with any questions or  problems you may have. From one artist to another, we really do want to see you  succeed!  </p>  <p>  \t<strong>Requirements</strong>  </p>  <p>  \t- You  need to be willing to invest your time  </p>  <p>  \t- You  need to commit to watching each video and completing every single step in the guidebook AND  you need to do it within 2-3 days of uploading your cover video, in order to  see results  </p>  <p>  \t- The best way to get the most  out of this course is to watch each video first then read the corresponding  section in the ebook. For example watch video 1 for step 1 and then read step 1  in the ebook.  </p>", 
    "end_date": null, 
    "title": "25 Steps to Rock Your YouTube Views", 
    "price": "20.00", 
    "instructors": "Jewel Tolentino & Auret Esselen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37377_9fb8_7.jpg", 
    "course_url": "https://www.udemy.com/moreyoutubeviews/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-21T22:49:03Z"
}