{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<em>LATEST: Course Updated On September, 2015 To Include More Lectures:</em>  </p>  <ul>  \t<li><em>Example of an advanced strategy for getting more retweets on Twitter</em></li>  \t<li><em>Lecture on how to write better headlines that drive more traffic</em></li>  \t<li><em>Example of how to use social media to boost the SEO rankings of your web pages</em></li>  </ul>  <hr style=\"\">  <p style=\"\">  \t<em>* OVER 1,300 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE</em>  </p>  <hr style=\"\">  <p style=\"\">  \t                                                        In this course you will learn:  </p>  <ul>  \t<li>Advanced social media marketing used by growth hackers and professional marketers</li>  \t<li>How to grow  traffic, customers, and ultimately make more money</li>  \t<li>How to get other people to retweet, like and re-share your content</li>  \t<li>How to use social media to boost your Google SEO</li>  \t<li>How to use hashtags and catchy headlines to increase virality of your messages</li>  </ul>  <p style=\"\">  \t          I am a small business owner just like you! The strategies in this course work for start-ups and small businesses. So if you have a small business or a tech start-up, this course is designed to make you a pro marketer, and empower you to get many new customers.  </p>  <p style=\"\">  \t<strong>How The Course Is Structured</strong>  </p>  <p style=\"\">  \t          To make sure that everyone is able to follow along, the course starts by covering beginner social media marketing topics and goes over the fundamentals. Once everyone is up to speed, we get into more complex social media marketing strategies that help your business truly grow. The course is made up of 25 lectures that are almost all video, and should take you just over an hour to complete.  </p>  <p style=\"\">  \t<strong>Section One Of The Course</strong>  </p>  <p style=\"\">  \t          The first part of the course focuses on social media marketing basics and fundamentals. But that section if brief.  </p>  <p style=\"\">  \t<strong>Section Two Of The Course</strong>  </p>  <p style=\"\">  \t                                                      The next part of the course focuses on popular social media marketing strategies like Facebook marketing strategy, Twitter marketing strategy, YouTube marketing strategy, GooglePlus marketing, Quora marketing, and how to do social media marketing on a few other social networks. This list could be endless because there are so many social networks, so I stop there since you probably already understand the right strategies on such sites by that point.  </p>  <p style=\"\">  \t<strong>Section Three Of The Course</strong>  </p>  <p style=\"\">  \t                                                      The next part of the course covers more insightful social media marketing strategies like how to amplify your social media marketing by leveraging search (SEO) inside the social networks, how to use photos, make things more entertaining, and similar strategies that enhance your social media marketing efforts.  </p>  <p style=\"\">  \t<strong>Personal Touch Like Nowhere Else!</strong>  </p>  <p style=\"\">  \t          My goal is to help you succeed, and I go out of my way to help students however I can. In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p style=\"\">  \t<strong>Why I Made This Course</strong>  </p>  <p style=\"\">  \t                                                    One of the reasons I made this social media marketing course that I often see entrepreneurs struggle with getting traffic and exposure from social media. In this course I explain why the common social media marketing strategy of posting of Facebook and Twitter is simply not enough. Instead, I show you how to create an amazing social media marketing strategy for your business by leveraging the full potential with social media and combining it with search, and other advanced topics.  </p>  <p style=\"\">  \t                                                     I hope you enjoy the course, and I think almost no matter what your previous marketing experience might be, there will be something new to learn in this course. I wish you best of luck with whatever you are promoting!  </p>  <p style=\"\">  \t  My goal is to help you succeed. Sign up for the course now, and give it a try. If you don't find the course or my help useful, there is no risk. The course comes with a 100% money back guarantee. I hope to see you on the inside.  </p>  <p style=\"\">  \t                                          +++++++++++++++++++++++++++++  </p>  <p style=\"\">  \t                                          MONEY BACK GUARANTEE  </p>  <p style=\"\">  \t<em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Advanced Social Media Marketing", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/187250_2864_3.jpg", 
    "course_url": "https://www.udemy.com/advanced-social-media-marketing-with-practical-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-23T11:46:06Z"
}