{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tAre You Sick and Tired of Wasting HOURS a Day on Facebook with NOTHING to show for it? Well Your Worries Will Disappear When You…  </p>  <p>  \t<strong style=\"\">Discover How to Use Facebook to</strong> <strong style=\"\">Create a Job-Replacing Income of </strong><strong style=\"\">$10,086.12 a Month…I</strong><strong style=\"\">n Just 5 </strong><strong style=\"\">Dead-Simple</strong><strong style=\"\"> Steps!</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \tAnd Best of All, This Course Can Have You Making Money in MINUTES!  </p>  <p>  \tDear Udemy User,  </p>  <p>  \tHi, my name is Anthony La Rocca and whether it’s your first time venturing into the world of internet marketing or you’re a grizzled veteran, <strong style=\"\">the job-replacing income strategies I’m about to offer you can change your life.</strong>  </p>  <p>  \tBold statement? Yes.  </p>  <p>  \tBut I stand by it.  </p>  <p>  \tHere’s why:  </p>  <p>  \tOver the past 3 years, I’ve made tens of thousands of dollars with Facebook. I’ve spent countless hours perfecting my money-making secrets, breaking down my own methods to study why they work so well, making small improvements to create the most efficient system possible, and molding all of this into…  </p>  <p>  \t<strong style=\"\">A Step-by-Step System that ANYONE Can Follow!</strong>  </p>  <p>  \tWhile I was developing and testing this course, I helped complete newbies make money on Facebook – people who had never made a dime online before <em style=\"\">I</em> got hold of them.  </p>  <p>  \tI was able to <em style=\"\">transform</em> them from broke, frustrated, and confused into <strong style=\"\">successful, confident, and wealthy</strong> marketers who now make thousands of dollars a month on Facebook… all on their own!  </p>  <p>  \tNow, after years of development and fine tuning, my best, most profitable Facebook secrets are finally ready to be released to the public.  </p>  <p>  \tBut before I let <em style=\"\">everyone</em> in on my secrets, I’m giving my fellow Udemy users (that’s you!) the chance to get them first!  </p>  <p>  \tUsing the exact same techniques, tricks, strategies, and foolproof system that I taught my students…  </p>  <p>  \t<strong style=\"\">Now YOU Can Create a Job-Replacing Income of $10,000+ a Month on Facebook!</strong>  </p>  <p>  \tAll you need to do is be able to follow step-by-step instructions.  </p>  <p>  \tCan you do that?  </p>  <p>  \tIf your answer is “yes,” then just keep reading…  </p>  <p>  \tFirst things first:  </p>  <p>  \t<strong style=\"\">Why Facebook?</strong>  </p>  <p>  \tFor starters, because the site has OVER ONE BILLION ACTIVE USERS! With that many people on ONE SITE, the marketing potential is INCREDIBLE! Think about how many different markets, niches, and sub-niches you have direct access to with that many people in a single place. It’s truly <em style=\"\">a marketing gold mine</em>!  </p>  <p>  \tYou can literally target just about any group of people you can think of. And hundreds of millions of highly-targeted prospects equals HUGE potential for MASSIVE PROFITS!  </p>  <p>  \tIt’s like Facebook is a huge apple orchard full of thousands of flowering trees, except in THIS orchard the trees don’t grow apples… they grow money – and YOU are the farmer who gets to pluck the bills right off the branches!  </p>  <p>  \tThe only catch is that you have to know how…  </p>  <p>  \tAnd that’s what I’m here to teach you!  </p>  <p>  \tFor me, Facebook has been the vehicle that has taken me from completely broke, frustrated, and confused to making <strong style=\"\">a full-time income of $10,000+ per month online </strong>that supports me as I travel the world and live life to the fullest.  </p>  <p>  \tAnd now that I’ve finally “made it,” I want to offer you the opportunity to make the same transformation I did.  </p>  <p>  \tThat’s why I’m proudly introducing…  </p>  <p>  \t<strong style=\"\">FACEBOOK MAYHEM</strong>  </p>  <p>  \t…the ultimate Facebook money-making solution!  </p>  <p>  \tWhat is Facebook Mayhem?  </p>  <p>  \t<strong style=\"\">Facebook Mayhem is a step-by-step blueprint that will</strong>  </p>  <p>  \t<strong style=\"\">take you by the hand and show you <em style=\"\">exactly</em> how to create a job-replacing income of $10,000+ a month…</strong>  </p>  <p>  \t<strong style=\"\">without money or experience!</strong>  </p>  <p>  \tThe course is made up of four high-quality video training modules available through a members-only website, which can be <strong style=\"\">accessed immediately</strong> and <strong style=\"\">at any time</strong> for your convenience.  </p>  <p>  \tHere’s what you get when you purchase Facebook Mayhem:  </p>  <p>  \t<strong style=\"\">Module #1 – The Group Grenade </strong>($27 Value)  </p>  <p>  \tTake cover! This little-known method leverages existing Facebook groups to get the money flying in your direction. Using this simple but often-overlooked strategy, you will learn how to <strong style=\"\">find out EXACTLY what people in Facebook groups </strong><strong style=\"\">already want</strong><strong style=\"\"> and are </strong><strong style=\"\">ready to spend money on</strong>, which you can then quickly and easily provide to them with a smile (as your fill your pockets with greenbacks!)  </p>  <p>  \t<strong style=\"\">Module #2 – Apparel Assault </strong>($37 Value)  </p>  <p>  \tUse this “weapon of business warfare” in your everyday Facebook battles to make <strong style=\"\">$943.72 in profit</strong> with only<strong style=\"\"> ONE HOUR</strong>’s worth of work using popular clothing items that you can design and sell within seconds!In fact, that’s exactly what I did last week using this exact method!  </p>  <p>  \t<strong style=\"\">Module #3 – The Flipping Minefield</strong> ($37 Value)  </p>  <p>  \tLearn how to turn a Facebook page into a “money-making machine” that you can either keep all for yourself or <strong style=\"\">sell for thousands of dollars!</strong> My most recent flip <strong style=\"\">sold for $4,000!</strong> Best of all, you can use this method over and over… just make money, rinse, and repeat!  </p>  <p>  \t<strong style=\"\">Module #4 – The Google Hangout Brigade</strong> ($47 Value)  </p>  <p>  \tDrive VIRAL TRAFFIC to your Facebook page with The Google Hangout Brigade! This innovative strategy uses Google Hangouts to grow to your Facebook page… but not in the way you would think! The <em style=\"\">normal</em> strategy involves promoting a Google Hangout that people can use to connect with others who share similar interests, but it doesn’t <em style=\"\">promote</em> your Facebook page at all. THIS strategy will not only help people in your niche connect with each other, but it will actually GROW the size of your Facebook group as well due to the viral traffic, which means <strong style=\"\">more targeted visitors</strong> for you to market to!  </p>  <p>  \tAs you can see, this is truly the only Facebook training course you will EVER need!  </p>  <p>  \tBut that’s not all…  </p>  <p>  \tNot only am I going to give you all my tested-in-the-real-world money-making Facebook strategies that will help you make crazy profits…  </p>  <p>  \tI’m ALSO going to throw in the following bonuses for you as well:  </p>  <p>  \t<strong style=\"\">BONUS #1 - Access to The Secret Inner Circle Bunker!</strong> ($197 Value)  </p>  <p>  \tWith your purchase of Facebook Mayhem, you get access to this PRIVATE Facebook group where myself and other successful internet marketers discuss a wide range of advanced methods to creating profit online. This is a POWERFUL opportunity to learn from and network with other marketers who are already “killing it” in this business! When you have access to this group you can: (1) Form profitable JV partnerships that can make you boatloads of money, (2) Meet other marketers who you can learn from and bounce ideas off of, (3) Make friends with people who do the same thing you do, giving you someone to talk to about marketing when nobody else around you seems to understand, and (4) Connect with “accountability buddies” to keep you on track and making money.  </p>  <p>  \tAnd let’s not forget bonus #2:  </p>  <p>  \t<strong style=\"\">BONUS #2 - Profit from Passionate Niches</strong> ($27 Value)  </p>  <p>  \tIn this video, infamous marketer Manny Hannif gives you everything you need to make boatloads of money from passionate niches. Watch over his shoulder as Manny pulls back the curtain on his “passionate niches” money-making Facebook strategies!  He uses one of his own Facebook pages to demonstrate his monetization strategies, AND he gives you the exact research and Facebook ads he uses to generate likes for PENNIES. His passionate fans literally buy everything he posts on his page, and he teaches you how to create the same passion in YOUR new fans!  </p>  <p>  \tWith all the value I’m giving you access to, buying this course is a no-brainer!  </p>  <p>  \tNow I’m sure you’re wondering how much “moolah” you’re going to have to fork over to get your hands on this money-making course… and I’ll tell you in just a second.  </p>  <p>  \tBut before I do, you should know that if I were to teach you everything in this course one-on-one, the cost would be in the thousands.  </p>  <p>  \tThat’s because my extensive knowledge about making money on Facebook allows me to charge my own clients $300 an hour for a private consultation, which I do…  </p>  <p>  \tAnd it’s worth it to them.  </p>  <p>  \tIf I were to teach you all the information in Facebook Mayhem one-on-one, it would cost you $300 an hour as well.  </p>  <p>  \tThe good news is that I don’t have to do that because everything you would learn from me is included in my Facebook Mayhem training course.  </p>  <p>  \tThis means you get the same information for <em style=\"\">hundreds of dollars less</em>!  </p>  <p>  \tAs for the fact that this course can literally help you make <strong style=\"\">THOUSANDS of dollars in PURE PROFIT</strong> over and over again, I could easily charge <strong style=\"\">$372</strong> for it, which is what it would cost if you purchased these four modules individually. After all, the chances are high that you would make that much money and <em style=\"\">much </em>more within just a short period of time.  </p>  <p>  \tIn fact, everything I know today about making money on Facebook took me years to learn… and cost me <strong style=\"\"><em style=\"\">over $25,000</em>!</strong>  </p>  <p>  \tPlus, I made a TON of mistakes along the way – mistakes that can easily be avoided by simply investing in Facebook Mayhem today.  </p>  <p>  \tSo like I said, for as much time and money as I’ve invested, I could easily charge <strong style=\"\">$372</strong> for this course.  </p>  <p>  \tBUT…  </p>  <p>  \tI’m not going to do that. Instead, I’m going to offer this amazing course to you at <strong style=\"\">a much lower price</strong>, and there are three reasons why, each equally important:  </p>  <p>  \t1. Because the course is delivered online through a members-only website, I don’t have the cost associated with a physical product that needs to be manufactured and shipped.  </p>  <p>  \t2. I don't have to personally do much extra work for each sale (instead, I’m hard at work providing<em style=\"\"> excellent</em> customer support), which means that I can afford to sell a couple hundred more copies of the course (which is what happens when you offer such <em style=\"\">incredible value</em> at such a <em style=\"\">ridiculously low price</em>!) and still have enough free time to do all my hobbies. And...  </p>  <p>  \t3. This is Udemy and if you’re reading this, you’re a Udemy user too. Therefore you get my special “brothers in arms” discount. I always look out for my people!  </p>  <p>  \tSo, instead of pricing Facebook Mayhem at $372, I’ve decided to offer it at the <strong style=\"\">INSANELY LOW PRICE OF</strong>…  </p>  <p>  \t<strong style=\"\">ONLY $47!</strong>  </p>  <p>  \tAm I crazy? Maybe so. But like I said, you are a udemy user, and because you are bravely taking charge of your financial life by buying this course, you deserve to be given incredible value.  </p>  <p>  \tAnd here’s the icing on the cake:  </p>  <p>  \tIncluded with your purchase is a…  </p>  <p>  \t<strong style=\"\">30-Day 100% Money-Back Guarantee!</strong>  </p>  <p>  \tSo if you take a look at this course and then decide it’s not for you, I won’t be offended.  </p>  <p>  \tIt’ll be your own choice to not make money on Facebook, and if you ask for a refund I will happily send you 100% of your money back, no questions asked.  </p>  <p>  \tBut I don’t think you’ll ask for a refund. After all…  </p>  <p>  \t<strong style=\"\">I’m about to show you how to create a job-replacing income that can support you for the rest of your life!</strong>  </p>  <p>  \tPlus, with my <strong style=\"\">30-Day 100% Money-Back Guarantee</strong>, not only do you have 30 days to check out the course to see that it’s everything I promised and more, but you can even <em style=\"\">be making money before the return period is up!</em> If the information you learned in the course hasn’t made you money by then, you can still get a full 100% refund.  </p>  <p>  \tLet’s review what you get when you purchase this course today:  </p>  <p>  \t<strong style=\"\">Module #1 – The Group Grenade </strong>($27 Value)  </p>  <p>  \tFind out EXACTLY what people in Facebook groups already want and are ready to spend money on, which you can then quickly and easily provide to them with a smile (as your fill your pockets with greenbacks!)  </p>  <p>  \t<strong style=\"\">Module #2 – Apparel Assault </strong>($37 Value)  </p>  <p>  \tCreate thousands of dollars in profit using popular clothing items that you can design and sell within seconds!  </p>  <p>  \t<strong style=\"\">Module #3 – The Flipping Minefield</strong> ($37 Value)  </p>  <p>  \tCreate, build, and sell Facebook groups for thousands of dollars using an easy-to-follow method that can be used over and over again… just make money, rinse, and repeat!  </p>  <p>  \t<strong style=\"\">Module #4 – The Google Hangout Brigade</strong> ($47 Value)  </p>  <p>  \tUse Google Hangouts to send VIRAL TRAFFIC to your Facebook groups to grow them to incredible sizes! Then keep the group and make money off it yourself or flip it for thousands of dollars profit!  </p>  <p>  \t<strong style=\"\">BONUS #1: Access to The Secret Inner Circle Bunker!</strong> ($197 Value)  </p>  <p>  \tMy PRIVATE Facebook group! When you have access to this group you can: (1) Form profitable JV partnerships that can make you boatloads of money, (2) Meet other marketers who you can learn from and bounce ideas off of, (3) Make friends with people who do the same thing you do, giving you someone to talk to about marketing when nobody else around you seems to understand, and (4) Connect with “accountability buddies” to keep you on track and making money.  </p>  <p>  \tAND…  </p>  <p>  \t<strong style=\"\">BONUS #2: Profit from Passionate Niches</strong> ($27 value)  </p>  <p>  \tMake boatloads of money using Manny Hannif’s “passionate niches” strategies. He gives you his BEST monetization strategies AND the exact research and Facebook ads he uses to generate likes for PENNIES. His passionate fans literally buy everything he posts on his page, and he teaches you how to create the same passion in YOUR new fans!  </p>  <p>  \tHow much is all of this worth? When you add it all up, the total price tag comes to…  </p>  <p>  \t<strong style=\"\">$372</strong>  </p>  <p>  \tBut as a Udemy user, YOU get $372 worth of value for…  </p>  <p>  \t<strong style=\"\">ONLY $47!</strong>  </p>  <p>  \tNot only that, but you also get my…  </p>  <p>  \t<strong style=\"\">30-Day 100% Money-Back Guarantee!</strong>  </p>  <p>  \tIf, for ANY reason, you don’t like Facebook Mayhem and all the money-making secrets it gives you, simply let me know and I will return 100% of your money quickly and with a smile – <strong style=\"\">there’s no risk whatsoever!</strong>  </p>  <p>  \tSo now you have a decision to make…  </p>  <p>  \tYou can either ignore this offer, miss out on this opportunity and stay in the same place you are now, always staring at the orchard of money trees from behind the fence without ever  being able to get inside and pick the hundred dollar bills right off the branches…  </p>  <p>  \tOR…  </p>  <p>  \tYou can learn how to quickly and easily create <strong style=\"\">MASSIVE PROFIT </strong>from Facebook starting TODAY… and never have to worry about bills again!  </p>  <p>  \tSo if you’re ready to make <strong style=\"\">thousands of dollars every month</strong>… if you’re ready to <strong style=\"\">create a job-replacing income</strong>… if you’re ready to truly <strong style=\"\">take charge of your life</strong>…  </p>  <p>  \tThen make the <strong style=\"\">smart choice</strong> and buy this course now!  </p>  <p>  \tSee you on the inside!  </p>  <p>  \tSincerely,  </p>  <p>  \tAnthony La Rocca  </p>  <p>  \tP.S. Don’t miss out on $372 worth of information for only $47 – this amazing offer will only be available for <strong style=\"\">7 DAYS!</strong> After that you’ll never be able to get this information at that low price again!  </p>  <p>  \tP.P.S. What will happen if you don’t take charge of your financial life today? Chances are you’ll keep wasting your life away behind a desk at a job you don’t like until you’re too old and decrepit to work. (And THEN what will you do?) But if you take action and pick up your copy of Facebook Mayhem right now, you can gain financial freedom and peace of mind… and you won’t have to report to the office or worry about where your next paycheck is coming from ever again!  </p>", 
    "end_date": null, 
    "title": "All Level’s Guide to Building a Business with Facebook", 
    "price": "20.00", 
    "instructors": "Anthony Rocca", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/91370_bc16_5.jpg", 
    "course_url": "https://www.udemy.com/all-levels-guide-to-building-a-business-with-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-12T04:05:51Z"
}