{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<span style=\" color:inherit;\">This course is for creative entrepreneurs, small businesses and bloggers. Instagram plays a vital role in creative business and I will show you EVERYTHING you need to know to be a INSTAGRAM SUPERSTAR! I will give you an exact how-to guide on how I built my following by the THOUSANDS in just a few months. You will learn how to create quality content, use that content to engage with your audience and build your following FAST! I will provide you with foundational building blocks to succeed at attracting the right audience, driving traffic to your site and making you more sales through your Instagram account. My goal is that you find your own voice and speak it loud using this awesome social media outlet. In this course you will learn: </span>  </p>  <h4 style=\"\"><strong style=\"\">INSTA BASICS:</strong></h4>  <h6 style=\"\">1. Create a compelling profile - your FIRST impression!</h6>  <h6 style=\"\">2. Brand your Instagram through edits, colors and hashtags</h6>  <h6 style=\"\">3. Create a style guide for your brand and instagram account</h6>  <h6 style=\"\">4. How to clearly show your skills/product in the BEST possible light</h6>  <h6 style=\"\">5. Create a unique hashtag for your biz/brand</h6>  <h4 style=\"\"><strong style=\"\">INSTA CONTENT:</strong></h4>  <h6 style=\"\">1. What your audience wants to see (I will show you specifics!)</h6>  <h6 style=\"\">2. How to create a successful series</h6>  <h6 style=\"\">3. How to get big brands to repost your content which = +++FOLLOWERS!</h6>  <h6 style=\"\">4. My rules on how to make your photos THE BEST</h6>  <h6 style=\"\">5. Plan ahead for your content and schedule</h6>  <h6 style=\"\">6. My suggested APPS - for quotes, text overlays, and other fun stuff!</h6>  <h6 style=\"\">7. How to edit these photos</h6>  <h6 style=\"\">8. What, when, and how often to post - (this is an important one!)</h6>  <h6 style=\"\">9. Peak times to post your content</h6>  <h4 style=\"\"><strong style=\"\">AUDIENCE ENGAGEMENT &amp; HASHTAGS:</strong></h4>  <h6 style=\"\">1. My hashtag rules!</h6>  <h6 style=\"\">2. How to create post descriptions that will increase your engagement</h6>  <h6 style=\"\">3. How to get your audience to engage with you</h6>  <h6 style=\"\">4. How to properly regram - and it&#039;s not what you think!</h6>  <h4 style=\"\"><strong style=\"\">GET A FOLLOWING:</strong></h4>  <h6 style=\"\">1. Shh! My secret formula (that&#039;s pretty much all I can say right now) </h6>  <h6 style=\"\">2. Following to follower ratio </h6>  <h6 style=\"\">3. My suggested app for tracking your following</h6>  <h6 style=\"\">4. Reading your stats</h6>  <h4 style=\"\"><strong style=\"\">INSTA GIVEAWAYS:</strong></h4>  <h6 style=\"\">1. How to use giveaways to create buzz for your biz/brand</h6>  <h6 style=\"\">2. My specific DO&#039;S &amp; DON&#039;TS of a successful giveaway</h6>  <h6 style=\"\">3. Learn from my giveaway failures, but most importantly successes</h6>  <p style=\"\">  \t  This course includes fun videos and slideshows. There will be tons of information so I promise to keep it exciting by including an occasional DANCE BREAK along the way. I have provided a course outline to follow along during the class. You will need a smartphone and the Instagram app for this course. I will show you everything else from A to Z.  </p>  <p style=\"\">  \t  The course itself is under an hour but you may need more time with each lesson as I cover tons of information.  </p>", 
    "end_date": null, 
    "title": "All you need to know to grow your Instagram following fast!", 
    "price": "20.00", 
    "instructors": "Jessica Safko", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343428_b55c_6.jpg", 
    "course_url": "https://www.udemy.com/insta-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-14T01:50:27Z"
}