{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t According to <strong style=\"\">businessinsider.com</strong>, well over <strong style=\"\">1 billion people are using Facebook</strong> as of 2014. In terms of market share, <strong style=\"\">67% of all Internet users in the U.S. use Facebook </strong>frequently. Now in the <strong style=\"\">European markets, more than 82%</strong> of Internet users use Facebook.<br style=\"\">  \t <br style=\"\">  \t Also, among U.S. Facebook users, 73% have incomes well above $75,000, compared to 17% who are on Twitter and 13% who are on Pinterest.<br style=\"\">  \t <br style=\"\">  \t Isn’t that amazing? Think about it carefully.<br style=\"\">  \t <br style=\"\">  \t If you’re not reaching the Facebook crowd, then you’re leaving money on the table.<br style=\"\">  \t <br style=\"\">  \t Imagine being able to reach more people across the globe without ever leaving your house, target specific audiences that fit your demographics, build brand awareness, generate leads, and more.<br style=\"\">  \t <br style=\"\">  \t The key is to understand what your objective is and use the correct ad type to achieve the end result.<br style=\"\">  \t <br style=\"\">  \t Fortunately with Facebook, it’s not that hard to setup an ad campaign. You can setup a campaign in a matter of minutes, get it approved, and start receiving extremely targeted traffic.<br style=\"\">  \t <br style=\"\">  \t More than enough to turn that Facebook page of yours from zero to hero, using our proactive and practical approach backed up with real life examples. <br style=\"\">  \t <br style=\"\">  \t Good luck and we hope you enjoy our course!  </p>", 
    "end_date": null, 
    "title": "All about Facebook Marketing In The Lab For Success", 
    "price": 0, 
    "instructors": "Sevdalin Stoyanov", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236332_aab3_3.jpg", 
    "course_url": "https://www.udemy.com/learning-the-secrets-of-facebook-traffic-to-selling-anything/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-03T12:22:53Z"
}