{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Retargeting is now a widely used advertising tool by the marketing industry. It's reputation has grown recently and is now a process which gives higher ROI's to marketers.</p>\n\n\n\n<p>“The biggest advantage of retargeting is that you’re only showing your ad to people who are genuinely interested in your product.”</p>\n\n\n\n\n\n<p>Retargeting is the process of tagging your website visitors with ads tailored to their level of interest in your products or your brand. In very simple terms it is like converting window shoppers to customers.<br></p>\n\n<p>Facebook is the best platform for retargeting ads just for one reason – that’s because most Internet users are on Facebook on a daily basis and that too for considerable lengths of time. So a person who visited a website or searched for a product online will definitely be on Facebook after a while.<br></p>\n\n\n\n\n\n<p>Marketers focus advertisements on those who are already aware of the brand. They use tailor made ads based on varying needs of these visitors to convert them to customers. <br></p>\n\n\n\n\n\n<p>Retargeting has also proven to be an efficient way to generate a higher conversion rate from online ads simply because higher brand exposure generates more sales.</p>\n\n\n\n\n\n<p>I hope that this course will give you basic knowledge on retargeting on Facebook. </p>\n\n\n\n\n\n<p>Please convey your suggestions and comments on the course through the Udemy messaging system.</p>", 
    "end_date": null, 
    "title": "Basics of Facebook Retargeting", 
    "price": 0, 
    "instructors": "Girijan Raghavan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/803700_2eb9_2.jpg", 
    "course_url": "https://www.udemy.com/basics-of-facebook-retargeting/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-25T11:45:16Z"
}