{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The social media landscape changes every 6 months, and the smartphone is only accelerating this change. Don't blindly follow the latest social media fads and gurus to guide your social media strategy.  Fortunately there is a ton of engagement data around what people are doing on your site (Google Analytics) and social platforms/profiles (Facebook Insights and other native analytics platforms). Learn to look at your organization's own data to see what is driving real value. If your organization can gather, analyze, and act on its data it will be ready to jump on the next trend in a way that drives real impact.</p>\n<p>We’ll start with the 5 truths that apply to all social media platforms. Then, we’ll walk you through the “Big Three” platforms: Youtube, Facebook, and Twitter. For each, you’ll learn:</p><ul><li>What are the basics? How does this platform work?</li><li>Insight into the backend: understand the platform in order to optimize your strategy</li><li>Advanced tips to boost your engagement</li><li>Case studies: steal ideas from other organizations that are effectively using the platform</li></ul>\n<p>We’ll answer the age-old question: how to be human on social media. You’ll learn how to: </p><ul><li>Be healthy on social media</li><li>Go where your audience is</li><li>Build relationships</li><li>Be interesting!</li></ul>\n<p>Lastly, we’ll dive into how to use data to enhance your approach. You’ll see walkthroughs and insights from:</p><ul><li>Youtube Analytics</li><li>Facebook Insights</li><li>Twitter Analytics</li><li>Google Analytics</li><li>Other external social media tools</li></ul>\n<p>which will teach you how to use each platform to find insights about your users and turn those insights into action. We’ll give you strategies to engage your whole team in the process and begin to build a Data Culture at your organization! </p>", 
    "end_date": null, 
    "title": "Be Your Own Social Media Guru", 
    "price": "50.00", 
    "instructors": "Whole Whale University", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783530_11e8.jpg", 
    "course_url": "https://www.udemy.com/be-your-own-social-media-guru/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T23:12:53Z"
}