{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tCreate your blog at the best venues: Wordpress and Blogger. Designed for authors, learn how to engage readers interested in your subjects. It's fun and easy.  </p>  <p>  \t                                    We'll put the <strong>power of blogs</strong> to work for you. Save time and money with a blog that attracts more readers to your books.  </p>  <p>  \t<em>Reach Readers Around the World through Blogging.</em></p>  <p>Perfect for beginners, also designed for intermediates who want to do it better.</p>  <p>  \t                            Everything from choosing a domain name to posting and sharing with social media. We'll blog in a schedule that fits yours as a stress-free way to assist your writing career.  </p>  <p>  \t                                    And the best part is that <strong>blogs can be made free of charge</strong>. Of course you can spend wisely on a custom domain name, premium template or hosting if you want, but that's not required. <em>Any author on any budget</em> can follow this program, and we'll use free examples with Wordpress (dot) com and Blogger. The lessons will also apply to Wordpress (dot) org templates or blogs hosted elsewhere.  </p>  <p>The course is taught by Jason Matthews, bestselling author and self-publishing expert. At the end of this course you'll have a great blog on Wordpress, Blogger or another site. You'll have a powerful means for online success at your fingertips.  </p>  <p>  \t          And as a bonus, you can have your blog featured on mine to spread the word.  </p>  <p>  \t                <em>Get started today and build your audience.</em></p>", 
    "end_date": null, 
    "title": "Blogging for Authors: Writing Blogs on Wordpress or Blogger", 
    "price": "25.00", 
    "instructors": "Jason Matthews", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315190_ee1d.jpg", 
    "course_url": "https://www.udemy.com/blogging-for-authors/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T17:18:08Z"
}