{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>What students can expect to learn:</p><ul><li> How To Rank Pages Better in Search Results on average</li><li>How To Rank Sites on Googles First Page</li><li> Learn the important factors in SEO optimization</li><li>Learn How To Optimize Title Keywords</li><li> How to improve Search ranking results</li><li><span></span>How to acquire backlinks without getting penalized by Google</li><li> How to use Google Webmaster Tool and other SEO tools</li><li> Brief overview of how to use a Facebook Campaign for SEO</li><li> How to get link juice from forum and blog comments</li><li>How to rank Youtube videos to rank higher</li><li>Learn Which Sites Help Improve SEO For Backlinking</li><li>Learn Where to use H1 Tags</li><li>Learn Which Wordpress Plugins Improve SEO</li><li>How to submit Site Map to Google, Yahoo, and Bing for better SEO</li><li>Learn How to optimize Meta Data for SEO</li></ul><p>This course is for anyone needing help improving their search results both Google and Youtube. All White hat strategies.  These tips will not get you penalized by Google.</p><p><strong>Are you tired of being buried in millions of links online in Search Results?</strong></p><p>Let me show you how to get recognized online without spending your bank account!!</p><p>It's very possible with a few hours work and a bit of knowledge we can have you ranking much better.  Regardless how good the content unless you know how to get it ranking higher it will never be seen.</p><p>How to Rank #1 on <strong>Google and Youtube</strong> searches!!!</p><p><strong>Rank on Google Page #1</strong></p><p>Ranking Videos can be much easier in most cases.  So we will show you that technique in this course too.  It's not rocket science but it does require a few strategies applied the correct way.</p><p>Once you start ranking higher you will have higher sales and much more Google <strong>Adsense</strong> revenue.</p><p>Our course content is backed by a <strong>thirty day money back guarantee</strong>.  What do you have to lose?  You have only to gain.</p>", 
    "end_date": null, 
    "title": "Business & Website Promotion: SEO Tactics for Beginners", 
    "price": "20.00", 
    "instructors": "Mitch Stevens", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503860_ae5a_3.jpg", 
    "course_url": "https://www.udemy.com/complete-seo-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-16T16:00:51Z"
}