{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>LinkedIn Marketers, look no further. This course will teach you the secrets to developing a successful LinkedIn marketing strategy for yourself or your company. We'll teach you about our 50 top secret marketing strategies so you can optimize your social presence and succeed in marketing your personal or corporate brand online! LinkedIn has so much to offer and many don't know how to make it work for them. Don't worry--we will show you how to become an expert on all things LinkedIn and ensure that you are able to hit the ground running! Our proven methods have helped us grow our own profiles by 300% the amount of connections! We'll show you the ropes and all of the insider tips to make your profile stand out--and get the best connections to help you meet your goals! In this hour long course you will understand how optimizing drives you FREE SEO traffic from Google to your LinkedIn profile pages, and can easily earn you thousands of dollars for your business and priceless contacts! Also, we'll coach you on how you can become an expert contributor in the LinkedIn community by helping others answer difficult questions that you already know the answers to. Build your reputation on LinkedIn with this course in less than 30 minutes a week! Go ahead and join us to get started! Also, look for our bonus download at the end of the course--it's FREE and will make following our easy to learn guide even easier.</p>", 
    "end_date": null, 
    "title": "Classified Secrets to LinkedIn Marketing and Optimization", 
    "price": "20.00", 
    "instructors": "Brandon F", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794396_815b_2.jpg", 
    "course_url": "https://www.udemy.com/marketingcoach-linkedin-marketing-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T04:03:44Z"
}