{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Te damos la bienvenida a Community Manager ¡Fácil!</p><p style=\"\">Como puedes ver día a día cada vez tienen más relevancia las redes sociales dentro de nuestra sociedad, cualquier evento relevante tiene aún mayor repercusión en las redes sociales, las noticias ya las vivimos en tiempo real, las grandes multinacionales están empezando a enfocar gran parte de sus presupuestos de marketing en sus campañas de social media, y lo que es más importante, es un medio donde un pequeño negocio o empresa puede llegar a alcanzar grandes cuotas de reputación y con ello conseguir dar un gran empuje a nuestros objetivos empresariales.</p><p style=\"\">Con un buen plan de social media, todo tipo de profesionales tienen cabida en las redes sociales, desde abogados, periodistas, pintores, profesores, emprendedores, sea cual sea tu negocio, y comenzando desde cero, sin tener conocimientos previos, conocerás a fondo las más importantes redes sociales, serás capaz de crear contenido de calidad que te proporcione la posibilidad de crear una legión de seguidores que con un correcto trato y moderación en los comentarios puedes llegar a convertir en clientes.</p><p style=\"\">Podrás disfrutar del curso de forma muy amena con vídeos prácticos de corta duración que nunca llegarán a agobiarte, pudiendo avanzar de forma significativa haciendo las prácticas incluso ya con tu proyecto.</p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Community manager, ¡Fácil!", 
    "price": "20.00", 
    "instructors": "David Piqué Garcia", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464800_acc7.jpg", 
    "course_url": "https://www.udemy.com/community-manager-facil/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T08:30:26Z"
}