{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Lo explicado en los últimos videos ya no funciona por lo que este curso te servirá si quieres aprender a crear una página de Facebook y aprender cómo funcionan los anuncios en Facebook Ads.</p>\n\n<p><br></p>\n\n<p>  \t    Con este curso aprenderás a crear públicos personalizados con fans de tu competencia o miembros de grupos en torno a determinados intereses. Lo que supone ir un paso más allá y sacar verdadero partido a las campañas de Facebook.  </p>\n\n<p>  \t<strong>Tus anuncios se mostrarán solo a personas que han mostrado interés por tu temática o por productos de la competencia. </strong>  </p>\n\n\n\n<p>  \t    Objetivos:  </p>\n\n\n\n<ul>  \t<li><strong></strong>Conocer Facebook para los negocios</li>  \t<li>Saber cómo crear y utilizar tu Fanpage</li>  \t<li>Comprender la publicidad en Facebook</li>  \t<li>Descubrir cómo capturar fans de la competencia o de grupos</li>  \t<li>Aprender cómo automatizar el proceso</li>  </ul>\n\n\n\n<p>  \t<strong>Harás publicidad como un profesional con menos presupuesto.</strong>  </p>\n\n\n\n<p>  \t  Si pensamos en Facebook como un sitio donde obtener tráfico gratuito acabaremos decepcionados porque cada vez se logra menos visibilidad con las publicaciones.  </p>\n\n\n\n<p>  \t  Sin embargo, si pensamos en las ventajas de la segmentación que podemos lograr en Facebook Ads, nos damos cuenta de que podemos llegar a nuestro target de una manera muy directa y económica. Sólo necesitamos saber hacerlo bien y este curso te ayudará en ese aspecto.  </p>\n\n\n\n<p>  \t<strong>Contenidos y enfoque del curso</strong>  </p>\n\n\n\n<p>  \t  El curso está dirigido tanto a gente que no dispone de conocimientos previos sobre Facebook para negocios, como a aquellos que ya tienen página en Facebook y ya han probado a hacer publicidad en Facebook.  </p>\n\n\n\n<p>  \t  Se empieza por lo básico y se va avanzando de un modo totalmente práctico y paso a paso, hasta llegar a configurar una campaña con el público personalizado extraído de una fanpage de la competencia.  </p>\n\n\n\n<p>  \t  Como extra, en el último apartado del curso se explican los pasos para realizar una campaña de Remarketing en Facebook.  </p>", 
    "end_date": null, 
    "title": "Crea tu página de Facebook y gana fans", 
    "price": 0, 
    "instructors": "Jose Rodenas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370686_dee7_7.jpg", 
    "course_url": "https://www.udemy.com/como-robar-fans-a-tu-competencia/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T20:02:23Z"
}