{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you have a freelance business and feel you are constantly marketing for new clients?</p>  <p>If you run a freelancing business it may seem that you spend as much time marketing your service as actually doing freelance work. But marketing is part of the freelancing game. One of the methods of marketing is with Facebook. Have you tried Facebook before?</p>  <p>With over 1.5 billion people and a global reach, there is potential for a market to be found. Nearly every need, requirement, or desire by people is discussed and covered within Facebook. But the numbers can be overwhelming. It is easy to get lost in the largest social network.</p>  <p>But success is possible if you find the right way. You must present yourself and engage for your business to stand out. The first step is setting up a Facebook page that reflects you and your business. This course can help you in building your page. </p>  <p>Section One covers getting started with Facebook</p>  <p>Section Two goes over selecting the correct page for your business</p>  <p>Section Three is looks at selecting the right target audience you wish to provide service to</p>  <p>Section Four is about the importance of a cover photo to make a first impression</p>  <p>Section Five talks about the importance of being social on this massive social network</p>  <p>Section Six looks at the importance on engagement</p>  <p>Section Seven discusses setting up your marketing strategy</p>  <p>A great first step in success with Facebook marketing is the right page for your services. This course will help you create one to help turn likes into customers.    </p>", 
    "end_date": null, 
    "title": "Create A Facebook Page For Your Freelance Business", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/742090_1516.jpg", 
    "course_url": "https://www.udemy.com/create-a-facebook-page-for-your-freelance-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T11:34:54Z"
}