{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>LinkedIn is the worlds largest trusted online network of professionals. With over 200 million users, LinkedIn provides users with a powerful forum to promote their experience and skills, locate and engage with like minded people.</p><p>Over a 25 year career, I have learned the importance of representing myself professionally. And now with a LinkedIn profile with over 1,500 connections, I have connected with countless number of new organisations, groups and individuals with whom I have exchanged opinions and completed commercial transactions.</p><p>Through this course, I share the techniques and tips I have learned, saving you a heap of time! The outcome will be guiding you to an awesome professional profile.</p><p>The course is structured in 3 stages:</p><p></p><ol><li><span>Create an Awesome Profile</span></li><li><span>Expand your Online Network</span></li><li><span>Market your Skills and Experience</span></li></ol><p></p><p>The 3 sections delivered via video lectures and downloadable reference tools will take appropriately 1 hour to complete.</p><p><em>&quot;Steve provided expert advice which lead to a much improved profile for me, with many more searches and contacts being made, even before I had followed out all his instructions. I would highly recommend Steve&#039;s services.&quot; - Charles, Sydney<br></em></p><p><br></p>\r\n", 
    "end_date": null, 
    "title": "Create or Optimise a Professional LinkedIn Profile", 
    "price": "20.00", 
    "instructors": "Stephen Novacek", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/70954_f57b_5.jpg", 
    "course_url": "https://www.udemy.com/create-or-optimise-a-professional-linkedin-profile/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-29T04:03:21Z"
}