{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>CURSO CRIATIVIDADE PARA REDAÇÃO WEB - VÍDEO AULA</strong></p><p>O Curso de Criatividade para Redação Web te mostra o caminho para produzir um conteúdo de qualidade de inovador para seus leitores. <br></p><p>Você aprenderá as principais técnicas para a elaborar uma redação atrativa, buscando gerar maior audiência e conquistar a fidelidade dos leitores de seu site ou blog.</p><p>A abordagem estratégica de SEO será ensinada de modo a estruturar um plano para otimizar seu tráfego orgânico, </p><p><strong><br></strong></p><p><strong>Objetivos:</strong></p><ul><li>Aprimorar a qualidade da redação web</li><li>Performar melhor seus conteúdos</li><li>Entender quem são os leitores</li><li>Conhecer truques que resultaram em um numero maior de conversões</li></ul><p><strong><br></strong></p><p><strong>Duração:</strong></p><p>O Curso Criatividade para Redação Web em vídeo aulas tem carga horária total de 60 minutos.</p><p><br></p><p><strong>Público Alvo:</strong></p><p>O curso Criatividade para Redação Web  destina-se a estudantes e profissionais de qualquer área do conhecimento que queiram aprender todas técnicas necessárias para elaborar uma boa redação na web.</p><p><strong><br></strong></p><p><strong>Professor:</strong></p><p>Liliane Ferrari é Jornalista, pós-graduada em Filosofia e História da Arte, apontada como uma das 10 mulheres mais influentes da internet brasileira pelo iG.</p><p><br></p><p><strong>Conteúdo Programático:</strong></p><ul><li>Introdução </li><li>Comportamento dos Leitores </li><li>Fórmula Chave </li><li>Dicas para melhorar os textos </li><li>SEO </li><li>SEO: Exemplos </li><li>Hipertexto </li><li>Hashtag </li><li>Conselhos Finais</li></ul><p><strong><br></strong></p><p><strong>Por que escolher a ComSchool?</strong></p><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas</li>", 
    "end_date": null, 
    "title": "Criatividade para Redação Web", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725582_5190_3.jpg", 
    "course_url": "https://www.udemy.com/criatividade-para-redacao-web-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T14:10:19Z"
}