{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Sin lugar a dudas, <strong style=\"\">Linkedin</strong> es la red social más infrautilizada de Internet. Sin embargo, su potencial para las empresas y marcas es inmenso. En Linkedin no sólo es posible crear un perfil empresarial; -una página equivalente a la página de fans de Facebook  , sino que podemos promocionar de forma totalmente gratuita, todos nuestros productos y servicios.  Con una página de empresa en Linkedin podemos destacar entre nuestros competidores, podemos conectar con nuestros clientes y crear nuevas relaciones profesionales de alto nivel, entre otros muchos beneficios. </p><p>Linkedin nos permite además posicionarnos como <strong style=\"\">expertos</strong> de nuestro sector, ofertar nuestos servicios, promocionar nuestros contenidos y generar <strong style=\"\">marca personal</strong>.</p><p>Aprenda con este curso práctico en vídeo de Linkedin para empresas cómo crear perfiles perfectos para potenciar su marca y también páginas optimizadas para su empresa en la red social profesional número uno en el mundo.</p><p>¡Curso único en su género!</p><p></p><p><strong style=\"\">Contenidos del curso:</strong></p><p>- Optimización de perfiles de Linkedin</p><p>- Cómo crear páginas de empresa optimizadas en Linkedin</p><p>- Cómo añadir productos y servicios en Linkedin de forma gratuita.</p><p>- Cómo recomendar nuestros productos y servicios en Linkedin</p><p>- Cómo crear un grupo en Linkedin</p><p>- Cómo realizar encuestas o sondeos</p><p>- Cómo conseguir más seguidores para nuestra página de empresa</p><p>- Cómo anunciarse en Linkedin</p><p>- Cómo publicar ofertas de empleo</p><p>- Cómo promocionar nuestros contenidos en Linkedin</p><p>- Cómo publicar de forma automatizada en Linkedin</p><p>- Plugins sociales de Linkedin</p><p>- SEO para Linkedin</p><p>- Recursos educativos gratuitos adicionales.</p>", 
    "end_date": null, 
    "title": "Curso Linkedin para empresas - Marketing en Linkedin", 
    "price": "20.00", 
    "instructors": "Juan Jose Ramos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28716_b29b_3.jpg", 
    "course_url": "https://www.udemy.com/curso-marketing-en-linkedin/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-05T19:34:41Z"
}