{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>Curso actualizado una vez más el día 28 de Septiembre de 2015</em></p><p><em><em><strong>Por promoción este curso se ofrece gratuito. A partir del 1ero de Octubre, el precio pasará a ser de $9.</strong></em><strong></strong></em></p><p><em>Este curso se ofrece con 30 días de garantía, s<em><em><em>i no estás 100% satisfecho <em><em><em>te reembolsaremos tu dinero</em></em></em></em></em></em>. Sin preguntas. <br></em></p><p><strong>¡ÚNETE A MÁS DE 1000 ALUMNOS QUE YA ESTAN HACIENDO CRECER A SU NEGOCIO PINEANDO!<br></strong></p><p><strong>======================================================================================</strong></p><p>¡Aprende a dirigir tráfico de Pinterest hacia tu página web, blog, canal de YouTube o a dónde quieras!  <strong></strong></p>  <p><strong>  \t                   =======================================================================================</strong>  </p>  <p>  \t                   Bienvenidos a mi curso <strong>\"Como usar Pinterest para hacer crecer tu negocio.\"</strong> Este es un curso fácil y divertido  </p>  <p>  \t<strong>  ¿Qué vas a aprender en este curso?  </strong>  </p>  <p>» Al inscribirte a este curso, tendrás acceso ilimitado a más de 2 horas y 18 clases de contenido a tu alcance siempre que quieras.</p><p><span></span>» A generar tráfico hacia tu página desde Pinterest</p><p>» A usar palabras claves y títulos relevantes</p><p>» De dónde sacas las fotos?</p><p>» A abrir y a pegar tu primer anuncio.</p><p>» Todo esto y mucho mas en tu propio idioma</p><p><strong>TESTIMONIALES</strong></p><p>» \"<em>Oradora carismática y de enseñanza práctica</em>.\" Rodrigo G.</p><p>»<span> \"<em>Esta muy bien explicado, la instructora es muy natural, encanta su estilo y forma de explicar</em>.\" Alberto T.</span></p><p><span>»<span> \"</span></span><em>Muy interesante el curso. </em><em>Gracias por compartir tus conocimientos, en realidad no me imaginaba que Pinterest sirviera para mi emprendimiento online, gracias</em>.\" Jorge L.</p><p>» \"<em>Un curso práctico y de utilidad</em>.\" Gonzalo</p><p>» \"<em>Muy buen curso. </em><em>Muchos tips, te ayuda a dimensionar nuevas estrategias para atraer tráfico a tu sitio web y otros que quieras. Muy recomendado</em>.\" Desarrollador F.</p><p><strong>================ ¿NO CREES QUE YA VA SIENDO HORA DE PASAR A LA ACCIÓN? ================<br></strong></p><p>» Inscríbete ahora y accede al contenido sin límites desde cualquier parte del mundo.<br></p><p>» Un curso en español adaptado a tus necesidades, impartido de manera amena y pensado para todos los niveles. Aprender nunca antes ha sido tan fácil.</p><p>» Además, te garantizo la devolución de tu inversión en 30 días si no quedas satisfecho con los contenidos del curso. ¡No tienes nada que perder!</p><p><strong>¿Cuáles son los requisitos?</strong><br></p><p>Tan sólo necesitas:</p><p>» Una computadora ó laptop con acceso a Internet.</p><p>» Lápiz y papel para que no se te escape ningún consejo.</p><p><strong>================================= ¡TOMA ESTE CURSO YA! =================================</strong></p>", 
    "end_date": null, 
    "title": "Cómo usar Pinterest para aumentar las ventas de tu negocio", 
    "price": "20.00", 
    "instructors": "Priscilla P. Wood", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/275678_a7a4_4.jpg", 
    "course_url": "https://www.udemy.com/como-usar-pinterest-para-hacer-crecer-tu-negocio/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-06T02:22:47Z"
}