{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>¿</strong><strong>Qué vas a aprender en este curso?</strong></p>  <p>En este curso vas a conocer algunos fundamentos básicos en el uso de Facebook para promocionar y vender productos de tu pequeño negocio como son:  </p><ul><li>La creación de una página de negocio local en Facebook</li><li>La planificación y creación de campañas de publicidad en Facebook </li><li>El seguimiento y análisis de los resultados de estas campañas.</li></ul>  <p><strong>¿A quién está dirigido este curso?</strong></p>  <p>Este curso está destinado a personas que tienen un pequeño negocio y quieren aprovechar las posibilidades que ofrece Facebook para promocionar sus productos y su marca a través de anuncios en Facebook. El curso está pensado en especial para dueños de negocios que venden productos reales  (si, de esos que te traen los servicios de mensajería),</p>  <p>Está destinado a principiantes que tengan un manejo y conocimientos básicos de usuario en Facebook y ganas de aprender a moverse por el administrador de anuncios de Facebook (Facebook Ads) para vender sus productos a nuevos clientes.</p><p><strong>¿Qué nivel de especialización ofrece este curso?</strong></p><p>Este curso es para principiantes y por tanto transmite conocimientos muy básicos con un lenguaje llano sin muchos tecnicismos. Presupone una cierta soltura con el manejo de redes sociales e internet a nivel de usuario.</p><p>El curso contiene en algunas clases partes generalistas y bastante básicas sobre los fundamentos de facebook.</p>  <p><strong>¿Qué necesitas para poder seguir y aprovechar este curso?</strong></p>  <ul><li>Cuenta personal en Facebook</li><li>Conexión a internet</li></ul>    <p><strong>¿Cómo está estructurado el curso?</strong><br></p><p>Este curso está estructurado en secciones y capítulos que contienen teoría y práctica. Se trata de un curso vivo, que crecerá gradualmente con nuevos capítulos, actualizaciones de material y recursos, adaptándose a los cambios tanto en Facebook como en la dinámica del curso. </p><p>Por tanto va a estar acompañado de una parte práctica cada vez más amplia a medida que el curso evoluciona.<br></p>", 
    "end_date": null, 
    "title": "Cómo aprovechar Facebook para tu pequeño negocio", 
    "price": "20.00", 
    "instructors": "Cristina Vidal", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725726_803f_6.jpg", 
    "course_url": "https://www.udemy.com/como-aprovechar-facebook-para-tu-pyme/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T15:46:28Z"
}