{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><p style=\"\">Tech savvy tweens  doesn&#039;t mean socially savvy! We have a responsibility to help kids become good  digital citizens!&nbsp;</p>    <p style=\"\"><strong style=\"\">STOP WORRYING and  START SAVING FACE</strong>&nbsp;with Hay There  Social Media’s revolutionary offering, “Saving Face for Parents of Tweens™.”  This Social Networking  Safety coaching program  includes 7 instructional videos for parents and educators covering topics such  as: digital citizenship, cyber bullying, social media manners, online  responsibility, safety &amp; privacy, and more! The creators of Saving Face  have expertise in social media, education, and parenting and have combined this  knowledge to develop this revolutionary video training program!</p>    <p style=\"\"><strong style=\"\">When you buy “Saving  Face for Parents of Tweens,” you will get </strong><strong style=\"\">Internet Safety for Kids Video which consists of</strong><strong style=\"\">:</strong></p>&lt;/p&gt;  <ul style=\"\"><li style=\"\">Seven (7) eye-opening 30-minute video modules</li><li style=\"\">Corresponding handouts for reference</li><li style=\"\">Homework assignments to help you utilize our best practices in real life to help guide your tween’s social media use</li></ul><p style=\"\">Here&#039;s some of what we cover:</p><ul style=\"\"><li style=\"\">A step-by-step guide to instill good digital citizenship in tweens</li><li style=\"\">Questions to ask about a specific social network before allowing your tween to join</li><li style=\"\">A written agreement between kids and parents covering rules for social media safety</li><li style=\"\">Talking points to identify and prevent cyberbullying</li><li style=\"\">Steps to take to create a positive online reputation and more!</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Digital Citizenship & Social Media Safety for Tweens", 
    "price": "25.00", 
    "instructors": "Emily A. Hay, Sheri Watkins Co-Creator Saving Face v. 1.0", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44878_97e1_5.jpg", 
    "course_url": "https://www.udemy.com/digital-citizenship-social-media-safety-for-tweens/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-05T19:57:05Z"
}