{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Updated for 2015: </strong>  </p>  <p>  \tSocial media marketing is a must for the success of your products and services. Very few websites have the ability to so overwhelmingly increase business prestige as does Linkedin. Boasting more than 235 million members and a global reach of hundreds of millions more, this website can immediately enhance brand presence as well as profits.  </p>  <p>  \t<strong style=\"\">Here are just a few benefits of taking this course</strong>;  </p>  <ul style=\"\">  \t<li>Increase brand visibility with clients and customers</li>  \t<li>Immediate access to business partnerships and investors</li>  \t<li>Amplify social media brand messaging with eager buyers</li>  \t<li>Increase website traffic and build profits</li>  \t<li>Long-term, organic search indexing on Google, Yahoo and Bing</li>  \t<li>Immediate placement of your sales messaging above that of competitors</li>  \t<li>Increased profits and ROI</li>  </ul>  <p>  \t                   Niche marketing of your products and services on Linkedin can build long-term, geo-targeted website traffic with those most likely to take advantage of your offer(s). Join us for profit impacting, video tutorial training <strong style=\"\">NOW</strong>!  </p>  <p>  \t<strong style=\"\">Free Video Viewers - to view in best quality which is 720HD, once video is launched, go to bottom right area of video player and switch from &#039;360&#039; to 720HD.</strong>  </p>", 
    "end_date": null, 
    "title": "Digital Marketing on Linkedin", 
    "price": "20.00", 
    "instructors": "Brian Dale", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41664_b2fe_8.jpg", 
    "course_url": "https://www.udemy.com/linkedin-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-14T16:03:38Z"
}