{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>COURSE IS UP TO DATE AS OF 03/09/2015</p><p><strong style=\"\">OVER 1,490 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE in less then 5 Hours !</strong></p><p><em style=\"\"></em><strong style=\"\"><em style=\"\">UPDATE : 25 SEPTEMBER</em> 2015 TACTICS! BRAND NEW &amp; 100% UP TO DATE CONTENT!</strong></p><p>Start Digital Social Media Marketing Strategy to <strong style=\"\">grow your business</strong> and generate more sales from your customers and prospects and <em style=\"\">build profitable relationships, immediately - <strong style=\"\">just like my current 1490+ Students!</strong></em></p><p>You can have your own online business up and running today, right after going through this course - and be earning immediately!<br style=\"\"></p><p>Click the \"take this course\" button, top right, now ... every hour you delay is costing you money.</p><p><strong style=\"\">To run faster, easier, cheaper or even free. AND EFFECTIVELY. You need proven knowledge</strong>.</p><p>1. Would you like to increase your sales without spending thousands of dollars on online marketing? </p><p>2. Would you like to improve your marketing savvy, strategies and activities without committing a great deal of time?</p><p>If you answered \"yes\" to at least one of these questions then this course is for you!You just need a willingness to learn and adapt quickly to the changes of the industry. Literally, anyone can use the information.</p><p>Additionally, if you don't have a marketing plan or if you're new to marketing, this is the best place to start your journey.</p><p>Sign up and experience <strong style=\"\">the best introductory online digital social marketing lead generation course on the web</strong>.</p><p>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk! </p><p><strong style=\"\">Enroll now and start improving your marketing and sales results TODAY</strong> and take your business to the next level!</p>", 
    "end_date": null, 
    "title": "Digital Social Media Marketing Strategy For Startup Business", 
    "price": "20.00", 
    "instructors": "Sachin Kumar", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544826_61f0_3.jpg", 
    "course_url": "https://www.udemy.com/digital-social-media-marketing-strategy-for-startup-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T14:33:02Z"
}