{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><br></ul><p><strong><em>\"The course is presented in great way, everything is almost perfect. Using some real cases in explaining some point is really good. The information which are presented are well organized so it is easy to remember.\"</em></strong><strong></strong></p><ul><br></ul>\n\n<ul><li><strong>5000 + students</strong> \n\n</li></ul>\n\n<ul><li><strong>150 reviews with an average      of 4.4/5</strong> \n\n</li></ul>\n\n<ul><li><strong>Business podcast 'Breaking      Biz' with over 10,000 subscribers </strong>\n\n</li></ul>\n\n\n\n<p><br></p>\n\n<p>Hello and welcome!\n\n  </p>\n\n\n\n<p>This course is designed to simplify the best practices of Facebook so you can understand how to reach and engage your audience and improve your chances of getting a positive reaction to your Facebook advertising campaigns.\n\n  </p>\n\n\n\n<p><strong>Understand the art of Facebook advertising using proven, simple and effective techniques.</strong>\n\n  </p>\n\n\n\n<ul><li>Discover what makes 'news      feed worthy' content\n\n</li><li>Learn how to properly identify      with your customers\n\n</li><li>Find out what it means to      'delight' your audience\n\n</li><li>Hear how Banana Republic      triumphed using Facebook 'Lookalike' Audiences\n\n</li><li>Understand the different      formats of Facebook Ad Targeting\n\n</li></ul>\n\n\n\n<p><strong>Knowing how to use Facebook advertising formats is an essential element of today's online marketing requirements.</strong>\n\n  </p>\n\n\n\n<p>In the course you will learn how to avoid 'fishing' for your customers and instead, create targeted and relevant ads. You'll hear from Digital Marketing experts, as well as benefiting from real life case studies including Banana Republic's effective use of Facebook 'Lookalike' Audiences \n\n  </p>\n\n\n\n<p>From understanding the basics, through to learning simple techniques, you will leave this course ready to engage potential customers on Facebook.\n\n  </p>\n\n\n\n<p>I designed this course to offer you an easy to follow, comprehensive guide to growing your business using Facebook. Facebook marketing is a topic that can be made complicated very quickly. This is why I have prepared slide presentations with a running commentary, so you can enjoy the visuals and explanations that go with them. \n\n  </p>\n\n\n\n<p>I hope you enjoy learning the basics, and I look forward to connecting with students who have any requirements or questions.\n\n  </p>\n\n\n\n<p><u>Recent Udemy feedback</u>\n\n  </p>\n\n\n\n<p><strong><em>\"I'm very impressed with how many great tips there were in this short course. Good job. This guy clearly knows what he's talking about. I was going to give it 4.5 stars for being too short -- but I thought that didn't make sense since what is there is excellent.... Just what I've been looking for.\"</em></strong>\n\n  </p>\n\n\n\n<p><strong><em>\"Great Mentor, and also the good method of teaching. I am a 16+ kid from India and I was looking for the way that could help me get some basic awareness about starting a business and the responsibilities of an entrepreneur. Got some extra info regarding marketings and steps to follow to reach out the correct audience. What to do and what not and even got to know more about the personal point of views from a bunch of successful persons. Overall: A quick course and very helpful for getting the rough ideas and guideline for becoming an entrepreneur.\"</em></strong>\n\n  </p>\n\n\n\n<p><strong><em>\"Good information and very motivational. Once I started I couldn't stop till I watched all of them.\"</em></strong><strong></strong>\n\n  </p>\n\n\n\n<p> </p>", 
    "end_date": null, 
    "title": "Digital Marketing: A Beginners Guide To Facebook Advertising", 
    "price": "20.00", 
    "instructors": "Fred Williams", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841964_8755.jpg", 
    "course_url": "https://www.udemy.com/digital-marketing-a-beginners-guide-to-facebook-advertising/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-07T10:26:23Z"
}