{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will reveal to you how to grow your business with our proven &amp; tested Facebook strategies. </p>    <p>You’ll learn how to set up profitable Facebook campaigns in no time, even if you are a complete beginner! </p>    <p>This is the perfect course if you are new to paid search advertising. It’ll show you how to go from ZERO to having a campaign that’s driving converting traffic to your website.</p>    <p><strong>Learn How To Take the Best Seat in The House &amp; Reap the Benefits While Facebook Traffic Is Growing Your Business </strong></p>    <ul><li>How to boost your sales with paid Facebook ads instantly </li><li>Proven &amp; tested strategies to build a list of relevant subscribers </li><li>Best practices to run converting Facebook campaigns </li></ul><p><br><strong>Step Into the World of Facebook Marketing</strong></p>    <p>In this course, you’ll learn Facebook Marketing for beginners, and how to get up and running in a very short amount of time.</p>    <p>You will be able to optimize your Facebook ads for increased conversions and learn how to take your brand, product or service to the next level with the power of Facebook Marketing. </p>    <p>If you've always been intimidated by paid marketing and want to finally add it to your marketing pie, I have something just for you: a course that teaches you exactly how to run ads on Facebook &amp; drive sales.</p>    <p><strong>Enroll NOW and let’s get started TODAY!</strong></p>", 
    "end_date": null, 
    "title": "Drive Sales & Conversions With Facebook Ads: Complete Guide!", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Nikhil  Kapoor, Sandor Kiss", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608308_0338_2.jpg", 
    "course_url": "https://www.udemy.com/drive-sales-conversions-with-facebook-ads-complete-guide-ppc-roi-fb/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T18:41:31Z"
}