{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you have a Facebook, Twitter, Instagram, Pinterest, Google, YouTube, or Flickr Account? If you're not using Social Media Automation, you're MISSING OUT!</p><p><strong>Social Media Automation For Beginners</strong> is all about making the most of you Social Media Presence with the least amount of effort. I will teach you to easily master automating your social network presence &amp; how to get the most out of using the '2-Click method'. </p><p>Creating a coherent and consistent Social Media Presence is hard work, and its crucial to creating Engaged Social Communities. Without a consistent stream of relevant, helpful, or meaningful content, your audience is moving on to your competition to get their fix. </p><p>I've got your back!</p><p>This is <strong>NOT </strong>a course in Paid Advertising on Social Media. </p><p>Do you want to save hours each week and present a more effective social network presence for FREE? </p><p>Do you want to make your Social Media <strong>do work for you? </strong>Should't you let computers work while you reap all the reward? </p><p>Do you want to learn how to make your Social Media update, tweet, and post to each other promoting everything that you love, to everyone who deserves to hear it? </p><p>Thats what this course is all about! Taking back the hours in the day, and maximizing what your Social Networking life can do for you!</p><p><strong>Why Should I Take This Course?</strong></p><p>You'll learn all about Social Media Automation, and why its so Important to you!</p><p>You'll learn to make the most out of your Social Media Presence. </p><p>Because you don't want to work if you can get computers to do it for FREE!</p><p><strong></strong>You'll really want to take this course if managing your social media networks is hard work, or even just posting to all of your networks the right way takes time.</p><p>You should take this course if you want to learn about the Internet of Things, but don't know where to start, or how to write code.</p><p> Because you're the kind of person who wants to have your cake and eat it too! (who doesn't want to eat their cake?)</p><p><strong>What Will I Get Out of This Course?</strong></p><p><strong></strong>First of all you'll learn to save HOURS managing your social media networks &amp; you'll learn to make your <strong>Social Media work for you</strong>!</p><p>On top of that, you'll learn to make your Social Network Profiles <strong>work with each other,</strong> using one of the most AWESOME services ever.</p><p> You'll know way more than your friends about the Internet Of Things, and you'll know all about Social Automation!</p>", 
    "end_date": null, 
    "title": "Easy IFTTT: Social Media Automation in 15 Minutes with IFTTT", 
    "price": "30.00", 
    "instructors": "Zack Weiner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596224_05ea_2.jpg", 
    "course_url": "https://www.udemy.com/automate-your-social-life-no-code-required/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T21:31:10Z"
}