{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Can you recall a time when the world was without social media sites and networks? A time before Facebook, Twitter and Co.? If I try really hard, I can still recall glimpses of it; sms&#039;s being typed on phones with screens devoid of colour and that still had buttons <em style=\"\">(Oh, how I miss those buttons), </em>birthday wishes given in person or by telephone and not on a wall, and people showing they liked something by saying it with their actual voices and not through the click of a button.</p><p style=\"\">Now, before you think you&#039;ve Stumbled upon the wrong classroom, let me say this: I like Social Media. I like the things we&#039;re able to do because of it, and there&#039;s nothing from the time before Social Media that I particularly miss. Except cellphones with buttons.</p><p style=\"\">The point I was trying to make with my question in the opening line, albeit in a roundabout way, is that for something that has really only existed in its proper form for little more than 10 years, social media has become irremovably entrenched into human society.</p><p style=\"\">Among the myriad of social networks available today, Tumblr is becoming one of the best ways to make your company a success in the online marketing world. But, you have to know how to use it correctly and efficiently, and that is exactly what this course will teach you.</p><p>You will learn everything you need to know in order to easily and effectively <strong style=\"\">position your business on Tumblr as quickly as possible,</strong> as well as how to leverage this amazing and extremely powerful source of high quality traffic to generate leads and great profits online.</p><p>One of the greatest things about Tumblr is that you are able to find and connect with people who share the same interests as your business - allowing you to <strong style=\"\">grow a huge army of potential customers 100% targeted to your business</strong>. </p><p> You will be able to <strong style=\"\">productively interact with your new and existing customers, </strong>because<strong style=\"\"> </strong>Tumblr provides you with a direct line of communication to these customers. <br style=\"\"></p><p><strong style=\"\">In this course, you will be given a 7-Step Formula to follow, which will have you up and running on Tumblr in no time.</strong></p><ul style=\"\"><li style=\"\">No wasting time with ineffective strategies</li> <li style=\"\">No wasting money on obsolete marketing methods</li></ul><p>All you have to do is listen to the lectures in this course and go apply what you have learnt. </p><p><strong style=\"\">Enrol in this course and start using Tumblr to enhance the online presence of your business and achieve the levels of growth and success you&#039;ve been longing for. </strong></p><p>+++++++++++++++++++++++SPECIAL BONUS SECTION ++++++++++++++++++++++++</p><p>Learn how to create your own Twitter-like Micro-Blog that you can use as an internal communication network for your business or even as a great promotional tool.</p><p>Regular price for this course = $47</p><p><strong style=\"\">Enrol today and get this course absolutely free! </strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>", 
    "end_date": null, 
    "title": "Elite Social Media Marketing Tactics for Tumblr Business Blogging", 
    "price": "30.00", 
    "instructors": "MindMekka ®", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476506_0240_5.jpg", 
    "course_url": "https://www.udemy.com/elite-social-media-marketing-tactics-to-triumph-on-tumblr/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T21:59:38Z"
}