{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em><strong>LATEST UPDATE: October, 2015</strong></em></strong> </p><p><strong>Entrepreneur's Guide to Creating Facebook Fan Page Content </strong> </p><p>Learn the secrets of crafting winning content for your fans on Facebook.  </p><p>With a solid content strategy, you will be able to build bonds with your fans and drive free viral traffic to your page. </p><p><strong>Create an Effective Content Strategy that Speaks to Your Fans</strong> </p><ul><li>Identify with your audience so you can speak their language </li><li>Know how to find content that will trigger viral engagement </li><li>Learn how to outsource your fan page management  </li></ul><p><strong>Fall in love with your fans, not your products</strong> </p><p>In this course, you will learn about a fundamental law that applies to every business (and life)-- </p><p>the “Strategy Of Preeminence\" by Jay Abraham.  </p><p>You will understand how to research your audience, speak their language, and expose them to content that they want.  </p><p>In this course, you will understand how to research your audience, speak their language, and expose them to content that they want.  </p><p><strong>Contents and overview</strong> </p><p>The course will begin by teaching you how to be a leader--an authoritative, consultative force--in your marketplace so your fans trust your knowledge. You will be able to shift your position from selling to leading.  </p><p>Next you'll learn how to define your audience so you can provide solutions to problems, speak their language, and drive targeted traffic.  </p><p>You will be walked through a 4-step action plan to identify and define the target audience with a data-driven approach.  </p><p>You'll be shown how to use Facebook Audience Insights, so you can find out detailed information about an audience in a specific niche market. </p><p>You'll be taught what kind of content to post, what the ideal length is, and when to post.  </p><p>Two lectures will reveal 10 easy-to-implement strategies to boost fan engagement instantly. These strategies will trigger viral fan engagement, which will result free viral traffic. </p><p>Delegating fan page management is next. You will learn about which deadly pitfalls to avoid, and what the best resources are to find and hire a community manager. </p><p>Towards the end of course, you will be shown Likealyzer. This a free tool to measure the performance of your fan page, so you identify what metrics should be optimized to achieve maximum fan engagement and reach.  </p><p>By the time you complete this course, you will be in a position to leverage your businesses and trigger viral engagement and traffic. </p><p><span></span> </p>", 
    "end_date": null, 
    "title": "Entrepreneur’s Guide to Creating Facebook Fan Page Content", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366596_c1a4_3.jpg", 
    "course_url": "https://www.udemy.com/viral-engagement/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T12:37:15Z"
}