{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>LATEST UPDATE: October, 2015</strong></em><strong><span></span></strong></p><p><strong>Entrepreneur's Guide to Effective Design of a Facebook Fan Page</strong> </p><p>Learn what it takes to design a successful fan page on Facebook to promote your business, grow your customer base, and increase your revenue.  </p><p>Whether you already have a Facebook fan page that needs a design boost or want to establish a business presence on Facebook, this course will help.  </p><p>Learn how to gain access to more than 1 billion potential customers that are on Facebook everyday, and turn them into your customers without a marketing budget. </p><p><strong>Design an Eye-Catching Facebook fan page </strong> </p><ul><li>Walk through a live setup of a professionally designed fan page </li><li>Choose an effective cover photo, profile picture, fan page name, and description </li><li>Review case studies of effective fan pages</li></ul><p><strong>Build your first online business without a website</strong> </p><p>A Facebook fan page is the place to meet your potential customers, engage with them, and invite them to share their opinion.  </p><p>More importantly, it is the starting point of incorporating different marketing techniques, like list building, direct selling, or retargeting. </p><p>With a great fan page design, you'll attract a lot more fans and subscribers, which could lead to more sales and more revenue. </p><p>With this course, you will be able to set up a great fan page on Facebook and understand why design and branding really matters.  </p><p><strong>Contents and overview</strong> </p><p>The key element that successful Facebook fan pages have in common is a hot design.  </p><p>You'll start the course learning how to choose an ideal profile picture and a cover photo that work. These two elements are prime real estate and must be carefully chosen. </p><p>Then you'll discover the secret design strategies that Fortune 500 companies like Apple, Coca-Cola, and Pepsi use on their highly successful fan pages. This will help you understand why a great design is so important. </p><p>Next, you'll be walked through setting up the fan page. You'll choose your category and a creative and clear fan page name so your visitors can quickly identify what you're all about. Then you'll learn how to write a description that sells. </p><p>You'll review case studies of effective fan pages so you can learn how successful companies achieve high results.  </p><p>By the end of the course, you'll be ready to start posting content on your fan page, build your fan base, and start developing meaningful relationships with them. Your business will benefit. </p><p><span></span> </p>", 
    "end_date": null, 
    "title": "Entrepreneur's Guide to Effective Design of a Fan Page", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384978_64d3_7.jpg", 
    "course_url": "https://www.udemy.com/fan-page/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T17:34:51Z"
}