{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em> Kurs-Update: Stand April 2015. </em></p><p>Entdecken Sie, wie Sie wirkungsvolle Podcasts erstellen - schnell, einfach und KOSTENLOS! Über 1700 Studierende verwenden bereits diesen Kurs, um sich erfolgreich als Experte zu positionieren, Geschäftsbeziehungen aufzubauen, einflussreicher zu werden, Umsätze zu steigern, und die Welt zu verändern. </p><p>Was ist ein Podcast? Ein Podcast ist eine Audio- oder Video-Show, die automatisch auf Ihrem Computer, Smartphone, iPad, Tablet und/oder iPod aktualisiert wird. Betrachten Sie Podcasts als Radio- oder Fernsehsendungen, die Sie werbungsfrei direkt an Ihr Publikum liefern, jedes Mal wenn Sie eine neue Episode erstellen. </p> Podcasting ist viel größer, als Sie denken! Wenn wir Leute befragen, die sich Audio-Podcasts mindestens einmal im Monat anhören, sehen wir, dass Podcasts AM/FM Radio, Streaming Audio, CDs, TV-Musikprogramme, und Sirius um ein vielfaches übertreffen.<blockquote> <em>\n\n\n\n\n\n\n\n\n</em><p><span>\"Power\nPodcasting ist fantastisch!\"</span> </p><em></em></blockquote><blockquote> <em>\n\n\n\n\n\n\n\n\n</em><p><span>\"Scott\nist freundlich, und man kann ihm leicht folgen. Er ist auf jeden Fall Experte\nin seinem Gebiet. Alles, was Sie brauchen, lernen Sie hier. Es ist alles in\neinfacher Weise dargestellt. Meiner Meinung nach ist dies ein großartiger Kurs!\nIch war schockiert zu hören, wie beliebt Podcasts sind. Podcasting ist ein\ngroßartiges Marketing-Tool, das ich bisher völlig übersehen habe. Ich habe viel\nin diesem Kurs gelernt. \"</span> ~ Dan\nKobelt </p><em></em></blockquote><p>Wenn man sich die Anzahl der Menschen ansieht, die sich monatlich Podcasts anhören, dann sieht man, dass Podcasts so beliebt sind wie Twitter, mit 39 Millionen Hörern, auch wenn Podcasting nicht die gleiche Aufmerksamkeit erhält. </p><p>Anstelle von unpersönlicher Twitter-Kommunikation mit nur 150 Zeichen, erreichen Sie mit Power Podcasting die Köpfe und Herzen Ihrer Zielgruppe, so lange diese das zulassen. </p><p>Podcasts sind mobil – deshalb sind sie persönlicher. </p><p>Stellen Sie sich vor, Sie flüstern jede Woche in die Ohren Ihrer idealen Kunden... Sie bauen damit starke Geschäftsbeziehungen auf, Vertrauen und Verbindungen. Power Podcasting ist nicht nur Eins-zu-Eins, sonder Einer-für-Viele! Power Podcaster wissen, dass es bei Podcasting um den Aufbau von Geschäftsbeziehungen geht und nicht um den Hard-Sale eines Produktes oder Service. </p><p>Podcasthörer verdienen gut. Sie hören sich täglich bis zu einer Stunde und 40 Minuten Audio an. Das ist mehr als der durchschnittliche amerikanische Normalverbraucher. Podcasthörer bemühen sich um ihre kontinuierlichen Weiterbildung. Stellen Sie sich also vor, was passiert, wenn Ihr Podcast auf der ganzen Welt in neuen Autos zu hören wäre... </p><p>Power Podcasting \"ermöglicht Ihnen, Ihre Persönlichkeit in einer viel stärkeren Weise zu vermitteln, als das durch das geschriebene Wort möglich ist. Die Klarheit Ihrer Botschaft wird gesehen und gefühlt durch Ihr Verhalten (auf Video) und dem Klang Ihrer Stimme ...\" nach Chris Ducker, Autor des # 1 Bestsellers 'Virtual Freedom \". </p><p>Wenn Sie in diesen Kurs investieren, dann können Sie sich ihn immer und überall anhören/ansehen. Zusätzlich gibt es Frage und Antwort Möglichkeiten in jedem Kursabschnitt. Ich werde Ihnen gerne jede Ihrer Fragen persönlich beantworten! </p><p>Dieser Kurs besteht aus mehreren kurzen und leicht zu folgenden Vorträgen. Wenn Sie dem Kurs folgen, werden Sie schnell in der Lage sein, Ihre Podcast-Show zu erstellen und die erste Episode zu veröffentlichen. </p><p>Dieser Kurs wurde mit dem Ziel entwickelt, Power Podcasters so schnell wie möglich ans Ziel zu bringen. Ich empfehle Ihnen, sich die ersten sechs Abschnitte von Anfang bis Ende anzusehen. Zusätzlich enthält dieser Kurs PDF-Workbooks, die Ihnen mit Thema, Titel, Beschreibungen, Intro und Outros helfen. </p><p>Für \"Typ A” Persönlichkeiten, gibt es einen \"Fast Track\"-Vortrag (Erster Abschnitt, Lektion # 6). Wenn Sie bereits eine fertige MP3 oder MP4-Datei haben, zeigt Ihnen dieser Abschnitt, wie Sie innerhalb von 33 Minuten Ihren Podcast live auf iTunes haben. Mit anderen Worten, in weniger als seiner Stunde können Sie Ihren Podcast fertig gestellt haben. </p><p>Die technischen Prozesse von Power Podcasting sind nur ein Aspekt erfolgreichen Podcastings. Erleben Sie in diesem Kurs Beispiele aus der Praxis, die Ihnen bei der Herstellung Ihres Podcasts helfen. Entdecken Sie, wie Sie Ihre Stimme effektiv einsetzen, um Ihr Publikum zu motivieren. Entdecken Sie, wie Sie Inhalte für Ihre Podcast-Episoden finden und wiederverwenden, und wie Sie das schnell und effektiv machen können! </p><p>Power Podcasting \"wird Ihre E-Mail-Liste, Ihr Publikum, Ihren Einfluss und Ihr Bankkonto wachsen lassen\" ~ Amy Porterfield von \"Tweet This\" und ehemalige Social Media Expertin für Harley Davidson und Tony Robbins. </p><p>Podcasting wächst rasant. Dank “CarPlay” und Podcast Apps wird ein weiteres, starkes Wachstum für die kommenden Jahre vorrausgesagt. Podcasting steckt noch in den Kinderschuhen aber hat enormes Potenzial. Verpassen Sie nicht den geringen Wettbewerb und die hohe Nachfrage, die Ihre Podcast-Kollegen bereits genießen.</p><blockquote><p><span>\"Ein grossartiger Kurs, der mich sehr inspiriert hat!\"</span> </p>\n\"Grossartige\nInhalte, die mich sehr inspiriert haben </blockquote><blockquote> <em>\n\n\n\n\n\n\n\n\n</em><p><span>\"Scott\nist sehr kompetent und erfahren. Der Kurs ist wirklich ausgezeichnet. Ich bin völliger\nAnfänger, und Scott hat mich dazu inspiriert fest zu glauben, dass ich es auch\nkann. Andere Kurse können langweilig sein und machen mir keinen Spass. Dieser hier\naber ist toll! Scott gestaltet den Kurs unterhaltsam und einfach. Es macht Spaß\nzu lernen. \"</span> ~ Marion Baker </p><em></em></blockquote>", 
    "end_date": null, 
    "title": "Erfolgreiches Power Podcasting & Podcast Hosting", 
    "price": "20.00", 
    "instructors": "Nicola Kluge, Ph.D., Scott Paton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397884_097b_6.jpg", 
    "course_url": "https://www.udemy.com/power-podcasters-german/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T09:57:53Z"
}