{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><em><em><em><em><em>Course fully up-to-date and new lectures added as of this month.</em></em></em></em></em></em></p><p><strong>JOIN 1,000s OF FACEBOOK USERS WHO ARE NOW GROWING, MANAGING, AND GENERATING PROFITS FROM THEIR OWN FACEBOOK GROUPS! </strong></p><p>1. Would you like to discover <strong>seven (7)</strong><strong> ways to leverage</strong> Facebook for your <em>business, personal brand, and sales goals</em>?</p><p>2. Are you <em>tired </em>of the same old Twitter and LinkedIn marketing courses/books <strong>that lead nowhere</strong>?</p><p>3. Are you interested in <strong>increasing your leads and subscribers</strong> while expanding your <em>online influence</em>? </p><p>If you answered \"yes\" to at least one of these questions, then this course is for you!</p><p><strong>If you're in business without a Facebook group, you're not using Facebook correctly!</strong> Facebook is the #1 social media platform, #2 most visited website, and an online platform with over 1 billion active users. At just over ten years old, Facebook offers tremendous brand building, marketing, and sales opportunities. Best of all, the influential capabilities of Facebook groups and pages <strong>won't cost you</strong> a cent, they're investment free. </p><p><em>Facebook Group Profits</em> is the first comprehensive online course dedicated to mastering Facebook groups. We'll tackle how to create, grow, manage, and monetize a group from start to finish. This course is designed to ignite your <strong>social media and online marketing reach and success</strong>. </p><p>As you navigate this course, you'll gain insights and learn the strategies I use to monetize my Facebook groups of <strong>over 12,000 members</strong>. Upon successful completion of this course, you'll be able to:</p> <ul><li>Understand Facebook, its ecosystem, and marketing potential for business purposes </li> <li>Create, grow, manage, and monetize a successful Facebook group </li> <li>Leverage a Facebook group for revenue and profit objectives</li> <li>Increase your subscribers and contacts while expanding your network</li> <li>Address various important considerations during the maturation phase of a group</li><li>And much more...</li></ul> <p><br></p><p>Sign up and experience the most <strong>comprehensive Facebook group course</strong> found on the web.</p><p><strong>Start Learning!</strong></p><p>Enroll now and start monetizing your group TODAY!</p>", 
    "end_date": null, 
    "title": "Facebook for Business: Facebook Group Profits", 
    "price": "20.00", 
    "instructors": "Chad Tennant, Make Money Online - Home Business", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482464_bdda_10.jpg", 
    "course_url": "https://www.udemy.com/facebook-group/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T19:36:00Z"
}