{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>UPDATED April 2016: </strong><strong> </strong>My Udemy courses have been taken by 1,000s of students and have been awarded 100s of positive reviews.  </p>\n\n<p><strong>My “WHY” – </strong>You know that feeling you get when you help someone? I want to feel that way 1,000,000 times.<strong> </strong></p>\n\n\n\n<p><strong><em>Come with me on a journey to Facebook marketing without paying for any Ads.</em></strong><br></p>\n\n\n\n<p>Are you sick of people telling you that Facebook is a pay to play platform? and there is no way to grow page likes without spending money on Facebook Ads. In this course, I will show you examples of Facebook pages that I have grown without any advertising and share over <strong>25 tactics</strong> you can start using today. I have grown my own business pages &amp; my client's Facebook pages organically (no money spent on Ads)</p>\n\n\n\n<p>After completing this course, you will be well on your way to first 800 Facebook organic fans. You will be able to..</p>\n\n\n\n<ul><li>Start growing your Facebook page likes <strong>without spending any money</strong> on Facebook Ads</li><li>Improve the <strong>search ranking</strong> of your Facebook business page</li><li><strong>Master Facebook marketing,</strong> find and share VIRAL content</li><li>Drive massive amount of traffic to your Facebook page and start getting organic likes</li></ul>\n\n\n\n<p>This course is structured in a very modular format and you will see</p>\n\n\n\n<ul><li><strong>Real life case studies &amp; examples</strong></li><li>Facebook marketing tactics that I have used over the years</li><li>Homework assignments to get your started on your Facebook marketing growth</li></ul>\n\n\n\n<p>This course comes with 30 day money back guarantee so you have nothing to lose. Click on \"<strong>Take This Course</strong>\" and I will see you on the inside.</p>", 
    "end_date": null, 
    "title": "Facebook Marketing: Grow Your Page Without Facebook Ads", 
    "price": "20.00", 
    "instructors": "Ali Mirza", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606976_9080_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-and-likes/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T14:40:41Z"
}