{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Want to learn how to build huge Facebook pages?</p><p><br style=\"\"></p><p>This is a step-by-step guide that will virtually guarantee you success!</p><p><br style=\"\"></p><p>I started building my pages from scratch.  My single largest page has 563,000 Facebook likes, and I started that page with zero likes.  What&#039;s more, that page is still alive and active.  It still drives a large amount of traffic to one of my websites today.  </p><p><br style=\"\"></p><p>Whether you are creating a page for your business or you just want to create a huge Facebook page to drive traffic to a website, this course has got you covered.  </p><p><br style=\"\"></p><p>You will learn how to:</p><ol style=\"\"><li style=\"\">Reach more people: Increase the reach of your posts</li><li style=\"\">Boost engagement</li><li style=\"\">Draw feedback from your fans.  </li><li style=\"\">Conduct research</li><li style=\"\">Spy on your competitors</li><li style=\"\">Grow huge, engaged pages!</li></ol><p style=\"\">You will become a Facebook marketing pro with this course.</p><p style=\"\"><br style=\"\"></p><p style=\"\">It can be quite a daunting task to build a Facebook page when you start from scratch.  The solution for this is to implement a proven system that has worked before.  That is what you are getting in this course. </p><p style=\"\"><br style=\"\"></p><p style=\"\">I will teach you the different post types you can use to engage your fans and provide them with real value.  When you begin to understand these different post types, everything will become easier and your creativity will really start to flow.  </p><p style=\"\"><br style=\"\"></p><p style=\"\">You just need a basic system to follow.  That system will be the core of your Facebook marketing. Then you will add your own brand of creativity on top of that to make something that is truly amazing. </p><p style=\"\"><br style=\"\"></p><p style=\"\">If you already have a Facebook page up and running, then using this system will immediately boost your results you see on your page.</p><p style=\"\"><br style=\"\"></p><p style=\"\">Whether you are using this knowledge for a business or for your own pet project, you will be able to immediately put this knowledge to work to grow your Facebook pages.  </p><p style=\"\"><br style=\"\"></p><p style=\"\">This course is packed with specific examples &amp; it will give you a plan that you can start to follow immediately.  </p><p style=\"\"><br style=\"\"></p><p style=\"\">If you want to become an effective Facebook marketer then sign up for this course now!</p><p style=\"\"><br style=\"\"></p><p style=\"\">Why should you sign up right now?</p><p style=\"\"><br style=\"\"></p><ol style=\"\"><li style=\"\"> I guarantee 100% satisfaction.  If you aren&#039;t fully satisfied with the course, you get your money back. Simple as that. No risk to you.</li><li style=\"\">You have access to this course for life.  (This includes all future updates!)</li><li style=\"\">You have access to me, to ask me questions directly for personal advice.</li></ol><p style=\"\">Sign up now and become an expert at Facebook marketing!<br style=\"\"></p><ol style=\"\"></ol>", 
    "end_date": null, 
    "title": "Facebook Marketing: How I Built 1.2 Million Facebook Fans", 
    "price": "20.00", 
    "instructors": "Jordan Arsenault", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460704_1642_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-how-i-built-1-2-million-facebook-fans/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T15:34:59Z"
}