{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tIf you have spent any time on Facebook, you might have noticed that your friends become fans  </p>  <p>  \tof certain celebrities, music groups, organizations and local businesses by &quot;liking&quot; their pages.  </p>  <p>  \tAdditionally, if you&#039;re a business owner, you can establish a business page to promote your product  </p>  <p>  \tor service. Although you can establish a special account for your business, it is easy to create a  </p>  <p>  \tbusiness page as an offshoot of your personal profile. Only an authorized representative of a  </p>  <p>  \tbusiness, group, band or organization can set up a page.  </p>  <p>  \tThere are various organizations that do create a Facebook Business Page, but not many are  </p>  <p>  \taware on how these pages can help in business promotion and create engagement with potential  </p>  <p>  \tcustomers. This course will be a helpful guide for anyone from sales and business development  </p>  <p>  \tprofessionals to brand managers, digital marketing professionals, media planners and management  </p>  <p>  \tstudents.  </p>  <p>  \tThis course will assist you in understanding the importance of conversations, different ways to  </p>  <p>  \tsource content for page postings and a lot more. Leverage this opportunity and enrol for this course  </p>  <p>  \tto broaden your skills and knowledge on effective usage of Facebook Page for business promotion.  </p>  <p>  \tIn this course, you will learn:  </p>  <ul style=\"\">  \t<li>Type of content that creates engagement</li>  \t<li>Importance of conversations</li>  \t<li>Handling Conversations on Admin Post</li>  \t<li>How Facebook Posts are distributed to Users</li>  </ul>  <p>  \t&lt;/p&gt;  </p>  <p>  \tFind more about Digital Marketing courses at <a href=\"http://www.digitalvidya.com\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Digital Vidya</a>.  </p>", 
    "end_date": null, 
    "title": "Facebook Page: effective community building", 
    "price": "25.00", 
    "instructors": "Digital Vidya", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49481_63a0_7.jpg", 
    "course_url": "https://www.udemy.com/facebook-page/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-12T06:29:51Z"
}