{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Make no mistake; this is no\n‘Facebook for dummies.’  We designed ‘Facebook Marketing Like I’m 5” to serve as the ultimate social media training\nsystem for businesses and entrepreneurs who are <em>smart beginners.</em></p><p>This is a practical course. Our goal\nis to give you an actionable roadmap for a total makeover of your Facebook\nbusiness strategy that will increase your audience growth and deliver real\nbusiness results. </p><p>Because you can’t succeed in social\nmedia marketing without a strategy, Facebook Marketing Like I’m 5’ takes you\nthrough the strategic process of planning and building a Facebook business\npresence. You will learn how to attract new customers through a magnetic\nFacebook community built around your own unique brand of content. You’ll also\nlearn how to gather not just Likes - but <em>the\nright kind of Likes -</em> that can move your business ahead and bring you\nprofits and more market share.</p><p>This course also covers the\nall-important tools you’ll need to execute your strategy. ‘Facebook Marketing\nLike I’m 5’ features dozens of these free tools; step-by-step guides;\n‘under-the-hood’ tricks, real-world case studies, and examples of successful\n(and not so successful) campaigns from brands both big and small.</p><p>There’s an overload of information\nabout Facebook scattered across the web. Some of it is out of date, and much of\nit is confusing, overly granular, or vague. </p><p>‘Facebook Marketing Like I’m 5’ is\nbuilt around an action-oriented, workshop-style, pain-free process to plan,\nbuild, and optimize your Facebook business presence. </p><p><strong><em>Select Endorsements</em></strong></p><p>\"Facebook Marketing Like I'm 5 packs more value than an MBA class and you can literally use it as a play-by-play to get your 'magic' out to the world. If you're looking to build a strong, authentic, and respected presence on Facebook, then it is certainly for you.\" <br><br><strong>***** Matt Cartagena, Co-author of “Accelerate”</strong><br><br>\"What I love about what Peg Samuel and Matthew Capala are doing here is that Facebook Marketing Like I’m 5 is completely actionable and results-oriented. The two are dynamic social media educators and practitioners, which is a rare combination to find.\" <br><br><strong>***** Jeremy Goldman, Author of “Going Social,” CEO of Firebrand Group</strong> <br><br>\"Facebook Marketing Like I'm 5 is a critical tool for any small business owner who wants to leverage the power of the massively engaged Facebook audience. Even if you consider yourself a Facebook pro, you'll find tidbits and hacks that will give you a whack on the side of the head. <br><br><strong>***** Ivana Taylor, Small Business Influencer, Publisher at DIY Market</strong><strong>ers </strong><br></p>", 
    "end_date": null, 
    "title": "Facebook Marketing Like I'm 5", 
    "price": "50.00", 
    "instructors": "Matthew Capala, Peg Samuel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660466_401f_4.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-like-im-5/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T22:06:27Z"
}