{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Would you like to reach a bigger audience on Facebook? Want to get more page likes? Looking for greater engagement on your page?</p><p>Then <strong>Facebook Video Views</strong> is for you.</p><p>If you've put a video on Facebook before you've notice how few views you get. Twenty-five on this one. Fifty-six on that one. And every now and then you break a hundred views.</p><p>There are three reasons most people don't get many video views on Facebook...</p><p><strong>#1 The Video isn't Viral.</strong></p><p>By that I mean it's not a baby eating bacon or a cat licking it's owner. Here's some good news, you do NOT need a viral video. Mine isn't. So don't think it has to be.</p><p><strong>#2 The Video isn't Engaging.</strong></p><p>The next time you are on Facebook and you see an informational video, not an entertainment video, it will probably begin with \"I just wanted to make you this video today to...\" Duuuuuuuulllllll.</p><p><strong>#3 The Video isn't Themed</strong></p><p>Videos with random, loose thoughts don't do well. On top of that the players in your market don't share videos like that. You want to create videos with a message that matches your market and get shared.</p><p>This course reverses those three negatives and puts you in position to maximize your views, shares and comments.</p><p><strong>You'll discover...</strong></p><ul><li>The five elements you need for a video to <strong>connect with your audience</strong>.</li><li>How to get the <strong>influencers in your marke</strong><span></span><strong>t</strong> to share your video. (You need to do this right or it won't work.)</li><li>The best way to <strong>increase page likes</strong> from video views that most people are ignoring. (And no it's not asking people to like your page from the video even though thats a good idea.)</li><li>How to<strong> target the right audience</strong> if you choose to run video ad you run and pay only one-cent per view.</li><li>Why <strong>y</strong><strong>ou need a theme</strong> to your videos and how to choose one that fits you and your audience.</li><li>My personal <strong>video flow formula</strong> that I use for every video : S + P + S = Success</li><li>How to create a <strong>signature sign-off</strong> that anchors you and your core message. It will separate you from all the other video marketers in your niche.</li></ul><p>Great ready to increase your Facebook Video Views with video you can't wait to make and your audience can't wait to watch!</p><p>Success is NOT an Accident!</p><p>Paul</p><p><br></p>", 
    "end_date": null, 
    "title": "Facebook Video Views: How I Got 134,303 Views and Counting", 
    "price": "20.00", 
    "instructors": "Paul Evans", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708830_571a.jpg", 
    "course_url": "https://www.udemy.com/facebook-video-likes-social-media/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T18:55:23Z"
}