{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t                         Πόσες ώρες την ημέρα περνάτε μπροστά στον υπολογιστή; Έχετε ποτέ σκεφτεί να εκμεταλλεύεστε το χρόνο αυτό προς όφελός σας;  </p>  <p>  \t                          Αν είστε εξοικειωμένος με το Facebook τότε το σεμινάριο αυτό είναι το κατάλληλο για εσάς, γιατί θα σας μάθει όχι μόνο να διαχειρίζεστε τη σελίδα σας καλύτερα και πιο αποδοτικά, αλλά και πώς μπορείτε μέσα από αυτό να προβληθείτε καλύτερα, να αποκτήσετε νέους πελάτες και να διατηρήσετε αυτούς που ήδη έχετε.  </p>  <p>  \t                          Σκοπός του σεμιναρίου είναι να μάθετε όλα όσα χρειάζεται για να ξεκινήσετε να εκμεταλλεύεστε το Facebook ως εργαλείο marketing και διαφήμισης για να βοηθήσετε την επιχείρησή σας. Θα μάθετε πώς να κάνετε αναρτήσεις που θα συγκεντρώνουν like και το ενδιαφέρον του κοινού, να διαβάζετε σωστά τα στατιστικά της σελίδας σας, καθώς και πολλά άλλα.  </p>  <p>  \t                          Επιπλέον θα μάθετε ποια είναι τα μυστικά της επικοινωνίας των κοινωνικών δικτύων, πώς λειτουργεί το διαδικτυακό «από στόμα σε στόμα» και επιπλέον πώς μεγάλες επιχειρήσεις κατάφεραν να χρησιμοποιήσουν τα κοινωνικά δίκτυα προς όφελός τους. Γιατί λοιπόν όχι κι εσείς; Ακόμα θα σας δοθούν άγνωστα μυστικά και συμβουλές για το πως να κάνετε πετυχημένες καμπάνιες στο Facebook και να κάνετε τους fans σας να αλληλεπιδρούν με εσάς.  </p>  <p>  \t                          Στο σεμινάριο παρέχεται σε κάθε συμμετέχοντα δωρεάν:  </p>  <p>  \t<img class=\"aligncenter wp-image-1989\" src=\"http://www.dingo.gr/wp-content/uploads/2014/12/socialmedia@transparency.png\" alt=\"socialmedia@transparency\" width=\"228\" height=\"152\" style=\" margin:5px; \"><a href=\"javascript:void(0)\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\"><img class=\"aligncenter wp-image-1991\" src=\"http://www.dingo.gr/wp-content/uploads/2014/12/Facebook-σαν-Εργαλείο-Ανέλιξης-ebook-mockup.png\" alt=\"Facebook σαν Εργαλείο Ανέλιξης ebook mockup\" width=\"228\" height=\"125\"></a>  </p>  <ul>  \t<li>Τα slides σε μορφή PDF</li>  \t<li>ebook: &quot;Tο Facebook σαν Εργαλείο Ανέλιξης</li>  \t<li>ebook: &quot;Social Media Marketing Plan σε 8 Βήματα</li>  </ul>  <p>  \t<em>Το σεμινάριο εμπλουτίζεται συνεχώς (δωρεάν) με νέες ενότητες, μυστικά και συμβουλές και ανανεώνεται σύμφωνα με τις τελευταίες αλλαγές του Facebook, ώστε να είστε πάντα ενημερωμένοι!</em>  </p>  <p>  \t                         With this course you are going to learn everything you need in order to administrate and use Facebook Pages to your business benefit. In this course we will explain how a business can enter social media successfully, reach its target group and promote its brand and its product by creating more engaging content. This course is currently conducted in Greek language but soon we will have it in English.  </p>", 
    "end_date": null, 
    "title": "Facebook Marketing & Διαχείριση Σελίδας", 
    "price": "50.00", 
    "instructors": "Dingo Marketing  Team", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/163582_6b41_5.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing2/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-13T14:16:48Z"
}