{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p></p><p>This course\r\ninvolves an extensive yet comprehensible introduction to the social media\r\nplatform Facebook and how it can be used for marketing purposes. Designed in\r\nparticular for (aspiring) entrepreneurs, it offers students both basic\r\ninformation about Facebook and its features as well as practice in devising\r\ntheir own Facebook marketing strategy. The course is accessible to students of\r\nall levels, from those unfamiliar with Facebook to those with (basic) knowledge\r\non social media marketing in general. Since this video course has a specific\r\nfocus on the platform of Facebook, it can easily be integrated into an Internet\r\nor social media marketing strategy program or be combined with other social\r\nmedia platform courses.&nbsp;</p><p></p><p>This is a video\r\ncourse in which Facebook marketing related topics are presented in the form of\r\nvideo. The video format consists of slides with information, graphs and\r\npictures supporting the spoken information provided by IMNL America’s Social Media Consultant/President Rob Stoutenburg. The entire course consists of five tutorials:\r\nIntroduction (The Basics), Strategy, Management and Analysis, Apps and Integrations, and Advertizing. Each tutorial focuses on a specific aspect of marketing on\r\nFacebook, with the exception of the Introduction tutorial which provides a\r\nbrief historical overview of Facebook and gives a basic understanding of the\r\nsocial media platform. Furthermore, each tutorial includes a number of quiz\r\nquestions to help the student remembering the information. Finally, every\r\ntutorial ends with a question that aims to support in developing as well as stimulate\r\nthe student to critically thinking about his/her Facebook marketing strategy and presence&nbsp;.&nbsp;</p><p>Course runs about 4hrs</p><p></p><p></p>\r\n", 
    "end_date": null, 
    "title": "Facebook:Masters Course Everything you Need and Should Know.", 
    "price": "40.00", 
    "instructors": "IMNL America", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53399_4492_7.jpg", 
    "course_url": "https://www.udemy.com/facebookmasters-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-11T13:37:18Z"
}