{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Learn How To Monetise Your Facebook Fan Page! </strong></p><p><span><br>Are you tired of struggling financially? Do you feel as though you're not able to bring your family the life they deserve, due to financial roadblocks? Are you ready to EXPLODE your income? <br><strong><br><span>Facebook Marketing - Make passive income with Facebook FanPage</span> </strong>will share some of the best methods for earning money online using Facebook, and will provide step-by-step instructions on how to use this platform most effectively. If you are looking for a detailed roadmap that will guide you along the path to making thousands online using your Facebook Fan Page, this is the perfect Udemy Course for you! <br><br><strong><span>What You'll Learn:</span> </strong><br><br>•\tTop methods for earning passive income using your facebook fanpage <br>•\tDetailed step-by-step instructions for each earning method <br>•\tHow to create a responsive fan page that will attract the right audience who will be your customers for years to come <br>•\tPowerful tips and strategies that will help you with any earning opportunity you decide to pursue <br><br><br>The information in this Udemy Course will help you to take your income to the next level, and will help anyone who is interested in having the perks of an online business: unprecedented levels of freedom, and of course, no limits to how high you can grow your income. You will learn everything that you need to establish a stream of income, with some consistency and hard work. </span></p><p>To become a student, find the blue \"take this course\" button or the \"start free preview\" button above to enroll. You risk no money enrolling because of the 30 day no questions asked refund policy. 98% of students do not request a refund which then just leaves your time. <br></p><p><strong><span>Thank you for learning more about my course</span> </strong>and I hope what I share with you when you are enrolled in the course will prove helpful! Click on<span> <strong>TAKE THIS COURSE</strong></span> now to get started!</p>", 
    "end_date": null, 
    "title": "Facebook Marketing-Beginners Guide To Monetizing Facebook", 
    "price": "20.00", 
    "instructors": "Alex Addo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674622_b02d_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-make-passive-income-with-facebook-fanpage/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T16:02:40Z"
}