{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>\r\n\t Instructores Percy Odonez y Oscar Gomez Jr. com más de 20 años de experiencia en Diseño Gráfico y Marketing. Hemos creado este curso único para llevar a tu empresa, marca o servicio al siguiente nivel y generar dinero con estrategias de venta específicas para Internet.\r\n</p>\r\n<p>\r\n\t Percy Odonez: Diseñador gráfico y instructor de diseño web. Tambien educador certificado en Adobe de lo programas Photoshop, Dreamweaver y Flash y cuento con mas de 10 años de experiencia en esta área, trabajo dando cursos de diseño web en una escuela técnica publica en la ciudad de Miami.\r\n</p>\r\n<p>\r\n\t He enseñado a alumnos de México, Centro, Sudamerica y el Caribe en el área gráfica y web. <br>\r\n\t <br>\r\n\t Mi propósito y meta es ahorrarte tiempo, dolores de cabeza y ayudarte a crear imagenes profesionales y creativas para tu website o blog aunque sea tu primera vez usando Photoshop. <br>\r\n\t <br>\r\n\t Me enfocare en la parte visual de como mejorar tu website o blog aprenderas a hacer tus propios baners, artes para el web y diseños básicos de una manera fácil y practica. <br>\r\n\t <br>\r\n\t Además de daré muchos tips, secretos y pondré mi años de experiencia para tu beneficio de aprendizaje..estoy seguro que vas a aprender mucho, y sobre todo crearas una imagen profesional de tu marca, negocio o producto usando mi sistema de aprendizaje efectivo.\r\n</p>\r\n<p>\r\n\t Oscar Gomez Jr.: Diseñador Gráfico de profesión, con el correr del tiempo y la experiencia me sumergí en el apasionante mundo del Marketing y los negocios.\r\n</p>\r\n<p>\r\n\t Tengo mas de 10 años de experiencia en la industria de internet, publicidad y marcas. Mi propósito en este curso es enseñarte mi experiencia de todos estos años y ahorrarte mucho tiempo y dinero para que apliques las bases fundamentales de marca y marketing a cualquier producto o servicio que estes emprendiendo.\r\n</p>\r\n<p>\r\n\t Mi enfoque es que al final de este curso tengas una pagina comercial en Facebook que realmente convierta a tus fans en clientes repetitivos a largo plazo y generes una relacion de confianza con ellos.\r\n</p>\r\n<p>\r\n\t Estare dando material adicional en PDF para que puedas imprimir y lo tengas a la mano para poder ir aplicando a tu propio ritmo todo mi conocimiento a tu producto o servicio.\r\n</p>", 
    "end_date": null, 
    "title": "Facebook Marketing: Como atraer clientes con Facebook", 
    "price": "30.00", 
    "instructors": "Jr. Oscar Gomez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58572_e842_4.jpg", 
    "course_url": "https://www.udemy.com/como-atraer-clientes-con-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-06T11:43:25Z"
}