{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\"></strong><span><strong style=\"\">Facebook Marketing For Authors</strong> will allow authors and publishers to learn how to effectively market their books on Facebook to instantly get in front of people who are fans of the topics you are writing in.</span>  </p>  <p>  \t<strong style=\"\">Master the art of instantly getting your books in front of the most targeted fans on the web in as little as 7 minutes!</strong>  </p>  <p>  \tAre you struggling to get more exposure for your books? Are your books just not getting enough eyeballs on them? Promoting your books on the powerful platform of Facebook will get your books in front of the right people with minimal effort and cost.  </p>  <p>  \tYou will be able to:  </p>  <ul style=\"\">  \t<li>Market your books to a highly targeted audience - to people who are actually interested in your books</li>  \t<li>Quickly find more people who are avid readers of the topic you are publishing in who will keep coming back to buy your books</li>  \t<li>Create Facebook ads that will aim to get readers interested in your book</li>  \t<li>Get new fans without spending tons of money doing so</li>  </ul>  <p>  \t<strong style=\"\">Facebook Marketing for authors is designed specifically for authors who desire a larger following without breaking the bank</strong>. Promoting your books on Facebook will allow you to instantly market your book to people who are already reading other books in the topic you are writing about.  </p>  <p>  \tIn the course, we show you step by step how to find these people as well as tailor your message so they are more likely to click through to the books you are promoting.  </p>  <p>  \tThere is no other marketplace out there that has this kind of power to reach highly targeted people and we show you exactly how to do that. You will be bragging to all your friends in no time that you know how to find people who are interested in your genre! This is so exciting!  </p>  <p>  \t<span><strong style=\"\">Content Overview</strong></span>  </p>  <p>  \tThis course is suitable for people who have never done paid advertising before. I’ve never done paid advertising before Facebook came along and it’s the easiest platform to learn on (and funnest for that matter).  </p>  <p>  \tAll too often authors are stuck in a rut on how to promote their books effectively. This course takes you from starting from nothing (or very little) to finding people who will be excited to see what you’ve got to offer.  </p>  <p>  \tHere is just some of what you will discover with this course:  </p>  <ul style=\"\">  \t<li>Why Facebook is the most powerful place online to promote your books</li>  \t<li>How to instantly find people to target who already have interest in your subject matter and niche (this is really fun and it works like a charm)</li>  \t<li>What to say in your advertising to compel people to look at your offers</li>  \t<li>How to market your books effectively to get the most out of your advertising spent</li>  \t<li>How to not ‘break the bank’ with simple ads targeting the right people on Facebook</li>  \t<li>How to adapt ads to your audience so they respond (this is really cool and most people miss this)</li>  \t<li>A step by step Facebook ad creation process that gets easier and easier (it’s amazing how that happens)</li>  \t<li>And much more from an experienced Facebook marketer and author</li>  </ul>  <p>  \tThis course is packed with tons of information that you can use for LIFE in your marketing! It’s very exciting!  </p>  <p>  \tBut wait, there’s more…  </p>  <p>  \tWe added a <strong style=\"\"><em style=\"\">BONUS SECTION</em></strong> to this value packed course. In the Bonus Module, we go through how you can get even more out of your Facebook Advertising. There’s one little trick that marketers are using to re-engage people who might not have taken action the first time they click on your ad. There is a special way that we are going to show you how you can actually market to these highly targeted people a second time. You see, not everyone will take action right away and we’ll show you how to take advantage of a simple feature inside of Facebook that is highly underutilized but highly effective!  </p>  <p>  \t<strong style=\"\">Click Take This Course right now and begin getting more exposure with Facebook advertising immediately.</strong>  </p>", 
    "end_date": null, 
    "title": "Facebook Marketing For Authors", 
    "price": "20.00", 
    "instructors": "Cassandra Cholaki, Deborah Drum", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417852_ee1e_5.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-for-authors/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T00:30:37Z"
}