{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Facebook marketing course for business</strong>--small , medium, and large--interested in building brand awareness,  improving reputation and credibility, generating sales leads, and growing a loyal base of customers. Join us!  </p>  <p style=\"\">  \t    As a business owner, I know that you’re constantly focused on reaching more people, targeting better customers, and helping all of these people understand the benefits of buying your products and services--Facebook marketing can be your secret weapon. In this Facebook marketing course I will quickly educate you on how to use Facebook to reach the right people, turn them into customers, and then get them to actually market to all their Facebook friends. It isn’t some fancy marketing scheme or magic; it’s just leveraging the inherent social and viral nature of Facebook.  </p>  <p style=\"\">  \t    Facebook marketing can be confusing, even to the most seasoned Facebook user. There are so many options and Facebook is constantly changing things. That’s why a Facebook marketing course like this one, taught by a seasoned and practicing Facebook marketing professional, can be so valuable.  </p>  <p style=\"\">  \t    We will bring together and continually update all of the Facebook best practices in this course. A course that you have lifetime access to and we will continually support and expand. <strong style=\"\">This course will get your started with the most basic of Facebook marketing skills and then grow with your business into more advanced and comprehensive Facebook strategy.</strong>  </p>  <p style=\"\">  \t    During this course I will help you to quickly and simply:  </p>  <ul style=\"\">  \t<li style=\"\">Setup a Facebook Fan Page for your business</li>  \t<li style=\"\">Create and publishing interesting and compelling content</li>  \t<li style=\"\">Attract the right kinds of Facebook Fans, people that want to buy and share</li>  \t<li style=\"\">Develop these Facebook Likes into an army of loyal fans growing your business</li>  \t<li style=\"\">Engage these customers over and over for sustained revenue growth</li>  </ul>  <p style=\"\">  \t    This course goes beyond academic theory and encourages you to work through real examples and immediately apply them to your own Facebook marketing plan and business Fan Page.  </p>  <p style=\"\">  \t    Our Facebook marketing course can be completed in a couple of days, resulting in a fully functional, highly effective Facebook marketing platform for your business.  </p>  <p style=\"\">  \t    Are you ready to grow your small business with Facebook marketing?  </p>  <p style=\"\">  \t<strong style=\"\">  This course will give you access to a multitude of successful Facebook marketing ideas and strategies. You will be building brand awareness, gaining loyal customers, and generating sales leads and revenue in know time.</strong>  </p>", 
    "end_date": null, 
    "title": "Facebook for Small Business", 
    "price": "20.00", 
    "instructors": "Bill Rice", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151518_7730_4.jpg", 
    "course_url": "https://www.udemy.com/facebook-for-small-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T18:07:15Z"
}