{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">If you&#039;ve ever looked at your competitors and become jealous of the number of &quot;likes&quot; on their Facebook page, this course is for you.</p><p style=\"\">You&#039;ll learn exactly what it takes to build a large community of followers on Facebook using the power of affordable Facebook ads. </p><p style=\"\">With a proven step-by-step formula that&#039;s easy to implement, you&#039;ll set up a Facebook ad campaign that will effectively get people interested in your business.</p><p style=\"\">After all, the more followers you have on social media, the more traffic you can get to your site, and the more sales you can make.</p><p style=\"\"><strong style=\"\">Harness the Power of Facebook to Drive More Traffic to Your Site &amp; Boost Profits</strong></p><ul style=\"\"><li style=\"\">Research Your Target Audience Quickly and Easily</li><li style=\"\">Create the Right Customer Avatar, Ad Copy, and Ad Image</li><li style=\"\">Set Up and Launch a Facebook Ad Campaign</li><li style=\"\">Measure and Split-Test Every Ad&#039;s Effectiveness</li></ul><p style=\"\"><strong style=\"\"><br style=\"\">Dive Deep Into Facebook Advertising That Works</strong><br style=\"\"></p><p style=\"\">This course will teach you everything you need to set up a successful Facebook ad campaign from start to finish, including how to avoid common mistakes and pitfalls. </p><p style=\"\">You&#039;ll learn how to research your target audience in less than 20 minutes, use Facebook&#039;s targeting functions like a pro, and get &quot;likes&quot; for as low as $0.20 per U.S. Page Like.</p><p style=\"\">By knowing how to garner more attention for your business on Facebook, you&#039;ll be able to drive more traffic to your site, use your fans as social proof to sell more products and/or services, and lower your advertising costs. </p><p style=\"\"><strong style=\"\">Contents and Overview</strong></p><p style=\"\">This course begins with an introduction into why a strong Facebook presence is so important for any business today.</p><p style=\"\">You&#039;ll then move on to an easy-to-implement 3-step process for creating a successful ad campaign on Facebook.</p><p style=\"\">The first step involves researching your audience using accurate data from sources like Facebook Audience Insights. </p><p style=\"\">These skills will allow you to find the people that will be most interested in your products or services so you can target your ad.</p><p style=\"\">Next, you&#039;ll learn how to set up a winning customer avatar to connect with your audience and get them interested in what you have to say.</p><p style=\"\">You&#039;ll even master how to use the right sales copy and images to grab people&#039;s attention.</p><p style=\"\">Finally, you&#039;ll learn how to set up your campaign, including scheduling, pricing, and placement.</p><p style=\"\">To test the effectiveness of every campaign and measure one campaign&#039;s success against another, you&#039;ll finish off this course by learning about split-testing to see what works best for your business.</p><p style=\"\">By the time you finish this course, you&#039;ll be able to get more likes on Facebook, thanks to your ability to create an ad campaign that works.</p> You&#039;ll be able to build a larger community of followers on social media with minimal investment, and this will help drive more traffic to your site and increase conversions.", 
    "end_date": null, 
    "title": "Facebook Marketing: Set Up Your First Like Campaign", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575592_c8ca.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-like-campaign/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T11:18:40Z"
}