{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is designed for those who want to grow their business with Facebook Marketing like a professional agency.</p>    <p>You’ll discover how to deploy our proven &amp; tested Facebook Marketing strategies to build up your fan base, generate more leads and sell more of your products or services.</p>      <p><strong>Learn How to Use Advanced Facebook Targeting Methods To Scale Your Business</strong></p>  <p><strong> </strong></p>  <ul><li>Generate more income by reaching out to your customers and email subscribers</li><li>Reach out to website visitors and turn them into paying customers </li><li>Harness the power of Lookalike Audiences and increase your campaign ROI</li></ul><p><br><strong>Grow Your Business Faster And Master The Art Of Facebook Targeting</strong></p>    <p>At the beginning of this course, we have an entire module dedicated to Custom Audiences. </p>  <p>You’ll learn what they are, why Custom Audiences are so useful and how you can generate more profits by leveraging your existing customers, email subscribers and app users. </p>    <p>Next, you’ll tackle retargeting - the latest trend in digital marketing. You’ll discover advanced retargeting strategies covering how to reach out to your website visitors to build up your fan base, generate leads and sell more products &amp; services. </p>    <p>Then, we’ll cover an advanced feature called Lookalike Audiences. I’ll show you how to turn Facebook users into paying customers and how to set up ads to reach out to these people.</p>    <p>By the end of this course, you'll be ready to deploy advanced Facebook targeting strategies, create efficient campaigns and grow your business instantly.</p>    <p>You'll be ready to promote your business by deploying the worlds most advanced and proven marketing strategies for high profit margins. </p>", 
    "end_date": null, 
    "title": "Facebook Marketing: Advanced Targeting Strategies", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626414_d5fd_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-advanced-targeting-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T23:06:19Z"
}