{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>GUARANTEED MONEY BACK!!!!!!!!!!!  YOU HAVE NOTHING TO LOSE ONLY TO GAIN!!!!  JOIN NOW AND START MAKING THE INCOME YOU DESERVE......\n</strong></p>\n\n<p><strong>Updated April 27, 2016</strong></p><p><br></p><p>Do you have an awesome product and want to show the world? Facebook ads are the best way to get the message out today. Why? How many people do you know that have a Facebook page? It's the second most popular site in the world coming after Google.</p>\n\n<p><strong>Regular $199 Holiday Price</strong></p>\n\n<p><strong></strong>We try to keep our courses short and to the point.  If you are looking for ten hours of content this isn't the course for you.  If you want to learn how to use create Facebook campaigns that work in the fastest possible manner you are in the right place.  <strong>We do not bullshit</strong>, we are here to teach the truth and <strong>No Gimmicks Here</strong>. Feel free to leave us a comment.</p>\n\n<p><strong>Students can expect to learn:</strong></p>\n\n<ul><li>Facebook Guidelines</li><li>Targeted Audiences</li><li>How To Create FaceBook Campaigns</li><li>How the bidding techniques function for FaceBook Ads</li><li>FaceBook Groups</li><li>How To Get $0.01 CPC on Facebook Ads</li></ul>\n\n<p>We <strong>show proof of 5,000 likes in less than 48 hrs</strong>.  Let us teach you these strategies today.  <strong>Enroll in our course</strong> and we can share these techniques with you.  You will be simply amazed just how simple it really can be.</p>\n\n<p>We recently ran a Facebook campaign for our Blogging Professor page.  It received over 7,000 likes within four days.  We only spent around $175.  Go look at the<strong> Facebook page BloggingProfessor </strong> for yourself.</p>\n\n<p>  \t<strong>Top Reasons to Take This Course today!</strong>  </p>\n\n<p>  \t  1.  It comes with a <strong>30 day money-back guarantee </strong>so what do you have to lose.  </p>\n\n<p>  \t  2.  You will have lifetime access to this course. <strong> I will be updating this course frequently</strong>.  Most likely at least once per month plus when Facebook rolls out new advertising updates.  </p>\n\n<p>  \t  3.  <strong>You have access to wealth of knowledge</strong> to help you Set up the best possible campaigns on Facebook advertising.  If you need one on one help that can be arranged as well.  I am here to make sure you succeed.</p>\n\n<p>  \t  4.  After completing the course <strong>you will be able to use it to benefit your businesses </strong>growth and/or convert more sells.  </p>\n\n<p>  \t  This course will be one of the most helpful and useful courses you take to improve your business overall.  If you don't agree simply request a refund.  </p>\n\n<p>  \t  Facebook is the second most popular site in the world.  I can't think of a better weapon to have for increasing sales and growth.</p>", 
    "end_date": null, 
    "title": "Facebook Ads: Grow Your Business’s Facebook Page", 
    "price": "20.00", 
    "instructors": "Mitch Stevens", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420532_a450_6.jpg", 
    "course_url": "https://www.udemy.com/facebook-ads-grow-your-business-facebook-page/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T20:08:09Z"
}