{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>**2015 VERSION UPDATED - JOIN 13,000+ SUCCESSFUL STUDENTS!**</strong><br></p>    <p>  \t      Do you want over 1000 Genuine and Targeted Facebook Likes for your Facebook Page?  </p>  <p>  \t      Do you want to reach these potential customers in the quickest time possible?  </p>  <p>  \t      Want to learn the simple strategies and techniques that pages with 100 000+ likes know?  </p>  <p>  \t      Best of all... Do you want to do this for FREE? Without spending a dollar of your money on ineffective and overpriced Facebook ads?!  </p>  <p>  \t      Then join our comprehensive course and community of Facebook page owners gaining hundreds of likes every single day using the knowledge and simple strategies contained in this course!  </p>  <p>  \t      I used to spend hours every day trying to find content that a handful of fans would find interesting, only to see my posts get ZERO INTERACTION and disappointedly watch my \"29 likes\" remain stationary for weeks!  </p>  <p>  \tI was putting in hours of my time and effort just to see other pages gaining hundreds of Likes every day regardless that their content was poor!I was disappointed and confused...  </p>  <p>  \t      Instead of throwing money at my problems and spending $1000 on Facebook ads just to get 32 unengaged fans. I thought \"There must be a better way.\"  </p>  <p>  \t      Through countless hours of research, interviews and experimentation I learned how to literally: Attract Thousands of Facebook likes EVERY DAY  </p>  <p>  \t<strong>I EVEN IMPRESSED MYSELF GROWING A FACEBOOK FAN PAGE TO 1 600 000, yes 1.6 million, LIKES IN JUST 2 WEEKS!</strong>  </p>      <p>  \t      Does spending 15 minutes of your time a day to attract 1000 new customers to your Small Business Facebook page sound appealing to you?   \t  \t      I wanted to share the secrets, and simple strategies that I learned in order to save you the countless amount of hours, effort and mistakes that I repetitively made. So I have compiled them in a comprehensive step-by-step guide so that you can see the same results with your Small Business Facebook Page!  </p>  <p>  \t<em>\"Knowledge is power only if a man knows what facts not to bother with\"</em>- Robert Lynd  </p>  <p>  \t      <strong>IN THIS COURSE YOU WILL LEARN:</strong>  </p>  <ul>  \t<li>An exact blueprint to optimize your Facebook account to maximise your likes and engagement.</li>  \t<li>A full-proof system of how to automatically increase your Facebook reach and Influence.</li>  \t<li>Proven strategies for promoting your Facebook page to 1000's OF RELEVANT AND REAL PEOPLE everyday in your desired niche!</li>  </ul>  <p>  \t      The Video course is presented in easy to learn modules that first explain the theory behind these techniques, and then show LIVE demonstrations of them on my Facebook Pages. I have also included PDF versions of the slides these techniques super easy for easy future reference.  </p>  <p>  \t      If you have, or are planning on creating a Small Business Facebook Page I guarantee you that the knowledge and strategies in this class will be the quickest and most effective way to achieving to your first 1000 relative, genuine, and targeted fans!  </p>  <p>  \t      I will also personally respond to all questions and queries (and even provide my personal email address!) so that you can implement these simple strategies in a fool-proof way.  </p>  <p>  \t      I know the power of having a massive audience on one of the world's most important social media platforms and I can't wait to help you get there!  </p>  <p>  \t      See you on the inside :) </p><p> \t      - Benji  </p>", 
    "end_date": null, 
    "title": "Facebook Marketing: A Step-by-Step to Your First 1000 Fans!", 
    "price": "20.00", 
    "instructors": "BenJamin Wilson", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/194754_70fc_19.jpg", 
    "course_url": "https://www.udemy.com/facebook-pages/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-07T00:16:57Z"
}