{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In the facebook for beginners course, I take you by hand and help you learn everything from signing up for a facebook account to how you can properly adjust your privacy and then posting your first status update.<br></p>  <p>  \t  It does not end there, I will help you learn all the core features of a new facebook account. So after you complete this training, you will have a better understanding of a personal facebook account.  </p>  <p>  \t  This facebook training is suitable for those who are completely new to the facebook platform. I have recorded to-the-point videos which will help you learn exactly what you need, no fluff no filler.  </p>  <p>  \t  Take this course and learn,  </p>  <ul>  \t<li>How to sign up for facebook account</li>  \t<li>Your facebook account overview</li>  \t<li>Configuring your facebook privacy settings</li>  \t<li>How to change cover photo on facebook</li>  \t<li>How to post facebook status updates</li>  \t<li>How to post comment on facebook</li>  \t<li>How to add friends on facebook, find friends</li>  \t<li>How to complete your facebook profile</li>  \t<li>How to create facebook photo album</li>  \t<li>How to upload video to facebook</li>  \t<li>How to chat on facebook &amp; use facebook messages</li>  \t<li>How to like pages on facebook and follow updates from celebrities and brands</li>  \t<li>How to hide posts on facebook &amp; unfollowing on facebook</li>  \t<li>How to block someone on facebook</li>  \t<li>How to share a link on facebook</li>  \t<li>How to add life event on facebook</li>  \t<li>Everything about facebook notifications</li>  \t<li>How to use a custom facebook vanity url</li>  \t<li>How to post from facebook to twitter</li>  \t<li>How to add facebook follow button, facebook like button, and facebook share buttons on your website</li>  \t<li>And many more!</li>  </ul>  <p>  \t  The course is mainly video based but it also has text and links to external resources. This course won't take more than few hours to complete &amp; master, but you can take all your time to learn and explore.  </p>  <p>  \t  By taking this course, you are not just getting these videos but also getting access to me as your teacher, your friend. You can ask me for help anytime you want through the discussions, groups, email or social media.  </p>  <p>  \tIn the future, I will update these videos when facebook makes new changes to their system. You get lifetime access to the future videos.  </p>  <p>  \tSo don't wait, sign up for this course and I will see you on the other side!  </p>", 
    "end_date": null, 
    "title": "Facebook Training: Facebook for Beginners - 2016 Updated", 
    "price": "25.00", 
    "instructors": "Tamal Anwar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374488_c194_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-training-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T14:29:55Z"
}