{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is for those that want more likes and engagement on their Facebook Page, who feel there is more to discover or who want to set up their Facebook properly as the first 30 days are crucial. Also those who want to use analytics to increase engagement (comments and shares) of their status updates. Do you need to understand Facebook Optimisation (FBO) such as Last Actor 50 and how to leverage it? We also cover Facebook Advertising and 3rd party platforms, adding Instagram and YouTube to your Facebook Page and so on. </p><ul><li>Create your Facebook Page (tips of what to avoid)</li><li>Understand and leverage Facebook Optimisation (get in the Newsfeed!)</li><li>Get more Likes and Engagement (shares and comments)</li><li>Use Facebook Analytics and write a report. </li><li>Create Facebook Ads and Understand the marketing intelligence</li></ul><p><strong>TIME POOR?</strong> You don't need to do this course if you are happy flitting around the 'net, watching random videos, and reading blogs etc.<strong> But short on time? </strong>Then that's what this course is about. </p><p><strong>LOW PRICE</strong> I priced it low currently - you can pay more for my <em>real life</em> classes if you like :P - to make it accessible to everyone, in every country, in every job and for every reason. The price will go up a little in December 2015 once I've added more videos lectures and an updated workbook to the course. Of course if you join now, you'll get all that later on too ;) but I will keep this course at a reasonable price. Still, it's cheaper right now. </p><p><strong>MENTORING</strong> If you think you could be doing better with your Facebook Page, have any questions, need some help, come right on in.  The Q&amp;A forum has some good questions from students in it - please add your's  - and I'm adding videos based on their priorities (adding Instagram for Business seems to be popular!). Please join in and don't forget to post your Facebook Page in the Discussion area for feedback. </p><p>****</p><p>If you download the Udemy app on iPhone or Android, don't forget to select High Def HD in the settings and play in full screen (double tap) to see the demonstrations clearly. </p><p>I've managed the strategy, campaigns and Facebook Pages and forums and blogs of TV shows such as JUNIOR MASTERCHEF, IDOL and BIG BROTHER. I specifically adapted these quick courses to bring social media managers like you up to speed efficiently and cost effectively. Look out for my other courses!</p><p>SHORT COURSE: This is a mini-course that is part of a much larger Social Media Campaign course - you will find some videos duplicated from the Campaign course on my corporate account. Some students just want a quick and easy course on one aspect of campaigns - that is the purpose of this course. So if you are just looking for measurement and analytics tools and strategies as part of social media campaigns, this is the course for you!</p><p>Key Information on Udemy and this Course (first lecture in last section).</p>", 
    "end_date": null, 
    "title": "Facebook Optimization (FBO) for Facebook Pages SEO Algorithm", 
    "price": "20.00", 
    "instructors": "Laurel Papworth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629342_bf4b.jpg", 
    "course_url": "https://www.udemy.com/facebook-foundation/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T03:02:42Z"
}