{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">LATEST UPDATE: September, 2015</strong></em></p><p><strong style=\"\">Entrepreneur&#039;s Guide to Driving Highly Targeted Facebook Traffic</strong></p><p>Do you want to learn how to drive cheap &amp; highly targeted Facebook traffic to your website or blog, increase the amount of visitors, grow your audience and increase your revenue?</p><p>If you already have a website that needs more visitors instantly without having to spend lots of money on Facebook traffic, then this course will help. <br style=\"\"> <br style=\"\"> Most likely your business has a traffic problem, but we will solve it! We&#039;ll show you a traffic technique that works right now. It might not work forever, but it does in this very moment…</p><p>…and we apply it on a daily basis!</p><p><em style=\"\">Learn how to gain access to more than 1 billion potential customers that are on Facebook everyday, and turn them into your website visitors for only a few cents per click!</em></p><p><strong style=\"\">Get highly targeted &amp; cheap Facebook traffic</strong></p><ul style=\"\"><li>Walk through the setup of a targeted Facebook campaign</li><li>Discover a traffic strategy that is working RIGHT NOW</li><li>Run Facebook campaigns on a tight budget</li><li>Stop paying $1 per click on Facebook</li></ul><p><strong style=\"\"><br style=\"\">Contents and Overview</strong><br style=\"\"></p><p>The key element of cost effective Facebook traffic campaigns is a working strategy. </p><p>You&#039;ll start the course learning how to find your target audience. Unfortunately, 99% of companies don&#039;t know who their ideal client or website visitor is. Don&#039;t make this deadly mistake.</p><p>Then you&#039;ll discover how to find and craft the best content in your niche market. If you want to attract website visitors, you also need great and relevant content. I&#039;ll show you how to find the best pieces of content in your niche market that is proven to work.</p><p>Next, you&#039;ll test which content yields the highest engagement on your fan page. Once we figured that out, I&#039;ll walk you through the entire process of setting up a targeted Facebook campaign. If you&#039;ve never done it, then this course is perfect for you.</p> By the end of the course, you&#039;ll be ready drive highly targeted Facebook traffic for cents per click, grow your audience, and convert your visitors into customers. Your business will benefit.", 
    "end_date": null, 
    "title": "Facebook Marketing: Drive Highly Targeted Facebook Traffic", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598464_3e06.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-targeted-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T17:34:53Z"
}