{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Discover How You Can Use Facebook To Get A Flood Of Traffic To Your Website, Landing Pages Or Affiliate Offers FAST!!!</p><p>This online video tutorial course is for anyone who wants to master facebook marketing fast. This no nonsense online training program will enable you to create professional Facebook marketing strategies that are low cost and far reaching.</p><p>If you are in business to make money and GROW your profits then you need traffic and lots of it!. More importantly you need a traffic source that is reliable and low cost.</p><p>That&#039;s why YOU NEED to use Facebook. Facebook is the #1 sourcefor sustainable and manageable traffic that any business can afford.</p><p>DON&#039;T GET DISTRACTED BY FLY-BY-NIGHT, UNWORKABLE SHINY OBJECTS... Start to build you organic and low cost traffic the right way. The proven way to build your business professionally!</p><p>Discover the REAL REASON Why you need to get page likes..There is a psychology to getting the best from facebook and I will make sure you walk away with a deep understanding of how YOU and your business can take a MASSIVE UNFAIR ADVANTAGE over your competition purely because YOU will understand what&#039;s important and ditching everything else..</p><p><strong style=\"\">THE $5 VIDEO BOOST METHOD</strong>I will also share with you a strategy that we have been using for ourselves and some of our client called &quot;The $5 Video Boost Method&quot;which has helped us to expand our reach, get more page likes, send laser targeted traffic to our websites and exponentially increase leads and sales.</p>", 
    "end_date": null, 
    "title": "Facebook Traffic Academy", 
    "price": "25.00", 
    "instructors": "Andy Phillips", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515376_814c_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-traffic-academy/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T11:21:22Z"
}