{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>\"Information of this calibre is hard to find; Helen is an expert and a very generous one too! </em><em>Mailing lists, lead magnets this is like a mini degree in Facebook marketing.\"</em> Claire G</p>\n\n<p><strong>Tired of spending precious time on your Facebook page when only a handful of people ever get to see what you've posted?</strong></p>\n\n\n\n<p>(Course updated May 2016)</p>\n\n\n\n<p>Since mid-2014, it's become a huge challenge for a micro business (0-9 employees) to get their Facebook page posts seen by the people who have liked their page. </p>\n\n\n\n<p>One solution is to pay for Facebook advertising, but many micro business owners don't...</p>\n\n\n\n<p>- Have the skills to do that effectively, or</p>\n\n\n\n<p>- The time to learn how to do it right, or</p>\n\n\n\n<p>- The budget to outsource it to a consultant.</p>\n\n\n\n<p>And even if they <em>can</em> do one of those things, they want to keep their ad budget as low as they possibly can. And who can blame them?</p>\n\n\n\n<p>If you're nodding your head in agreement, you'll want to seriously consider using Facebook groups for marketing. Here's why:</p>\n\n\n\n<p>- Posts in Facebook group posts are far more likely to appear in member's feeds compared to posts on a Facebook page.</p>\n\n\n\n<p>- If you do it right, you can use a Facebook group to build trust, grow relationships and position yourself as the go-to expert.</p>\n\n\n\n<p>- You're not just promoting a product, you're building a community of fans who will tell each other how great your product or service is <em>and</em> invite their friends too.</p>\n\n\n\n<p>But it's not as easy as it sounds. As an administrator of several Facebook groups for micro business owners, I know first-hand how many of them go about their marketing in precisely the wrong way.</p>\n\n\n\n<p> Far from bringing in new clients and sales from Facebook groups, they annoy people, risk having their Facebook account closed for engaging in commercial activity where it isn't allowed or simply waste their marketing efforts on techniques that don't work.</p>\n\n\n\n<p>Take this course and I'll show you how to use Facebook groups for marketing the right way, including:</p>\n\n\n\n<p>- What to post and how to interact in other people's Facebook groups to benefit your business</p>\n\n\n\n<p>- How to design and set up your own Facebook group so that it leads to new clients and sales</p>\n\n\n\n<p>- How to quickly and easily create content for your own group so that you delight your existing members and attract new ones</p>\n\n\n\n<p>- How to be the group member and the group administrator that everyone loves</p>\n\n\n\n<p>- How to set up your Facebook group, profile and pages so that you can build a mailing list from your activity in groups</p>\n\n\n\n<p>Taught by social media marketing trainer Helen Lindop, this is a practical course with action steps throughout. If you follow the steps you'll have your own Facebook group set up and running by the end of the course.</p>\n\n\n\n<p>Join this course now and your business won't be invisible on Facebook any more!</p>\n\n\n\n<p>#facebook #facebookmarketing #facebookgroups #facebookforbusiness</p>", 
    "end_date": null, 
    "title": "Facebook Marketing: Facebook Groups for Small Business", 
    "price": "25.00", 
    "instructors": "Helen Lindop", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420106_8883_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-facebook-groups-for-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T11:14:10Z"
}