{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul style=\"\">  \t<ul style=\"\">  \t\t<ul style=\"\">  \t\t\t<ul style=\"\">  \t\t\t\t<p style=\"\">  \t\t\t\t\tIt’s almost an understatement that Facebook is one of the most popular websites on the Internet. With over one billion users, Facebook is the 2nd-most visited website on the Internet (behind Google). When you advertise on Facebook you’re in-front of an audience that is unparalleled in modern advertising.  <strong style=\"\">Facebook Advertising for Beginners</strong> provides you a step-by-step recipe for getting your business (whether it be a product or service) in front of these eyeballs and converting this exposure into sales.  \t\t\t\t</p>  \t\t\t\t<p style=\"\">  \t\t\t\t\tThis step-by-step, nine-part video series takes you by the hand and shows you how to quickly plan, setup, and execute Facebook Ad campaign correctly and effectively.  \t\t\t\t</p>  \t\t\t\t<p style=\"\">  \t\t\t\t\tYou’ll learn…  \t\t\t\t</p>  \t\t\t\t<ul style=\"\">  \t\t\t\t\t<p style=\"\">  \t\t\t\t\t\tHow Facebook’s targeted advertising allows advertisers to target a specific group of people based on age, personal interests and more.  \t\t\t\t\t</p>  \t\t\t\t\t<p style=\"\">  \t\t\t\t\t\tHow Facebook ads are more flexible than other similar forms of advertising such as Google AdWords.  \t\t\t\t\t</p>  \t\t\t\t\t<p style=\"\">  \t\t\t\t\t\tHow Facebook advertising offers users heightened audience engagement which translates higher retention rates and improved ad visibility.  \t\t\t\t\t</p>  \t\t\t\t\t<p style=\"\">  \t\t\t\t\t\tHow Facebook facilitates multiple ad views which means your ads have a better chance of getting noticed or having a positive effect when seen multiple times.  \t\t\t\t\t</p>  \t\t\t\t\t<p style=\"\">  \t\t\t\t\t\tHow Facebook effectively reaches smart-phone users which means not only have the ability to reach computer and laptop users, but people out in the world as well.  \t\t\t\t\t</p>  \t\t\t\t\t<p style=\"\">  \t\t\t\t\t\tAnd much more!  \t\t\t\t\t</p>  \t\t\t\t</ul>  \t\t\t\t<p style=\"\">  \t\t\t\t\t<strong style=\"\"></strong>  \t\t\t\t</p>  \t\t\t</ul>  \t\t</ul>  \t</ul>  </ul>", 
    "end_date": null, 
    "title": "Facebook Advertising for Beginners", 
    "price": "30.00", 
    "instructors": "CT Stewart", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/181386_a551_4.jpg", 
    "course_url": "https://www.udemy.com/fb_ads_4_beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-13T03:37:13Z"
}