{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In questo corso insegno le tecniche usate da me per scrivere <strong>post che raggiungono milioni di utenti</strong> (senza sponsorizzarli, no Facebook ads!). <br>Io scrivo questi post per i miei clienti, politici e professionisti, ma <strong>chiunque</strong> può usare queste tecniche per la propria pagina e per quelle che segue.<br><br>Sono<strong> tecniche che Facebook stesso svela ai suoi clienti più importanti</strong>, in riunioni alle quali ho partecipato, insieme ad altre tecniche che ho appreso lavorando insieme a Vip.<br><br>E' un corso per tutti, come lo stesso Facebook è per tutti. Ogni passaggio è spiegato <strong>dettagliatamente</strong>, così come ogni termine. La soddisfazione sarà alta per gli utenti base, così come per quelli avanzati.<br><br>Il corso è estremamente pratico e va dritto al punto. Per questo ho fatto in modo di farlo durare (..)<br>Sono lezioni video, con slide, lezioni di testo e <strong>numerosi post di esempio</strong>. Una volta iscritti potrete rivedere il corso per sempre.<br><br>E' <strong>il primo corso al mondo</strong> che rivela tecniche di scrittura dei post basate sull'<strong>algoritmo segreto di Facebook</strong> - il quale decide quali post meritano di essere diffusi maggiormente -, e <strong>tecniche psicologiche </strong>per stimolare le emozioni che portano un contenuto ad essere condiviso, commentato e piaciuto.<br><br>Una volta terminato questo corso scriverai post al <strong>massimo livello</strong>. I tuoi risultati (o quelli dei tuoi clienti) impenneranno in quantità e qualità. La tua vita su Facebook, e quindi anche quella fuori, ti ringrazierà! <strong>Soddisfatti o rimborsati.<br><br>NOVITA': il corso è aggiornato con le nuove funzioni \"reactions\" e Facebook live (mentions)</strong></p>", 
    "end_date": null, 
    "title": "Facebook: come scrivo post da milioni di utenti (no ads)", 
    "price": "45.00", 
    "instructors": "Marco Venturini", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753646_451e_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-come-scrivo-post-da-milioni-di-utenti/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T18:25:15Z"
}