{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><strong>13,000+ Students </strong>have enrolled in my <strong>13 Courses!</strong></li><li>The <strong>4.75 Rating</strong><strong> from student reviews </strong>shows the value packed in this course!</li></ul>\n\n<p>Facebook is the largest Social Media Platform in the world (and it's not even close). Every business uses Facebook and it's become the main medium for communication in many areas of the world. That is why it's imperative to know how to manage a Facebook Page, bring in traffic from the platform or take advantage of Facebook Ads whether you're an entrepreneur, marketer or work in the corporate environment.</p>\n\n<p>Do you have a product/service that you want to market online? You've created a Facebook Page, invited all your friends and ended up with 237 Likes. You're frustrated because you can't get more traffic and you don't know what to do…</p>\n\n<p><strong>The answer is easy: you should become a Facebook Ninja!</strong></p>\n\n\n\n<p>I recently conducted an Ad campaign that was shown to 10,460 people and it brought me 1,806 Likes for $20.00. That's 0.01 Cost per Click. And they were all targeted. I had a result rate of 13.53%. And all of it happened in 7,200 minutes.</p>\n\n\n\n<p>Think about it: </p>\n\n\n\n<p>If you added all of the people that my Ad Campaign touched you could fill in a small football field…</p>\n\n\n\n<p>… and every one out of eight people took action and became a fan…</p>\n\n\n\n<p>…so once every 4 minutes I gained a new Fan…</p>\n\n\n\n<p>…and spent the amount equivalent to a nice lunch to get that</p>\n\n\n\n<p>Truth be told, I probably would have gotten more if I ordered some nice wine to go with it! The Case Study for this is in the course…</p>\n\n\n\n<p><strong>But is Facebook Marketing all about the Page Likes?</strong></p>\n\n\n\n<p>No, not at all. That's why this course only has a Intro Bootcamp to Facebook Ads. What I really want you to do is start with the basics. </p>\n\n\n\n<p>This course will take you through your Page Creation, Posting Strategy, Attracting fans without paying a dime and an introduction to Facebook Ads. Here's what you'll get:</p>\n\n\n\n<ul> <li><strong>The 1-Hour Page Magnet Creation</strong> - Create an professional looking Facebook Page through your Cover &amp; Profile Photos, Custom Tabs &amp; Apps</li> <li><strong>The Round-the-Clock Content Machine </strong>- build a posting strategy, create a content calendar, learn what to post, how to post it and how often to do it</li> <li><strong>The Facebook Ads BootCamp</strong> - learn the basics of how to advertise on the platform, get likes for $0.01 CPC or create Custom Audiences</li> </ul>\n\n\n\n<p>You also get 3 Bonuses:</p>\n\n\n\n<ul> <li><strong>The PDF Collection</strong> - Everything from examples of great looking Facebook Pages, to lists of Apps you can use, to your very own Content Calendar Template</li> <li><strong>The 0.01 Page Likes Case Study</strong>: Find out exactly how I managed to get 1,806 likes at $0.01 CPC. I'll show you this step-by-step</li> <li><strong>The Facebook Community Bonus</strong>: Join my Facebook community where we can share strategies and customised advice to take you to the next level.</li> </ul>\n\n\n\n<p><strong>The Guarantee</strong></p>\n\n\n\n<p>Take this course and go through it thoroughly. If after 30 days you don't see measurable results, then I demand you contact me immediately. There is a money-back guarantee, but apart from getting your money back, I will also personally jump on a call with you to provide specific advice for you to achieve success. I always want my students to be satisfied with a purchase and because of that I will do everything in my power to help you achieve your goals.</p>\n\n\n\n<p>The Blueprint is laid out there, you just have to take action and make the commitment to follow it.</p>\n\n\n\n<p><strong>Take this course now and I will see you in the classroom!</strong></p>", 
    "end_date": null, 
    "title": "Facebook Blueprint", 
    "price": "40.00", 
    "instructors": "Dragos Stefanescu, Richard Korbut", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508822_037a_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-fusion-how-i-got-1806-likes-at-001-cpc/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-22T11:54:19Z"
}