{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t If you&#039;re tired of wasting time and money trying to figure out why some facebook ads campaigns work and yours don&#039;t, <strong style=\"\">this is a course for you</strong>.  </p>  <p style=\"\">  \tIt&#039;s ideal for:  </p>  <ol style=\"\">  \t<li style=\"\">Affiliate Marketers</li>  \t<li style=\"\">People working in Digital Marketing</li>  \t<li style=\"\">Facebook Page Owners</li>  </ol>  <p style=\"\">  \t Created with <strong style=\"\">ease of use</strong> in mind, this course will take about <strong style=\"\">1 hour to complete</strong>, with <strong style=\"\">an additional hour</strong> spent doing research for the <strong style=\"\">practical test at the end</strong>. It&#039;ll all be fine, if you just follow along the easy to understand lectures.  </p>  <p style=\"\">  \t It&#039;s structured starting with the standard facebook ads interface, going through all the most important elements of setting up a campaign for success.  </p>  <p style=\"\">  \t<strong style=\"\">Take this course to learn advanced tactics around:</strong>  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">Optimizing ad images for greater impact</strong> - find out how you can edit your photos fast and free, online, without the need for expensive image-editing software.</li>  \t<li style=\"\"><strong style=\"\">Using power-words to get more clicks</strong> - these are not just simple words that you <em style=\"\">hope</em> will get your results, these are time-tested words and phrases that you can use right away for getting more clicks and attracting customers.</li>  \t<li style=\"\"><strong style=\"\">Creating Dark Posts and Custom Audiences in the Power Editor</strong> - this is a step-by-step how-to guide to create unpublished or dark posts and customizing them to maximize the effect they will have; I will show you how to create Custom Audiences using subscribers you already have in an email marketing software, like Mailchimp, and use that as a basis for Lookalike Audiences and/or ads.</li>  \t<li style=\"\"><strong style=\"\">Trying time-saving tools</strong> - you won&#039;t have to struggle anymore by editing each individual ad - either use the Power Editor for bulk editing or try on of these tools to save you lots of time, that you can use either optimizing or creating other successful campaigns.</li>  \t<li style=\"\"><strong style=\"\">Utilizing the normal facebook ads interface</strong> - how to get larger images in front of people and how to have more text in your ads, to allow more descriptive ads.</li>  </ol>", 
    "end_date": null, 
    "title": "Facebook Ads 2014: Advanced Training for Marketers", 
    "price": "20.00", 
    "instructors": "Sorin Amzu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165368_ae72_7.jpg", 
    "course_url": "https://www.udemy.com/facebook-ads-course-2014-advanced-training-for-marketers/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-17T01:40:29Z"
}