{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>******* JOIN OVER 8000 SUCCESSFUL STUDENTS WHO HAVE ALREADY REGISTERED ON THE COURSE *******</strong></p>  <p><strong>******* Over 30 Five Star Reviews *******</strong></p>  <p><strong>******* Facebook Secrets: How I Got 30,000 Likes At Very Low Cost *******</strong></p>  <p><strong>Are you interested in growing your Facebook follower-ship into a viable audience?</strong></p>  <p><strong>Do you want to pass your message to a larger audience or to increase your customer base?</strong></p>  <p><strong>Or maybe you want dominance in your industry when it comes to social media? Do you have 1.5 hours to learn?</strong></p>  <p>Whatever your motivation, I am happy to offer you a front row seat on my premier online course <strong><em>\"Facebook secrets: How I Got 30,000 Likes At Very Low Cost\".</em></strong> My course will get you there quickly and efficiently. Become part of our rapidly growing alumni comprising over 8000 students who have already enjoying the benefits of our course.</p>  <p><strong><em>5 STAR REVIEW: </em></strong></p>  <p><strong><em></em></strong></p>  <p><strong><em>Very Nice</em></strong></p>  <p><strong><em>I Really Enjoyed this Course. I'm a Full Time Photographer and marketing goes a long way. Can't wait to apply some of your advice to my page. Thanks. – Corey Reese (Student)</em></strong></p>  <p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>  <p>My students are happy with what they learnt and most of them have moved on to build some of the most enviable businesses online. You can start minting money today without any capital whatsoever, with immediate effect, just like the over 8000 students.</p>  <p><strong>This course comes with a 30-Day Guarantee!</strong></p>  <p><strong>Warning! </strong>If you are looking for a path to quick riches, a road paved with get rich quick fixes and powered by a desire for easy wealth, well, this is not the course for you. In fact do not attempt to register for this course if your goal is to become the next billionaire in the next two hours. Please do not waste your time here. Please run along because this course is not the answer to your get-rich-quick- pursuit. On the other hand, if you are looking to build something beautiful, something that demonstrates your focus and passion, then come along, we designed this course for you.</p>  <p>This course requires someone to study and to follow through with hard work. Your success will depend on your tenacity and will your will to succeed. The good news is that it does not require much capital; all you need to do is to follow very simple instructions based on my experience, and backed by my success.</p>  <p>The only thing you need next is to have a Facebook account. And yes, Facebook accounts are free. So get one right away and get ready to get on the path to success and riches. As soon as you complete the course, you will be ready to start earning money. That's it!</p>  <p>You can use what you have gained to help others set up pages and charge them for it!</p>  <ul><li><strong>You don't need a website to benefit from this course, </strong></li><li><strong>no domains and hosting, </strong></li><li><strong>no design and installations -</strong></li><li><strong>you only need a free Facebook account.</strong></li></ul>        <p><strong><em>5 STAR REVIEW: </em></strong></p>  <p><strong><em>Practical Training Useful course with easy to follow instructions. – Mike (Student)</em></strong></p>  <p>========================================================================</p>  <p><strong>This course will show you:</strong></p>  <p><strong>1. How I gathered 30,000 likes.</strong></p>  <p><strong>2. It will show you the step by step process I followed to attain this</strong></p>  <p><strong>feat, and in it,</strong></p>  <p><strong>3. You will learn ways of increasing the number of your Facebook likes.</strong></p>  <p><strong>4. It is not an issues whether you want to sell through your site, or</strong></p>  <p><strong>5. Whether you are looking for a way of increasing your influence in some</strong></p>  <p><strong>sphere, it works for everyone!</strong></p>  <p><strong><em>5 STAR REVIEW: </em></strong></p>  <p><strong><em>Honestly, this review is just the best.</em></strong></p>  <p><strong><em>If Facebook Likes is what you really really want, this course will show you one possible way to get it. It's the best course so far I have seen on getting Facebook Likes. Concise and straight to the point.- Ibrahim Gambo (Student)</em></strong></p>  <p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>  <p>About this course:</p>  <p>1. Over 8000 students who are now on the path to success have this course to thank,</p>  <p>2. The course does not require you to have a website or to create back links or anything like that</p>  <p>3. You can take a look at the reviews from former students who are extremely happy with their experience.</p>  <p>4. You will have full free lifetime access to the entire course materials</p>  <p>5. You will also have access to a variety of future courses and resources at no extra costs.</p>  <p>6. We prepare and send regular free bonuses and surprises to our former and current students.</p>  <p>7. You will become part of a motivated and excited community that forms our proud alumni</p>  <p>You can start increasing your Facebook likes today with a very small budget. And you will a healthy steady growth of your Facebook likes that will power your business, and will increase your influence</p>  <p>========================================================================</p>  <p>I will allow you to look into my business systems to understand for yourself how I build a following exceeding 30,000 likes. I will walk you through the entire process I went through to get here. I will walk with you in your journey towards increasing your Facebook likes step-by-step until you see a vision that will drive you on.</p>  <p>In this course I will show you the following My personal case study: You will get a chance to see how I walked the path to my status of 30,000 likes today.</p>  <p>And yes, I will bare it all showing you the back end of my online accounts. In this course I bare it all and lay it all out there for you to see and learn. You will see the strides I made, the places I slipped, the corners I cut and their consequences, and how I finally landed on the voyage to 30,000 likes.</p>  <p>They say a fool learns from their own mistakes, and the wise learn from the mistakes of others, I say get it right the first time, and the question of mistakes will not arise. I have eliminated all the fool-stops in the way to generating thousands of likes, so that you can get the right thing right away.</p>  <p>Don't waste time trying to find the elixir of social media immortality, just register in this course and be right on the path to achieving your social media objectives. PDFs: I have developed a set of high quality PDF documents that contain my story as well as the means you can use to get to where I am today. I consider them the treasure map, showing you where the treasure lays and the path I followed to get to the treasure. These treasure maps in PDF formats are all available to you to enable you pick and nick at them. This will aid to decide on the best path for yourself.</p>  <p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>  <p>And the Bonus! I also have a bonus, my bonus answers the all-important question, on <strong>\"How do you monetize your Facebook page\"</strong> It can be frustrating to generate thousands of likes and not have a dollar to show for it. That is why I give this to you as a bonus. If you want to monetize you page, my course tells you how to do it.</p>  <p><strong><em>5 STAR REVIEW: </em></strong></p>  <p><strong><em>Excellent course</em></strong></p>  <p><strong><em>Highly recommend this course - great instructor - he explains everything clearly and he can provide results from his own account- very dynamic instructor - I highly recommend Thank you very much for this great course – Serge (Student)</em></strong></p>  <p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>  <p><strong>Important information before you enroll:</strong></p>  <p><strong>In case you find the course useless you are covered by a 30 day money back guarantee, full refund, no questions asked!</strong></p>  <p><strong>Once enrolled, you have unlimited, lifetime access to the course!</strong></p>  <p><strong>You will have instant and free access to any updates I'll add to the course.</strong></p>  <p><strong>I will give you my full support regarding any issues or suggestions related to the course.</strong></p>  <p><strong>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p>    <p><strong>So What Are You Waiting For? Enroll Now!!!</strong></p>  <p><strong>Complete With Case Study &amp; Videos</strong></p>", 
    "end_date": null, 
    "title": "Facebook Marketing: Guide To Your First 30,000 Targeted Fans", 
    "price": "50.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238998_635e_5.jpg", 
    "course_url": "https://www.udemy.com/how-i-went-from-zero-to-30000-facebook-likes-in-30-days/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-07T16:57:12Z"
}