{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Imagine having the power of <strong>Monetizing every post you share on Facebook even from websites you do now own </strong><strong>and not just any sites but great authority sites AND YouTube videos too! </strong>how does that sound? Great right?</p><p>that's what you are going to learn in this course!</p><p>you will learn how to create <strong>Smart Facebook Posts that gets you traffic from any authority website to YOUR offer or website and BUILD YOUR EMAIL LIST TOO</strong> where you can post them to your Facebook Page,Facebook Groups that you own or you are a member of , Facebook Profile and any where on Facebook! to help you <strong>promote your products or services or even affiliate products or services as well</strong>.</p><p><strong>not only Facebook Posts! you can create your smart post and use it on Twitter or in any other Social Media Platform and purpose it in any way you desire!</strong></p><p>so you will be able to <strong>monetize your Facebook pages,</strong> Facebook Groups that you own or you are a member of , Facebook Profile and any where on Facebook!</p><p>in many ways in minutes! but that is not all!</p><p><strong>with this course you will get the following bonuses:</strong></p><p><strong>- Free Lifetime access to our \"InstaBar\" software that will help you create UNLIMITED Smart Posts in ALL your Facebook Marketing and Twitter Tweets and any other social Media Platform too!</strong></p><p><strong>- a step by step plan to get started as soon as you finish this course!</strong></p><p><strong>- a detailed Idea list to help you make money by offering this as a service to Businesses.</strong></p><p>so what are you waiting for?</p><p>Click the \"Take This Course\" button now and start your Social Marketing Success with us.</p>", 
    "end_date": null, 
    "title": "Facebook Marketing 2016: #2 Facebook smart Posts for profit", 
    "price": "50.00", 
    "instructors": "Kenz A.Soliman", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/763846_7f62.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-2016-2-facebook-smart-posts-for-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T01:22:32Z"
}