{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">New update 21/10/2014</strong>  </p>  <p style=\"\">  \t<strong style=\"\">9 new videos added to explain how to use hashtags on Facebook and Twitter.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Finally, Discover Newly Revised Strategies for Driving Traffic with Facebook Ads And Increasing Your Conversions At The Same Time...Starting Today! (Updated 2014 Version)</strong>  </p>  <p style=\"\">  \t          This is a step by step video course that takes you by the hand to show you how to choose the right ad type and explode your conversions with Facebook the right way!  </p>  <p style=\"\">  \t          According to Business insider well over 1 billion people are using Facebook as of 2014. In terms of market share, 67%  of all Internet users in the U.S. use Facebook frequently. Now in the European markets, more than 82% of Internet users use Facebook.  </p>  <p style=\"\">  \t          Also, among U.S. Facebook users, 73% have incomes well above $75,000 compared to 17% who are on Twitter and 13% who are on Pinterest.  </p>  <p style=\"\">  \t          Isn’t that amazing?  Think about it carefully. If you’re not reaching the Facebook crowd, then you’re leaving money on the table.  </p>  <p style=\"\">  \t          Imagine being able to reach more people across the globe without ever leaving your house, target specific audiences that fit your demographics, build brand awareness, generate leads, and more.  </p>", 
    "end_date": null, 
    "title": "Facebook advertising", 
    "price": "20.00", 
    "instructors": "Uthman  El lala Portillo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/172928_3dc9_5.jpg", 
    "course_url": "https://www.udemy.com/facebook-advertising-revolution/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-25T19:26:57Z"
}