{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will reveal to you how to generate leads, build an email list and gather relevant information from Facebook users with a brand new form of Facebook advertising. And the best part is that you don’t even need a landing page to grow your list!</p>    <p>Exactly, you can say goodbye to a landing page if you want to reach out to mobile Facebook users. </p>    <p>You’ll discover what lead ads are, how to set up converting Facebook campaigns and generate hundreds of high-quality leads like a professional Facebook marketing agency with just a few clicks.</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Reap the Benefits Of Generating Leads With Lead Ads </strong></p>    <p>These days’ people expect to be able to do everything from their phones. Mobile phones are where people communicate and discover the things they like, but historically, it’s been difficult for people on mobile to signal to businesses that they want to learn more about their products or services. </p>    <p>That’s why a few months ago, Facebook introduced a new campaign objective called “Lead Ads” that gives a quick and privacy-safe way to sign up to receive information from businesses, like newsletters, quotes and offers.</p>    <p>Now lead ads are available to advertisers everywhere with a host of additional features that make signing up for business information easy for people and more valuable for businesses!</p>    <ul><li>Build an email list without a landing page </li><li>Gather 100% accurate &amp; valuable user information with lead ads </li><li>Pay up to 50% less per email address<br><span></span></li></ul><p><br><strong>Contents and Overview</strong></p>    <p>This course will walk you through all the steps you need to get yourself set up and generate leads without the need of a landing page.  </p>    <p>First, you’ll learn what lead ads are and how building a list with this brand new advertising form differs from the traditional way of gathering contact information from Facebook users.</p>    <p>Next comes how to set up lead ad campaigns. I’ll walk you step-by-step through the entire process of setting up converting campaign and gather hundreds of leads, even if you didn’t set up a single ad before!</p>    <p>Last but not least, we’ll cover best practices to get great results right off the bat. We’ll cover how to craft your ad copy, select the best ad images and much more! </p>    <p>By the time you complete this course, you’ll be able to generate hundreds of leads, build your list and gather relevant customer information without the need of a squeeze page.</p>    <p><strong><em>In fact, building a list has never been easier, so get started today!</em></strong> </p>", 
    "end_date": null, 
    "title": "Facebook Marketing: How To Build A List With Lead Ads", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711914_f955_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-how-to-generate-list-with-lead-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T15:13:59Z"
}