{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">STUDENT REVIEW:</strong>  </p>  <p>  \t<strong style=\"\">Excellent!</strong>  </p>  <p>  \t<em style=\"\">&quot;This has given us some ideas on how to grow our Facebook presence for our family business immediately.&quot;</em>  </p>  <p>  \t----------------------------------------------------------------------  </p>  <p>  \tFacebook marketing is often a mystery to the uninitiated.  </p>  <p>  \t  If you own a business and would like to learn how to market / promote your business using one of the most popular sites on the Internet, Facebook, then you&#039;re in the right place!  </p>  <p>  \t  Facebook marketing can be one of the most cost-effective ways to effectively target your customers and generate increased sales.  </p>  <p>  \t  Whether you run a local business, a website or sell products online, Facebook marketing can work for you.  </p>  <p>  \t  In this course, we will cover some of the basics of Facebook Marketing, in a simple, uncomplicated way.  </p>  <p>  \t  The idea of this course is to get you started and to make the seemingly complicated, simple.  </p>  <p>  \t  You&#039;ll grow more and more excited as you advance through this course and learn that marketing on Facebook is not as difficult as you thought!  </p>  <p>  \t  Take a look at the course curriculum below and you&#039;ll see that it is laid out with the beginner in mind.  </p>  <p>  \t  Very soon, you&#039;ll be marketing on Facebook with the best of them!  </p>", 
    "end_date": null, 
    "title": "Facebook Marketing -  Marketing Your Business On Facebook", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107760_5eab_6.jpg", 
    "course_url": "https://www.udemy.com/facebook-rockstar/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-19T03:39:28Z"
}