{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Schon über 500 zufriedene Studenten, die diesen Kurs erfolgreich absolviert haben!</strong><br></p>\n\n<p>  \t<strong>WAS DU LERNST</strong>  </p>\n\n<p>  \t             In diesem Kurs lernst du, wie du mit Hilfe von Facebook <strong>neue Kunden gewinnst und deinen Umsatz so nachhaltig steigern kannst.</strong>  </p>\n\n<p>  \t           Ich zeige dir,  </p>\n\n<ul>  \t<li>warum du Facebook unbedingt nutzen solltest</li>  \t<li>wie du eine Fanseite richtige erstellest, einrichtest und nutzt</li>  \t<li>wie du echte, interessierte und loyale Fans gewinnst</li>  \t<li>wie du die Werbeanzeigen auf Facebook richtig nutzt</li>  \t<li>wie du aus deinen Fans kaufkräftige Kunden machst</li>  \t<li>und noch vieles mehr.</li>  </ul>\n\n<p>  \t<strong>BONUS</strong>  </p>\n\n<p>  \t             Außerdem habe ich ein paar<strong> Bonus-Lektionen</strong> für dich vorbereitet, in denen ich dir zeige,  </p>\n\n<ul>  \t<li>wie du ein Titelbild für deine Fanseite kostenlos erstellen kannst</li>  \t<li>wie du dir<strong> eine eigene Smartphone App</strong> mit Hilfe deiner Fanseite einstellen kannst</li>  </ul>\n\n<p>  \t             Und zum Schluss gibt es noch ein<strong> Ebook zum Thema Community Marketing.</strong>  </p>\n\n<p>  \t<strong>FÜR WEN IST DER KURS?</strong>  </p>\n\n<p>  \t             Dieser Kurs richtet sich vor allem an KMU´s, Coaches und Berater, sowie Blogger. Er ist ein <strong>Einstieg in das Facebook Marketing</strong> und zeigt dir die Grundlegenden Elemente, die du brauchst, um die ersten Fans zu gewinnen und daraus auch deinen Umsatz nachhaltig zu steigern.  </p>\n\n<p>  \t<strong>ZUM THEMA</strong>  </p>\n\n<p>  \t  Bei Facebook gibt es derzeit über 30 Millionen deutschsprachige Mitglieder! Hier kannst du eine enorme Reichweite erzielen! Wenn du es einmal geschafft hast, erste echte Fans zu gewinnen, dann kannst du eine Welle an neuen Interessenten generieren. Man sagt dazu auch \"Viralität\", weil sich Aktionen und Posting wie ein Virus verbreiten können.  </p>\n\n<p>  \t  Ich arbeite täglich erfolgreich mit Facebook und kenne mich aufgrund meiner Erfahrung, die ich durch eigenen, aber auch durch Kunden Projekten gesammelt habe sehr gut aus. Ich kann dir zeigen, wie Facebook für Unternehmen wirklich funktioniert.  </p>\n\n<p>  \t  Wenn du es von Anfang an richtig machst, dann stehen dir alle Türen offen und du kannst dein Unternehmen richtig pushen! Und wie das geht, zeige ich dir in diesem Kurs!  </p>\n\n<p>  \t<strong>Also, Take Action und sicher dir meinen Kurs \"Facebook Marketing für Einsteiger\" zum Einführungspreis!</strong>  </p>\n\n<p>  \t       +++++++++++++++++++++++++++++  </p>\n\n<p>  \t       WICHTIG:  </p>\n\n<p>  \t       Das ist ein brandneuer Kurs, der die aktuellen Ansichten, Funktionen und Einstellungen von Facebook berücksichtigt!  </p>\n\n<p>  \t       Sobald Facebook Änderungen vornimmt, werden diese so schnell wie möglich im Kurs aktualisiert!  </p>\n\n<p>  \t       +++++++++++++++++++++++++++++  </p>\n\n<p>  \t<em>Denk daran: Du hast eine uneingeschränkte 30 Tage Geld zurück Garantie durch udemy! Sollte dir mein Kurs absolut nicht weiterhelfen, bekommst du ohne Wenn und Aber dein Geld zurück!</em>  </p>", 
    "end_date": null, 
    "title": "Facebook Marketing für Einsteiger - Mehr Fans, mehr Umsatz", 
    "price": "50.00", 
    "instructors": "Jessica Ebert", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310010_bc3e_3.jpg", 
    "course_url": "https://www.udemy.com/fb-marketing-einsteiger/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-29T13:04:32Z"
}