{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>As the artist Manafest I've sold over 300,000 albums worldwide over 1,000,000 singles and toured over 20 different countries.<br></p>\n\n<p>I currently have over 167,000 likes on Facebook and it has been the #1 social media marketing platform I've used to build my brand.</p>\n\n\n\n<p>The ability to laser target your Facebook posts with boosts and ads allows you to put your music in front of your target demographic.</p>\n\n\n\n<p>Facebook also just recently purchased Instagram so it's not going anywhere anytime soon and worth building your brand. </p>\n\n\n\n<p>This course teaches you everything I've learned about Facebook and how together for you - to which you have full lifetime access, including all the updates, for free. (I update my courses every other month with the latest techniques)<br></p>\n\n\n\n<p>I \"take you by the hand\" and \"behind the scenes\" and show you everything, explaining it in simple detail with videos and written support lectures. </p>\n\n\n\n<p>See exactly why I'm so successful with Facebook - see the stats in the free preview videos, below).</p>\n\n\n\n<ul><li>See inside my Facebook account </li><li>Facebook ads &amp; Boost Strategy</li><li>How to post viral content that people share</li><li>Facebook Content Strategy &amp; Automating Your Posts</li><li>... and my help and assistance to Udemy students is legendary</li></ul>\n\n\n\n<p>+++++++++++++++++++++++++++++</p>", 
    "end_date": null, 
    "title": "Facebook Marketing Mastery For Artists & Musicians", 
    "price": "20.00", 
    "instructors": "Christopher Greenwood", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/388230_4b0b_2.jpg", 
    "course_url": "https://www.udemy.com/facebookmastery/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-08T03:43:40Z"
}