{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Many people create Facebook pages for their business, but they aren’t sure what content to post in order to get the most interaction from their audience. And they also struggle with attracting new followers consistently. \n\n  </p>\n\n<p>The right Facebook marketing plan can help you grow any business by proving that you have the products and/or services that people not only want, but also need. \n\n  </p>\n\n\n\n\n\n\n\n<p>This course is designed to answer all of your questions and show you how to reach millions of people each week. You’ll learn how to use Facebook to drive more traffic to your website and increase conversions. \n\n  </p>\n\n\n\n\n\n\n\n<p><strong>Use Facebook's Advertising Tools in the Most Effective &amp; Efficient Manner</strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>Throughout this course, you’ll gain access to free Facebook marketing methods that most digital marketers don’t know about and don’t want to share with you. \n\n  </p>\n\n\n\n\n\n\n\n<p>You’ll learn how to create consistent engagement with followers on your Facebook page, and how to advertise your business on Facebook to help it grow. \n\n  </p>\n\n\n\n\n\n\n\n<p><strong>Course Content</strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>After a brief introduction into this course and its instructor, you’ll dive right into how to set up your first Facebook page. \n\n  </p>\n\n\n\n\n\n\n\n<p>You’ll cover everything from choosing the right name that will truly stand out, to adding the right profile photo and cover image to make the biggest impact. You’ll even learn how to add tabs to your other social media channels. \n\n  </p>\n\n\n\n\n\n\n\n<p>Next, you’ll discover how to find high quality, viral content to post, including videos and links, and you’ll learn how to schedule your posts for the best results. \n\n  </p>\n\n\n\n\n\n\n\n<p>When ready, you’ll move on to effective marketing strategies that will get your Facebook page in front of as many people as possible. You’ll learn how to get your first 1,000 likes quickly, as well as how to use Facebook Groups and Events to your advantage. \n\n  </p>\n\n\n\n\n\n\n\n<p>Because Facebook offers its own set of marketing tools, you’ll cover how to create an effective ad with your target audience in mind. You’ll then learn how to run, test, and tweak your ads to always get the results you want. \n\n  By the time you complete this course, you’ll have all of the tools and techniques necessary to achieve incredible results on Facebook. You’ll be able to use this hugely popular social media site to build and expand your business.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Facebook Marketing - How I Reach 2,000,000 People Weekly", 
    "price": "20.00", 
    "instructors": "Rohan Dhawan", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729118_4adb_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-and-facebook-advertising-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T14:51:56Z"
}