{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">En este curso te enseñará en algo más de <strong style=\"\">una hora</strong> todo lo que necesitas saber para manejarte con soltura por esta red social.</p><p style=\"\">El curso está diseño <strong style=\"\">para principiantes</strong>, pero también contiene clases donde aprenderás a hacer cosas de nivel profesional como lo es diseñar una portada para tu timeline con una <strong style=\"\">calidad profesional</strong>.</p><p style=\"\">¿A <strong style=\"\">quien </strong>le interesa este curso?</p><ul style=\"\"><li style=\"\">Si ya eres un usuario de Facebook, encontrarás seguramente mucha información de detalle que será de tu interés, información en la que probablemente aún no te hayas detenido, por ejemplo, detalles sobre la correcta configuración de los&nbsp;<strong style=\"\">niveles de privacidad</strong>.</li><li style=\"\">Si eres un escéptico de esta red social,&nbsp;<a href=\"http://www.ciudadano2cero.com/facebook-que-es-como-funciona/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">podrás <strong style=\"\">conocerla mejor</strong></a>&nbsp;y&nbsp;valorar con mucho más criterio si quieres seguir ignorando&nbsp;la red social más grande del mundo y en la cual tienes un canal que te permitirá unas&nbsp;<strong style=\"\">posibilidades de comunicación</strong>&nbsp;y <strong style=\"\">cercanía</strong> con tus amigos (por ejemplo, con los chats integrados de Facebook) que&nbsp;no encuentras fácilmente en otras herramientas&nbsp;con la gran <strong style=\"\">ventaja imbatible</strong> del altísimo % de amigos tuyos que ya te encontrarás dados de alta en esta red social.</li><li style=\"\">Si eres un&nbsp;<strong style=\"\">profesional autónomo</strong>&nbsp;o tienes un <strong style=\"\">pequeño negocio</strong>,&nbsp;<a href=\"http://www.ciudadano2cero.com/marca-personal-mundo-2-0/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">por muchas razones, simplemente no puedes seguir ignorando esta red social</a>, te agrade o no Facebook.</li><li style=\"\">Si aun así eres un&nbsp;usuario que está<strong style=\"\"> harto de Facebook</strong>, también encontrarás un vídeo que te enseña cómo&nbsp;<strong style=\"\">borrar tu cuenta Facebook definitivamente</strong>.</li></ul><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Facebook para principiantes (y no tan principiantes...)", 
    "price": 0, 
    "instructors": "Autor en el blog Ciudadano 2.0 Berto López", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37163_1e72_5.jpg", 
    "course_url": "https://www.udemy.com/facebook-para-principiantes/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-20T20:08:12Z"
}