{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I <strong>NOW HAVE A PROMO VIDEO! (9/3/15)</strong><br></p><p><strong>Facebook Groups: Unlock the potential of your Facebook Group</strong> is a <strong>step by step guide</strong> on how to achieve loyal members on your Facebook group and <strong>what to do once you reached 200 loyal members</strong>!  The course will <strong>continually be updated</strong> and more content will be added over time to help add to your success! In this course I will teach you <strong>everything that I know</strong> to come up with a strategy, plan, and take action! With these easy steps you can learn everything needed to have a successful Facebook Group!</p><p><strong>Note: I have been told \"200 isn't a lot\", but this isn't about having 1000's of members, you don't need a large number to be successful</strong></p><p>========================================================================</p><p><strong>About this course: </strong>This course is going to be continually updated with more and more content based from information students share, my own experience that helps me continue to be successful, and new tips and tricks that I find. This is a no-fluff, straight to the point to show you how to create and run a Facebook Group.</p><p><span></span><strong>Materials you will need: </strong></p><ul><li>Facebook account</li><li>Internet</li></ul><strong>You will learn:</strong><strong></strong><ul><li><strong></strong>Everything I know and experienced creating my successful group</li><li>How I started out from an underdog, to a Facebook Group Admin of a strong, expanding group</li><li>What questions you need to ask prior to creating the group</li><li>My secret weapon to growing your group fast</li><li>How to create your group step by step</li><li>How to be more involved in your group</li><li>What necessary precautions are needed when growing your group</li><li>How to expand/ branch your group</li><li>The importance of building trust with your members</li><li>...and much MUCH MORE!</li></ul><span></span>", 
    "end_date": null, 
    "title": "Facebook Groups: Unlock the Potential of Your Facebook Group", 
    "price": "20.00", 
    "instructors": "McCoy Buck", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590194_ca90_4.jpg", 
    "course_url": "https://www.udemy.com/facebook-groups-200-members-in-2-months/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-22T08:53:30Z"
}