{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>These powerful Facebook custom tabs tutorials will help you to build your tab, motion posts, and Facebook ads substantially whether you are a digital marketing professional or you are doing your own promotion. This course has all section of Facebook marketing including tabs, motion posts, Gifs and Facebook Ads that will satisfy your changing needs.\n\n  </p>\n\n<p>The complete Tabfu course will teach you all the development techniques involve in creation of Facebook marketing page starting from the basics and advancing step-by-step using examples. After the completion of this course you can develop your custom tabs, motion post and Facebook Ads with few clicks. \n\n  </p>\n\n<p>This course also covers the concept of list building for marketing purpose; it will teach you how to create viral gates, squeeze pages and how to create coupons for each post on Facebook. You will also learn how to integrate your list building tools with different list storage platforms like aweber, mailchimp etc. This course is also good for experienced social media marketers looking to keep their skill level up. This course will also elaborate in detail that how to create awesome custom tabs without facing any development and hosting problems.\n\n  </p>\n\n<p>In this course you will learn how to monitor your Facebook marketing campaigns. You will learn how to make your posts awesome and eye catching with a couple of clicks. You will also learn that how your custom tabs can be mobile friendly.  These tools monitor your marketing efforts and create customized marketing campaign to suit your individual needs after you have finished with the courses.\n\n  </p>\n\n<p>Please check this course carefully before creating any custom tabs. You will also know how to take advantage of all the features Tabfu has to offer. All Tabfu applications are fully integrated with Facebook and your information will remain secure forever.  </p><p> It’s all about Viral Marketing. Join us today.</p>", 
    "end_date": null, 
    "title": "Facebook Marketing with Tabfu", 
    "price": 0, 
    "instructors": "Sam Finlay", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802704_9adf_4.jpg", 
    "course_url": "https://www.udemy.com/create-facebook-marketing-cutom-tabs-landing-pages-with-tabfu/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T09:33:33Z"
}