{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>***UPDATED APRIL 2016***</strong><br></p>\n\n<p><strong>Facebook apps and tabs have been a long held underground weapon for marketers (and businesses).</strong>  </p>\n\n\n\n<p>You'll learn how to create different types of Facebook tabs and apps like product tabs, contest apps, squeeze pages, locations tab, affiliate offer pages, sales pages etc... you can even set up an entire funnel inside of FB using apps and tabs. </p>\n\n\n\n<p>You'll also learn about apps you can use to manage multiple pages, get detailed analytics and insights, how to use an app to hyper-target your Facebook ads, plus how to send Facebook notification messages to people (super powerful) and how to add an optin form directly to a timeline post.  </p>\n\n\n\n<p>You don't need any programming skills, and you don't need to know anything about Facebook apps.  This course makes it easy enough so that anyone can make a Facebook app/tab.   </p>\n\n\n\n<p><u>One of our students was making his own taps within minutes of completing the 2nd lecture!</u></p>\n\n\n\n<p>The course is broken down into short, easy to follow lectures and we walk you through step by step how to make all the different tabs for your Facebook page. </p>\n\n\n\n<p>If you have a business or fan page, then this training is for you!<br></p>\n\n\n\n<p><strong>What Makes This Course Unique?</strong></p>\n\n\n\n<p>We’ve got your back. You’ll have <em>a dedicated team of three instructors</em> ready to answer any question you have, or describe something in more detail for you.<br><br>As with our other courses, this one will be updated over time with fresh content. All updates for life are included.</p>\n\n\n\n<p>The extensive content is broken into easily digestible bits you can rapidly absorb. Engaging exercises along the way help you master the methods so you can see results fast.</p>\n\n\n\n<p>You’ll come out with a specific strategy to build FB apps and tabs to immediately apply to your business and generate more sales, leads and traffic to your offers and content. </p>", 
    "end_date": null, 
    "title": "Facebook Apps For Businesses and Marketers", 
    "price": "20.00", 
    "instructors": "Brian Gray, Shane Farrell, Mark Tandan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604152_3065_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-apps-and-tabs-for-businesses-and-marketers/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T18:41:26Z"
}