{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    Inside <strong style=\"\">The Facebook Essentials Training Course</strong> you will learn how to establish your business and attract new customers using the power of Facebook.  </p>  <p style=\"\">  \t    We cover all the foundation steps you need to take to ensure you get maximum results from your Facebook marketing efforts.  </p>  <p style=\"\">  \t    Everything is covered with our 9 easy to follow, over the shoulder training videos that run to just under 1 hour of quality material, that will turn you into a Facebook marketing master.  </p>  <p style=\"\">  \t    Here&#039;s what&#039;s covered inside the course:  </p>  <ul style=\"\">  \t<li style=\"\">Course Overview and an Introduction to Facebook pages</li>  \t<li style=\"\">How to Find Niches Full of Passionate, Ready to Buy Fans</li>  \t<li style=\"\">How to Set Up Your Facebook Page the Correct Way</li>  \t<li style=\"\">How to Establish Instant Authority in Your Niche by Giving Your Page A Professional Design</li>  \t<li style=\"\">Introduction to Custom Tabs - How to Get Them, and How to Use Them to Your Advantage</li>  \t<li style=\"\">Status Updates - When, What, How, and Why?</li>  \t<li style=\"\">How to View Your Audience Insights to Gain A Better Understanding of What Your Audience Wants</li>  \t<li style=\"\">How to Easily Grow the Number of Fans Your Facebook Page Has and Turn Those Fans Into Traffic to Your Websites</li>  \t<li style=\"\">How to Scale Your Facebook Marketing Efforts</li>  </ul>  <p style=\"\">  \t    So if you&#039;re just starting out with Facebook Marketing, or you just want to learn how to get better results with your marketing efforts, this course is definitely perfect for you!  </p>", 
    "end_date": null, 
    "title": "Facebook Essentials - Facebook Marketing for Beginners", 
    "price": "25.00", 
    "instructors": "AJ Montoya", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292820_5254_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-essentials-facebook-marketing-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-03T01:36:37Z"
}