{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Facebook Advertising:</strong></p>\n\n<p>Facebook hat die Online Werbewelt verändert - während fast ein Jahrzehnt Google Adwords der alleinige \"Herrscher\" der Onlineanzeigen war ist es heute bereits oft so, dass auf Google komplett verzichtet wird und Unternehmen ihr gesamtes Onlinebudget in Facebook investieren. </p>\n\n<p>Dies schein auf den ersten Blick riskant und ist sicherlich nicht für alle Unternehmen eins zu eins so zu empfehlen, wenn Sie aber meinen Kurs Facebook Advertising genau folgen haben Sie eine reale Chance mit einem kleine Investment eine große Anzahl an Kunden oder Leads zu gewinnen.</p>\n\n<p><strong>Denn Facebook Ads zeichnen sich durch drei Merkmale aus:</strong></p>\n\n<p>1.) Das Preisniveau ist dramatisch niedriger als bei Google Adwords</p>\n\n<p>2.) Die Werbeanzeigenformate und Plätze sind stark visuell und damit emotional geprägt</p>\n\n<p>3.) Die Eingrenzung der Zielgruppe ist auf Grund der großen Datenmenge, die Facebook erhoben hat, sehr präzise möglich. Streuverluste werden minimiert.</p>\n\n<p>Um das Risiko für Sie zu minimieren startet der Kurs mit einem Eignungstest. Sollten Sie diesen bestehen empfehle ich Ihnen die folgenden Lektionen präzise durchzuarbeiten. Die Wahrscheinlichkeit Ihre Ziele mit Hilfe von Facebook Anzeigen zu erreichen ist sehr hoch.</p>\n\n<p>Sollte der Test bei Ihnen negativ ausfallen empfehle ich von Ihrem Geld zurück Garantie gebrauch zu machen, weil Facebook wahrscheinlich nicht das richtige Werbemedium für Ihr Unternehmen ist.</p>\n\n<p>Wie dem auch sei, ich habe diesen Kurs so verfasst, dass Sie als Laie im Thema Facebook, in der Lage sein werden Kampagnen, Werbeanzeigengruppen und Anzeigen so zu gestalten, dass sie mit minimalen finanziellem Aufwand das Maximum an Werbepower herausholen können und Leads, Neukunden oder Reputation zu gewinnen.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Facebook Anzeigen - so geht's!", 
    "price": "20.00", 
    "instructors": "Norbert Weber", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/805230_b457_2.jpg", 
    "course_url": "https://www.udemy.com/facebookanzeigen/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-27T10:41:52Z"
}