{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em style=\"\">LATEST: Course Updated On September, 2015 To Include More Lectures:</em>  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">Lecture on how to write better headlines that increase click-through rates</em></li>  \t<li style=\"\"><em style=\"\">Facebook&#039;s edge rank algorithm and how to &quot;game&quot; it to get more exposure</em></li>  </ul>  <hr style=\"\">  <p>  \t<em style=\"\">* OVER 550 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE</em>  </p>  <hr style=\"\">  <p>  \t                                            This course will teach you strategies for how to promote your business, personal brand, or products on Facebook.  </p>  <p>  \t                                                         The course will teach you the proper way to use your personal Facebook profile, business pages, and Facebook&#039;s paid marketing to most effectively promote your business.  </p>  <p>  \t                                                         The course will also teach you what not to waste your time with, and what strategies might be effective.  </p>  <p>  \t                                                         The course is about 1 hour of video content. It is to the point, but covers all the important points of Facebook marketing.  </p>  <p>  \t<strong style=\"\">Why I Made The Course</strong>  </p>  <p>  \t                                                       In my business coaching practice I help many people with their marketing. Most people really struggle with online marketing. It is vital that as a business owner you become very savvy with online marketing very quickly because that will be the difference between getting clients or not.  </p>  <p>  \t                                                      And since most people first think about promoting their business on Facebook when they get started with their business, this is a very necessary course to take.  </p>  <p>  \t<strong style=\"\">What To Expect From The Course</strong>  </p>  <p>  \t                                                    I can&#039;t promise that after taking this course you will get millions of customers. That is just unrealistic. But I am confident that after taking this course you will be able to comfortably determine what Facebook marketing strategies may be viable for your business, and what strategies may be poor choices. That will empower you to make good decisions in how you promote your business on Facebook.  </p>  <p>  \t                                  In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p>  \t                              +++++++++++++++++++++++++++++  </p>  <p>  \t                                          MONEY BACK GUARANTEE  </p>  <p>  \t<em style=\"\">The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it&#039;s my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Facebook marketing 2016: 1000%+ engagement", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242084_b4fd_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-12T13:01:41Z"
}