{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">This course will teach you the exact strategies I’ve used to promote multiple businesses, grow my personal brand and sell products on Facebook.</span>  </p>  <p style=\"\">  \tThis course will teach you the most effective ways to brand yourself, your business, and still have a real personal connection to everyone you connect with while leveraging Video and Softwares to maximize your engagement and reach.  </p>  <p style=\"\">  \tThis course contains just over 1 hour of video content that will get you started immediately leveraging everything Facebook has to offer.  </p>  <p style=\"\">  \t_______________________________________________________________________  </p>  <p style=\"\">  \tI Made This Course For YOU  </p>  <p style=\"\">  \tI’m just like most of my students. I started from nothing, no guru mentor, no big email list, no huge marketing budget. Just a whole lot of determination, a can do attitude, and the belief that I can make this work. As the saying goes, “If I knew what I know now when I first started, it would have saved me lots of money and precious time.”  </p>  <p style=\"\">  \tI’ve been there, I know the pain, the grinding day in and day out. I hate all of that just like you. I’m so grateful I’ve been able to make this whole “Online Thing” work, and I want to help pay it forward and help you succeed.  </p>  <p style=\"\">  \t_______________________________________________________________________  </p>  <p style=\"\">  \tWhat To Expect From This Course  </p>  <p style=\"\">  \tI can’t promise an instant success or that you will make millions of dollars overnight. It’s not legal or  and more importantly not realistic. I am however, confident that after taking this course you will understand the exact strategies I’ve been using for the past year to successfully build multiple businesses online, building brand awareness, and being the most efficient with your time using Facebook. You will have the look over my shoulder and see exactly what I’m doing to Win at this “Online Thing” using Facebook and thanks to Udemy be able to watch it over and over again.  </p>  <p style=\"\">  \t_______________________________________________________________________  </p>  <p style=\"\">  \tMONEY BACK GUARANTEE  </p>  <p style=\"\">  \tUdemy offers a 30 day money back guarantee. No questions asked. So what are you really risking?  </p>", 
    "end_date": null, 
    "title": "Facebook Marketing", 
    "price": "20.00", 
    "instructors": "Mr. Alfredo Delgado, Julez Tang", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325416_8592_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T05:05:15Z"
}