{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Entrepreneur’s Guide to Building a Targeted Email List</strong></p>    <p>This course will teach you how to build a list of targeted subscribers quickly and easily with Facebook ads.</p>    <p>Whether you’re running an offline or online business, selling product or services, it is essential to have a list in place to generate a consistent stream of revenue. The money is in the list.</p>    <p><strong>Generate Quality Leads by Using Facebook Ads</strong></p>    <ul><li>Learn How to Promote Your Content to Effectively Sell Your Product or Service</li><li>Convert Cold Traffic to Subscribers and Customers</li><li>Generate Traffic on Demand and Turn Buyers into Multi-buyers</li><li>Know How to Perform Successful Product Launches</li></ul><p><br><strong>Capture Targeted Traffic in the Most Competitive Niche Markets</strong></p>    <p>Social list building is crucial to succeed in today’s world. But it takes strategy. The number one reason why Facebook campaigns fail is due to the lack of knowledge of the target audience. </p>    <p>This course will show you how to research your target audience, create winning ad copy that resonates with them, track conversions, and scale your campaign like a professional advertising agency.</p>    <p><strong>Contents and Overview</strong></p>    <p>The course will kick off with the fundamentals of social list building so you are equipped to get the most out of the course with no prior experience. </p>    <p>Then you’ll move onto identifying your target audience so you can structure your campaigns effectively. You’ll discover Facebook’s free tool, Audience Insights, that will reveal important details about your ideal client. </p>    <p>Next comes conversion tracking. Facebook has a feature that allows you to track your conversions so you can see what’s working and why, and adjust your strategy accordingly.  </p>    <p>You’ll then learn how to build converting Facebook ads quickly and easily. The image is the primary element of an ad, and the instructor will share his proven ad image tricks so you can be sure yours really grab your audience. Then, you’ll learn how to create compelling ad copy to get your audience to click.</p>    <p>The course will wrap up by showing you how to scale your campaign once your ads do convert. You’ll leave the course with the ability to create effective ad campaigns that turn your efforts into an unstoppable list-building machine.</p>", 
    "end_date": null, 
    "title": "Facebook Marketing: How To Build A Targeted Email List", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/637620_a3a1_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-how-to-build-a-targeted-email-list/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-11T21:05:19Z"
}