{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>UPDATED April 2016: </strong><strong> </strong>My Udemy courses have been taken by 1,000s of students and have been awarded 100s of positive reviews.  </p>\n\n<p><strong>My “WHY” – </strong>You know that feeling you get when you help someone? I want to feel that way 1,000,000 times.<strong> </strong></p>\n\n\n\n\n\n\n\n<p><strong><em>Come with me on a journey to Facebook Marketing and let's convert your fans into paying customers.</em></strong><br></p>\n\n\n\n\n\n\n\n<p>Do people ever tell you that....</p>\n\n\n\n\n\n\n\n<ul><li>Its impossible to generate sales from Facebook marketing?</li><li>Facebook fans will never buy your product or service?</li></ul>\n\n\n\n\n\n\n\n<p>Well, I have a surprise for you. I have worked with 100s of brands including<strong> Chevy, Lexmark, AA, Papa murphy</strong>, and many small-medium businesses and helped them generate SALES from Facebook marketing. I will teach you the exact system that I use to grow a Facebook business page and <strong>generate sales</strong>. This is what you will learn from this course</p>\n\n\n\n\n\n\n\n<ol><li><strong>Facebook fan growth</strong>: How to get more relevant fans for your business page</li><li><strong>Lead generation</strong>: How to convert your Facebook page likes into email leads</li><li><strong>Lead nurturing</strong>: Start converting your cold leads into HOT leads who are ready to buy</li><li><strong>Sales</strong>: How to convert your HOT leads into paying customers</li><li>How to use Facebook Ads to get more likes and convert them into leads &amp; paying customers </li></ol>\n\n\n\n\n\n\n\n<p>Take this course if you want to master <strong> </strong><strong>Facebook marketing</strong> and start converting your Facebook page likes into sales. </p>\n\n\n\n\n\n\n\n<p>This course comes with a 30 day money back guarantee so you have nothing to loose. Click on the <strong>TAKE THIS COURSE </strong>button on the top and I will see you on the inside. </p>", 
    "end_date": null, 
    "title": "Facebook Marketing 2016: Fans to Sales ", 
    "price": "20.00", 
    "instructors": "Ali Mirza", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634348_9585.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T03:08:50Z"
}