{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>Do you have a small business that primarily sells online?</strong></em></p><p>Prepare your business for growth this holiday season with strategies to grow through Facebook marketing and advertising.  </p><p>In this training, Amy will share with you a complete <strong>blueprint</strong> to increase brand visibility and increase SALES this holiday season.</p><p><em><u><strong>This training includes:</strong></u></em></p><ul><li>A <strong>specific strategy plan</strong> marketing your business on Facebook.</li></ul><ul><li>Six <strong>video training modules</strong> with checklists to maximize your effectiveness.</li></ul><ul><li>Training for the kinds of <strong>Facebook Ads</strong> that are working right now for small business owners, especially if you have limited funds/time to implement.</li></ul><ul><li><strong>Image creation</strong> tutorial so that you can Do It Yourself or assign this to someone on your team.</li></ul><p><em>This course was created by Amy Boehnert, of Cardinal Point Media, who has worked for over four years with one of the world's leading experts on Facebook Advertising, which provided a \"backstage pass\" to the inner workings of <u>online advertising and marketing campaigns</u> for entrepreneurs, celebrities, writers, as well as Fortune 500 companies. </em></p><p><em></em><em>Amy took these high-level strategies and began implementing them for small businesses.</em></p>", 
    "end_date": null, 
    "title": "Facebook Marketing & Advertising for the Holidays", 
    "price": "20.00", 
    "instructors": "Amy Boehnert", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659088_dfda_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-advertising-for-the-holidays/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T16:47:19Z"
}