{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>JOIN OVER 4000 + SUCCESSFUL STUDENTS WHO HAVE ALREADY TAKEN THIS COURSE!</strong>  </p>  <p>  \t<strong><em>LATEST: </em></strong><em>Course is updated for month of May 2015.</em><strong><em></em></strong></p><p><strong><em>IMPORTANT: </em></strong><em>Price of this course will increase</em><em> to $199 on May 31 2015</em><strong><em></em></strong></p>  <p>  \t<em>******************************************************</em><em>****************</em><em>******************************************************</em><em>****************</em>  </p>  <p>  \t<strong><em>Very HAPPY and SATISFIED Students!</em></strong>  </p>  <em>\"Very helpful for starting online sellers like me. Contents are very relevant, direct to the point, and the videos are short. I also like how you outlined the course into specific topics. This course is a gem, you literally just do what Ramon says it's like a code to the loopholes of facebook. Thank you soooooooooooo much!\" - Janine Angelisa</em>  <em>\"Insightful, Educational, Excellent. This course really will help the student understand powerful and intelligent strategies to capitalize and monetize on Facebook. Very good material and very easy to understand language with outstanding visuals and texts to support. I am very satisfied and thankful.\"<strong> </strong>- Brian</em>  <em>\"</em><em>This course is definitely worth taking especially im starting out my own page on fb. It's my first course in udemy and i'm impressed with the course contents. The course is very clear and precise and its easy to follow. This was really helpful to me because of the great tips. The instructor is very good. and I'm hoping for a new course to be uploaded related to this. Thank you!\" - Jaimie Alyzia</em>  <p>  \t<strong><em>Scroll down to the bottom for more authentic reviews...</em></strong>  </p>  <p>  \t<em>******************************************************</em><em>****************</em><em>******************************************************</em><em>****************</em>  </p>  <p>  \t<em>Would you like to see how I make $2000 a month on Facebook just by selling t shirts?</em>  </p>  <p>  \t<em>Would you like learn how to sell your products on Facebook without paying for Facebook Ads?</em>  </p>  <p>  \t<em>  Would you like me to teach you the top secret strategies(Proof included!) I use to get a ton of paying customers?</em>  </p>  <p>  \t<em>  Learn how to INCREASE your PRODUCT SALES and make a PROFIT on Facebook now!  </em>  </p>  <p>  \t<strong>  How To Make Money On Facebook  </strong>  </p>  <p>  \t                                                                          It doesn't cost anything to open a Facebook Business Page.  </p>  <p>  \t                                                                          Facebook has over 1.23 billion active users! Imagine the potential number of customers and profit you will gain from this exposure.  </p>  <p>  \t                                                                          You can start selling your products/service to anyone in the world right away for FREE.  </p>  <p>  \t                                                                          You don't NEED to pay for Facebook Ads.  </p>  <p>  \t                                                                          All you need is someone like me who has the EXPERIENCE and KNOWLEDGE to guide you to your SUCCESS!  </p>  <p>  \t<strong>And remember - the price for this course is now $99 but will increase to $149 on 31st March 2015. Hurry to secure your lifetime access at the old price now!</strong>  </p>  <p>  \t                                                                          Click the <strong>\"take this course\"</strong> button, top right, now ... every hour you delay is costing you money ...  </p>  <p>  \t<strong>                About this course</strong>  </p>  <ul>  \t<li>Over 2000 very happy Students </li>  \t<li>5 Star Reviews from VERY satisfied students</li>  \t<li>Over 37 Lectures and 1.5 Hours of Content</li>  \t<li>Full, free lifetime access</li>  \t<li>All future extra lectures and upgrades are always included for free</li>  \t<li>30 day money-back guarantee -- my personal promise to your success!</li>  \t<li>Monthly BONUS Lectures to increase your sales</li>  \t<li>24/7 Instructor Chat Support -- I will personally help you </li>  </ul>  <p>  \t<strong><em>After taking this course, you'll be able to...</em></strong>  </p>  <ul>  \t<li>  \t  \t\t                                                      Learn how to sell your products on Facebook without paying for Facebook Ads  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn how to advertise on Facebook Groups - without getting banned.  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn the secrets to interacting with your Fans  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn the secret to building a cult following on Facebook  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn the \"Magic\" word to getting more people buying your products  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn the TOP SECRET TACTIC I use to sell a lot of products on Facebook without paying for Facebook Ads  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn how to manipulate Facebook's Algorthm to your advantage  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn the secret Facebook contest formula to boost your sales and increase your customers  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn how to use Keywords and Descriptions to get more customers without any marketing!  \t  \t</li>  \t<li>  \t  \t\t                                                      Know what types of Pictures you must post in order to increase your sales!  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn why \"time\" is crucial to your success  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn how to use the Tagging feature to maximize your Profits  \t  \t</li>  \t<li>  \t  \t\t                                                      Learn how to increase your product sales and Profit organically on Facebook</li></ul>  <p>  \t<em><em>***********************************************************************</em></em><em>*********************************************************************</em>  </p>  <p>  \t<strong><em><em>30-Day Full Money Back Guarantee</em></em></strong>  </p>  <p>  \t<em><em>In the event that this course does not meet your expectations or you are unhappy with this course </em><em>for any reason</em><em>, I promise to give you a full refund with no questions asked.</em></em>  </p>  <p>  \t<em><em>***********************************************************************</em></em><em>*********************************************************************</em>  </p>  <p>  \t                                                                              Click the <strong>\"take this course\" </strong>button, top right, now ... every hour you delay is costing you money ...  </p>", 
    "end_date": null, 
    "title": "Facebook Marketing 101 For Ecommerce - Without Facebook Ads!", 
    "price": "20.00", 
    "instructors": "Ramon DeBelen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398298_c559_10.jpg", 
    "course_url": "https://www.udemy.com/how-i-make-2000-a-month-on-facebook-without-facebook-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T18:44:43Z"
}