{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I created this course for people who don’t have a lot of time on their hands and who want to get to the heart of the matter when it comes to Facebook marketing. Whether you are a beginner or an expert, after these 90 concise minutes, you will be creating one successful Facebook advertising campaign after the other.</p><p>This course is really made up of 2 parts. In the first half of the course, I teach you everything I knew of Facebook advertising when I started, what I learned along the way and much more! Included:</p><ul><li>How the auction system is setup</li><li>How Facebook’s ad structure is composed of 3 levels</li><li>How you can manage and analyze your ads once they are running or have finished running</li><li>A comprehensive look at the different possible bidding setups</li><li>How Power Editor as of October 2015 is the best tool to use in order to create your Facebook ads</li><li>Custom and Lookalike audiences</li><li>How to use Page Insights to refine the content you promote</li><li>How to analyze the data from your advertising campaigns</li><li>And much more…</li></ul><p><span></span></p><p>Then, I show you step-by-step how I created thousands of my ad campaigns, which have produced:</p><ul><li>40 million page views</li><li>$40,000</li><li>500,000 Facebook fans</li><li>CPCs of $0.001</li><li>Relevance scores of 10/10</li></ul><p><span></span></p><p>Finally, in the second half of the course, I delve into how you can do it. There are specific lectures on how to apply my Facebook advertising secrets for:</p><ul><li>Start-ups</li><li>Small businesses</li><li>Online stores</li><li>Video-centered businesses</li></ul><p><span></span></p><p>Start now and learn in 90 minutes everything I did in 6 months! Included</p><ul><li>30-day money back guarantee: I am confident in the quality of my course ahead, but if you ever feel like it does not fulfill your expectations, you can ask for 100% of your money back within 30 days</li><li>Full &amp; free lifetime access</li><li>Every new lecture I add will always be included for free</li><li>Free of charge surprise bonuses in the future</li></ul><p><span></span></p><p>Do not waste another minute in becoming a Facebook marketing expert!</p>", 
    "end_date": null, 
    "title": "Facebook Marketing: Become a FB Ads Expert in 90 Mins 2015", 
    "price": "20.00", 
    "instructors": "Matt Larry White", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530748_0bd2_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-2015-become-fb-ads-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T22:41:43Z"
}