{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>--Updated July 2015--</strong></p>  <p>  \t                        If you're already familiar with PPC advertising on Facebook, then you will leave this course knowing how to setup Facebook Retargeting (Website Custom Audiences) on your own website and how to automate advertising campaigns that bring your best target audience back to your webpage to take specific actions.  </p>  <p>  \t                    Facebook Retargeting allows you to target visitors to your website in very specific ways.  </p>  <ul>  \t<li>You have an online store and people navigate away without purchasing– you can target them with an ad reminding them about the specific product they were looking at.</li>  \t<li>You write a blogpost that brings people to your website, but they leave without signing up for your email list– you can target them with an ad offering them a free gift if they come back to your site and opt-in.</li>  \t<li>You're a politician and elections are coming up– you can target everyone who's visited your website with an ad on election day telling your supporters to go vote.</li>  \t<li>You're a realtor and there's a property you want to sell– you can target people who look at it on your website with an ad inviting them to an open house.</li>  \t<li>You're launching your online product or class and people have opted-in for a free preview class you've created, but they haven't listened to it yet– you can target specifically the people who haven't yet listened with an additional offer.</li>  </ul>  <p>  \t                        This technology is the most effective and lowest cost advertising you can make use of on Facebook and has been accessible to larger companies with huge budgets until only recently. Now it's available to even the smallest of businesses and individuals, but only in a DIY format. I've built this course to teach you everything you need in under an hour to get started with your first campaign.  </p>  <p>  \t                        I've included industry-specific examples, and will add any others that participants suggest. Currently these ones are available:  </p>  <ul>  \t<li>Facebook Retargeting for blogs</li>  \t<li>Facebook Retargeting for events</li>  \t<li>Facebook Retargeting for online product launches</li>  \t<li>Facebook Retargeting for web designers &amp; graphic designers</li>  \t<li>Facebook Retargeting for musicians &amp; bands</li>  \t<li>Facebook Retargeting for politicians &amp; elections</li>  \t<li>Facebook Retargeting for real estate agents &amp; realtors</li>  \t<li>More to come...</li>  </ul>", 
    "end_date": null, 
    "title": "Facebook Retargeting Pro (PPC Advertising)", 
    "price": "50.00", 
    "instructors": "Alexander Ernst", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287686_9f63_15.jpg", 
    "course_url": "https://www.udemy.com/facebook-retargeting/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-25T18:58:48Z"
}