{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Make Smart Autopilot Marketing Campaigns on Facebook using free targeted traffic and a massive value tool!</strong></p><p><strong>with this course not only will you learn new marketing method but also You will get FREE LIFETIME ACCESS TO A PREMIUM SOFTWARE THAT CURRENTLY SELLS FOR $97/MONTH!</strong></p><p><strong>Software name is: Notification Pro</strong></p><p>Have you ever thought that you can replace the ordinary email marketing with much more powerful marketing using only Facebook and free traffic? Now you can!</p><p>in this course you will learn new method of Facebook Marketing that will help you get better results and you will put your hands on a brand new technology that uses Facebook powerful notification system ti get you free targeted traffic on demand to your website,videos,offers or anything you want!</p><p>Take action now and join the course and start generating more leads and engagement and for sure more money!<br></p><p>*please note that in order to get the free tool that is a gift with the course you will have to complete %100 of the course and use Facebook login to get your membership created in the tool and this is completely optional and your data will not be added to any lists or shared or spammed in any way.<br></p>", 
    "end_date": null, 
    "title": "Facebook Marketing 2016: #3 Your own Facebook Autoresponder", 
    "price": "50.00", 
    "instructors": "Dot Com Success Academy, Kenz A.Soliman", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613336_9d7e_6.jpg", 
    "course_url": "https://www.udemy.com/facebook-autoresponder-smart-autopilot-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T02:29:01Z"
}