{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em style=\"\">-------------------------------------------------------------------------------------------------------------</em>  </p>  <p>  \t<em style=\"\">Update - New Lectures Added February 2015!</em>  </p>  <p>  \t<em style=\"\">-------------------------------------------------------------------------------------------------------------</em>  </p>  <p>  \t<strong style=\"\">Are you looking for a way to grow your Facebook Fan Pages full of highly targeted fans without breaking the bank on Facebook ads? </strong>  </p>  <p>  \t    I&#039;ve laid out my entire strategy I&#039;ve been using to grow Facebook fan pages into the 10,000&#039;s of fans on a shoestring budget, only targeting Facebook users living in the United States where ad costs are much higher than anywhere else! Not only can you use this tested and proven strategy on your own pages, <strong style=\"\">but you can even get paid to grow other people&#039;s pages!</strong>  </p>  <p>  \t    Inside this course you&#039;ll get specific, step-by-step instructions to help you understand the basics of Facebook advertising as well as walk you through the entire set up process. <strong style=\"\">By the end of this course you will be completely ready to start growing massive Facebook pages from $0.02 likes!</strong>  </p>  <p>  \t    You’ll learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to target an audience of people who are passionate about their niche!</li>  \t<li style=\"\">How to determine whether or not your page before doing any work!</li>  \t<li style=\"\">The correct way to set up your Facebook pages for maximum audience engagement!</li>  \t<li style=\"\">Why this promotion strategy works so well and why other methods don’t work!</li>  \t<li style=\"\">How to find the exact demographics of your target audience for the best results!</li>  \t<li style=\"\">How to set up your campaigns spending only a few dollars a day while growing your pages extremely fast!</li>  \t<li style=\"\">The correct way to scale your ads - do this wrong and you’ll be losing money!</li>  \t<li style=\"\">What type of content you should post to your page and why this works so well!</li>  \t<li style=\"\">How to find out what time your fans are most active on Facebook!</li>  \t<li style=\"\">A simple trick that allows you to let your fan pages run on autopilot!</li>  \t<li style=\"\">And much more!</li>  </ul>  <p>  \t    You can even preview the first 2 videos of this course completely free to decide if this is for you!  </p>  <p>  \t    You&#039;ll also have direct access to me to ask any questions you may have, get clarification on anything you don’t understand, and get feedback on your ad campaigns.  </p>  <p>  \t    If you are looking for a fast way to start growing massive Facebook fan pages on a tiny budget starting as soon as today - this is the course for you!  </p>  <p>  \t<strong style=\"\">I guarantee you&#039;ll be growing Facebook pages with $0.02 likes or less after taking this course. </strong>You have a 30-day, 100% money-back guarantee with no questions asked so you have nothing to lose.  </p>  <p>  \t    Click the &quot;take this course&quot; button above now, and I’ll see you on the inside!  </p>", 
    "end_date": null, 
    "title": "Facebook Pages for 2015: Bigger Pages from Cheap Likes", 
    "price": "30.00", 
    "instructors": "AJ Montoya", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415226_b275_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-penny-likes/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T19:32:30Z"
}