{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Facebook Profiles are for People | Facebook PAGES are for BUSINESS</strong>  </p>  <p>  \t  Facebook is still the most popular social networking site out there, with over one billion registered users.  </p>  <p>  \t<strong style=\"\">And research shows that over 40% of Facebook users actually want to connect with businesses on Facebook.</strong>  </p>  <p>  \t  But to reach this audience, you need to meet them on their turf - and creating a Facebook Page for your business or organization is the way to do that.  </p>  <p>  \t  A Facebook Business Page can help you reach and connect with your target audience within the Facebook platform.  </p>  <p>  \t<strong style=\"\">This condensed and comprehensive course will get you up and running using Facebook Pages to their full potential in no time. </strong>  </p>  <p>  \t  Business owners, entrepreneurs, marketers, social media strategists, non-profits, artists, musicians, authors, and advertising professionals will all benefit from taking this course.  </p>  <p>  \t  Follow author, developer, and new media pioneer, Deltina Hay, as she walks you through the process of setting up and developing your Facebook Page in her typical no-nonsense teaching style.  </p>  <p>  \t<strong style=\"\">Using a real-world example from scratch, Deltina shows you hands-on how to:</strong>  </p>  <ul style=\"\">  \t<li>Create a customized and optimized Facebook page</li>  \t<li>Take advantage of all the features and settings on the Facebook page platform </li>  \t<li>Populate your Facebook timeline with optimized content </li>  \t<li>Use Facebook applications to further customize your Facebook page </li>  \t<li>Integrate your Facebook page with your online presence </li>  \t<li>Promote your Facebook page using affordable advertising options </li>  \t<li>Use HootSuite to automate your updates and import blog posts</li>  </ul>  <p>  \t <strong style=\"\"> Worksheet and Resources Included!</strong><br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p>  \t <strong style=\"\">Don&#039;t put your Facebook Page off any longer Take the course today, and start marketing on Facebook tomorrow!</strong>  </p>", 
    "end_date": null, 
    "title": "Facebook Page Essentials", 
    "price": "20.00", 
    "instructors": "Deltina Hay", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/88440_9c4d_6.jpg", 
    "course_url": "https://www.udemy.com/facebook-page-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-05T02:47:34Z"
}