{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tHere&#039;s what one student in this course had to say:  </p>  <p>  \t<strong style=\"\">The Facebook Recipe for Success</strong>  </p>  <p>  \t<em style=\"\">Wendy shares, in this fast paced course, the quickest, easiest methods for increasing your Facebook Likes and engagement. Some great easy-to-implement strategies that will make FB your personal ATM. I have been using FB for 7 years now and wish I had this course when I first joined up. Every lecture is packed with &quot;Man, I didn&#039;t know I could do that!&quot; moments. I feel like I have to leave a #Hashtag or Like here...</em>  </p>  <p>  \tFacebook is getting tougher and tougher to get results on if you own a business.  </p>  <p>  \t        The first step to success is getting more Facebook page likes and then engaging with your followers.  </p>  <p>  \t        In this Facebook training I will show you how I regularly get 50-80 new likes EVERY week - with Facebook NO ads!  </p>  <p>  \t<strong style=\"\">    You get 5 videos including:</strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\"></strong>Introduction</em>  </p>  <p>  \t<em style=\"\">Keywords &amp; Types of Facebook Pages  </em>  </p>  <p>  \t<em style=\"\">Understanding Facebook Insights &amp; Making Them Work for You  </em>  </p>  <p>  \t<em style=\"\">My Five Secrets to Facebook Success  </em>  </p>  <p>  \t<em style=\"\">Final Facebook Tips - more resources  </em>  </p>  <p>  \t        I&#039;ve also included extra resources including graphics you can use on your Facebook page, resources for royalty free graphics, graphics creation tips and more!  </p>  <p>  \t        If you&#039;ve got a business page on Facebook and are frustrated by your results, this training is for you!  </p>  <p>  \t        This quick course gives you easy to do steps to really get results in a short period of time.  </p>  <p>  \tAnd another student had this to say:  </p>  <p>  \t<strong style=\"\">PHENOMENAL!!</strong>  </p>  <p>  \t<em style=\"\">I&#039;m ready to take FB by storm after taking Wendy&#039;s course. There was soo much she shared that I didn&#039;t know. After completing this course, I immediately came down to my office and started testing the various tools. I am looking forward to seeing the results. Thank you Wendy for providing such valuable information that I know will help my business GROW!! Get the course!!</em>  </p>", 
    "end_date": null, 
    "title": "Facebook Ads - NO You Don't Need Them to Get Engagement! ", 
    "price": "20.00", 
    "instructors": "Wendy McClelland", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372530_30df_7.jpg", 
    "course_url": "https://www.udemy.com/facebook-secrets-to-getting-page-likes-without-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T17:15:43Z"
}