{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>      <strong>Entrepreneur’s Advanced Strategies for Facebook Fan Growth</strong><br></p><p>This course will help you build a large community of fans and followers through the use of affordable Facebook ads. </p>    <p>Step by step, you’ll learn how to set up a compelling Facebook ad campaign that will attract targeted fans to your business. You’ll end up growing a fanbase, driving more traffic to your site, and increasing conversions. </p>    <p><strong>Build Your Email List with an Ad Campaign that Works</strong></p>    <ul><li>Lower Your Advertising Costs by Implementing a Proven Step-by-Step Formula </li><li>Learn How to Harness the Power of Custom Audiences</li><li>Grow Your Fanbase and Get More Likes with Retargeting</li><li>Boost Your Sales by Driving Traffic to Your Site</li></ul><p><br><strong>Deploy Advanced Acquisitions Strategies with Minimal Investment</strong></p>    <p>Social media provides great opportunity for businesses today. Rather than paying a professional advertising agency, business owners and marketers now have the ability to set up an ad campaign quickly and easily. </p>    <p>The results are just as good. Your business will be exposed to the millions of people on Facebook, acquiring more likes and more traffic as you implement this step-by-step formula.</p>    <p><strong>Contents and Overview</strong></p>    <p>The course takes you through three advanced features that all work together to achieve optimal results. </p>    <p>The first feature you’ll learn is Custom Audiences. You’ll learn what Custom Audiences are and how to use them to accelerate the growth of your fan base. You’ll watch the instructor set up a Custom Audience so you can see how to do it in less than 5 minutes.</p>    <p>The next powerful feature is retargeting. You will learn how to connect directly with your website visitors so you can turn them into Facebook followers. The whole process, including placing a retargeting pixel and installing a retargeting list, will be covered.</p>    <p>Now it’s time to master the third feature: Lookalike Audiences. The purpose behind them and how to use them will be explained so you can supercharge the growth of your fan base.</p>    <p>Towards the end of the course, you’ll learn how to create an effective Facebook ad campaign. You’ll have your large community of followers in place and ready to receive the compelling ad messaging that you’ve created to benefit your business.</p>    <p>Get ready to create a powerful advertisement that will be seen by the masses!</p>", 
    "end_date": null, 
    "title": "Facebook Marketing: Next Level Fan Growth Strategies", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654304_96f9_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-next-level-fan-growth-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T08:04:48Z"
}