{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>A comprehensive, six module e-learning course to learn the absolute essentials of setting up a business Facebook page for a your company, brand or product. </p><p>Within this video-based course, we show you the precise steps to populate your Facebook page with useful articles and information, how to gain 'likes', 'shares' and importantly new client and customer enquiries. </p><p>Facebook Foundations is designed with small business owners in mind who have little or no experience with Facebook and digital marketing. The course acts as a really quick and efficient way of making sure that your Facebook page is set up correctly, tailored to your own industry and that you know what to do on a monthly basis to make sure that it is driving traffic to your website and potential new clients and customers to your business.</p><p><em>Whether you are a freelancer, working from home looking to build your presence or a small business with a high street premises, then this course is for you!</em></p><p><strong>What Does the Course Cover?</strong><em></em></p><p><strong>Module 1 </strong>begins with background information as to what social media is and what Facebook is, and can do for a business.</p><p><strong>Module 2 </strong>gets your Facebook page actually set up. We explain the theory and then move on to a practical 'how-to' demo within Facebook itself.</p><p><strong>Module 3</strong> is all about finding and sharing good content. We show you how to create Facebook posts and suggest ideas for what to actually say (all with the intention of attracting your ideal client or customer of course!)</p><p><strong>Module 4</strong> explains what community management is and shows you how to 'monitor the conversation'.  </p><p><strong>Module 5 </strong>i<strong></strong>s where we discuss (and show you) how to create two of the most handy and affordable adverts using Facebook advertising.</p><p><strong>Module 6 </strong>is our final module and where we building on the foundations laid so far and look at some great ways to  really boost your followers. We discuss online and offline techniques as well as going through some top tips!</p><p><strong>Why Facebook Marketing?</strong></p>  <p>Social media is one of the most common things people now do online and Facebook is a massive part of that. With over 1 billion active users, small businesses just cannot afford to miss out on the opportunity to get in front of so many potential clients and customers.</p><p>Whether you work from home and need to find new clients, or you have a local business looking to drive new customers through the door, this course will help you to do just that!</p><p>We understand Facebook for business and want to help you do that too, in just a few hours per week. Join us to find out how!</p><p><strong>How Long Will It Take?</strong></p>    <p>The course is broken down into 6 modules/sections all delivered via online videos. Each set of videos lasts for 15-60 minutes in total. </p><p>As part of each module we also ask you to action some 'homework'. i.e. things that you need to actually go and do in Facebook to get your social media marketing started. This isn't just a theoretical course - it has a practical application!</p><p>Finally, each module also ends with a short assessment quiz that tests your knowledge of the subject matter. </p><p>If you studied at a rate of 1 module per week the course would take you 6 weeks. Some people finished quicker and others take their time - it's totally up to you!!</p>", 
    "end_date": null, 
    "title": "Facebook Foundations: Learn Facebook Marketing for Business", 
    "price": "25.00", 
    "instructors": "Susan Yeates", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544332_cd12_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-foundations/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T19:31:15Z"
}