{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t           You are minutes away from gaining access to:  </p>  <p style=\"\">  \t           *<strong style=\"\">15 Lectures of in depth tutorials</strong> covering all aspects of <strong style=\"\">Creating, Optimizing and Promoting your Facebook Business Page!</strong>  </p>  <p style=\"\">  \t <strong style=\"\">*10 HD Videos </strong>showing you step by step <strong style=\"\">how to build a Facebook Business Page  from scratch</strong>, along with <strong style=\"\">PDFs and MP3s</strong>, all Downloadable so you can study them anytime of the day, everywhere!  </p>  <p style=\"\">  \t          *<strong style=\"\">The ideal course for people with no technichal skills</strong> or prior experience on building Facebook Fanpages for Business! Everything is <strong style=\"\">explained fully in simple terms</strong>, easy to understand for everyone!  </p>  <p style=\"\">  \t          *Position your offline or online business into <strong style=\"\">a whole new level of Success</strong> dominating the <strong style=\"\">latest and most effective Facebook Marketing Techniques</strong> that takes just minutes to apply!  </p>  <p style=\"\">  \t <strong style=\"\">*Facebook is the #1 website in the world</strong> with over 1.1 billion people, it&#039;s kind of <strong style=\"\">important to have an online presence</strong> with them.  </p>  <p style=\"\">  \t           *If you are not running a successful page yet on Facebook, <strong style=\"\">you are missing out on tens of thousands of dollars</strong>.The average facebook fan is worth $175. Add that up a few thousand times and that&#039;s what you are missing out on.  </p>  <p style=\"\">  \t           *<strong style=\"\">Great news though!</strong> You are in the best possible position that you could possibly be in right now. <strong style=\"\">You&#039;ve already done more than what 90% of other marketers do</strong>, you&#039;ve shown interest and the willingness to learn.  </p>  <p style=\"\">  \t           *That&#039;s where<strong style=\"\"> Facebook Pages Essentials For Business</strong> comes in. Myself , <strong style=\"\">Nick Niles</strong>, social media expert and Intelligent Training founder and my team <strong style=\"\">worked very hard when putting this training course together.</strong> We wanted to make sure<strong style=\"\"> we covered everything from the basics of running a page to the advanced techniques</strong> that the Fortune 500 companies are using right now.  </p>  <p style=\"\">  \t           *You might think you already know enough to be successful, but <strong style=\"\">Facebook has changed the way pages work and how we can interact with our fans so much this past year</strong>. If you haven&#039;t had the proper training yet, then you won&#039;t be taking full advantage of these tactics.  </p>  <p style=\"\">  \t           *This <strong style=\"\">step-by-step Facebook Marketing Training System</strong> is going to take you by the hand and show you how to <strong style=\"\">safely skyrocket your Business online presence</strong> in the shortest time ever.  </p>  <p style=\"\">  \t           *Now <strong style=\"\">you will have the power to strongly and safely position your business on Facebook</strong> and apply the latest and most effective techniques that take just minutes to apply!  </p>  <p style=\"\">  \t           *This <strong style=\"\">extraordinary Facebook Marketing Training Guide</strong> will reveal the <strong style=\"\">exact steps that you really need to care about the most in order to strongly and safely position your business on Facebook</strong> in even less than a day.  </p>  <p style=\"\">  \t         *<strong style=\"\">Facebook Pages Essentials For Business</strong> is the safest way to become a <strong style=\"\">Facebook Marketing Expert</strong>, in the shortest time possible! Learn how to build Facebook Pages like a Pro, <strong style=\"\">Smart</strong>, <strong style=\"\">Fast </strong>and <strong style=\"\">Simple</strong>!  </p>", 
    "end_date": null, 
    "title": "Facebook Pages Essentials For Business - 2014 Edition", 
    "price": "20.00", 
    "instructors": "★ itraining", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145542_35a4_13.jpg", 
    "course_url": "https://www.udemy.com/facebook-pages-essentials-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-11T14:00:56Z"
}