{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Here is a quick and easy course with all you need to know about Instagram Marketing. Instagram is your place to be when you have a Business. It is still relatively new but anyone seems to be on Instagram where you can share images and videos.</p><p><strong style=\"\">Instagram for your Business Success</strong></p><p>With Instagram you can reach a completely new customer base - done right. So that is what we are going to do in this course. I walk you through the correct set up of your profile as well as what you need to do to gain fans, friends and followers. We also look at a way to upload images from your computer because right now you can use all functions of Instagram exclusively on your tablet or mobile phone. </p><p><strong style=\"\">3 Million potential new Customers for you</strong></p><p>Don&#039;t underestimate a plattform such as Instagram. You do not get a lot more attention there than on other social media platforms but you also find a HUGE new customer base. Instagram has gained its registered members just in the last year about 3 million people - this means 3 million potential new customers for you.</p><p><strong style=\"\">Instagram - Quick and Easy</strong></p><p>This course is meant to be quick and easy. I want to give you the best use of your time - learn all you need to know about Instagram and put it in practice because if you know the basics Instagram is that easy.</p><p><strong style=\"\">Content Marketing Strategy</strong></p><p>Still there is one thing you really need to look at in detail when you explore Instagram and use it for your Business - your Content Marketing Strategy. Just content which is engaging and entertaining is content your readers will respond to. That&#039;s why we have a look at a Content Marketing Strategy.</p><p>Set aside a few hours to learn Instagram. It will pay back huge.</p>", 
    "end_date": null, 
    "title": "Find new Customers w/ the right Instagram Marketing Strategy", 
    "price": "20.00", 
    "instructors": "Monja Wessel", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475066_9a44_3.jpg", 
    "course_url": "https://www.udemy.com/instagram-marketing-all-you-need-to-know/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T15:21:32Z"
}