{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Want to quickly setup a blog and social media website ready to work with your social media?Websites shouldn't sit separate from social media platforms like Facebook and Twitter. They should be integrated and work well together. This course takes you through step by step</p><li>Creating a Brand Voice through Blogs and Other Content Social Platforms</li><li>Create A Social Media Website With All the Facebook And Twitter And YouTube Integrations, A Blog and A Business News/Press Room</li><li>Automate from your blog to Facebook and LinkedIn</li><li>Make sharing part of your social distribution strategy</li><li>Write articles, blog posts and publish immediately!</li><p><br></p><p> I've been named a top blogger by AdAge (Power150 Media and Marketing blogs) and have managed the strategy, campaigns and Facebook Pages and forums and blogs of TV shows such as <strong>JUNIOR MASTERCHEF, IDOL and BIG BROTHER.</strong> I specifically adapted these quick courses to bring social media managers like you up to speed efficiently and cost effectively. </p><p><strong>SHORT COURSE: </strong>This is a mini-course that is part of a much larger Social Media Campaign course - you will find some videos duplicated from the Campaign course on my corporate account. There are also some videos duplicate from the much larger comprehensive corporate social media press room course. However, some students just want a quick and easy course on blogging - that is the purpose of this course. So if you are just looking for <strong>blogging and integrating social media into your website</strong> as part of social media campaigns, this is the course for you!</p>", 
    "end_date": null, 
    "title": "Get Blogging! Social Media Website & Wordpress Blog", 
    "price": "20.00", 
    "instructors": "Laurel Papworth", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628524_7ff3.jpg", 
    "course_url": "https://www.udemy.com/social-media-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T03:30:20Z"
}