{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      In this course we are going to talk about two big Social networks Google + and LinkedIn and how can use them for business promotion tools. This course is separated in two. First we start with talking about Google + and we moving talk for LinkedIn in the second. The focus of the part for Google + is going to be about how to be visible there, we talk about circle building and how that can help in your business strategy. Then we are move to Google tools that are related to Google + that you can use for example Hangouts, Maps, Places, Trends etc. In second part we are focus in LinkedIn and we will start with &quot;Why&quot; use it like business promotion tools and what are the benefits. We talk about premium features, why and how to use them. Then we go to LinkedIn Groups and talk why is important to join to relevant group and participating conversation.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">The course include the following video topics:</strong>  </p>  <p style=\"\">  \t    1. Making your business visible on Google+.  </p>  <p style=\"\">  \t    2. Shared circles in Google+.  </p>  <p style=\"\">  \t    3. Google Hangouts, Places, Trends and Blogs for your business.  </p>  <p style=\"\">  \t    4. LinkedIn page and Premium account.  </p>  <p style=\"\">  \t    5. LinkedIn groups. How to crate great content. Tips and advice.  </p>  <p style=\"\">  \t    6. Presentation Book.  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">A few word about the author of this course Dessislava Dobreva:</strong>  </p>  <p style=\"\">  \t    I believe that if a person can learn to get out of his comfort zone as much as possible, he will have incredible experiences and develop personally in ways that are otherwise impossible.  </p>  <p style=\"\">  \t    I am really passionate about two things - foreign languages &amp; brand management  </p>  <p style=\"\">  \t    My greatest strengths:  </p>  <p style=\"\">  \t    - my motivation  </p>  <p style=\"\">  \t    - my ability to flourish in an international environment  </p>  <p style=\"\">  \t    - my writing &amp; presentation skills  </p>  <p style=\"\">  \t    - the fact that I am convinced that life is 10% what happens to me and and 90% how I react to it.  </p>  <p style=\"\">  \t    Creating an E-learning for Ecognise in 2 languages, called &quot;Turn your “don’t”-s into “do”-s: how to boost your business through social media&quot;. The product consists of videos, powerpoint presentations and articles on the forementioned topic, aimed at entrepreneurs who would like to better explore opportunities for promoting their business in Facebook, Pinterest, Google+, Twitter and Youtube.  </p>  <p style=\"\">  \t    And his motto is:  “GET OUT OF YOUR COMFORT ZONE!”  </p>", 
    "end_date": null, 
    "title": "Google+ and LinkedIn as business promotion tools", 
    "price": "20.00", 
    "instructors": "Slavi Slavov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410914_350a_3.jpg", 
    "course_url": "https://www.udemy.com/google-and-linkedin-as-business-promotion-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T13:51:53Z"
}