{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Google Plus is not just another social networking site. It is a necessary part of any good search optimization strategy.</strong>  </p>  <p>  \t  Though Google Plus is growing as a social and professional networking site, its <strong style=\"\">importance lies in how it is integrated with Google search. </strong>  </p>  <p>  \t  Linking your Google Plus Profile to the blog posts and articles you post online can help them look better in search results and get them seen by more people.  </p>  <p>  \t  Verifying your Google Plus Business Page with your website to get your site more exposure as well.  </p>  <p>  \t  And building a healthy Google Plus presence now will position you better as a thought leader as the Google+ network continues to integrate even more with Google search in the future.  </p>  <p>  \t<strong style=\"\">This condensed and comprehensive course will get you up and running using Google Plus to its full potential in no time.</strong>  </p>  <p>  \t  Business owners, entrepreneurs, marketers, social media strategists, web developers, SEOs, and students will all benefit from taking this course.  </p>  <p>  \t  Follow author, developer, and new media expert, Deltina Hay, as she walks you through the process of setting up and developing your Google Plus Profile and Business Page in her typical no-nonsense teaching style.  </p>  <p>  \t  Deltina first <strong style=\"\">provides an overview of Google Plus features and settings</strong>, and walks you through how to create a customized and optimized Google Plus Profile.  </p>  <p>  \t  Then, using a real-world example, Deltina shows you hands-on how to <strong style=\"\">create an optimized Google Plus Business Page from scratch</strong>.  </p>  <p>  \tDeltina demonstrates how to <strong style=\"\">claim Google Authorship of all your online content </strong>by linking it to your Google Plus profile. As well as how to <strong style=\"\">link your website to your Google Plus Business Page</strong>.  </p>  <p>  \tAnd, finally, she shows you how to <strong style=\"\">integrate your Google Plus presence with your website</strong> and with WordPress.com.  </p>  <p>  \t<strong style=\"\">Worksheet and Resources Included!</strong>  </p>", 
    "end_date": null, 
    "title": "Google Plus Essentials", 
    "price": "20.00", 
    "instructors": "Deltina Hay", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/98962_0a49_4.jpg", 
    "course_url": "https://www.udemy.com/google-plus-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-29T00:03:37Z"
}