{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t Google Hangouts are the most powerful marketing tool for everyone who wants to reach a bigger audience and expand their online exposure.  </p>  <p style=\"\">  \t Why?  </p>  <p style=\"\">  \t Because they live inside Google+, Google’s social platform, and therefore they harness the power of the most visited website of the world.  </p>  <p style=\"\">  \t In addition to this, Hangouts on Air are broadcast and recorded on YouTube, so they also harness the power of the most visited video website of the world.  </p>  <p style=\"\">  \t And the coolest thing is that they come for free!  </p>  <p style=\"\">  \t So, if you are a business owner, an entrepreneur, a teacher, a coach, or someone with a message to share, you should wait no longer to start using Google Hangouts and Hangouts on Air in order to reach more of your ideal clients and prospects.  </p>  <p style=\"\">  \t There’s a catch though.  </p>  <p style=\"\">  \t Just like every new technology and software platform, Hangouts do have a learning curve that you have to go through in order to become comfortable with all the different technical aspects and features.  </p>  <p style=\"\">  \t Now, Hangouts aren’t rocket science and - I want to be clear about that - you can figure this stuff out on your own.  </p>  <p style=\"\">  \t But studying and researching the platform on your own does take time, and you can easily spend hours, or even days, reading Google’s documentation or searching for tutorials, in order to master it.  </p>  <p style=\"\">  \t And I bet you have better ways to invest your time, right?  </p>  <p style=\"\">  \t So, if you don’t feel like wasting a lot of time and energy to learn Hangouts, this course is just what you are looking for.  </p>  <p style=\"\">  \t The Google+ Hangouts Starter Kit is a short but comprehensive guide, designed to quickly get you started with Google Hangouts.  </p>  <p style=\"\">  \t I’ve put together 20 video lessons, plus several checklists and handouts, jam-packed with all the knowledge I have gained studying and using Google Hangouts since they were introduced, as well as being a coach for a major Hangout training earlier this year.  </p>  <p style=\"\">  \t I designed the curriculum for absolute beginners, and no prior knowledge is required, but the course is also very useful for more advanced and experienced users.  </p>  <p style=\"\">  \t All you need to follow the course and to take full advantage of the content is your computer, an internet connection, and a Google+ account (if you don’t have one don’t worry, I’m going to show you how to set it up!).  </p>  <p style=\"\">  \t Short, bite-sized and easy to follow video lectures will walk you through the platform step-by-step, from start to finish.  </p>  <p style=\"\">  \t I’m going to provide you with all the information that you need in order to understand and use the interface and to start confidently hosting your Hangouts, without overwhelming you with unnecessary details.  </p>  <p style=\"\">  \t Since Google is constantly improving the platform and adding new features, the course will be updated regularly to reflect those changes.  </p>  <p style=\"\">  \t As a bonus, I’ll be hosting free, &quot;students only&quot; Q&amp;A Hangouts on a regular basis.  </p>  <p style=\"\">  \t This will be a great way to connect on a personal level and ask me questions!  </p>  <p style=\"\">  \t Wouldn’t it be great if you could easily overcome the technical issues related with the platform and start hosting your own Hangouts within an hour?  </p>  <p style=\"\">  \t Well, you know the answer.  </p>  <p style=\"\">  \t So, what are you waiting for?  </p>  <p style=\"\">  \t Just click the big green button and I’ll see you on the inside!  </p>", 
    "end_date": null, 
    "title": "Google Plus Hangouts Starter Kit", 
    "price": "30.00", 
    "instructors": "Giuseppe Fratoni", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/190242_bdb8_7.jpg", 
    "course_url": "https://www.udemy.com/google-plus-hangouts-starter-kit/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-28T10:57:19Z"
}