{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I created <em style=\"\">Grow Your Author Tribe As You Write</em> as a framework for fiction and non-fiction authors and writers to build a tribe (community) as they write their book, using audio and podcasts.</p><p>I know how challenging authors and writers find marketing their book when it&#039;s published. So much of the creativity has gone into writing with nothing left for marketing it. But marketing and promoting your book is important, especially when so many books published every year.</p><p>Waiting till the book is finished to start marketing, leaves authors and writers vulnerable, and in some cases desperate to sell their book. They revert to &#039;pushing&#039; the book at just anyone rather than nurturing a relationship and &#039;pulling&#039; the right reader before it&#039;s time to buying anything.</p><p>Most Book Marketing experts will tell you to start marketing your book as soon as you start writing me cases desperate to sell their book. </p><p>But how to you do that?</p><p>I&#039;ve created this course to provide authors and writers with the tools and strategies they need to start, build and grow their author tribe as they write.</p><p>Audio is central to this course because your voice has the ability for you to establish and build rapport with your ideal reader quickly. </p><p>In today&#039;s digital world, as authors and writers, you can no longer rely on using the word to connect with their reader. Your readers consume content in different formats and audio allows you to connect personally and  easily. You extend your reach to an audience that consumes content in this way and pull them into your tribe they follow you on your journey to writing and completing your book.</p>", 
    "end_date": null, 
    "title": "Grow Your Author Tribe As you Write for Authors and Writers", 
    "price": "20.00", 
    "instructors": "Viv Oyolu", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499348_4bbe_4.jpg", 
    "course_url": "https://www.udemy.com/grow-your-author-tribe-as-you-write/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T20:38:10Z"
}