{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Want to take advantage of the 610 000 000 people on Twitter?...</p><p>Do you want to learn how I grew my twitter following to over 129,000 real followers and get <strong>1000s of retweets </strong><strong>every single day</strong>?</p><p>Take my course to put forth the best effort into growing your account... Are you tired of not knowing what to do with Twitter?</p><p>Now I have GREAT news for you!</p><p><strong>My tips/tricks reveal how I optimized my twitter account to attract thousands of people and got them engaged in every tweet! My course will take you to the next level in minimal time!</strong></p><p><strong><br></strong></p><p><strong>Say goodbye to not knowing what to do on Twitter and hello to opportunities waiting for you to claim!<br><br></strong>Not Sure?</p><p>Just take a quick look at my Twitter account and it will give you all of the evidence you need!</p><p><strong><u>BY THE END OF THIS COURSE YOU WILL HAVE:</u></strong></p><ol><li>A blueprint on how to optimize your Twitter account and grow your engagements! <br></li><li>Learn how to use all of tool that big social media accounts use daily. <br></li><li>The best strategy for gaining exposure to your Twitter profile!</li></ol><p>I have shared my secrets, tips, and strategies that took me years to learn in order to save you time ,confusion and mistakes that I made in the past. I created a step-by-step guide so that you can see the same results in a matter of days with your Twitter account!</p><p><br>FORTUNATELY, with my course - you're going to learn my methods to becoming a social media influencer without having to invest massive amounts of money.</p><p>I've made thousands of dollars by monetizing my Twitter account and even built my personal account to over 129,000 real followers with a verified blue check! (Check out @TrapPat for proof)</p><p><em></em></p><p>You may have tried other courses on Social Media marketing with little results but let me provide you with this opportunity to grow fast and easy!</p><p>See you on the inside :)<br>- Patrick</p>Full detailsWhat are the requirements?<ul><li>Internet</li><li>Access to Twitter</li><li>Email Address (If you don't already have a Twitter account)</li></ul>What is the target audience?<ul><li>Business Twitter Accounts</li><li>Personal Twitter Accounts</li><li>Twitter accounts of ALL levels (Beginners to Advanced)</li></ul>", 
    "end_date": null, 
    "title": "Grow your Twitter account to over 100,000 followers!", 
    "price": "25.00", 
    "instructors": "Patrick Francis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695852_0c97.jpg", 
    "course_url": "https://www.udemy.com/2016-guide-to-twitter-social-media-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T19:14:46Z"
}