{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<h5 style=\"\">  <p style=\"\"><span style=\"\">Why This Course?</span></p>  </h5>  <p style=\"\"><span style=\"\">This course takes you through the fundamentals necessary to help you build a solid network, and capitalize on it to hunt for opportunities. By taking this course you will be better prepared to:</span></p>    <p style=\"\"><span style=\"\">-Find the job you&#039;re looking for.</span></p>    <p style=\"\"><span style=\"\">-Set yourself up for a promotion.</span></p>    <p style=\"\"><span style=\"\">-Start or add value to a business.</span></p>    <p style=\"\"><span style=\"\">-Search for the right business partners.</span></p>    <p style=\"\"><span style=\"\">Curriculum will conducted through HD Tutorial Videos with voice over guidance, supplementary materials, &quot;action plan&quot; exercise modules, letter and email samples. To take you though the step by step instructions. Weekly office hours included in the program, as well as the option to have additional one-on-one training.</span></p>    <p style=\"\"><span style=\"\">THIS COURSE WILL SHOW YOU HOW TO TURN YOUR ONLINE AND SOCIAL MEDIA NETWORK INTO AN ENGINE FOR NEW BUSINESS OPPORTUNITIES.</span></p>    <p style=\"\"><span style=\"\">My step by step guidance and tools break the course down into simple modules. The goal is to help you succeed.</span></p>  <h5 style=\"\">  <p style=\"\"><span style=\"\">Why Basim?</span></p>  </h5>  <p style=\"\"><span style=\"\">Basim Mirza built his personal brand into an online empire. He is now a serial entrepreneur specializing in social media and enterprise development. He spends much of his time now as a public speaker and an active blogger.&nbsp;</span></p>    <p style=\"\"><span style=\"\">Basim has spoken at the renowned Schulich School of Business, which ranks the #1 Business School in the World by Aspen Institute and Wall Street Journal. He&#039;s also spoken at University of Toronto,Wilfrid Laurier, and many other established schools across Canada. With the impact and power behind his methodologies, Basim Continues to be invited back to speak at these prestigious schools.&nbsp;</span></p>    <p style=\"\"><span style=\"\">He has also been featured as a main speaker for NSPIRE, interviewed by CBC Radio, and has been featured on CityTV, Virgin Radio, and Yahoo Pulse.&nbsp;</span></p>    <p style=\"\"><span style=\"\">BASIM IS EXTREMELY PASSIONATE ABOUT EMPOWERING LEADERS TO BUILD THEIR PERSONAL BRANDS, AND TRANSPIRE THEM IN TO PERSONAL EMPIRES.&nbsp;</span></p>  ", 
    "end_date": null, 
    "title": "Grow Your Social Media Presence", 
    "price": "30.00", 
    "instructors": "Basim Mirza", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48482_ac6d_13.jpg", 
    "course_url": "https://www.udemy.com/socialmedia/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-04T05:19:15Z"
}