{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<br style=\"\">  \t    FACT: Facebook and Twitter are the fastest-growing social media platforms!  <br style=\"\">  \t    You can use Facebook and Twitter to increase awareness about you and your business.  <br style=\"\">  \t    With the increase in  growth of social media, being able to enter people&#039;s conversations is easier than ever.  <br style=\"\">  \t    This does not require you to sell directly.  <br style=\"\">  \t    In fact, if you try to hard-sell anyone on these social media sites, it can actually backfire.  <br style=\"\">  \t    It&#039;s all about having enjoying yourself - and making sure those who enter your conversations are enjoying themselves as well.  <br style=\"\">  \t    Now we are going to focus on one feature that many of these platforms support.  <br style=\"\">  \t    Here come the hashtags...  <br style=\"\">  \t    Twitter is a good example it lets you use hashtags to make Tweets more searchable. The way you do it is by placing a # sign in front of the keyword or keyword phrase.  <br style=\"\">  \t    Twitter shows the top hashtags in the Trends section . Imagine being able to tap into the hottest hashtags.  <br style=\"\">  \t    So how much traffic can you get from this?  <br style=\"\">  \t    Well, the amount of traffic you get really depends on how interesting your conversion is and how it relates to the hashtag you chose.  <br style=\"\">  \t    Choosing hashtags can be the difference between getting targeted and non-targeted traffic.   <br style=\"\">  \t    Introducing... &lt;&lt;Title&gt;&gt;  <br style=\"\">  \t<br style=\"\">  </p>  <p>  \tGo ahead and checkout  this video course. Grab this video course and start researching highly-demanded Hashtag keywords -  to enter people&#039;s conversations while their guard is down so that you can ultimately promote your products and services.  <br style=\"\">  \t    P.S. Finally, Discover How to Generate Highly-Targeted Facebook and Twitter Social Media Traffic with Hashtags...Even If You Don&#039;t Know How to Get Started, Starting Today!  <br style=\"\">  \t    P.P.S. This specific training course was designed so you could watch over my shoulder, step-by-step, click by click.  </p>", 
    "end_date": null, 
    "title": "Hash Tag Secrets: How I get unlimited traffic with hash tags", 
    "price": "20.00", 
    "instructors": "Fred Owen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304492_e1f9_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-traffic-by-using-hash-tags/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T23:31:15Z"
}