{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will reveal to you how to convert your Facebook fans into customers in three easy steps.</p>    <p>You’ll discover a complete guide that will allow you to turn your audience into buyers like a professional Facebook marketing agency, which will ultimately result in more sales and recurring revenue! </p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Reap the Benefits Of Getting More Customers</strong></p><ul><li>How to convert Facebook fans into paying customers </li><li>How to engage your audience and earn their trust with third party content </li><li>Step-by-step instructions to turn your fans into list subscribers &amp; customers </li><li>… and much more!</li></ul><p><br><strong>Contents and Overview</strong></p><p>This course will walk you through all the steps you need to turn your loyal audience into paying customers.</p>    <p>First, you’ll learn all the tricks to get your audience engaged. I’ll show you how to earn their trust with high-quality content that your audience will fall in love with! You’ll also discover one 100% free tool to find the best performing content in your niche market with just a few clicks!</p>    <p>Next, I’ll walk you through the process of getting people on your email list, which will be your primary distribution channel for all your products &amp; services. I’ll show you how to promote your opt-in page to your Facebook audience and how to drive more traffic to it in order to accelerate the growth of your business!</p>    <p>In the third step, we’ll cover how to turn your audience into paying customers. You’ll master the art of selling on your fan page and discover two cool hacks to sell more products and services. </p>    <p>By the time you complete the course, you’ll be ready to grow your customers list and build your tribe of loyal buyers like the most successful businesses out there!</p>", 
    "end_date": null, 
    "title": "How To Convert Your Facebook Fans Into Buyers ", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699992_6b85_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-convert-your-facebook-fans-into-buyers/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T14:21:03Z"
}