{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Welcome to Mailman Group’s course on how to use Chinese social media to grow your brand in China. This course will teach you the basics of China’s unique social media landscape and get you started in growing your presence online.  </p>  <p>  \t<strong style=\"\">Establish your Chinese Social Media Presence</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Learn the unique background to China’s social media landscape</li>  \t<li style=\"\">Launch a Weibo account and learn the basic functions</li>  \t<li style=\"\">Open a WeChat account and understand key features of this platform</li>  \t<li style=\"\">Review the changes to China’s social media in 2014</li>  \t<li style=\"\">Recognise the latest trends online for China in 2015</li>  </ul>  <p>  \t  China’s social media has been constantly evolving since major Western networks were blocked. Since then, Chinese networks have become the major platforms online, including Sina Weibo, China’s version of Twitter and WeChat, the fastest growing network in 2014 with 500 million active monthly users. This course provides a unique insight into China’s social media landscape and the basics on how to set up an account, gaining an understanding is extremely valuable huge benefit for people with a global outlook.  </p>  <p>  \t  By the end of this course, you’ll be able to establish a China social media presence on two platforms, WeChat and Weibo, as well as having learnt the skills to design, grow and measure your accounts. We’ll teach you the key features of Weibo, including searching on the platform and what’s trending. You’ll also learn how to maximize your presence on WeChat with automated responses and account design, as well as the different media available on the platform. The course also includes supplementary insights including a review of China’s digital landscape in 2014 and our predictions for 2015.  </p>  <p>  \t  Mailman Group is a social media and technology company based in Shanghai, China, that provides digital, media, and commercial opportunities for leading brands across the sports, entertainment, and tourism industries.  </p>", 
    "end_date": null, 
    "title": "How To Use Chinese Social Media To Create A Fanbase In China", 
    "price": 0, 
    "instructors": "Mailman Group", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400686_4b47.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-chinese-social-media-to-create-a-fanbase-in-china/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T02:53:29Z"
}