{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Struggling to get likes on your Facebook pages? </strong></p><p>Would you like <strong>1000's strategically targeted likes</strong> from your ideal customers or clients? </p><p>There is no other platform that offers such targeted ad capabilities to the public for such low cost. When done right, which I will teach you, you can <strong>spend as little as 1-5 dollars a day</strong> and grow your tribe on Facebook.</p><p><strong>Up to date as of October 2015 with tactics and techniques that are working NOW.</strong></p><p> As an online entrepreneur since 2005 I have learned through trial and error where to spend my time and marketing efforts. I ALWAYS recommend my clients get on Facebook right away!</p><p><strong>Step by step instruction</strong> as you watch over my shoulder, I set up a brand new campaign.</p><p><strong>I am available to answer questions as they come up and will post answers publicly for others to learn from as well. </strong></p><p>I don't tell you what to do, I show you what to do. Once you have completed the course you will be ready to launch your first Facebook page like campaign with <strong>ease and effective results!</strong></p><p>I know you have plenty of options on how to increase your knowledge. I am extremely grateful for you and your time. Make sure to enroll in this easy, actionable course and start monetizing your online presence by growing your Facebook likes with low cost and effective Facebook ads.</p><p>Click enroll now to get started immediately!</p>", 
    "end_date": null, 
    "title": "How I Set Up A Facebook Ad for Page Targeted Likes and Leads", 
    "price": "20.00", 
    "instructors": "Jen Butler", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628352_3bf7_3.jpg", 
    "course_url": "https://www.udemy.com/facebooklikecampaign/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T22:39:46Z"
}