{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">  Klout</strong> is a social media website and mobile app that uses <strong style=\"\">social media analytics</strong> to rank its users according to online social influence that is referred to as the &quot;<strong style=\"\">Klout Score</strong>&quot;, which is a numerical value between 1 and 100. <em style=\"\">Klout</em> measures the size of a user&#039;s social media network and correlates the content created to measure how other users interact with that content an provides a numerical ranking that shows how much <em style=\"\">social influence</em> a user on <strong style=\"\"><em style=\"\">Klout</em></strong> has across the many social media networks.  </p>  <p>  \t  Klout measures across many of the most popular social media networks such as Facebook, Foursquare, Google+, Instagram, LinkedIn, Twitter, Wikipedia combined data to create an overall Klout Score. Each Klout score ranges from 1 to 100 and just like school the higher your score means a higher ranking and determines the user&#039;s online social influence. I believe one of the best benefits about Klout is that you can link multiple social networks which is then aggregated to influence the user&#039;s Klout Score and this will eventually be looked at favorably by many search engines and multiple businesses.  </p>  <p>  \t  This rising Social Media Network allows for people to have a standardized score for social influence that can be measured with it&#039;s customized approach to measuring anyone&#039;s social media influence and popularity.  When anyone says they have any kind of influence across any social media network then this amazing Social Media platform is one way to measure just how popular and how much Klout that person has.  </p>", 
    "end_date": null, 
    "title": "How To Klout - Your Klout Score, Social Media Sites and You", 
    "price": "20.00", 
    "instructors": "Lee Beattie", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251022_b0df_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-klout/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T16:58:03Z"
}