{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tIt&#039;s well known that in China, popular social media platforms such as Facebook, Twitter, and Youtube are not available. Instead, local equivalents the likes of Weibo, WeChat, and Youku has sprung up in the last decade that caters specifically to the Chinese demographic, psychographics, and consumer needs. A lot of people are surprised at the level of mobile and social media adoption by the Chinese netizens, and the vast opportunities this present for businesses that operate in China.  </p>  <p>  \tBut these opportunities are not limited to China-based businesses. More and more, the global Chinese consumer class is taking its consumer habits and spending power with it abroad.  </p>  <p>  \tSo how can your business or organization benefit from this seismic change?  </p>  <p>  \t    This course introduces the basics of Chinese social media, and more specifically, what Chinese social media is, why it&#039;s important and relevant for businesses based in the west, and how western businesses and organizations can take advantage of the rising Chinese consumer class and Chinese online platforms.  </p>  <p>  \tDuring the lecture, you will hear the story of how an Australian lavender farm benefited unexpectedly from a social media boost. You will also learn the two reasons that drive social media and mobile commerce in China. From there, you will get a detailed look at how merchants are leveraging the increasingly connected young consumers to sell everything from movie tickets, fast food, taxi rides, to phones and even cars through mobile social platforms. You will see how businesses in the west, whether they are in tourism, luxury retail, education, or real estate, can benefit from gaining a better understanding of their Chinese clients through social media, and attract more potential clients through the same channels.  </p>  <p>  \tMore specifically, you will learn:  </p>  <ul style=\"\">  \t<li><span>Why you should care about what&#039;s happening in the Chinese online space</span></li>  \t<li><span>Potential for business growth through an understanding of Chinese social platforms</span></li>  \t<li><span>How your business (no matter what industry!) can benefit from the rising consumer tide and connectivity in China</span></li>  </ul>  <p>  \tThis is the right course for you, whether you are a large or small business, looking for more growth and engagement opportunities in the Chinese market.  </p>", 
    "end_date": null, 
    "title": "How Chinese social media can help your business", 
    "price": 0, 
    "instructors": "Dana Chen", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308192_5d9e_3.jpg", 
    "course_url": "https://www.udemy.com/how-chinese-social-media-can-help-your-business/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T08:24:18Z"
}