{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong>Making money managing small business social media is easy when you know how.</strong></p><p style=\"\">Enrol and I'll personally share my simple step-by-step process that makes me thousands each month with very little work on my part. Your training includes a complete suite of resources and all the materials you need to start immediately. <strong>No special skills required.</strong></p><p style=\"\">It's all easier than you might think. I typically never talk to  my clients, the money appears \"magically\" in my account on the first of the month and I have no risk or down-side because I get paid in advance (and you will too.)</p><p style=\"\"><strong>BONUS MATERIALS ... YOURS FREE ... VALUE $4,975</strong></p><p style=\"\"><em>This course contains copies of my actual sales letter to clients, the web page (html + copy), promotional emails, order emails, lead generating report (use 'as is'), client on-boarding audit document, step-by-step process guide and much more. Yours to literally copy-n-paste your way to rapid results!</em></p>  <p style=\"\"><strong>Hello, my name's James Burchill and I'm a \"lazy\" entrepreneur!</strong></p>  <p style=\"\">  \t                                                                                                                                                                                                              I enjoy down time, reading books, writing, watching movies, dinners out with my friends and so on. I only work \"hard\" a few hours a month and the rest of the time I use systems and outsourced contract staff.  </p>  <p style=\"\">  \t                                                                                                                                                                                                                                                                Even working just a few hours a month doing what I do, I make more than most each year. It's a simple system and when I started implementing it I was making just an extra $1,000 a month. Later when I scaled it up to 12 clients I made an extra $6,000 a month ... and at my \"busiest\" (<em>17 clients</em>) I was banking an extra $8,500 per month - <strong>that's just </strong><strong>over $100K per year</strong> - on top of all the other things I do - or don't do *wink*  </p>  <p style=\"\">  \t                                                                                                                                                                                                                                                                                                                                 Look, I'm not saying you will make this much - I don't know you or whether you will do anything with the material and training I provide. But if you follow the formula <em>you will make money</em> - guaranteed. There's no magic to it, it's a simple service and you get paid to deliver it (note: I said 'deliver it' not do it...) How much you get is entirely up to you but it will be a lot more than the one-time investment you'll make in this course.  </p>  <p style=\"\">  \t                                                                                                                                                                                                                                                                                                                                 So now that we're clear, here's what I'll teach you (and this isn't theory) as with all my courses - they're from personal experience and in the case of this course, I'm still doing this myself and making thousands every month from it.  </p>  <p style=\"\">  \t                                                                                                                                                                                                                                                                                                                                 So why would I teach you? Doesn't it create competition? Not really, people buy from people for a whole range of reasons and unless you're living right next door to me (in which case let's partner up and make even more money - LOL!) there will be no issue.  </p>  <p style=\"\">  \t<strong>I'll show you my \"content made easy\" process from start to finish:</strong>  </p>  <ol>  \t<li>I'll explain WHY clients will pay you (it's not what you think.)</li>  \t<li>How I get leads and convert them automatically into clients.</li>  \t<li>How I handle contractors and where I find them.</li>  \t<li>How I time the tasks to keep it simple. Minimal work. Maximum profits.</li>  \t<li>How I automate client delivery throughout the month. The tools I use.</li>  \t<li>How I get paid automatically each month. No pesky \"receivables\"</li>  \t<li>How I easily up-sell the client with other high-value services</li>  \t<li>And <strong>more ... BONUS Materials Value: $4975</strong>  \t<ol>  \t\t<li><em>The actual SALES PAGE from my \"secret offer\" website I share with clients (the HTML file plus a PDF edition for reference.)</em></li>  \t\t<li><em>Copies of emails I've written and sent to clients to land new business</em></li>  \t\t<li><em>Copies of the Job Wanted adverts I use to hire contractors</em></li>  \t\t<li><em>Copies of the email I send to contractors when booking work</em></li>  \t\t<li><em>Copies of the email I send to clients when sending them their content</em></li>  \t\t<li><em>The actual \"CDS\" excel worksheet I use when on-boarding a new client</em></li>  \t\t<li><em>A copy of the special lead generation report I offer new client leads</em></li>  \t\t<li><em>Bonus training manual on the 36 Ways to FAIL in Social Media </em></li>  \t\t<li><em>6 Secret content source ideas + a sample advert for the service offer.</em></li>  \t</ol>  \t</li>  </ol>  <p style=\"\">  \t                                                                                                                                                                                                                                                                                                                               I'm a little embarrassed to say it ... but this is a dead simple solution that provides a valuable service to local business clients who have very little time and know they need this now. And you can manage it all remotely from home in a couple of hours per month.  </p>  <p style=\"\">  \t                                                                                                                                                                                                                                                                                                                               By the way ... if you hadn't already checked me out, I'm a bestselling author and written books about social media, automation, systems and marketing. I've advised GoodYear, eBay and other major brands about their social media marketing, spoken at conferences about social media and taught social media at the University level as an adjunct Professor. Lastly, I'm still offering this \"solution\" to my clients today making this is the real thing ... remember, it's NOT theory - it's practical advice that's working today.  </p>  <p style=\"\">  \t                                                                                                                                                                                                                                                                                                                               So, what are you waiting for ... </p><p style=\"\"><strong>Enrol in this course now and get paid to help local businesses with their social media!</strong></p><p style=\"\"><em>-------------------- PLEASE NOTE <em>--------------------</em></em></p><p style=\"\"><em>PS. I teach you how to offer and implement a simple social media service for business. This is not a course about every social media platform available. I don't get into how to use specific platforms - in fact I successfully make money by offering my clients BASIC social media updates using ONLY Twitter, Facebook and if I'm feeling generous ... LinkedIn (I clone the content.) Remember ... I'm a lazy entrepreneur - if you want to learn a hard system that requires more work, there are other courses for that out there ;-) </em></p>", 
    "end_date": null, 
    "title": "How To Become a Profitable Social Media Manager (No Exp Req)", 
    "price": "20.00", 
    "instructors": "James Burchill", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361574_c0eb_18.jpg", 
    "course_url": "https://www.udemy.com/socialmediasecrets/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T17:02:17Z"
}