{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Exasperated that only a handful of your Facebook page likes ever get to see what you've posted on your Facebook page?</strong></p>\n\n<p>Then this course is for you! </p>\n\n\n\n<p><em>\"Post <strong>reach</strong> is the number of people who have seen your post. Your post counts as <strong>reaching</strong> someone when it's shown in News Feed.\" - Facebook</em></p>\n\n\n\n<p>A few years ago you could post something on your Facebook page and it could be seen in the news feeds of around half of the people who liked your page with very little effort from you.</p>\n\n\n\n<p>Not any more.</p>\n\n\n\n<p>Now, anything you post on your Facebook page will typically reach only a handful of the people who like your page. Unless you know the tactics that will boost your reach, of course!</p>\n\n\n\n<p>In this course I'll show you seven ways you can dramatically increase your Facebook page post reach without paying for ads, including:</p>\n\n\n\n<p>- How to track the reach of your posts so you can tell which tactics are working and stop wasting time on those that aren't</p>\n\n\n\n<p>- One thing you must have for your page to be a success (but that most page owners don't know about)</p>\n\n\n\n<p>- How to boost the reach of your posts by stepping up engagement</p>\n\n\n\n<p><strong>Tip: Facebook changes fast so always check the date of a course before you sign up - this one was released in June 2015 and last updated in April 2016.</strong></p>\n\n\n\n<p>So join this short course now and boost your Facebook page post reach today!</p>\n\n\n\n<p>#facebook #facebookmarketing #facebookpage #facebookforbusiness #facebookreach</p>", 
    "end_date": null, 
    "title": "How to increase Your Facebook Page Reach Without Ads", 
    "price": "20.00", 
    "instructors": "Helen Lindop", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530296_2bbc_3.jpg", 
    "course_url": "https://www.udemy.com/increase-your-facebook-page-reach-without-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T12:06:03Z"
}