{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The course is about how to boost your profit with facebook step by step. If you are using facebook as your tools to grow your business or to improve your business, here is  the answer.</p><p>i will teach your about how you can do research about your product, keywords, and where it still the most sales through google trends and also to test the keyword with google adwords before you made as your facebook name or link. </p><p>After that you will learn how to impress people to your Facebook profile in order to build personal branding or trust. You will learn how to optimize your fan page with Facebook insight, and also Audience insights before your create an advert.</p><p>In order to boost your profit i will teach you the Facebook news feed algorithm  and 7 type of posts which attract a lot engagement</p><p>The course will take an Hour and 15 Minutes, you will learn step by step, but i made it enjoyable for your and also quiz as overview. Don't worry, i didn't make every video.</p><p>I strongly recommend you to take this course because</p><p><br></p><ol><li>The course not just a theory, but it practicable. You can do it and measure what i teach.</li><li>The course base on my experience, so if i can do it. You can do it too.</li><li>The will help your to optimize the performance of your Fan Page in order to boost your profit.</li><li>I will tell you how to create an an advert to increase your engagement. </li><li>I will tell you the secret of Facebook newsfeed algoritm. </li><li>I will tel you 7 the most engaging post. </li></ol><p>. <br></p>", 
    "end_date": null, 
    "title": "How to Boost Your Profit With Facebook", 
    "price": "20.00", 
    "instructors": "Tolop Marbun", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708844_0ae2.jpg", 
    "course_url": "https://www.udemy.com/how-to-boost-your-profit-with-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T19:06:37Z"
}