{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will reveal to you how to promote your webinar and get hundreds of prospects on board with paid Facebook ads!</p>    <p>You’ll learn how to create highly targeted paid traffic campaigns and reach out to potential buyers like a professional Facebook marketing agency!</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Reap the Benefits Of Promoting Your Webinar With Facebook Ads</strong></p>    <ul><li>Gather valuable information about your target audience with FB Audience Insights </li><li>Work with conversion tracking to measure &amp; optimize your campaigns </li><li>Step-by-step tutorials to create converting ads in minutes </li><li>Deploy advanced retargeting strategies to take your campaigns to the next level</li></ul><p><br><strong>Contents and Overview</strong></p>  <p>This course will walk you through all the steps you need to get more exposure for your webinar and drive converting paid traffic to your webinar squeeze page.</p>    <p>First, you’ll learn all the tricks to define your ideal client in less than 10 minutes and gather valuable information about your target audience. I’ll show you how to create a customer avatar, based on which we’ll set up all of your campaigns.</p>    <p>Next comes how to install a conversion tracking pixel and use this powerful feature to measure your results and optimize your campaigns. </p>    <p>Then, you’ll learn how to set up your first Facebook campaign and drive highly targeted traffic to your webinar opt-in page. We’ll also cover four cool hacks to increase the click-through-rate on your ads instantly! </p>    <p>Last but not least, I’ll show you how to deploy retargeting and re-engage with your website visitors to take your campaigns to the next level, and get even more attendees on board for your webinar. </p>    <p>By the time you complete this course, you’ll be able to harness the power of Facebook ads with advanced strategies to get hundreds of prospects on your webinar – even with a limited budget! </p>", 
    "end_date": null, 
    "title": "How To Promote Your Webinar With Facebook Ads", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706276_0644_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-promote-your-webinar-with-facebook-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-25T10:32:36Z"
}