{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Are you looking to build your eCommerce business with Pinterest?</strong>  </p>  <p>  \tIn this course I walk you through live exactly how I promote one of my eCommerce shops using Pinterest.  </p>  <p>  \tI personally was able to build my Pinterest profile to over 8000 followers which allows me to consistently send new traffic to my shop and convert those users into more sales!  </p>  <p>  \t<strong>In this course you will learn:</strong>  </p>  <ul>  \t<li>How to get started with your Pinterest Business account</li>  \t<li>Pinning basics</li>  \t<li>Advanced tactics such as using group boards</li>  \t<li>Adding social sharing and widgets to your store</li>  \t<li>Using Analytics to track your progress</li>  \t<li>Tools I use to automate Pinterest tasks</li>  \t<li>How to hire a virtual assistant for helping you with Pinterest</li>  \t<li>Using advertising through Promoted pins</li>  \t<li>Some additional tips on how I use the Amazon Affiliate program with Pinterest. </li>  </ul><p><strong>Check out these awesome testimonials!</strong></p><p>\"Thank you John Shea! For a five dollar course that I learned more from than any marketing technique I have ever tried or paid for! I have now have 5.4k followers on the Pinterest account I created with your course. I have also started two other accounts over the last month or two and each of those have 1.5k+ and growing. </p><p>Do all that John's says and it's not so hard to build i all up. Do all that John says and you can't miss out. I just logged back in today seeing this bookmarked in my book marks and thought, \"Hey, Iet me go see if there's any more gold here that I didn't get,\" and then I saw the reviews section and thought I am living proof that this works. I do make sales, mostly t-shirts I'm not making full time income - YET - but I am still learning and growing. So five stars and thanks for everything!\" <strong>- Tina</strong></p><p>\"Good information and tactics to get you moving faster with Pinterest for your business if it is online or a shop front. Need to watch things twice sometimes to absorb the information properly so that I can use the tactics more effectively. Well worth taking this course as a stepping stone for creating more business online for myself.\" <strong>- Karla</strong></p><p>\"I really enjoyed this course very much. I liked how the instructor was able to give live real life examples on his own website. Before I took this course on Udemy I took one where the instructor made claims about how he used his methods to make $33,000 in one year but he gave no proof in his course and his course was terrible. It was really bad. John Shea delivers the goods with solid proof. </p><p>I even went to his sites and saw it live for myself. There is no denying it. John's methods work. He was also fun to watch and listen to. I don't share his taste in clothing but that's okay. I wish I was good at writing reviews so I could say something really great. I just wanted to let everyone know that this is a good course that actually teaches you real stuff that you can see works with your own eyes and it was fun to watch. John is a very likable guy and this is a very good course.\" <strong>- Allen</strong></p>", 
    "end_date": null, 
    "title": "How To Use Pinterest To Promote Your eCommerce Store", 
    "price": "20.00", 
    "instructors": "John Shea", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432036_1f87_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-pinterest-to-promote-your-ecommerce-store/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T14:34:31Z"
}