{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t This will teach you how you can make $1 a day from YouTube advertising.  It will teach you step by step from beginning to end everything from research to production to optimization to monetization.  </p>  <p style=\"\">  \t<strong style=\"\">WHAT YOU&rsquo;LL LEARN</strong>  </p>  <ul style=\"\">  \t<li style=\"\">How to Make $1 a Day on YouTube</li>  \t<li style=\"\">How to find a profitable niche</li>  \t<li style=\"\">How to Monetize your YouTube Channel</li>  \t<li style=\"\">How to find out what people are searching for</li>  \t<li style=\"\">How to find the keywords that advertisers pay big money for</li>  \t<li style=\"\">How to optimize your video and channel to rank for those keywords</li>  \t<li style=\"\">How to produce a massive amount of videos in little time</li>  </ul>  <p style=\"\">  \t <strong style=\"\">YOU SHOULD TAKE THIS COURSE IF YOU...</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Want to turn your hobby into a profession.</li>  \t<li style=\"\">Have a hard time getting views, subscribers, traffic and exposure.</li>  \t<li style=\"\">Want to learn how to make professional, high quality videos.</li>  \t<li style=\"\">You&rsquo;re looking to increase your online presence for your Small Business or YouTube Channel</li>  \t<li style=\"\">Want a step by step professional guide to video creation, optimization &amp; monetization.</li>  \t<li style=\"\">Don&rsquo;t know where to start for video marketing</li>  \t<li style=\"\">Want to better understand SEO and Keyword Optimization</li>  \t<li style=\"\">Want step by step instruction of Keyword Research, SEO and Keyword Optimization.</li>  \t<li style=\"\">Want to quit your day job</li>  \t<li style=\"\">Want practical real world tips that work and get results</li>  </ul>  <p style=\"\">  \t <strong style=\"\"> YOU SHOULD NOT TAKE THIS COURSE IF YOU...</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Have never made a video.</li>  \t<li style=\"\">Don&rsquo;t know how to edit video.</li>  \t<li style=\"\">You&rsquo;re not willing to pay for quality instruction that bring results.</li>  \t<li style=\"\">Don&rsquo;t care about ranking high on the first page of the search results</li>  \t<li style=\"\">Don&#039;t have a strong work ethic.</li>  \t<li style=\"\">Not willing to pay for success.</li>  \t<li style=\"\">Don&rsquo;t know what YouTube is.</li>  \t<li style=\"\">You&rsquo;re not willing to invest in yourself or your future.</li>  \t<li style=\"\">You&rsquo;re scared of technology.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">1. DISRUPTION</strong>  </p>  <p style=\"\">  \tThere is a <a href=\"http://videopower.org/the-new-way-of-advertising-how-online-video-is-killing-tv/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">massive disruption</a> going on in the advertising space. People&rsquo;s eyes and ears aren&rsquo;t where they used to be. They&rsquo;re moving from TV to YouTube at a very quick rate. A tipping point in video is coming where the billions of dollars that are so carelessly wasted on TV advertising will flow to YouTube. This is great news for content creators and people who are looking to make some good money from their YouTube channel.  </p>  <p style=\"\">  \t<strong style=\"\">2. RESEARCH</strong>  </p>  <p style=\"\">  \tResearch gives you a firm foundation on which to build your video campaign around. This is one of the most important steps and often most overlooked. It&rsquo;s through keyword research that we know What people are searching for, Which keywords are the most profitable, etc  </p>  <p style=\"\">  \t<strong style=\"\">3. PRODUCTION</strong>  </p>  <p style=\"\">  \tVideo can be very time consuming if you don&rsquo;t know what you&rsquo;re doing. I&rsquo;ve created what I call the &ldquo;Mass Video Creation&rdquo; that allows you to make a ton of videos using the least amount of your time.  </p>  <p style=\"\">  \t<strong style=\"\">4. OPTIMIZATION</strong>  </p>  <p style=\"\">  \tUploading your video to YouTube without optimizing it is like building a swimming pool but not putting water in it. Google only knows what you tell them. There are 100 hours of video uploaded to youtube each minute. How are people going to find your video among the millions of other videos?  </p>  <p style=\"\">  \t<strong style=\"\">5. MONETIZATION</strong>  </p>  <p style=\"\">  \tThis is the point of the whole course. Monetizing your knowledge and work gives you security and freedom to do what you want to do in life. Some of the top YouTubers pull in six figures a year.  </p>  <p style=\"\">  \t <strong style=\"\"> TESTIMONIALS</strong>  </p>  <p style=\"\">  \t  &ldquo;I just want to thank you for everything you showed me on your free video course. It was informative,entertaining and just amazing. I learned things i never knew they existed and also learned that i better start putting out higher quality videos. Thank you once again, I&rsquo;ll be sharing your website with fellow youtubers and other friends.&rdquo;  - Luis  </p>  <p style=\"\">  \t  &ldquo;I really enjoyed and learned alot from your videos. Please don&rsquo;t stop. You have a great sense of humor and your tutorials are non stop informational. Thank you for the course.&rdquo; - Oliver  </p>  <p style=\"\">  \t  &ldquo;I&rsquo;m still learning this stuff, I optimized one video and it shot up 200 views in a few days. This is not a huge amount but it is huge for me considering most videos that start up get no more than 2 views in a year... i average a good 100 in a day which is a great starting point. Great work, thank you.&rdquo;  </p>  <p style=\"\">  \t  Might be a scam, but it proved me wrong. It is just amazing  </p>", 
    "end_date": null, 
    "title": "How To Make A Dollar A Day on YouTube", 
    "price": "20.00", 
    "instructors": "Jake Larsen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50680_cac7_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-dollar-a-day-on-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-21T00:05:14Z"
}