{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t <em style=\"\"><strong style=\"\">\"Worth every minute i spent watching! </strong></em><em style=\"\">This course was very informative. Full of great information that was simply displayed and explained. Enjoyed that it was more in-depth than most 'How To's'.\"</em>  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">\"WOW. This was a real gem of information.</strong> I was very impressed with the way this tutorial explained the process from start to finish in a clear and concise manner.\"</em>  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">\"This is an excellent course</strong> giving really clear instruction as to how to use instagram and why you should be doing so. Have learned so much in such a short time. Thanks Andrew for this excellent course.\"</em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">\"This was very well presented - I had to take many notes. </strong>There are a wealth of resources.\"</em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">\"Great how-to training - </strong>I was very impressed by the detail of this course...\"</em>  </p>  <p style=\"\">  \t <strong style=\"\">And I could go on – but these are all real student reviews and you can read them yourself at the top of this page.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Why should you enroll?</strong>  </p>  <p style=\"\">  \t            This course provides detailed knowledge about how individuals and businesses of any size and in any sector can use Instagram, as part of a successful marketing strategy.  </p>  <p style=\"\">  \t               Through narrated video, images, step-by-step instructions and dozens of real-life examples, you will learn how to use and master the Instagram mobile app, create content that your audience will love, attract and maintain a strong Instagram following, and how to track your progress.  </p>  <p style=\"\">  \t               If you would like to <strong style=\"\">harness the power of Instagram and its hundreds of millions of users to grow your audience, engage with customers, and encourage an increase in sales,</strong> this is the course for you.  </p>", 
    "end_date": null, 
    "title": "How to Use Instagram for Business", 
    "price": "20.00", 
    "instructors": "Andrew Macarthy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101588_a32d_13.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-instagram-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-04T20:25:24Z"
}