{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you've ever looked at your competitors and become jealous of the number of \"likes\" on their Facebook page, this course is for you.</p>\n\n\n\n<p>You'll learn exactly what it takes to build a large community of followers with a brand-new and sneaky approach.\n\n  </p>\n\n\n\n<p>With a proven step-by-step formula that's easy to implement, you'll set up an automated system that will effectively get people interested in your business.\n\n  </p>\n\n\n\n<p>After all, the more followers you have on social media, the more traffic you can get to your site, and the more sales you can make.\n\n  </p>\n\n\n\n<p><strong>Build Your Facebook Fanbase to Drive More Traffic to Your Site &amp; Boost Profits</strong>\n\n  </p>\n\n\n\n<ul><li>Why you can’t afford the “traditional” way of getting fans</li><li>Proven &amp; tested system to build a raving fanbase with an automated script</li><li>Step-by-step formula to get thousands of highly targeted fans</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br>Contents and Overview</strong>\n\n  </p>\n\n\n\n<p>This course begins with an introduction into why the old, traditional way of building your fanbase is dead and how this system works.</p><p>Next, we’ll cover how to install the script on Google Chrome, how to run it and why you should harness the power of a little known feature called “Boost Post” to give your fan page more exposure.</p><p>Last but not least, you’ll discover two strategies to double the growth of the fanbase along with different ways to use this script to grow your fanpage even faster.</p><p>By the time you complete this training, you have mastered the probably most powerful, cheapest and fastest method to get thousands of loyal Facebook fans with minimal effort.</p>", 
    "end_date": null, 
    "title": "How To Get Your First 10,000 Facebook Fans In 2016", 
    "price": 0, 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/869398_ba00_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-your-first-10000-facebook-fans-in-2016/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-05T14:07:53Z"
}