{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will reveal how to grow your local business fast &amp; cost-effective with proven &amp; tested Facebook marketing strategies.</p>    <p>You’ll learn how to create a professional Facebook fan page, grow your fan base and harness the power of local awareness ads to sell more products &amp; services instantly!</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Reap the Benefits Of Growing Your Local Business With Facebook Marketing </strong></p>    <ul><li>Quick &amp; easy way to create a professional Facebook fan page in less than 10 minutes</li><li>How to build your fan base for 2 cents per like </li><li>Best practices to incorporate social media into your offline communication channels </li><li>Step-by-step instructions to grow your business with local awareness ads to reach people nearby your local store </li></ul><p><br><strong>Contents and Overview</strong></p>    <p>First, I will walk you through all the steps to set up a professionally designed fan page. You’ll discover my favorite design resources and a 100% free tool to find high-quality fan page content in your niche market that you can share with your audience to attract more foot traffic instantly! </p>    <p>Next, you’ll discover one easy to implement strategy to build your fan base for 2 cents per page like. With my strategy, you can grow your audience like a professional Facebook marketing agency. </p>    <p>After we covered how to incorporate Facebook into your offline communication channels, you’ll learn about harnessing the power of local awareness ads. </p>    <p>Once we covered the basic steps of creating your first local awareness ad to reach people nearby your business, we’ll move on to four proven &amp; tested strategies to grow your local business with paid Facebook ads. </p>    By the time you complete this course, you’ll be ready to grow your business with paid Facebook ads and increase your revenue instantly!", 
    "end_date": null, 
    "title": "How To Grow Your Local Business With Facebook", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684202_d422_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-grow-your-local-business-with-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T18:08:23Z"
}