{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t       Fan Pages are everywhere. Each one of us has at least 50 pages, which display content on our newsfeed each time we check. So if you:  </p>  <ul style=\"\">  \t<li>have a business</li>  \t<li>own a startup</li>  \t<li>share a specific interest with a group of people</li>  \t<li>have some sort of drive/passion</li>  \t<li>or simply, want to build a community...</li>  </ul>  <p>  \t       then, most likely you already own a successful and engaging Fan Page, don&#039;t you?  </p>  <p>  \t       Creating a Fan Page from scratch is not simple. That&#039;s why there are community managers being hired by companies and paid a lot of money to do it. But, the truth is, it&#039;s much easier than you think.  </p>  <p>  \t       My name is James. I own a Fan Page called &quot;We Love Pitbulls&quot;.  </p>  <p>  \t       I started out just like you, from scratch. I only knew I loved Pitbulls and couldn&#039;t have enough of browsing and storing pictures of them. Until one day I decided to create a page about it.  </p>  <p>  \t       I&#039;m willing to show you exactly how i built my &quot;We Love Pitbulls&quot; page (seach it on facebook and it should appear first)  </p>  <p>  \t       This course covers everything you need to know, from choosing your niche, to analyzing demographics... from selecting a cover photo to automating posts on a daily schedule.  </p>  <p>  \t       Everything you need to know to start or to maximize the exposure of your Page is here.  </p>  <p>  \t<strong style=\"\"> I suggest, if you haven&#039;t already to check my promo video. I uploaded about 5 minutes of extracts from my whole course, for you to check out if this course fits your profile. </strong>  </p>  <p>  \t       Everything on this course is based on Action. You&#039;ll see me doing it. From the moment I clicked &quot;Create my Page&quot; to my strategies to get more Likes.  </p>  <p>  \t       So if you <em style=\"\">Like</em> the idea, go ahead and take this course!  </p>", 
    "end_date": null, 
    "title": "How to Create a Facebook Page and Crowd it With Likes", 
    "price": "20.00", 
    "instructors": "We Teach Marketing", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382992_09ab.jpg", 
    "course_url": "https://www.udemy.com/fan-pages/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T12:35:34Z"
}