{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t   In this course, I will tell you what strategies we can use to achieve the desired popularity on Twitter, which is one of the leading social networks. Through a series of video tutorials, I will be showing you how to properly set up your Twitter account with little effort and above all for free, and then start getting your much-needed first followers, through whom subsequently you will be able to increase your popularity in this social network step by step.  </p>  <p style=\"\">  \t   Then we&#039;ll examine a variety of services, which can help you automatically find targeted followers, who will read and respond to messages posted by you.  </p>  <p style=\"\">  \t   I&#039;ll show you how to connect your account with other social networks, such as Facebook. You&#039;ll also see where you can register your account in order to be more visible to other  followers on Twitter, how to find influential Twitter users and what strategy you can use to make them quote, retweet or just follow you.  </p>  <p style=\"\">  \t   I am delighted that we can go through this course together and I&#039;m sure that your Twitter account will enjoy a growing popularity, which you will know how to boost and have the maximum benefit from it.  </p>  <p style=\"\">  \t   If you&#039;re ready, let&#039;s get started with the first lessons.  </p>", 
    "end_date": null, 
    "title": "How to get more followers on Twitter", 
    "price": "20.00", 
    "instructors": "Ilian Petrov", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220848_3647_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-more-followers-on-twitter/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T19:17:37Z"
}