{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will reveal a quick &amp; easy strategy to create and promote an event on Facebook like a professional advertising agency.</p>    <p>You’ll discover step-by-step instructions to set up an event in less than 5 minutes and raise the attendance with cost-effective Facebook ad campaigns.  </p>    <p><strong>Learn How to Take the Best Seat in house &amp; Reap the Benefits Of Giving Your Facebook Event More Exposure <u>Instantly</u>!</strong></p>    <ul><li>Complete guide to creating an event on Facebook </li><li>Three amazing resources to get a stunning cover photo designed </li><li>How to warm up your audience with high-quality content </li><li>Simple way to create Facebook ads and raise the attendance at your event </li><li>Best practices to create cost-effective campaigns with a limited budget </li><li>… and much more!</li></ul><p><br><strong>Contents and Overview</strong></p>    <p>This course will walk you through all the steps you need to create and promote an event on Facebook.</p>    <p>First, you’ll learn about different event types and how to set up an event on Facebook in less than 5 minutes.</p>    <p>Next comes how to create an event cover photo. You’ll discover three amazing resources to get a stunning cover photo designed for no more than $5.</p>    <p>Then, I’ll share with you a sneaky, little known trick to share your Facebook event on social media to get more exposure instantly! You’ll also learn how to warm up your audience with pictures &amp; videos from previous events. </p>    <p>Last but not least, I’ll walk you through the process of spreading the word about your event with paid Facebook ads. You’ll discover a simple way to create converting ads and raise the attendance at your event like a professional Facebook marketing agency.</p>    By the time you complete the course, you’ll be ready to set up an amazing event and raise the attendance instantly with strategies like paid Facebook ads.", 
    "end_date": null, 
    "title": "How To Promote Your Event On Facebook", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686382_2872_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-promote-your-event-on-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-01T21:07:46Z"
}