{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>With over 1 billion people on social media, you know it is one of the most powerful platforms in the world. It has transformed many businesses and provided a type of social interaction that we have never had before. Social media is a platform that when used properly can give you a massive audience.</p><p>So how do you get that massive audience? The answer is with an effective social media strategy. Crafting an effective social media strategy lets you know how you can achieve rapid social media growth in a short period of time. How many followers can you gain from implementing an effective social media strategy? </p><p><strong>I have used the methods I discuss in this training course to grow a social media audience of over 300,000 followers</strong>. If you want results from your social media efforts, then get the advice from a social media rockstar.</p><p>I have seen many opportunities, but none of them are as powerful as social media. If you choose to ignore social media, you won't gain any social proof or accumulate a massive audience that you can communicate with at any time.</p><p>But worse of all, you are losing to the competition. The people crushing it in your competition are using social media to gain credibility for themselves and their products. They are getting their followers to give awesome testimonials and promote their content. Social media has a strong grip-hold over us. It has impacted the way your customers communicate with one another and buy products.</p><p>It is increasingly important to not just use social media for your business, but to grow your audience on a massive scale. If you ignore social media for your business, then the competition is leaving you behind. On the other hand, taking social media seriously would give you credibility and social proof that could potentially outshine even your top competitors. This course will help you to gain that advantage.</p><p>If you are ready to take your social media audience growth to the next level, then click \"Take This Course\" now.</p>", 
    "end_date": null, 
    "title": "How To Create An Effective Social Media Strategy", 
    "price": "20.00", 
    "instructors": "Marc Guberti", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669922_9be7_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-effective-social-media-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T21:27:23Z"
}