{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Ever wondered how a businesses can have thousands of followers and be making sales through a simple Instagram account? You’re about to find out how you can do that too.</strong></p>\n\n\n\n<p>Ready to make your business a success on Instagram? This detailed and interactive course shows you how. Whether you're a large company, a small startup, a personal blogger or social media marketer, we've designed a course that will transform your results. </p>\n\n\n\n\n\n\n\n\n\n<p>With over 300 million active monthly users and engagement with brands higher than Facebook and Twitter, mastering Instagram for your business has never been more important. You might be wondering:\n\n  </p>\n\n\n\n\n\n\n\n\n\n<ul><li>How do I generate more followers and keep them?</li><li>How do I know if I have the right content to post?</li><li>How do I know which marketing strategies are most affective?</li><li>How do I turn interactions into sales for my business?</li><li>How do I manage it in a way that doesn’t take too much of my time, but is effective?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>We have the solutions and practical tips to all of the above, ready to be applied to your cause. Across the main 8 sections, we will cover:\n\n  </p>\n\n\n\n\n\n\n\n\n\n<ol><li>Welcome and goal-setting</li><li>Creating your business profile on Instagram- getting your message and purpose clear</li><li>Getting out there- how to create great content from quality videos to eye-catching photos</li><li>Instagram Essentials – covering all bases, getting you familiar with everything from hashtags to checking into a location and direct messaging</li><li>Instagram Marketing Strategy- Top Tips; based on statistical data that we will share with you, you can save so much time by discovering simple techniques that will ensure your posts reach your desired clients and generate sales</li><li>A unique insight into successful users– we interviewed 3 very different entrepreneurs</li><li>How to manage your account more easily- we recommend the top apps and tips you’ll need</li><li>Final overview and revisiting course goals!</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Across 37 curriculum items, professionally filmed and edited, the course takes you through everything with detail including practical tips, demonstration, relevant tools, quiz and tasks- we want to give you your money worth.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Delivered by renowned skills trainer and social entrepreneur Melody Hossaini, we will work together step-by-step to create a powerful platform for your business, putting you ahead of the competition with minimal effort. Let’s go!</p>", 
    "end_date": null, 
    "title": "How to Grow Your Business With Instagram", 
    "price": "45.00", 
    "instructors": "Founder & CEO Melody Hossaini", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708390_4eed_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-grow-your-business-with-instagram/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T09:44:26Z"
}