{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The Power of Live streaming videos on Facebook, learn how to develop your Facebook Live Strategy and how to be successful with Live TV streaming online with Facebook.</p>\n\n<p>Facebook Live was introduced in August 2015, there are other live streaming platforms like Periscope and Blab, and Facebook live has introduced the same feature. Video is the number one source of internet traffic and will continue to grow. Live streaming on Facebook has created the opportunity for Business owners to get their posts Seen Again, we all know that it has been a struggle to been seen, without spending advertising dollars that is. Now we have the opportunity to be rewarded by Facebook for using this new feature. It also allows your potential and current clients to interact with you, to engage and to see what it is that you do. <br></p>\n\n<p>Some of the opportunities for live, are to create your own TV Show, Answer Questions, become the expert in your field.</p>\n\n<p>This is Course is all about using Facebook Live to enhance your business online:</p>\n\n<ul><li>Using Facebook live to get your business to the top of the news feed</li><li>How to do a Facebook Audit</li><li>Claim your space and expertise in Facebook</li><li>Edit videos and be in the top of the news feed</li><li>plus so much more......</li></ul>\n\n<p>Who is this for?</p>\n\n<ul><li>Small to medium business owners</li><li>Business owners that realise the potential of Facebook </li><li>Personal Trainers</li><li>Work from home mums.</li></ul><p>Face live will change your business, look at this course to enhance your overall position on your Facebook feeds, generate leads and have your own TV Show.</p><p>Look forward to seeing you on Live :)</p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "How to Use Facebook Live for Business", 
    "price": "20.00", 
    "instructors": "Leanne Peard", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823352_744f_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-facebook-live-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-16T02:48:16Z"
}