{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><br style=\"\"></p>  <p style=\"\">  \t    With this course you&#039;ll learn how to create a Facebook Page for your business. If you&#039;re brand new to Facebook and need to know how to use and create a Facebook Page, then this easy to follow course is for you.  </p>  <p style=\"\">  \t                            We will start at the beginning by creating your &quot;Resource Package&quot; then progressively move to building your Facebook Page, then building and engaging your community, then promoting your Facebook Page, then understanding and adjusting your Page settings, and finally understanding Facebook Insights.  </p>  <p style=\"\">  \t              I have also included additional course materials to JUMP-START your Facebook Marketing after creating your Page where you&#039;ll learn:  </p>  <ul style=\"\">  \t<li style=\"\">My <strong style=\"\">3 CORE RULES</strong> to Facebook Marketing</li>  \t<li style=\"\">My <strong style=\"\">5 PROVEN STRATEGIES</strong> to GROW your Facebook Fans</li>  \t<li style=\"\"><strong style=\"\">WHAT and WHEN to post</strong> on your Page for better Engagement</li>  \t<li style=\"\">PLUS a <strong style=\"\">SOCIAL MEDIA CONTENT CALENDAR</strong> to keep you on track with your posts</li>  </ul>  <p style=\"\">  \t                            By the end of this course, you will learn how Facebook Pages work, how to create a well thought out Facebook Business Page from scratch, and strategies you can use to better market you business on Facebook.  </p>  <p style=\"\">  \t<strong style=\"\">To keep this course as fresh as possible I&#039;d love to hear from you, so please leave me a message with feedback, comments, or topics you&#039;d like me to cover. I will do my best to respond in a timely manner and try to keep the materials as fresh and updated as possible.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Happy Learning!</strong>  </p>", 
    "end_date": null, 
    "title": "How to BUILD and MARKET your Facebook Business Page", 
    "price": "20.00", 
    "instructors": "Jonathan De Leon", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326620_3580_6.jpg", 
    "course_url": "https://www.udemy.com/facebook-for-business2014/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T19:51:16Z"
}