{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Social Media Best Practice: Tools To Design And Brand Your Social Media Channels Like An Expert</strong></p>    <p><em>Course Last Reviewed January 2016</em></p>  <p><strong>Do you want to be able to design your social media channels like an expert?</strong></p>  <p>Do your social media channels need a design overhaul? Are you about to set up social media channels and want to make sure they look professional?</p>  <p>This course runs through everything you need to know when working on the branding and design of your Facebook, Twitter, Pinterest or Instagram channels.</p>  <p>The course covers how to pick a username, what to consider and what to include when you’re creating a profile picture and cover image, and what the essentials are when creating your social media description or bio.</p>    <p><strong>Why take this course?</strong></p>  <p>Do you want to make your social media channels look like they've been professionally designed?</p>  <p>Would you like to make it easier for your customers to find your social media channels?</p>  <p>Do you want to make your social media channels more effective at coming up in search?</p>  <p>Are you worried you’re losing customers because your social media channels don’t look well-designed?</p>  <p>Would you like to know the free tools that can help design your social media channels?</p>    <p><strong>In this course:</strong></p>  <p>In this course, you will learn to optimise your social media channels, looking at the usernames and descriptions in terms of audiences, SEO and accessibility. You will look at your images including profile pictures and cover images, including how to leverage them for brand exposure and as an additional marketing tool.</p>    <p><strong>About your course instructor:</strong></p>  <p>Rachel Beaney is a social media specialist, having worked for nearly a decade in the digital media space. She’s worked on social media campaigns for big names like Microsoft, Aussie Home Loans, Network Ten, MasterChef Australia and more.</p>  <p>Rachel is passionate about teaching and helping people get the most out of digital and social media for their businesses.</p><p><strong>Student reviews of this course:</strong></p><p><em>“Excellent course</em></p><p><em>Rachel provides great tips on how to optimize your social media presence and brand. I love that she provides visual and audio lectures, since everyone learns differently. She also provides downloadable sheets to help you in the process.</em></p><p><em>One of my favorite parts of her lectures were how to locate free tools when tweaking the visual aspects of your social media accounts. I highly recommend this course.”</em></p><p>- by Margaret Lovell, with a five-star review.</p>    <p><strong>Who is this course for?</strong></p>  <p>Are you a small business owner looking for tips on how to make your social media channels pop without spending a lot of cash?</p>  <p>Are you in marketing manager who runs a brand social media channel that needs an overhaul?</p>  <p>Are you a social media manager juggling too many accounts and you’re after some ideas to help see your channels in a fresh way?</p>    <p><strong>What the course is covers:</strong></p>  <p>• How to select a username that is findable by both customers and SEO across Facebook, Twitter, Pinterest and Instagram.</p>  <p>• You will learn what to consider when designing your profile picture across all key social networks</p>  <p>• You will learn what to include in your Cover image or background image and how often to update it.</p>  <p>• You will learn how to use cover images for promotions and additional information about your business.</p>  <p>• You will find out about free tools and resources to help you design your social media images.</p>  <p>• You will learn about the little-known features to switch on Facebook to give your customers more opportunities to get in touch.</p><p><strong>Take the course:</strong><br></p>  <p>Before we jump into it, this course does not include social media day-to-day management tips or social media strategy. This is looking exclusively at how to make your social media channels look their best.</p>  <p>And, of course, if you don't like the course for any reason, you can request a full refund within the first 30 days, no questions asked.</p>    <p><strong>What are the requirements?</strong></p>  <p>• You will need a computer or smartphone</p>  <p>• You need a basic understanding of social media channels</p>  <p>• You will either already have business social media channels set up, or are thinking of launching some.</p>  <p>• You’re ready to breathe new life into your social media channels.</p>    <p><strong>What are you going to get from this course?</strong></p>  <p>• 2 hours of lectures and 21 courses</p>  <p>• Understand how to select usernames keeping search in mind</p>  <p>• Understand how to create business profile pictures that are relevant to your business, clear and captivating.</p>  <p>• Understand how to design profile cover images and see how they can be used as a marketing tool</p>  <p>• Learn where to go for free tools and resources to design your social media cover images without knowing graphic design</p>  <p>• Understand how to write your description and bio areas to ensure it is relevant to multiple audiences</p>  <p>• Learn about additional tools that can be leveraged on social media channels like Facebook to give your businesses more opportunities for a sale.</p>  <p>• See case studies in how other small businesses brand their Facebook, Twitter, Instagram and Pinterest account for their social media for marketing.</p>    <p><strong>Who is the target audience?</strong></p>  <p>• Do you revise your social media branding for your small business so you can increase your social media marketing?</p>  <p>• Do you need to increase your personal branding using social media?</p>  <p>• Do you have a small business and you need to refresh your Facebook, Twitter, Instagram or Pinterest designs?</p>", 
    "end_date": null, 
    "title": "How To Brand Your Social Media Channels Like An Expert", 
    "price": "20.00", 
    "instructors": "Rachel Beaney", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677530_1dce_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-brand-your-social-media-channels-like-an-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-22T20:34:36Z"
}