{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Freelance writing has exploded as an industry. There are now thousands of articles and blog posts written online each day. This is in addition to the traditional print magazines and journals.</p><p>There is now so much knowledge and information that it becomes difficult to consume. Yet the desire for information still fuels this movement to produce content for people to digest.</p><p>As there has been more content produced, there are now more individuals to produce it. Many aspects of producing content has become competitive. Freelance writing is no exception.</p><p>One site that may have been overlooked for opportunities is Linkedin. The largest professional networking site on the web is often thought of as the site where job seekers and recruiters hang out. It is also where people connect for business networking and opportunities.</p><p>Both are right which is why if you are a freelance writer you need to be on Linkedin. You are looking for gigs you can apply for. You are also in a sense a business owner trying to expand your horizons.</p><p>This course can show you how to use Linkedin for more prospects.</p><p>The first section looks at the importance of networking as establishing yourself as a freelancer or business owner.</p><p>The second section reviews how to develop a resume as a freelance writer. Why a resume you may ask. Linkedin is a site for professionals and the resume is recognized as a tool for marketing yourself and your skills to others. Many may request to see yours. Here you will learn how to develop one.</p><p>The third section details aspects of the site and how to use its features for your writing career. Topics include developing your profile and making connections.</p><p>If you are trying to find ways to expand your writing career, Linkedin could be your answer. This course will show you how. </p>", 
    "end_date": null, 
    "title": "How To Land Freelance Writing Clients With Linkedin", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550308_7961.jpg", 
    "course_url": "https://www.udemy.com/how-to-land-freelance-writing-clients-with-linkedin/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-09T18:00:21Z"
}