{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    Are you new to Twitter?  </p>  <p style=\"\">  \t    Feeling overwhelmed? confused? or just wondering how to get more followers?  </p>  <p style=\"\">  \t    Feel like you are spending too much time on twitter with no results to show for it?  </p>  <p style=\"\">  \t    Are you not able to grow a targeted following no matter what you try?  </p>  <h4 style=\"\">I Know Because I Have Been There Too</h4>  <p style=\"\">  \t    My name is Bryan Fleming. I have been on Twitter since 2008. I used to waste hours on Twitter trying to grow a loyal following. Almost everything I tried just did not work. It felt like I was getting nowhere fast. There was too much noise. How could my message and tweets stand out? How did people seem to easily get 1,000 or 10,000 or 100,000 followers on Twitter?  </p>  <p style=\"\">  \t    It wasn&#039;t until I finally stumbled onto a few simple tools that a light bulb went off. I took a few things that did work on Twitter and took away the rest. It wasn&#039;t until I started doing the right things consistently that I started to attract Twitter followers with almost no work at all. I put these steps in a simple checklist. Now I can grow any twitter account to over 5,000 target twitter followers fairly quickly. You can too.  </p>  <h4 style=\"\">Stop wasting Time on Twitter</h4>  <p style=\"\">  \t    If you are not getting the results you want from Twitter then it&#039;s because you are spending your time doing the wrong things. Stop wasting time on things that just don&#039;t matter (and most things just don&#039;t matter). They won&#039;t build up your following.  </p>  <p style=\"\">  \t    I will show you my buildingsocial twitter account and exactly how I was able to get over 5,000 targeted twitter followers to it. You can do the same for your Twitter account or ones for your clients. My simple 3 step system works for any Twitter account. Even if you are just getting started.  </p>  <h4 style=\"\">Imagine</h4>  <ul style=\"\">  \t<li>Watching your Twitter account gain new followers every day.</li>  \t<li>Getting traffic to your website when you need it - Just send a Tweet.</li>  \t<li>Watching your Tweets get shared among your new followers.</li>  \t<li>Becoming popular by having such a large Twitter following.</li>  \t<li>No Longer feeling overwhelmed or confused by Twitter.</li>  </ul>  <h4 style=\"\">Will It Really Work For You?</h4>  <p style=\"\">  \t    You are probably thinking you don&#039;t have enough time to build a large Twitter following. You don&#039;t. We are all too busy. That&#039;s why my system only requires you to have 5 minutes per day. Almost everything is automated with a few simple tools. You just need to do 1 simple 5-minute task every day.  </p>  <p style=\"\">  \t    Maybe you are thinking it won&#039;t work for you. Well I can tell you that once you see how my system works you will agree that it will work for anyone. In any market or niche. It doesn&#039;t even matter if you don&#039;t know a single thing about Twitter. Just follow my proven steps. Watch your Twitter account (Yes even YOUR Twitter account) gain new followers ever day. Almost like magic.  </p>  <h4 style=\"\">How to Attract Your First 5,000 Twitter Followers Reveals</h4>  <ul style=\"\">  \t<li>Exactly what I did to build up my buildingsocial Twitter account.</li>  \t<li>I show you the exact tools I use and how to set them up.</li>  \t<li>Get my simple weekly schedule for maintaining your Twitter account(s).</li>  \t<li>You will get only the steps that produce you real results with Twitter.</li>  \t<li>I removed everything that doesn&#039;t matter. You will not waste any time.</li>  \t<li>You will get an easy to follow system. No fluff.</li>  \t<li>Start watching your Twitter following climb day after day.</li>  \t<li>All included in an easy to course. You can go through it in 1 hour.</li>  </ul>  <h4 style=\"\">Don&#039;t Be Fooled</h4>  <p style=\"\">  \t    Don&#039;t let the size of this course fool you. I have invested over 100 hours of my own time and $6,327 of my own money and resources compiling and perfecting this information.  </p>  <p style=\"\">  \t    This course contains everything you need to grow your own Twitter following to 5,000 or more followers. Nothing more.  </p>  <h4 style=\"\">Now you have a choice to make.</h4>  <p style=\"\">  \t    You can spend over 7 years in the trenches like I have, testing every piece of free information and every so-called Twitter trick or hack...  </p>  <p style=\"\">  \t    or...  </p>  <p style=\"\">  \t    You can follow my how to attract your first 5,000 followers course that simplifies everything I have learned about growing your twitter following quickly without spending any time. A few days from now you could still be trying to piece together free information, hoping that it will work.  </p>  <p style=\"\">  \t    or...  </p>  <p style=\"\">  \t    You could be well on your way to watching your Twitter following grow each and every day. The only thing between you and success is a simple short course. Get started growing your Twitter following now.  </p>", 
    "end_date": null, 
    "title": "How to attract your first 5,000 Tweeting Fans", 
    "price": "20.00", 
    "instructors": "Bryan Fleming", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433930_3916_2.jpg", 
    "course_url": "https://www.udemy.com/attract-your-first-5000-twitter-followers/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T10:39:36Z"
}