{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>***UPDATED APRIL 2016***</em></strong></p>\n\n<p><strong>EXPLODE Your Profits With FB Using The Same SECRETS Top Digital Marketing Agencies Charge $1000's For! </strong></p>\n\n\n\n\n\n<p>Are you a business owner <em>struggling</em> to generate leads (and exposure) for your online or offline business?</p>\n\n\n\n\n\n<p>Are you going broke throwing away <em>countless</em> dollars on ads with embarrassingly low conversion rates?</p>\n\n\n\n\n\n<p>Tired of having that gut-feeling like you're “missing something\" and want to <strong>FINALLY</strong> learn a <strong>PROVEN</strong> (step-by-step) system for marketing on FB that actually <strong>WORKS</strong>!?!</p>\n\n\n\n\n\n<p> Does any of the above sound like you? If so, you're not alone!</p>\n\n\n\n\n\n<p><em><strong>Great Facebook Marketing Course</strong></em><strong> - </strong>Dan Englander<br></p>\n\n\n\n\n\n<p><em>This course will teach you how to generate leads for your online or offline business - heaps of helpful tips that would quickly and easily improve fan numbers and engagement in your page. Highly recommended.</em><em></em><br></p>\n\n\n\n\n\n<p>In fact, <em>most marketers FAIL</em> at social media simply because they don't have the luxury of over-the-shoulder training from someone who's been in the trenches. This course was created to solve that problem.</p>\n\n\n\n\n\n<p>However, we must warn you...</p>\n\n\n\n\n\n<p><strong>This is NOT your average Facebook marketing course.</strong></p>\n\n\n\n\n\n<p>We are about to unleash some very stealthy tricks and hacks (known by very few marketers) so you can finally <strong>DOMINATE</strong> the competition and get the edge you need to take your Facebook marketing to the next level and beyond.</p>\n\n\n\n\n\n<p><strong>HERE'S IS JUST A GLIMPSE AT WHAT YOU'LL LEARN: </strong></p>\n\n\n\n\n\n<ul><li>A safe way around the “20% rule\" when it comes to text in the artwork of an ad. You need more words to get your message across and we'll finally show you how!</li></ul>\n\n\n\n\n\n<ul><li>How to quickly and easily improve fan numbers and engagement by doing just one thing.</li></ul>\n\n\n\n\n\n<ul><li>An unknown FB “hack\" that allows you to Increase your ad spending threshold to several thousand dollars!</li></ul>\n\n\n\n\n\n<ul><li>We even cover crucial topics such as pixel retargeting, conversion tracking, analyzing and scaling, curating viral content, affiliate marketing strategies and so much more!</li></ul>\n\n\n\n\n\n<p> <strong>AS THE COURSE GROWS IN CONTENT (UPLOADED REGULARLY) THE COST WILL INCREASE AS WELL.</strong></p>", 
    "end_date": null, 
    "title": "How To Be A Facebook Marketing Master", 
    "price": "30.00", 
    "instructors": "Brian Gray, Shane Farrell, Mark Tandan", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533534_21b5_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-facebook-marketing-mastery-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-21T15:53:39Z"
}