{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      In this course I will show simple strategies that you can use to build your community online. I have used these exact strategies to grow my online community to over 50,000 followers online in a few short years.  Learn EXACTLY how to maximize your time and build a community online with proven strategies, real life examples and an Instructor that has proven results.  </p>  <p>  \t<em style=\"\">Do you know where your client should be online?</em>  </p>  <p>  \t<em style=\"\">Do you have a presence on the TOP 5 websites and does that presence produce a profit? </em>Learn where you MUST be online and focus on the right efforts that will produce RESULTS!  </p>  <p>  \t      This is a beginner course on building a brand online in less than thirty minutes. The course begins with a lecture that identifies the top 5 places you must be online to build your business, brand and influence.  </p>  <p>  \t      The next part focuses on the platforms specifically including the same exact sites I use to build my brand in 30 minutes or less.  It&#039;s simple and there are examples included.  </p>  <p>  \t      I created this course because I see entrepreneurs online struggling to build a community and convert their passion into profits. I also see entrepreneurs experiencing burnout. Do you need a social media break? How will you know? When social media becomes a chore. When you no longer want to update a post, upload a picture or &quot;check-in&quot; with your community. Social Media is WORK so be sure that you take time out daily to recharge.  </p>  <p>  \t      In this course I provide simple strategies that I use and have used over the years to grow my online community to over 50,000 followers online.  </p>  <p>  \t      Now before you start taking this course, Convince Yourself. I don&#039;t just teach social media, I am actively involved in building my platforms too!  What I teach - works!  </p>", 
    "end_date": null, 
    "title": "How to Build a Brand Online and Build Authority", 
    "price": "25.00", 
    "instructors": "Montina Young Portis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242736_76b7_5.jpg", 
    "course_url": "https://www.udemy.com/brand-building/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-13T13:09:47Z"
}