{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t       Did you know that in 2012:  </p>  <li style=\"\">93% of recruiters used LinkedIn to recruit for permanent and temporary jobs</li>  <li style=\"\">77% of all job openings were posted on LinkedIn and 48% were ONLY posted there</li>  <br style=\"\">      This means that if you are looking for work, then you need to leverage the power of LinkedIn.  But, like any computer application, using it well is part art, part science.  This free course will show you 5 simple things that will instantly improve your LinkedIn profile.  <ol style=\"\">  \t<li style=\"\">Developing a connection strategy can help you ensure that your profile gets seen at the top of search results.</li>  \t<li style=\"\">Avoiding the common mistakes people make, namely spelling and grammar mistakes, and incomplete profiles, will instantly improve your profile!</li>  \t<li style=\"\">Choosing a professional image will get you noticed for the right reasons, not the wrong ones.</li>  \t<li style=\"\">Create a personalised URL that you can use on your business cards and email.  You could even use it to create a QR code.  The latest thing on networking cards!</li>  \t<li style=\"\">Make sure that once you have connected with someone, they can contact you outside of LinkedIn</li>  </ol>  <p style=\"\">  \t      Those are my top 5 changes.  Why not try them and see if they make a difference to your profile and networking efforts?  </p>", 
    "end_date": null, 
    "title": "Improve your LinkedIn profile in 5 easy steps", 
    "price": "20.00", 
    "instructors": "Karen Brown", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145016_77eb_6.jpg", 
    "course_url": "https://www.udemy.com/5-simple-things-you-can-do-to-improve-your-linkedin-profile/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-10T08:53:52Z"
}