{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Este curso te presenta una serie de capsulas informativas en las cuales aprenderás a identificar los mejores tipos de publicaciones para tus contenidos.</p>\n\n<p>Aprenderás qué tipo de publicación te conviene más para atraer seguidores, lograr más me gusta, comentarios, compartir o etiquetado.</p>\n\n<p>Son capsulas cortas con consejos concretos, algunos de hasta 30 segundos de duración en los que podrás identificar los mejores trucos para mejorar tu alcance mientras incrementas la interacción de tus fans o seguidores.</p>\n\n<p>Cada capsula informativa contiene un mensaje concreto de lo que puedes lograr con ese truco o recomendación, lo que lo hace fácil de digerir y consultar para referencias posteriores.</p>\n\n<p>Seguir estas recomendaciones te ayudará a mejorar tu alcance y por ende la calidad de tus seguidores o fans.</p><p>Muchas personas piensan que la duración del curso equivale a su calidad, déjame demostrarte que en tan solo unos minutos obtendrás una gran cantidad de conocimientos que te ayudarán a mejorar cada día, lo he diseñado de tal manera que todo se aprenda fácil y rápido, y no sólo eso, al mejor precio.</p><p>Pagarás este curso una sola vez y lo tendrás disponible de por vida (incluye el certificado de finalización) y al mejor precio, otras plataformas te cobran mensualidades pero eso no pasará aquí, podrás revisar los videos desde tu computadora, smartphone o tablet (que cumplan con los requisitos técnicos necesarios) y a parte te ofrecemos la garantía de satisfacción donde si no quedas satisfecho con el curso te devolveremos tu dinero.</p><p>El curso recibirá actualizaciones cada cierto tiempo, así que anímate a comprarlo ahora mismo.</p>", 
    "end_date": null, 
    "title": "Incrementa la interacción de tus seguidores en Facebook", 
    "price": "20.00", 
    "instructors": "Desarrollador Fredy Balaguera", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589120_5b32.jpg", 
    "course_url": "https://www.udemy.com/incrementa-la-interaccion-de-tus-seguidores-en-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T04:55:35Z"
}