{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Lerne, wie du mit dem kostenlosen Online-Tool Canva individuelle Grafiken für deine Website, deine Social Media-Kanäle und deinen Blog erstellst – und das ruck zuck, ganz ohne Grafikdesign-Kenntnisse. <br></p><p>Das sind deine Vorteile:</p><p>✔ Leicht verständliches Kursmaterial<br>✔ Auch für Einsteiger ideal geeignet<br>✔ Keine zusätzliche Software nötig<br>✔ Keine Designkenntnisse nötig<br>✔ 100% risikolos – 30 Tage Rückgaberecht<br>✔ Kurs-Verbesserungen und -aktualisierungen inklusive</p><p>Warum brauchst du visuellen Content?</p><ul><li>Mehr als 80% deiner Websitebesucher lesen deine Texte nicht, sondern überfliegen sie nur. Mit individuellen Bildern und Grafiken kannst du deinen Content dennoch unverwechselbar machen.</li><li>Gerade in den sozialen Netzwerken sticht guter visueller Content hervor, das heißt du gewinnst damit mehr Fans und Follower. Beispielsweise werden bei Twitter Tweets mit Bild bis zu 35% häufiger retweetet.</li><li>Bilder und Grafiken sind wesentlich schneller vom menschlichen Auge und Gehirn erfassbar als Text.</li><li>Nur 20% des Inhalts aus Texten merkt sich ein Mensch im Durchschnitt. Bei visuellen Inhalten ist es wesentlich mehr.</li><li>Visueller Content wird in der Google Bildersuche gefunden, Texte nicht.</li></ul><p><br>Warum solltest du Canva nutzen?</p><ul><li>Canva ist komplett kostenlos :-)</li><li>Die Bilder, die du in Canva kaufen kannst, sind mit $1 extrem günstig.</li><li>Die Benutzerfreundlichkeit von Canva ist unschlagbar – es ist einfach sehr leicht zu bedienen.</li><li>Mit Canva kannst du in Zukunft auf teure Bildbearbeitungsprogramme wie Photoshop o.Ä. verzichten.</li><li>Für den Bedarf von Unternehmen gibt es auch eine kostenpflichtige Version von Canva (Canva for Work), die tolle zusätzliche Funktionen bietet.</li></ul><p><br><em>Worauf wartest du noch?</em></p><p>KLICKE “BELEGEN SIE DIESEN KURS” UND STARTE JETZT!</p>", 
    "end_date": null, 
    "title": "Individuelle Grafiken kostenlos erstellen mit Canva", 
    "price": "20.00", 
    "instructors": "Katharina Lewald", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632082_9a92_3.jpg", 
    "course_url": "https://www.udemy.com/individuelle-grafiken-kostenlos-erstellen-mit-canva/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T06:13:55Z"
}