{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong><strong>Ever wonder How a small minority of Users can achieve such a massive Impact on Instagram while others achieve barely nothing?</strong><span></span></p><p><strong>We will show You how to succeed!</strong></p><p>\n<br>\nCompared to other Social-Media Platforms <strong>Instagram offers a truly strong potential for Entrepreneurs and Businesses.</strong><br>\nThis App is on it’s way to becoming the most powerful Medium in Online-Marketing and is <strong>becoming far more important than Facebook or other Platforms.</strong><br>\n<strong>Invest in Instagram early</strong>. Now is Your chance to quickly accomplish substantial success.</p><p>With the right strategies you will achieve incredible reach and discover unknown, new opportunities: more traffic for your website, more sales, acquiring great jobs, getting paid for for product placement and earning sponsor contracts. <strong>Your opportunities are endless! </strong></p><p><strong>Stop waisting Your valuable time with unnoticed Posts and decide now for Your Success.</strong><br>\nStudy the course and achieve the first results just after a short few days. </p><p>The shown techniques and strategies are proven, optimized and effective.<br>\nWe will show You <strong>how You can unlock the Instagram-Code. <br></strong>\n<br>\nStart Now, claim Your advantage and belong to the Top 1% of Instagram-Users in no time!<br>\n<strong>You will be more successful than 99 out of 100 unknowing users.<br></strong>\n<br></p>", 
    "end_date": null, 
    "title": "Instagram Marketing: Gain 10k active Followers in 3 Months", 
    "price": "20.00", 
    "instructors": "CJ Marketing GbR", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/712542_e788_2.jpg", 
    "course_url": "https://www.udemy.com/instagram-hero-gain-10k-active-followers-in-short-3-months/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-01T17:21:48Z"
}