{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tIn this training you will learn more about how to use it effectively to build relationships, add value and convert your passion into profits.  </p>  <p>  \tInstagram has over 150 million users on the platform, 16 billion photos shared, and 1 billion likes happening each day, the photo-sharing and editing platform is one of the most engaging channels on social media. With over 150 million active users on Instagram make sure you are one of them!  </p>  <p>  \tIn this course I will show you specifically how to:  </p>  <p>  \t1. Create custom text in Instagram for your pictures for business use. These are strategies and tips you have never seen before.  </p>  <p>  \t2. 3 creative ways to use video in Instagram for your business.  </p>  <p>  \t3. Use of effective hashtags  </p>  <p>  \t4. Build a following  </p>  <p>  \t5. How to build a bio that rocks!  </p>  <p>  \t<em style=\"\">The training will be done directly from an iPad.  </em>  </p>  <p>  \tPlease note: This is NOT a step-by-step beginner training that will teach you how to take pictures for Instagram. In this course you will learn how to harness the power of Instagram for your business with a focus on building a community.  </p>  <p>  \tI will share apps that I use, how to build an effective bio, how to find people to follow and more!  Training does include a recording of the training and access to the course &quot;How to Use Instagram Video for Business and Building a Brand.&quot;  </p>  <p>  \tVisit me on Instagram <a href=\"http://instagram.com/montinaportis\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">http://instagram.com/montinaportis</a> and let&#039;s connect!  </p>", 
    "end_date": null, 
    "title": "Instagram Training for Beginners", 
    "price": "20.00", 
    "instructors": "Montina Young Portis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231844_717e_4.jpg", 
    "course_url": "https://www.udemy.com/instagram-training-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-28T13:33:37Z"
}