{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Updated March 7</strong></p>\n\n<p>- Optimizing your posts</p>\n\n<p>- Have a clear Call To Action</p>\n\n<p>- How to use Instagram video</p>\n\n<p><strong></strong></p>\n\n<p>- Analytics Apps tutorials</p>\n\n<p>What you are going to learn in this course are straight to the point, <strong>ACTIONABLE</strong> &amp; proven techniques that works. <strong>No fluff or time fillers</strong>, I respect your time.<br></p>\n\n<p>This course has already helped 1000s of people with their Instagram marketing, <strong>I know this stuff works.</strong> I've seen it work for others in a variety of niches and I've tried it over and over myself with the same successful results. <strong>This has helped me reach over 30k engaged followers in a short period of time.</strong></p>\n\n<p><strong>Instagram marketing is blowing up right now</strong>. With a follower engagement rate that blows Facebook and Twitter out of the water, Instagram marketing is something you need to explore. Especially if you are a small business owner or entrepreneur. <strong>It's literally free, targeted traffic!</strong></p>\n\n<p>Welcome to my course on how to get your first <strong>1000 engaged Instagram followers in 30 days.</strong></p>\n\n<p><strong></strong></p>\n\n<p>If you want results like the ones in my course intro video, <strong>with new followers dropping in literally every second,</strong> then this course is for you. </p>\n\n<p><strong>If you do what I'm about to share with you in this Instagram marketing course, I guarantee you'll see amazing results.</strong><br></p>\n\n<p>As with all my courses, this comes with a <strong>full money back guarantee.</strong> So you can relax and know that there's no risk whatsoever for you to join my course. </p>\n\n<p>I can't wait to get started! See you in Module 1.</p>", 
    "end_date": null, 
    "title": "Instagram Marketing: From 0-1000 Real Followers in 30 Days", 
    "price": "40.00", 
    "instructors": "Marouane Bembli", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604426_fed9.jpg", 
    "course_url": "https://www.udemy.com/instagram-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T02:32:12Z"
}