{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">What&#039;s the course about?</strong>  </p>  <p>  \t            According to Forrester research &quot;Instagram is the King of Social Engagement&quot;. In fact Instagram delivers &quot;brands 58 times more engagement per follower than Facebook, and 120 times more engagement per follower than Twitter.&quot; Any person interested in marketing online or earning money online must use Instagram - &quot;the King&quot;. However the key to this engagement is building a large committed group of followers. Yet how do you do that? In this course we will meet with a surprising guru - an up-and-coming social media expert who has not only built a dedicated Instagram following of over 10,000 followers, but also turned this into a money making venture.  </p>  <p>  \t          Learning from an Instagram guru, this course will show you how to attract over 10,000 engaged followers. Hannah, from imaginethatgirls, will share expert tips, advice, secrets and apps that will enable you to build a follower base of thousands of engaged followers. In addition she will discuss how you can turn this engaged group of followers into real money making opportunities.  </p>  <p>  \t<strong style=\"\">What kind of materials are included?</strong>  </p>  <p>  \t            The course includes everything you need. The lectures are professionally created, as people have come to expect from bytheGURU productions. The course is in HD video with high quality audio and images. We will show you everything we explain - and as this is all about Instagram which is done on a mobile phone - you will see it all clearly demonstrated on the phone.  </p>  <p>  \t<strong style=\"\">How long will the course take to complete?</strong>  </p>  <p>  \t            There are 6 sections to this web development course, with each section providing short powerful videos on individual concepts. While there is just under 2 hours of video, you will need to apply these concepts to you Instagram account to build it over 10,000 followers. This will take approx. 3-5 months depending on how you use the lessons we share with you. This course is not just about getting 10K followers, but building an Instagram account that has two key ingredients - engaged followers and a strong account identity.  </p>  <p>  \t<strong style=\"\">How is this course structured?</strong>  </p>  <p>  \t            This is an action course. So the course starts with getting to the doing straight away. The course starts with setting up an Instagram account and then leads you through 6 sections where we build on basic concepts and reveal amazing techniques, clever tricks, and useful apps to help you develop your Instagram account. The course is structured in the following way:  </p>  <ol style=\"\">  \t<li>Section 1 - Setting Up An Effective Account - Vital Tips, even if you have setup an account. You will be surprised to learn what you may already have done wrong. The good news is you can edit your account settings once you learn how it should be done!</li>  \t<li>Section 2 - Getting Likes - Followers with Engagement is key. Instagram is the most engaging social media platform, and this section will show you how to maximize your followers engagement.</li>  \t<li>Section 3 - Getting Followers - Growing your followers can be done in a variety of ways, and by using a combination of clever techniques, tricks and apps you can grow a massive follower base!</li>  \t<li>Section 4 - Optimizing Your Images - Identity, and the importance of the images you share is vital to marketing success on Instagram. This section will look at some great (mostly) free apps that you can use to ensure your images are professional.</li>  \t<li>Section 5 - Making Money from Instagram - With a large follower base there are some awesome opportunities to earn money from your Instagram account. This section will share some really easy ways to turn your account into money - even before you reach 10K followers!</li>  \t<li>Section 6 - Conclusion - We will bring all the key lessons together and explore the ones that are really important.</li>  </ol>  <p>  \t<strong style=\"\">Why take this course?</strong>  </p>  <p>  \t            If I am looking for an online course there are 3 key things I look for. Firstly, the qualification/experience of the teacher. Secondly, the ability of the teacher to teach/present. Thirdly, the quality of the teacher’s material. So here are my credentials.  </p>  <ol style=\"\">  \t<li>My Qualification/Experience - I have just completed a PhD in the use of IT for education. I&#039;ve been involved in IT both as a university lecturer, IT consultant and entrepreneur for over 20 years. This includes starting up multiple businesses both online and offline.</li>  \t<li>Ability to teach - In addition to having been a lecturer for over 20 years I have spoken around the world to everyone from business leaders to politicians to teachers to children. But don&#039;t believe me, here are what some of those who have heard me say:</li>  </ol>  <ul style=\"\">  \t<li>&quot;<em style=\"\">Craig has the rare ability to engage personally with each member in his audience</em>&quot; (A. Byrnes, PDM Pty Ltd, Australia),</li>  \t<li>&quot;<em style=\"\">Craig is a dynamic speaker, out-of-the-box strategic thinker and professional</em>&quot; (R. van Rooyen, Associate Partner, Deloitte)</li>  \t<li>“<em style=\"\">Mr. Blewett is a pleasure to take in. The excitingly focused style by which he speaks keeps you on the edge of your attention</em>.” (C. Stickney, USA)</li>  \t<li>“<em style=\"\">Craig is an experienced and highly competent teacher and presenter. He has the rare ability to convey innovative concepts in an engaging fashion that is packed with enthusiasm but also logic and balance</em>.” (Dr. Alleyne, UK)</li>  \t<li>&quot;<em style=\"\">Craig is possibly on of the most interesting presenters I have encountered. His students love him and in public forums he is unequalled</em>.&quot; (Prof. Maharaj, UKZN, South Africa)</li>  </ul>  <p>  \t            3. All the material presented in this course is professionally produced using HD video, high quality audio and specialist video editing software.  </p>  <p>  \t            Besides all this, you wont find a better value, easier course that will enable you to grow your Instagram following to over 10,000 PLUS turn that amazing engagement into real income opportunities!  </p>", 
    "end_date": null, 
    "title": "Instagram - Building a successful account", 
    "price": "25.00", 
    "instructors": "Craig Blewett", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/229684_e0b8_4.jpg", 
    "course_url": "https://www.udemy.com/instagram/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-26T11:34:31Z"
}