{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>As the artist Manafest I've sold over 300,000 albums worldwide over 1,000,000 singles and toured over 20 different countries.<br></p>\n\n\n\n\n\n<p>I currently have over 14,000 followers on Instagram and have used it to promote my music sell merchandise plus engage a loyal fanbase.</p>\n\n\n\n\n\n\n\n<p>Instagram is a must for any artist or business owner promoting their brand and looking to make an impact online.</p>\n\n\n\n\n\n\n\n<p>Instagram is one of the fastest growing social media platforms with over 300 million users and 60 million photos uploaded daily.  </p>\n\n\n\n\n\n\n\n<p>Instagram was recently purchased by Facebook so it's not going anywhere anytime soon.</p>\n\n\n\n\n\n\n\n<p>Currently, Instagram doesn't require you to pay to have your posts seen by your followers.<br></p>\n\n\n\n\n\n\n\n<p>I have put this course together for you - to which you have full lifetime access, including all the updates, for free. (I update my courses every other month with the latest techniques)<br></p>\n\n\n\n\n\n\n\n<p>I \"take you by the hand\" and \"behind the scenes\" and show you everything, explaining it in simple detail with videos and written support lectures. </p>\n\n\n\n\n\n\n\n<p>See exactly why I'm so successful with Instagram - see the stats in the free preview videos, below).</p>\n\n\n\n\n\n\n\n<ul><li>See inside my Instagram account </li><li>Brand your Instagram account and stand out from your competition</li><li>Grow your followers quickly - get more likes, and engagement with your audience.</li><li>Nothing is left out - you see everything</li><li>... and my help and assistance to Udemy students is legendary</li></ul>\n\n\n\n\n\n\n\n<p>+++++++++++++++++++++++++++++</p>", 
    "end_date": null, 
    "title": "Instagram Marketing Mastery For Business", 
    "price": "20.00", 
    "instructors": "Christopher Greenwood", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/723146_b64e_2.jpg", 
    "course_url": "https://www.udemy.com/instagrammarketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T20:48:59Z"
}