{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Learn the top 5 most important Skills to be using on Instagram to skyrocket your follower growth.</strong></p>\n\n<p>Learn the different marketing skills to be applying to your Instagram account: to boost your follower growth and expose yourself to the 100+ million users available on the social media platform.</p>\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n<p><strong>By the end of this online course...</strong><br></p>\n\n\n\n\n\n\n\n<p>You will be full aware of the most important techniques to grow a following on Instagram, which are overlooked frequently. You will understand how to use hashtags and why, how to visually stimulate people, how to expose your account and much more.</p>\n\n\n\n\n\n\n\n<p>You can easily apply each technique with minimal effort to gain more likes, comments and followers making your account more valuable: which can start earning you money through advertising for brands by uploading photos.</p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why take this course?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Taught by a social media manager</li><li>I have experience managing dozens of accounts with hundreds of thousands of followers</li><li>I'm here to help you achieve the same results I have</li><li>You get to see a break down of practical examples taught in the course</li></ul><ul><li>You can watch and complete it whilst eating lunch</li><li>It's free!</li></ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><strong>Who should be ideally take this course?</strong></p>\n\n\n\n\n\n\n\n<ul><li>If you want to grow an Instagram account or even accounts, this is the perfect place to start efficiently and confidently</li><li>If you are already an active casual Instagram'er user and want to grow your account</li><li>If you want to confirm and understand the basic skills to be using on Instagram to grow and advertise your Instagram account</li></ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><em>Looking forward to seeing you join me on this online Instagram course!</em></p>", 
    "end_date": null, 
    "title": "Instagram Marketing - 5 Successful FREE Tips You Need To Use", 
    "price": 0, 
    "instructors": "Aaron Ward", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/843754_aeb7_3.jpg", 
    "course_url": "https://www.udemy.com/instagram-tips/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-09T12:49:25Z"
}