{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong></p><p>Instagram ist die <strong>Revolution!</strong> </p><p>Instagram bietet, wie keine andere Social-Media-Plattform ein wirklich starkes <strong>Potenzial </strong>für Einzelpersonen und Unternehmen. Diese App ist gerade dabei, das <strong>wirkungsstärkste Medium</strong> im Online-Marketing zu werden. Entscheide Dich frühzeitig. Jetzt bietet sich <strong>Deine Chance schnell damit zu beträchtlichem Erfolg zu gelangen</strong>!</p><p>Mit der <strong>richtigen Strategie</strong> gewinnst Du schnell eine großartige Reichweite und eröffnest Dir ungeahnte Möglichkeiten: <strong>mehr Traffic für Deine Website, mehr Sales</strong><strong>, tolle Jobs akquirieren, für die Produktplatzierung bezahlt zu werden und Sponsoring-Verträge aushandeln...<br>Deine Möglichkeiten sind endlos!</strong></p><p>Hör auf, Deine Zeit mit unbeachteten Posts zu verschwenden und <strong>entscheide dich jetzt für </strong><strong>Deinen Erfolg! Sieh Dir den Kurs an, und erziele die ersten Resultate schon nach einigen Tagen.</strong><span></span></p><p>Die gelehrten Techniken und Strategien sind erprobt optimiert und wirkungsvoll. Wir zeigen Dir, wie Du den <strong>Instagram-Code entschlüsselst</strong>.</p><p>Starte <strong>Jetzt</strong>, sichere Dir damit Deinen Vorsprung und gehöre nach kurzer Zeit zu den <strong>Top 1% der Instagram-Nutzer! Damit bist Du erfolgreicher, als 99 von 100 unwissende Nutzer.</strong></p>", 
    "end_date": null, 
    "title": "Instagram-Marketing: Stategie zu 10k Follower in 3 Monaten", 
    "price": "20.00", 
    "instructors": "CJ Marketing GbR", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654624_e9db_4.jpg", 
    "course_url": "https://www.udemy.com/instagram-held-mehr-erfolg-fur-dein-online-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T15:22:10Z"
}