{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Who Benefits from this Course? </strong>Quick and Easy Social Media Analytics and Measurement. Are you a Facebook Admin looking to write social media measurement reports? Or a marketing professional needing analytics to evaluate Twitter and Instagram return on investment of marketing time and dollars? Perhaps you run a small business and just know there must be more to Facebook and Twitter and would like to see behind the curtain? This course is for the professional social media manager, a marketing or PR person or a small business evaluating their social media presence on Facebook, Twitter etc.</p><p><strong>What does the Social Media Measurement and Analytics Course Cover? </strong></p><ol><li>What should you measure? How do you set KPIs (Key performance indicators or goals)</li><li>Facebook Insights are all very well but what about Twitter? And the other platforms?</li><li>Gain an understanding Return on Investment and Cost of Acquisition of the Customer.</li><li>Native tools like Facebook Insights vs 3rd Party measurement? </li><li>Learn about setting KPIs (Key Performance Indicators), </li><li>Which social media measurement tools to use, </li><li>What analytics is available for free on Twitter and Facebook, </li><li>Cool tools (free and paid for) are covered, </li></ol><p><strong>Format of the course: </strong>Almost everything is in a video lecture format (I'll walk you through evaluating, setting up and measuring social media on various platforms like Facebook and Twitter) but there are also downloadable workbooks for those that prefer to read and follow along that way. </p><p><strong>SHORT COURSE:</strong> This is a mini-course that is part of a much larger Social Media Campaign course - <strong>you will find some videos duplicated from the Campaign course on my corporate account. </strong>Some students just want a quick and easy course on one aspect of campaigns - that is the purpose of this course. So if you are just looking for measurement and analytics tools and strategies as part of social media campaigns, this is the course for you!</p>", 
    "end_date": null, 
    "title": "Learn Social Media Measurement Analytics & Insights", 
    "price": "40.00", 
    "instructors": "Laurel Papworth", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604440_0428_4.jpg", 
    "course_url": "https://www.udemy.com/social-media-measurement/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T03:11:01Z"
}