{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Dear prospective student,</p><p>I am about to disclose an information that will open your eyes and surely be of great help to increase your leads and conversions with less efforts at your end.</p><p>But first, let me ask you two basic questions:</p><ol><li>Do you feel tired and exhausted by seeing few visitors on your website even after making numerous efforts?</li><li>Are you still dependent on age old marketing techniques that hardly convert?</li></ol><p>Be honest! Were you able to attain your desired goals? </p><p>Most probably your answer is <strong>NO!</strong> Correct? </p><p>Let me just wake you up with these shocking stats:</p><ul><li><strong>More than 70%</strong> of marketers use Facebook to gain new customers.</li><li>Facebook’s total revenue for the quarter ending June 30, 2015 was <strong>$4.04 billion</strong>.</li><li>Mobile ad revenue now accounts for 76 percent of Facebook's advertising revenue.</li><li>Facebook now boasts 40 million active small business pages.</li><li>Almost <strong>47% of all internet users</strong> are using Facebook in some way.</li><li>5 new Facebook profiles are created every second.</li><li>In December 2014, Facebook videos received <strong>more than 80%</strong> of all video interactions.</li></ul><p><br></p><p>Don’t worry, this issue will not become a barrier between you and your business growth.<br></p><p>That is because in this training course, I will provide you simple, precise and <strong>A-Z Facebook Marketing guidance</strong> that will assist you to easily get consistent and reliable profits without draining your bank account and with practically no startup cost.</p><p>This comprehensive and up-to-date <strong>Facebook Marketing 2.0</strong> training includes:</p><ul><li><strong>15 HD Quality</strong> Facebook Marketing Training Videos </li><li><strong>90+ Page</strong> PDF Facebook Marketing Training Guide</li></ul><p><br></p><p>PLUS...you will get free access to 3 cool Bonuses:</p><ul><li><strong>Bonus 1</strong>: Facebook Marketing Cheat Sheet<em></em></li><li><strong>Bonus 2</strong>: Facebook Marketing Training Mind Map <em></em></li><li><strong>Bonus 3:</strong> Facebook Marketing Top Resources Report <em></em></li></ul><p><br></p><p>If you have a well-designed Facebook Marketing campaign, you will be able to become your own boss and enjoy your life to the max that you always wanted.<br></p><p>You will also witness an increase in your profits by reducing your dependence on middleman and not wasting money on other overhead expenses.</p><p>Now all the efforts for streamlining your Facebook Marketing campaign have been taken at our end. You just need to apply these proven strategies, and get your business way above your competitors.</p><p>Learning Facebook Marketing doesn't have to be hard. Enroll today, and let's get started!</p>", 
    "end_date": null, 
    "title": "Learn Facebook Marketing from Scratch", 
    "price": "20.00", 
    "instructors": "Nigel Bishop", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686656_8756_2.jpg", 
    "course_url": "https://www.udemy.com/learn-facebook-marketing-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T02:59:15Z"
}