{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Over 8,000 total UNIQUE Udemy Students Enrolled In Past Courses!</strong></p><p style=\"\">Tired of spending countless dollars on paid advertising, that just don&#039;t work? Wouldn&#039;t you like a free method that would just blow all other methods out of the water?</p><p style=\"\">Well,look no further.</p><p style=\"\">I have stumbled upon a unique and amazing way, that you can generate an insane amount of highly targeted traffic to any website. Absolutely free.</p><p style=\"\">The methods I cover in this Udemy course are not for the light hearted, it&#039;s easy to use, easy to implement, and you can start generating traffic within 20 minutes from completing the course.</p><p style=\"\">I know the struggle you have been having with other traffic sources, I to used spend countless amounts of money on Facebook Advertising, bidding on keywords and wasting my time, which in the end left me no closer to success than when I started.</p><p style=\"\">This course was made for action takers, and people who want to make money online, and are serious about not only driving traffic, but building an online business.</p><p style=\"\">You can use this for selling affilaites products, building up an email list, or even just sending the traffic over to a Youtube video.</p><p style=\"\">In the end of the day, you really can&#039;t build a six figure business, without having some type of reliable source of traffic that you can tap into on a daily basis.</p><p style=\"\">Did I mention, that this method is completely FREE to implement?</p><p style=\"\">That&#039;s right, you can drive highly targeted traffic to any website, and it won&#039;t cost you a penny.</p><p style=\"\">This is going to change the way people drive traffic online, and would highly recommend you jump on board now, to see this amazing method in action.</p><p style=\"\">But, at the end of the day, what matters is that you take action. You can look at this sales page all you want, and you can think about checking this out. But until you go ahead and enroll, you will not see any results, and will be stuck spending a fortune on Facebook advertising.</p><p style=\"\"><em style=\"\"><strong style=\"\">Enroll Now!</strong></em><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learn This Traffic Method, Never Spend A Penny On Traffic", 
    "price": "20.00", 
    "instructors": "Francesco Iantorno", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446994_8f26_2.jpg", 
    "course_url": "https://www.udemy.com/freetrafficcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T01:43:06Z"
}