{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>*COURSE UPDATED ON 11/19/15</em></strong></p><p><strong><em>*OVER 3300 SATISFIED STUDENTS!</em></strong></p><p><strong><em>*PRICE SET TO INCREASE ON 12/01/15</em></strong></p><p><strong><em><br></em></strong></p>  <p><em>\"Easy to listen to and easy to understand. You won't be disappointed!\" </em>- Jen</p><p><em>\"This social media course is awesome, if you apply on a daily basis and follow through what the instructor teaches you to. It's very easy to complete and understand this course, you don't need geeky skills to understand it. The only way you can fail is the lack of following through. Your results with this course depends on how commited you are to take action everyday. Many thanks to the instructor. Great job!\"</em> ~Vladut</p><p><em>\"It's good to see somebody developing their social media accounts who has a business which is not selling social media tips - it makes the advice credible and it's easy to see how Matt's tips can be actionable in my own business.\"</em> - Victoria</p><p><br></p><p><strong></strong></p><p><strong>***NEW BONUS ADDED: \"The Social Media Marketing Cheatsheet\"***</strong></p><p><strong></strong></p><p><strong>What is this course about?</strong></p><p>This is a no-nonsense guide on growing a following on social media, optimizing posts for high engagement and automating multiple accounts to streamline the process. </p><p><strong>When you take this course: </strong><strong>you WILL:</strong></p>  <p>  \t    - grow your list of followers on Twitter  </p>  <p>  \t    - grow your list of followers on Facebook  </p>  <p>  \t    - grow your list of followers on Instagram  </p>  <p>  \t    - get more engagement with all of your followers  </p>  <p>  \t    - have a better understanding of social media  </p>  <p>  \t    - automate a lot of the tedious work involved in maintaining your accounts  </p>  <p>  \t    - have a better, more thoughtful social media marketing strategy  </p>  <p>  \t    The idea is to invest time now so you can reap the benefits for years to come!  </p>  <p>  \t<strong>About the Instructor:</strong>  </p>  <p>  \t    Matt Guarino is a social media expert who used his knowledge of platforms like Facebook, YouTube and Twitter to get 1 million hits for his YouTube videos within his first year of being on YouTube. He did not use any gimmicks. He did not pay anybody. He did not even ask for anyone's help. He didn't just get “lucky\". YouTube never featured his content on the main page or anything. He just worked hard at creating high quality content and marketing himself on social media. He knew that it's one thing to have quality content, but it's another to make sure that it reaches the desired audience. His efforts on social media led to him having the #8 Most Viewed YouTube Musician Channel in the World for a period of time. He even scored deals with MTV and CBS!  </p>  <p>  \t    ***Whether you have a business, a website or a YouTube channel, you owe it to yourself to get the most out of social media. This course will kick your social media traffic into high gear. Your content will reach people that it never would have reached. <strong>You WILL see improvements in your results.</strong>  </p>      <p>  \t<strong>***If you don't see a boost in your traffic and your list of followers on these platforms, then you are more than welcome to get a full refund within 30 days- no questions asked!</strong>  </p>      <p>  \t<strong>So what are you waiting for? Sign up today and get started.</strong>  </p><p><strong></strong></p>    <p>  \t<strong>How is this course structured?</strong>  </p>    <p>  \t  SECTION 1: WELCOME  </p>  <p>  \t  Introduction  </p>  <p>  \t  SECTION 2: BUILDING A FOLLOWING  </p>  <p>  \t  How to Build a Following on Twitter  </p>  <p>  \t  Building a List of Twitter Followers  </p>  <p>  \t  Using Automation to Save Time and Build Relationships  </p>  <p>  \t  Building a List of Instagram Followers  </p>  <p>  \t  SECTION 3: SOCIAL MEDIA ACCOUNTS  </p>  <p>  \t  What's on Your Twitter Profile?  </p>  <p>  \t  What's on Your Instagram Profile?  </p>  <p>  \t  What's on Your Facebook Page?  </p>    <p>  \t  SECTION 4: POSTING AND SHARING CONTENT  </p>  <p>  \t  How to Post Content on Multiple Sites  </p>  <p>  \t  Essential Automation Tools  </p>  <p>  \t  More Automation Tools  </p>  <p>  \t  Measuring Your Influence</p>  <p>  \t  SECTION 5: MARKETING STRATEGIES  </p>  <p>  \t  Which Platform Should You Use?  </p>  <p>  \t  Profile Pictures  </p>  <p>  \t  Getting Involved  </p>  <p>  \tReplying to Tweets  </p>  <p>  \t  Give to Get  </p>  <p>  \t  Using Images To Boost Engagement  </p>  <p>  \t  Using Quotes To Boost Posts  </p>  <p>  \t  Getting an Edge with Hashtags and Trending Topics  </p>  <p>  \t  When Do You Post?  </p>  <p>  \t  Closing Thoughts  </p>", 
    "end_date": null, 
    "title": "Learn SOCIAL MEDIA MARKETING- Pro Tips to Build Your Empire", 
    "price": "20.00", 
    "instructors": "Matt Guarino", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425304_2491_4.jpg", 
    "course_url": "https://www.udemy.com/socialmediamarketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T20:59:01Z"
}