{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>You want to leverage HootSuite to <strong>boost your social media productivity</strong>. You are looking for any way to decrease the amount of time you spend on social media so you can<strong> focus on other areas of your business.</strong> </p><p>I want you to take some time right now and <strong>envision how different your business would be if your social media activity was on autopilot</strong>. Imagine if your audience grew on its own, content was scheduled on its own, and any time you used social media, you used it in the most productive way possible.</p><p><strong>This is how the successful entrepreneurs use social media</strong>. The secret to using social media successfully is to not spend much of your own time on any of the platforms. That way, you have more time to write blog posts and create blog posts that can serve the audience you are trying so hard to build.</p><p><strong>If you do not change the way you use social media, then you risk social media taking far more time than it should</strong>. You won't have any extra time to grow your business let alone keep it going.</p><p>At one point, social media took too much of my time. The result was that even though I was gaining hundreds of followers and getting results from social media, my revenue didn't even budge. I was not able to create products.</p><p>All of that changed when I changed the way I used HootSuite. I had been using HootSuite before, but utilizing HootSuite for productivity allowed me to rediscover hours of extra time every day that since then have been repurposed into other areas of my business.</p><p>The way I responded to social media taking too much of my time is the main reason I am able to create more products.<br></p><p>In this course, you will discover how to save a massive amount of time by using HootSuite to turbocharge your social media productivity.<br></p><p>If you are ready to take your social media growth and time management, then<strong> click \"Take This Course\" now.</strong></p>", 
    "end_date": null, 
    "title": "Leveraging HootSuite For Social Media Productivity & Success", 
    "price": "20.00", 
    "instructors": "Marc Guberti", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702470_60bf_2.jpg", 
    "course_url": "https://www.udemy.com/hootsuite-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T00:23:34Z"
}