{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      In this course you will learn how to strengthen your LinkedIn profile and how to use this social media tool to connect with influencers, new clients and potential business partners.  </p>  <p>  \t<strong>The strategies you will learn in this course with lead you to:</strong>  </p>  <p>  \t      ·Optimize your LinkedIn profile to get MAXIMUM results</p>  <p>  \t      ·Promote your skills and abilities in a unique way  </p>  <p>  \t      ·Choose the profile settings that match your professional goals  </p>  <p>  \t      ·Use LinkedIn groups to create a top-notch network  </p>  <p>  \t      ·Transform LinkedIn into a powerful personal branding tool  </p>  <p>  \t      ·Increase your chances to connect with anyone on LinkedIn, including 3rd-level connections  </p>  <p>  \t      ·Adopt LinkedIn etiquette to maximize your chances of success  </p>  <p>  \t      ·Use advanced publishing techniques to become a LinkedIn influencer  </p>  <p>  \t      ·Decide whether LinkedIn Premium is a good fit for your career and business goals  </p>  <p>  \t      ·Learn quick tips to ensure your profile is secure  </p>  <p>  \t<strong>  This course is not only about concepts. “LinkedIn Strategies for Career Success\" is filled with execution so you can start harnessing the power of LinkedIn FAST!  </strong>  </p>  <p>  \t      ******************************  </p><p><span><em>“Although I'd been 'using' LinkedIn for many years, when I took Cloris's course I realized I'd barely scratched the surface of its potential. This course packs a powerfully effective punch. My social media life will never be the same again!\"</em></span>--Roz Savage, bestselling author of <em>Start Drifting, Start Rowing</em>, activist, speaker, and coach.</p><p>******************************</p>  <p><em><strong>What's my story? </strong></em></p><p>I used to think LinkedIn was a waste, but when I learned how to use this tool correctly, I realized I had missed many opportunities that would have made a huge difference in my career.  </p>  <p>  \t      I don't want you to make the same mistake.  </p>  <p>  \t      That's why I created this course.  </p>  <p>  \t      I have experienced the benefits of having a strong LinkedIn network, and I know you want and deserve to experience this too!  </p>  <p>  \t<strong>  This course reveals step-by-step strategies to supercharge your LinkedIn profile. Even if you just know the basics about LinkedIn, you'll be able to implement the strategies I share, and you will achieve tangible results that can significantly impact your career.  </strong>  </p>  <p>  \t      The course is dynamic, easy to follow, and streamlined.  </p>  <p>  \t      Let me help you share your skills and abilities with the world. Make this small investment in your career and sign up today!  </p>  <p>  \t<strong>  And remember to <em>always</em> reveal your magnificence!  </strong>  </p>  <p>  \t      Cloris  </p>  <p>  \t      PS. Your investment is backed by Udemy's 30-day no-questions-asked guarantee.  </p>", 
    "end_date": null, 
    "title": "LinkedIn Strategies for Career Success", 
    "price": "35.00", 
    "instructors": "Cloris Kylie", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420234_4cf9_6.jpg", 
    "course_url": "https://www.udemy.com/linkedin-secrets-for-career-success/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T14:31:09Z"
}