{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Many people are on LinkedIn, but how many of them are using it effectively? In our combined 15 years of being LinkedIn Power Users and teaching others to do the same, we realized too many people are not using LinkedIn correctly. We&#039;ve created this course to help others learn tips-and-tricks that too often go unused. Whether you&#039;re looking to generate leads, meet high-profile individuals, or find your next job, we have a formula that works. It&#039;s simple and makes sense once learned and practiced. Save the time of trial and error and allow us to teach you as someone once taught us. </p><p>So what is a LinkedIn Power User? A Power User is someone who establishes goals and leverages the power of LinkedIn to reach new heights in their career. Beyond that, a Power User understands that LinkedIn is the strongest tool they have. Unlike the very large majority of users, Power Users use the same formula we teach in this course. It takes some work and some understanding, but we promise; no matter your goals with using LinkedIn, you can reach them simply by applying this formula.</p><p>Now is the time to make a change in how you approach LinkedIn. After this course, you won&#039;t look at profiles the same. You&#039;ll see past the distractions and notice opportunities you didn&#039;t see prior. Once you see those opportunities, you&#039;ll apply the formula to get the results you want. We&#039;ve been using this formula for years. We&#039;ve landed new clients, engaged new markets, and launched products; all on one social platform!</p><p>If you&#039;ve read this far, you&#039;re likely curious what LinkedIn secrets are out there you aren&#039;t utilizing. Join us on the other side and let us show you how to make a change in how you market the most important asset you own....yourself!!!</p>", 
    "end_date": null, 
    "title": "LinkedIn: How to Become a Power User", 
    "price": "20.00", 
    "instructors": "Steve Boerner, David Gritz", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535774_b1d1_2.jpg", 
    "course_url": "https://www.udemy.com/linkedinpoweruser/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T03:18:30Z"
}