{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>LinkedIn is now the world&#039;s greatest professional network and is becoming one of the must-haves in the social media marketing strategy of any business. But first, you have to learn how to use it correctly and efficiently and this course is designed to teach you just that.</p><p><strong style=\"\"><em style=\"\">Here is some of what you&#039;ll be learning about:</em></strong></p><ul style=\"\"><li>A step-by-step guide to <strong style=\"\">creating and optimising your personal profile on LinkedIn</strong></li><li>How to <strong style=\"\">create a company page</strong> that is specifically tailored to your needs and targeted towards your potential leads and customers</li><li>The most <strong style=\"\">powerful marketing tools</strong> LinkedIn has to offer and how to use them most effectively</li><li>Top tips for <strong style=\"\">creating post</strong><strong style=\"\">s</strong> that <strong style=\"\">build your brand </strong>reputation and attract followers</li><li>The most <strong style=\"\">effective techniques for attracting followers</strong> on LinkedIn</li></ul>Furthermore, you will be a given access to a wealth of LinkedIn marketing resources, tips and insider tactics.<p>The bottom line is that if you own a business, then you need to be on LinkedIn in order to benefit from one of the fastest moving and growing professional-social media platforms available on the Internet today. But, it takes more than just creating a free LinkedIn account. You also have to understand exactly how to use it properly and efficiently in order to derive maximum benefits for you and your business.</p><p><strong style=\"\"><em style=\"\">So, come get started right away and use the knowledge this course gives you to get your business out in the open and on the right track to success!</em></strong></p>", 
    "end_date": null, 
    "title": "LinkedIn Business Marketing: Professional Profiles & Company Pages", 
    "price": "30.00", 
    "instructors": "MindMekka ®", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479868_0e9e_2.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-linkedin-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T17:26:11Z"
}