{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Right now Social Media is one of the most efficient places to generate traffic and convert visitors into sales. If you check the statistics, social media will appear as one of the leading prospects places.<br></p>\n\n<p>And if you are promoting your offer to professionals, to other businesses (B2B) Linkedin is the place to go. With almost 400 Million users, Linkedin is the no. 1 social media dedicated to businesses and professionals.</p>\n\n<p>If you want to be successful with Linkedin ads and Linkedin marketing, this Udemy course is the one you might need! You will get all the working principles and techniques to create Linkedin ads that convert based on my experience building several successful Linkedin campaigns. Start this course now and join all the other people just like you that want to have results with Linkedin marketing!</p>\n\n<p>You will learn<br></p>\n\n<ul><li>the 7 elements of a successful Linkedin ad campaign,</li><li>how to create text Linkedin ads campaigns to make your offer stand out,</li><li>Linkedin marketing principles to set up top performing sponsored campaigns,</li><li>all the techniques you need to boost your Linkedin marketing.</li></ul>\n\n<p>By taking it, you will be able to understand and master the art of using Linkedin ads and Linkedin for business marketing in the step by step Linkedin tutorials and demonstrations.</p>\n\n<p>In your own pace.</p>\n\n<p>In this course you will get step by step video explanations to help you understand in a comfortable way all about setting up Linkedin ads, customizing them for your offer and the audience you target even if you don't have any previous marketing experience.</p>", 
    "end_date": null, 
    "title": "LinkedIn Ads and Linkedin Marketing", 
    "price": "20.00", 
    "instructors": "MindBoost Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688848_b6a2_2.jpg", 
    "course_url": "https://www.udemy.com/linkedin-ads-and-linkedin-marketing-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T12:05:40Z"
}