{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t                                <em>Course last updated on April 12th, 2016!</em></p>\n\n<p><strong>  \t                                Over 7,804 successful students have enrolled with dozens of 5-star reviews!</strong></p>\n\n<p>The next course price increase will be at the end of the month. When you get the course today, <em>you get free updates for life!! :)</em></p>\n\n<p>  \t                                +++++++++++++++++++++++++++++  </p>\n\n<p>  \t<strong>              LinkedIn Pro Secrets - </strong>In this course I will cover the 14 steps to build an amazing LinkedIn profile to get more leads, clients, and sales.  </p>\n\n<p>  \t<strong>Here is what you get in this course:</strong>  </p>\n\n<ol>  \t<li><strong>Learn the 14 Steps to an amazing professional LinkedIn profile that will get you more leads and clients.</strong></li>  \t<li><strong>Discover the technique to add hundreds of connections with a few clicks.</strong></li>  \t<li><strong>Learn how to create a LinkedIn headline and summary that sell you and your company. </strong></li>  \t<li><strong>Find out how to easily get more endorsements and recommendations in LinkedIn.</strong></li>  \t<li><strong>Learn how to get in front of the decision makers at major companies.</strong></li><li><strong>And much more....</strong></li>  </ol>\n\n<p>  \t                                            These techniques are guaranteed to work even if you are total beginner on LinkedIn.  </p>\n\n<p><strong>Here is a recent review a student sent me on LinkedIn:</strong></p>\n\n<p>\"Josh, Just wanted to thank you for your Udemy course on LinkedIn. I wanted to share this with you, when I checked my LinkedIn account this morning I ranked in the top 9% among professionals like myself, out of 98 which was up 20% over the last 30 days. I attribute this to the tips and strategies you promoted in your Udemy course! Once again thanks and have a great week!\"</p>\n\n<p>  \t                                                    ++++++++++++++++++++++++++++++++++  </p>\n\n<p>  \t                                                              Do you ever feel like your not benefiting from the 300,000,000 professionals on LinkedIn?...  </p>\n\n<p>  \t                                                              Do you want new people to see your LinkedIn profile and what you can offer them?  </p>\n\n<p>  \t                                                              Have you put time and effort into LinkedIn, but feel like you aren't generating the leads you should?  </p>\n\n<p>  \t                                                              Then I've got great news for you....  </p>\n\n<p>  \t          LinkedIn Pro Secrets reveals exactly how to supercharge your LinkedIn profile to get more connections, leads, and sales! You will learn step-by-step exactly what to do to get your profile in the top 10% of people on LinkedIn....Even if you're a beginner.  </p>\n\n<p>  \t                                                              If you've ever felt like you could have a better LinkedIn profile but just don't having the time to do it, this is the course for you.  </p>\n\n<p>  \t                                                              I've been in this same spot. For the first couple of years I was on LinkedIn, my profile sucked... and I got no leads, sales, or job offers as a result.  </p>\n\n<p>  \t                                                            Then in 2013, I started really learning the techniques of the pros to make my LinkedIn profile work for me. Since then, I've grown my network to 4,677 professionals. I've had multiple clients and recruiters find me from my LinkedIn profile. I've built a successful consulting business using LinkedIn as my primary marketing platform.  </p>\n\n<p>  \t<strong>Here is what you will get in this course:  </strong>  </p>\n\n<p>  \t                                                              1. A step-by-step system to upgrade your LinkedIn profile to maximize your connections and leads.  </p>\n\n<p>  \t                                                              2. A simple way to automatically add hundreds of connections your LinkedIn profile with a few clicks.  </p>\n\n<p>  \t                                                              3. An amazingly powerful (but easy) strategy for becoming the \"Go-to\" expert in your field in a few minutes a week...literally!  </p>\n\n<p>  \t                                                            4. No fluff. I only included the things that would get you the maximum impact for your time.  </p>\n\n<p>  \t          I have spent over two years and several thousand dollars learning and perfecting the LinkedIn strategies I will share with you. You will be able to get the same results I have gotten for a fraction of the time and cost.  </p>\n\n<p>  \t                                                  Here is why this system is so effective. I have made this course very streamlined.  </p>\n\n<p>  \t                                                              LinkedIn Pro Secrets will teach you the most effective strategies that you can easily learn and implement as you go through the course...no matter what your experience level with LinkedIn.  </p>\n\n<p>  \t                                                              I know first-hand the power of having an effective professional profile on the world's most powerful social media platform for business. I will help you get there.  </p>\n\n<p>  \t<strong>  Don't miss any more business by not having a highly-effective LinkedIn profile....  </strong>  </p>\n\n<p>  \t                                                              Get this course and start getting results from your LinkedIn profile today!  </p>\n\n<p>  \t                          See you on the inside :)  </p>\n\n<p>  \t                          Josh  </p>", 
    "end_date": null, 
    "title": "LinkedIn for Business Professionals", 
    "price": "20.00", 
    "instructors": "Josh Gwin, MBA", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313372_4d37_4.jpg", 
    "course_url": "https://www.udemy.com/linkedin-profile/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-04T15:15:52Z"
}