{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">★★★ 30 DÍAS DE GARANTÍA ★★★</p><p style=\"\">★★★ SI NO QUEDAS SATISFECHO TE DEVOLVEMOS TU DINERO ★★★</p><p style=\"\">En este curso aprenderás a optimizar tu perfil para sacarle el máximo provecho a LinkedIn, para atraer ofertas de trabajo y/o clientes y poder beneficiarte de todas las oportunidades de negocio y profesionales que esta red te puede brindar.</p><p style=\"\"><strong style=\"\">¿Sabías que ya es la herramienta número 1 del mundo para reclutar trabajadores y selección de personal? </strong>¿Sabías que hay miles de empresas y profesionales independientes que la mayor parte de sus ventas las consiguen gracias al networking en LinkedIn? Yo soy uno de ellos.</p><p style=\"\"><strong style=\"\">Descubre cómo generar oportunidades de negocio o de trabajo usando esta red de una forma óptima.</strong></p><ul style=\"\"><li style=\"\">¿Quieres atraer más clientes para tu empresa?</li><li style=\"\">¿Quieres vender más?</li><li style=\"\">¿Quieres encontrar trabajo?</li><li style=\"\">¿Quieres un trabajo mejor pagado?</li><li style=\"\">¿Quieres ascender dentro de tu empresa?</li><li style=\"\">¿Quieres dejar las puertas abiertas a otros trabajos, por si llegaras a perder el que tienes?</li><li style=\"\">¿Quieres posicionarte como experto en tu área?</li><li style=\"\">¿Quieres consolidar tu reputación online?</li></ul><p style=\"\">Este curso te ayudará en todas esas áreas y además aprenderás a:</p><ul style=\"\"><li style=\"\">Crear un perfil que se posicione bien en el buscador de LinkedIn</li><li style=\"\">Diseñar un perfil atractivo que inspire confianza a los posibles clientes o personal de rrhh.</li><li style=\"\">Evitar los errores que la gran mayoría de personas comete.</li><li style=\"\">Aprovechar las herramientas gratuitas que esta red pone a tu disposición y que la inmensa mayoría de personas no sabe ni que existen.</li><li style=\"\">Crear una red de contactos específicamente diseñada para alcanzar tus objetivos.</li></ul><p style=\"\">Cualquiera que sea tu nivel de conocimiento de LinkedIn, en este curso encontrarás técnicas extremadamente útiles.</p><p style=\"\">No importa cuál sea el área en la que eres experto, cuál sea tu pasión o qué vende tu empresa: contabilidad, programación, política, desarrollo personal, pesca, sky, o un blog de comer carnes. Este curso está diseñado para ayudarte a construir y promocionar tu marca personal posicionándote como experto en tu área.</p>", 
    "end_date": null, 
    "title": "LinkedIn. Marketing Personal - Potencia Tu Marca Personal", 
    "price": "50.00", 
    "instructors": "Gustavo Escobar Henríquez", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466600_4858.jpg", 
    "course_url": "https://www.udemy.com/curso-linkedin-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T11:47:51Z"
}