{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Ever wonder how to create a LinkedIn profile that gets you more views, more contacts and more business? </strong>  </p>  <p style=\"\">  \t  You&#039;ve found the right course!  </p>  <p style=\"\">  \t  As of March 2014, more than 49.5% of LinkedIn users have under-performing personal brands on the network. A variety of reasons contribute to that. Their profiles are incomplete. Their status updates under-perform. Their networks are too small for what they want to accomplish.  </p>  <p style=\"\">  \t      However, LinkedIn has become a powerful resource for me, as I’ve used it to launch many of my businesses, services and products, and I’m looking forward to teaching you how you can do the same.  </p>  <p style=\"\">  \t      One of the most important elements in using LinkedIn successfully is to have a profile that LinkedIn’s search engine loves (that means that your profile is optimized with keyword-rich content), and that compels the reader to want to know more, while already telling them enough about you to know, like and trust you.  </p>  <p style=\"\">  \t  So, welcome to The Bite-Sized Marketer’s <em style=\"\">LinkedIn Mastery </em>series, where the first course in the series shows you how to Create an Awesome Profile.  </p>  <p style=\"\">  \t      I hope you enjoy it!  </p>", 
    "end_date": null, 
    "title": "LinkedIn Mastery: Creating an Awesome Profile", 
    "price": "40.00", 
    "instructors": "Tara R. Alemany", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334038_1a8a_3.jpg", 
    "course_url": "https://www.udemy.com/linkedin-mastery-creating-an-awesome-profile/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T12:55:50Z"
}