{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Course Updated April 12th, 2016!</p><p><em>Over 4,821 students enrolled! Join us and get an amazing LinkedIn profile!</em></p>\n\n<p>+++++++++++++++++++++++++++++++</p>\n\n<p><em><strong>LinkedIn Profile Pro </strong></em><strong>is a 1-Hour course that will teach you the steps you can take today that will get you an amazing LinkedIn profile within an hour or so.</strong> </p>\n\n<p>I challenge you to take these steps today and see how high your LinkedIn profile will rank among your connections. </p>\n\n<p>These are the exact same steps I used to get my LinkedIn profile into the top 7% on LinkedIn (I show proof of this in the video intro). </p>\n\n<p>This short course can be completed and you will have an amazing LinkedIn profile within the hour.</p>\n\n<p><strong>Here is what you will get in this course:</strong></p>\n\n<p><strong></strong>1. A 5-step system to upgrade your LinkedIn profile instantly.</p>\n\n<p>2. A simple way to automatically add hundreds of connections your LinkedIn profile with a few clicks.</p>\n\n<p>3. A simple template for updating your headline, summary and work experience to get more leads and connections.</p>\n\n<p>4. No fluff. I only included the things that would get you the maximum impact for your time.</p>\n\n<p>I have spent over two years and several thousand dollars learning and perfecting the LinkedIn strategies I will share with you. You will be able to get the same results I have gotten for a fraction of the time and cost.</p>\n\n<p>Here is why this system is so effective. I have made this course very streamlined.</p>\n\n<p>This course will teach you the most effective strategies that you can easily learn and implement as you go through the course...no matter what your experience level with LinkedIn.</p>\n\n<p>I know first-hand the power of having an effective professional profile on the world's most powerful social media platform for business. I will help you get there.</p>\n\n<p>Don't miss any more business by not having a highly-effective LinkedIn profile....</p>\n\n<p>Get this course and start getting results from your LinkedIn profile today!</p>\n\n<p>See you on the inside :)</p>\n\n<p>Josh</p>", 
    "end_date": null, 
    "title": "LinkedIn Profile - How to Get an Awesome LinkedIn Profile", 
    "price": "20.00", 
    "instructors": "Josh Gwin, MBA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625034_2ace_2.jpg", 
    "course_url": "https://www.udemy.com/linkedin-profile-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T19:18:34Z"
}