{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t                  Join over 1300 students taking this course and find out you can set up a professional-looking LinkedIn profile that gets you found by recruiters looking for someone with your knowledge, skills and experience. All the course videos are being updated to ensure that your have access to the most current information on the application. Don’t forget, you get lifetime access.  </p>  <p style=\"\">  \t                  ++++++++++++++++++++++++++  </p>  <p style=\"\">  \t                  Did you know that in 2012:  </p>  <ul style=\"\">  \t<li style=\"\">93% of recruiters used LinkedIn to recruit for permanent and temporary jobs</li>  \t<li style=\"\">77% of all job openings were posted on LinkedIn and 48% were ONLY posted there</li>  \t<li style=\"\">19% of jobseekers had a contact share a job</li>  </ul>  <p style=\"\">  \t                  LinkedIn is the ultimate job seekers tool, being a combination of what you know and who you know!  </p>  <p style=\"\">  \t                  This course will teach you how to set up an account, build an all-star profile and connect strategically to people you know, and people you’d like to get to know, on a professional basis. Take the time to build relationships with people who will remember your name, and think of you when they hear of a job that would suit you.  </p>  <p style=\"\">  \t                  Click the &quot;take this course&quot; button, top right, now... every hour you delay means someone else is getting the job that you want.  </p>  <p style=\"\">  \t            ***Note: I&#039;m adding new content to this course, the sound issues have been resolved and so from 1st November, this course will no longer be free.***  </p>  <p style=\"\">  \t                  Karen  </p>", 
    "end_date": null, 
    "title": "LinkedIn 101: The ultimate beginners guide for Job Seekers", 
    "price": "25.00", 
    "instructors": "Karen Brown", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147160_95ef_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-set-up-a-linkedin-account/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-15T08:07:42Z"
}