{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Knowing how to effectively leverage the power of LinkedIn can do wonders for your personal profile, your business, product/service and/or brand. With the right knowledge, you can build your personal and/or business profile on LinkedIn with very little cost and often for free. But you have to know how to build a great profile and what best practices to use with LinkedIn. That&#039;s where this course comes in. With this course you will gain the necessary knowledge and tools to put the power of LinkedIn to work for you. Set it up and watch the magic happen. </p><p style=\"\"><strong style=\"\">Learn to master the most underused social media platform in this comprehensive course.</strong></p><ul style=\"\"><li style=\"\">Understand the true power of LinkedIn marketing</li><li style=\"\">Carefully craft your headline in a very specific way to get results</li><li style=\"\">The importance of a great profile picture</li><li style=\"\">What to do before you jump right into putting your business on LinkedIn</li><li style=\"\">Create the right visual style across your channels</li><li style=\"\">Impact dramatically where you show up in LinkedIn&#039;s search results</li><li style=\"\">Set up your personal page for LinkedIn marketing success</li><li style=\"\">Set up a business page for LinkedIn marketing success</li><li style=\"\">Use a little known feature within LinkedIn to SUPERCHARGE your connections</li><li style=\"\">Get quality endorsements for yourself or your business</li><li style=\"\">Distinguish the difference between a contact and a MEANINGFUL contact</li></ul><p style=\"\"><strong style=\"\">Build a successful LinkedIn profile for yourself and your business.</strong></p><p style=\"\">This course will cover everything from setting up a brand new profile to editing an existing profile to adding a business profile. We will explore what a great profile picture is, what a great headline is as well as several other extremely important aspects of your profile such as improving your search results, getting connections, endorsements and contacts.</p><p style=\"\">You will receive access to our 10 video library with step-by-step instructions and precise actions to take. Follow along as we log into a live LinkedIn account and set it up. Look over our shoulder as you set up or update your own LinkedIn profile. You will also receive access to the PDF training guide, cheat sheet, mind map and resource guide. We also have some sweet bonus surprises inside.</p><p style=\"\">This course is designed with both beginner and established LinkedIn users in mind and goes into details about the most important features to focus on for maximum results. </p><p style=\"\">When you are done with this course you will have a LinkedIn profile that your friends and colleagues will be jealous of. </p>", 
    "end_date": null, 
    "title": "LinkedIn: You're Doing it Wrong!", 
    "price": "20.00", 
    "instructors": "Endeavor Consulting", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/549524_7a82_12.jpg", 
    "course_url": "https://www.udemy.com/linkedin-youre-doing-it-wrong/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-08T22:36:45Z"
}