{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"><p style=\"\">This LinkedIn Training MasterPlan course is designed for anybody that  wants to learn how  to use LinkedIn to  grow their Business. Whether you are a newbie or an expert, there are tips in  every video from a marketing perspective and also a general user’s perspective.</p>    <p style=\"\">The LinkedIn Training MasterPlan Course is made up of very short but  concise videos showing the main points and covering them succinctly... there is  no Fluff.&nbsp; At the end of each section,  there is a Quiz to test your knowledge and see what you have learnt.</p>    <p style=\"\">This LinkedIn training course should take you about 2 weeks to complete if  you were to implement everything that is in there.</p>    <p style=\"\">The LinkedIn training course is structured around the Linkedin Platform  and it has an easy to follow step by step guide to show you where you are in  each section</p>    <p style=\"\">If you are in Business, or your Job relies on you  making new contacts and networking, then LinkedIn is the most Powerful way to  do this... don&#039;t miss these tips and tricks that have taught thousands of  people how to harness the power of LinkedIn</p>    <p style=\"\">Take this LinkedIn Training now and learn how to LinkedIn use for your business to  get most out of it.</p>&lt;/p&gt;<p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "LinkedIn MasterPlan", 
    "price": "35.00", 
    "instructors": "Andrew McCauley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/39993_c3b8_4.jpg", 
    "course_url": "https://www.udemy.com/linkedinmasterplan/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-04T19:44:03Z"
}