{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Las redes sociales en Internet son un canal de comunicación cuya importancia ha crecido de manera exponencial en los últimos años.<strong style=\"\">&nbsp;</strong>Es un hecho que la recomendación personal de los usuarios en las redes sociales es mucho más poderosa y efectiva que cualquier tipo de publicidad tradicional. Por ello, el marketing aplicado a las redes sociales o <em style=\"\">Social Media Marketing</em> potenciará el éxito de toda empresa.</p><p>Con este completo curso de&nbsp;<strong style=\"\">Marketing en Redes Sociales</strong> usted aprenderá a dominar las redes sociales como canales de comunicación y marketing para promocionar su negocio, sitio web o marca personal, a establecer una presencia efectiva en dichos canales y a generar una comunidad fiel en torno a su empresa.</p><p><strong style=\"\">El curso incluye los siguientes módulos:</strong></p><p>- Aspectos generales sobre el Marketing en Redes Sociales</p><p>- Módulo Marketing en Pinterest</p><p>- Módulo Marketing en Youtube</p><p>- Módulo Marketing en Facebook</p><p>- Módulo Marketing en Twitter</p><p>- Módulo Marketing en Google Plus</p><p>- &nbsp;Tutoriales de las principales herramientas de gestión, productividad y monitorización de redes sociales: HootSuite, SocialBro, Klout, IFTTT, SocialFolder, TwitterFeed, SocialMention, etc...</p><p>Pago único y <strong style=\"\">actualizaciones gratuitas</strong>. Disponible para su consulta on-line desde cualquier dispositivo y también para su descarga para que pueda aprender a su propio ritmo.</p>  ", 
    "end_date": null, 
    "title": "Marketing en Redes Sociales", 
    "price": "25.00", 
    "instructors": "Juan Jose Ramos", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25265_6a16_5.jpg", 
    "course_url": "https://www.udemy.com/marketing-redes-sociales/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-23T10:59:08Z"
}