{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>The #1 Marketing Funnel for Coaches, Consultants, and Freelancers that want to close high-ticket clients.</strong><strong><br></strong></p><strong><em>This is a </em></strong><p> ‘fix it and forget it’ automated marketing system that you can turn on and off. This will be exciting to coaches that are sick of giving away their information for free with blogs and lead magnets in the hopes of building a list that will eventually buy something.\n\n</p><p>This system gives coaches that have high ticket programs valued over $3,000, a machine to drive cold leads to them even while they sleep and leads to 5 new clients within a month of implementation.  It leverages Facebook which is one of the most powerful forms of advertising today.</p>\n\n<p>The marketing spend and revenue of six and seven figure coaches is often a mystery leaving coaches spending hundreds of thousands of dollars. That ends today.</p>\n\n<p>This advertising course offers an entire marketing funnel with cutting edge recommendations to save you time and money on advertising and solid income projection information you can use. </p>\n\n<p>You will also get the secrets of a high-performing and a $5 test marketing technique that will get you on track to great sales overnight.</p>\n\n<p>The course also includes templates for the ad, website landing page, and webinar so you can plug-and-play immediately. </p>\n\n<p>This course is a step by step guide that tells you exactly how to make an ad, select your target market, run cheap test marketing, and create the rest of the automated marketing funnel that bring pre qualified cold leads straight to a consultation with you as fast as humanly possible. </p>\n\n<p>While Facebook is a free social media platform, it has over 187 million users, and thousands of way to target market and select an audience, this reliable and automated paid advertising campaign will ensure you become a leader in your marketplace.</p>\n\n<p>This course also helps you create programs that people want by identifying audiences for your information allowing you to tailor directly to what your hungry target market wants. </p>", 
    "end_date": null, 
    "title": "Marketing for Coaches: High Ticket Clients", 
    "price": "50.00", 
    "instructors": "Karen Gurney", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709174_868f_6.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-coaches-freelancers/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T00:42:03Z"
}