{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Google My Business is an absolute must for any small business, but many steer away from it or put it off. With this course, you can finally knock out the few simple steps it takes to optimize your Google My Business account and increase your footprint on the web. Our step-by-step process takes you from start to finish, making Google My Business an asset to your company.</p><p style=\"\">The course is straight forward with screen captures and very clear instructions on how to set up your account, create a profile, and get started with Google My Business. That is where most people stop thinking they are done! After the basics, I&#039;ll show you what your competitors aren&#039;t doing and enable you to be sure your Google My Business account is fully optimized. </p><p style=\"\">I decided to keep the course short as I aim to be direct and to the point. Many courses on Google My Business have fluff that wastes time and isn&#039;t applicable to the task at hand. There is just over 30 minutes of video in this course. With that, it will take you about 30 minutes on Google My Business to get set up using what I show you. In under 90 minutes, you&#039;ll be fully optimized.</p><p style=\"\">Take this course if you&#039;re interested in getting this task done quick. For many, Google My Business stays on their to-do list as it seems daunting and time consuming. Let my years of experience cut through the confusing parts and get your business on track.</p><p style=\"\">Thank you and enjoy the course.</p>", 
    "end_date": null, 
    "title": "Mastering Google My Business", 
    "price": "20.00", 
    "instructors": "Steve Boerner, David Gritz", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577936_e987_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-google-my-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T10:07:54Z"
}