{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<div style=\"\">  \t<p style=\"\">  \t\tI am on a mission to untangle the complex web of social media for my business clients. I run regular workshops showing them how to build brand exposure using social networking sites like Facebook.  \t</p>  \t<p style=\"\">  \t\tI have spent my career building solid, long-term business relationships. After continually encountering businesspeople bewildered by Internet technology, I decided to apply my tech and business networking experience to social media, and founded Web Friendly, a company that teaches a smart approach to this online phenomenon.  \t</p>  \t<p style=\"\">  \t\tIn its early days, Internet marketing was purely a numbers game, but things have evolved. Social media capitalizes on the quality and longevity of online relationships, rather than on mere volume. I understand these nuances, and I apply that knowledge to help clients produce tangible results.  \t</p>  \t<strong style=\"\">After years of studying Facebook Marketing, I’ve managed to:</strong>  </div>  <ul style=\"\">  \t<li style=\"\">Earn $1000+ by spending $40 on Facebook Ads several months in a row  </li>  \t<li style=\"\">Use Facebook ads to attract leads at $1.50 per lead or less in almost every industry  </li>  \t<li style=\"\">Use Facebook ads to get 1000&#039;s of TARGETED Fans for fractions of pennies  </li>  \t<li style=\"\">Make over $1800 in sales in a couple days from a<em style=\"\">single</em> Facebook update (a technique that my students used to generate similar results)  </li>  \t<li style=\"\">Build a really strong Facebook presence using Facebook Ads spending only $1 a day! </li>  </ul>  <p style=\"\">  \t<strong style=\"\">I’ve also consulted with Small Businesses and helped them:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Get 3,000+ downloads for their free ebook in under 3 months  </li>  \t<li style=\"\">Earn $25,000 in one summer using my carefully developed strategies for a brand new one-person business  </li>  \t<li style=\"\">I’ve helped businesses generate 1000’s of new Fans in just a few short weeks spending only PENNIES per Fan using Facebook Ads  </li>  \t<li style=\"\">And unexpectedly helped one student have lunch with a major Canadian celebrity, and get featured on Forbes.com!</li>  </ul>  <div style=\"\">  \t<div style=\"\">  \t\t<div style=\"\">  \t\t\t<div style=\"\">  \t\t\t\t<p style=\"\">  \t\t\t\t\t<strong style=\"\">The results I’ve achieved is a measure of what effective Facebook Marketing can do for YOUR business</strong>  \t\t\t\t</p>  \t\t\t\t<p style=\"\">  \t\t\t\t\tBut as you&#039;ve probably experienced for yourself, achieving success on Facebook can be <em style=\"\">easier said than done</em>, either due to the lack of correct information, information overload, or the limited amount of time you have as a business owner.  \t\t\t\t</p>  \t\t\t\t<p style=\"\">  \t\t\t\t\tI was lucky back then...  \t\t\t\t</p>  \t\t\t\t<p style=\"\">  \t\t\t\t\tI was helping businesses with their online marketing and Facebook was becoming a big part of the “Internet”. I was under the pressure to stay relevant so I had to make time to find out what really works with Facebook marketing.  \t\t\t\t</p>  \t\t\t\t<p style=\"\">  \t\t\t\t\tI know that most small business owners probably don’t have that kind of time to spare.  \t\t\t\t</p>  \t\t\t\t<p style=\"\">  \t\t\t\t\tSo I wanted to create a solution for this.  \t\t\t\t</p>  \t\t\t\t<p style=\"\">  \t\t\t\t\tI wanted to create a simple solution to help smart, but overwhelmed and frustrated small business owners to quickly use Facebook marketing to generate leads for their business.<br style=\"\">  \t\t\t\t\t<br style=\"\">  \t\t\t\t\tThis course equates to over 8 hours of top-level Facebook Marketing training incuding a full 1 hour video on Facebook Advertising which details a dollar-a-day advertising blueprint every business should know.  \t\t\t\t</p>  \t\t\t</div>  \t\t</div>  \t</div>  </div>", 
    "end_date": null, 
    "title": "New Facebook for Brands Workshop, with Web Friendly", 
    "price": "45.00", 
    "instructors": "Matt Astifan", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101238_e55d_5.jpg", 
    "course_url": "https://www.udemy.com/facebook-for-brands-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-04T00:26:15Z"
}