{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul style=\"\"><li style=\"\">The course is all about teaching online, inside I will be teaching you on how to structure and make your course properly in order for you to make a good, strong and more understandable course online. I will be showing you 2 types of presentation 1st. Is and all the important things that you shall remember before even making your  powerpoint presentation 2nd. Is the basics and important parts to remember on making your video presentation in order for it to look more presentable than ever before.</li><li style=\"\">Materials include only an internet connection and a good personal computer, any types of personal computer will do.</li><li style=\"\">The course is structured by video and powerpoint presentations this will help all the students to further understand the course more appropriately and easily as possible. They can also download all the powerpoint presentation notes in order for them to follow the course outline properly.</li><li style=\"\">You shall take this course for it will be teaching you all the things that you need to know about online teaching. This course will also help you on how you shall make your own course if you plan on making one. When enrolling you will be able to change your perspective on how to make your own course and start earning money online.</li><li style=\"\">Also in this course I am going to teach you on how to market your course using social media sites such as facebook and twitter to improve your marketing strategy of getting more students online.</li></ul>", 
    "end_date": null, 
    "title": "Online Business: Tips for Success for All Levels", 
    "price": "20.00", 
    "instructors": "Edgar Tomo", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471772_8db7.jpg", 
    "course_url": "https://www.udemy.com/online-business-tips-for-success-for-all-levels/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T10:56:23Z"
}