{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t Learn how you can use the Internet and Social Media to promote and grow your local business, interact with current and potential clients and dominate the local online presence for your business type.  </p>  <p>  \t We'll start by helping you craft your communication about your business by developing a unique selling proposition (USP) and create a Core Story or Stadium Pitch you can use to effectively tell people about what you do. You'll learn how education-based marketing is the best way to convince people to do business with you.  </p>  <p>  \t If you don't have a web site, you'll learn how to get an effective website, how to structure it and how to optimize it so Google and other search engines can index it properly. You'll also learn how to use keywords in your web presence so you are being found by people looking for what you sell.  </p>  <p>  \t You'll learn how to setup an email list for ongoing marketing and how to blog effectively.  </p>  <p>  \t You will get your business setup on Google, Facebook, Twitter and LinkedIn and you'll learn how to save time using Hootsuite to manage your social media presence and interactions.  </p>  <p>  \t You'll also learn why Pay-Per-Click (PPC) advertising is the best form of paid advertising and how to setup a campaign on Google Adwords and on Facebook.  </p>  <p>  \t Most of the techniques reviewed are completely free and the few paid options are clearly explained so you can control how much you spend on marketing online. All you need is the desire to grow your business and reach out to people online.  </p>", 
    "end_date": null, 
    "title": "Online Marketing For Your Local Business Made Simple", 
    "price": "50.00", 
    "instructors": "Eric Poulin", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51879_b840_6.jpg", 
    "course_url": "https://www.udemy.com/local-marketing-using-the-internet-and-social-media/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-01T07:00:51Z"
}