{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">Maximum Exposure</strong></p><p>Periscope is only a few months old, but already has millions of users, with thousands more joining each day. Yet with the right approach, you can still easily gain the attention of movers and shakers on the platform, leveraging their success to build your own.</p><p>Learn everything you need to get off to a great start from day one, and grow a community of fans who are tuning in just to hear what you are offering, again and again and again. </p><p><strong style=\"\">Connection and Community</strong></p><p>Finally find your &quot;tribe&quot; so that your message can get the exposure it needs to get traction and take your personal or professional brand to the next level. </p><p>Not to mention having a loving and supportive community ready to tune in and interact whenever you&#039;re ready to hit &quot;broadcast,&quot; no matter where you are or when the inspiration may strike you. </p><p><strong style=\"\">Fun, Fun, Thoroughly Addictive Fun -- the way marketing should be!</strong></p><p>Come on and join the fun, and make real progress with your PR/marketing at the same time. </p><p>Magnetize your target audience instead of chasing them, and finally let the raw and real you be your defining advantage.</p><p><strong style=\"\">Why Periscope?</strong></p><p>You&#039;ve heard about live streaming apps, but which one should you try? </p><p>Periscope is the fastest growing free live streaming app, and is building an undeniable momentum. Now is the time to get in on the ground floor and build your community with maximum exposure and minimal competition in your niche.</p>", 
    "end_date": null, 
    "title": "Periscope Essentials - Build Your BRAND and Find Your TRIBE", 
    "price": "30.00", 
    "instructors": "Awaken,  LLC", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571380_5c6b.jpg", 
    "course_url": "https://www.udemy.com/periscope-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T03:42:23Z"
}