{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Vamos Tornar a sua empresa irresistível nas Redes Sociais!</strong></p><p>Periscope é uma nova Rede Social que está revolucionando a maneira como as pessoas se comunicam com seus seguidores e clientes. Periscope funciona com transmissões de Video ao Vivo alcançando milhares de pessoas no mundo inteiro e no Brasil. </p><p>A hora de se juntar ao Periscope é AGORA! <strong>Clique no botão azul “Visualizar”</strong> para ver a prova de por que você precisa para começar a utilizar o Periscope hoje mesmo!</p><p>Convido também que de uma olhada no currículo do curso para ver qual é a receita que vamos utilizar para Dominar as Redes Sociais com o Periscope. </p><p>Neste curso você vai aprender tudo sobre Periscope, desde o básico até Avançado!</p><p><strong>Aqui estão alguns tópicos que vamos abordar durante o curso:</strong></p><ul><li>Como usar Periscope como um Pro!</li><li>Como Colocar seu video na primeira página do YouTube!</li><li>Como Colocar seu video na primeira página do Google!</li><li>Como duplicar o numero de pessoas que você atinge com os seus Posts no Facebook!</li><li>Aumentar o numero de inscritos na sua lista de e-mails, mais clientes e mais seguidores.</li><li>Como Escolher o nome de Usuário perfeito, e o que levar em conta.</li><li>Como criar Títulos Irresistíveis para seus Periscopes.</li><li>Você receberá grátis um documento com títulos incríveis que convertem muito bem.</li><li>Vai fazer Download de um Template exclusivo que vai divulgar suas Redes Sociais de forma automática.</li><li>4 Super Dicas que vão fazer diferença no seus Periscopes.</li><li>Você vai conhecer 3 estratégias para backup Ilimitado e Gratuito de seus Periscopes.</li><li>Como organizar o seu primeiro Periscope, o que levar em conta.</li><li>Corações!!! porque eles são a parte mais importante do Periscope e como utiliza-los como feedback do seu Marketing e da sua mensagem.</li><li>Terá acesso aos equipamentos VIP de Periscope.</li></ul><p>E muito muito mais…</p><p><strong>Vamos começar a dominar as Redes Sociais?</strong></p><p><strong>Clique no botão \"Fazer este curso\"!</strong></p><p>Nos vemos no curso.</p>", 
    "end_date": null, 
    "title": "Periscope - Divulgue a sua empresa nas Redes Sociais", 
    "price": "20.00", 
    "instructors": "Diego Davila", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662372_1e58_2.jpg", 
    "course_url": "https://www.udemy.com/cursoperiscope/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T19:54:26Z"
}