{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Social Media Marketing Funnel from Scratch with Periscope!</strong></p>\n\n<p><strong>The Complete Guide to help you create your Social Media Marketing Funnel from Scratch! </strong><br>People only buy products from companies or people that they know, if your prospects does not know you, they wont buy from you. That's how the human mind works.</p>\n\n\n\n<p>That's why is so important to create a relationship with your prospects before they became customers. Most people (and companies) do not use all the tools they have today available for FREE, most of the Social Media platforms are totally free today, and you can use that to your advantage.</p>\n\n\n\n<p>In this course you will learn how to create a complete Social Media Marketing Funnel step by step, and how to use that to create that important relationship with your prospects.</p>\n\n\n\n<p><strong>This course have 2 main Sections:</strong></p>\n\n\n\n<ul><li><strong>Section 1: </strong>Is about Periscope, how to became a Periscope Pro!</li><li><strong>Section 2: </strong>is about Creating your Social Media Marketing Funnel step by step.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>You will watch over my shoulder as we start building an amazing Social Media Marketing strategy for your company or your product. We'll forward your Periscope viewers to your Opt-in Page,</p>\n\n\n\n<p>Yes! You will learn how to create high converting Landing page and Opt-in page where your customers and prospects will enter their name and email, this information will be stored in the Autoresponder server,</p>\n\n\n\n<p>Yes! we'll sign for an autoresponder service for free that will store all your customer's information. So you will have a huge database of all your customers and prospects that you can use to communicate and keep constant contact with them.</p>\n\n\n\n<p>Remember, your Email List is the most important thing in this Online Marketing Funnel, and the better is your relationship with this list, the more they will like to buy your product or service! That means more sales, more money, more exposure!<br></p>\n\n\n\n<p>You will Create an Insanely Awesome Website to promote your Scopes and promote your Company, your products and yourself.</p>\n\n\n\n<p>I get asked this question all the time: <em><strong>How do I get started online?</strong></em><br></p>\n\n\n\n<p>And this is my answer: <em><strong>Build your own website and immediately publish valuable content</strong></em><strong>. </strong>Do you know what’s amazing? You can do that – get hosting, set up WordPress on your own domain and start a business in just Minutes! You will learn all that in the course.</p>\n\n\n\n<p>If you want to sell more, have more clients, promote your company, your product, your brand or your website, this is an Amazing course that will teach you step by step how to create your Complete Social Media Marketing Funnel.</p>\n\n\n\n<p>You can use these techniques for any Social Media site, Youtube, Facebook, Twitter, and specially on Periscope!<br></p>\n\n\n\n<p>No prior knowledge is require in order to follow the course. All you need is the desire to learn and have fun, with that, and the strategies I'll teach you in the course, we'll see your online Success!</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Periscope Marketing 2016", 
    "price": "20.00", 
    "instructors": "Diego Davila", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615778_16dd_4.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-periscope/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T13:29:41Z"
}