{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Let&#039;s Increase your Social Media Presence Now!</strong></p><p style=\"\"><strong style=\"\">Periscope</strong> is an Amazing (and New) <strong style=\"\">Social Media Live Streaming application</strong> that is revolutionizing the way that people communicate with their audiences. Is a great and new way to increase your Social Media community.</p><p style=\"\">Now is the time to Join to Periscope. <strong style=\"\">Check the Free Previews below to see the proof of why you need to start Periscoping Today!</strong></p><p style=\"\">In this course you will learn everything about Periscope, from the basics to advance! That will help you to grow your social media presence very easily and very fast! </p><p style=\"\"><strong style=\"\">Here are some topics that we will cover during the course:</strong> </p><ul style=\"\"><li style=\"\">How to use Periscope like a Pro!</li><li style=\"\">You will learn How to Use Periscope to engage with People and Increase your email list</li><li style=\"\">You will learn Things you need to consider BEFORE choosing your Periscope Username</li><li style=\"\">You will learn how the right Title on your Periscope can increase exponentially the number of viewers</li><li style=\"\">You will receive for FREE a document with amazing Titles that convert very well</li><li style=\"\">You will learn what&#039;s the best way to engage with your viewers in Periscope</li><li style=\"\">You will learn why Periscope is the Future of Social Media</li><li style=\"\">You will Access to a FREE Template that you can use and customize to rock your Marketing in Youtube and Facebook using your recorded Periscope</li><li style=\"\">You will learn 3 essential Tips that will differentiate your Periscopes</li><li style=\"\">You will learn 3 strategies to Backup your Periscopes so you can re-use it for Marketing in your Social Media</li><li style=\"\">You will learn How to use your Periscope Description as a Marketing Tool</li><li style=\"\">You will learn how often and at what time of the day is better to Periscope</li><li style=\"\">I&#039;ll help you to organize your First Periscope</li><li style=\"\">Hearts have a great value in Periscope, you will know why!</li><li style=\"\">You will learn Amazing Marketing Strategies</li><li style=\"\">You will have access to the Best Periscope Gear.</li><li style=\"\">And much much more about increasing your Social Media presence</li></ul><p style=\"\">Let&#039;s start building your Periscope Community Now!</p><p style=\"\"><strong style=\"\">Click the “Take this course Now&quot; button!</strong></p><p style=\"\">See you inside the course.</p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Periscope Secrets: Grow your Brand and Social Media!", 
    "price": "20.00", 
    "instructors": "Diego Davila", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595228_3275_3.jpg", 
    "course_url": "https://www.udemy.com/periscope/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T18:46:44Z"
}