{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course has everything you need to get started and learn to master the use of Periscope as an integral component of your professional marketing and communications strategy. </p><p><b>Leverage this new interactive, live video streaming application and its social network to build better relationships with your clients and attract new clients.</b></p><ul><li>Your clients, prospects, and referral partners are consuming online video every day. </li><li>Mobile video consumption and production growing rapidly.</li><li>Avoid being left behind by your competitors by learning the fundamentals of effective mobile video production and community management on Periscope.</li></ul><p><b>This course is packed with:</b></p><ul><li><em>Valuable Use Cases</em> - Forget abstract social media hypotheticals, with this course you'll learn how to put Periscope to work in your business.</li><li><em>Engagement Strategies</em> - Periscope is an interactive platform. In this course you'll learn how to attract and engage viewers in new and exciting ways.</li><li><em>Efficiency Tips</em> - As a professional you don't have a lot of time to waste putzing around. This course will teach you to use Periscope efficiently to expand your reach and create tangible business value.</li><li><em>Professional Quality Fundamentals</em> - The quality of your Periscope broadcast is a reflection of your professional brand. This course will teach you how to create high quality video and present yourself in a manner that will attract new business.</li></ul><p><b>Course Objectives and Presentation Style</b></p><p>Periscope for Professionals was created with a specific focus on helping you get up and running with ease. Mike Langford's presentation style is extremely friendly and approachable. The goal is for you to get comfortable with the concepts and become confident in your own ability to apply what you learn in the course in your own business endeavors. </p><p>The key takeaway is that Periscope holds the potential for tremendous value for your business. If you apply what you learn in this course you are sure to see a high return on your investment and your time. </p>", 
    "end_date": null, 
    "title": "Periscope for Professionals", 
    "price": "20.00", 
    "instructors": "Mike Langford", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588128_5eea_2.jpg", 
    "course_url": "https://www.udemy.com/periscope-for-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T05:18:07Z"
}