{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>THE ONE THAT NEARLY BROKE ME</strong></p><p><em>My very first paid udemy course</em> - <strong>Becoming a Creative Brand Advocate</strong></p><p>i'm so excited to share this course with you, to empower you and inspire you to take control of your online storytelling, your own personal seo that you carry with and amplify and storytell your own and other companies along the way.</p><p>this course is a brain dump from my mind to yours of hacks, tips, process and pipelines of what i consider before, during and after an event, conference or working on a social storytelling strategy for a brand.</p><p>i've tried to keep the course very 'chatty' on purpose. i want to humanise the content instead of giving you bullet points, i want you to see that i've actually done this and been through it rather than some niche i've discovered and learned about. this stuff i've actually done and used in the field. <em>AND YOU CAN TOO.</em></p><p>as this is my first paid course (one of many) it's also one that i'll be adding to all the time as i'm certain i've missed bits out, when you pay for this course you can be safe in the knowledge that i'll build upon it and you will continue to get more value, tips, real life execution and new cloud software that can help a creative like you get that message out.</p><p>i'm so excited to share my wisdom and knowledge with you.  purchasing my course helps me build out my online life and allows me to spend more time making better courses for you.</p>", 
    "end_date": null, 
    "title": "Personal SEO : Become a Creative Brand Advocate ", 
    "price": "20.00", 
    "instructors": "Mr Philip Campbell", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29434_68f6_4.jpg", 
    "course_url": "https://www.udemy.com/personal-seo-creative-brand-advocate/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-12T21:28:07Z"
}