{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t Pinterest has become one of the most frequently visited social media sites, and is among the top social media tools preferred by marketers.  </p>  <p>  \t <strong style=\"\">And for good reason. </strong>  </p>  <p>  \t Marketing with Pinterest can yield impressive results, often beating Facebook by leaps and bounds when it comes to product sales.  </p>  <p>  \t <strong style=\"\">And images shared to Pinterest have a much longer half-life than Facebook updates or tweets. </strong>  </p>  <p>  \t Research shows that the lag between pinning an image to Pinterest and visiting the website the image came from, can be up to 40 days!  </p>  <p>  \t <strong style=\"\">This condensed and comprehensive course helps you take advantage of this powerful marketing tool by teaching you how to use Pinterest to its full potential.</strong>  </p>  <p>  \t Business owners, entrepreneurs, marketers, social media strategists, and students will all benefit from taking this course.  </p>  <p>  \t Follow author, developer, and new media expert, Deltina Hay, as she walks you through the process of setting up and developing your optimized Pinterest presence in her typical no-nonsense teaching style.  </p>  <p>  \t <strong style=\"\">Using real-world examples, Deltina shows you hands-on how to:</strong>  </p>  <ul style=\"\">  \t<li>Create an optimized Pinterest business account and connect it to your website </li>  \t<li>Take advantage of all the features and options within the Pinterest platform </li>  \t<li>Set up collections of pins – called boards – and pin images and video to your boards</li>  \t<li>Use Pinterest tools and widgets to create galleries to place on your blog or website </li>  \t<li>Optimize the content on your blog or website for sharing on Pinterest </li>  \t<li>Make your content more sharable and embed product information on your images </li>  \t<li>Take advantage of the newest Pinterest features like place pins and hover buttons </li>  </ul>  <p>  \t <strong style=\"\">Worksheets and resources included!</strong>  </p>", 
    "end_date": null, 
    "title": "Pinterest Essentials in Under an Hour", 
    "price": "20.00", 
    "instructors": "Deltina Hay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165154_4586_2.jpg", 
    "course_url": "https://www.udemy.com/pinterest-essentials-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-16T12:58:10Z"
}