{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t      This course is going to be about Pinterest for business and we are going to explain that use in fact is more than posible to use this social media for your business strategy. We will start with &quot;Why&quot;. Why is a good idea to use Pinterest for your marketing strategy. Then we are going to really interesting concept cause the Inbound marketing methodology and then we show you a very creative examples of use for Pinterest that business people have actually made. Then we give you some tips and advise about what are good ideas and how to use Pinterest better to your advantage. In the end we provide you information about some of the best Pinterest tool that you can use and how you can use them better for your aims.  </p>  <p style=\"\">  \t<strong style=\"\">The course include the following video topics:</strong>  </p>  <p style=\"\">  \t    1. Why use Pinterest.  </p>  <p style=\"\">  \t    2. Inbound marketing.  </p>  <p style=\"\">  \t    3. The best way to use Pinterest  </p>  <p style=\"\">  \t    4. Pinterest - Tips and advice  </p>  <p style=\"\">  \t    5. Pinterest - Tools and Exaples  </p>  <p style=\"\">  \t<strong style=\"\">A few word about the author of this course Dessislava Dobreva:</strong>  </p>  <p style=\"\">  \t    I believe that if a person can learn to get out of his comfort zone as much as possible, he will have incredible experiences and develop personally in ways that are otherwise impossible.  </p>  <p style=\"\">  \t    I am really passionate about two things - foreign languages &amp; brand management  </p>  <p style=\"\">  \t    My greatest strengths:  </p>  <p style=\"\">  \t    - my motivation  </p>  <p style=\"\">  \t    - my ability to flourish in an international environment  </p>  <p style=\"\">  \t    - my writing &amp; presentation skills  </p>  <p style=\"\">  \t    - the fact that I am convinced that life is 10% what happens to me and and 90% how I react to it.  </p>  <p style=\"\">  \t    Creating an E-learning for Ecognise in 2 languages, called &quot;Turn your “don’t”-s into “do”-s: how to boost your business through social media&quot;. The product consists of videos, powerpoint presentations and articles on the forementioned topic, aimed at entrepreneurs who would like to better explore opportunities for promoting their business in Facebook, Pinterest, Google+, Twitter and Youtube.  </p>  <p style=\"\">  \t    And his motto is:  “GET OUT OF YOUR COMFORT ZONE!”  </p>", 
    "end_date": null, 
    "title": "Pinterest for business - more than possible", 
    "price": "20.00", 
    "instructors": "Slavi Slavov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410730_cd7a_3.jpg", 
    "course_url": "https://www.udemy.com/pinterest-for-business-more-than-possible/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T10:22:45Z"
}