{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>THE ULTIMATE BEGINNERS GUIDE TO PINTEREST MARKETING STRATEGIES</strong></p><p><strong>The course is fully updated for January 2016.</strong><br></p><p>Are you ready to get more business leads using Pinterest?</p><p><strong>Are you ready to build connections with customers?</strong></p><p>Enroll in the latest social media course with UNLIMITED &amp; LIFETIME access you will learn how to drive sales, attract new customers and master social media (the right way).</p><p><em><strong>UDEMY'S FULL 30 DAY MONEY BACK GUARANTEE.</strong></em></p><p>Pinterest has thousands of customers waiting for you.</p><p>The objective is to be everywhere. Create a unified front and gain followers across all social media channels.</p><p>This course is the ultimate beginners guide into Pinterest, brand new for January 2016.</p><p><strong>What does this course give you?</strong></p><ul><li>Introduction to Social Media</li><li>Social Media Strategy</li><li>Best Practices</li><li>Pinterest</li><li>Social Media Automation</li></ul><p><strong>The key is to create a brand that is consistent across all channels.</strong></p><p><strong>Certificate of completion</strong></p><p>All students who complete this course will receive a FREE digital 'Certificate of Pinterest marketing' issued by Skillhance &amp; Matt Bernstein, alongside Udemy's own certificate of completion.</p><p><strong>DON'T FORGET: Udemy operates a 30 day full money back guarantee, no questions asked! If you're not happy with this course you can request your money back.</strong></p><p>Click the <strong>\"Take This Course\"</strong> button straight away at the top right of this page because every second you delay is costing you money.</p>", 
    "end_date": null, 
    "title": "Pinterest Marketing Strategies: Build and Engage Followers", 
    "price": 0, 
    "instructors": "Skillhance, LLC, Matt Bernstein", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700134_7ab9_2.jpg", 
    "course_url": "https://www.udemy.com/pinterest-marketing-strategies/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T17:33:40Z"
}