{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p></p><p>This day in age there are\r\nso many social media sites and so many people on them that it becomes\r\noverwhelming, to say the least. Have you ever looked at the average user? Most\r\nare trying to make a social media presence for themselves, or have\r\ntried, and barely succeeded, even after years of work. Have you seen a few with\r\nsuch a massive presence that you figured they had to cheat to get there?</p>\r\n\r\n<p>Well with Platform\r\nYourself, you will see that they didn&#039;t cheat, they just used what few people\r\nconsider, or even know about, to get them to where they are today.</p>\r\n\r\n<p>That is my goal with\r\nPlatform Yourself. To give back everything I know and learned along the way, so\r\nyou too can get out of the average users wasteland and rise up among the ranks\r\nof the social media world.</p>\r\n\r\n<p>This social\r\nmedia management course will work for anything, from social media to your\r\nwebsite. Heck, it works for basically any business. There are many things\r\npeople over look when starting to build their platform. Whether you want to\r\nsell books, products, your services or you are just looking to make a splash\r\nonline. Platform Yourself will teach you all the tools to get your there.</p>\r\n\r\n<p>Through the 8 P&#039;s of\r\nPlatform Yourself you will learn how to create a massive social\r\nmedia presence and continue to do so for years to come. While others teach you\r\nthe basics of creating a Twitter of Blog account, which is about as hard as\r\nsigning up for this course. I set out to teach you how to not just create a\r\nsimple Twitter account, but how to expand it and use the 8 P&#039;s to breathe a\r\nwhole new sense of life into it.</p>\r\n\r\n<p>The social\r\nmedia management course is structured so you can start building your platform\r\nfrom the very beginning, wasting no time and adding each P along the way. The\r\ncourse itself you can complete in two hours max, but to implement everything\r\ninto your platform will take some time.</p>\r\n\r\n<p>Why take this course?</p>\r\n\r\n<p>You should take this course\r\nif you are looking to:</p>\r\n\r\n<p>Get in front of a larger\r\naudience</p>\r\n\r\n<p>Want to sell anything from\r\na book to yourself</p>\r\n\r\n<p>Create an online presence</p>\r\n\r\n<p>Learn more about the\r\nbusiness world</p>\r\n\r\n<p>Or if you are looking to go\r\ninto the business of helping people create social media anything.</p>\r\n\r\n<p>When combined the 8 P&#039;s of Platform Yourself: Presentation, Perception, Promotion, Participation, Plantation, Performance, Proven and Planning will come together to give you a platform you never thought possible of creating, until now.</p><p></p>\r\n", 
    "end_date": null, 
    "title": "Platform Yourself: How To Make It Big Using Social Media", 
    "price": "20.00", 
    "instructors": "Patrick Hatt", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44779_117d_5.jpg", 
    "course_url": "https://www.udemy.com/platform-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-05T00:15:23Z"
}