{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Up to Date as of October, 2015.</p><p>Podcasting is booming! There has never been a better time to get 'On the Air'. Low start up costs and the massive improvements in electronics and technology means that if you can talk, are passionate and know something about your topic, you can host your very own show.</p><p>Fame and Fortune await, if you know how to run your show professionally.</p><p>From one of our students:</p><p><em>\"Thanks for the shout out Martin, or should I say thanks for the endorsement smile emoticon We went <strong>from 25k downloads of our show a month to 50k</strong> in 9 months using your suggestions and your training was very concise and easy to understand. This series has <strong>got me all jazzed </strong>again look out here we go again.</em><em>\"</em></p><p>No prior experience or formal broadcast education is required to be a talk show host or produce your own  show. Anyone can <strong>become a professional Podcast Host,</strong> if you have the proper guidance and mentoring.<br></p><p>Scott Paton and Martin Wales have <strong>over 30 years experience</strong>, and thousands of episodes under their belts when it comes to hosting shows and interviewing guests.</p><p>Let them share their expertise with you and <strong>shortcut the learning curve</strong> to becoming an exceptional host.</p><p><strong>Are you ready to become the next Larry King? Jay Leno? Opr</strong><strong>ah?</strong></p><p>In this fast-paced, fun course, you'll learn:</p><ol><li><strong>Th</strong><strong>e Do's and don'ts of being a Host</strong></li><li>What your job really is</li><li><strong>The best way to prep your guest</strong></li><li>How to interview and some great questions no one asks</li><li><strong>How to control the conversation</strong></li><li>And much more!<br><br>About this course:</li></ol><ul><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and changes are always yours for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's our personal promise of your satisfaction!</em></li></ul><p><strong>Click the \"take this course\" button, top right, now</strong> ... <em>every hour you delay is costing you fame and fortune</em>...</p>", 
    "end_date": null, 
    "title": "Podcast Host Masterclass", 
    "price": "40.00", 
    "instructors": "Scott Paton, Martin Wales", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482860_92b9.jpg", 
    "course_url": "https://www.udemy.com/podcast-radio-talk-host/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T04:46:07Z"
}