{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Successful podcasters often ask: \"<strong>How can I make money with my Podcast?</strong>\"</p><p>While there are numerous options, the simplest answer which truly leverages your existing relationship with your audience is: <strong>Coaching</strong>.</p><p>With <strong>over 9,100 students and 210 raving reviews</strong>, Scott Paton and Marc Mawhinney team up again to share how you can use your podcast to create one of the most fulfilling businesses in the world: Coaching.</p><p>Imagine the excitement you feel as you prepare to record your podcast. You know <strong>thousands of fans tune into every show</strong> to hear you, and learn from you. In that group are many people who want more. They want to master your topic, whether for career, business or personal reasons.</p><p>But have you ever wondered how you could <strong>help them more</strong>?</p><p><strong>Consider working with them one-on-one as their coach and mentor.</strong></p><p>According to Forbes Magazine: \"<strong>Coaching is hot</strong>. No doubt about it, coaching professionals is a booming business and one that shows little sign of cooling off. In fact, all indications are that the number of people holding themselves out as coaches will <strong>exponentially grow over the next few years</strong>.\"</p><p>In a recent survey of <strong>Fortune 100 companies</strong>: \"Among the benefits to the corporations of coached executives were improved:</p><ul><li>\"<strong>Productivity (reported by 53% of executives)</strong></li><li>Quality (48%)</li><li><strong>Organizational strength (48%)</strong></li><li>Customer service (39%)</li><li><strong>Reducing customer complaints (34%)</strong></li><li>Retaining executives who received coaching (32%)</li><li><strong>Cost reductions (23%)</strong></li><li>Bottom-line profitability (22%)\"</li></ul><p>As you can see <strong>coaching is becoming mainstream</strong> and as more and more executives discover the benefits, the rest of the population starts to follow.</p><p>Among <strong>the benefits to executives,</strong> who received coaching, were improved:<br></p><ul><li><strong>Working relationships with direct reports (reported by 77% of executives)</strong></li><li>Working relationships with immediate supervisors (71%)</li><li><strong>Teamwork (67%)</strong></li><li>Working relationships with peers (63%)</li><li><strong>Job satisfaction (61%)</strong></li><li>Conflict reduction (52%)</li><li><strong>Organizational commitment (44%)</strong></li><li>Working relationships with clients (37%)</li></ul><p>With your Podcast, <strong>you are in an ideal position</strong> to capitalize on this massive surge in coaching popularity, as you audience is actively looking for a coach.</p><p><strong>Why not you?</strong></p><p>In this <strong>fast paced, results-oriented</strong> course, two of today's top world-class coaches share how you can transition from a popular Podcaster into a popular coaching Podcaster and <strong>add a new income stream to your business.</strong></p><p>As your new coaches, we strongly suggest you click the \"Take This Course\" button, top right, now ... <strong><em>every second you delay is costing you money</em>...</strong><br></p>", 
    "end_date": null, 
    "title": "Podcast Coach: Podcasting Profits", 
    "price": "40.00", 
    "instructors": "Scott Paton, Marc Mawhinney", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603818_d97e_2.jpg", 
    "course_url": "https://www.udemy.com/podcasting-profits-coaching-for-dollars/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T07:52:29Z"
}