{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Imagine knowing a special group of Podcasters who are excelling in their careers and leaders in their field Now imagine that group offering you the very tips, and techniques, they've used, to <strong class=\"redactor-inline-converted\">build your podcasting audiences</strong>.</p>\n\n<p>The good news is, that group exists and <strong class=\"redactor-inline-converted\">NOW you can be part of this special group of podcasters.</strong></p>\n\n\n\n\n\n<p>This group is made up of Tracy Goodwin, Speaking coach, and Scott Paton, the Dean of Blogonomics and Podology. In addition to building relationships with fellow podcasters, as a <em>student or graduate of this course</em>, you're<strong class=\"redactor-inline-converted\"> entitled to personal contact</strong> with your instructors, unique, targeted training, personal mentoring, and lifetime access to this course.</p>\n\n\n\n\n\n<p><em>Podcast Pacing For Audience Engagement</em> gives you the knowledge and the confidence you need to <strong>be successful in any Podcast niche</strong> you choose as you use the power of your voice to grow your audience, influence thought leaders and engage with your tribe in ways you never thought possible.</p>\n\n\n\n\n\n<p>This course is for the podcaster who is ready to take your content, and the delivery of it, to the next level as you<strong class=\"redactor-inline-converted\"> learn key strategies in pacing</strong> which is crucial in podcasting for audience connection, and for the overall delivery and assimilation of your material.</p><p>In this course, you will learn:</p>\n\n<ul><li><strong class=\"redactor-inline-converted\">What pacing is</strong></li><li>Why pacing is important</li><li><strong class=\"redactor-inline-converted\">What pacing can do for you and the listener</strong></li><li>How to use pacing to hook and keep the listener</li><li><strong class=\"redactor-inline-converted\">How to use pacing to show value and stress to the audience so they know what is important</strong></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Pacing sets the tone for the show, for our personality and for the ride the listener will be on with this.  Pacing is <strong class=\"redactor-inline-converted\">essential</strong> for getting the listeners attention, hooking them in and then captivating them throughout the experience. </p><p>You have a full 30 day guarantee, so there is no risk in taking the course.</p>", 
    "end_date": null, 
    "title": "Podcast Pacing For Audience Engagement", 
    "price": "20.00", 
    "instructors": "Scott Paton, Tracy Goodwin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794064_5d07_2.jpg", 
    "course_url": "https://www.udemy.com/learn-podcast-pacing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T20:50:43Z"
}