{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>Learn Podcasting with a Podcast Pioneer and Host/Executive Producer of over 40 different Podcasts! Everything you need to get started and a lot more...</strong></em></p>\n\n<p>  \t<em>****Course Up To Date As Of June 1st, 2016. New Lectures Added (#23: The Blue Yeti Microphone, #42 Add Your Podcast to Google Play and Android Phones, and Lecture #71: Bonus Lecture: Done For You Podcasting and Write a Bestseller at the Same Time)****</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">NEW SECTION: How to Start a Podcast with LibSyn!</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Liberated Syndication (libsyn) pioneered the system to host and publish podcasts in 2004. And since then has grown to<strong class=\"redactor-inline-converted\"> the largest leading  network with over 2.6 billion downloads in 2014. </strong>Libsyn hosts over 25,000 shows with 44 million monthly audience members.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>JOIN <strong class=\"redactor-inline-converted\">OVER 5000+ SUCCESSFUL STUDENTS</strong> WHO HAVE TAKEN THIS COURSE AND ARE LEARNING DIRECTLY FROM THE ONE AND ONLY DEAN OF BLOGONOMICS AND PODOLOGY, SCOTT PATON! </em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t        Discover how to make a Podcast - Fast, Easy and FUN! Join over 5500 students using <strong class=\"redactor-inline-converted\">Power Podcasting</strong> to position themselves as THE Expert, build relationships, grow their influence, increase sales, and change the world.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is a Podcast?</strong> It is audio or video shows, that when you subscribe to them, are automatically updated on your Computer, Smartphones, iPads, Tablets, and/or iPods. Think of them as free radio or TV shows which you deliver Spam-Free! directly to your audience every time you produce one.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                        Podcasting is bigger than you think. When we survey people who listen to free, commercial-free audio Podcasts at least once a month: we discover an interesting fact: <strong class=\"redactor-inline-converted\">Online Radio beats AM/FM Radio, streaming audio, CD's, TV Music channels, &amp; Sirius</strong>!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<blockquote>  \t<em><strong class=\"redactor-inline-converted\">\"Power Podcasting Rocks!\"</strong></em>  </blockquote>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<blockquote>  \t<em>\"Scott is friendly and <strong class=\"redactor-inline-converted\">easy to follow</strong>. He clearly knows his stuff. All the tools are here, and laid out in easy way. I think it is <strong class=\"redactor-inline-converted\">a great course! </strong>I was shocked at how popular this is. Great marketing tool that I overlooked. Great education.\" ~ Dan Kobelt</em>  </blockquote>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                        If you look at the number of people listening to these free shows monthly, <strong class=\"redactor-inline-converted\">they are as popular as Twitter with 39 mIllion listeners</strong>, even if it doesn't get the same 'Love'.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                        But instead of communicating in impersonal 150 character Tweets, with Power Podcasting, you get right into the head of your target market for as long as they let  you.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">                    They are portable — and because of this, they are more personal.  </strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                        Imagine whispering into the ears of your ideal customers every week... building strong relationships, trust and connections. But instead of One-to-One, <strong class=\"redactor-inline-converted\">Power Podcasting is One-to-Many! </strong>Our students know that Podcasting is relationship building in the sales process, and not the time to go for the hard close.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">These listeners are higher income earners. </strong>They listen daily to an hour and forty minutes more audio than the average American consumer. They are dedicated to continual learning, so just imagine what happens when <strong class=\"redactor-inline-converted\">your show is available on new cars all over the world...</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                              Power Podcasting \"allows you to <strong class=\"redactor-inline-converted\">convey your personality in a much stronger way than is possible through the written word</strong>. That clarity in your message is seen and felt through your actions (on video) and the tone of your voice...\" according to Chris Ducker, Author of #1 Bestseller 'Virtual Freedom'.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                              When you <strong class=\"redactor-inline-converted\">claim your seat in this course</strong>, you'll have permanent online access to <strong class=\"redactor-inline-converted\">watch the course 24/7</strong>, and there's a Q&amp;A discussion section in each lecture, where you can post questions - and I'll answer them personally!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                            By following the <strong class=\"redactor-inline-converted\">short, simple, easy-to-follow lectures</strong>, you will be able to work through the process of setting up your show and publishing your first episode quickly.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                            The course was designed to accomplish one goal: <strong class=\"redactor-inline-converted\">Start a  Podcast as fast as possible.</strong> I recommend watching the first 6 sections in their entirety. There are PDF workbooks included for you to use to clarify your topic, title, descriptions, intro and extros.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                          For 'Type A' personalities, there is a <strong class=\"redactor-inline-converted\">\"Fast Track\" Lecture</strong> (Section One, Lecture #6), in which if you already have a finished MP3 or MP4 file, reveals which lectures to watch so that <strong class=\"redactor-inline-converted\">after following only 33 minutes of video, you will have your show live</strong> and into iTunes. In other words, you can be up and running in under an hour.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                          The technical processes of  are only one aspect of <strong class=\"redactor-inline-converted\">successful Podcasting</strong>. Walk through <strong class=\"redactor-inline-converted\">real life examples of producing a live show</strong>, discover how to use your voice effectively to move your audience, uncover how to repurpose content for your podcast that you may already be doing, and <strong class=\"redactor-inline-converted\">how to do it FAST!  </strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                Power Podcasting \"will <strong class=\"redactor-inline-converted\">grow your email list, your audience, your influence and your bank account</strong>.\" Amy Porterfield of \"Tweet This\" and former Social Media Maven for social media for the likes of <strong class=\"redactor-inline-converted\">Harley Davidson &amp; Tony Robbins.</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                    Podcasts are growing rapidly, and thanks to <strong class=\"redactor-inline-converted\">CarPlay, Google Play and Apps</strong>, continue strong growth for years to come. It is just past the 'Early Adopter' stage and has huge potential moving forward. <strong class=\"redactor-inline-converted\">Don't miss out on the low-competition, high-demand opportunities that your fellow Power Podcasters are enjoying.</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<blockquote>  \t<strong class=\"redactor-inline-converted\"><em>\"Great content that kept my attention\"</em></strong>  </blockquote>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<blockquote>  \t<em>\"Scott is obviously very knowledgeable, experienced and <strong class=\"redactor-inline-converted\">shares great content.</strong> I am a beginner and he has <strong class=\"redactor-inline-converted\">inspired</strong> me to believe that even I can do this. Also, I find some of the other courses very boring and they lose me. This one doesn't. <strong class=\"redactor-inline-converted\">Scott makes it entertaining, easy and fun to learn.\"</strong> ~ Marion Baker</em>  </blockquote>", 
    "end_date": null, 
    "title": "Podcast Made Easy", 
    "price": "20.00", 
    "instructors": "Scott Paton", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45297_b0ac_5.jpg", 
    "course_url": "https://www.udemy.com/powerpodcasters/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-09T18:53:18Z"
}