{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course we will cover some of the nuances that <strong class=\"redactor-inline-converted\">make your podcasts stronger and more engaging</strong>. Connecting to your <strong class=\"redactor-inline-converted\">passion</strong> and expressing it are crucial to growing your Podcasts.  The elements of this Podcasting course are specific and dive deeper into the actual delivery of the podcast and how to connect that material to the audience. </p>\n\n<p>This course is for the podcaster who is ready to take their content and the delivery of it to the next level as they <strong class=\"redactor-inline-converted\">learn key strategies</strong> in passion which is key in podcasting<strong class=\"redactor-inline-converted\"> for audience connection</strong> and for overall delivery and assimilation of the material.</p>\n\n\n\n\n\n\n\n<p>Lastly, this Podcast Passion Masterclass covers <strong class=\"redactor-inline-converted\">the dynamics of passion</strong> and the how’s and why’s of stepping into one’s own passion and utilizing it to connect with and engage the audience.</p>\n\n\n\n<p>In this course, we will talk all about passion and discover:</p>\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">What it is</strong></li><li>Why it’s so important</li><li><strong class=\"redactor-inline-converted\">How do connect to passion within the subject</strong></li><li>How to connect to passion through technique even if you think you aren’t a passion person</li><li><strong class=\"redactor-inline-converted\">Passion and deliver, what you perceive vs. what your audience perceives</strong></li><li>Connecting to the passion even after multiple rounds of recording</li><li><strong class=\"redactor-inline-converted\">And much more!</strong></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Passion, it’s your love for what you do, what you are talking about and it’s ultimately what connects your listeners to you and <strong class=\"redactor-inline-converted\">builds your Podcast audience</strong>.  Passion for many is easy to achieve and deliver, for others not as easy but either way, passion can be thrown by the side when you get too focused on scripts in your Podcasting, content and technical issues.  In this course, we will talk about why <strong class=\"redactor-inline-converted\">passion is key</strong> and how to deliver content with it, no matter what.</p>\n\n\n\n\n\n\n\n<p>In order for your Podcast audience to be captivated, engage with you and be connected, they must feel the passion and excitement that you feel.  If you don’t <strong class=\"redactor-inline-converted\">connect with the passion within yourself</strong> and deliver it as such, you can’t expect the audience to get excited about it.  In order to deliver passion you have to connect with that passion inside of you and often times use technique to bring it out.  You have to get out of your head, and into your body, and your story and experience, and bring that to life.  Words alone cannot do it.  In this course, you <strong class=\"redactor-inline-converted\">learn about how important passion is and how to connect with it</strong>, even if you don’t think you are geared as a passionate person.</p>\n\n\n\n<p>Your instructors, Tracy Goodwin and Scott Paton, are dedicated to living life with Passion. <strong>They look forward to having you join them!</strong><br></p>", 
    "end_date": null, 
    "title": "Podcast Passion Masterclass", 
    "price": "20.00", 
    "instructors": "Scott Paton, Tracy Goodwin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721550_565e_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-podcast-with-passion/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T07:16:03Z"
}