{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In Podcast Storytelling Masterclass, we will cover some of the nuances that <strong>make your podcast stronger.</strong>   The elements for storytelling are specific and dive deep into the actual delivery of the podcast and how to meaningfully connect that material to the audience.   </p>\n\n<p>Stories are how we connect to others.  Storytelling has always been popular but is truly one of the most authentic ways to connect with, keep and grow the audience.  People relate to experiences, good, bad and indifferent.  Facts are not how to engage people, stories are.  But, there are some important elements to know about telling stories in order to maximize their potential in your podcast.  In this section, we’ll cover how to <strong class=\"redactor-inline-converted\">really make an impact with your stories. </strong></p>\n\n<p>In addition, this course covers the element of storytelling and how to why it’s important to create stories that resonate with the audience as well as <strong class=\"redactor-inline-converted\">key techniques</strong> to help the guest, if an interview podcast, tell stories that the audience relates to. </p>\n\n<p>Every listener hears the story differently.  Each listener has their own experiential and emotional responses with the imagery you present, and so, each listener imagines and responds to your story in their own unique way.</p>\n\n<p>In this course, you will learn:</p>\n\n<ul><li><strong class=\"redactor-inline-converted\">Why stories are important</strong></li><li>How to use stories in podcasting</li><li><strong class=\"redactor-inline-converted\">How to pick the stories</strong></li><li>How to use stories instead of questions in a podcast interview</li><li><strong class=\"redactor-inline-converted\">How to help an interviewee use stories as response instead of simple answers</strong></li><li>And much more!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Stories are an important tool to connect with the audience.  In order for stories to be the most effective, it becomes key to select the right story for the audience and include the parts that the listener will resonate with and connect to the most.  Stories are also an incredible tool for interviews and getting the best answers and stories out of a guest on the podcast show.</p>\n\n<p>Tracy and Scott are excited to bring you this course. It will improve your Podcasts and help you connect deeper with your audience as your show grows more popular. </p>", 
    "end_date": null, 
    "title": "Podcast Storytelling Masterclass", 
    "price": "20.00", 
    "instructors": "Scott Paton, Tracy Goodwin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793980_7b30.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-podcast-storytelling/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T19:30:24Z"
}