{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Discover the power of outsourcing your Podcast production</strong>. Imagine that all you have to do is show up, record, and all the drudgery of Podcasting is handled by a highly-skilled group of freelancers and outsourcers from around the world as you sleep!</p>\n\n<p>Instead of spending fruitless days picking away at your audio, never seeming to get it right, week after frustrating week, your professional sound engineer edits it and has it sounding as polished as you are in short hours. Then your  transcriber turns your show into an article and blog post as your VA uploads the show onto your Podcast hosting server.</p>\n\n<p><strong>You get the highest quality at prices you can afford!</strong></p>\n\n<p>Plus you are helping people all over the world <strong>get out of poverty.</strong></p>\n\n<p>Producing Podcasts requires a wide range of skills: Audio editing, writing, uploading, finding guests and scheduling them then thanking them and a whole lot more. The problem is that each task may only take a couple hours, but:</p>\n\n<ol><li>They are hours you don't have</li><li>Each week when you go to do them, you start all over as you don't do them enough to really remember them from week to week.</li></ol>\n\n<p>By outsourcing you'll be able to <strong>produce your Podcasts faster</strong> and spend only a fraction of what you would have otherwise expensed in time and money. </p>\n\n<p><strong>Outsourcing your Podcast has endless possibilities</strong> - you just need to know how to apply it effectively and efficiently.</p>\n\n<p>Scott Paton, the Dean of Blogonomics and Podology, has <strong>been using outsourcers for the past seven years</strong> to produce products, like his Podcasting platform, he could never have made himself, to save time and money on projects he could never have completed himself.</p>\n\n<p>He shares with you <strong>the industry secrets to finding high-performing outsourcers</strong> and keeping them long term. When you finish this course, you'll be able to find quality freelancers to look after  all aspects of Podcast production, so that you can<strong> focus on the most important things</strong>: Being the best Podcast host you can be!</p>", 
    "end_date": null, 
    "title": "Podcast Outsourcing", 
    "price": "25.00", 
    "instructors": "Scott Paton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600076_51e2.jpg", 
    "course_url": "https://www.udemy.com/outsource-podcasts-social-media-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T05:08:30Z"
}