{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Would you like to double your business? Great, because in this training you’ll discover a quick &amp; easy way to increase your revenue with contests!</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Learn Proven Tricks Deployed By Brands Like Walmart &amp; Coca Cola</strong></p>    <ul><li>More Traffic </li><li>Get Facebook Fans</li><li>Increase Your Brand Awareness</li><li>Build Your List</li><li>Increase Fan Engagement</li><li>Sell More Products &amp; Services</li></ul><p><br><strong>Contents &amp; Overview</strong></p>    <p>This course will introduce you to powerful strategies to grow your business with contests.</p>  <p>First, you’ll discover why contests will have a huge impact on your business, then will show you five proven &amp; tested contest types that your fans will absolutely love.</p>    <p>Next, we’ll cover how to craft a powerful contest description and three easy ways to get a stunning contest photo. <br> <br> Once you learned how to pick a relevant prize and trigger viral engagement, we’ll move with step-by-step instructions to set up a fanpage in less than 5 minutes. <br> <br> Last but not least, we’ll cover powerful strategies to give your contest tons of exposure with Facebook Ads, advanced traffic strategies as well as the best third-party contest apps in the market!   </p><p>By the time you complete this course, you’ll be able to create viral contests and grow your business like a professional social media marketing agency!<br></p>", 
    "end_date": null, 
    "title": "Powerful Way To Grow Your Business With Contests", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780332_a530_2.jpg", 
    "course_url": "https://www.udemy.com/powerful-way-to-grow-your-business-with-contests/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T20:30:15Z"
}