{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t Actualmente se ha puesto de manifiesto que una economía basada en el paradigma del crecimiento infinito y la acumulación de bienes es, por su propia definición, insostenible. Al mismo tiempo, la era que estamos viviendo se caracteriza por cambios exponenciales: todo está digitalizado, conectado, compartido y socializado.  </p>  <p style=\"\">  \t Como consecuencia de ello, mientras algunos negocios se estancan y paralizan, una gran cantidad de oportunidades surgen casi cada día, permitiendo la creación de mercados totalmente nuevos.  </p>  <p style=\"\">  \t Estructura del curso  </p>  <p style=\"\">  \t <u style=\"\">Albert Cañigueral, </u>autor del blog Consumocolaborativo.com, explica los principales ejemplos de consumo colaborativo del mercado y cuáles son los principios por los que se rigen.  </p>  <p style=\"\">  \t <u style=\"\">Benjamin Tincq,</u> co-fundador de OuiShare, entra en detalle en la producción contributiva y el conocimiento abierto, los makerspaces y hackerspaces.  </p>  <p style=\"\">  \t <u style=\"\">Antonin Léonard,</u> habla de su experiencia en la creación de la comunidad internacional OuiShare, de la que también es co-fundador.  </p>  <p style=\"\">  \t <u style=\"\">Francesca Pick </u>de Kokonsum.org, Conectora de OuiShare en Munich y Co-editora, experta en el área de la confianza y la reputación en la red, nos habla sobre la importancia de la construcción de la confianza en el entorno de las plataformas.  </p>  <p style=\"\">  \t [La segunda parte de este curso se llama &#039;Modelos de negocio de éxito en la era colaborativa&#039;, también disponible en Udemy]  </p>", 
    "end_date": null, 
    "title": "Principios de la era colaborativa", 
    "price": "20.00", 
    "instructors": "Escuela de negocios digitales", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185822_946c.jpg", 
    "course_url": "https://www.udemy.com/principios-de-la-era-colaborativa/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-20T12:02:03Z"
}