{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>UPDATED April 2016: </strong><strong> </strong>My Udemy courses have been taken by 1,000s of students and have been awarded 100s of positive reviews.  </p>\n\n<p><strong>My “WHY” – </strong>You know that feeling you get when you help someone? I want to feel that way 1,000,000 times.<strong> </strong></p>\n\n\n\n<p><strong><em>Come with me on a journey to Productivity Hacks for social media management. Start saving hours on your marketing efforts.</em></strong><br></p>\n\n\n\n<p><strong></strong>Did you know that we waste <strong>6hours and 48min weekly </strong>on social media management ? We do this because we don't have the RIGHT tools, systems or processes in place. This course will help you become more <strong>productive and efficient </strong>on social media marketing activities. You will be able to create, curate, schedule and post content in matter of minutes.</p>\n\n\n\n<p>This is what you will learn in this course </p>\n\n\n\n<ol><li>Understand the time spent on social media management and  importance of productivity </li><li><strong>Productivity hacks for social media content creation, curation and scheduling </strong></li><li>Over <strong>20 tools</strong> that I have tested and use on daily basis </li><li>How to create a social media report in minutes  </li><li><strong>Crazy social media automation tools</strong> to save you hours of time </li><li>My social media management system as a template </li></ol>\n\n\n\n<p>By using the same tools and systems, I have created a social media marketing agency and we have worked with 100+ clients. I will show you the exact tools and processes that I have tested and mastered. </p>\n\n\n\n<p>If you use social media channels for personal or business use, this is the course for you. This course also comes with a 30day money back guarantee so there is nothing to lose. </p>\n\n\n\n<p>Enroll now and I will see you on the inside! </p>", 
    "end_date": null, 
    "title": "Productivity Hacks For Social Media Management", 
    "price": "20.00", 
    "instructors": "Ali Mirza", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648548_4ea9.jpg", 
    "course_url": "https://www.udemy.com/productivity-hacks-social-media/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T04:35:08Z"
}