{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>CURSO DE PRODUÇÃO DE CONTEÚDO PARA REDES SOCIAIS - VÍDEO AULA</strong></p>O aluno vai aprender o que é conteúdo e como produzir com foco em seu público e negócio. Vai ver exemplos de sucesso de como o conteúdo pode destacar sua marca nas mídias sociais a partir do entendimento do seu público e o que ele curte. E na prática vai definir a persona e voz do seu conteúdo, criar um calendário, estabelecer periodicidade, quantidade de posts para gerar conteúdo no dia a dia. A ideia é que com planejamento de post seja possível aproveitar oportunidades de real time mkt. E ao final vamos falar da interação e do acompanhamento dos resultados de performance de qual tipo de conteúdo engaja mais seus fãs. <p><strong><br></strong></p><p><strong>Objetivo:</strong><br></p><ul><li>Ensinar a produzir conteúdo para canais corporativos específicos nas mídias sociais a fim de atingir um público alvo determinado com uma mensagem adequada a cada plataforma (Twitter, Facebook, Instagram, Snapchat, Linkedin dentre outras)</li></ul><ul><br></ul><p><strong>Duração:</strong></p><p>O Curso de Produção de Conteúdo para Redes Sociais tem duração de duas horas.</p><p><br></p><p><strong>Público Alvo:</strong></p><p>O Curso de Produção de conteúdo para Redes Sociais é destinado para micro, pequenos e médios empresários, profissionais liberais,  e demais interessados em aprender a criar seu próprio conteúdo para obter mais resultados nas mídias sociais para seus negócios, marcas, projetos ou serviços.</p><p><strong><br></strong></p><p><strong>Professor:</strong></p><p>Liliane Ferrari é Jornalista, pós-graduada em Filosofia e História da Arte, apontada como uma das 10 mulheres mais influentes da internet brasileira pelo iG. </p><p><strong><br></strong></p><p><strong>Conteúdo Programático:</strong></p><ul><li>O que é conteúdo? Como ele pode destacar seu negócio/marca/serviço nas mídias sociais.</li><li>Entendendo o conteúdo que seu público curte. Cases de sucesso.</li><li>Definindo a persona e voz do seu conteúdo.</li><li> Temas e Pautas - trends</li><li> Grade e Periodicidade - calendário, conteúdo frio e real time mkt</li><li> A produção de posts - execução</li><li>A produção de posts - modelos de gestão</li><li>Interação e acompanhamento dos resultados</li></ul><p><strong><br></strong></p><p><strong>Por que escolher a ComSchool?</strong></p><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas.</li><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Produção de Conteúdo para Redes Sociais", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694118_3424_4.jpg", 
    "course_url": "https://www.udemy.com/producao-de-conteudo-para-redes-sociais-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T16:57:25Z"
}