{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><p style=\"\">In this 24 video series (plus one 24-page  .pdf), Pinterest expert Ashley Zee will show you how to Make Money on Pinterest and maximize its features to your  marketing advantage. There are a lot of internet marketers hawking their  products or affiliate links on Pinterest in the completely wrong way. This  course will help you set yourself apart from the pack and market on Pinterest  in a thoughtful, effective, and Pinterest-friendly manner.<br style=\"\">  <br style=\"\">  This course is highly useful for internet marketers who  wants to learn how to Make Money on Pinterest, but anyone that uses  Pinterest (or is thinking about joining Pinterest) would benefit from this  course. &nbsp;<br style=\"\">  <br style=\"\">  The course is taught with text materials (included in the course), whiteboard  lectures, and a series of videos that demonstrate how to execute key strategies  for marketing with Pinterest.<br style=\"\">  <br style=\"\">  The entire course is one hour long, but you have the ability to pause the  videos and re-read the .pdf text so that you can go at your own pace.&nbsp;<br style=\"\">  <br style=\"\">  The instructor, Ashley Zee, can also take your questions that you can type into  the &quot;Questions&quot; box on the right-hand sign of your screen (it appears  when you have enrolled in the course).</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Profit with Pinterest -- A Case Study", 
    "price": "20.00", 
    "instructors": "Ashley Zee", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32325_fd7f_5.jpg", 
    "course_url": "https://www.udemy.com/profit-with-pinterest-a-case-study/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-11T18:09:12Z"
}