{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>All my courses offer a 30 day back guarantee if not satisfied!</strong><br></p><p>This course is designed for businesses that want to target and engage with local people in their city or state on Twitter.  If you own a restaurant in Chicago, you'll want to find new customers on Twitter in Chicago. Learn basics, pro tips and 3rd party programs that can help you easily find local twitter followers!<br></p><p><strong>Build a strong foundation of understanding how to use Twitter to find and engage local people on Twitter to attract them to your business.</strong></p><ul><li>Learn how to find twitter accounts specific to your local area</li><li>Learn how to engage with local people on Twitter to build a community around your business</li><li>Learn Hashtag \"Hacks\" and how to use geolocation services to find new customers</li><li>Learn how to use free programs to jump start your local twitter following</li><li>Learn how to create fun and engaging content for your Twitter account!</li></ul><p><strong><br></strong></p><p><strong>Twitter followers worth your time:</strong></p><p>Twitter is not about how many followers you have, it's about the quality of your followers. By utilizing what is taught in this program - you'll gain visibility in your local community and build a trusted reputation for your business.</p><p>Twitter has over 289 active users, with 135,000 new users signing up every day.  Of those, 2.1 billion twitter searches are performed daily (compared to Google average daily searches of 5.7 billion).  40% of twitters don't tweet, but search and watch what others tweet. <em>Statistics per statisticbrain </em>Like Google ... you'll want to be found online and Twitter has a large number of people that may be interested in finding your business.</p><p>Twitter is a great way to have instant interaction with local people.  You'll know what is going on in your community, you'll have an instant way to handle customer service issues, you'll get feedback on your business and it's a great way to offer specials to those locally.  </p><p>Twitter is a free tool to use (except for your knowledge and time) and makes this platform a very wise choice to assist with your business marketing efforts.</p><p><strong>Content and Overview:</strong></p><p>This course is an intermediate course which means you must already know the basics of Twitter.  Basic knowledge needed for this course: How to compose a tweet, how to ReTweet, how follow another twitter account and how to reply to someone on Twitter.  </p><p>This course does NOT teach those basic understandings and assumes you already have these skills.</p><p>By the end of this course - you'll have an engaging Twitter feed, Local Followers and great start to bigger and better things on Twitter!</p><ul><li><span></span></li></ul>", 
    "end_date": null, 
    "title": "Quickly Social: Local Twitter Followers For Local Businesses", 
    "price": "20.00", 
    "instructors": "Jennifer Stinnett", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419436_b101_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-twitter-users-in-your-business-location/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T17:20:12Z"
}