{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>LATEST: Course Updated Again for May  2016</strong></em></p>\n\n<p>How long does it take you to <strong>manage all your social media accounts</strong>? Would you like to learn how to execute it within 30 minutes a day?</p>\n\n\n\n<p>Managing all social media accounts (especially if there are many of them) can be a big task for the business owner, who has other important things to take care of, and for social media managers who need to manage several accounts. It can take up a huge part of your day. But if you have a plan, it is possible to manage all your social media accounts in just 30 minutes</p>\n\n\n\n<p><strong>With this Course you will Learn  exactly how to successfully manage all your social media: this includes Twitter, Facebook, Linkedin, Pinterest, Google+ and Instagram accounts in 30 minutes a day…</strong><br></p>\n\n\n\n<p>WITH A DEFINED SOCIAL MEDIA STRATEGY IN PLACE, MARKETERS CAN ROCK SOCIAL MEDIA IN 30 MINUTES A DAY.<br></p>\n\n\n\n<p><em><strong>Sound too good to be true?</strong></em> It is actually possible if your daily use of social media is built upon a well-developed social media strategy. But, a strong social media strategy does not mean that your brand has to be on every single social media channel out there. Instead, focus on the social media channels that the majority of your customers frequent.</p>\n\n\n\n<p><strong>What you will Learn in this Course:</strong></p>\n\n\n\n<ul><li>How to allocate your time on each channel? </li><li>How to select a Social media goal</li><li>How to select the best 30 minute strategy based on your Social Media Goal. I share 4+ of the most popular 30 minutes  Social strategies...that many top Brands use.</li><li>Learn 17 Amazing Sources for Super Viral Social Content.. Sharing great content is where alot of people fall short......</li><li>Get my personal review of  the BEST tools and software to Fully Leverage every min of your 30 min efforts.  </li><li>Get a  sneak peak of the  Art and Science of  Social marketing Automation </li><li>Learn how to Intergrate your all of Your popular social accounts..with one button sharing....... I share my favorite IFTTT  recipes and most coverted Zapier  zaps</li><li>And much much more</li></ul>\n\n\n\n<p>As with most things, the more you do something the more efficient you become at it. While it can hard to imagine only allocating 30 minutes a day to social media, with  the help of this course YOU will become more efficient at finding and posting interesting, sharable,entertaining,educating content( I'll teach how to do this in 5 minutes) and need less time to share content( I'll teach you to automate this step) and respond to brand mentions( the most important factor). <br></p>\n\n\n\n<p><strong>My Guarantee:</strong><br></p>\n\n\n\n<p>I'm so confident that you're going to love this course and find a tremendous amount of value in it, that I guarantee that if you're not 100% satisfied, that I'll give you a full refund within 30 days of your purchase.</p>\n\n\n\n<p>This course could easily sell for hundreds of dollars. I personally know of Social Media Growth Hackers out there who are charging hundreds, even thousands of dollars for a fraction of the information contained in this Udemy Course. And they charge that for a simple 1hour call</p>\n\n\n\n<p><strong>As with all my courses:</strong></p>\n\n\n\n<ul><li><strong>The initial low price will increase shortly - the course is currently $ 45, but will next increase to $ 50</strong></li><li><strong>You have unlimited lifetime access at no extra costs ever !!!</strong></li><li><strong>All future additional lectures, bonuses, etc in this course are always free</strong></li><li><strong>There's an unconditional, never any questions asked full 30 day money back in full guarantee</strong></li><li><strong>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy.</strong></li></ul>\n\n\n\n<p>PSS: Do you really want to be a <strong>\"Successful Social Media Manager\" </strong>? Do you really want to enjoy the full benefits of Social Media Automation?</p>\n\n\n\n<p>PSSS: It will take some trial and error. It will take perseverance. But if you can honestly answer “Yes\" then there is no reason why you can't start building some <strong>serious social media skills.</strong></p>\n\n\n\n<p>This will be a truly interactive course with additional bonus routines added over the course of the first year, inspired by the feedback from students.</p>\n\n\n\n<p><em>Click the <strong>\"Take This Course\" </strong>button, on the top right because every hour you delay is costing you Fans,Re-Tweets,Likes and Pins.....<strong>Scroll up </strong>and <strong>Enroll Now!</strong></em></p>", 
    "end_date": null, 
    "title": "Rock Social Media in 30 Minutes a Day - Twitter, Facebook+", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688522_71cf_2.jpg", 
    "course_url": "https://www.udemy.com/social-media-in-30-minutes-a-day/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T00:33:08Z"
}