{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">&quot;I learned more in a few minutes with this  instructor than I did in 5 years of trying to work a business page on  Facebook. With my first test add for page likes, I got 3 likes in the  first hour. My engagement on posts went up 68%. This is some really good  stuff.&quot; -R.H., Student</strong>  </p>  <p style=\"\">  \t  Join over 300 successful jewelry designers and learn how to create rock star content every day that brings you raving fans and not just casual followers. In this course, you will learn essential strategies that <strong style=\"\">laser target your ideal clients</strong> and optimize your efforts to <strong style=\"\">bring more sales</strong>, not only likes and comments to your Facebook page.  </p>  <p style=\"\">  \t                              So much has changed on Facebook, and without a strategy and the know-how, jewelry designers like you are wasting their precious creating time (and money!) on figuring out how to get social media to work for their business.  </p>  <p style=\"\">  \t                              You will learn <strong style=\"\">the</strong> most important strategy on Facebook, how to <strong style=\"\">skyrocket your email list</strong>, how to <strong style=\"\">increase engagement</strong> and build a community of invested fans. You will dig deep into the world of your ideal client and <strong style=\"\">unlock the door to amazing content</strong> that will have fans glued to your page.  </p>  <p style=\"\">  \t                            I will give you downloadable templates and blueprints along with actionable content that will help you expertly craft some of the most important material you will need for your Facebook page.  </p>  <p style=\"\">  \t                              Get your feet wet with Facebook ads without wasting your money and learn how Facebook is still the best way to influence your dream customers if you do it right!  </p>  <p style=\"\">  \t                            After hearing so many fellow jewelry designers so frustrated, I decided  to create this jam packed course on how to promote your unique brand  totally authentically and without posting endless links to your site or  Etsy shop. These strategies have helped me build an email list of thousands, connect with my authentic voice to reach clients and gain more sales through my social media campaigns.  </p>  <p style=\"\">  \t        And if for any reason you do not benefit from this course, simply let us know within 30 days and we guarantee your money back.  </p>  <p style=\"\">  \t        Enroll now and stop wasting your precious designing time trying to figure out Facebook!  </p>", 
    "end_date": null, 
    "title": "Sales Boosting Facebook Strategies for Jewelry Artisans", 
    "price": "50.00", 
    "instructors": "Lauren Saraswati Zavlunov", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306904_3ae1_4.jpg", 
    "course_url": "https://www.udemy.com/socialmediaforjewelryartisansfb/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T14:53:22Z"
}