{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Learn how to <a href=\"http://www.udemy.com/selling-social-marketing/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">sell social media marketing</a> services to senior decision makers even if they don&#039;t use Facebook, Twitter or Linkedin.&nbsp; If you want to sell social media campaigns to clients or convince your boss to use social media. <br style=\"\">  <br style=\"\"><p>I have sold five and six figure social media consulting contracts to  Fortune 100s, Federal Government Agencies, global nonprofits and the US  Military.&nbsp; I have a formula for building  a business case that anyone, regardless of their digital literacy, can  understand and appreciate.&nbsp; In this  course, I&#039;ll show you everything you need to know to design and deliver a  winning new business pitch or proposal to your CFO.</p>    <p>Companies and clients alike are spending more on social media and less on  traditional marketing and PR services.&nbsp;  Are you shifting your resources as well?&nbsp;  Are you winning your share of this exploding new business category? Get  the skills you need to build an irrefutable business case for social marketing  with even the most skeptical clients.&nbsp; As  my decade of experience closing major account business with clients including  Boeing, Johnson &amp; Johnson, Toyota, UCLA, the US Dept. of Defense and dozens  of small to medium size businesses.</p>    <p>You&#039;ll also get an arsenal of exclusive supplemental resources including  a social media sales presentation template, articles on selling social media  and audio resources with leading industry experts discussing how to sell social  media pilot programs, online lead generation, selling social media to senior  management, selling social media in the enterprise, selling social media to  B2Bs and much more.</p>    <p>Get this online social media marketing  services course and start closing social media  marketing business today.</p>    <p>Take this course now, and  learn how to  sell your social marketing media services.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Selling Social Media to Your Boss", 
    "price": 0, 
    "instructors": "Howard Industries Eric Schwartzman", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/12256_58fa_19.jpg", 
    "course_url": "https://www.udemy.com/selling-social-marketing/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-01-01T01:24:03Z"
}