{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tSo, you have a great video, but it seems to be useless for your marketing, because it does not show up at Google and almost nobody watches it&hellip;  </p>  <p>  \tOr maybe you&rsquo;re planning to make your next video a big hit?  </p>  <p>  \t<strong>Well&hellip; from this course you&rsquo;ll learn everything you need to know for ranking your video on the first page at both Google and Youtube.</strong>  </p>  <p>  \tEven if you have zero SEO experience, within a few hours from now you&rsquo;ll be able to optimize and rank videos like a pro!  </p>  <p>  \tWhy learn search engine optimization for videos?  </p>  <p>  \t&gt;&gt; Because videos are much easier to rank than text content (about 60 times easier)  </p>  <p>  \t&gt;&gt; Because people do click on video search results at Google  </p>  <p>  \t&gt;&gt; Because Internet surfers are more likely to visit your site (and buy your product or join your list) after watching a video  </p>  <p>  \tSo your video can be a great source of traffic and customers&hellip; but only if your targeted prospects have the opportunity to watch it.  </p>  <p>  \tThat&rsquo;s exactly what you&rsquo;ll learn in this course: <strong>how to make sure that people will find YOUR VIDEO</strong> when they search for your type of product or service. You will become an expert at ranking your videos.  </p>  <p>  \tBut that&rsquo;s not it&hellip;  </p>  <p>  \tThis course can open you a whole new world of golden opportunities.  </p>  <p>  \tThink about that: there are a lot of business owners out there who&rsquo;re trying to use Youtube videos to attract customers. So they spend thousands of dollars on top notch video creation. But when you look at their videos, you notice that they barely have 100-150 views. So they bring almost zero traffic and customers. Why? <strong>Because business owners have no clue about ranking videos!</strong> That&rsquo;s why they see no return from their investment in video marketing.  </p>  <p>  \tThat&rsquo;s where <strong>you</strong> come into place. You can contact these business owners and tell them that you can bring their videos on the top spots, right under their potential buyers&#039; eyes. So you can make a lot of money as a video marketing consultant after graduating this course.  </p>  <p>  \tEverything is covered in our 12 lectures, no stone is left unturned.  </p>  <p>  \tThe video lessons (about one hour and half) drive you through the entire process of search engine optimization for videos, using a &ldquo;live&rdquo; example. Yes, I have created a sample video for this course, done the keyword research for it and I&rsquo;m going to show you what I do in order to rank it high, step by step.  </p>  <p>  \tJoin this course now and become a video marketing and video SEO expert!  </p>", 
    "end_date": null, 
    "title": "SEO for Videos", 
    "price": "20.00", 
    "instructors": "Bogdan Anastasiei", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131242_81c1_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-rank-your-video-on-page-1-at-google-and-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-09T07:44:43Z"
}