{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t                Over Thousands of  students are looking for such course.  </p>  <p>  \t                This course has covered with latest features of social media.  </p>  <p>  \t                ---------------------------------------------------------------------------------  </p>  <p>  \t                Learn How to target people and act natural + drive massive traffic to your websites. From Google+ Comunities,  Facebook Groups/Pages, Twitter account, StumbleUpon Account.  </p>  <p>  \t                WOW - i was almost dead to see results i targeted people and they gave me positive response.  </p>  <p>  \t                I wanted to learn and implement all the secrets and it took me years to know and finally i got results too. I am happy to share these secrets with you. So that you can target and market your product to your specific audience .  </p>  <p>  \t              Peter Drucker says, Today knowledge has power. It controls access to opportunity and advancement.  </p>  <p>  \t              What are the benefits of this course and what you are going to cover.  </p>  <ol style=\"\">  \t<li>You are going to  target your people from any country or any city, if  you want to target your people from other groups wow so this course is for you. I have also mentioned that how you can target them from groups.</li>  \t<li>You are going to schedule your all the posts.</li>  \t<li>You are learning latest features.</li>  \t<li>You are at the right place i will show you extra other sources to know where your audience at and you are going to target them bring them to your community.</li>  \t<li>My all students will get Bonus you are one of them.</li>  </ol>  <ul style=\"\">  \t<li>In this course you are going to watch step by step videos</li>  \t<li>I have bonus for my students in text format and links to download file.</li>  \t<li>This Course gonna take some of  your time to learn Social Media Marketing Strategy. </li>  \t<li>This course is structured step by step section by section so that you take your classes easily.</li>  </ul>  <p>  \t               I know the power of Social Media Platform and i want you to have it and share your news to thousands of people right from your laptop in seconds.  </p>  <p>  \t              If you are going to create Small Business Facebook Page I will give you that the knowledge and strategies in this class will be the easiest and most effective way to target and get them in your circle.  </p>  <p>  \t              If you are looking for such course so i welcome you in advance this course is for you I am waiting inside of this course so come and join me.  </p>  <p>  \t              You&#039;ve got the right idea!  </p>  <p>  \t              So See you Right in the Class!  </p>  <p>  \t              So See you Right  </p>", 
    "end_date": null, 
    "title": "SMM Secrets: Social Media Marketing Strategy Targeted People", 
    "price": "20.00", 
    "instructors": "Junaid Iqbal", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358922_2693_2.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T06:35:41Z"
}