{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is all about getting you up and running with a Snapchat account for your business before your competition catches up!</p><p><strong>Snapchat is EXPLODING in growth, from 100 Million users in the middle of 2015 and around 7 billion video views per DAY.</strong></p><p>Long story short, Snapchat is aging up and if you're one of the first businesses to this platform you have a huge advantage to win big.</p><p>The course is split into a few sections:</p><ul><li><strong>First w</strong><strong>e go over Snapchat basics</strong> so you become comfortable with the app itself and get a good idea of what it's all about. You'll as we walk through how to sign up and change VERY important settings.</li><li><strong>Second, we focus on using the app</strong> -- tips and tricks to using the app that aren't obvious and how to see how many people and exactly WHO is watching your snaps.</li><li><strong>Third, we focus on b</strong><strong>usiness strategy</strong>. You'll find out why Snapchat is different (the good and the bad), see real world examples of people who are KILLING it and WHY, learn all about what to focus on and how your unique advantage can help drive people to follow your Snapchat.</li></ul><p><strong>I have made this course as CLEAR and CONCISE as possible to SAVE YOU TIME.</strong><br></p><p><strong>In this course, you will find Snapchat EASY to understand, and you'll be using it confidently in no time to reach your growing audience and potential customers.</strong><br></p><p>Join this course to get EVERYTHING you need to start and grow your Snapchat audience for your business!</p>", 
    "end_date": null, 
    "title": "Snapchat Marketing For Business: Quick Start Guide", 
    "price": "20.00", 
    "instructors": "Eddie Makes", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777390_4db7_2.jpg", 
    "course_url": "https://www.udemy.com/snapchat-marketing-for-business-quick-start-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T05:11:14Z"
}