{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>\n\n</p><p><strong class=\"redactor-inline-converted\">Buffer</strong> is a better and smart way to share on social media. Its a <strong class=\"redactor-inline-converted\">social media management </strong>tool for marketers and agencies. </p><p>With Buffer app you can </p>\n\n\n\n\n\n\n\n<p><strong>1 - Schedule your posts for later</strong></p>\n\n\n\n<p>Buffer shares your content at the best possible times throughout the day so that your followers and fans see your updates more often. Get the most out of each post.</p>\n\n\n\n<p><strong>2 - Post to all of your social media channels at the same time</strong></p>\n\n\n\n<p>As you add content, you can easily select which of your social accounts you want to post to. Post the same message to all accounts or add context by customizing each.</p>\n\n\n\n<p><strong>3 - Post / Schedule Images and Videos</strong></p>\n\n\n\n\n\n\n\n<p>With Buffer you can easily schedule images and videos (Visual content is the KING in social media marketing)</p><p><strong>4 - Schedule on the go</strong></p>\n\n\n\n<p>Whether you are browsing the web or on the go, you can easily add content to your queue with our browser extensions and mobile apps. Save time and get more done by working from anywhere.</p>\n\n\n\n<p><strong>5 - Pablo: Create your own content</strong></p>\n\n\n\n<p>Create images with the perfect size and format for Twitter, Facebook, Instagram, and even Pinterest in less than 30 seconds. Typography, font sizes and formatting options make everyone a designer!</p><p><strong>6 - Auto share your blog content </strong></p><p>You can add your blog's RSS feed to Buffer (paid plan) or use an app like IFTTT to automate the process </p><p>ENROLL NOW and start saving time on your social media management with this awesome tool. </p>", 
    "end_date": null, 
    "title": "Social Media Management Tool: Buffer Tutorial ", 
    "price": 0, 
    "instructors": "Ali Mirza", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/819200_4272.jpg", 
    "course_url": "https://www.udemy.com/social-media-management-buffer/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T21:33:28Z"
}