{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you are paying an arm and a leg to get your Social Media posts sorted out then this course is for you! If you are still trying to figure out how to monetize social media and gain awareness for your brand and get more engagement and followers then this the place you should be! this course will help you massively in Automating and monetizing social media in 2016!</p><p>you are going to learn about a web based software called PinDrill that helps you find and schedule content to multiple social media platforms in minutes and also helps you monetize every post you post to social media! Including <strong>Pinterest,Facebook,Twitter,LinkedIn,Tumblr &amp; Instagram too! </strong>not only this but it also gives you the ability to promote affiliate products and your own products on social media in minutes including: <strong class=\"redactor-inline-converted\">WordPress Blogs, Shopify shops, Etsy shops , Magento stores, Tumblr blogs and Google's Blogger blogs too!</strong></p><p><strong class=\"redactor-inline-converted\">and the best part...you get a FREE LIFETIME MEMBERSHIP in this PinDrill software as a student in this course so you will pay nothing more! ever!</strong></p><p>I share with you step by step how to use this software and master it and even how to monetize it in several ways! </p><p>so? what are you waiting for? click the \"Take this course\" button now and lets make social media marketing easier and more profitable today!</p>", 
    "end_date": null, 
    "title": "Social Media Marketing Automation in 2016", 
    "price": "20.00", 
    "instructors": "Kenz A.Soliman, Fadwa A Soliman", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864584_ee2b_3.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-automation-for-profit-in-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T12:10:01Z"
}