{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The workshop Social Media Marketing: Creative Ideas For Event Planners is for you if you are working in the event and festival industry. If you want to know more about event sponsorship, festival branding, and making social media work for your event than this workshop is a <em>must</em>! </p><p>Aspiring festival producers should also sign up for this workshop as it will give you a fantastic overview of what event marketing entails.</p><p>After finishing this workshop you will have a better understanding of event marketing, sponsorship deals, branding your festival and social media marketing. </p><p>This 2 hour workshop offers you lectures, exercises and quizzes. In addition I have interviewed experts from the event and festival industry. The following <strong>experts share their valuable advice</strong> with you: </p><ul><li>Britz Robins, Shambhala Music Festival</li><li>Steven Haines, Stern Grove Festival</li><li>George Ridgely, San Francisco Pride</li><li>Tucker Gumber, The Festival Guy</li></ul><p>The main subjects that are covered in Event Marketing are:</p><ul><li>Event marketing principles</li><li>Your audience, your visitors, your fans</li><li>Social media strategies for your event</li><li>Turning your festival into a brand</li><li>The added value of sponsorship for your event</li></ul><p>In addition to the course material I have also included Social Media For Events (PDF document) that will give you a good overview of what each social media platform can offer.  </p>", 
    "end_date": null, 
    "title": "Social Media Marketing: Creative Ideas For Event Planners", 
    "price": "30.00", 
    "instructors": "Jarno Stegeman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/770484_1916_5.jpg", 
    "course_url": "https://www.udemy.com/event-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-22T12:00:17Z"
}