{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<div><p><strong>UPDATED April 2016: </strong><strong> </strong>My Udemy courses have been taken by 1,000s of students and have been awarded 100s of positive reviews.  </p>  <p><strong>My “WHY” – </strong>You know that feeling you get when you help someone? I want to feel that way 1,000,000 times.<strong> </strong></p>  <p><em>Course Updated Again for 2016</em></p>  <p><strong><em>Come with me on a journey to early traction &amp; FREE press for your startup or SMB. </em></strong></p>  <p>Let me tell you a quick story. Last year I created a startup called FiveOH and got press coverage in major news outlets like <strong>Dallas Morning News</strong> and <strong>Dallas Business Journal. (</strong>All this for FREE)<strong> </strong></p>  <p>In this course you will learn how I spy on relevant news journalists for FREE press coverage using social media marketing channels. </p></div>\n\n<p>This course will help you create a simple and effective social media marketing strategy to get early traction and startup PR. You will see some real life examples in this course. Specifically you will learn......</p>\n\n\n\n<ol><li>How to create an <strong>effective social media marketing strategy</strong> that helps you identify your ideal target audience and social media channels</li><li>How to create your first <strong>social media content plan </strong>(what to post and when to post)</li><li>3 types of MUST have social media tools. You will see live DEMO of tools like Pablo, Feedly and Hootsuite</li><li>How to <strong>find relevant news Journalists</strong> and then build relationship with them</li><li>How to manage your <strong>social media marketing channels in 20min a day</strong> </li><li>How to pitch to news Journalists and get free <strong>PR for your startup</strong> </li></ol>\n\n\n\n<p>There are 100s or social media courses out there and some are very good. But they mostly focus on either the strategy or the tools. This course is not just about the strategy. I will show you the tools you need to know and then how to effectively use these tools to build relationships.</p>\n\n\n\n<p>I have also added several home work assignments (exercises) in this course. I would strongly encourage you to PAUSE the course and complete these along the way. These exercises are very simple and will not take more than 15 or 20min each. These assignments will help you understand the overall big picture.</p>\n\n\n\n<p>After completing this course you will have a clear understanding of</p>\n\n\n\n<ol><li>Who your ideal targeting audience is</li><li>What social media channels you need to focus on (HINT: You don't have to be on all the social media networks)</li><li>What social media tools you need to have on your computer &amp; mobile phone</li><li>How you can find Journalists who cover your industry</li><li>How to manage your social media marketing effectively (20min a day)</li></ol>\n\n\n\n<p><strong>Enroll Now and lets begin this journey together! </strong></p>", 
    "end_date": null, 
    "title": "Social Media Marketing For Startups: Get FREE Press NOW", 
    "price": "20.00", 
    "instructors": "Ali Mirza", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524852_6783_2.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-for-startups/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T05:14:03Z"
}