{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tThis course will give you a completely new perspective of how to leverage social media for businesses across various domains. In case you are looking at using Social Media for Customer Acquisition, Brand Building or Reputation Management, this course will set the foundation to create your strategy and start the implementation.  </p>  <p>  \tSocial Media is a continuously evolving realm with amazing potential for business communications. It is considered to be one of the best ways to build links, which in turn helps in achieving various business objectives. Nowadays, various small as well as large organizations are leveraging social media platforms such as Facebook, Twitter and LinkedIn, YouTube and Pinterest to initiate next level of growth.  </p>  <p>  \tHowever, since social media is continuously evolving, there is a constant need for the marketing professionals to stay updated on the latest happenings, which can further help them to manage their business impeccably. Therefore, this course will give you complete understanding on social media marketing and what are the strategies that should be implemented in your social media campaigns to achieve the desired results.  </p>  <p>  \tSome of the main objectives of this training are:  </p>  <p>  \t1.  Understand the importance of Social Media for your business  </p>  <p>  \t2.  Social Media implementation examples and case studies across various domain  </p>  <p>  \t3.  Get started with Social Media Implementation  </p>  <p>  \t4.  Get the Overview understanding of all Critical Social Media Channels  </p>  <p>  \t5.  Certificate on Completion  </p>  <p>  \tFind more about Digital Marketing courses at <a href=\"http://www.digitalvidya.com\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Digital Vidya</a>.  </p>", 
    "end_date": null, 
    "title": "Social Media Marketing for Business", 
    "price": "50.00", 
    "instructors": "Digital Vidya", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42918_ec5f_3.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-22T09:28:42Z"
}