{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Widgets are the tools that bind the Social Web. </strong>  </p>  <p>  \tWidgets connect social media sites with blogs and websites; add interactivity and advanced features to websites; and help you share your content across the Internet.  </p>  <p>  \tAnd widgets are the first step toward a solid integration plan for your entire social media presence.  </p>  <p>  \t<strong style=\"\">If you want to build a robust online presence, then you need to learn more than the basics about social media widgets.</strong>  </p>  <p>  \tFollow author and new media expert Deltina Hay as she discusses beginning and advanced topics on social media widgets, plugins, APIs, and more in an accessible way that anyone can follow.  </p>  <p>  \t<strong style=\"\">Social Media Widgets Essentials&#039; Topics include:</strong>  </p>  <ul style=\"\">  \t<li>An overview of buttons, badges, widgets, plugins, embed code, applications, and APIs </li>  \t<li>Different types of widgets, such as social networking, RSS feed, and sharing widgets </li>  \t<li>What widgets are, and the different ways they are implemented </li>  \t<li>An introduction to plugins </li>  \t<li>The widgets available on the WordPress.com blogging platform </li>  \t<li>How plugins and widgets are used and implemented on a WordPress powered website </li>  \t<li>How to create custom widgets </li>  \t<li>An overview and demonstration of Twitter widgets and buttons </li>  \t<li>A demonstration of Facebook social plugins and Facebook Page applications </li>  \t<li>An overview and demonstration of LinkedIn buttons, badges, and Company Page plugins </li>  \t<li>An exploration of Google Plus API tools and plugins</li>  </ul>  <p>  \t<strong style=\"\">If you are ready to stand out and build an truly impressive online presence, then you are ready for Social Media Widgets Essentials.</strong>  </p>", 
    "end_date": null, 
    "title": "Social Media Widgets Essentials", 
    "price": "40.00", 
    "instructors": "Deltina Hay", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206952_42d5_4.jpg", 
    "course_url": "https://www.udemy.com/social-media-widgets/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T01:36:17Z"
}