{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course you go through step by step setting up a social media monitoring dashboard. These dashboards can be used for:<br></p><ol><li>Create a Social Media Monitoring Panel to Bring Searches, Newspapers, Blogs, Facebook and Twitter into One Panel</li><li>Understanding your community and what they are interested in</li><li>Found Media: find and share interesting content so you don't have to create articles and videos from scratch every day! </li><li>Identify Crisis Communications issues in social media and monitor for trolls on Facebook, Twitter and blogs.</li></ol><p>What you will learn:</p><ul><li>Social Media Monitoring of Traditional News Media Websites</li><li>Monitor the top 100 bloggers for your industry</li><li>Monitoring Facebook, Twitter and other Social Media Platform News</li><li>Monitoring Government News Impacting Your Community Promotions</li><li>Add Facebook, LinkedIn and Twitter Apps to the Dashboard</li><li>Advanced: Add RSS Button to Chrome for Social Media Monitoring</li><li>Advanced: Add RSS Button to Safari for Social Media Monitoring</li></ul><p>Social Media Manager 1: Monitoring Dashboards is the first step to professional social media management. While I use a particular dashboard, to setup and show examples and theory, you can transfer that knowledge to any social media monitoring dashboard your company or client uses. I am VERY happy to add additional videos. JUST ASK!! </p><p>I've managed the strategy, campaigns and Facebook Pages and forums and blogs of TV shows such as <strong>JUNIOR MASTERCHEF, IDOL </strong>and <strong>BIG BROTHER</strong>. I specifically adapted these  quick courses to bring social media managers  like you up to speed efficiently and cost effectively. Look out for my other courses!  </p><p><strong>SHORT COURSE:</strong> This is a mini-course that is part of a much larger Social Media Campaign course - you will find some videos duplicated from the Campaign course on my corporate account. Some students just want a quick and easy course on one aspect of campaigns - that is the purpose of this course. So if you are just looking for monitoring tools and strategies as part of social media campaigns, this is the course for you!<br></p>", 
    "end_date": null, 
    "title": "Social Media Monitoring & Dashboards for Facebook etc", 
    "price": "35.00", 
    "instructors": "Laurel Papworth", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604442_7cb2.jpg", 
    "course_url": "https://www.udemy.com/social-media-monitoring/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T03:11:02Z"
}