{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you <strong></strong>want to be <strong>successful </strong>with <strong>Social Media</strong><strong> Marketing </strong>you will <strong>LOVE </strong>this Udemy course<strong></strong>! You <strong></strong>will learn the<strong> </strong><strong>principles </strong>and <strong>strategies</strong> that work for us and that we have used to build PPC ads for over <strong>500 businesses successfully! </strong>Facebook, Twitter, Instagram, Pinterest, Google +, YouTube, LinkedIn, Tumblr, Wordpress, Blogger... any marketing via social media, we have you covered!<strong></strong><br><strong></strong></p><p><strong>JOIN THE 20,000+ HAPPY STUDENTS I HAVE TAUGHT AND CONSULTED ON SOCIAL MEDIA MARKETING!</strong></p><p><strong>Do you want to partake in a CONSTANTLY updated Social Media Marketing course that teaches you PPC (Pay-Per-Click) marketing on over 10 Social Media Platforms from A to Z?!</strong><br><strong></strong>  </p>  <p>  \t  Three reasons to TAKE THIS COURSE right now!  </p>  <ol><li>You get <strong>lifetime access</strong> to lectures, including new lectures every month (<strong>content is added constantly</strong> as updates to social networks roll out).</li><li>You can <strong>ask me questions</strong> and <strong>see me respond</strong> to every single one of them thoughtfully!</li><li>What\n you will learn in this course is original, tested, and very detailed! \nLearn the Social Media Marketing strategies I implement for clients \ndaily, including what social media pages are right for you and content \nmanagement options that will streamline your posting process. This \ncourse will also layout how to optimize your paid ad strategy on all the social media networks and enable you\n to reach any type of target market! Make the most of social media \nmarketing and make it easy, so you can  get back to what you do best, \nrunning your business! </li></ol><p>In this course, you will learn <strong>Pay-Per-Click Social Media Marketing</strong> from beginner level to advanced!</p><p>You\n will be able to optimize your ads for increased conversions \nand decreased costs. You will be able to create and make use of EVERY \ntype of SMM ad. You will be able to grow your page likes \nand post engagement. You will be able to find new customers that will \ndrive your brand to new heights via social marketing. Join this course \nnow to learn how to take your brand, product or service to the next \nlevel with the power of Social Media Marketing! </p><p><strong>TAKE\n A STEP IN THE RIGHT DIRECTION WITH YOUR LIFE AND LEARN HOW SOCIAL MEDIA MARKETING WILL MAKE YOUR BUSINESSES A \nHOUSEHOLD NAME!  ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "Social Media Marketing 2016 - Learn PPC on 10+ Platforms", 
    "price": "50.00", 
    "instructors": "Coursenvy Online", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573984_ce2a.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T22:06:44Z"
}