{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>BRAND NEW: Over 6,500 students since our recent launch.</strong></p><p><strong>THE MOST COMPREHENSIVE SOCIAL MEDIA COURSE ON UDEMY - Fully updated during May 2015 and again October 2015.</strong></p><p>Ready to take your business viral? Harness the power of social media with our extensive social media course. Everything from Twitter and Facebook to blogging, social media automation, G+ and content marketing.</p><p><strong>Are you ready to become part of the next-generation of business leaders? Harness the power of social media for your business, organisation and career.</strong></p><p>Join our latest social media course with UNLIMITED &amp; LIFETIME access you will learn how to drive sales, attract new customers and master social media.</p><p><em><strong>FULL 30 DAY MONEY BACK GUARANTEE.</strong></em></p><p>Social media sites such as Twitter, Facebook, LinkedIn, Youtube, Pinterest and G+ all have thousands of customers waiting for you to explore.</p><p>This course is the most comprehensive look at all of the social media websites, brand new for May 2015.</p><p><strong>What does this course give you?</strong></p><ul><li>Introduction to social media</li><li>Auditing your organisation</li><li>NEW: Social Media Strategy</li><li>Social media monitoring</li><li>NEW: Content Marketing</li><li>Facebook</li><li>Twitter</li><li>Google+</li><li>Blogging</li><li>Instagram</li><li>Youtube</li><li>NEW: Social Media Automation</li><li>NEW: Social for customer services</li><li>NEW: Social for PR</li></ul><p>This course will take you from social zero to social hero using our proactive and practical approach. It is arguably one the most comprehensive online courses of social media; giving learners a great grounding and skill set to enter the world of social.</p><p><strong>Certificate of completion</strong></p><p>All students who complete this course will receive a FREE digital 'Certificate of social media marketing' issued by the SO ME Academy, alongside Udemy's own certificate of completion.</p><p><strong>DON'T FORGET: Udemy operates a 30 day full money back guarantee, no questions asked! If you're not happy with this course you can request your money back.</strong></p><p>Click the <strong>\"take this course\"</strong> button straight away at the top right of this page to unlock the power of social media for your business.</p>", 
    "end_date": null, 
    "title": "Social Media Marketing 2016 - Complete Certificate Course", 
    "price": "30.00", 
    "instructors": "SO ME Academy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450394_b942_6.jpg", 
    "course_url": "https://www.udemy.com/learn-social-media-marketing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T15:51:20Z"
}