{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>\"This course is not sponsored or affiliated with Udemy, Inc\" : This course is presented by Laurel Papworth, lecturer University of Sydney, Forbes Magazine Top 50 Social Media Influencers and AdAge Power150 Media &amp; Marketing Bloggers. </p><p>It often seems to new lecturers that the successful lecturers on Udemy already have a \"big following\" or have a large \"email database\" or a lot of Likes and Followers on Facebook and Twitter. Are you interested in setting up a Facebook Page and creating a website/blog in Wordpress to promote your Udemy course? There are two sections:</p>\n\n<ol><li>Creating a Facebook Page for your Udemy Course</li><li>Create a Wordpress website specifically to start promoting your Udemy courses. </li></ol>\n\n\n\n\n\n<p>FROM SMALL TO BIG: We all had to start somewhere: My name is Laurel Papworth and I have over 240,000 followers on social media, and connect with 4 million people regularly each month. I have worked on social media projects for TV shows (Jnr Masterchef, Idol, Big Brother), not for profits (UNHCR) and overseas (MBC Saudi Arabia, Department Defence Singapore). It's taken me ages adn lots of mistakes to get there. Let's make sure you don't make the same mistakes and quickly get on the road to success. In THIS course you go step by step through the \"secrets\" that the big companies use to get millions of Facebook Likes, and the key tips and tricks to engage and promote your Udemy course on your website/blog (which you'll build from scratch in Wordpress!). </p>\n\n\n\n\n\n<p>READY? If you are ready to start promoting your Udemy course on social media, or if you are about to start/finish recording your Udemy course but want to be ready to market it on Facebook, or if you are just interested in key tactics for social media marketing and blogging, lets get started! </p>\n\n\n\n\n\n\n\n<p>IN THIS COURSE I will take  you through how to promote a course online (mine is a fictitious course on How to Make Breakfast) and also reveal what I did to build my following and business online, including that I regularly travel the world to present my courses live in Portugal, Saudi Arabia, Singapore and the rest of Asia. My students have also asked me to write for major newspapers, to present at their international conferences and to come inhouse to run workshops for them and their staff. If you become successful on Udemy you will find success in other areas of teaching and public presenting and consulting! </p>\n\n\n\n\n\n\n\n<p>YOU ARE: A Udemy lecturer (now or in the near future): </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Very knowledgeable on your subject whether it's baking or cars or the stock exchange but are not so confident in social media marketing, blogging and Facebooking.  But you'll be up and running in no time! </li><li>Concerned as you have a Facebook Page or Group for your students but it just doesn't seem to be doing a lot.  Let's fix that! </li><li>Not very technical and don't have a website and don't know where to start. Don't worry, you don't have to be! </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>FACEBOOK We start with Facebook Pages - did you know that Facebook chooses who it will show your Page to, and who will NOT see your updates even if they LIKE your Page?  It's called FBO (Facebook Optimisation) and is similar to SEO (eg Google's Search Engine Optimisation) Let's get that set up correctly from the beginning (or fix your Page along the way).  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>WEBSITE/BLOG The we get your website set up to properly promote your courses. Don't just put up a website with \"about the lecturer, \"special discounts on my courses\" and \"keynote speaker\" pages:  let's get your website working with Udemy and with Facebook and YouTube and Instagram and Twitter. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>COURSE INFORMATION: You'll receive howto videos that screencast (demonstrate on my screen) what you can do. Don't forget to pause and rewind and follow along! Also a workbook for you to download &amp; fill in as well as a Q&amp;A forum - don't forget to include links to your website, Facebook Twitter, YouTube etc in the discussions!  </p>", 
    "end_date": null, 
    "title": "Social Media for Udemy Lecturers Udeminions Unofficial", 
    "price": "20.00", 
    "instructors": "Laurel Papworth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823376_ea0b_4.jpg", 
    "course_url": "https://www.udemy.com/socialmediau/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-16T03:56:00Z"
}