{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is geared toward visual artists who are happiest when they're in the middle of their creative process. You're reluctant to tackle social media, but you do want to use them.<br><br></p>\n\n<ul><strong></strong><li><strong>Low threshold</strong></li></ul>\n\n<ul><li><strong>No mumbo jumbo</strong></li></ul>\n\n<ul><li><strong>Practical\npointers that are easy to implement</strong></li></ul>\n\n<ul><li><strong>So, fewer\nheadaches for you</strong></li></ul>\n\n<ul><li><strong>Better\ninteractions between you and your audience</strong></li></ul>\n\n<p><br>That matters\nbecause your enthusiastic admirers will help generate a bigger buzz for\nyou. Get in on the action and enrol!</p>\n\n<p>I teach a very practical approach. Simple solutions are often the most effective ones.</p>\n\n<p>Each lecture consists of a video with at least one downloadable resource.<br></p>\n\n<p><strong><br>In a nutshell<br></strong></p>\n\n<p>I will show you how\nyou can apply social media to promote your art without it becoming a\nheadache. I will also talk about security aspects of social media\nuse, and tell you how you can limit your risks so that you can relax\nabout that. \n</p>\n\n<p>The course's\nthreshold is low and there are many things in this course that you\nwill undoubtedly already know but aren't applying yet. That's okay\nbecause there'll be plenty of new information for you too.</p>\n\n<p>I am not going to\nbombard you with annoying mumbo jumbo jargon and I won't attempt to\nturn you into a marketing professional.</p>\n\n<p>We won't cover\nblogging as this course is aimed at those who'd rather be at work in\ntheir studios than at a desk tapping away on any kind of keyboard. We\nwon't look at maintaining a website and at sending out newsletters by\ne-mail either.</p>\n\n<p>\nEach lecture contains links to useful resources and a bullet list\nthat reviews the lecture. You will also get a handy practical tool\nthat will make your social media use much easier. \n<br><br></p>\n\n<p><strong>Why I am doing this and who I am</strong></p>\n\n<p>I am not a visual\nartist, but I used to work and talk a lot with one.\nI also used to have a colleague whose partner is an artist. She was\nhis promoter. She talked with me about how difficult promotion was\nfor him and I helped her set up a website in the days when social\nmedia didn't exist yet. Both artists hold exhibitions in places that\nmatter, and one of them is an international top artist.</p>\n\n<p>I became self-employed\nalmost twenty years ago, began my first website more than fifteen\nyears ago and was already experimenting with Twitter long before it\nbecame as commercialized as it is today. I have had dozens of different Twitter accounts and about ten different Facebook accounts, because I (used to) love experimenting with these media.<br></p>\n\n<p>You'll also benefit\nfrom my background in science and technology and my personal\nexperiences with online communities. They enable me to\nprovide you with a very practical and relaxing approach to social\nmedia.</p>\n\n<p>That leaves you free\nto concentrate on what matters most to you while enjoying playing\nwith social media in a natural way. If you do it well, that will\nslowly drive up your sales.<br></p>", 
    "end_date": null, 
    "title": "Social Media for Visual Artists", 
    "price": 0, 
    "instructors": "Angelina Souren", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690338_3da9.jpg", 
    "course_url": "https://www.udemy.com/social-media-for-visual-artists/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T14:51:39Z"
}