{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><p style=\"\">SOCIAL MEDIA  such as Twitter, LinkedIn and Facebook has grown significantly in the last  years. Businesses are winning work from Twitter and LinkedIn. Facebook is being  used in place of traditional advertising, yet a few years ago, to communicate  with customers you picked up the phone or wrote a letter. This workshop shares  secrets on the next steps to using digital marketing tools and how they can  generate business for you.</p>    <p style=\"\">SOCIAL MEDIA  ENVIRONMENT This section looks at an overview of the social media environment  and why there is a lack of adoption by businesses. BENCHMARK: HOW TO USE THE SOCIAL MEDIA FOR BUSINESS:  BALANCE SHEET We look at a tool to benchmark social media activity within an organization  and its external application. ENGAGE CUSTOMERS Engaging customers is an  issue on social media. This section reviews ways to create community and write  for social media. Different tools are considered including LinkedIn, Facebook,  Twitter, YouTube and Blogging.</p>    <p style=\"\">INTEGRATE  &amp; MANAGE We look at how to build Social Media activities into the business,  management issues and software available to integrate social media platforms.  MEASURE &amp; MONITOR This section showcases different tools for social media  metrics. From understanding what should be measured, to monitoring social  conversations. ACTION PLAN The workshop finishes with a review of best practice  and creating a practical action plan for your business.</p>    <p style=\"\">Take this Social Media and Business course  and learn how to use social media for business.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Social Media for Business", 
    "price": 0, 
    "instructors": "Oxford Learning Lab", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27562_1a11_4.jpg", 
    "course_url": "https://www.udemy.com/social-media-for-business2/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-23T16:24:17Z"
}