{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><strong>Course updated May 2015</strong></li><li><strong>Over 33 lectures and 8 hours of content!</strong></li><li><strong>Instructor available daily for questions</strong></li></ul><p><strong></strong>--------------------------------------------------------------------------------------------------------------</p><p><em>Listening to Carol's lectures is like talking to a friend, who can explain things to me in a language I can understand, not too technical, or over my head.- Alfrieda Dockery</em></p><p><em>--------------------------------------------------------------------------------------------------------------</em></p><p>By the end of this course, you will have the foundational knowledge to decide on the best social media platforms for you and how best to use them in a timely way. You'll learn to use Facebook, Twitter, LinkedIn, GooglePlus, and Pinterest. Then you will also learn to curate and share content using Paperli. Finally, you will connect your social media accounts using Hootsuite so that you can easily and quickly build relationships online. You will also become more comfortable using Youtube.</p><p>Most of the videos are a bit longer, some up to 30 minutes. Many of them were originally presented as live webinars. As such, the audio quality is a bit tinny, but   totally understandable.    Watch the lectures one by one, or choose the ones that you need help with first. If you aren't sure where to spend your time on social media, or you want a basic understanding of each of the possible options, this course is for you. The three short videos are a little harder to hear. </p>", 
    "end_date": null, 
    "title": "Social Media For the Time and Technology Challenged", 
    "price": "20.00", 
    "instructors": "Carol Bremner", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29958_ce19_8.jpg", 
    "course_url": "https://www.udemy.com/non-techie-social-media-101/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-18T04:08:36Z"
}