{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t   Do you use <strong style=\"\">Facebook</strong>, <strong style=\"\">Twitter</strong>, <strong style=\"\">YouTube</strong>, <strong style=\"\">LinkedIn</strong>, <strong style=\"\">Pinterest</strong>, or <strong style=\"\">Google Plus</strong> to market your business?  </p>  <p style=\"\">  \t   This course provides a clear method for making your online business and social media activity more profitable by using:  </p>  <ul style=\"\">  \t<li style=\"\">Examples</li>  \t<li style=\"\">Case studies</li>  \t<li style=\"\">Charts</li>  \t<li style=\"\">Downloadable PDFs</li>  \t<li style=\"\">Spreadsheet calculators that does the math for you</li>  </ul>  <p style=\"\">  \t   The result: See where you are spending time and money and see your profits.  </p>  <p style=\"\">  \t   This course is not about how to get more Likes on Facebook. This is not a 101 course for absolute beginners covering the basics of building your page. There is an overload of that kind of information on this site and on blogs. However, you can and should take this course even if you don’t currently have a Facebook Like Page up and running.  </p>  <p style=\"\">  \t   This course provides business training:  </p>  <ul style=\"\">  \t<li style=\"\">Practices that go beyond marketing</li>  \t<li style=\"\">Actual business management techniques that focus on your bottom line</li>  \t<li style=\"\">Helps you make money and keep more than you spend</li>  </ul>  <p style=\"\">  \t   You can immediately incorporate into your current Social Media Marketing Strategy, whether you are:  </p>  <ul style=\"\">  \t<li style=\"\">A Business Owner</li>  \t<li style=\"\">A Social Media Manager</li>  \t<li style=\"\">An Entrepreneur</li>  \t<li style=\"\">An Online Marketer</li>  </ul>  <p style=\"\">  \t   You may not be planning to use ads to get more likes and more sales. This course illustrates why advertising may be the fastest and easiest way of selling your products and services online.  </p>  <p style=\"\">  \t   You should take this course if you want to get better results with selling on social media and if you want to work smarter instead of harder. Social Media Profits literally gives you the tools, in PDF and spreadsheet form, to monitor consistently and measure your results.  </p>  <p style=\"\">  \t   This course is designed for everyone, whether you are:  </p>  <ul style=\"\">  \t<li style=\"\">In the planning stage of your business</li>  \t<li style=\"\">A start-up</li>  \t<li style=\"\">A big brand</li>  </ul>  <p style=\"\">  \t   If you want to achieve better results from your social media marketing and sales efforts, then get empowered now to make wisest decisions possible and improve your profits right away.  </p>", 
    "end_date": null, 
    "title": "Social Media Profits", 
    "price": "20.00", 
    "instructors": "Allen Foreman", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/229788_feb6_6.jpg", 
    "course_url": "https://www.udemy.com/social-media-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-26T13:37:31Z"
}