{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Student Review:</p><p><em>“Everything you've put together is so tight, understandable and logical. Very practical and easy to apply. I have to say bravo to you at this point for such a reasonable cost and one of the very few people I know who will give this information out. You definitely have a talent and gift in training! Thank you so much for this course to open my understanding\"</em></p><p><strong>Are you tired of spending time on social media and yet never seeing the results you want?</strong><br></p><p>Then I have a solution for you which takes you from establishing yourself on the platforms through to more advanced techniques for growing your following.</p><p> <strong>Why a Bootcamp?</strong> </p><p>I named this course a bootcamp because, just like a fitness bootcamp, its aim is to get you results in the shortest time possible. The course is all about taking practical steps that lead to the outcome you need for your business. Namely, more traffic and greater potential to increase your sales. Just like a fitness trainer I am there to coach and motivate you - I'm in the discussion area every day to help you and to answer all your questions.</p><p><strong>What Will The Social Media Marketing Bootcamp Cover?</strong></p><ul><li>Mindset and Approach - discover who your ideal clients are and how to market directly to them. Without knowing these vital steps, your social media efforts can go to waste.</li><li>Branding - How to brand your business with social media marketing. Branding is more than just your logo it's all the reasons people want to buy from you - it's about building trust and loyalty.</li><li>Content - How to write social content that will boost reader sharing and engagement to improve your popularity and search engine ranking.</li><li>Visual Appeal - How to create attractive, shareable images using super easy and free software which will help spread the word about your business almost effortlessly.</li><li>Tips and Tricks - Easily learn the principles of using any social media to market your business. </li></ul>", 
    "end_date": null, 
    "title": "Social Media Marketing Bootcamp", 
    "price": "30.00", 
    "instructors": "Alison Wood", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578150_3273.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T16:01:51Z"
}