{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>JOIN 4200+ ARTISTS + CREATIVES USING THIS SOCIAL MEDIA MARKETING COURSE TO BUILD AN EFFECTIVE 30-DAY SOCIAL MEDIA PLAN AND GAIN MORE VISIBILITY FOR YOUR BRAND ONLINE! </strong> ***Last Updated April 23, 2016***</p>\n\n<p><strong>Musicians, Photographers, Artists, Designers + Other Creative Professionals!</strong><br></p>\n\n\n\n\n\n<p><em>You know social media is important but you're not sure how to use it effectively. You're just looking for a simple system to plug into, so you can start marketing your work online.</em></p>\n\n\n\n\n\n<p>Make this THE year to take control of your online marketing.</p>\n\n\n\n\n\n<p>  \t                                           If you feel a little all “over the place\" trying to manage multiple social media accounts...</p>\n\n\n\n\n\n<p>If you're not seeing the results you'd like in your social media marketing...</p>\n\n\n\n\n\n<p>If you find yourself procrastinating because it all just seems too overwhelming to start...</p>\n\n\n\n\n\n<p>...this course will teach you strategies for building your social media presence in an effective yet manageable way.  </p>\n\n\n\n\n\n<p>  \t                                           Everything in this course is designed with time efficiency in mind so that you can establish a solid presence online without the overwhelm.  <em>This is how I managed to build a successful online presence with a full time job, managing my own music career and launching my business.  </em>  </p>\n\n\n\n\n\n<p>  \t<strong>  Here are a few things you will learn:  </strong>  </p>\n\n\n\n\n\n<ul>  \t<li>The four critical concepts that will help you build solid foundation for a successful social media presence.</li>  \t<li>Tips and strategies to optimize your Facebook, Twitter, YouTube and Pinterest accounts so that you can increase your followers and your social media engagement.</li>  \t<li>How to easily and consistently come up with ideas for engaging social media content.</li>  \t<li>How to set your social media marketing on autopilot with the best social media management tools (without sacrificing the quality of your marketing).</li>  \t<li>How to create a simple action plan for staying consistent with your social media marketing even after this course is over (with our social media marketing strategy template).</li>  </ul>\n\n\n\n\n\n<p>  \t                                           By the end of this course, you will have <em>at least one months' worth of content already scheduled to be posted</em> and a <em>solid social media marketing plan</em>.  </p>\n\n\n\n\n\n<p>  \t                                           If you ever get stuck, you have access to our discussion group and to me directly to help answer your questions.  </p>\n\n\n\n\n\n<p>  \t                                         If you're not happy with the course, <strong>I will refund your money within</strong> <strong>30 days, no questions asked - it's my personal guarantee to you!</strong>  </p>\n\n\n\n\n\n<p>  \t                                   You have nothing to lose. Click on the \"Take This Course\" button, and I look forward to having you as my student :)</p>", 
    "end_date": null, 
    "title": "Social Media Marketing Simplified 2016 For Artists/Creatives", 
    "price": "20.00", 
    "instructors": "Jewel Tolentino & Auret Esselen", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304390_b5c1_6.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-simplified-for-artists/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T19:39:32Z"
}