{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this world of computers, gadgets, and fast-paced technology, consumers are more easily reached through social media. Many smart business owners are now aware of the significance of connecting to consumers online and the impact this has to contributing to increasing profit.\n\n  </p>\n\n<p>So, why is social media so important in growing your business?\n\n Social media refers to online presence. The more active you are, the more social presence you'll have.\n\n The more presence you have, the wider your network of people will be; the wider your network is, the more people will know about your latest offers and be more engaged in your business.\n\n A great offer can be viewed and spread to a range of hundreds of consumers in a matter of hours--with the right tools set in place.\n\n However - Attempting to manage and update your social media sites constantly can be very tiresome.  Keeping in the loop of social trends can also be extremely overwhelming.\n\n Imagine having to manage Twitter, Facebook, LinkedIN, and more for just one brand.  Having to post the same message to all of these social sites can also be demanding.\n\n Monitoring prospects and how they interact with you can be tedious.\n\n How do you know which posts are getting the best results?\n\n How do I keep track of all the trends going on within and outside my network?\n\n You simply don't have the time to stay in front of your computer day in day out to look after all of these. Thankfully, there is software available that syncs with your social media accounts in one platform.\n\n This way, you can monitor and update all of them conveniently. The downside of this is that some powerful tools have come and gone.\n\n So, we have tested several tools to show you the best available social media tools out there.\n\n  </p>\n\n<p>\n\n  </p>\n\n", 
    "end_date": null, 
    "title": "Social Media Control - Step by Step Introduction", 
    "price": "35.00", 
    "instructors": "Will Caraway", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/859878_79fd_3.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-introduction-to-social-media-control/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-25T18:18:16Z"
}