{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">The ability to share, connect, embed, and otherwise integrate social media content is one of the things that makes social media marketing so powerful.</strong>  </p>  <p>  \tYou spend a lot of time generating great content for your online presence, make sure it gets as much exposure as possible by planning an efficient social media integration plan.  </p>  <p>  \tAnd save even more time by streamlining your social media tasks using automation tactics and tools.  </p>  <p>  \t<strong style=\"\">There are many methods by which you can accomplish integration and automation, and an equal number of ways you can mess them up!</strong>  </p>  <p>  \tSocial Media Integration Essentials outlines the different methods of integrating and automating your social media presence using best practices, while addressing common problems.  </p>  <p>  \t<strong style=\"\">The course helps you build a well-oiled social media machine from your existing strategy, and helps you find the best integration methods and automation tools to accomplish your online marketing goals.</strong>  </p>  <p>  \tIt is recommended that the Social Media Widgets Essentials course is taken before this course.  </p>  <p>  \t<strong style=\"\">Topics include:</strong>  </p>  <ul style=\"\">  \t<li>Sharing, integration, and embedding methods for YouTube videos and Flickr images </li>  \t<li>Integration methods used in media sharing communities like Pinterest and SlideShare </li>  \t<li>Recap of integration methods covered in the Social Media Widgets Essentials course </li>  \t<li>Overview of integration and automation methods such as connecting accounts </li>  \t<li>Overview of social media management tools like HootSuite </li>  \t<li>Using HootSuite for connecting social media accounts and blog posts, and for scheduling and automating updates </li>  \t<li>Planning your integration and automation methods and creating a social media integration plan</li>  </ul>  <p>  \t<strong style=\"\">Social Media Integration Plan worksheet included!</strong>  </p>", 
    "end_date": null, 
    "title": "Social Media Integration Essentials", 
    "price": "30.00", 
    "instructors": "Deltina Hay", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206930_80e2_2.jpg", 
    "course_url": "https://www.udemy.com/social-media-integration/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T00:41:48Z"
}