{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>CURSO DE SOCIAL ADS - VÍDEO AULA</strong></p><p>Percebemos que ter somente uma presença em redes sociais e um excelente marketing de conteúdo não significa ter um impacto suficiente para ter bons resultados orgânicos. Com a queda de alcance e consumo nos canais sociais, é importante pensar em ter um cenário de mídia paga em sua estratégia para fortalecer e impulsionar os posts, vídeos e toda comunicação da campanha.</p><p>O curso de \"New Media – Social Ads\" aborda como facilitar uma gestão 360 graus nos canais sociais para impactar o usuário em vários touch points, exemplos práticos de como anunciar no Waze, Foursquare, Linkedin, YouTube, Twitter, Facebook, e em breve Pinterest e Instagram ads.</p><p><strong><br></strong></p><p><strong>Objetivos:</strong></p><ul><li>Ensinar desenvolver estratégias para comunicação em redes sociais e crie campanhas objetivas e lucrativas.</li><li> Incrível oportunidade de ter um visão gerencial em anúnciar (self-service) nos canais sociais.</li><li>Canais sociais: Facebook Ads, YouTube Ads, LinkedIn Ads, Waze Ads, Foursquare Ads, Twitter Ads, Google+ Ads</li><li>Aprendizados em Setup e gestão de campanhas pela própria plataforma nativa de cada rede social</li><li>Estudo de casos e utilidades de como funciona na prática</li></ul><p><strong><br></strong></p><p><strong>Duração:</strong></p><p>O Curso de Social Ads em vídeo aulas tem carga horária total de 75 minutos.</p><p><strong><br></strong></p><p><strong>Público Alvo:</strong><br></p><p>Destinado a profissionais de marketing, empreendedores e anunciantes em geral. Qualquer pessoa que tem interesse de anunciar em redes sociais, que tenha conhecimento básico em anúncios (ex.: Facebook Ads ou Google Adwords)</p><p><br></p><p><strong>Professor:</strong></p><p>Felipe Spina atua há 10 anos com Marketing Digital, é autor dos livros \"Facebook Marketing\" e \"Technical Marketing\". É formado em Sistemas Virtuais pela Faculdade Oswaldo Cruz, também estudou Planejamento de Mídias Digitais na FGV, e Planejamento de Mídia no Bootcamp da Miami Ad School, quando ganhou o prêmio de TOP DOG.<span></span></p><p><br></p><p><strong>Conteúdo Programático:</strong></p><ul><li>Introdução</li><li>Plano de Social Media Básico</li><li>Facebook Ads</li><li>YouTube Ads</li><li>LinkedIn Ads</li><li>Waze Ads</li><li>Foursquare Ads</li><li>Twitter Ads</li><li>Pinterest</li><li>Instagram</li><li>Outros Canais</li></ul><p><strong><br></strong></p><p><strong>Por que escolher a ComSchool?</strong></p><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas</li>", 
    "end_date": null, 
    "title": "Social Ads", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725514_72a3_3.jpg", 
    "course_url": "https://www.udemy.com/social-ads-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T12:50:26Z"
}