{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Social  Media Marketing Classroom</strong></p>    <p style=\"\"><strong style=\"\">Drive  Traffic and Leads Using the Power of LinkedIn, Facebook, Twitter and YouTube</strong></p>    <p style=\"\">The growth of social media as a powerful marketing platform has helped  companies and entrepreneurs, that know how to use it, achieve great success  online. If your business is not  generating new leads on LinkedIn, Facebook, Twitter, and YouTube, you’re  missing out on a huge market of people who are waiting to buy your products and  hire your services.</p>    <p style=\"\">With Social Media Marketing Classroom, you won’t need years of  professional training to become an expert in social media marketing. You just need a willingness to learn and adapt  quickly to the changes of the industry. Literally,  anyone can use the information we provide to generate targeted leads for their  business (absolutely for free!), and all it takes is a few hours of your time  every week.</p>    <p style=\"\">Promoting through social media sites increases your online presence  and improves the public image of your brand, helping you connect more readily with  new and existing buyers or subscribers who generate revenue for your business. Instead of building a wall between yourself  and your customers, you can address their concerns and questions directly on  Facebook or Twitter!</p>    <p style=\"\">Social Media Marketing Classroom includes all of these lessons, and  more, in over five hours of high quality video presentations. The training program is divided into 40+  separate lessons that contain detailed explanations and step by step  instructions to help you make the first move and drive fresh traffic and leads  to your product pages.</p>    <p style=\"\">Worried about competition? Instead  of trying to compete with multi-million dollar companies at their own game and  failing, this course will teach you how you can use your advantages as a  smaller business to personalize your branding efforts and let your existing  clients become the promoters themselves!</p>    <p style=\"\">The full course includes four different modules for each of the most  popular social media sites:</p>    <p style=\"\"><strong style=\"\">Facebook  Classroom</strong></p>    <p style=\"\">Facebook is, without a doubt, the most popular and effective social  media site on the Internet, but many entrepreneurs and companies waste their  time because they don’t know how to use it. These video lessons will help you utilize the  unique features of Facebook and drive targeted traffic to your website.</p>    <p style=\"\"><strong style=\"\">Pinterest  Classroom</strong></p>    <p style=\"\">You may not realize how much your business stands to benefit from the  visual format of this website, which is why this module describes every  possible scenario where this powerful image-sharing platform can generate  revenue.</p>    <p style=\"\"><strong style=\"\">Linked in  Classroom</strong></p>    <p style=\"\">Linked helps connect with industry leaders in your niche, creating a  business network of potential clients and partners.</p>    <p style=\"\"><strong style=\"\">Twitter  Classroom</strong></p>    <p style=\"\">Twitter utilizes the unique power of a microblogging platform to not  only promote your brand to thousands of targeted followers, but also keep an  eye on new products, customer complaints, and latest developments in real time.</p>    <p style=\"\">What are you still waiting for?</p>    <p style=\"\">Don’t let your competition get all the free traffic and customers! Join us at the Social Media Marketing  Classroom, and take your business to the next level!</p>    ", 
    "end_date": null, 
    "title": "Social Media Marketing Classroom", 
    "price": "30.00", 
    "instructors": "Earners Classroom, Web Developer Matt Carson, Mikel Costa", 
    "commitment": "17 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54971_ca16_4.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-classroom/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-18T23:28:52Z"
}