{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Social Media Marketing / Online Marketing / Digital Marketing</strong></p><p>What does it all mean?</p><p>How can you use it to benefit your business and get sales?</p><p>  \t<strong>Social Media Marketing - A Confusing Subject</strong>  </p>  <p>  \t                      Just imagine if Social Media Marketing made sense.  </p>  <p>  \t                      Imagine what it would be like if someone said \"you should be on Facebook because of this strategic reason\"... Instead of \"you need to be on Facebook\" as a pointless activity.  </p>  <p>  \t                      There is so much confusing and conflicting information out there, that it is difficult for the entrepreneurial small business owner, to know where to even begin to start when it comes to a social media marketing campaign.  </p>  <p>  \t                      What platform should they be on?  </p>  <p>  \t                      Should they be on all of them?  </p>  <p>  \t                      What is the return on investment?  </p>  <p>  \t                      Why doesn't it seem to work for our business?  </p>  <p>  \t                      All of these questions and more will become clear once you have gone through this course.  </p>  <blockquote>  \t<em>Complete Course  \t  \t                              While listed for beginners, this is a great course for anyone that works in Social or plans on using Social to promote their business. This IS NOT a quick way to drive traffic using social media, it is a solid course that will help you develop a solid, long term, strategy using social to augment your other marketing efforts.  \t  \t                           ~ Kip Ferguson    </em>  </blockquote>  <p>  \t<strong>Content Marketing As A Part Of Social Media Marketing</strong>  </p>  <p>  \t                      In this course you will learn about content marketing as an integrated component of social media marketing.  </p>  <p>  \t                      We explore the principles of content marketing, what constitutes good content and how to share that content.  </p>  <p>  \t<strong>Who Is This Course For?</strong>  </p>  <p>  \t                      This course is for the entrepreneurial small business owner who wants to launch a successful social media marketing campaign.  </p>  <p>  \t                      It is also for any staff members who are tasked with social media marketing.  </p>  <p>  \t                      Social media marketers will also find this course useful for deepening their understanding of the subject and deepening the offering of their services.  </p>  <p>  \t<strong>Who This Course Is Not Suitable For</strong>  </p>  <p>  \t                      This is not a button pushing tutorial, we will not be showing you how to set up a Facebook profile etc, this is a strategic and philosophical look at social media marketing and how to apply the principles of social media marketing to a business.  </p>  <p>  \t                In this course we will focus on the \"WHY\" primarily and then show you with broad brush strokes the strategic \"HOW\" of a social marketing campaign.  </p>  <p>  \t                A good social media marketing campaign takes at least a year before it starts to reach critical mass, so this is not a course on shortcuts.  </p>  <p>  \t                      So if you are look for quick short term results, this course is not for you.  </p>  <p>  \t<strong>What Is Taught In The Course:</strong>  </p>  <ul>  \t<li><strong></strong>Social media marketing myths</li>  \t<li>Social media marketing objectives</li>  \t<li>The principle of continuous marketing</li>  \t<li>Understanding social media marketing</li>  \t<li>Referral networks</li>  \t<li>Social proof</li>  \t<li>Social media and SEO</li>  \t<li>Social media platforms explained</li>  \t<li>Social media marketing and your website</li>  \t<li>Social media to sale - the seven steps</li>  \t<li>Social media marketing plan</li>  \t<li>Content creation - the golden rules</li>  \t<li>Content creation - a lesson from the movies</li>  \t<li>Choosing your content</li>  \t<li>Sourcing content ideas</li>  \t<li>Narrative marketing - the power of story telling</li>  \t<li>Long tail and short tail content</li>  \t<li>Niche marketing</li>  \t<li>Creating calls to action</li>  \t<li>Taming your Social Media Marketing Monster</li>  \t<li>How to set up digital sales funnels</li>  </ul>  <p>  \t<strong>Learn And Earn</strong>  </p>  <p>  \t                      The biggest problem with social media marketing is that not that many people are actually any good at it.  </p>  <p>  \t                  That means there is an opportunity for a business to compete at a totally different level if they understand social media marketing and how it works.  </p>  <p>  \t                      Take the course and learn how to create a solid social media marketing campaign that will generate interest, engagement and ultimately sales.  </p>  <p>  \t<strong>Questions This Course Answers:</strong>  </p>  <ul>  \t<li><strong></strong>Where do I start with social media marketing</li>  \t<li>What platforms should I use</li>  \t<li>How much time should I spend on social media marketing</li>  \t<li>How long will it take to get results from my social media marketing</li>  \t<li>What is content marketing</li>  \t<li>How does content marketing work</li>  \t<li>Should I be on Google+</li>  \t<li>How do I create a sales funnel</li>  </ul>", 
    "end_date": null, 
    "title": "Social Media Marketing For Business", 
    "price": "35.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352000_1868_10.jpg", 
    "course_url": "https://www.udemy.com/learn-social-media-marketing-strategic-guide-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T15:40:23Z"
}