{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      This high level course will give those who understand marketing the competency to begin to frame a social media plan that will accomplish the desired objectives.  It covers:  </p>  <ul>  \t<li>Basic understanding of social media</li>  \t<li>What social media  is good for</li>  \t<li>Why social media is an essential part of today’s marketing mix </li>  </ul>  <p>  \t    and then goes into detail on  </p>  <ol>  \t<li>Social media marketing plan</li>  \t<li>Keyword discovery and research</li>  \t<li>Content discovery</li>  \t<li>Search optimization</li>  \t<li>Adwords and the use of multiple social media platforms like </li>  \t<li>Linkedin</li>  \t<li>Twitter</li>  \t<li>Facebook</li>  \t<li>Google+</li>  \t<li>Email</li>  \t<li>Mobile</li>  \t<li>Event marketing and </li>  \t<li>pulling together the social media team and the all important </li>  \t<li>editorial calendar  </li>  </ol>  <p>  \t    The course includes a workbook template for each lesson's exercises.  If completed, you will have a draft social media marketing plan ready for implementation.  </p>  <p>  \tThe course will take about one hour to complete.  The exercises will require as much time as you have available to prepare a quality social media marketing plan.  </p><p><strong>The course includes two bonus features not found anywhere else:</strong></p><p>First, if you make a commitment to finish the course and its exercises by any date of your choosing, I will review your plan and give you feedback.  Such an effort will enable you to create your plan and help refine it based upon my experience<span>. I say any date of your choosing to help motivate you to \"get it done\" but at your own pace.</span></p><p><span>Second, if you do a good job by clearly demonstrating in your plan that you know how to pull the plan together.  Which is, by the way, the purpose of this course, for you to learn not only what should be done but <strong>how</strong> to do it.  I will give you a personal recommendation that you can use to help get a job or for any other purpose like posting on your Linkedin profile.</span></p><p><span><strong>This is in addition to getting a course completion certificate provided by Udemy to prove you have the skills to get the job done.</strong></span></p>", 
    "end_date": null, 
    "title": "Social Media Marketing Demystified", 
    "price": "30.00", 
    "instructors": "David Fradin, Mary Gospe", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361304_4792_5.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-for-b2b-and-b2c/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T09:52:08Z"
}