{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you are a business owner or manager of a business, you have seen a lot of technological changes in the way business processes are implemented. Marketing has not been immune to these changes; especially in the form of social media and social marketing. But the options can be so confusing. <em>And even now, with so many people ON social media, it still can be overwhelming for a business owner as far as time and focus. </em><strong>Incorporating social media into your marketing plans is a must because it is by far the most effective means of attracting and connecting people with your products and services. </strong>Many shy away from the new social sites and the possibility of tapping into a viral marketing campaign because getting started can be extremely intimidating. The course will take you <em>step-by-step, day-by-day</em>, to get your social media program up and running. Over a 30-day period, you will: </p><ul><li>Start planning and gathering documentation for use in setting up your free social media accounts </li><li>Set your social media activity goals to make sure you gain social influence at the same time </li><li>Set up your accounts in each of the main platforms including Facebook, Pinterest, Twitter, Google+, Youtube, LinkedIn. </li><li>and more...</li></ul>As if this wasn't enough, I will be updating the course with expert extras and additional resources as necessary and in ways that won't overwhelm your time to learn or incorporate. Some bonuses will include: <ul><li>Hiring the Right Social Media Manager </li><li>Social Traffic Tactics </li><li>More in-depth or updated information on individual platforms </li></ul><p><br></p><p>Don't delay. If you are ready? Let's Get Social!<br></p>", 
    "end_date": null, 
    "title": "Social Media Marketing for Start Ups - A 30-Day Plan", 
    "price": "20.00", 
    "instructors": "Cassandra Fenyk", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556238_083f_2.jpg", 
    "course_url": "https://www.udemy.com/from-small-to-social-in-30-days-for-small-business-owners/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T12:34:40Z"
}