{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>The Social Media for Business Owners Course.</strong></p>\n\n<p>This course shows you how to use Social Media for your business to Increase Customers, Improve profitability and get your brand message across to more of your Followers</p>\n\n\n\n<p>We all use social media in our daily lives,but are you using it properly for your business, or to get that job in Social Media?<br></p>\n\n\n\n\n\n<p>If not, why not? Your Competitors almost certainly are and you could be missing out BIG TIME by not having a cohesive and well thought out Social Media Strategy.</p>\n\n\n\n\n\n<p>This course will show you how to Increase your followers across all of the leading social media platforms.</p>\n\n\n\n\n\n<p>It will show you how to complete a social media audit to highlight any deficiencies in your marketing whilst explaining how to fix them.</p>\n\n\n\n\n\n<p>Some of the many other things we will look at in the course are:-</p>\n\n\n\n\n\n<p>10 reasons your business should be leveraging Social Media.</p>\n\n\n\n\n\n<p>Writing quality content to expand your social network.</p>\n\n\n\n\n\n<p>Nine tips for increasing your click through rates on Facebook and the Ninja way of attracting customers.</p>\n\n\n\n\n\n<p>Reaching your target market on Twitter.</p>\n\n\n\n\n\n<p>Ever-Growing circles on Google+</p>\n\n\n\n\n\n<p>Fundamentals of growing a large Linked-in following and how to get that Impressive all-star profile.</p>\n\n\n\n\n\n<p>How to spot your fake followers.</p>\n\n\n\n\n\n<p>Why you should be pinning your hopes on Pinterest.</p>\n\n\n\n\n\n<p>How to use Psychology to increase sales.</p>\n\n\n\n\n\n<p>You Tube- using visual media and visual storytelling to improve your brand.</p>\n\n\n\n\n\n<p>The very best ways to put you live in front of your Customers.</p>\n\n\n\n\n\n<p>Social media image size cheat sheet.</p>\n\n\n\n\n\n<p>The power of chat Apps like WhatsApp, Line, Snapchat for advertising?</p>\n\n\n\n\n\n<p>Building your Instagram and Vine communities.</p>\n\n\n\n\n\n<p>How to measure your social media reach.</p>\n\n\n\n\n\n<p>Tools and tips for saving time on social media.</p>\n\n\n\n\n\n<p>By taking this course you will learn lots of hints, hacks and tips to get you ahead of your rivals. By properly leveraging and using the dynamic power o Social Media you will Increase your customers and Improve profitability</p>\n\n\n\n\n\n<p>Enrol now. Every few minutes you delay means your rivals could be getting ahead with their Social Media Strategy.</p>\n\n\n\n\n\n<p>I look forward to seeing you Inside</p>", 
    "end_date": null, 
    "title": "Social Media For Business Owners: Social Media Training", 
    "price": "35.00", 
    "instructors": "Michael Ingram", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526382_1573_2.jpg", 
    "course_url": "https://www.udemy.com/the-social-media-compendium-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T23:01:24Z"
}