{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Ihr Buch ist fertig? Glückwunsch! Leider haben Sie jetzt erst die Hälfte der Arbeit geschafft. Egal, ob Sie im <strong>Selfpublishing </strong>oder über einen <strong>Verlag </strong>veröffentlichen: Sie müssen präsent sein – und zwar dort, wo Ihre Leser sind, und das sind heute die sozialen Medien.</p><p>Dieser Kurs macht Sie mit allen relevanten Netzwerken vertraut. Sie erfahren, welche Kanäle es gibt, wie Sie diese nutzen und welche <strong>speziellen Regeln</strong> Sie jeweils beachten müssen. Wenn Sie den Kurs absolviert haben, wissen Sie:</p><ul><li>Wo Sie ihre Leser und Fans finden (Sie müssen nicht überall online sein!)</li><li>Wie Sie <strong>spannende Beiträge</strong> schreiben – mit ansprechenden Bildern und verlockenden Überschriften</li><li>Wie Sie soziale Medien nutzen und dabei Zeit sparen: Richtig kombiniert, brauchen Sie nicht für jeden Kanal neue Inhalte, sondern höchstens eine andere Form</li><li>Wie Sie durch Soziales Lesen Rezensionen für Ihre Bücher erhalten</li><li>Was Sie in den Social-Media-Kanälen <strong>vermeiden </strong>sollten</li><li>Welche Inhalte von Ihren Fans nicht nur gern gelesen, sondern auch gern weitergegeben werden</li><li>Wie Sie im Fall eines <strong>Shitstorms </strong>am besten reagieren</li><li>Was die am meisten unterschätzten (und dabei hoch effizienten) Wege sind, Ihre Leser zu erreichen</li></ul><p>Jeder Abschnitt dieses Kurses kümmert sich um ein soziales Medium. Ich führe Sie zunächst in seine Besonderheiten ein und erkläre Ihnen dann <strong>haargenau</strong> und verständlich, wie Sie das betreffende Angebot am besten nutzen. Sie erfahren, welche Werkzeugen Ihnen die Arbeit erleichtern und wie Sie die Effizienz Ihres Marketings verbessern. </p><p>Der Kurs hat etwa den Umfang eines <strong>Wochenend-Seminars</strong>, für das Sie sonst einige Hundert Euro zahlen müssten. Jeden Abschnitt beendet eine Mini-Prüfung. Zum Schluss erhalten Sie ein Zertifikat über die Kursteilnahme. Sie können mir auch während des Kurses oder danach stets Fragen stellen, zudem stehen die Kursinhalte lebenslang für Sie bereit.</p><p>Denken Sie daran: Sie verfolgen ein großes, lohnenswertes Ziel. Durch schlüssige Social-Media-Nutzung <strong>verringern Sie mit jedem weiteren Buch, das Sie veröffentlichen, den für das Marketing nötigen Zeitaufwand</strong>. Investieren Sie jetzt etwas Zeit, um später umso mehr zu sparen.</p>", 
    "end_date": null, 
    "title": "Soziale Medien für Autoren: Verwandeln Sie Leser in Fans!", 
    "price": "50.00", 
    "instructors": "Matthias Matting, Dozentin Kathrin Hamann", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665756_fa2f.jpg", 
    "course_url": "https://www.udemy.com/soziale-medien-fur-autoren/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-10T12:00:12Z"
}