{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t      Google+ Hangouts Can Truly Rock Your Business Because They Are The Ultimate Strategy To Boost The Know, Like And Trust Factor That Entice Your Ideal Clients To Buy More EASILY From You!  </p>  <p style=\"\">  \t            My 'Hangout Authority' Training Will Answer  \t             ANY Question You Have About Conducting Successful Hangouts!  </p>  <p style=\"\">  \t            The Hangout Authority Training will help you get started and get results with your LiveStream events and YOU'LL NEVER FEEL OVERWHELMED BY THE TRAINING.  </p>  <p style=\"\">  \t            Here's What You Get As Part Of The Training Modules That Will Help You Catapult The Results You Get With Each Hangout!  </p>  <p style=\"\"><strong style=\"\"><em style=\"\">Module 1: Getting Started With Google+</em></strong></p>  <p style=\"\">  \t            This training has specifically been created to show you how to quickly and easily set-up your Google+ account which will allow you to share content that can get ranking quite high on Google and bring you a flood of new traffic and more buyers ready to buy your products and services.  </p>  <p style=\"\"><strong style=\"\"><em style=\"\">Module 2: Learning The Google+ Hangouts Platform</em></strong></p>  <p style=\"\">  \t            This training is a walk-through that will show you the different functions of your Google+ account so that you can conduct your Hangouts with <em style=\"\">ABSOLUTE </em>confidence.  </p>  <p style=\"\">  \t            This entire module is a step-by-step training and once you're done, you'll never be stumped again by any functions on your Google+ Hangouts platform!  </p>  <p style=\"\">  \t<strong style=\"\">I leave no stones unturned and NO QUESTIONS UNANSWERED!</strong>  </p>    <p style=\"\"><strong style=\"\"><em style=\"\">Module 3: Launching Your First Google+ Hangouts</em></strong></p>  <p style=\"\">  \t            This is where the excitement begins!  </p>  <p style=\"\">  \t            I'll show you a real LIVE example!  </p>  <p style=\"\">  \t            I've invited one of my colleagues to help me show you how I do my own Hangouts so you learn from a real example and not only from static screen capture photos.  </p>  <p style=\"\">  \t            It's also like watching over my shoulder!  </p>  <p style=\"\">  \t<strong style=\"\">You'll Be A Hangout Pro In No Time!</strong>  </p>  <p style=\"\">  \t            Google+ Hangouts are a powerful way to seriously increase your authority and the connection you have with your audience.  </p>  <p style=\"\"><em style=\"\"><strong style=\"\">Here's What Clients Have To Say:</strong></em>  </p>  <p style=\"\"><em style=\"\">\"To me, Google+ Hangouts on Air provides the best of both  worlds: the ability to share slides in a traditional webinar format with  the added fun of showing my face and conducting more of an  interpersonal event that's a better all-around experience for the  attendees. How do I get this up and running? Of course I could figure  this all out myself. Or I could speak to an expert. So I reached out to  Miss Krizia. I run a ten-person company and don't have the time to  really figure out the ins and outs of new technologies. I want help to  get up and running quickly. And Miss K knows the answers.\" <strong style=\"\">Gene Marks, Contributor to Forbes Magazine</strong></em></p>  <p style=\"\">  \t<em style=\"\"> \"Not only does Miss K truly CARE about her customers,  she also puts together great, actionable content and supports them well.  Miss K is ALWAYS my go-to source when it comes to publishing, Google+  Hangouts and YouTube marketing\".</em> -- Kenny Cannon, New York, U.S.A, President at IPitch Consulting Group  </p>", 
    "end_date": null, 
    "title": "Start Using Google+ Hangouts to Grow Your Business", 
    "price": "20.00", 
    "instructors": "Krizia MissK", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191812_a9d6_2.jpg", 
    "course_url": "https://www.udemy.com/grow-your-business-with-google-hangouts/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-31T17:42:05Z"
}