{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>What do you get?</strong></p><ul><li><strong>Start your own freelance social media management business</strong></li><li><strong>Break 6 figures per year as a social media manager</strong></li><li><strong>Free downloads, templates, guides and support</strong></li><li><strong>30 DAY MONEY BACK GUARANTEE</strong></li></ul><p><strong></strong></p><p>  \t<strong>Ever fancied starting your own business? Social media is THE hot topic that businesses around the globe need help with. Train with us to start your own freelance social media management business.</strong><em>.</em></p><p><em>Join over 3,500 students and create a business of your own. This course is growing by the day and new content is being added as we receive feedback. Last update: March 3rd 2015.</em></p>    <p>  \t<strong>Introduction to this course</strong>  </p><p>This course takes you step-by-step through the process of establishing a credible social media management company. The same blueprint we used to start our own social media management company that has gone on to support global brands and organisations.</p><p><strong>Why become a social media manager? The numbers talk....</strong></p><ul><li><strong>97%</strong> of all consumers search for local businesses online</li>  \t<li>But only <strong>12%</strong> of businesses using social media feel they actually use it effectively</li><li>The average social media manager earns $85,000 per year!</li>  </ul>  <p>  \t<strong>Who are we?</strong>  </p>  <p>  \t                      SO ME Academy are a best-selling Udemy author. Our social media courses are consistently rated 5 stars and we have taught over 22,000 students. We are a collection of social media professionals who have worked with small businesses, charities and some of the world's largest brands.</p><p><strong>PLEASE NOTE:</strong></p><p>This course is about starting a social media management business. The blueprints, the documents, the sales process. If you'd like to learn the intricate details of the social media platforms, check out our other course- \"Social Media Marketing 2015- The Complete Course\".</p>  <p>  \t<strong>How we support you</strong>  </p>  <p>  \t<strong></strong>With over 11 years' experience of supporting and accelerating some of the UK's most successful companies, SO ME Academy is uniquely placed to help you prepare your own business as a freelance social media manager. As a student of SO ME Academy you will be eligible for on-going support via the discussion functionality, Twitter or access to our exclusive \"Social Media Management Group\".  </p>  <p>  \t                  We look forward to welcoming you as a student and helping you launch your own business.  </p>    <p>  \t<strong>    DON'T FORGET: Udemy operates a 30 day full money back guarantee, no questions asked! If you're not happy with this course you can request your money back.  </strong>  </p>    <p>  \t<strong>    Click the \"take this course\" button</strong> straight away at the top right of this page to unlock the power of social media for your business.  </p>", 
    "end_date": null, 
    "title": "Start a social media management business - Financial freedom", 
    "price": "20.00", 
    "instructors": "SO ME Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366158_ddfe_8.jpg", 
    "course_url": "https://www.udemy.com/become-a-freelance-social-media-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T22:01:01Z"
}