{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><p style=\"\">Have you been <strong style=\"\">told &quot;social media marketing strategies&quot; is what  you MUST</strong> do if you want your small business to grow? Are you <strong style=\"\">frustrated with  every tip and trick out there</strong> and nothing seems to work?</p>  <p style=\"\">Here is the deal: <strong style=\"\">Marketing has NOTHING to do with social  media</strong>. Social media is a great place to implement a marketing strategy, if you  choose. So learning a marketing strategy, a strategy that brings:</p>  <p style=\"\">·&nbsp; leads,</p>  <p style=\"\">·&nbsp; referrals,</p>  <p style=\"\">·&nbsp; visibility,</p>  <p style=\"\">·&nbsp; press</p>  <p style=\"\">·&nbsp; and customers</p>  <p style=\"\">to YOUR business is the key. A strategy you can use  anywhere, at any time, based on the platforms (i.e. Facebook, Twitter, LinkedIn  and more) you like or better yet, where you target market shows up.</p>  <p style=\"\"><strong style=\"\">You don’t have to do  everything to be effective in social media</strong>, you just need the right social media strategies  to attract the right people, engage them, in less time.</p>    <p style=\"\">We can show you how.</p>    <p style=\"\"><strong style=\"\">Ann M. Evanston, MA</strong>  created this Social Media  Training program in 2007, and has been named a top marketing consultant  by About.com and written up in The Huffington Post for her effective marketing  in social media and the results it gets her clients. Now you have access.</p>  <p style=\"\"><strong style=\"\">Lisa Ann Landry MSM</strong>,&nbsp; is a small business owner, international  trainer, facilitator and coach. As an early student of this program, she saw  the results for her own business and over the years has taught hundreds of  businesses the “SNCC Way” social media marketing system with high praise. Her  insights to utilizing the program take it to a new level. And we bring that  together - here.</p>  <p style=\"\">This social  media training program is less about how to tweet or build a page or  profile, it is more about what marketing strategy will work for your business  online<strong style=\"\">. It is about how to create the  best compelling content</strong> (let’s face it, if you want to be online you need  “content”!) that makes people want to be a part of YOUR brand.</p>  <p style=\"\">That will drive business results!</p>  <p style=\"\">In this Social  Media Training course you will learn social media marketing strategies for small  business; also (see course objective to the right):</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Strategies for Marketing Successfully in Social Media", 
    "price": "50.00", 
    "instructors": "Ann Evanston, Lisa Ann Landry", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37926_f644_3.jpg", 
    "course_url": "https://www.udemy.com/strategies-for-marketing-successfully-in-social-media/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-24T17:10:14Z"
}