{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The life of an Entrepreneur can be very hard at the beginning of the journey, especially if you don’t have a budget for large promotions to get your brand out there and start selling. That's why <strong>I'm here to help</strong>! </p>        <p>I started my journey with Social Media working at digital campaigns for large brands in the movie industry. After that, I helped lots of entrepreneurs and start-up businesses establish an online presence and increase their sales. These two completely different experiences taught me how  to use Social Media to <strong>turn any product into a BLOCKBUSTER</strong>. And that’s what I’m going to teach YOU with this course.<br></p>    <p>At each lecture you will be one step closer to success; I will teach you how to complete your Social Media Strategy for your brand and will provide you with <strong>3 fundamental, ready to use FREE templates</strong>: the templates for your editorial plan, your editorial calendar and your analytics report. You won't find these materials ANYWHERE ELSE!</p><p>We’re also going to discuss an <strong>amazing case study</strong>. Not the boring, Academic examples about Apple, LEGO or Samsung, we’ll see how one specific movie became superhero in Social Media and what entrepreneurs like you can learn from it so YOU can become a SUPERHERO in your industry too!<br></p><p>All the students who complete my course will also have access to <strong>other resources</strong> for an incredibly special price, such as consultations or assignment review.</p>    <p>Now, hit that purchase button, I’ll see you on the other side!<br></p><p>_____________________</p><p><em>Promo video illustrations by Freepik, promo video music \"Italian Afternoon\" by Twin Musicom</em></p>", 
    "end_date": null, 
    "title": "The complete Social Media Marketing course for Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Laura Bartoli", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629544_2092.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T10:54:37Z"
}