{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t    This course is going to be about Twitter. We are going to start by explaining why is good idea to use Twitter in your business and marketing strategy online. Then we are going to explain to you a few sentences how to get started with Twitter and how is best way to use it for your business and how to use it for your advantage. We will talk about few important facts about the social media that will help you to use it better for your business and marketing strategy. In the end we move to Twitter instruments that are also a good idea to use it.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">The course include the following video topics:</strong>  </p>  <p>  \t  1. Why Twitter.  </p>  <p>  \t  2. Getting started with Twitter.  </p>  <p>  \t  3. Hashtag.  </p>  <p>  \t  4. Important tips and facts.  </p>  <p>  \t  5. Twitter marketing instruments.  </p>  <p>  \t  6. Presentation Book.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">A few word about the author of this course Dessislava Dobreva:</strong>  </p>  <p>  \t  I believe that if a person can learn to get out of his comfort zone as much as possible, he will have incredible experiences and develop personally in ways that are otherwise impossible.  </p>  <p>  \t  I am really passionate about two things - foreign languages &amp; brand management  </p>  <p>  \t  My greatest strengths:  </p>  <p>  \t  - my motivation  </p>  <p>  \t  - my ability to flourish in an international environment  </p>  <p>  \t  - my writing &amp; presentation skills  </p>  <p>  \t  - the fact that I am convinced that life is 10% what happens to me and and 90% how I react to it.  </p>  <p>  \t  Creating an E-learning for Ecognise in 2 languages, called &quot;Turn your “don’t”-s into “do”-s: how to boost your business through social media&quot;. The product consists of videos, powerpoint presentations and articles on the forementioned topic, aimed at entrepreneurs who would like to better explore opportunities for promoting their business in Facebook, Pinterest, Google+, Twitter and Youtube.  </p>  <p>  \t  And his motto is:  “GET OUT OF YOUR COMFORT ZONE!”  </p>", 
    "end_date": null, 
    "title": "The business side of Twitter", 
    "price": "20.00", 
    "instructors": "Slavi Slavov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410854_372a_3.jpg", 
    "course_url": "https://www.udemy.com/the-business-side-of-twitter/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T12:32:16Z"
}