{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><strong>5000 + students</strong> \n\n</li></ul>\n\n<ul><li><strong>150 reviews with an average      of 4.4/5</strong> \n\n</li></ul>\n\n<ul><li><strong>Business podcast 'Breaking      Biz' with over 10,000 subscribers </strong>\n\n</li></ul><p><br></p><p>This course is designed to simplify the best practices of advertising on Instagram so you can understand how to use the platform to grow your brand, engage your audience and achieve your campaign objectives.</p>\n\n<p><strong>Master the art of advertising on Instagram using proven, simple and effective techniques.</strong></p>\n\n\n\n\n\n<ul><li>Discover how Instagram      advertising works\n\n</li><li>Learn simple growth tactics      to gain a larger following\n\n</li><li>Understand how to create contents      that engage your audience\n\n</li><li>Enjoy real life case studies\n\n</li></ul>\n\n\n\n<p> <strong>Knowing how to use Instagram effectively is an essential element of today's online marketing requirements.</strong></p>\n\n\n\n<p>In the course you will learn a step by step guide to creating your first Instagram ad. You'll also discover how to use emojis and filters as well as gain an understanding of your most beneficial posting days and times. </p>\n\n\n\n<p>From understanding the basics, through to learning simple Instagram techniques, you will leave this course ready to engage the Instagram users and grow your brand.</p>\n\n\n\n<p>I designed this course to offer you an easy to follow, comprehensive guide to using Instagram. Instagram is a topic that can be made complicated very quickly. This is why I have prepared slide presentations with a running commentary, so you can enjoy the visuals and explanations that go with them. </p>\n\n\n\n<p>I hope you enjoy learning the Instagram basics, and I look forward to connecting with students who have any requirements or questions.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The Beginners Guide To Advertising On Instagram", 
    "price": 0, 
    "instructors": "Fred Williams", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801104_c9f9_2.jpg", 
    "course_url": "https://www.udemy.com/the-beginners-guide-to-advertising-on-instagram/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T18:19:29Z"
}