{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The most comprehensive 'ground level-up' marketing for Periscope course available online. Generate huge amounts of untapped (free) traffic, leads and sales for your online websites, products and services with a simple tap of your smartphone's screen. </p><p><strong>In this course you'll learn:</strong></p><ul><li>Why Periscope Live Video Broadcasting is the best source of free, targeted, worldwide web traffic today</li><li>How to easily setup, install &amp; navigate the Periscope app (both iOS and Android)</li><li>How you can build your following with the perfect profile</li><li>How to increase your response rates by using Periscope inbuilt notification system getting more viewers each time you broadcast</li><li>How to make the most of your \"make or break\" initial scope (doing this right will build the best foundation for massive follower growth)</li><li>The 4 important keys to crafting a compelling, audience grabbing title</li><li>The 9 types of broadcasts you can use to hone your message and get the ideal response</li><li>Exactly WHEN you should be broadcasting for maximum response</li><li>How to turn negative/nasty broadcasts into something your viewers will keep watching &amp; come back for more</li><li>Discover the best time (and ways) to ask for hearts, followers &amp; shares</li><li>Learn how to properly interact and engage with comments</li><li>Crafting &amp; deploying your elevator pitch multiple times in your scope</li><li>How to block the 'trolls'</li></ul><p>This course is specifically targeted for online entrepreneurs, website owners, bloggers, artists, coaches and public figures to maximize your online <strong>marketing using the Periscope platform. </strong></p><p>Throughout this course we will discuss the implications and practical application of live video streaming in your business, but to make things even more beneficial for you, we have also included specific marketing training so that you can learn how to:</p><ul><li>Turn every broadcast into an opportunity for solid calls to action</li><li>Expand your social media following on all platforms</li><li>Properly use cross-promotion to increase your followers, leads &amp; sales</li><li>Automate half of your broadcasts, using a free (hyper powerful) software tool</li><li>Get your Periscope viewers onto your email marketing list</li><li>Turn your Periscope audience into cold, hard cash</li><li>'Exploit' popular trends to increase your Periscope following</li><li>Turn your scopes into a rich source of evergreen content</li><li>6 action steps to get you started today</li></ul><p><strong>...and much, much more!</strong></p><p>My team and I have been developing marketing tools and teaching training strategies for better online marketing for almost 10 years, generating multiple 7 figures in product sales and affiliate marketing income. </p><p>We've been diving wholeheartedly into live video streaming, with Periscope being the fastest and easiest way to get a fresh source of traffic - within seconds of hitting the broadcast button. It's a simple strategy that anyone can follow, whether you are just starting out, or have an established business and want to benefit from this growing marketplace - which is why we have created this course, to help you to jump aboard and leverage this booming phenomenon. </p><p>Within two hours you will know everything you need to know to market anything you choose, using the Periscope site and app like a pro!</p><p>I look forward to having you join us and connecting with you as we make our way through the course - so join up today and let's get started!</p><p>To your online success, <br>Cindy Battye &amp; The Wildfire Concepts Team</p><p><strong>P.S. If you are eager to get started it's super easy, just scroll to the top and click \"Take this Course\". See you soon!</strong></p>", 
    "end_date": null, 
    "title": "The Complete Beginners Guide to Periscope Marketing", 
    "price": "20.00", 
    "instructors": "Cindy Battye, Kory Pearman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665446_649d_2.jpg", 
    "course_url": "https://www.udemy.com/periscope-marketing-101/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-10T03:13:22Z"
}