{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">People who participate in Facebook want to connect with other people (friends, family or personalities). It is usually NOT their main objective to connect with brands. However, most brands are on Facebook, and having a Fanpage has become a self-imposed “necessity&quot; for companies. </p><p style=\"\">But for brands to connect with people, users need to perceive they can receive something in return, whether it is a fun fact, exclusive information, a great video, a discount, a promotion, or just a way to easily communicate with the brand. </p><p style=\"\">The key then, is not just to “be on Facebook&quot;, but to <strong style=\"\">use Facebook to YOUR advantage</strong>. At the end of the day, Facebook is just one more marketing channel to reach your customers and fans. Learn to use it wisely!</p><p style=\"\">Whether you are a Facebook Admin that is just getting started, or you already manage several Fanpages, this course will help you greatly improve your brands delivery and performance on Facebook.</p><p style=\"\"><strong style=\"\">Become a Facebook Marketing Expert for Your Brand</strong></p><p style=\"\">This Hands On Course will cover a range of marketing observations that will tremendously improve the way you manage your Fanpage. We´ll give you easy to grab concepts and super useful visual tips, tricks and examples that will help you position your Fanpage for success!</p><p style=\"\"><strong style=\"\">Contents and Overview</strong></p><p style=\"\">The course is broken up into three sections. We will cover:</p><ol style=\"\"><li style=\"\">The basics to constructing brand presence and brand image on Facebook and setting the expectations right. You will Discover 5 crucial elements that cannot be overlooked.</li><li style=\"\">Learn to focus on the most important things to improve Fanpage performance.</li><li style=\"\">Easy and practical tips you can apply right now.</li></ol><p style=\"\"><strong style=\"\">What Will I Learn on this course?</strong></p><p style=\"\">At the end of this course, you will start branding your product on Facebook like a pro. You will  dramatically improve the way you manage your Fanpage, and have a better understanding on what you need to focus on, that will deliver better results for your brand.</p><strong style=\"\"></strong><strong style=\"\">What is the Target Audience?</strong><p style=\"\">This course is meant for those who manage a Facebook Fanpage for a product or brand. Basic Facebook knowledge is expected.<br style=\"\"></p><p style=\"\"><strong style=\"\">About The Instructor</strong></p><p style=\"\">Beatriz Mejia has more than 10 years&#039; experience in marketing and strategic marketing communications with top multinational corporations. She has studied and worked in the US, Europe and Latin America where she has given excellent results to employers, professors and clients.</p><p style=\"\">Now self-employed, she has been developing Social Media Marketing Strategies geared toward small businesses, through her company Click-Branding. She has helped businesses manage their websites, social media and blogs, by providing targeted marketing strategies and courses specifically tailored for owners, managers, and businesses personnel.</p>", 
    "end_date": null, 
    "title": "The Essence of Facebook Marketing for Fanpage Admins", 
    "price": "20.00", 
    "instructors": "Click Branding", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564074_30eb_3.jpg", 
    "course_url": "https://www.udemy.com/the-essence-of-facebook-marketing-for-fanpage-admins/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T23:15:08Z"
}