{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Are you wanting to increase genuine leads and sales for your business? Do you want to convert social media followers to become customers?</strong>  </p>  <p>  \t<strong style=\"\">Click the &quot;take this course&quot; button straight away at the top right of this page to begin using social media to increase sales and grow your business.</strong>  </p>  <p>  \t·Are you a business owner or marketer that is struggling to understand the link between your Social media accounts and actual sales?  </p>  <p>  \t<strong style=\"\">In this course you will learn how to:</strong>  </p>  <ul style=\"\">  \t<li><span>Create a Social Media Marketing Strategy</span></li>  \t<li><span>How to grow a loyal following of your target market</span></li>  \t<li><span>How to create and maximise engaging content</span></li>  \t<li><span>How to create and set up a Sales Funnel</span></li>  \t<li><span>How to manage day to day to minimise the time spend on Twitter, Facebook and LinkedIn</span></li>  </ul>  <p>  \tThis course is f<strong style=\"\">illed with essential information that will help you reach your sales goals, without any of the jargon or fillers</strong>...so you can begin to convert your followers to customers quickly and effectively.  </p>  <p>  \t<strong style=\"\">These skills will successfully convert your social media accounts into money making machines.</strong>  </p>  <p>  \tIt is now up to you, take the 1<sup style=\"\">st</sup>step to begin to convert followers to customers in 8 simple steps  </p>  <p>  \t<strong style=\"\">Is this course for you?</strong>  </p>  <p>  \tIf you would like more customers per week then this is the course for you, with the automation software we show you, you can even increase sales with minimal initial contact with your client which mean you still have the time to run your business.  </p>  <p>  \t<strong style=\"\">WHO IS IT FOR?</strong>  </p>  <p>  \t·Entrepreneurs and small businesses looking at marketing services or products on Social Media;  </p>  <p>  \t·Entrepreneurs and small businesses that want to ensure their business grows asa result of Twitter, Facebook, LinkedIn and any other form of Social Media  </p>  <p>  \tYou will learn how to get :  </p>  <ul style=\"\">  \t<li><span>Generate more Leads;</span></li>  \t<li><span>Generate more Sales;</span></li>  \t<li><span>Generate more Quality Fans that are genuinely interested in your business.</span></li>  </ul>  <p>  \tNow is the time to make a choice, do you want to use Social Media effetely to grow your business or do you want to risk losing your customers to your competitors  </p>  <p>  \t<strong style=\"\">Discover how to grow your business and get new customers by converting followers to customers</strong>  </p>  <p>  \t<strong style=\"\">Take The Course Now!</strong>  </p>", 
    "end_date": null, 
    "title": "The complete Social Media For Business Workshop", 
    "price": "50.00", 
    "instructors": "Dominic Ryan", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315032_9817_3.jpg", 
    "course_url": "https://www.udemy.com/increase-sales-profit-with-twitter-facebook-linkedin/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T12:58:10Z"
}