{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>This course will show you how to use Twitter, Google+, Facebook, YouTube and LinkedIn to propel your business!</strong></p><p>Are you caught in a constant struggle to generate more leads and sales? Are you fed up with paying expensive advertising expenses and not getting the results you're after?</p><p>This course will help you build a social media plan that you can follow and implement, which can bring you more customers, no matter what business you're in. </p><p><strong>This is a complete, no holds barred, step-by-step guide to help you use social media for your business in the least amount of time. I'll show you what to do and how to do it.</strong><br></p><p><strong>As part of this course you will get the following:</strong></p><ul><li>You'll discover what social media is and how to use it to create social buzz so people can spread the word about your products/services and business in general.</li><li>How to convert leads into sales using social media. </li><li>You'll learn how to develop a winning social media marketing plan, and you'll discover the 7 essential steps for creating a successful social media strategy.</li><li>A step-by-step guide to get started and/or optimize your activity on Facebook, Twitter, LinkedIn, Google+ and YouTube. </li></ul><p>You could spend countless hours trying to learn all this yourself or you could simply join my course today and save yourself all the time and hassle. You can setup all your social media platforms today and start attracting new customers. If you don't have a social media plan, you're missing out on a big piece of the pie. Start today and reap the benefits - join my course now to get instant access to all the material!<span></span><br></p><p><br></p>", 
    "end_date": null, 
    "title": "The Ultimate Social Media Strategy", 
    "price": "40.00", 
    "instructors": "Wilko Van De Kamp", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661272_79a4_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-social-media-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T17:07:42Z"
}