{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is focused on Facebook marketing, both organically and thorough paid advertising, for small businesses. While big businesses most likely have dedicated people who oversee social media marketing, this course is focused on helping small business owners, who where several hats, understand how to sell through Facebook, in as little time as possible.</p><p>The course is comprised of step-by-step videos, done-for-you templates and slide deck presentations that teach not only how to create ads and market in Facebook, but help educate viewers on developing a strategy for organic posting, paid ads and consumer-generated content. </p><p>The entire course can be completed within a few hours, and is broken up into the following sections:</p><ol><li><strong>Section 1</strong>: Intro to the course. This first video discusses what is included in the course.</li><li><strong>Section 2</strong>: Getting started with Facebook. For students who have never used Facebook before, this section covers getting an account and setting up a personal profile, then creating a company profile. </li><li><strong>Section 3</strong>: Organic marketing in Facebook is the focus of this section. We'll discuss how much potential there is for businesses in Facebook, marketing organically. We'll also work to develop a content strategy for your business and/or products. </li><li><strong>Section</strong> <strong>4</strong>: This section covers paid marketing in Facebook, in depth. Students learn about the Ad Manager, Power Editor, Conversion Tracking and discuss how to develop a social sales funnel using a mix of tools and various types of ads. </li><li><strong>Section 5</strong>: In the last section, I share my list of favorite tools and resources. There are many free (and paid) resources, tools, apps, software &amp; extensions that can make the time you spend marketing on Facebook much shorter, and more effective. In this section, I give you a tour through my favorites and show you how to use each tool. </li></ol><p>From start to finish, the course will take a student completely new to Facebook and turn them into an educated marketer who can market on Facebook, both organically and paid, with great confidence! </p><p>You should take this course if you really want a comprehensive education on how to market your business and sell your products on Facebook. As this course is focused on small business owners, the intent of the course is to show you how to get the most out of Facebook in the least amount of time possible. Get started today! I'll see you inside the course. </p>", 
    "end_date": null, 
    "title": "The Ultimate Facebook Marketing Course for Small Businesses!", 
    "price": "20.00", 
    "instructors": "Jarem Atkinson", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485480_245a_4.jpg", 
    "course_url": "https://www.udemy.com/facebook-marketing-small-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T18:36:45Z"
}