{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>My Udemy Courses have been taken by over 5000 people from 135 countries. They have received consistent high ratings throughout Udemy.<br><br></strong>The Complete LinkedIn B2B Marketing Course is designed for Marketing, Digital Agency professionals and entrepreneurs seeking to learn and transform your <strong>B2B marketing performance using LinkedIn.</strong></p><p>You will learn <em>how</em> to use and apply the full range of tools, applications and hidden techniques by watching clear detailed instruction video demonstrations designed for easy digestion. The curriculum is structured in a logical, sequential order making it easy to follow and implement seamlessly into your working day.</p><p>Note: This course is updated regularly with new lectures and downloadable pdfs.</p><p><strong>What does this Marketing Course offer that others don't: <br> </strong>How to apply multiple techniques to compound marketing impact<br> Explanation and clear guidance on new marketing opportunities such as the updated Campaign Manager, Sponsored Inmails, Lead Accelerator and Elevate<br>Optimising the full value of content marketing apps including Pulse, Slideshare and Company pages <br>Expected return on investment using all LinkedIn advertising options including Onsite and Network display, Sponsored updates, Sponsored Inmail and lead accelerator <br>Comprehensive ongoing LinkedIn learning and resources for all levels<br><br></p><p>The course duration is a 2 hours 45 minutes for completion of all 28 Videos</p>", 
    "end_date": null, 
    "title": "The Complete LinkedIn B2B Marketing Course", 
    "price": "50.00", 
    "instructors": "David Reilly", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477208_badc_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-linkedin-b2b-marketing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T15:31:28Z"
}