{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>\"An image worths a thousand words\", what a beautiful and true quote!</strong> Images send our message much better, get the attention of our audience, engage them and 99% of the time, when used properly, they convert our potetntial buyers into actual buyers than bring in revenue for us.</p><p><strong><em>The problem is that very often you may find yourself either spending a lot of time or money to create images and you may not do it the right way. That can get you frustrated and let's face it, wit less money in tour pockets instead of more.</em></strong></p><p>Actually, it has been proven and tested by social media specialists that <strong><em>images help at increasing conversions into social media posts with up to 150%. That could mean 150% more business and profits for you!</em></strong></p><p>In this course you will see exactly what tools to use for you social media activity to create high converting images for different purposes and platforms without losing tons of time or money on outsourcing or expensive designers and freelancers.</p><p><strong>So, what you will learn exactly:</strong></p><ol><li><strong>Why images are so important for your social media activity</strong></li><li><strong>How to enhance and transform your photos for your social media accounts.</strong></li><li><strong>What tools to use for free to enhance and resize your photos for social media.</strong></li><li><strong>What tools to use to create high engaging images for different purposes in social media.</strong></li><li><strong>How to create viral quotes images in a matter of seconds or minutes and what tools to use.</strong></li><li><strong>What tools to use to create infographics for bringing more exposure and value in the marketplace.</strong></li><li><strong>How to build professional looking mockups for free.</strong></li></ol><p><strong>and many other...</strong></p><ul><li><strong>Lifetime Access to all other updates!</strong></li><li><strong>Surprise Bonuses!</strong></li><li><strong>New Methods and Systems introduced in the course!</strong></li><li><strong>FULL Support through the discussion area of the course!</strong></li><li><strong>30 Day Money Back GUARANTEE if you feel this course didn't help you at all and you can't apply anything...that is how dedicated we are to your success!</strong></li></ul><p><em><strong>All of this in less than 2 hours (out of your busy schedule) of simple to follow lectures that YOU CAN APPLY from TODAY in YOUR BUSINESS for BETTER RESULTS!</strong></em></p><p><em><strong>Time to take action!</strong></em></p><p><em><strong><br></strong></em></p><p><strong><em>To Your Massive Online Success,</em></strong></p><p><strong><em>Sorin Constantin</em></strong></p>", 
    "end_date": null, 
    "title": "The Social Media Images Creation Guide", 
    "price": "20.00", 
    "instructors": "Sorin Constantin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679616_8f18.jpg", 
    "course_url": "https://www.udemy.com/the-social-media-images-creation-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T16:58:03Z"
}