{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is designed to simplify the best practices of Facebook Ad Targeting so you can understand how to reach and engage your audience \nand improve your chances of getting a positive reaction to your Facebook advertising campaigns.</p>  <p><strong>Understand the art of Facebook advertising using proven, simple and effective techniques.</strong></p>  <ul><li>Discover the basics of Facebook advertising</li><li>Learn how to properly identify with your customers and avoid wasting money</li><li>Hear how Banana Republic triumphed using Facebook 'Lookalike' Audiences</li><li>Understand the different formats of Facebook Ad Targeting</li></ul>        <p><strong>Knowing how to use Facebook advertising formats is an essential element of today's online marketing requirements.</strong></p>  <p>In\n\n the course you will learn how to avoid 'fishing' for your customers and instead, create targeted and relevant ads. You'll hear from Digital Marketing experts, as well as benefiting from real life case studies including Banana Republic's effective use of Facebook 'Lookalike' Audiences </p>  <p>From understanding the basics, through \nto learning simple techniques, you will leave this \ncourse ready to engage potential customers on Facebook.</p>  <p>I designed this course to offer you\n an easy to follow, comprehensive guide to Facebook ad targeting. Facebook advertising is a topic that can be made complicated very quickly. This is \nwhy I \nhave prepared slide presentations with a running commentary, so you can \nenjoy the visuals and explanations that go with them. </p>  I hope you enjoy learning the basics, and I look forward to connecting with students who have any requirements or questions. ", 
    "end_date": null, 
    "title": "The Beginners Guide To Targeted Facebook Advertising", 
    "price": "20.00", 
    "instructors": "Fred Williams", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779986_2594_2.jpg", 
    "course_url": "https://www.udemy.com/the-beginners-guide-to-targeted-facebook-advertising/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T13:42:30Z"
}