{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Want to learn what<em> retargeting</em></strong><strong>(remarketing)</strong><strong> is?</strong><br></p><p>Or want to use retargeting to drive actual sales for your business? Or simply want to stop losing your customers to competitors and make your customers stick to your business using social media?</p>  <p><strong>Whatever the situation is, I’m here to help. </strong></p>  <p><strong>98% </strong>of your website visitors<strong> </strong>leave without buying anything. My goal is to help <strong>YOU</strong> master <strong>r</strong><strong>etargeting to re-engage with them</strong> step-by-step. Retargeting is the missing ingredient for your business's success. And I intimately know how much retargeting can change your business, because mastering retargeting myself completely transformed both my personal and professional endeavors in business. And if I can run retargeting ads, believe me, so can you.</p>  <p>I’ve been entrepreneur for years, and at the beginning, I used to think that getting new users with fancy TV ads and billboards would bring success to my business. And I overlooked <strong>how important it was to retain visitors and engage them more</strong>. Plus, I didn’t know what retargeting was back then. Even though my business ideas were solid, my weak user retention skills were holding my business back. I couldn’t effectively reach out to all the users who leave my website without buying, and my startup was just dragging along.</p>  <p>When I first decided to learn retargeting, I realized there was almost nothing out there to help. There were some courses, but it was <strong>r</strong><strong>eally hard to get a holistic understanding of retargeting</strong> from those courses. And there were few videos on YouTube that didn’t provide all the details I need to actually run retargeting campaigns across different channels. <strong>I noticed a lot of the info was hard to apply in real life.</strong> There were some really cool case studies but they weren’t actionable or applicable. I thought that there had to be a better way, so i created this course so <strong>everyone could know how to use successful, high impact retargeting ads</strong> in all of their customer interactions.</p>  <p>Here's what you’re going to learn. In this course, we’re going to start with <strong>the foundations of what retargeting is</strong> and <strong>why it is so important</strong>. Then we’re going to go on to <strong>retargeting strategy set up</strong>, where i will teach how to set up your retargeting plan in harmony with other marketing activities. In section 3, you’ll learn how to actually <strong>set up your retargeting ads in Facebook</strong>. In section 4&amp;5, I’ll delve into <strong>Google Adwords</strong> and <strong>YouTube</strong>, and in the following sections, i will help you set up retargeting ads on<strong> Instagram</strong>, <strong>Twitter</strong>, and <strong>Gmail</strong>. </p><p>I want to make sure that his course not only teaches you<strong> how to set up retargeting ads in different channels</strong> but also<strong> how to optimize them with practical tips and tricks </strong>that I learned through my hands-on experience.<br></p>", 
    "end_date": null, 
    "title": "The Complete Facebook, Google, YouTube Retargeting Course", 
    "price": "25.00", 
    "instructors": "Seijin Jung", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753010_db98_4.jpg", 
    "course_url": "https://www.udemy.com/master-retargeting/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T01:42:55Z"
}