{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>NEW!</strong> Now included 21 pages Special Report -  Tumblr Posting Made Easy &amp; 50 Crazy “Finding Tumblr Followers\"  Tricks, Cheat Sheet and Mind Map Report!<br></p>\n\n<p>  \t  ------------------------------------------------------------------------------------------------------------------</p>\n\n<p>  \t<strong>Attention to All Online &amp; Offline Businesses:</strong>  </p>\n\n<p>  \t<strong>    Millions are hanging out on Tumblr lately. Your business <em>definitely</em> need this ASAP</strong>  </p>\n\n<p>  \t            This step-by-step Tumblr Training System is going to take you by the hand and show you how to safely skyrocket your business online presence in the shortest time ever and enjoy as much high quality traffic as you want.  </p>\n\n<ul>  \t<li>Position your <strong>online or offline</strong> business over Tumblr in the shortest time possible.</li>  \t<li>Quickly and safely <strong>grow a huge army of potential clients or customers </strong>100% targeted to your business.</li>  \t<li>Productively interact with your <strong>new and existing clients</strong> or customers in order to <strong>scale your business</strong> to a whole new level of success.</li>  </ul>\n\n<p>  \t        --------------------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t            Our Seven (7) <strong>very-easy-to-follow steps</strong> are more than enough to get you where you really want to be using the incredibly social power of Tumblr. This system will give you exactly what you need in order to reach all of your online business expectations of success.  </p>\n\n<p>  \t<strong>This extraordinary Tumblr Training System</strong> will reveal the exact 7 steps that you really need to care about the most in order to strongly and safely position your business on Tumblr in the shortest time possible.  </p>\n\n<p>  \t          If you would like to <strong>harness the power of Tumblr and its  hundreds of millions of users to grow your audience, engage with  customers, and encourage an increase in sales,</strong> this is the course for you.  </p>\n\n<p>  \t           This course shows you what to do right.  </p>\n\n<p>  \t        -----------------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t           You can use Tumblr the way I show you and be very successful indeed.  <strong>Here's what you'll get:  </strong>  </p>\n\n<p>  \t        *Me talking about Tumblr Marketing - take notes!  </p>\n\n<p>  \t        *Let's be honest, so listen to what I say, please and concentrate on that! That's the real course content!  </p>\n\n<p>  \t        *Understand what is Tumblr and why you urgently need it for your business.  </p>\n\n<p>  \t        *Highly-effective techniques that will make your posting activities a lot more productive.  </p>\n\n<p>  \t        *My personal guarantee of your success.  </p>\n\n<p>  \t          Take the course for 30 full days, risk free - there's a full, no questions asked ever refund policy!  Take this detailed but easy-to-follow course now - in an hour or so you can be increasing the size and sales of your business - over and over again!  </p>\n\n<p>  \t            I \"take you by the hand\" and \"behind the scenes\" and show you everything, explaining it in simple \"no jargon allowed\" videos and written support lectures.  </p>\n\n<p>  \t        -----------------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t<strong>100% Satisfaction Or Your Money Back Guarantee</strong>  </p>\n\n<p>  \t        I know you will be absolutely thrilled once you got through my course. It's not the usual stuff you know so well of. But if I am proven wrong, if you're not satisfied with this course for ANY valid reason, contact us within 30 days from your purchase and I will refund your purchase in full. No questions asked. You have absolutely nothing to lose.  </p>", 
    "end_date": null, 
    "title": "Tumblr Marketing: How to Blog to Promote Your Business", 
    "price": "20.00", 
    "instructors": "Ricardo Soto", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/186840_d1a3_4.jpg", 
    "course_url": "https://www.udemy.com/tumblr-to-grow-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-22T07:52:11Z"
}