{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>“AJ’s strategies added thousands of followers to our Twitter accounts and drove thousands of clicks to our website. Applying his strategies will help you build a targeted audience and get more traffic to your website.”</strong></em></p><p><strong>Nick Unsworth, CEO of Life on Fire</strong></p><p><strong></strong></p><p>Are you unclear about how Twitter fits in with your marketing?</p><p>Would you like a clear plan to follow to show you how to get more exposure, leads and sales by using Twitter?</p><p>I can show you how to bring it all together and use Twitter to build a rocking business in just 30 minutes a day.</p><p>I Believe Twitter is the Most Powerful Tool to help Your Achieve Your Financial Goals Right Now</p><p>Take a look at these amazing Twitter facts:</p><ul><li>There are 310 Million ACTIVE Monthly Twitter Users.</li><li>47% of people who follow a brand on Twitter are more likely to visit the company's website.</li><li>There were 157 Billion Twitter Timeline views in the first quarter of 2014.</li></ul><p><br></p><p>This is a proven Twitter marketing plan you can use to grow your business, right now</p><p><strong>Part One Of This Course Is:<br></strong></p><p><strong><em>TWEET LIKE A ROCKSTAR - </em></strong><strong><em>Your Proven Plan for Using Twitter</em></strong></p><p>When You Join TWEET LIKE A ROCKSTAR I'll help you create a profitable Twitter Marketing Plan that will give you the confidence you need to build a business that's crushing it.</p><p>What's Included in the Course?<br></p><ul><li><strong>Module 1: Getting Started on Twitter, Setting Up Your Account for Success</strong></li></ul><p>In this module you will learn how to rock through Twitter, set up your account, choose a username and position yourself as a credible authority within your industry</p><ul><li><strong>Module 2: Creating Tweets that Capture Attention</strong></li></ul><p>In this module you will learn how to create a content strategy that converts, how to tweet, what to tweet, when to tweet and how to use third party applications to enhance each tweet.</p><ul><li><strong>Module 3: Attracting Raving Fans and Growing Your Following</strong></li></ul><p>In this module you will learn the best techniques for attracting raving fans, increasing clicks to your website and building your email list.</p><ul><li><strong>Module 4: Increasing Your Reach and Visibility Online</strong></li></ul><p>In this module you will learn the best strategies to increase your impressions and reach, create new opportunities for your business, attract new leads, how to support others who align with your brand and how to interact via direct message.</p><ul><li><strong>Module 5: Utilizing Tools to Improve Your Twitter Strategy</strong></li></ul><p>In this module you will learn about tools to help you schedule your Tweets, measure success, automate engagement and directly make sales from Twitter.</p><p>If for any reason you’re not happy with the course, I’ll give 100% of your money back within the first 30 days.<br></p><p><strong>When You've COMPLETED This Program</strong><br></p><p>You'll Be Able To...</p><ul><li>Create an effective Twitter Marketing Plan for your business</li><li>Design a Profitable Marketing Funnel</li><li>Get a positive ROI from your Twitter Marketing Plan right away</li><li>Build your Email List on a budget</li><li>Sell your products and services using Twitter</li><li>Position Yourself as the Rockstar in your industry</li></ul><p><br></p><p><strong>Part Two Of This Course Is:</strong></p><p><strong>Blab Marketing - Market Your Business With Blab</strong></p><p><strong>10 ways to use the Blab livestream site to get instant, free, targeted traffic to your product or service</strong></p><p>This course shows you how to use Blab to grow your audience &amp; reach, maximize your conversions &amp; sales and dramatically increase your business income.</p><p><strong>What is Blab?</strong></p><p>Launched in April 2015, Blab is the hottest new livestreaming platform to hit the Internet. (Hotter and newer than Periscope!)</p><p>Blab is brand-new and taking the Internet by storm!</p><p>The average Blab user spends 64 minutes on Blab! (engagement is through the roof)<br></p><p>With Blab, you can launch live broadcasts that include up to 4 people on a broadcast.</p><p>This is exciting and fun because of the collaboration and intensity of the conversation.</p><p>You can also have new guests \"pop in\" or \"pop out\" of your Blab and as the host, you stay in control the conversation.</p><p>But, as fun as Blabs are, sadly, the average \"Blabber\" does not know how powerful it can be for generating a massive amount of instant, free, targeted traffic to your website, product, service or online course.</p><p>In fact, this course reveals how you can get traffic that is:</p><ul><li>INSTANT TRAFFIC (you have an instant audience waiting for you on Blab)</li><li>FREE TRAFFIC (Not only is Blab traffic free, but I will also show you how to turn your Blab content into ongoing, FREE TRAFFIC drivers! I call this my \"Content Bomb\" strategy)</li></ul><p>and</p><ul><li>TARGETED TRAFFIC (The most important audience you can build is an audience that is interested in your offers. In this course, you'll learn my \"secret sauce\" for building a TARGETED audience on Blab)</li></ul><p>You'll do this by doing livestreamed broadcasts on Blab about your specific niche topic and then turning this free traffic into sales of whatever product or service you want to sell.</p><p>Since Blab is so new, you may not have heard of it, but in this course, you'll discover 10 powerful ways to leverage the Blab platform to grow your reach and tap into an instant audience.</p><p>You'll also discover how, over time, you can grow your audience and reach exponentially to generate even more sales and growth!</p><p>Enroll today at no risk because you automatically get a 30-day, no-questions-asked, money-back guarantee!<br></p>", 
    "end_date": null, 
    "title": "Twitter - Twitter Marketing Masterclass", 
    "price": "20.00", 
    "instructors": "Dave Espino, Aj Amyx", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661658_7088_2.jpg", 
    "course_url": "https://www.udemy.com/twitter-marketing-tweet-like-a-rockstar/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T01:22:32Z"
}