{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>You tweet awesome content, but you wish your tweets got more attention. You wish more people retweeted your tweets and that you could gain hundreds of followers every day.</p><p>You have no problem putting in the work, but you just want better results. You want more blog traffic, a larger audience, and sales from Twitter. The mission of this course is to show you how to get those results.</p><p>After being stuck at 1,667 Twitter followers for three months and putting in the same work, I asked myself if this was it. I am happy I continued learning. Now I have over 250,000 targeted Twitter followers, and in this course, I will show you how I achieved rapid growth.</p><p>I understand many people are pressed with time. My belief is that a lack of time shouldn't stand in your way! That's why I discovered a process that lets you massively grow your Twitter audience in just 15 minutes per day. Once you master the system, you can even put your Twitter growth on autopilot. </p><p>Now I gain hundreds of followers every day without putting in any work for my Twitter account. I literally gain hundreds of Twitter followers while doing my homework.</p><p>Do you want to <strong>transform your business</strong> and get the <strong>targeted audience</strong> that you have always wanted? I reveal it all in my Twitter Domination course. I hope to see you in the course.</p>", 
    "end_date": null, 
    "title": "Twitter Domination--How To Get 250,000 Targeted Followers", 
    "price": "30.00", 
    "instructors": "Marc Guberti", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124910_e0eb_5.jpg", 
    "course_url": "https://www.udemy.com/twitter-domination/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-25T03:35:42Z"
}