{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<h5></h5>  <p>  \t <strong style=\"\">Build a Huge Following Eager to Read Your Books</strong>  </p>  <p>  \t The main thing that separates a successful author from an unknown one is having a following. And Twitter is how you build a following today.  </p>  <p>  \t        Building these social connections helps you sell your books and grow your business. And Twitter is different from the other social media platforms because<strong style=\"\"> Twitter is the place where it&rsquo;s perfectly acceptable to follow people you don&rsquo;t know!</strong> That&rsquo;s huge. It&rsquo;s literally the way any author can find and connect with his future readers. Authors and readers connecting directly is causing a revolution in publishing.  </p>  <p>  \t <strong style=\"\">Your New Readers Are Waiting To Hear From You</strong>  </p>  <p>  \t        Thousands, maybe millions, of your new readers are already on Twitter. They openly talk about the books they like and what kinds of authors they look for. They <em style=\"\">want</em> you to find them.  </p>  <p>  \t        The question is, are you going to tell them where you are &ndash; or not?  </p>  <p>  \t        My new course,<strong style=\"\"><em style=\"\"> Twitter for Authors,</em></strong> will show you everything you need to know and do to build a massive following of readers. Over 90 minutes of video and pdf checklists will take you from being an absolute beginner to knowing the pro tricks and secrets that drive thousands of tightly-targeted readers straight to you and your books.  </p>  <p>  \t<strong style=\"\">You&rsquo;ll Learn Very Specific Tactics For Authors:</strong>  </p>  <ul style=\"\">  \t<li>The right ways to promote your books to perfectly targeted readers</li>  \t<li>How to track competitors and colleagues</li>  \t<li>Find reviewers and bloggers from your niche and genre</li>  \t<li>The most important elements for your Twitter bio</li>  \t<li>Using scheduled chats to reach your audience consistently</li>  </ul>  <p>  \t <strong style=\"\"></strong><strong style=\"\">It&rsquo;s Almost Like Twitter Was Created Just For Authors!</strong>  </p>  <p>  \t    If you wanted to design a method so authors could find and communicate with more readers and sell more books, you&rsquo;d design Twitter. It&rsquo;s already perfect for authors!  </p>  <p>  \t    My <strong style=\"\"><em style=\"\">Twitter for Authors</em></strong>  course shows you literally dozens of ways to leverage the features and power of Twitter so you can build a following of raving fans who love your books and share them with their Twitter friends.  </p>  <p>  \t <strong style=\"\">   You&rsquo;ll also learn:</strong>  </p>  <ul style=\"\">  \t<li>How to use time-saving apps that organize your work</li>  \t<li>How to use automation the write way</li>  \t<li>How analytics can show you exactly what is working and what is not</li>  \t<li>How to avoid the Twitter 2000 wall</li>  \t<li>How to use Twitter&rsquo;s Advanced Search to find laser-targeted readers</li>  </ul>  <p>  \t    Each lesson in <em style=\"\"><strong style=\"\">Twitter for Authors</strong></em> is a video you can pause and rewind to make sure you get every point. Detailed checklists make it step-by-step easy so nothing is overlooked.  </p>  <p>  \t    The <em style=\"\"><strong style=\"\">Twitter for Authors</strong></em> course takes anyone from the level of absolute Twitter beginner to the level of a pro author squeezing every advantage from Twitter&rsquo;s powerful platform.  </p>", 
    "end_date": null, 
    "title": "Twitter For Authors: Book Marketing and Brand Building", 
    "price": "20.00", 
    "instructors": "Connie Brentford", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/111620_84be_6.jpg", 
    "course_url": "https://www.udemy.com/twitterforauthors/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-28T09:19:39Z"
}