{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">LATEST: Course Updated On September, 2015 To Include More Lectures:</em>  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">Lecture on how to automate the process of dominating hashtags</em></li>  \t<li style=\"\"><em style=\"\">5 lectures on how to get more retweets, followers and engagement on Twitter</em></li>  \t<li style=\"\"><em style=\"\">Lecture on how to write better headlines that increase click-through rates</em></li>  </ul>  <hr style=\"\">  <p style=\"\">  \t          * OVER 350 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\">In This Course You Will Learn</strong>  </p>  <p style=\"\">  \t    Twitter marketing fundamentals and many advanced strategies that professional marketers use to promote their business on Twitter. These strategies will get you more followers, retweets, engagement, and people clicking on whatever you are promoting. In this course you will also learn how use Twitter to network with your peers, and even celebrities in your business niche.  </p>  <p style=\"\">  \t                                                You will also learn many Twitter marketing fundamentals such as good practices for how to tweet, set up a professional profile, use hashtags to amplify the reach of your tweets, and much more.  </p>  <p style=\"\">  \t<strong style=\"\">Who The Course Is For</strong>  </p>  <p style=\"\">  \t    If almost no one is clicking on things you post in your Tweets, or you have no idea how to get the most out of Twitter to promote your business, this course is for you. This course is also for long-time Twitter users who want to take their Twitter marketing to a new level.  </p>  <p style=\"\">  \t    After taking the course, you should be comfortable using Twitter to promote your business, and be able to grow your Twitter following and effectively promote your business on Twitter.  </p>  <p style=\"\">  \t<strong style=\"\">How The Course Is Structured</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>This course contains over an hour of video tutorials split into 35 lectures on different Topics covering many aspects of Twitter marketing. The course first gives you solid Twitter marketing fundamentals. After that, the course discusses various Twitter marketing strategies. Then the course spends a lot of time explaining many strategies to get more retweets, increase engagement, and squeeze as much growth out of Twitter as you possibly can. After that the course covers a few handy Twitter tools.  </p>  <p style=\"\">  \t<strong style=\"\">Why I Made This Twitter Marketing Course</strong>  </p>  <p style=\"\">  \t                                              Most people struggle with social media marketing. Twitter and Facebook marketing tend to be the two marketing approaches that people first think of. These are fine social networks, but the social media marketing strategy for your business should be chosen with a degree of savvy. In this course, what I hoped to do is to make it clear for you what you will be able to accomplish with Twitter marketing and how to go about accomplishing. Once you are done with the course, I think you will be very comfortable deciding when and how to use Twitter for your marketing efforts.  </p>  <p style=\"\">  \t<strong style=\"\">Personal Touch Like Nowhere Else</strong>  </p>  <p style=\"\">  \t    In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p style=\"\">  \t<strong style=\"\">Try The Course By Starting With The Sample Lectures</strong>  </p>  <p style=\"\">  \t    Go ahead and start taking the free lectures in the course. If you find them interesting or helpful, sign up for the full course. There is no risk because if you feel that you didn't learn anything, there is a 30-day money back guarantee. I hope to see you on the inside!  </p>  <p style=\"\">  \t                      +++++++++++++++++++++++++++++  </p>  <p style=\"\">  \t                                  MONEY BACK GUARANTEE  </p>  <p style=\"\">  \t<em style=\"\">The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "Twitter Marketing: 1000%+ Engagement", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/246450_8ab2_3.jpg", 
    "course_url": "https://www.udemy.com/twitter-marketing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-19T11:07:36Z"
}