{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "Do you need a more in-depth understanding of Twitter? How to use the RIGHT hashtags and how to identify what is working and what is not? Are you tracking your potential customers and stakeholders and do you use the analytics to make the best of your social media time online?<br>In this course you will go in-depth into:<br><ul><li>The Basics of Twitter and getting started</li><li>Finding and connecting</li><li>Using lists</li><li>Finding the right hashtag</li><li>Measurement and analytics</li></ul><p>I've managed the strategy, campaigns and Facebook Pages and forums and blogs of TV shows such as JUNIOR MASTERCHEF, IDOL and BIG BROTHER. I specifically adapted these quick courses to bring social media managers like you up to speed efficiently and cost effectively. Look out for my other courses!</p><p>SHORT COURSE: This is a mini-course that is part of a much larger Social Media Campaign course - you will find some videos duplicated from the Campaign course on my corporate account. Some students just want a quick and easy course on one aspect of campaigns - that is the purpose of this course. So if you are just looking for measurement and analytics tools and strategies as part of social media campaigns, this is the course for you!</p><p>Key Information on Udemy and this Course is in the last section. </p>", 
    "end_date": null, 
    "title": "Twitter: Hashtags, Lists, Analytics Strategies for Twitter", 
    "price": "20.00", 
    "instructors": "Laurel Papworth", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628706_52ea_2.jpg", 
    "course_url": "https://www.udemy.com/twitter-foundation/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T10:08:18Z"
}