{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><p>Twitter Success for your Business is the only video you&#039;ll ever need, to get you going on one of the world&#039;s largest social networks. It is everything you need to know about Twitter to help you engage with your target customers, extend your business network, drive more traffic to your website, increase revenue and much more. Once you&#039;ve learnt the basics, we&#039;ll show you how to use Twitter in a way that will prevent it from taking over your life, introduce you to some clever search techniques, send engaging tweets that will encourage interaction from your customers, market your company to over half a billion Twitter members, share information and ideas about your products and services, build customer relations, create bigger brand awareness globally and measure your social media success along the way.</p><p>This course is suitable for anybody whether they&#039;re yet to join Twitter, a relatively new user or have been active on the network for some time. Whatever stage you&#039;re at, we guarantee that you&#039;ll leave this course with skills that you will not only apply when using Twitter, but in other areas of your work life also.</p><p>***** FREE OFFER *****&nbsp;<br>Buy this course now, and we&#039;ll send you the Twitter Success for your Business e-Book that you can read on virtually any computer or device and keep forever. Worth £15 / $25</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Twitter Success for your Business", 
    "price": "25.00", 
    "instructors": "Chris Brophy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54430_32ba_8.jpg", 
    "course_url": "https://www.udemy.com/twitter-success-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-16T08:05:08Z"
}