{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Growing a Twitter following can seem like a futile effort.  Who has the time when all you get are 2 or 5 followers per day...if that!!!  </p><p style=\"\">You might have even thought about buying followers to pump up your Twitter following.  Maybe you&#039;ve been creating blog post and linking back to them in your tweets, only to find that no one is visiting.<span style=\"\"></span></p><p style=\"\">I was in your shoes not so long ago.  In fact, my Twitter account was basically flat lined for nearly two years.  I had tried different things to build my following but would give up in defeat after seeing only a handful of followers show up for all of my efforts.</p><p style=\"\">If this sounds like you, get ready to discover a proven process that you can do in only two minutes a day.  You&#039;ll steadily add new followers by following this step by step system.  Best of all, your followers will be highly targeted and engaged.</p><p style=\"\">How is all of this possible?  With <em style=\"\">Two Minutes A Day To 10k</em>, I&#039;ll show you the exact steps I took to grow my Twitter following from around 2500 to over 15k in 5 months.  All with real, targeted, engaged followers.</p><p style=\"\">If you&#039;re ready to use a system that works, just click the buy button and I&#039;ll see you inside the course.</p>", 
    "end_date": null, 
    "title": "Twitter Marketing: 2 Minutes A Day To 10k Twitter Followers", 
    "price": "50.00", 
    "instructors": "Brett Romero", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519910_352f_3.jpg", 
    "course_url": "https://www.udemy.com/two-minutes-a-day-to-10k/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T04:12:31Z"
}