{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">Your time is valuable! Don&#039;t waste it listening to unnecessary chatter and outdated material.</strong></p>  <p><p>Business owners, online marketers, and entrepreneurs from  any industry can benefit from taking this Twitter In One Hour: how to use twitter for business effectively  course. Even seasoned Twitter users can learn to use Twitter to its full  potential in this comprehensive course.</p>    <p>Used effectively, Twitter can out-perform other social media  platforms, helping you generate leads, promote your products and services, and  establish yourself as a thought leader.</p>    <p>The “How  to Use Twitter for Business Effectively” course is updated regularly,  featuring the most up-to-date changes to the Twitter platform, and covering the  essentials you need to launch and maintain a successful Twitter marketing  campaign.</p>&lt;/p&gt;    <p><strong style=\"\">These essentials include:</strong></p>    <ul style=\"\">  \t<li>Comprehensive coverage of the Twitter platform and Twitter settings</li>  \t<li>Effective methods for customizing and optimizing your Twitter profile</li>  \t<li>Exhaustive discussion of the elements of a Tweet and Twitter features</li>  \t<li>Proven tactics for leveraging Twitter features to improve your reach</li>  \t<li>Straight-forward demonstrations of integration using Twitter widgets and other methods</li>  \t<li>Practical advice on automation, promotion, and analytics techniques</li>  </ul>  <p>And, all of this in less than an hour!</p>    <p><strong style=\"\">But for those of you who want more, there is another full hour of bonus lectures and videos.</strong></p>    <p><strong style=\"\">Bonus lectures explore:</strong></p>    <ul style=\"\">  \t<li>Tactics for finding qualified followers</li>  \t<li>Methods for improving engagement and click-through rates</li>  \t<li>Additional marketing and promotion techniques</li>  </ul>  <p><strong style=\"\">Bonus videos are hands-on demonstrations of how you can:</strong></p>    <ul style=\"\">  \t<li>Implement and integrate Twitter widgets and buttons on your website</li>  \t<li>Customize your profile using background images and services</li>  \t<li>Implement advanced techniques for promoting your Twitter account and your brand</li>  \t<li>Mark up your website so it can be featured in the Twitter timeline</li>  </ul>  <p><strong style=\"\">Enough with the chatter, already. Get started now and be done before supper!</strong></p><p><p>Take this ultimate Twitter In One Hour course  right now and learn how  to use twitter for business effectively!</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Twitter Essentials in Under an Hour", 
    "price": "20.00", 
    "instructors": "Deltina Hay", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38581_ba73_11.jpg", 
    "course_url": "https://www.udemy.com/twitter-essentials-in-under-an-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-28T02:11:15Z"
}