{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Twitter training is a course for beginners in twitter. I use step by step videos to teach you about the basics of twitter. I show you how to create a new twitter account and then walk you through all the basic functionality of this social network.<br></p>  <p>  \t    By taking this course you will learn,  </p>  <li>How to sign up for twitter account &amp; post your first tweet</li>  <li>How to follow someone on twitter, finding friends on twitter</li>  <li>How to change twitter background, twitter cover photo &amp; complete your profile</li>  <li>How to use twitter reply, twitter retweet, twitter favorites &amp; direct messages</li>  <li>How to use the twitter hashtag function to be a part of a conversation</li>  <li>How to use twitter search to search tweets &amp; conversations</li>  <li>Your new twitter account overview</li>  <li>Uploading photos to twitter &amp; how to post a video on twitter from you-tube</li>  <li>How to use twitter lists to segment your twitters feed</li>  <li>How to shorten link for twitter with custom url shortener like Bitly &amp; Google</li>  <li>How to get more twitter followers by listing yourself in a twitter directory</li>  <li>How to add twitter follow button &amp; tweet button into your website</li>  <li>How to embed twitter feed widget into your website</li>  <li>How to remove apps on twitter, revoking access of third party apps from your account</li>  <li>How to protect tweets and make your tweets private</li>  <li>How to link twitter to facebook and post tweets to facebook profile</li>  <li>How to manage twitter, automate and schedule tweets with hootsuite</li>  <li>And many more!</li>  <p>  \t    The course is mainly video based but it also has text and links to external resources. This course won't take more than few hours to complete &amp; master, but you can take all your time to learn and explore.  </p>  <p>  \t    By taking this course, you are not just getting these videos but also getting access to me as your teacher, your friend. You can ask me for help anytime you want through the discussions, groups, email or social media.  </p>  <p>  \t    In the future, I will update these videos when twitter makes new changes to their system. You get lifetime access to the future videos.  </p>  <p>  \t    Twitter training course is going to teach you step by step about this social network. Everything from setting up to making a unique profile to tweeting basics. Learn twitter inside out.  </p>  <p>  \t    So don't wait, sign up for this course and I will see you on the other side!  </p>", 
    "end_date": null, 
    "title": "Twitter Training: Twitter For Beginners - 2016 Updated", 
    "price": "25.00", 
    "instructors": "Tamal Anwar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165668_13f0_5.jpg", 
    "course_url": "https://www.udemy.com/twitter-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-17T12:33:57Z"
}