{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong>⇉ Make sure you watch the promo video where I will show you LIVE proof of my Twitter Account LIVE with more than 17.000 followers that were built using free methods only. This is the kind of result you can expect after taking this course!</p><p>⇉ We will cover everything from A to Z regarding Twitter Marketing, from Beginner to Master! I will show you how to set up your profile, how to get your first followers, engage properly in Twitter, direct traffic to your websites/blogs with Twitter and even put your list building efforts on auto-pilot!<br></p><p>⇉ We will leave no stone unturned and cover the best tools to put your Twitter Marketing efforts almost on auto-pilot, leaving YOU more time to do other important things. All of the tools recommended will be completely free, so no need for an extra investment on your part!<br></p><p>⇉ Skip the guess work and time that it would take you to achieve this amount of people as an audience and learn from a successful Twitter Marketing expert, with proven methods that will generate you more exposure, traffic and sales!<br></p><p>⇉ Get lifetime access to the information that took me a long time to learn, test and track to get only the absolute best results, backed by a 30 day money back no questions asked Guarantee!<br></p><p><br></p><p>See you on the inside!</p><p><br></p><p>To Your Twitter Success,</p><p>Dan</p>", 
    "end_date": null, 
    "title": "Twitter Marketing: How I Got 18.000 Followers in One Month!", 
    "price": "20.00", 
    "instructors": "Daniel Silvestre", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612028_802d_3.jpg", 
    "course_url": "https://www.udemy.com/twitter-marketing-how-to-get-18000-followers-in-1-month/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T19:11:32Z"
}