{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tTwitter has become the largest social media platform and an effective source of traffic for businesses. Learning to utilize Twitter can help build a large audience of targeted customers that do business with you regularly..  </p>  <p>  \tBut you may not know how Twitter works and how to build up a following of 10,000+ people or more. If you’re like the 99% of business owners and you havn’t learned how to work Twitter to your advantage, well, there’s a way you can change that!  </p>  <p>  \tIn my new course, Twitter Traffic Secrets, I teach you exactly how I was able to attract 40,000+ targeted followers in a little under 4 months. The methods and strategies that I share are simple and easy to understand. My goal was to create the least complicated course available, because I want you to be able to quickly learn these strategies and implement them to get more traffic and customers fast.  </p>  <p>  \tThis course is designed for you to learn what you need to know in 3 hours or less. With only 8 video lessons, and 8 PDF bonus lessons, you should be getting more traffic and customers from Twitter within days.  </p>  <p>  \tThis course will not show you how to design the perfect logo for Twitter or upload the perfect background to your Twitter account. None of that stuff matters. Getting traffic &amp; customers - that’s the advantage this course will give you.  </p>  <p>  \tWhen you get through this course, you will have all the knowledge, tools, and resources needed to take your Twitter account from hundreds of casual followers to thousands of highly targeted followers, which translates into customers.  </p>  <p>  \tIt’s time you take care of this aspect of your business. Let’s get started and I’ll see you on the inside...  </p>", 
    "end_date": null, 
    "title": "Twitter Domination In a 2015 World", 
    "price": "35.00", 
    "instructors": "Alex Hamm", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226794_343b.jpg", 
    "course_url": "https://www.udemy.com/twitter-traffic-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T23:12:57Z"
}