{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Want to learn how to promote brands, increase sales, engage customers, and drive site traffic using Twitter?</strong> This course helps marketers and business owners craft, implement, measure, and optimize a winning social media marketing strategy. Course starts with the best uses for social media marketing. Once viewers understand the conceptual underpinnings of social media marketing, Then they learn how to create Twitter profiles; write engaging, high-quality content that incorporates the unique features, such as hashtags and rich media, and maximize your reach by adding target followers. Finally, learn how to measure the results of those efforts using best twitter ads, and see how well your posts and tweets are performing.<br></p><p><strong>Topics Include:</strong></p><ul><li>What is social media marketing?</li><li>Creating a brand presence that people want to follow.</li><li>Defining your objective.</li><li>Finding &amp; following your target accounts.</li><li>Writing tweets and using retweets.</li><li>Understand what is the right time to tweet.</li><li>[BONUS ]Get 200+ pre written tweets to make your viral post instantly.</li><li>Adding media and hashtags get trafic almost instantly.</li><li>Searching for potential clients.</li><li>Attracting followers on different platforms.</li><li>20+ best ways to get more target followers and traffic.</li><li>Using twitter to capture target leads for your business.</li><li>Using twitters ads to boost your marketing campaigns and enhanced your brand value.</li><li>[BONUS] How to use twitter ads to boost your campaign instantly.</li></ul>", 
    "end_date": null, 
    "title": "Twitter Marketing 101: Marketing Strategies That Work", 
    "price": "20.00", 
    "instructors": "Somenath Sen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413110_9d5b_4.jpg", 
    "course_url": "https://www.udemy.com/twitter-marketing-101/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T12:31:39Z"
}