{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>As the artist Manafest I've sold over 300,000 albums worldwide over 1,000,000 singles and toured over 20 different countries.<br></p>\n\n<p>I currently have over 26,000 followers on Twitter and have used it to promote my music sell merchandise plus engage a loyal fanbase.</p>\n\n\n\n<p>Twitter is a must for any artist or business owner promoting their brand and looking to make an impact online.</p>\n\n\n\n<p>Twitter has 320 million active users in over 1 Billion unique tweets across multiple websites and 79% of the accounts are outside of the U.S.</p>\n\n\n\n<p>Currently, Twitter doesn't require you to pay to have your posts seen by your followers.<br></p>\n\n\n\n<p>If you are not yet using Twitter to build a targeted loyal following on Twitter your crazy!</p>\n\n\n\n<p>I \"take you by the hand\" and \"behind the scenes\" and show you everything to grow your brand on Twitter, explaining it in simple detail with videos and written support lectures.<br></p>\n\n\n\n<p>See exactly why I'm so successful with Twitter - see the stats in the free preview videos, below).</p>\n\n\n\n<ul><li>See inside my Twitter account </li><li>Brand your Instagram account and stand out from your competition</li><li>Locate &amp; Grow your audience quickly - get more favorites, and engagement with your audience.</li><li>Nothing is left out - you see everything</li><li>... and my help and assistance to Udemy students is legendary</li></ul>\n\n\n\n<p>+++++++++++++++++++++++++++++</p>", 
    "end_date": null, 
    "title": "Twitter Marketing Mastery For Music & Business", 
    "price": "20.00", 
    "instructors": "Christopher Greenwood", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590734_6d40_2.jpg", 
    "course_url": "https://www.udemy.com/twittermarketingmastery/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-23T01:33:27Z"
}