{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t        Wanna have hundreds of thousands of traffic flocking to your site daily? Then is for you! Have a look inside.  </p>  <p style=\"\">  \t      You&#039;ll learn all the secrets and techniques to start making MASSIVE amounts of cash! getting visitors like the Internet is ending tomorrow! Plus my downloadable e-book that also shows and give you links to get even more traffic if you want!  </p>  <p style=\"\">  \t    Learn the simplest and easiest way to drive a large audience to YOUR SITE, whenever you need it, On complete AUTOPILOT! It doesn&#039;t have to be a product your selling/promoting, you can drive the traffic anywhere, any site, ALL OVER THE WORLD!  </p>  <p style=\"\">  \t    1 Hour course, 8 Lecture plus an e-book with even more juicy info as a bonus!  </p>  <p style=\"\">  \t    So if you really want result and want the cash rolling it in a time frame of a hour or less!? then THIS COURSE IS FOR YOU!  </p>  <p style=\"\">  \t    Total newbie friendly as I will walk you through all steps, leaving no one left behind and/or confused! I was totally in your shoes at one time, heck!, everyone is beginners at first, but what youl&#039;ll about to learn will make you a professional traffic machine in a matter of 1 hour!  </p>  <p style=\"\">  \t    I&#039;ll see you inside!  </p>", 
    "end_date": null, 
    "title": "Ultimate Guide to Getting over 350,000 in Traffic in a day!", 
    "price": "45.00", 
    "instructors": "Vick Michaelee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358296_e9e5_3.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-guide-to-getting-350000-traffic-simple-n-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T06:30:46Z"
}