{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Using Facebook Advertising to Sell More. </strong></p>  <p>If you're not using Facebook Ads you're leaving money on the table. I've personally used Facebook Ads to sell affiliate products and my own information products with great success. My very first campaigns netted me $2000 in pure profit by driving ads from Facebook to my own webpage selling affiliate products. </p><p>Facebook has over 1 Billion users, and your target audience is there in large numbers. </p>  <p>And in this course I'm giving you everything you need to guide you through the whole process of using Facebook Ads in a very simple and easy to understand \"no jargon\" way, and even how to try it out for free. </p>  <p>  \t  At the end of this course you will have the confidence to start creating your own highly targeted ads and also get involved in more advanced methods like retargeting. </p>  <p>  \t  And if that wasn't enough, I let you in on some advanced tips and tricks to capture custom audiences and lookalike audiences to retarget even more potential buyers.  </p>  <p>  \t   If you want to learn Facebook Advertising you don't need to look any further.  </p>  <p>  \t  What more, there's a 30 day money back guarantee with this Udemy course, so you really have no reason not to get started right now. </p><p>Take action, jump in, and start making more money online with Facebook Advertising.  </p>", 
    "end_date": null, 
    "title": "Using Facebook Ads to Increase Your Online Sales.", 
    "price": "20.00", 
    "instructors": "Simon Anthony", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401120_d060_3.jpg", 
    "course_url": "https://www.udemy.com/complete-facebook-advertising-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T13:34:29Z"
}