{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t          ****PRICE INCREASES to $49 on October 1, 2014 12 o'clock Midnight Pacific*****  </p>  <p style=\"\">  \t  Imagine using video to drive droves of traffic to your website. Imagine having your video dominate several keywords because you learned proper optimization secrets to help you absolutely dominate your competitors.  </p>  <p style=\"\">  \t          When you take this course you will learn step by step from the basics of setting up and account all the way to advanced strategies that can help you dominate your niche.  </p>  <p style=\"\">  \t      You will learn keyword research and even strategies that can help get your content on the first page of Youtube and Google. Mastery is the goal and the steps shared will help get you there.  </p>  <p style=\"\">  \t          The great thing about <strong style=\"\">\"Make Money Online By Dominating Youtube\"<br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t      is that it won’t take hours and hours to learn the secrets. In just one day you can take the tips that are shared and begin video marketing your way to the goal of more sales, more traffic, and more online authority.  </p>  <p style=\"\">  \t<strong style=\"\">Discover the 7 easy steps </strong>to YOUTBE Mastery as Mrs. Davis pulls back the curtain to show you how to get more <strong style=\"\">views, likes, and comments</strong> on your videos. This course will help a brand new person join the ranks of seasoned marketers in just a few short lessons.  </p>  <p style=\"\">  \t          Video Marketing is easy when you know what you’re doing. The proven techniques are easy to implement and promise to give the student more than enough information to dominate their competition.  </p>  <p style=\"\">  \t          Once learned these strategies can be used in any niche to get a first page position on Google and <strong style=\"\">Youtube.</strong>  </p>  <p style=\"\">  \t          The Bonus Resource Page includes tools that not many new marketers would be privy to but everything to facilitate <strong style=\"\">Youtube Mastery</strong> has been shared step by step.  </p>  <p style=\"\">  \t          8 videos show you exactly what to do and give you the opportunity to learn the fast and easy techniques that experienced video marketers use everyday.  </p>  <p style=\"\">  \t          In this 8 Module course you Will Learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to Target Your Market</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Create an Account</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Create Multiple Channels</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Make a Video</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Optimize the Video</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Rank the Video</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to do Keyword Research</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to include Google Hangouts in your marketing plan</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Use Transcription in your Videos for a Competitive Advantage</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Add Music and In Video Calls to Action</li>  </ul>  <ul style=\"\">  \t<li style=\"\">What Back links are and How to Get Them</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Spy on Your Competitors for a Winning Edge</li>  </ul>  <p style=\"\">  \t          Plus others<strong style=\"\"><em style=\"\"> unknown Secret Tools</em></strong>  </p>  <p style=\"\">  \t          Join the ranks of seasoned marketers in just a few short lessons and finally master video marketing with <strong style=\"\">YOUTUBE Mastery!</strong>  </p>", 
    "end_date": null, 
    "title": "Video Marketing Strategies for YouTube: Attract More Viewers", 
    "price": "25.00", 
    "instructors": "Tracie Davis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/263350_7e9e_4.jpg", 
    "course_url": "https://www.udemy.com/youtube-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-17T13:00:55Z"
}