{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t <strong style=\"\"><strong style=\"\"></strong></strong>  </p>  <p id=\"main-section\">  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">DOMINATE VIDEO MARKETING comprises 5 action-packed Modules of exclusive, high quality video content. It’s a combination of Videos, PDF’s, resources and actionable tasks. You will have immediate access to a practical list of the best low cost gear I can recommend; that will save you both time and money! (Read details below)</strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\"> </strong></strong>  </p>  <p>  \t <strong style=\"\"><strong style=\"\"></strong></strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">Over 5-hour Video Module Training Center</strong></li>  \t<li>All of your questions will be answered within 24 hours</li>  \t<li><strong style=\"\">Lifetime Access</strong></li>  \t<li><strong style=\"\">30 day Money Back Guarantee</strong></li>  \t<li><strong style=\"\">Downloads Available</strong></li>  </ul>  <p style=\" text-align:center;\">  \t<strong style=\"\">BREAKDOWN OF THE CONTENTS</strong>  </p>  <p>  \t<strong style=\"\">MODULE 1 — Video Marketing Mindset</strong>  </p>  <p>  \t                    Don’t know yet how to start on video? I’ll be laying the foundation for your success. All these are for you to learn and make use!  </p>  <ul style=\"\">  \t<li>Discover how to make compelling Video Customer Testimonials that build trust.</li>  \t<li>Figure out how to keep your viewer’s attention exclusively to your videos; don’t let the competitor’s videos take over.</li>  \t<li>I’ll show you 9 types of easy-to-comprehend-and-execute videos so you will never run out of ideas!</li>  \t<li>Find out the essential ingredients needed to make a quality video.</li>  \t<li>Discover the secrets to a great video and the necessary structure these videos MUST possess.</li>  \t<li>Learn how to make plans for your videos so you will know how and what to say when you press the record button!  </li>  \t<li>How to Create Powerful Videos with a simple step-by-step guide on camera strategy.</li>  \t<li>Planning and Creating a Script for Your Video that actually works. And so much more!</li>  </ul>  <p>  \t<strong style=\"\">MODULE 2 — Filming &amp; Branding Yourself</strong>  </p>  <p>  \t                    Are you afraid of the camera? So did all of us when we were first starting on video! You will be trained how to be in front of the camera and how to get comfortable with it!  </p>  <ul style=\"\">  \t<li>I’ll show you why YOU are the most powerful Video Marketing Tool. Being on camera will help you deeply connect with your audience and essentially build trust with them.</li>  \t<li>Discover the insider secrets that reveal proven techniques and exercises that could help you overcome your fear of being in front of the camera.</li>  \t<li>I’ll illustrate to you how to get the best out of yourself and show it through your videos. You will eventually feel more confident and natural along the way.</li>  \t<li>You’ll discover how to energize your Videos quickly! </li>  \t<li>Find out what the concept of composition is all about and why you need to know about it.</li>  \t<li>Learn how to choose the right location and what to do with it depending on what kind of business you have (overlook this and it can injure your business). Good for personal branding and attraction marketing, either for network marketing or online marketing industry.</li>  \t<li>Unfold easy-to-follow Rules of Composition that will surely grab your viewer’s attention.</li>  \t<li>Explore the powerful combination of Personal Branding and Video Marketing.</li>  \t<li>Personal Branding 101: Discover what your audience wants and use the personal branding guide to your advantage!</li>  \t<li>Be aware of the DOs and DONTs when in front of the camera! (get this wrong and your brand will suffer) And a whole lot more!</li>  </ul>  <p>  \t<strong style=\"\">MODULE 3 — Creating Amazing Videos without Being on Camera </strong>  </p>  <p>  \t                    Still afraid of being in front of the camera? Who said you need to be on camera to use all the benefits that video marketing provides you and your business? This module will help you, especially, if you prefer not t appear on screen for too long!  </p>  <ul style=\"\">  \t<li>Explore accessible Alternatives to avoid the camera while still building your personal branding.</li>  </ul>  <ul style=\"\">  \t<li>Discover how to get the same results WITHOUT even being in front of the camera.</li>  \t<li>Learn the best software, hardware, and other tools that could help you make your videos a blast!</li>  \t<li>Find out the well known easy-to-grab-attention Reality TV Style Videos! And, discover how to capture ‘behind the scenes’ in your videos to benefit your business!</li>  \t<li>Learn how to create Powerful and Engaging Screen casts that would definitely grab your viewer’s attention and leave them craving for more!</li>  \t<li>Learn how to record your presentations and conveniently share it with your audience everywhere you want, anytime you want; this is a fast way to build your fan base.</li>  \t<li>Discover free editing tools and special tricks that would yield OUTSTANDING videos</li>  \t<li>SONY VEGAS MOVIE STUDIO editing software uncovered! 3 step-by-step videos that explains ALL the simple editing you need to know so you can create good looking an professional videos! Quick, easy and cheap. </li>  \t<li>Free tools such as Windows Live Movie Maker so you can do basic editing without spending a dime.</li>  \t<li>I’ll show you that the secret of good editing is NOT about the software, it’s about the mindset.</li>  \t<li>Do it yourself! Get the step-by-step guide on how to edit your videos using free tools and paid (but very cheap) tools as well.</li>  \t<li>Find out how to create engaging Videos that would surely inspire the audience to incessantly watch your video right through the end. This will multiply your conversions.</li>  \t<li>How to use appropriate Music and Visual triggers to convince the viewers to take action and buy your services. And so much more!</li>  </ul>  <p>  \t<strong style=\"\">MODULE 4 — Your Equipment</strong>  </p>  <p>  \t                    What you see is what you GET! You will have access to the list of resources where you can get cheap equipments that work amazingly! GUARANTEED! Why? I made sure to use the exact same equipment that I will show you throughout the course. From the cheapest camera to the cheapest tripod, microphone, lighting, etc. I’m using them in all of my videos and so will you.  </p>  <ul style=\"\">  \t<li>Discover how not to spend a lot of money and time on equipment and focus on taking action instead. </li>  \t<li>You will see that you can explore the most of whatever equipment you have and do a LOT with it.</li>  \t<li>Uncover alternatives to save money and learn how to get the BEST out of what you have. </li>  \t<li>You will learn how to create and improvise your own video equipment accessories so you don’t spend money buying too much stuff.</li>  \t<li>And much more!</li>  </ul>  <p>  \t<strong style=\"\">MODULE 5 — Syndication &amp; YouTube</strong>  </p>  <p>  \t                    Ok, so your video was created..now what??  </p>  <ul style=\"\">  \t<li>Learn the secrets of the NEW YouTube ONE Channel and how to optimize your channel to promote your business for maximum exposure! </li>  \t<li>You&#039;ll have access to a step-by-step upload and optimization process. </li>  \t<li>Learn what are keywords and its significance on your videos. Why do you need them?</li>  \t<li>Discover the right keywords to use to rank your videos.</li>  \t<li>Find out the truth about Viral Videos. Discover why viral videos DON’T work and what to do instead.</li>  \t<li>Uncover how to dominate and become an authority in your niche.</li>  \t<li>Find out what to do AFTER your video has been uploaded to get better results.</li>  \t<li>You will learn the factors to get you the ranks in YouTube Video Search.</li>  \t<li>Uncover how to promote your videos and push their rankings up.</li>  \t<li>Discover the inside secrets of proper YouTube videos and YouTube channel optimization.</li>  \t<li>Amazingly, get instant access to the step-by-step video optimization and YouTube channel optimization. </li>  \t<li>And a whole lot more!</li>  </ul>  <p>  \t       I look forward to helping you achieve real results with video!  </p>  <p>  \t       I will &quot;see&quot; you on the other side!  </p>  <p>  \t       To your success,  </p>  <p>  \t       Vitoria Castro  </p>  <p>  \t <strong style=\"\"><strong style=\"\"></strong></strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\"></strong></li>  </ul>", 
    "end_date": null, 
    "title": "\"Video Marketing Strategies That Never Fail\" ", 
    "price": "20.00", 
    "instructors": "Vitoria Castro", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59532_ad71_12.jpg", 
    "course_url": "https://www.udemy.com/dominate-video-marketing-to-skyrocket-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-11T21:12:08Z"
}