{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are you ready to start making social video with your mobile phone?</strong></p><p>Do you have a social video strategy?</p><p>Facebook reports 8 billion daily video views on the platform, and Snapchat has 6 billion video plays every day. But with so much choice out there, how can you keep viewers interested and engaged?</p><p>Here you will earn how to make many types of original social video content with your mobile phone.</p><p><strong>”This course offers amazing value and is easy to follow.”</strong> — Leah Dodrill</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>My courses have the highest average review rating in the video category on Udemy!</p><ul><li>90 lectures and 4 hours of content!</li><li>Over 7,500 satisfied students are enrolled in the Smart Film School courses</li><li>These courses have more than 130 five-star reviews </li><li>Last month over 300 students joined Smart Film School courses</li></ul><p><strong><br></strong></p><p><strong>\"Once I started the course, I could not quit until I had completed it. Each segment was interesting, informative, creatively presented and edited with precision. I loved the course and learned a lot from it.</strong> — Randy Hendricks</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>This is a new course and will be continuously updated.</strong></p><p>Examples of recent content added to this course:</p><ul><li>Update: November, 2015: Make a Kinogram video with this amazing app</li><li>Update: October, 2015: Why publishers are using Instagram to connect with their audiences</li></ul><p><strong><br></strong></p><p><strong>“Robb shows you step-by-step how to turn your smartphone into a mobile newsroom or documentary studio. Plus he gives great tips for the new as well as experienced videographer. The quality is what you would expect from Robb and as the obvious expert, Robb shares his passion for mobile video journalism throughout this must-have course.” </strong> — Scott Paton</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>Social video is the most effective way to reach mobile millennials.</strong></p><ul><li>Posts with videos attract 3 times more inbound links than plain text posts.</li><li>Viewers are 85 percent more likely to purchase a product after watching a video</li><li>79 percent of internet traffic will be video content by 2018.</li><li>Online video revenue is growing at 110 percent annually. More than any form of advertising.</li><li>Content with relevant images gets 94 percent more views than content without.</li></ul><p><strong><br></strong></p><p><strong>Visual storytelling literacy is the foundation skill that resonates in a world dominated by small screens and short attention spans.</strong></p><p>This course will teach you everything you need to know how to make social video with the video camera you already have - your mobile phone.</p><p><strong>Save time and money making social video.<br></strong>Communications officers, journalists and media outlets are quickly turning to the iPhone to produce high quality video at lower cost than hiring a DSLR film crew.</p><p><strong>Improve your career.<br></strong>This course will give the video skills that can help you get a better job.</p><p>Journalism professors use this course in their classrooms.</p><p><strong>\"If you are a student, media practitioner., or just a person wanting to use new technologies to tell a visual story, then the Smart Film School will give you the skills and foundation.</strong></p><p><strong>The course has helped me in my teaching at the University of Notre Dame.”</strong></p><p>— Len Clark </p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>Social video allows your news stories, sponsored content, brand messaging, and native advertising to travel across social media channels and chat app platforms, with your branding and message intact.</strong></p><p>First we’ll go over the apps and gear that will transform your phone into a video camera and then each video lecture will show you the step-by-step techniques for making mobile video stories.</p><p>In this crash course you will learn how to:</p><ul><li>Reach mobile millennials. </li><li>Learn how to make social video with the video camera you already have - your mobile phone.</li><li>Make 10 different types of social video content.</li><li>Produce short-form video content for Twitter, Snapchat, Facebook and other social platforms.</li><li>Make video story cards to share with social media followers.</li></ul><p>All you need is a mobile phone and some imagination to get started.</p><p><strong>“Robb is very clear and straightforward in his teaching, and I appreciate the way his lectures are backed up with slide or text reviews. Production quality is professional.  Highly recommended!” </strong>– Stephen Box</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>I encourage you to learn how to make social video stories and take your job to the next level.</strong></p><p>No previous video production experience is required.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>Important information before you enroll</strong></p><ul><li>Take this course, risk-free. It is backed by a 30 day money-back guarantee, full refund, no questions asked.</li><li>Once enrolled, you have unlimited lifetime access to the course</li><li>You will have instant access to all updates added to the course</li><li>Take a free preview and be assured of the lecture quality</li></ul><p><strong><br></strong></p><p><strong>“Excellent content, very well presented.”</strong> — Leah Dodrill</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>Who is this for?</p><p><strong>This course is designed for storytellers: Journalists, Media educators, Classroom teachers, Communications teams, New media managers, Correspondents, Online producers, Content marketers, and Video producers.</strong></p><p>Smart Film School certificate courses are being used by media professors in journalism schools to train the next generation in smartphone video reporting. </p><p>All students earn a certificate when they complete all assignments for their class.</p><p><strong>“I liked the way this course flowed from topic to topic with bite size chunks of useful information that made it easy to understand. Definitely worth the time invested in studying.” </strong>— Stephan Hendricks</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>Enroll now and start making social video with your mobile phone.</p><p>Let’s get started!</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>", 
    "end_date": null, 
    "title": "Video Storytelling: Make 10 projects with iPhone and Android", 
    "price": "40.00", 
    "instructors": "Robb Montgomery", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418254_496c_3.jpg", 
    "course_url": "https://www.udemy.com/mobile-reporting-video-journalism-quick-course/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T13:04:00Z"
}