{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<h5><span><strong>Who Else Wants To Exploit Facebook&#039;s Advertising System For Cheap Traffic, Laser Targeted Leads, And More Online Profits In Your Business!</strong></span></h5>\r\n Did you know that the Facebook ads program gives you access to millions upon million of targeted visitors? Facebook has become the most highly trafficked site on the Internet. People love using the site and spending heaps of time on it.<br>\r\n<br>\r\n &nbsp;It&#039;s a fact, Facebook is huge. One in five people on the planet are on Facebook! This is why it&#039;s vital you learn to use the Facebook ads program to get targeted traffic. Whether you know it or not, your customers are all on Facebook! By using the cool little tips I have for getting more traffic from the Facebook ads program, you&#039;ll be well on your way to getting more subscribers and leads.<br>\r\n<br>\r\n &nbsp;<strong>Ultimately, more subscribers and leads means more customers to purchase your products and services! <br>\r\n<br>\r\n</strong>If your products, services, and advertisements are of high quality, you can bet that your going to gain more traction on Facebook. People can actually like your ads! What does this mean? It means the social networking aspect of Facebook can actually multiply your advertising effort!<br>\r\n<br>\r\n<h5>I&#039;m going to show you how to get massive amounts of traffic from the Facebook advertising system while spending as little money as possible...</h5>\r\n\r\n<p><strong>This is just a small sampling of what is covered in the Viral Facebook traffic system:</strong><br>\r\n</p>\r\n\r\n<ul>\r\n\t<li>How to setup your account to get traffic fast - I&#039;m talking tonight! </li>\r\n\t<li>The secrets of writing a persuasive ad for the highest conversion possible!</li>\r\n\t<li> How to get the highest number of clicks at the lowest possible cost.</li>\r\n\t<li>Targeting and segmenting secrets for getting laser targeted visitors.</li>\r\n\t<li>Conversion increasing tricks that I use to pump up results quickly.<br>\r\n<br>\r\n There is so much more information covered in Viral Facebook Traffic that you will be ready to start getting traffic right after going through it! <br>\r\n</li>\r\n</ul><strong>Included is 20 FREE Bonus Videos taught by my colleague: Jeffrey Wyrick<br>\r\n<br>\r\n<br>\r\n<br>\r\n</strong>  <a href=\"http://www.bloggerswanted.net/wp-content/uploads/2012/10/Facebook-Training-Cover2.jpg\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\"></a>\r\n", 
    "end_date": null, 
    "title": "Viral Facebook Traffic", 
    "price": "20.00", 
    "instructors": "Tony Morelli & Jeffery Wyrick", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51125_b4d4_9.jpg", 
    "course_url": "https://www.udemy.com/viral-facebook-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-24T13:13:34Z"
}