{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">&quot;Like a lot of people, I&#039;ve always been intrigued at YouTube as one of the &quot;big pillars&quot; of the Internet - but somehow never felt I was getting the full benefit from it - until I went through Miss K&#039;s <strong style=\"\">Viral Video Authority</strong> course. Not only is this program a solid education in how to get the most and the best from YouTube - <strong style=\"\">it&#039;s left me feeling empowered and inspired!</strong> Many thanks, MissK!&quot;</em>-- Dennis Sinnott, U.S.A  </p>  <p style=\"\">  \t<strong style=\"\">A </strong><strong style=\"\">Viral Video on YouTube Can Literally Take A Struggling Business From Woe To Wow In A Matter Of Days!!!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Viral videos succeed because YOUR IDEAL AUDIENCE likes them and spreads them on to other people.</strong> If the audience doesn’t get it, the video doesn’t go viral, and unfortunately, there is nothing that can guarantee the response you want.  </p>  <p style=\"\">  \t        The Viral Video Authority training gives you the key strategies in creating a video that can potentially go VIRAL!  </p>  <p style=\"\">  \t     Training includes 23 videos purely dedicated to teaching you how to potentially go viral AND 55 YouTube Marketing lessons to help you optimize your presence on YouTube!!!  </p>  <p style=\"\">  \t<em style=\"\">In this training, you&#039;ll learn:</em>  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 1: Understanding The Types of Viral Videos </strong>  </p>  <p style=\"\">  \t        The first step in getting a video to go viral is to understand the different types of viral videos so you can better determine which type works best for you.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 2: What It Takes To Go VIRAL (part 1)</strong>  </p>  <p style=\"\">  \t        This lessons breaks down each one of the elements to going VIRAL so that you can easily integrate them in your videos.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 3: What It Takes To Go VIRAL (part 2)</strong>  </p>  <p style=\"\">  \t        We’ll continue to analyze the key elements you should include in your video to seriously boost your chances of going viral.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 4: Video Marketing | Where To Share Your Videos To Boost Your Chances Of Going Viral (part 1)</strong>  </p>  <p style=\"\">  \t        We&#039;ll get serious about video marketing strategies to help your video go viral.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 5: Video Marketing | Where To Share Your Videos To Boost Your Chances Of Going Viral (part 2)</strong>  </p>  <p style=\"\">  \t        You’ll discover more important platforms where you should distribute your videos in order to increase your chances of going viral.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 6: Video Marketing | Where To Share Your Videos To Boost Your Chances Of Going Viral (part 3)</strong>  </p>  <p style=\"\">  \t        You’ll discover some platforms that have PERFORMED EXTRAORDINARILY well for a number of ambitious video producers.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 7: What Do All Business Related Viral Videos Have In Common?</strong>  </p>  <p style=\"\">  \t        You&#039;ll understand the key elements that all successful business viral videos have in order for you to integrate them in your own video marketing strategy.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 8: What Do All Business Related Viral Videos Have In Common? (part 2)</strong>  </p>  <p style=\"\">  \t        You&#039;ll understand how to integrate your overall marketing to increase the sales you&#039;ll generate from going viral.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson 9: Viral Video Authority MANIFESTO</strong>  </p>  <p style=\"\">  \t        The Viral Video Authority MANIFESTO is the perfect PDF companion to all of the video lessons.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">YOUR BONUSES:</strong></em>  </p>  <p style=\"\">  \t         Get <u style=\"\">Exclusive Insider’s</u> Insight Into Some Of The Strategies Of Top Viral Videos!  </p>  <p style=\"\">  \t        You’ll Receive 6 Bonus Case Studies That Crack The Viral Video Marketing Code Wide Open!  </p>  <p style=\"\">  \t        This Is The ‘ULTIMATE VIRAL VIDEO BLUEPRINT’ That Lays Everything Out Step-By-Step For You!  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">AND YOU ALSO GET</em></strong>  </p>  <p style=\"\">  \t        Our complete YouTube marketing step-by-step training to ensure you fully optimize all of your videos to increase your chances of potentially going VIRAL!  </p>  <p style=\"\">  \t        Viral video marketing has the effect of a ROCKET when it comes to increasing and propelling your sales into orbit.  </p>  <p style=\"\">  \t        Get started TODAY and I&#039;ll see you inside the training!  </p>", 
    "end_date": null, 
    "title": "Viral Video Authority | How To Go Viral On YouTube", 
    "price": "20.00", 
    "instructors": "Krizia MissK", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/180020_35b8_4.jpg", 
    "course_url": "https://www.udemy.com/viral-video-authority-how-to-go-viral-on-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-10T21:05:56Z"
}