{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p class=\"PIN_1373384885910_hazClick\"><strong style=\"\">If you thought blogs were dead, think again!</strong></p>    <p class=\"PIN_1373384885910_hazClick\">The 2013 State of Inbound Marketing report from HubSpot reveals that nearly 50% of businesses acquire customers from leads generated by their blogs - just behind Facebook and LinkedIn.<br style=\"\">  </p>    <p class=\"PIN_1373384885910_hazClick\"><strong style=\"\">Your blog could become the determining factor in a customer&#039;s decision to choose you over your competition.</strong><br style=\"\">  </p>    <p>Blogging can help you market your business, establish yourself as a thought leader, get the word out about your causes, and make yourself more attractive to potential employers.</p>    <p>This condensed and comprehensive course will get you up and running using WordPress.com to its full potential in no time. </p>    <p><strong style=\"\">Business owners, entrepreneurs, marketers, social media strategists, students, job seekers, and casual bloggers will all benefit from taking this course.</strong></p>    <p>Follow author, developer, and new media pioneer, Deltina Hay, as she walks you through the process of <strong style=\"\">setting up and developing your WordPress blog in her typical no-nonsense teaching style. </strong></p>    <p><strong style=\"\">Using a real-world example from scratch, Deltina shows you hands-on how to:</strong></p>    <ul style=\"\">  \t<li>Take full advantage of the many features and settings within the WordPress platform</li>  \t<li>Publish optimized blog posts with embedded links, images, video, and galleries</li>  \t<li>Utilize all the WordPress formatting options within your posts and pages</li>  \t<li>Choose the right theme for your blog, and customize it to your liking</li>  \t<li>Use posting formats to get the best exposure for your embedded media</li>  \t<li>Create static pages, custom menus, and populate your sidebars (columns) with widgets</li>  \t<li>Integrate your blog with your other social media accounts, create custom widgets, and implement other advanced features</li>  </ul>  <p><strong style=\"\">Don&#039;t put that blog off any longer! Take the course today, and be blogging like a pro tomorrow.</strong></p>  ", 
    "end_date": null, 
    "title": "WordPress Essentials in Under an Hour", 
    "price": "20.00", 
    "instructors": "Deltina Hay", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/60351_bcb1_6.jpg", 
    "course_url": "https://www.udemy.com/learn-wordpress-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-16T12:16:10Z"
}