{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>*Updated November 2015*</em></p><p>  \t  Do you want to take advantage of the #1 video platform in the world? How about utilizing the 2nd largest search engine to build an audience and boost your income?  </p>  <p>  \t<strong>This intro-level course \"YouTube 101: Keys to a Successful Channel\" will teach you basic foundations for creating professional videos and building your own successful YouTube channel.</strong>  </p>  <p>  \t  In this course you'll learn about:  </p>  <ul>  \t<li>My YouTube strategies that earned me 1,000,000+ views in 2014</li>  \t<li>The best video equipment (for any budget)</li>  \t<li>The best software for creating videos (from beginner to pro)</li>  \t<li>Tools I use for my video creation process</li>  \t<li>YouTube optimization tips and tricks</li>  \t<li>How to get more views on YouTube</li>  \t<li>Awesome resources for creating high quality videos</li>  </ul>  <p>  \t<strong>Are you passionate about a particular topic? Maybe you love cooking and want to earn money on the side by doing recipe videos. Maybe you want to build a lifestyle business online so you can earn passive income. Maybe you're an entrepreneur looking to create engaging content to gain fans and customers. Knowing how to utilize YouTube is a MUST.</strong>  </p>  <p>  \t  How do I know? I've done it myself, and I want to teach you how you can do the same. This course is full of quick yet very helpful videos and is ready for anyone who wants to become more familiar with YouTube as a platform and learn how to take advantage of it.  </p>  <p>  \t  This course is constantly updated as I release more free videos so don't miss out.  </p>  <p>  \t<strong>Sign up now and make YouTube videos a priority in your journey to success online!</strong>  </p>", 
    "end_date": null, 
    "title": "YouTube 101: Keys to a Successful Channel", 
    "price": 0, 
    "instructors": "Andy Slye", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387320_7687_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-101/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T02:49:22Z"
}