{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Join Over 11,698 Students and Sign Up to one of My Courses Today!</strong><br></p><p><strong>Last Updated: February 20th, 2016.</strong></p><p><strong></strong></p><p><strong></strong></p><p><em><strong></strong></em></p><p>If you are looking to have a presence online your going to want to have a Youtube Channel.</p><p>If you are a film maker or want to get into making videos you want have a Youtube channel.</p><p>If you want to make a living on Youtube, you want to get this course.</p><p>In this course I am going to show you how you can take a Youtube channel, build it up from nothing and make it into a successfully property online that will promote your business and make you money as well.</p><p>With this course you will be able to get your brand and content in front of millions of people are get traffic to your website as well as convert watchers to become subscribers and fans of your business.</p><p>This course is primarily for people looking to promote their business on Youtube as well as anyone who wants to get started on Youtube and make a living off of the platform. Although it takes time to build out a Youtube channel, I will show you the best methods to get you ranking your videos at the top of YouTube's search results in no time.</p>", 
    "end_date": null, 
    "title": "Youtube: Marketing and Promotion For Small Businesses Online", 
    "price": "20.00", 
    "instructors": "Robin Haney", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543136_2962_2.jpg", 
    "course_url": "https://www.udemy.com/youtube-how-to-promote-your-business-and-make-money-online/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T14:05:03Z"
}