{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t <strong style=\"\">Imagine using the third most popular site on the Internet to drive hundreds of potential clients your direction. </strong>  </p>  <p>  \t Most people use a fraction of the marketing potential which is freely available on YouTube.  </p>  <p>  \t YouTube visitors tend to convert more often, and click deeper into websites, than visitors from other social sites. <strong style=\"\">Are you taking full advantage of this motivated audience?</strong>  </p>  <p>  \t Author and new media expert, Deltina Hay, shows you how to optimize your YouTube channel to drive more traffic to your website or social media accounts; and how to generate more sales and leads from within your YouTube videos.  </p>  <p>  \t <strong style=\"\">The YouTube video lessons in this course are hands-on demonstrations of the tactics you can use to leverage YouTube to its full marketing potential. Topics include:</strong>  </p>  <ul style=\"\">  \t<li>Customizing your YouTube channel for optimum exposure </li>  \t<li>Preparing and optimizing videos for upload to YouTube </li>  \t<li>Using annotations and other YouTube video features to drive traffic </li>  \t<li>Adding interactive features to YouTube videos to increase subscriptions </li>  \t<li>Creating YouTube galleries to place on websites and blogs </li>  \t<li>Integrating and promoting videos in blogs, Facebook, Twitter, and Google Plus </li>  </ul>  <p>  \t This course is intended for business owners and marketers who are serious about leveraging YouTube to generating leads; sell more products and services; or establish themselves as thought leaders.  </p>  <p>  \t <strong style=\"\">Get started marketing your products and website on YouTube today!</strong>  </p>", 
    "end_date": null, 
    "title": "YouTube Essentials", 
    "price": "20.00", 
    "instructors": "Deltina Hay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206978_f1f7_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T02:37:00Z"
}