{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">YOU TO CAN MAKE $125/DAY ON YOUTUBE !!!</strong></p><p><strong style=\"\">YOUTUBE EXPLODED</strong> is a <em style=\"\">no-fluff</em> YouTube usage course for beginner and intermediate users who would like to learn how to leverage the power of YouTube to make money.</p><p>The course consists of over 40 High-Definition videos and downloadable reference materials that teaches all aspects of YouTube and exposes <strong style=\"\">&quot;little-known-money-making secrets&quot;</strong> that eighty-percent of YouTube users and marketers <strong style=\"\">ARE NOT</strong> using or no about. These hidden YouTube gems can be implemented in minutes to bring you instant cash flows daily.</p><p><strong style=\"\">YOUTUBE EXPLODED</strong> was created and is taught by a certified instructor (in clear English) with more than 40 years of classroom teaching experience.</p><p>In this course, I will teach with the <em style=\"\">Look-Over-My-Shoulder</em> lecture method and DEMONSTRATE to you who to leverage YouTube to make money.</p><p><strong style=\"\">Course Objective:</strong> Learn essential aspects of using YouTube to make $100/day.</p><p><strong style=\"\">*** ALL LECTURES ARE IN HIGH DEFINITION (HD) ***</strong></p><p><strong style=\"\"><em style=\"\">Here Is a List of Some the Things You Will Learn</em></strong></p><ul style=\"\"><li><strong style=\"\"><em style=\"\"><strong style=\"\">How To Get a YouTube Account</strong></em></strong></li><li><strong style=\"\"><em style=\"\">How To Properly Set Up Your YouTube Channel</em></strong></li><li><strong style=\"\"><em style=\"\">How To Navigate The YouTube &quot;Backend&quot;</em></strong></li><li><strong style=\"\"><em style=\"\">How to Create Your Own High-Definition YouTube Videos.</em></strong></li><li><strong style=\"\"><em style=\"\">Where To Get 10,000s of &quot;Legal&quot; YouTube Videos and Learn How To Use Them    To Make Money. (This is Powerful!)</em></strong></li><li><strong style=\"\"><em style=\"\">How To Properly Write YouTube Video Titles</em></strong></li><li><strong style=\"\"><em style=\"\">How To Properly Write YouTube Video Descriptions</em></strong></li><li><strong style=\"\"><em style=\"\">How To Properly Select and Add YouTube Video Tags</em></strong></li><li><strong style=\"\"><em style=\"\">How To Fully Monetize Your YouTube Videos</em></strong></li><li><strong style=\"\"><em style=\"\">How To Feature ANY of Your YouTube Videos. (This is powerful)</em></strong></li><li><strong style=\"\"><em style=\"\">The Power of Video Thumbnails and How To Create Them (This is powerful)</em></strong></li><li><strong style=\"\"><em style=\"\">Why You Must Use Annotations On Your Videos. (I will show you how)</em></strong></li><li><strong style=\"\"><em style=\"\">How To Get More Subscribers in hours. (This is powerful)</em></strong></li><li><strong style=\"\"><em style=\"\">Why You Should Set Up Playlist (Often overlooked. It&#039;s money down the drain!)</em></strong></li><li><strong style=\"\"><em style=\"\">How To Get YouTube To Advertise Your Channel For FREE! (Few people know    about this and never use it. Money down the drain!)</em></strong></li><li><strong style=\"\"><em style=\"\">How To Make Google LOVE Your YouTube Videos!</em></strong></li><li><strong style=\"\"><em style=\"\">One Powerful Little-Known Money-Making SECRET  to HOT to mention it here. (It    is free and can be set up in minutes)</em></strong></li><li><strong style=\"\"><strong style=\"\"><em style=\"\">And much, much MORE !!!</em></strong></strong></li></ul><p><strong style=\"\">Let Me Help You</strong></p><p>So if you have a strong desire or compelling need to make some money and want to have fun doing it, then this course is for you.</p><p>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk!</p><p>After taking my course, you should be able to leverage YouTube to get exactly what you put into it. At least after taking my course, you will not be shooting in the dark and will know exactly what you are doing.</p><p><strong style=\"\">WARNING: </strong>THERE ARE NO FREE LUNCHES AND DO NOT BELIEVE ALL OF THE HYPE ABOUT GETTING RICH QUICK FROM YOUTUBE !!! COMMON SENSE DICTATES THAT YOU GET WHAT YOU PUT INTO SOMETHING. MAKING MONEY ON YOUTUBE <em style=\"\">DOES</em> INVOLVE THE &quot;WORK&quot; OF CREATING VIDEOS, UPLOADING VIDEOS, PROPERLY SEOing YOUR VIDEO TITLES, DESCRIPTIONS, AND TAGS, ANNOTATING YOUR VIDEOS AND CONSTANTLY ADDING MORE VIDEOS, AND MANY OF THE OTHER THINGS I WILL TEACH YOU IN &quot;MASSAGING&quot; AND BENEFITING FROM YOUR YOUTUBE MONEY MAKING VENTURE. THIS IS WORK, IS IT NOT? <strong style=\"\">YOUTUBE EXPLODED </strong>PLACES YOU ON THE RIGHT PATH TO GET YOU THERE.</p><p>Click the <em style=\"\">&quot;Take This Course&quot;</em> button now.</p><p>Kind regards,</p><p><em style=\"\"><strong style=\"\">R. Jerome Harris</strong></em></p>", 
    "end_date": null, 
    "title": "YOUTUBE EXPLODED!", 
    "price": "40.00", 
    "instructors": "R. Jerome Harris", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462748_a662_5.jpg", 
    "course_url": "https://www.udemy.com/youtube-exploded-how-i-make-125-per-day-on-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T07:47:44Z"
}