{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>آخر تعديل بتاريخ 15/2/2016</strong></p><p><strong>ملحوظة هامة: تم إلغاء إمكانية شراء كورسين بسعركورس واحد</strong></p><p><strong>لن تخسر سنتاً واحداً على إعلانات فيس بوك بعد اليوم بإذن الله!</strong><br></p><p>أقدم لكم الدليل العملى الشامل لكيفية عمل وإدارة الحملات الإعلانية على فيسبوك الذى يأخذك خطوة بخطوة من الصفر حتى الإحتراف.. الآن يمكنك أن تحترف تصميم الحملات الإعلانية بتكلفة أقل من 1 سنت وتحقيق أعلى المبيعات وأفضل عائد على الاستثمار</p><p>في هذا الكورس \"احترف الحملات الإعلانية على فيسبوك\" تجد الطرق العملية المجربة 100% والتى تمنحك كافة الأدوات اللازمة للعمل كمتخصص حملات إعلانية على الفيس بوك بدون أى خبرات سابقة وباستخدام وسائل سهلة ومجانية تمتلك معها أفضل المهارات المطلوبة للعمل في سوق التسويق الإلكتروني في العالم أجمع</p><p><strong>الآن يمكنك تهيئة صفحتك وصفحات عملائك على فيس بوك واحتراف التطبيقات العالمية الرائعة وعمل حملات إعلانية متقنة تساهم في زيادة المعجبين بصفحتك والمتفاعلين مع منشوراتها وزيادة مشاهدات فيديوهاتك وقوة موقعك الشخصي كل هذا باستخدام إعلانات فيسبوك!</strong></p><p>ولأننى واثق من مدى قوة هذا الكورس ومن نتائجه المؤكدة النجاح، أقدم خدمة الدعم الفني للدارسين عقب الانتهاء من الكورس للإجابة عن استفساراتك ومساعدتك فى تنفيذ كل الخطوات العملية المشروحة في الكورس لكى تلمس بنفسك العائد الذى يمكنك الحصول عليه بعد امتلاك هذه المهارات المتميزة</p><p><strong>تعلم أحد أهم المهارات المطلوبة لسوق العمل واحترف فن الإعلان على فيس بوك</strong></p><p>فى هذا الكورس سوف تتعلم عملياً ما يلى:</p><ul><li>كيف تحصل على زوار مستهدفين وتفاعل بأقل من 1 سنت للشخص الواحد</li><li>كيف تحقق أعلى عائد على الاستثمار وتحصل على أرباح أعلى من التكلفة</li><li>مراعاة سلسلة فيسبوك الإعلانية واستكمال كافة أركان الإعلان الناجح</li><li>كيف تصمم صفحة تجارية عالية الجودة مع استهداف الكلمات الصحيحة</li><li>استكشف هدية إضافية بداخل الكورس!</li><li>تصميم صورة بروفايل وغلاف جذاب بأبسط وأسرع الطرق</li><li>عمل قائمة بريدية ونموذج تسجيل متميز على MailChimp</li><li>تجميع عناوين البريد الإلكتروني مباشرة على صفحتك</li><li>إضافة قنواتك وفيديوهاتك من يوتيوب مباشرة على صفحتك</li><li>إضافة حسابك على إنستاجرام مباشرة على صفحتك</li><li>الطرق المتنوعة للاستهداف على فيسبوك</li><li>عمل نسخ اختبارية متعددة وتنويع التصميمات والرسائل التسويقية بسهولة وبسرعة</li><li>أهمية A/B Split Testing وكيف تتجنب الخطأ الذى يقع فيه أغلب المعلنين الآخرين</li><li>عمل جمهور مخصص واستهداف مخصص لتبقى بعيداً عن المنافسة</li><li>توسيع قوائم الاستهداف والحصول على مئات الآلاف من العملاء المحتملين</li><li>أسهل الطرق للتصميم بأدوات مجانية على الإنترنت</li><li>استخدام الفوتوشوب لتجاوز مشكلة النصوص 20% فقط من التصميم</li><li>استخدام الفوتوشوب للنسخ الاختبارية</li><li>شاهد كيف ترفع التفاعل على منشوراتك</li><li>شاهد كيف تروج لصفحتك وترفع من عدد المشتركين المستهدفين بها</li><li>شاهد كيف تروج لموقعك الشخصي وزواره</li><li>شاهد كيف ترفع من نسبة مشاهدات فيديوهاتك على فيس بوك</li><li>تعرف على تقارير وإحصائيات فيسبوك التفصيلية</li></ul><p>يحتوى الكورس على كل ما تحتاج إليه للتطبيق العملى ويشرح خطوة بخطوة كيفية تنفيذ كل جزء منه بطريقة متدرجة تتناسب مع كافة المستويات فهو يناسب المبتدئ والمتمرس على حد سواء</p><p>كما يشتمل الكورس على كافة المصطلحات الانجليزية التى تحتاجها لفهم هذا المجال مع شرح مبسط لمعنى كل مصطلح مما يساهم في رفع قدرتك على متابعة كافة التطورات في هذا المجال</p>", 
    "end_date": null, 
    "title": "احترف الحملات الإعلانية على فيسبوك Facebook Campaigns", 
    "price": "20.00", 
    "instructors": "Mohammed Fakhry", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/732958_e347_3.jpg", 
    "course_url": "https://www.udemy.com/facebook-campaigns-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T16:33:10Z"
}