{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>「30歳になると、自分の将来が見えてくるよね」</strong></p>\n\n<p>友人の一言。彼は新聞配達員。午前3時半に50ccのカブを乗り回し、住み慣れた地元（金沢市）を滑走する彼は、どことなく悲しげな表情。</p>\n\n<p>「大丈夫だって。会社員よりマシだろ」</p>\n\n<p>と、なだめる僕。ニートやフリーターをやっている友人に「会社員よりマシだろ」と言えば、大抵の場合、空気が和む。そこに複数の人間がいれば全会一致になる。会社員なんかより俺たちの方が幸せだよな、という暗黙の了解がそこに広がる。</p>\n\n<p><strong>会社員ってどうやらシンドイらしい。</strong></p>\n\n<p>収入が増えない。上司の足と口が臭い。部下や同僚がうざい。こんな悩みならまだ可愛いもの。社内の人間関係が良くない上に、この先の昇級、昇格、昇進が見込めない。セクハラとパワハラのオーケストラ。デスクで作業をしていれば、常に後ろ指をさされている気分。</p>\n\n<p>大丈夫。この程度なら、まだマシ。自覚がある分だけ、やっぱりマシ。一番、痛いのは搾取されている新入社員たち。経営者の書いた本に啓発され、<strong>たかだか手取り20万円のために</strong>定時出勤をする。「その会社の人に会ってみたら、案外良さそうな人だったから」という全く意味のない理由で会社を決めた若者たち。経営者は著書の中で「世界一を目指す」とか寒いこと言っているけど、内実、ドメスティックに事業を展開するだけ。GoogleやAppleやテスラモーターズの時価総額に追いつくには、<strong>あと4000年ぐらいは必要</strong>な企業に勤めている人たち。</p>\n\n<p>参考：Googleの時価総額は69兆円、Appleの時価総額は67兆円、テスラモーターズは3兆円。</p>\n\n<p>仮に今、会社を好きであろうとなかろうと、いずれ転職する時期がやってくる。中小企業白書によると、<strong>企業の平均寿命は23年。</strong>僕たちの労働寿命は40年を超えるので、大抵の人は一度や二度の転職を経験するのがフツー。（僕もこの10年でキャリアを3回も変えてきた）</p>\n\n<p>転職を試みる人間の幾らかは、独立や起業もオプションの一つとして検討する。ほとんどの場合、そのオプションは選ばれない。なぜそのオプションが選ばれないか。それは、独立・起業したとしてもお客さんが来なかったらどうしよう・・・と<strong>ビビっているから。</strong></p>\n\n<p>当然、お客さんが来なかったら、注文もこない。注文がこなければ、売上が立たない。うわー、どうしよう。やっぱり独立・起業は不安だ。難しそうだ。やめておこう・・・。</p>\n\n<p>要は、お客さんさえ集まれば、なんとかなると思っている。</p>\n\n<p>うん、間違いない。お客さんさえ集まれば、なんとかなる。まるでお客さんがマグネットに惹きつけられるように集まってきたら、明日、会社を辞める人たちはどれだけいるだろう。100人？1000人？10000人？もっと？</p>\n\n<p>いずれにせよ、独立や起業を考えている人たちにとって、目下の課題は集客。正確には、倒産の危機に瀕している中小企業の社長や町工場のおっちゃんたちも同じことを考えている。そう、ビジネスにおいて、<strong>集客をできる奴より強い奴は存在しない。</strong></p>\n\n<p>人さえ集める技術があれば、一生食っていける。英語やプログラミング、コピーライティングなんかよりも、よっぽどソリッドで耐久性のあるスキル。</p>\n\n<p>本コースでは、集客の一翼を担うメールマガジンの運営方法について説明している。DRM（ダイレクトレスポンスマーケティング）という、個人で億を稼ぐ技術を紹介し、メルマガをどのように活用していくか一緒に見ていく。</p>\n\n<p>このコースを受講すれば、メールマガジンの本質が見えてくる。でも<strong>受講するだけでは稼げるようにならない。</strong>実際に自分の手を動かして、マーケットのレスポンスを感じながらビジネスを構築していく必要がある。繰り返すが、このコースを受講しても金持ちにはなれない。むしろ受講費の分だけ、貧乏になってしまう。だけど、価格以上の価値は感じられるはず。（あ、ここら辺の知識は講義で説明している。人の購買原理という項目を確認してほしい）</p>\n\n<p>もう一度繰り返す。この講義を受講することで、メールマガジン運営の知識や着想を得ることができる。お客さんと<strong>どんなスタンスで付き合えばいいか</strong>もわかる。だけど、受講するだけではリッチになれない。手垢のついた表現ではあるけども、「行動」しないと何も始まらないから。</p>\n\n<p>ここまで読んだ人（コピーライティングのパワーで読まされた人）は、きっと行動できる人だと思う。文章を読むというのも一つの行動だから。大抵の人は、冒頭の数行を読んですぐに離脱したはず。そして<strong>パチンコやFacebookに逃げ</strong>、現状を維持する。それも一つの人生。</p>\n\n<p>もう一つの人生も存在する。それはこのコースを受講して、メールマガジンの発行をスタートする人生。メールマガジンを発行した程度で人生が変わるなんて、ゆめゆめ思ってはいけない。<strong>人生は劇的には変わらない。</strong>ゆっくりと変わる。人生は変わらないけど、行動した自分に自信はつく。その自信の積み重ねが、あなたの人生にインパクトを与えるんじゃないかと僕は思う。</p>\n\n<p>あなたはどう思う？</p>", 
    "end_date": null, 
    "title": "明日、会社を辞めても「食える人」になるメルマガ運営方法", 
    "price": 0, 
    "instructors": "Haamalu Limited Liability Company", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790376_8410_2.jpg", 
    "course_url": "https://www.udemy.com/mail-magazine/", 
    "subject_name": [
        "Social Media Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-12T06:31:02Z"
}