{"selfpaced": true, "topic_name": ["Law"], "description": "\n\n                    \n                    \n                    Fear and uncertainty about copyright law often plagues educators and sometimes prevents creative teaching.  This course is a professional development opportunity designed to provide a basic introduction to US copyright law and to empower teachers and librarians at all grade levels. Course participants will discover that the law is designed to help educators and librarians.\n\n                                            Syllabus\n                        Welcome to Copyright LawThank you for joining Copyright for Educators and Librarians! Our goal is to provide participants with a practical framework for analyzing copyright issues that they encounter in their professional work. We use a lot of real life examples—some of them quite complex and amusing—to help participants get used to the systematic analysis of copyright problems. This course is intentionally a first step toward bridging the gulf that is often perceived between desirable educational practice and legal permissible activities. We very much hope that this course will be a service to the library and education community, and that it provides a relatively fun and painless way to go deeper into copyright than the average presentation or short workshop allows. If you enjoy this course and would like to learn more about copyright in multimedia, that course will soon be available!A Framework for Thinking about CopyrightIn the U.S., copyright is first and foremost a federal law passed by Congress under authority given it by the Constitution, where it says that Congress is allowed to pass laws to (among other things) promote the progress of science and the useful arts by securing for limited time to authors and inventors the exclusive right to their respective writing and discoveries.  This authorization allows Congress to adopt both copyright laws which protect creative expression, and patent laws, which are very different and provide exclusive rights in inventions.  In this unit we will examine what is copyright and how it happens.Owning RightsFor this module, we will discuss copyright ownership and what it means in an educational context.  We will also discuss the public domain, the first sale doctrine, and the idea/expression dichotomy. This last concept—that creative expression can be copyrighted, but that the ideas behind it cannot—is one of Anne’s favorite topics in copyright law. As you’ll see in the video, the concept is applicable to many subjects and situations.Specific Exceptions for Teachers and LibrariansThis module will cover specific exceptions in copyright law for libraries and educational instruction as outlined in Section 110(1) of the U.S. Copyright Law. The module will examine how this law applies to in-class and online instruction as well as library lending. Additionally, it will explore different licenses for those working in educational institutions and libraries, including the specifics of Creative Commons. Finally, we discuss identifying and requesting permissions for use of copyrighted material.Understanding and Using Fair UseFair Use is one of the most powerful aspects of U.S. copyright law for educators and librarians.  In this module, we help students define Fair Use and understand where and in what contexts the law applies.  We also address international aspects of copyright. \n                                    ", "end_date": "2014-08-25T00:00:00Z", "title": "Copyright for Educators & Librarians", "price": 0, "instructors": "", "institution_name": ["Duke University"], "commitment": "2-3 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/copyright-for-education", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-07-21T00:00:00Z"}