{"selfpaced": false, "topic_name": ["Law"], "description": "\n\n                    \n                    \n                    Il s’agit de donner les clés du fonctionnement d’une grande démocratie occidentale à travers l’étude de concepts fondamentaux (constitutions, institutions, juridictions) par une analyse spécifique de la Cinquième République française.\r\nVéritable introduction au droit constitutionnel, ce cours s’adresse à ceux qui souhaitent devenir des citoyens avertis et comprendre la vie politique, institutionnelle et constitutionnelle dans son application.\r\nConçu en deux parties, il propose d’abord une présentation des concepts qui fondent le régime politique de la Cinquième République française, puis une analyse exhaustive des institutions qui la composent.\r\nCe cours s’intéresse directement au fonctionnement de l’État, aux rapports entre les pouvoirs exécutif et législatif, et à la vie politique. Il aborde également les grandes notions du droit constitutionnel (nature et typologique des États, vie et rôles de la Constitution) ainsi que le fonctionnement du contentieux constitutionnel et du système juridictionnel dans la régulation des institutions et la garantie des droits fondamentaux.\n\n                                    ", "end_date": "2014-03-27T00:00:00Z", "title": "Dans le secret des rouages de l’Etat occidental: décryptage du droit constitutionnel", "price": 0, "instructors": "Thomas Ehrhard and Hughes Portelli", "institution_name": ["Université Panthéon-Assas - Paris II"], "commitment": "", "subject_name": ["Social Sciences"], "course_url": "https://www.france-universite-numerique-mooc.fr/courses/Paris2/09001/Trimestre_1_2014/about", "duration": "10 weeks", "language_name": ["Others"], "provider_name": ["France Université Numerique"], "start_date": "2014-01-16T00:00:00Z"}