{"selfpaced": false, "topic_name": ["Law"], "description": "\n\n                    \n                    \n                    Freedom of expression is a human right. Learn from the experts at Amnesty International how to claim and defend your rights in this human rights course.\n\nThis short course will equip you with the knowledge to understand and claim your right to freedom of expression, and the skills and confidence to take action to defend it.\n\nYou will be challenged to think critically and devise effective actions to defend the human rights of others. You will be able to adapt the human rights of freedom of expression, association and assembly to real life situations and come face-to-face with human rights activists on the front line of human rights defense.\n\nThis is Amnesty International’s first human rights MOOC. Be prepared for active, fast-paced learning, connecting with course participants across the world to bridge the gap between theory and practice and turn yourself into an agent of change.\n\nYou will explore human rights through case studies, including real cases of individuals at risk. You will discover how actions are developed to defend people against human rights violations.\n\nCourse facilitators and moderators from across the human rights movement will listen, guide and interact with participants.\n\nConsider signing up with a friend or group to take part in optional group activities together. Join the conversation on the Amnesty International Human Rights Education Facebook page.\n\nNo previous knowledge is needed. Register today to take part in a global human rights experience.\n\n                                    ", "end_date": "2015-12-08T00:00:00Z", "title": "Rights1x: Human Rights: The Right to Freedom of Expression", "price": 0, "instructors": "Emilie White, Barbara Weber, Netsanet Belay, Mazen Jaber, Tara Rao, Cristina Sganga, Rana Abdelhamid, Awuor Ayiecho and Stella Andenyi", "institution_name": ["Amnesty International"], "commitment": "3-5 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.edx.org/course/human-rights-right-freedom-expression-amnesty-internationalx-rights1x", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-11-17T00:00:00Z"}