{"selfpaced": false, "topic_name": ["Anthropology"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Social Sciences\n                                                                                                    &gt; Anthropology\n                                                            \n                            \n                                                \n                    \n                    \n                    About 2 million years ago our human\nancestors were insignificant animals living in a corner of Africa. Their impact on the world was no greater than\nthat of gorillas, zebras, or chickens. Today humans are spread all over the\nworld, and they are the most important animal around. The very future of life\non Earth depends on the ideas and behavior of our species. This course will explain how we humans have conquered planet Earth, and how\nwe have changed our environment, our societies, and our own bodies and minds.\nThe aim of the course is to give students a brief but complete overview of\nhistory, from the Stone Age to the age of capitalism\nand genetic engineering. The course invites us\nto question the basic narratives of our world. Its conclusions are enlightening\nand at times provocative. For example:·        \nWe\nrule the world because we are the only animal that can believe in things that\nexist purely in our own imagination, such as gods, states, money and human\nrights.  ·        \nHumans are ecological serial killers – even with stone-age tools, our ancestors wiped\nout half the planet's large terrestrial mammals well before the advent of\nagriculture. ·        \nThe\nAgricultural Revolution was history’s biggest fraud – wheat domesticated\nSapiens rather than the other way\naround. ·        \nMoney\nis the most universal and pluralistic system of mutual trust ever devised.\nMoney is the only thing everyone trusts.·        \nEmpire\nis the most successful political system humans have invented, and our present\nera of anti-imperial sentiment is probably a short-lived aberration. ·        \nCapitalism\nis a religion rather than just an economic theory – and it is the most\nsuccessful religion to date.·        \nThe\ntreatment of animals in modern agriculture may turn out to be the worst crime\nin     history.·        \nWe\nare far more powerful than our ancestors, but we aren’t much happier.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n·         Humans will soon disappear. With the help of novel technologies, within a few\ncenturies or even decades, Humans will upgrade themselves into completely\ndifferent beings, enjoying godlike qualities and abilities. History began when\nhumans invented gods – and will end when humans become gods. \n\n                                            Syllabus\n                        Part I: The Cognitive Revolution \n\n \n\nLecture 1: The Human Family\n\nOne hundred thousand years ago, at\nleast six different species of humans inhabited planet Earth. Our species, Homo\nsapiens, was just one among them. Who were the others? Where did they come\nfrom? And what happened to them? Why is there today only one species of humans—Homo\nsapiens?\n\n \n\nLecture 2: The Cognitive\nRevolution\n\nThe Cognitive Revolution, about\n70,000 years ago, enabled Homo sapiens to conquer the world and drive\nall other human species to extinction. During this revolution, Homo sapiens\ndeveloped a new and remarkable kind of language. How was this language\ndifferent from the languages of earlier human species and of other animals? What\nwere the advantages that Homo sapiens gained from this unique language? \n\n \n\nLecture 3: Daily Life in the\nStone Age\n\nWhat was life like for people who\nlived 30,000 years ago? What did they do when they woke up in the morning? How\ndid they organize their societies? Did they have monogamous relationships and\nnuclear families? Did they have religions, revolutions, and wars?\n\n \n\nLecture 4: The Human Flood\n\nFollowing the Cognitive Revolution,\nHomo sapiens spread all over the planet. While doing this, it drove\nnumerous other species to extinction. In Australia, up to 95% of all large\nanimal species vanished. In America,\n84 of 107 large mammal species disappeared. Altogether, about half of the large\nterrestrial mammals that populated Earth became extinct. How could a few\nmillion individuals who possessed no more than Stone Age technology have caused\nsuch devastation?\n\n \n\n \n\nPart II: The Agricultural Revolution \n\n \n\nLecture 5: History’s Biggest\nFraud\n\nAbout 12,000 years ago, people in\nthe Middle East, China, and Central America began domesticating plants and animals.\nIn the process, Homo sapiens,\ntoo, was domesticated, abandoning a life of hunting and gathering\nfor the pleasures and discomforts of agriculture. For most people, the\ndiscomforts outweighed the pleasures. The Agricultural Revolution made the life\nof the average person harder. Why, then, did it occur?\n\n \n\nLecture 6: Building Pyramids\n\nFor millions of years, humans lived\nin intimate bands of no more than a few dozen individuals. Our biological\ninstincts are adapted to this way of life. Humans are consequently ill-equipped\nto cooperate with large numbers of strangers. Yet shortly after the Agricultural\nRevolution erupted, humans established cities, kingdoms, and huge empires. How\ndid they do it? How can millions of strangers agree on shared laws, norms and\nvalues?\n\n \n\nLecture 7: There is No Justice\nin History \n\nA critical factor in the formation\nof complex societies was the division of the population into a hierarchy of\ngroups. Agricultural and industrial societies have been built on hierarchies of\nclass, race, ethnicity, and gender. Why was it impossible to create a just and\nequal society? What is the deep root of prejudice and injustice? In particular,\nwhy did almost all known societies treat men as superior to women? \n\n \n\n \n\nPart III: The Unification of Humankind\n\n \n\nLecture 8: The Direction of History\n\n\nAfter the Agricultural Revolution,\nhumans created many different cultures and societies. The relations between\nthese different societies were very complex, and involved wars and conflicts as\nwell as trade, immigration and imitation. But as time went by, the connections\nbetween the societies became stronger and stronger, so that humankind was\ngradually united into a single global society. Three main forces shaped this\nprocess of unification. The first was money and trade. Money is the most\nuniversal system of mutual trust ever devised by humans. How come even people\nwho believe in different gods and obey rival kings, are nevertheless willing to\nuse the same money?\n\n \n\nLecture 9: Imperial Visions\n\nThe second force that shaped the\nprocess of human unification is imperialism. The idea of empire is seen today\nin a very negative light, but empires have played such a central role in human\nhistory that it’s hard to regard them as totally evil. What exactly is an\nempire? How have empires succeeded in uniting under their control different\necological regions, ethnic groups, and religious communities? How can we\nbalance the positive contribution of empires with their record of violence and\noppression? And what is the future of the imperial ideal? Is the world destined\nto be ruled by a new global empire?\n\n \n\nLecture 10: The Law of Religion\n\nThe third force that shaped the\nprocess of human unification is religion. The role of religion in history is\nextremely controversial. Some see religion as the root of all evil, while for\nothers it is the primary source of happiness, empathy, and progress. Can we\narrive at a balanced judgment? What were the main landmarks in the religious\nhistory of the world? In what ways did different cultures understand the\nuniverse, distinguish good from evil, and explain the ubiquitous presence of\nsuffering?\n\n \n\n \n\nPart IV. The Scientific Revolution\n\n \n\nLecture 11: The Discovery of\nIgnorance\n\nDuring the last 500 years the\nprocess of human unification was completed. At the same time, there has been an\nexplosive growth in the power of humankind, due above all to the discoveries of\nmodern science. Humankind has become increasingly convinced that the only thing\nthat limits its power is its own ignorance, and that the discovery of new\nknowledge can enable it to do almost anything. How is the modern scientific\ntradition different from all previous traditions of knowledge? What accounts\nfor its sudden rise and for its unparalleled achievements? \n\n \n\nLecture 12: The Marriage of\nScience and Empire\n\nModern science developed in\nalliance with the modern European empires. The conquest of new knowledge\ndepended upon and made possible the conquest of new territories. What exactly\nwas the contribution of science to the rise of the European empires, and what\nwas the contribution of the European empires to the development of science? And\nwhy did it all start in Europe, rather than in China,\nIndia, or the Middle East? \n\n \n\nLecture 13: The Capitalist Creed\n\nThe close ties between science and\nimperialism were in fact just one part of a more complex relationship. The\nthird crucial member of this relationship was capitalism, which financed both\nscience and empire, and which led to an unprecedented growth in the world\neconomy. How does a capitalist economy function? How is it different from traditional\neconomies? Is capitalism natural, or is it really a kind of religion?\n\n \n\nLecture 14: The Industrial\nRevolution\n\nDuring the last 200 years, the\ncombination of science, imperialism and capitalism produced the Industrial\nRevolution. This revolution gave humankind control of enormous new energy\nresources, and enabled humankind to start manufacturing far more things than\never before, far more quickly, and far more cheaply. How did this change the\nglobal ecology, daily life, and human psychology?\n\n \n\nLecture 15: A Permanent\nRevolution\n\nThe Industrial Revolution opened an\nera of permanent revolution. The late modern socio-political order is constantly\nchanging, never settling into any stable pattern. The pillars of human\norder—most notably, the family and the intimate community—are crumbling around\nus. How do humans deal with the resulting vacuum and chaos? How do society and\npolitics function without stability? Is the world becoming more violent and\ndangerous, or is it actually more peaceful and secure than ever before? \n\n \n\nLecture 16: And They Lived\nHappily Ever After \n\nHave 500 years of amazing discoveries,\ndevelopments, and revolutions made people happier? Are people today happier\nthan in the Middle Ages, or in the Stone Age? If not, what was the point of all\nthese changes? Most history books ignore these issues, yet these are the most\nimportant questions we can ask about history. New studies in biology,\neconomics, and psychology are offering fascinating insights into the history of\nhuman happiness.\n\n \n\nLecture 17: The End of Homo Sapiens\n\n\nOver the last few decades humans\nhave began to bend and break the laws of natural selection—laws that have\ngoverned life on Earth for the past four billion years. New technologies such\nas genetic engineering and nanotechnology are giving us unprecedented abilities\nto design not only the world around us, but also our own bodies, our\npersonalities, and our desires. How will this influence society and culture?\nDoes anybody know where we are heading? What is the likely future of humankind?\n\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "A Brief History of Humankind", "price": 0, "instructors": "Dr. Yuval Noah Harari", "institution_name": ["Hebrew University of Jerusalem"], "commitment": "2-4 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/course/humankind", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-08-10T00:00:00Z"}