{"selfpaced": false, "topic_name": ["Anthropology"], "description": "\n\n                    \n                    \n                    Join us at the University of Reading as we chart the progress of an archaeological excavation from dig to lab and beyond on this free online course.\n\nTake a virtual field trip to the Vale of Pewsey\n\nWe’ll be showing you around our field school – a month-long excavation at the Vale of Pewsey, which is a relatively untouched site compared to its world-famous neighbours, Stonehenge and Avebury.\n\nThe Vale of Pewsey is an archaeological treasure chest and the jewel of its crown is Marden. Built around 2,400 BC, Marden is the largest henge in the country and one of Britain’s most important but least understood prehistoric monuments.\n\nEvery object has a tale to tell and we’ll investigate how archaeologists paint a vivid picture of what life was like in Neolithic times through the astounding assortment of discoveries made in this beautiful part of England.\n\nExplore every aspect of archaeology\n\nAn archaeological excavation isn’t just turning up with a trowel to dig. Drawing on case studies from our field school, you’ll find out about every aspect of archaeology, from deciding where to dig to the collection, recording and storage of artefacts.\n\nWe’ll investigate excavation techniques such as topographic surveying and scientific coring. And through distinctive discoveries at the Vale of Pewsey, we’ll take a closer look at what you can do with an artefact once you’ve found it.\n\nLearn how archaeology can study the dead\n\nOne of the most intriguing and eye-opening finds of all is a burial site or grave, which provides fascinating insights into the past. In Week 2, we’ll examine the archaeological methods employed in the study of the dead. What can skeletal remains tell us about where someone lived, their occupation and their health?\n\n\n\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "Archaeology: from Dig to Lab and Beyond ", "price": 0, "instructors": "Duncan Garrow", "institution_name": ["University of Reading"], "commitment": "3 hours", "subject_name": ["Social Sciences"], "course_url": "http://www.futurelearn.com/courses/archaeology?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "2 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-20T00:00:00Z"}