{"selfpaced": false, "topic_name": ["Anthropology"], "description": "\n\n                    \n                    \n                    In a cave on the Indonesian island of Flores, a team of archaeologists were surprised to find the skeletal remains of a mysterious new species.  This free online course follows the incredible discovery of Homo floresiensis - or ‘the Hobbit’ as it has come to be known. Join us on a quest of discovery and adventure as the mystery is unravelled piece by piece using a variety of scientific techniques and archaeological approaches.\n\nWelcome to the fascinating world of modern archaeological science and Homo floresiensis\n\nIn this course you will follow a dedicated team of scientists as they continue to uncover clues that shine a light on the world in which ‘the Hobbit’ lived and our own origins as a species. You will learn about the nature and implications of the mystery of ‘the Hobbit’ through investigating a range of significant questions including:\n\nWho is 'the Hobbit'?\nWhen did she live? \nWhat happened to her species?\n\n\nLearn how modern scientific techniques are used to unravel the secrets of Homo floresiensis\nThis course introduces you to a team of archaeologists and scientists with diverse areas of expertise. Go behind the scenes and join them on a journey from the cave to the lab as they unearth artefacts and learn about processes and methods used to read evidence buried in the past. These interactive investigations will help you understand the multidisciplinary approach to modern archaeology, incorporating scientific techniques and approaches. Learn what evidence can be found, what stories artefacts tell, what dating methods can be used and how the secrets hidden in time are revealed through science.\n\nWhat does the Homo floresiensis tell us about our own origins?\nUncovering Homo floresiensis has had significant implications for the world of archaeology and beyond. This course explores the local and international significance of Homo floresiensis and provides insights into the controversy and heated debates surrounding the discovery and biological status of ‘the Hobbit’. By beginning to unravel the mystery prepare to challenge assumptions about human evolution and develop an understanding of how ‘the Hobbit’ fits into the broader story of our origins as a species.\n\nKeep up-to-date with the latest findings about evolution and Homo floresiensis\nThe Centre for Archaeological Science (CAS) at the University of Wollongong was established to develop, integrate and apply modern scientific techniques to answer fundamental questions about human evolution and the analysis of material remains of past human life and activities. Boasting world-class facilities and researchers who have played a crucial role in uncovering the latest findings about ‘the Hobbit’, CAS shares expertise throughout this course that will take you to the forefront of modern archaeological science methods and research.\n\nPrepare to embark on an adventure filled with mystery, questions and secrets all waiting to be unearthed throughout this quest…\n\n\n\n                                    ", "end_date": "2016-08-15T00:00:00Z", "title": "Homo Floresiensis Uncovered: The Science of ‘the Hobbit’", "price": 0, "instructors": "Richard Roberts and Zenobia Jacobs", "institution_name": ["University of Wollongong"], "commitment": "2 hours", "subject_name": ["Social Sciences"], "course_url": "http://www.futurelearn.com/courses/homo-floresiensis?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-07-18T00:00:00Z"}