{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<blockquote><span style=\"color: rgb(51, 51, 51);\"><strong>The instructor has a great way of teaching the material and helping you to succeed. </strong><br><em>- Mirko (Student)</em></span></blockquote><p><strong><strong><strong><strong>⇢</strong></strong></strong> Course Updated March 2016!</strong></p><p><strong><strong><strong><strong>⇢</strong></strong></strong> Join Over 18,000+ Premium Students Who Have Enrolled In My Udemy Courses This Year!</strong></p><p><strong><strong><strong><strong><strong>⇢</strong></strong></strong> 400+ Five Star Reviews Shows Students Who Enrolling Are Getting Real Results!</strong> </strong><br></p><p><strong>___________________________________________________________________________________________________________________</strong><br></p><p><strong>Simple Strategies for Bulletproof Focus Revealed! <br></strong></p><p><strong>This Course is Designed For YOU! 10x Power Focus will be your daily guide to improve your productivity, work efficiently in any job, profession and venture you choose to be.</strong></p><p>This is a revolutionary <strong>Accelerated Learning Self-Study course</strong>. It has been created to <strong>inspire, encourage and most importantly, EQUIP </strong><strong>you</strong> <strong>with all essential focusing and concentration strategies</strong>. This will help you move from a place of potential to optimal performance in your personal, academic and professional life.</p><blockquote><span style=\"color: rgb(51, 51, 51);\"><strong>I just took a phenomenal course. It contains all I was looking for - clear strategies, step-by-step systems, various examples and complete assistance. The capacity to focus increased from 4 minutes to 35 minutes uninterrupted flow. </strong><br><em>- Michelle (Student)</em></span></blockquote><p><strong><br></strong></p><p><strong><strong></strong></strong></p><p><strong><u>Quick Overview of What You Will Learn</u></strong></p><p><strong>1. How To Set Powerful Goals For Learning</strong></p><ul><li>Discover the Strategic Learning Process</li><li>Why you need to set long-term goals and constantly be thinking about the future</li><li>Implement the 6 Steps in Organizing and processing your goals</li><li>What is the KEY difference between long-term goals and short-term goals</li><li>Implement your strategy and stay focused on your goals</li><li>How to use Motivation to increase concentration</li></ul><p><strong>2. Increase Your Focus When Learning</strong></p><ul><li>What are the MAJOR 8 Strategies to Dramatically improve your concentration</li><li>Have exclusive access to 8 of the MOST EFFECTIVE Concentration Exercises</li><li>How to maintain your focus and ELIMINATE all the distractions from your life</li><li>How to improve your reading comprehension and retention using concentration</li><li>Discover why training your memory is all about using your IMAGINATION</li><li>Top 8 benefits of having a better concentration when learning</li></ul><p><strong>3. The Power Of Discipline In Your Life</strong></p><ul><li>How to Eliminate Distractions and minimize Multitasking</li><li>How to develop a strong sense of discipline</li><li>How to create the right habits you desire</li><li>Discover 6 Techniques that will help you sustaining the correct habits</li><li>5 Tips for optimizing the habits and discipline in your life</li><li>How to use focus to lead your life as an achiever</li></ul><p><strong>4. How To Improve Your Brain Power</strong></p><ul><li>What is the Life-Style to create a powerful mind</li><li>7 habits of mind and foundational concepts that will serve you for a lifetime</li><li>How to align your mind habits with your goals</li><li>What are the 5 biggest mistakes when aligning your mind habits to your goals</li><li>How to build consistency on your mental power</li><li>How to create a story to maintain your focus</li></ul><p><strong>5. How To Use Your Concentration At Work</strong></p><ul><li>How to acquire and grow skills using concentration</li><li>How to search for feedback frequently</li><li>How to overcome challenges at work</li><li>How to re-frame a failure and never give up</li><li>How to build a relationship with a mentor</li></ul><blockquote><span style=\"color: rgb(51, 51, 51);\"><strong><em>Great and solid course! </em></strong><br><em>- Randy (Student)</em></span></blockquote><p>The knowledge you get from reading will improve your productivity, work efficiently and effectively in any job, profession and venture you choose to be.</p><blockquote><span style=\"color: rgb(51, 51, 51);\"><strong>All my expectations were fulfilled after taking this course and putting the strategies into practice. I can focus at around 20 min uninterrupted whereas one month ago I was able to stay focused only 3 minutes.</strong><br><em>- Melisa (Student)</em></span></blockquote><blockquote><span style=\"color: rgb(51, 51, 51);\"><strong>Inside this course, I found a wealth of educational resources. Everything I found is very practical and with big impact in my life. So far, the learning experience was excellent and the instructor is very supportive.</strong><br><em>- Patricia (Student)</em></span></blockquote><p><span style=\"color: rgb(51, 51, 51);\"><strong><br></strong></span></p><p>__________________________________________________________________________________________________________________<br></p><p><strong>10x Power Focus - Get the Results you need!</strong></p><ul><li>Achieve quicker the results that you want.</li><li>Be more productive and committed.</li><li>Move specific ideas/projects ahead quicker and easier.</li><li>Strengthen your focus.</li><li>Take focused action and achieve breakthrough results.</li><li>Get focused on what's most important to you.</li><li>Define your priorities and take action aligned with these.</li><li>Learn more effectively</li></ul><p>___________________________________________________________________________________________________________________</p><p><strong>Here is what you'll get when you Join this Course:</strong></p><p><strong>1. </strong><strong>Complete tested and proven blueprint</strong> on improving your concentration skills and perform better.</p><p><strong>2.</strong> Unlimited support from me <strong>PERSONALLY</strong>. You can ask million questions and I will answer till you get the answer.</p><p><strong>3. </strong><strong>Support and help from other members in the group.</strong></p><p><strong>4. </strong><strong>All the tools</strong> required to help you achieve your learning goals.</p><p><em>And Here's A Little Something Extra For You…</em></p><p>I am confident <strong>you will be able to increase dramatically your focusing power</strong> after going through this course if you follow each of the techniques &amp; strategies I created for you.</p><p>You have a <strong>30-day, 100% money-back guarantee with no questions asked</strong> so you have nothing to lose. I make myself available so you will have access to me if you have questions or need feedback along the way. You're not in this alone!</p><p>___________________________________________________________________________________________________________________<br></p><p><strong>Guarantee #1: QUALITY</strong></p><p>You'll notice the highest level of quality in every aspect of this program, from the detailed and structured way each technique and lesson is delivered, to the highly personalized attention, right down to the audio clarity of the call. I pride myself on bringing you the best product I possibly can, but if you're unsatisfied for any reason, you can ask for a refund within the first 30 days from joining the program.</p><p><strong>Guarantee #2: POWER RESULTS</strong></p><p><em>10x Power Focus Program</em> has helped thousands of people from all walks of life dramatically improve their learning abilities by reshaping their habits and thus their realities. You too can get such results. Once you understand the strategies revealed in this course – you'll be able to move from a place of potential to optimal performance in your personal, academic and professional life.</p><p><strong>Guarantee #3: HAPPINESS</strong></p><p>With the new heightened sense of awareness and understanding of yourself you will experience real impact in all facets of your life. If you don't think that's the case, simply contact Udemy within 30 days for a full refund. There's nothing to return, and no effort required at all The choice is always yours.</p><p>___________________________________________________________________________________________________________________<br></p><p><strong>WARNING: Don't LOSE TIME</strong> by not taking this course right now. Don't kick yourself a month from now because you didn't start today. <strong>Skyrocket Your FOCUS NOW!</strong><strong></strong></p><p>Click on the <strong>Take This Course </strong>button on the upper right-hand side of your screen now and let's make this happen!<br></p><p><strong><em>It's time to Accelerate Your Learning!</em><em> - </em>SIGN UP NOW!</strong></p>", 
    "end_date": null, 
    "title": "10x Power Focus: Discover The Hidden Element Of Top Learners", 
    "price": "20.00", 
    "instructors": "Silviu Marisca, Nicole Vasilescu", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/732914_30c2_2.jpg", 
    "course_url": "https://www.udemy.com/learn-focus-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T16:10:50Z"
}