{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">What is holding you back from learning faster?</strong>  </p>  <p style=\"\">  \tIs it you?  </p>  <p style=\"\">  \tIs it your technology?  </p>  <p style=\"\">  \tIs it your overall learning system?  </p>  <p style=\"\">  \t<strong style=\"\">You&#039;ve probably heard it before: “a bad craftsman blames his tools.&quot;</strong>  </p>  <p style=\"\">  \tI wouldn&#039;t disagree.  </p>  <p style=\"\">  \tBut when is the last time you saw someone building a house with a hammer, a hand saw and some 2x4s?  </p>  <p style=\"\">  \tNo…  </p>  <p style=\"\">  \t<strong style=\"\">Now it&#039;s all about technology:</strong>  </p>  <p style=\"\">  \tAir guns.  </p>  <p style=\"\">  \tBuzz saws.  </p>  <p style=\"\">  \tPower drills.  </p>  <p style=\"\">  \tWhen you build a house, you need the right tools and materials to build a house.  </p>  <p style=\"\">  \t<strong style=\"\">When you build a skills, there are a different set of tools and materials.</strong>  </p>  <p style=\"\">  \tThe basic ingredients for learning are neurons and myelin.  </p>  <p style=\"\">  \tEach time you fire a set of neurons while learning, they get wrapped in another thin layer of myelin, which is like insulation on an electric cord.  </p>  <p style=\"\">  \tThe more the neurons get wrapped up, the faster the neurons can send signals.  </p>  <p style=\"\">  \tAnd that all means faster learning.  </p>  <p style=\"\">  \t<strong style=\"\">So what does that have to do with this course?</strong>  </p>  <p style=\"\">  \tThe other half of learning is the tools.  </p>  <p style=\"\">  \tThe tools you use to get the raw ingredients,  which are the books, courses, Youtube videos, coding sites, forum threads, whatever….to turn into real skills that you have mastered.  </p>  <p style=\"\">  \t<strong style=\"\">That&#039;s where these accelerated learning machines come in.</strong>  </p>  <p style=\"\">  \tCan you imagine what it was like before Page and Brin invented Google?  </p>  <p style=\"\">  \tBefore Gutenberg invented the printing press?  </p>  <p style=\"\">  \tBefore Berners-Lee invented the internet (with some help)?  </p>  <p style=\"\">  \tIt&#039;s like living in the stone ages.  </p>  <p style=\"\">  \t<strong style=\"\">The problem is, there isn&#039;t a big market right now for tools that help you learn faster.</strong>  </p>  <p style=\"\">  \tWhy?  </p>  <p style=\"\">  \tBecause there isn&#039;t demand for it yet.  </p>  <p style=\"\">  \tAnd what that means for us is that it&#039;s hard to find technology that helps us learn faster beyond the basics of speed reading apps and flash card tools...the ones that have been around in one form or another for decades.  </p>  <p style=\"\">  \t<strong style=\"\">What you get in this course isn&#039;t just a list of tools for you to install on your computer or phone.</strong>  </p>  <p style=\"\">  \tYou get 50+ programs, apps and online services along with a bonus section on hardware that contain the top machines out there that the fastest learners in the world are using to speed up their learning curve.  </p>  <p style=\"\">  \tMost people using these machines will use a few and get impressive gains. But the magic happens when you are using all of them as part of a larger learning system.  </p>  <p style=\"\">  \tIn each video you will learn why the software, app or service is the best in it&#039;s category and how to use it for it&#039;s stage in the learning system.  </p>  <p style=\"\">  \t<strong style=\"\">But, you might be thinking, what makes this different from the other lists or guides for learning out there?</strong>  </p>  <p style=\"\">  \tFair point.  </p>  <p style=\"\">  \tHere&#039;s the thing. Most of the programs in here were never designed for accelerated learning. That was never the intention of the developer.  </p>  <p style=\"\">  \tAnd that&#039;s what makes these so valuable.  </p>  <p style=\"\">  \tBecause you would never find out about them any other way except stumbling upon them while trying to do something else.  </p>  <p style=\"\">  \t<strong style=\"\">There&#039;s two ways of looking at learning faster.</strong>  </p>  <p style=\"\">  \t1. Take something you already do and make it a little faster.  </p>  <p style=\"\">  \t2. Do something you were never able to do before because of new technology.  </p>  <p style=\"\">  \tIt&#039;s the old story of Ford&#039;s Model T:  </p>  <p style=\"\">  \t<strong style=\"\">&quot;If I&#039;d asked people what they wanted, they would have asked for a faster horse&quot; - Henry Ford</strong>  </p>  <p style=\"\">  \tRight now, you may be thinking about the areas of your learning you could do faster…  </p>  <p style=\"\">  \tBut don&#039;t forget the other part...the part where you do something you could never dream of before because you have a new technology…  </p>  <p style=\"\">  \t<strong style=\"\">A New. Learning. Machine.</strong>  </p>", 
    "end_date": null, 
    "title": "50 Accelerated Learning Machines", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414630_38ab_5.jpg", 
    "course_url": "https://www.udemy.com/50-accelerated-learning-machines/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T00:35:06Z"
}