{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>In this short 30 minute course, I'll show you 5 specific things you can do right now to read more books than you ever have before.</strong></p><p>Because reading isn't just a nicety -- it's a must if you want to live your dreams. Yet everything we're taught in school holds us back from <em>actually</em> learning.</p><p>And that's why I created this course.</p><p>When I took over a failing business a few years ago, I had no mentors, no boss and no one to help me. My education from a \"top 10 school\" was no help either.</p><p>That's when I discovered the power of books. Every question I had, there was a book with an answer. And the better I got at reading, <strong>the more frustrated I got that we're never taught how to read the right way in school.</strong></p><p>And that's why I decided to put together my course <strong>Become A Learning Machine: How To Read 300 Books This Year.</strong></p><p>My goal is to share this message with as many people as possible. And that's why I've taken 5 of my favorite tips from that course and put them together for you here to go through in the next 30 minutes before you invest in the full course.<br></p><p>Here's what you'll learn inside:</p><ol><li><strong>Why how we're taught to learn in school is the BIGGEST obstacle to reading a lot of books [Lecture 2]<br><br></strong></li><li><strong>A simple mindset shift that will help you get through more books than ever before...and actually USE what you learn [Lecture 3]<br><br></strong></li><li><strong>The obvious yet forgotten thing you NEED to do to read more books this year [Lecture 4]<br><br></strong></li><li><strong>What you have to do as soon as you open the book to get through it quickly [Lecture 5]<br><br></strong></li><li><strong>A simple trick that can INSTANTLY make you a faster reader [Lecture 6]<br><br></strong></li><li><strong>Why you need to divide your reading into two separate categories to read as many books as you can [Lecture 7]<br><br></strong></li><li><strong>Eight life-changing books you have to read [Lecture 8]</strong></li></ol><p><span></span><br></p><p>To enroll now, just click on the \"Start Learning Now\" button.<br></p><p>I'll see you inside.</p><p>-Brandon</p>", 
    "end_date": null, 
    "title": "A Mini Course on Better Reading", 
    "price": 0, 
    "instructors": "Brandon Hakim", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632734_750a_7.jpg", 
    "course_url": "https://www.udemy.com/read-more-books/", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T18:50:31Z"
}