{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>One of the reasons you're probably on Udemy is because you enjoy learning by watching videos. </p><p>The problem is, the accelerated learning community has largely ignored this type of learning. It's all about speed reading books, words per minute, clipping and note taking, mnemonics and flash card systems.</p><p>But you never hear anything about how to best use audio and video to learn fast.</p><p>Well, that's about to change with this course.</p><p>This is the first accelerated learning course specifically created just for non-readers. It takes you through the 5 major steps of accelerated learning, and shows how how to maximize your learning in each stage. You'll also learn how to integrate all these stages into a unified system.</p><p>First, you'll learn how to find the best audio and video content. You'll also learn why sometimes audio, video, and even pictures are sometimes higher quality than any text you will find through a regular Google search.</p><p>Next, we'll cover how to make your way through audio and video files faster. We'll even touch on the subject of outsourcing your reading altogether so that you can save your time for just the most info-packed knowledge sources.</p><p>Then, we'll get into note taking. Did you think it was impossible to take notes without writing by hand or typing? In this section, you'll learn how. These notes will become the cornerstone of your spaced repetition. </p><p>The fourth stage of the learning system is memorization. How do you get spaced repetitions without looking at flashcards or reviewing pages of notes? You'll learn how here. It's super simple and only takes a few minutes to set up, and doesn't require anything more than a smart phone and a free Dropbox or Google Drive account.</p><p>Lastly, we'll briefly touch on taking action, which is the final stage of learning. When you are learning from audio and video, it put's certain limitations on your long term memory that make it hard to take action if you don't act immediately after learning something new. You'll learn how to handle these situations in the final video of the fourth section.</p><p>If you're reading this far, you might not be the kind of person I described above. Maybe you're just someone who likes to read, but wants to know how to better use their time when they <strong>can't</strong> read. </p><p>You know, during your commute, in bed before you fall asleep, doing yard work or chores around the house. All time that you could be using going through video courses, listening to audio books, podcasts, your own voice notes, etc. </p><p>Everything in this course can be applied and integrated into my main series of courses on accelerated learning. Even if you just want to make audio and video learning a minor part of your learning system, you will get all the tools and strategies you need here in this course so you an get your non-reading system set up in no time.</p><p>Looking forward to seeing you in the course,</p><p>Timothy</p>", 
    "end_date": null, 
    "title": "Accelerated Learning for Non-Readers", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630906_9763.jpg", 
    "course_url": "https://www.udemy.com/accelerated-learning-for-non-readers/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T02:38:34Z"
}