{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong>Top students study for tests differently. It&#039;s that simple.</p><p style=\"\">The question is, how do they do it?</p><p style=\"\"><strong style=\"\">You Never Learn in School How to Study for Tests</strong></p><p style=\"\">This course breaks down the strategies top students use into 3 parts:</p><ol style=\"\"><li style=\"\">Reverse engineering the test so you can predict what will be tested and what won&#039;t be tested</li><li style=\"\">Synthesizing the months of course content you have learned into a concise outline and/ore visual format (Mind Map or Flow Chart)</li><li style=\"\">Memorize large volumes of information quickly by using 3 different memory strategies, each focused on a different type of information</li></ol><p style=\"\"><strong style=\"\">At the Highest Levels, Test Taking is a Game</strong></p><p style=\"\">The best test takers are mental athletes. They train themselves intentionally for high performance on tests.</p><p style=\"\">Just like an athlete, top students know how to prepare themselves for the big game so that they don&#039;t even really &quot;think&quot; come game time...they just get into the flow and play the game.</p><p style=\"\">It&#039;s a sort of auto-pilot mode where their instincts take over and they become one with the game.</p><p style=\"\"><strong style=\"\">But This Isn&#039;t How Most People View Test Taking, and Finals in Particular</strong><br style=\"\"></p><p style=\"\">Think about the biggest games in sports. The World Cup. The Superbowl. The World Series. The NBA Finals. </p><p style=\"\">These are the biggest events in sports. They get the highest ratings of anything on TV. Companies pay millions of dollars just for a 30 second ad spot. </p><p style=\"\">And athletes prepare themselves every day for these final games.</p><p style=\"\"><strong style=\"\">Top students have the same attitude about taking tests. </strong><br style=\"\"></p><p style=\"\">And their finals in particular.</p><p style=\"\">This course will show you how to take your test taking game to the next level. Once you finish the course, you will have a master strategy for preparing for every big exam you take for the rest of your life. You will know how to maximize every hour you spend studying so that you can get top marks without killing yourself with ineffective techniques. </p><p style=\"\"><strong style=\"\">This is the course I wish I had when I was in school. </strong></p><p style=\"\"><strong style=\"\"></strong>After many requests to make my accelerated learning materials applicable specifically for students, I&#039;ve created this course to help you ace your finals.</p><p style=\"\">You won&#039;t find this kind of strategic approach to test taking anywhere else.</p><p style=\"\">See you on the inside,</p><p style=\"\">Timothy</p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Ace Your Finals", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489992_a3ac.jpg", 
    "course_url": "https://www.udemy.com/ace-your-finals/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T01:59:21Z"
}