{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span>Eu quero ajudar você a obter, de maneira prática, técnicas que irão permitir você estudar menos, porém aprendendo mais, afinal de contas, um método de estudo inteligente é essencial para o aprendizado, e com isso você irá ter mais tempo para si mesmo!</span>  </p>  <p>  \tSeja qual for o seu objetivo de estudo ou a pressão que você está enfrentando, provas são eventos parecidos e a preparação para elas não muda tanto. Eu já estive no seu lugar, e conheço seus medos e frustações:  </p>  <p>  \t- Passar o dia todo estudando e ao final do dia se sentir culpado, chateado pois o estudo não pareceu render o suficiente.  </p>  <p>  \t- Ter a sensação que o estudo de um determinado assunto não te trouxe nenhum aprendizado.  </p>  <p>  \t- Se distrair facilmente durante o estudo.  </p>  <p>  \t- Não conseguir estudar o tempo que gostaria, que havia planejado.  </p>  <p>  \t- Esquecer na hora da prova o que você estudou!  </p>  <p>  \tEu entendo você, já estive na mesma situação e tentei desesperadamente de tudo, sem nenhum planejamento, me sentia frustrado e achando que faltava algo para mim. Foi aí que tive um “Click” e pensei, porque não ter um tempo para aprender a estudar, aprender a aprender?! E foi aí que as coisas começaram a mudar, pesquisei e li muito (Muito mesmo!) sobre maneiras de aprender a estudar, maneiras de aprender melhor! Com o uso dos resultados das pesquisas, comecei a me dar bem nas provas e cheguei à conclusão: Não existem pessoas burras, existem pessoas que não sabem estudar! E é nisso que eu quero te ajudar, pretendo ao longo do curso compartilhar com você minhas experiências, meu conhecimento acumulado e o método que mais funcionou e me ajudou na preparação para as provas mais desafiadoras da minha vida!  </p>  <p>  \tE eu te garanto que após a conclusão do curso você estará apto a usar as técnicas aprendidas para estudar de uma forma inteligente, a estudar menos com mais aprendizado! E se a minha garantia não for suficiente, a Udemy oferece uma <strong style=\"\">garantia de ter seu dinheiro de volta em até 30 dias</strong>, se o resultado do curso não for o que você esperava! E eu gostaria de compartilhar o meu pensamento quando vou comprar algo que seja um investimento no meu desenvolvimento pessoal: “Eu já gastei mais dinheiro com coisas inúteis, porque não tomar a iniciativa de investir em algo útil?!”. Eu espero que você se junte a mim, para que possamos juntos aprender a estudar de forma inteligente! Te encontro do outro lado! Um Abraço!  </p>", 
    "end_date": null, 
    "title": "Aprenda a Estudar, Passe no Vestibular e no ENEM", 
    "price": "20.00", 
    "instructors": "Rodolpho Bravo", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/377106_62d2_2.jpg", 
    "course_url": "https://www.udemy.com/estude-menos-aprenda-a-estudar/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-24T16:51:26Z"
}