{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tBOOST YOUR READING SPEED ON THE SPOT.  </p>  <p>  \t<strong style=\"\">You will learn how to read fast</strong><strong style=\"\"> at least 33% or your money back!</strong>  </p>  <p>  \t<strong style=\"\">Accelerate peak performance and promote innovation in your company. Learn how to read anything faster.</strong>  </p>  <p>  \tThe teacher, Alex Garcez, discovered that your brain loves speed, and he thinks that fast is fun - slow is boring! If you like playing video games you already know that, the faster it gets, the more exciting the game becomes. If you think you have short attention span to read books, documents and social media, then you probably read slowly and carefully. Instead of understanding the text you get bored and distracted, needing to skip back to re-read text countless times. The main reason is that your brain is too powerful to go at such a slow pace and will drift off into something more interesting to think about.  </p>  <p>  \tAlex Garcez gave up his Engineering degree in the third year because he was a very slow reader, however, his weakness became his strength, after taking a speed reading course, and deciding he was not going to become a laborer but an entrepreneur. Since then he took a Business Degree, Masters in Marketing and Advertising, and developed the <em style=\"\">Revolution Speed Reading Method. </em>He personally coached more than 3,500 people and more than 95% of his clients improved their reading performance by at least 33%. In fact most of his clients improve their reading speed by more than 100%.  </p>  <p>  \tWith more than 9,000 clients taking this two hour course online in 53 countries, Alex expects to motivate people to read more books. His method is based on science, and he has achieved amazing results while coaching professionals from companies such as: <strong style=\"\">Goldman Sachs, GE, J P Morgan, Google, Bloomberg, eBay, The Wall Street Journal, Sage, The Walt Disney Company, KPMG, Ernst &amp; Young, Thomson Reuters, Adecco, Lloyds Bank, Citigroup, PwC, HSBC and O2.</strong>  </p>  <p>  \tYou will assess your reading speed at the beginning and throughout the course. So, if you spend 3 hours reading at work and improve your reading speed, on average, by 33%, you will save a whole month of work every single year.  </p>  <p>  \tYou can find more information at <a href=\"http://www.thespeedreadingcoach.com\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">www.thespeedreadingcoach.com</a>  </p>  <p>  \tTake this ultimate course Speed Reading Course for IT right now and learn how to read fast.  </p>  <p>  \tAttention: This course has similar content to the <a href=\"http://www.udemy.com/speed-reading\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">You Can Read 33% Faster</a> course because it is foundational.  </p>", 
    "end_date": null, 
    "title": "Basic Speed Reading for IT Professionals", 
    "price": "20.00", 
    "instructors": "The Speed Reading Coach", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37868_ef03_10.jpg", 
    "course_url": "https://www.udemy.com/programmer/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-24T10:53:32Z"
}