{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">What is the course about?</strong>  </p>  <p>  \t                    This is updated as of February 17, 2015.  500+ students are already enrolled!  </p>  <p>  \t  This course offers practical tips and advice on how to be a successful student.  It provides a look at types of colleges in the US and why it is important to recognize the differences. A free downloadable e-Journal is provided for students to document their understanding of:  </p>  <p>  \t                    -What they need to know about choosing a college in the United States (for students who are thinking about studying in the US)  </p>  <p>  \t            -What they need to know about choosing a college within the US  </p>  <p>  \t                    -What they need to know about how to get into college  </p>  <p>  \t                -What International students need to know about pitfalls  </p>  <p>  \t                    -What they need to know about how to begin college  </p>  <p>  \t<strong style=\"\">What kind of materials are included?</strong>  </p>  <p>  \t              A free e-Journal for students to document their journey  </p>  <p>  \t              Videos, presentations, scavenger hunt and quiz  </p>  <p>  \t<strong style=\"\">How long should the course take to complete?</strong>  </p>  <p>  \t                    2 days  </p>  <p>  \t<strong style=\"\">How is this course structured?</strong>  </p>  <p>  \t                    There are 5 quick lectures/Videos  </p>  <p>  \t<strong style=\"\">Why take this course?</strong>  </p>  <p>  \t                    Are you confused about all of the college choices that exist today?  </p>  <p>  \t                    Do you want to learn about how to choose the best college for you?  </p>  <p>  \t                    Do you want to know how to begin your college career well?  </p>  <p>  \t                    Are you beginning college or returning to college?  </p>  <p>  \t                  Do you have kids who are going off to college?  </p>  <p>  \t                   The college journey is fraught with pit falls. Even if you or your child did exceptionally well in high school, you still need to know to Secret to College Success!  </p>  <p>  \t                    This beginning course reveals some of the secrets that you should know before embarking on such a huge endeavor and provides  easy step-by-step strategies to help you navigate college so that you can accomplish your academic career goals of your dreams!  </p>  <p>  \t  We offer a 30 day money-back guarantee, no questions asked!  </p>", 
    "end_date": null, 
    "title": "Be a Successful College Student in the US!", 
    "price": "50.00", 
    "instructors": "Dr. Carole Hargrett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45015_9634_42.jpg", 
    "course_url": "https://www.udemy.com/secrets-to-college-success-in-the-us/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-06T22:36:41Z"
}