{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>In this course, I'll show you the entire, step-by-step blueprint I'll use to read over 300 books this year.</strong><br></p><p>Because reading isn't just something you should do -- <em>it's a must</em> if you want to live your dreams.</p>  <p>It's no wonder Bill Gates, Warren Buffett, Elon Musk, Mark Cuban, Will Smith and many more of the world's most radically successful people read more in a month than most people do in a decade.</p>  <p><strong>In this course, I'll help you become a learning machine as well.  </strong></p><p>I'll show you how to pick the right books, and how to get through them as quickly as possible so you can take what you learn and get real results in your life.</p>  <p>  \t                If you want to read more fiction books, this course isn't for you. This also isn't a course just on \"speed reading\" because I prefer reading the right things than reading the wrong things quickly.  </p>  <p>  \t             <strong>All I care about is reading a book or two a day and using what I learn to make my life better.</strong>    If you want to do the same, this course can change your life (<em>I know because many of the students of the course have told me exactly that!</em>) </p><p><strong>Here's a sample of what you'll learn inside:</strong></p>  <p>  \t<em> 1. <strong>The ONE change you need to make to change how you read forever [Lecture 5]</strong></em></p>  <p>  \t<em>2. Why everything you learned in school stops you from reading more than 20 books a year (and what to do about it) [Lecture 2]</em></p><p><em>3. A not so obvious, <strong>hidden benefit of reading that will make you want to read every, single day [Lecture 3]</strong></em></p><p><em>4. Where NEVER to read [Lecture 28]</em></p><p><em>5. <strong>A little known trick that can INSTANTLY double your reading speed [Lecture 16]</strong></em></p><p><em>6. <strong>\"The Double Time Solution\":</strong>  <em>A Simple thing you can do to read twice as many books without spending ANY extra time [Lecture 22]</em></em></p><p><em><em>7. <strong>How to make sure you read all the time [Lecture 9]</strong></em></em></p><p><em><em>8. Do you do THIS after you read? If not, all that time reading could be a total waste [Lecture 17]</em></em></p><p><em><em>9. <strong>How to use what you learn from books to make more money (or get anything else you want) [Lecture 4]</strong></em></em></p><p><em><em>10. 3 simple ways to read any book quickly (HINT: none of them are what we call \"traditional reading\") [Lecture 14]</em></em></p><p><em><em>11. What to do as soon as you open the book...and why it can save you hours [Lecture 13]</em></em></p><p><em><em>12.<strong> </strong></em><em>How to take notes on a book <strong>so you can review it even years later in 20 minutes or less [Lecture 18]</strong></em></em></p><p><em><em>13. </em><em>Why dividing all your reading into <strong>two specific categories</strong> can make you more successful [Lecture 23]</em></em></p><p><em><em>14. What books to NEVER read [Lecture 11]</em></em></p><p><em><em></em><em>15. <strong>How to read even the most technical books in a day</strong> – the ones that used to take months to read [Lecture 26]</em></em></p><p><em><em>16. </em><em><strong>The 3 types of books you NEED to read [Lecture 12]</strong></em></em></p><p><em><em></em>17. <em>How to permanently memorize everything you read [Lecture 20]</em></em></p><p><em><em>18. </em><em>What I learned from a Roman philosopher from 2,000 years ago to organize my bookshelf [Lecture 32]</em></em></p><p><em><em>19. <strong>The 300 Book Excel Sheet:</strong> Use this excel sheet to perfectly organize the hundreds of books you'll read this year [Lecture 10]</em><em></em></em></p><p><em><em></em>20. Do you buy your books on Amazon? Here's how <em>to save over $100 this year [Lecture 33]</em></em></p><p><em><em>21. <strong>Elon Musk: </strong>What he can teach you about learning anything without a college degree [Lecture 45]</em></em></p>  <p>  \tAnd much, much more...  </p>  <p><strong>You'll also get access to 5 bonus sections on even more reading tricks and how to find mentors, a free mini course on achieving your dreams and another on making the most of your time. I've also included a free bonus resource where I'll share with you the life-changing ideas from the best books I read in real time.</strong></p><p>So to become a learning machine and read more books than you ever thought possible, just click the <strong>\"take this course\"</strong> button because every day you delay is an extra book you could have read.</p><p><span></span>To your success,</p><p>Brandon</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Become A Learning Machine: How To Read 300 Books This Year", 
    "price": "20.00", 
    "instructors": "Brandon Hakim", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394434_a28d_12.jpg", 
    "course_url": "https://www.udemy.com/read-300-books/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T22:57:12Z"
}