{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>QUESTION: Do you want to DOUBLE, even TRIPLE your reading speed in the next 30 days? </strong></p><p><strong></strong>A month and a half ago, I created a reading course on How to Read 300 Non-Fiction Books This Year. I was blown away by the response. But there was one question I kept getting... </p><p><strong>What about fiction? </strong></p><p>Because that course is all about going through books to extract information from non-fiction books you can use in your life -- which means sometimes you'll be reading every word, sometimes you won't. But what about reading fiction books, or textbooks, or books you need to read every word in? Is there a system that works for that just as well as my system for non-fiction books?</p><p>So I spent a month going through every speed reading book, video and article to answer that question for my students. And in the process, after going through a lot of fluff in most other courses, came up with what <strong>I believe to be the simplest, most direct system to permanently doubling or tripling your reading speed in the next 30 days.</strong></p><p>Although, you can take the techniques and instantly read more quickly, this is no magic pill. Because I'm more interested in teaching you <em>the skill</em> of speed reading which can last a lifetime, than teaching you to read just a little bit more quickly.</p><p>Inside, I'll show you why we read slowly, and exactly what to do about it. And if you really want to reach your maximum reading speed, it will take 15 minutes of practice every day. For that reason, this is not for everybody.</p><p>But if you are willing to put in a little bit of time every day for a month to benefit for years, here's exactly what we'll cover...</p><p><strong>1. How to make sure you read every day</strong></p><p><strong>2. The 5 causes of slow reading we learned in school (and still do to this day)</strong></p><p><strong>3. How to cure all 5 causes of slow reading</strong></p><p><strong>4. The difference between reading and practicing speed reading -- and when to do each</strong></p><p><strong>5. The 4 stages of reading you'll have to go through from learning to read to becoming a speed reader</strong></p><p><strong>6. Four techniques you can use to reach your maximum reading potential</strong></p><p><strong>7. The secret to understanding everything you read</strong></p><p><strong>8. The two tools you can use to use to learn to read even faster in your spare time</strong></p><p><strong>9. And more...</strong></p><p>There's no skill more valuable than reading. To learn to double, or even triple your reading speed in the next 30 days, click the \"Take This Course\" button in the top right. There's a 30 day money back guarantee, so there's nothing to lose, but a lifetime of faster reading to gain.</p><p>To your success,</p><p>Brandon</p>", 
    "end_date": null, 
    "title": "Become A Speed Reader: Double Your Reading Speed In 30 Days", 
    "price": "20.00", 
    "instructors": "Brandon Hakim", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449054_8a94_12.jpg", 
    "course_url": "https://www.udemy.com/ultimate-speed-reading-double-your-reading-speed/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T01:14:41Z"
}