{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn to take an <strong>effective study break </strong>in this course. \n\n  </p>\n\n<p>Learning is a special thing. It’s one of the most rewarding things you can do as a human being. But it can be tough too. Who hasn’t felt the discouragement that comes from facing time-pressures, deadlines, or from that internal voice that says ‘I just can’t do it!’ \n\n  </p>\n\n\n\n<p>But here’s the thing. Successful learning is not all about smarts. In fact, the more you learn, the smarter you get. \n\n  </p>\n\n\n\n<p>“Yeah right!” you say. “And anyway, I don’t need a course to tell me how to slack off. I can do <em>that</em> by myself!”\n\n  </p>\n\n\n\n<p>You've been taking breaks since before you knew how to. But this is course is about empowering you with a better understanding of how you learn, so that you can adopt strategies that help you. And an effective study break is a key strategy. We go through some of the key insights from scientific psychology to help you take control of your breaks! </p>\n\n\n\n<p>“Ok, so I need to take breaks,” you sigh. “I get it. But what I need to know is how to stay <em>engaged</em>, not the other way around!”\n\n  </p>\n\n\n\n<p>Staying engaged for the long haul is the whole trick to being an effective learner. There are lots of factors that go into this: passion, curiosity, discipline…. And knowing when to stop. \n\n  </p>\n\n\n\n<p>Our brains are not designed to engage in endless hours of sustained concentration. We are designed to be good at bursts of concentration, peppered with lots of breaks. And if you don't plan your study strategy accordingly, <strong>you will burn out</strong>. You need to be proactive in order to win this game. </p>\n\n<p>This course is about the psychology of learning that you need to know to harness your learning abilities.I have worked one-on-one with dozens of students to help them get through the painful parts of the learning curve, including students with learning difficulties like dyslexia and ADHD. I know a lot about the challenges you are facing when you have big learning goals. </p>\n\n<p>f you have trouble sticking to a study program because you get tired or turned off, check out the material in this course. \n\n  \n\n</p>\n\n<p>This course is about getting to the point where you can learn more, faster. This course does that by focusing on helping you improve one vital piece of study hygiene: study breaks. </p>\n\n\n\n<p>Students who will benefit the most are those who:\n\n  </p>\n\n\n\n<p>1)      Find that despite their passion for lessons, they lose the motivation to continue;\n\n  </p>\n\n\n\n<p>2)      Have trouble managing their study breaks (i.e., they run too long)\n\n  </p>\n\n\n\n<p><br></p>\n\n<p>This course is NOT a panacea. There is no substitute for hard work. But it is here to help you smooth out the rough edges to your learning curve. Check out the free previews and course descriptions to see if it’s right for you.</p>\n\n\n\n<p>You have access to the materials and to me, for any questions! You get access to my expertise if you have any questions or are dealing with an issue that isn't addressed in the course. \n\n  </p>\n\n\n\n<p>As always, you have a<em> 30 day</em> <em>no questions asked money back guarantee</em>, so if you are not 100% satisfied, Udemy will refund you the full cost of the course.\n\n  </p>\n\n\n\n<p>I love this course and this topic. The course runs about 1 hour long, and  I’ve jam-packed it with usable nuggets of psychological wisdom, and kept up a brisk pace. I know your time is valuable.   \n\n  </p>\n\n\n\n<p>If you’ve been looking for a course that can help you get through to your learning goals, you’ve found it. <strong>Enroll to learn the secret to effective study breaks today! </strong>\n\n  </p>\n\n\n\n<p> <br></p>", 
    "end_date": null, 
    "title": "Better Studying with the Secret to Effective Study Breaks", 
    "price": "20.00", 
    "instructors": "Nadine Bekkouche, M.Sc.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592046_5875_3.jpg", 
    "course_url": "https://www.udemy.com/learn-more-faster-the-secret-to-effective-study-breaks/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T17:54:00Z"
}