{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>For some people, reading is just another thing they have to do to get what they want.</p><p>They need skills and want to keep up to date, so they read.</p><p>They want to be entertained and enjoy a good story, so they read.</p><p>But for some of you, reading is more than that.</p><p>It's the history of the modern economy.</p><p>It's a way of life.</p><p>It's one of the most enjoyable ways to spend your time.</p><p>Some of your most important relationships are with your favorite authors, through their printed word.</p><p>Today, books are commoditized. </p><p>Whether in print or on your Kindle, books are bought and sold without much deep thought about what they contain and where they belong in the larger cultural conversation.</p><p>If you've taken my speed reading or research courses, you know that one of the most critical mistakes to avoid is judging a book, a course, or anything else by it's price tag. Price and value are not the same thing.</p><p>When collecting books this matters even more.</p><p>Books that mean something to enough people can cost hundreds if not thousands of dollars.</p><p>Bill Gates recently set the record for the highest price paid at auction for a book, when he paid over 30 million dollars for the pages of one of DaVinci's notebooks. </p><p>In this course, you'll learn everything you need to know to get started in the world of book collecting.</p><p>It starts with deciding what you want to collect.</p><p>There are lots of different ways to collect books, and there are lots of different types of collectors.</p><p>You'll learn how to decide on you first collection, and then how to go about finding the right books.</p><p>You'll also learn where to buy books, and the relative advantages and disadvantages of each method.</p><p>If it sounds like book collecting is a mostly solitary affair, be assured it is not. </p><p>Book collectors are people who love books, who love ideas, who love history and their collections reflect these values.</p><p>In the final section of the book, you'll learn how to connect with authors. </p><p>Whether you just want an autograph, or you want to know how to strike up a conversation at a public reading or signing, you'll learn how here.</p><p>Welcome to the world of book collecting,</p><p>Timothy</p><p><br></p>", 
    "end_date": null, 
    "title": "Book Collecting for Accelerated Learners", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649018_73df.jpg", 
    "course_url": "https://www.udemy.com/book-collecting/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T17:35:03Z"
}