{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4>Take this course to improve your learning skills!</h4>\n\n<p>We live in the world of constant change. It requires constant adaptation, which means that it’s essential to continuously learn and acquire new knowledge and skills in order to succeed. Some people seem to be natural learners and impress everyone with how quickly they learn. Others would like to be like that. What is there secret? When you take this course - the secret is revealed.</p>\n\n<p>The thing is, learning is a skill. Just like any skill, it can and should be learned and improved.</p>\n\n<p>In this course you’ll quickly learn how to improve your learning skills and take your skill-development abilities to the next level. By the time you’ve completed this nice and short but ideas-packed course, you’ll understand quite a few things about the magic of learning. You’ll understand the psychology of fast learning. You’ll know what state of mind you need to learn fast. You’ll be clear about what it means to develop a skill. You’ll know how to think and how to process the new information that you acquire. You’ll have some ideas about how to develop good learning habits. You’ll get some tips on where to get time for learning. And, also, you’ll take a look at some specific examples that will help you learn - such as learning a foreign language, software, and “soft skills.”</p>\n\n<p>If you already understand that effective learning is important and if you want to improve your learning skills, this course is for you. </p>\n\n<p>Enroll now and begin to learn how to learn!</p>\n\n", 
    "end_date": null, 
    "title": "Boost Your Learning Skills", 
    "price": "20.00", 
    "instructors": "Igor Ovchinnikov", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833948_fb04.jpg", 
    "course_url": "https://www.udemy.com/improve-learning-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T22:36:52Z"
}