{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course focuses on improving your grades and academic outcomes by equipping you to set more effective, strategic and powerful academic goals. So much of academic success is linked to having effective goals, but many students like yourself have set goals in the past, but for whatever reason have failed to achieve these goals. </p><p>This course uses psychology theory, teacher experience and student feedback from high achievers to provide some insight into why many academic goals aren&#039;t achieved and to outline the steps that need to be taken to develop goals that are more closely aligned with academic success.<br style=\"\"></p><p><strong style=\"\">Learn to develop the super goals that lead to super grades!</strong></p><ul style=\"\"><li>Recognize why some goals fail</li><li>Link your personal values to your goals to make your goals more meaningful</li><li>Develop goals that are strategic and lead to greater commitment</li><li>Learn how to be fully engaged with your goal success</li><li>Plan the sequential steps that will lead to goal success</li></ul><div style=\"\"><br style=\"\"></div><div style=\"\">While there is so much research on why goal-setting is important, very little attention is paid to understanding why some goals are successful and others are not. This course was written for the many students I meet who regardless of their academic ability, get frustrated when they don&#039;t achieve as much as they had hoped for. This frustration comes from the fact that they worked very hard and tried their best, but they still feel they could have achieved more.  </div><p>This course aims to provide students like you with a deeper insight into what makes goals effective and how (if applied correctly) effective goals can revolutionize academic outcomes. </p><p>While the majority of the course is made up of videos, there is also a number of documents and worksheets which can be downloaded for reference and for skill development. The content will include hands-on activities to give you practice in effective goal-setting techniques and will be referring to a number of everyday academic examples so that by the end of the course, you will be have practiced what we teach. Because the principles are core in nature, they can be applied to any student, in any course of any age.  In fact, the principles are foundational enough that non-students will benefit from them too!</p>", 
    "end_date": null, 
    "title": "Boost the Grades You Get by Perfecting the Goals You Set!", 
    "price": "25.00", 
    "instructors": "Kerrie Martin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355486_6c6d_5.jpg", 
    "course_url": "https://www.udemy.com/boost-the-grades-you-get-by-perfecting-the-goals-you-set/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T19:16:17Z"
}