{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Brain Science: Improve Your Memory and Boost Your Memory</p><p>Are you forgetful? Do people refer to you as being “absent minded?” When was the last time you didn’t struggle to remember something - even if they’re very important?</p>\n\n\n\n\n\n<p>If that sounds like you then stay tuned - this brain science: improve your memory and boost your memory online course, is just what you’ve been looking for!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It transpires that there is not so thing as a “bad” memory. There are merely people who don’t use their memories to the fullest potential.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What would you do if you could double your memory performance starting today? Would you go back to school?  Maybe learn a new language, you might even feel confident enough to change profession and climb the corporate ladder? </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In fact there aren’t any areas of your life that wouldn’t be improved, just by having a better command of your memory, and that's just what this brain science: improve your memory and boost your memory online course provides.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>During the course you’ll be exposed to knowledge about how human memory works and learn an entire range of tried and tested methods all designed to super charge your memory and recall, ensuring the information you wish to retain, stays with you!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This brain science: improve your memory and boost your memory online course is very practical and gets to work right away.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll learn a variety of strategies that each suit a different memory scenario.  They're all very easy to learn and incredibly rewarding to master.  Best of all you’ll be able to track your progress along the way. There are many downloadable exercises, all designed to improve your memory and boost your memory.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As with all of my courses. you’ll have a lifetime access and full support seven days a week.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Can you really afford to keep struggling to remember while others pass you by?  Sign up now for this life changing course before you forget! </p>\n\n\n\n<p>As well as eight different quizzes, this brain science: improve your memory and boost your memory online course syllabus includes:</p>\n\n\n\n<p>About Brain Science</p>\n\n\n\n<p>How Good is Your Memory</p>\n\n\n\n<p>A Little Bit About Memory</p>\n\n\n\n<p>Observation Challenges</p>\n\n\n\n<p>Memory Warm Up Exercises</p>\n\n\n\n<p>Why Do We Forget</p>\n\n\n\n<p>Laying The Foundation for Good Memory</p>\n\n\n\n<p>Keeping a Check on Your Stress Levels</p>\n\n\n\n<p>Drawing for Better Memory</p>\n\n\n\n<p>Brain Exercises </p>\n\n\n\n<p>Using Acronyms and Acrostics</p>\n\n\n\n<p>Rhyme Keys</p>\n\n\n\n<p>Method of Loci</p>\n\n\n\n<p>Keywords</p>\n\n\n\n<p>Remembering Names and Faces</p>\n\n\n\n<p>Top Tips for Bolstering Your Memory</p>\n\n\n\n<p>Chaining</p>\n\n\n\n<p>Mind Mapping</p>\n\n\n\n<p>Conclusion</p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Brain Science: Improve Your Memory and Boost Your Memory", 
    "price": "20.00", 
    "instructors": "Libby Seery", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841348_561e_2.jpg", 
    "course_url": "https://www.udemy.com/brain-science-improve-your-memory/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-06T15:14:25Z"
}