{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hello my chess friends this is Expert David Luscomb. Throughout this course you learned how to play and win at chess. We started by first learning how the pieces moved and captured. Then, we learned about the special rules and how to win at chess through checkmate!! In the next section we learned about the 4 basic elements of chess: space, time, material, and position. These elements were fundamental to our understanding of chess and helped pave the way for the tactical section! In this section we looked at the following tactical themes: Forks, Pin, Skewer – x-ray, Discovered attack, Discovered check, Removal of the Guard, Deflection/ Decoy attack, Blocking, Pawn promotion, Hanging piece, Stalemate, Back rank checkmates, Checkmating a lone king with just a queen, and Checkmating a lone king with 2 rooks. These tactical skills will help you win many chess games. Finally, in the last section we learned about the Giuoco Piano chess opening system. I used the tactical themes and the 4 elements of chess to explain all the ideas behind the moves in this opening system. Then we looked at a few game examples to obtain further knowledge and understanding about the opening and how to use it! <strong></strong></p><p>Once again thank you for taking this chess course!</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Chess Expert David Luscomb: Chess Basics Beginner Course", 
    "price": 0, 
    "instructors": "Chess Expert David Luscomb", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715006_6b19_2.jpg", 
    "course_url": "https://www.udemy.com/chess-expert-david-luscomb-chess-basics-beginner-course/", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T00:31:41Z"
}