{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>O curso Como Apresentar Seminários foi criado exatamente para te dar as ferramentas básicas e desenvolver as habilidades necessárias para <strong class=\"redactor-inline-converted\">criar e apresentar um trabalho escolar ou seminário</strong>.</p>\n\n<p>Aprenda a organizar sua pesquisa, mantendo sua atenção nos estudos por mais tempo, lendo e memorizando melhor o conteúdo. Saiba como criar redações e textos, formatar seu trabalho e criar apresentações de slides mais atraentes. Além disso, descubra como é fácil se preparar para fazer sua apresentação na sala de aula da escola, cursinho ou faculdade!</p>\n\n<p>Você estuda através de vídeo aulas. Todo o conteúdo está organizado em 4 módulos onde são apresentados os passos necessários para o desenvolvimento de uma apresentação nota 10!</p>\n\n<p>Você pode enviar suas dúvidas sobre o curso e receber as respostas rapidamente. Além disso, você pode fazer o download dos materiais de apoio que complementam o conteúdo das aulas e facilitam seu entendimento.</p>\n\n<p>Estude totalmente online do seu computador, tablet ou smartphone. Estude no seu tempo livre, sem compromisso com horários ou prazos, acompanhe todas as informações sobre seu progresso. Ao final do curso, você recebe seu <strong>certificado digital</strong>, sem custo adicional e válido em todo o Brasil!</p>\n\n<p>O que está esperando?</p>\n\n<p>Faça sua matrícula agora!</p>", 
    "end_date": null, 
    "title": "Como Criar e Apresentar Trabalhos Escolares", 
    "price": "20.00", 
    "instructors": "Ismar Souza", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858956_5718_2.jpg", 
    "course_url": "https://www.udemy.com/criar-trabalhos-escolares/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T19:59:03Z"
}