{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\"><li style=\"\">Why do you get bored and distracted while you are studying?</li><li style=\"\">Why do you forget what you studied days or hours after learning it... or sometimes even within minutes?!</li><li style=\"\">Why do you go blank in the exam room and forget all the work that you &#039;studied&#039;?</li><li style=\"\">Why are you struggling to find the motivation to study?</li><li style=\"\">Why is it you can quite easily think of 100 other things you would rather do than sit down and study?</li></ul><hr style=\"\"><p style=\"\">Welcome to <strong style=\"\">Discover 8 Learning Styles and Become a Super Student!</strong></p><hr style=\"\"><p style=\"\">The <strong style=\"\">Goal of this Program is to </strong>help students adopt an extremely productive, strategic and consistent approach towards their learning, both in and out of the classroom. <strong style=\"\">Productive </strong><strong style=\"\">learning </strong>can be defined simply as how much one can <strong style=\"\">REMEMBER </strong>and <strong style=\"\">UNDERSTAND </strong>after any session of learning.</p><hr style=\"\"><p style=\"\"><strong style=\"\">Discover 8 Learning Styles and Become a Super Student!</strong> is for anyone who wants to learn more effectively - students, professionals, hobbyists.</p><p style=\"\">It is designed specifically for <strong style=\"\">beginners </strong>but if you&#039;re looking to freshen up on your skills, COME ON IN!<br style=\"\"></p><p style=\"\">No prior knowledge required to get started – just this course, a pen, a paper and YOU!</p><hr style=\"\"><p style=\"\"><strong style=\"\">Your Roadmap: How to Discover the Learning Style that Suits You Best</strong><strong style=\"\">!</strong></p><hr style=\"\"><p style=\"\"><strong style=\"\">How Your Brain Operates</strong> - The two hemispheres of the brain control two different modes of thinking with each of us preferring one mode over the other.</p><p style=\"\"><strong style=\"\">Discover Eight Learning Styles that will turn your into a Super Student!</strong> - The key for you is to find your own learning style, that specific style that works just for you.<br style=\"\"></p><p style=\"\">1) <strong style=\"\">Visual </strong>- You learn by creating pictures around you</p><p style=\"\">2) <strong style=\"\">Auditory </strong>- You like to have music playing</p><p style=\"\">3) <strong style=\"\">Verbal </strong>- You speak out loud during studying</p><p style=\"\">4) <strong style=\"\">Tactile </strong>- You prefer experience based learning</p><p style=\"\">5) <strong style=\"\">Structured </strong>- You work well with numbers and calculations</p><p style=\"\">6) <strong style=\"\">Imaginative</strong> - You are more visionary, entrepreneurial, and very social</p><p style=\"\">7) <strong style=\"\">Networker </strong>- You love to work in groups connecting with others</p><p style=\"\">8) <strong style=\"\">Solitary </strong>- You find you work much better alone</p>", 
    "end_date": null, 
    "title": "Discover 8 Learning Styles and Become a Super Student!", 
    "price": "20.00", 
    "instructors": "Silviu Marisca", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492596_4aac_2.jpg", 
    "course_url": "https://www.udemy.com/eight-learning-styles/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-03T16:47:19Z"
}