{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>NEW COURSE</em></strong></p><p>________________</p><p><strong><em>Hi, I'm Suraya!</em></strong> Published Arts Writer and part-time Tutor. I help University students understand how to write an essay or research paper so that they can hand in persuasive writing the teacher will love.</p><p><em>Essay writing does not need to be stressful.</em> I tutor a lot of students and they all struggle with their research paper topics in two main areas:</p><p><strong>1. How to write an argumentative essay</strong></p><p><strong>2. How to create a research paper outline</strong> </p><p>This <em>quick, easy to follow </em>course hits on both of these challenges and gives major essay help in a mini package... There's <em><strong>no boredom, drama or hassle</strong></em> - because if you have a paper due you have no time for that!</p><p>If you want to be good at writing a research paper you will need an <strong>awesome, relevant and persuasive </strong>essay argument, and if you want to save time and not stress you will need some <strong>cool tricks</strong> up your sleeve. Learn:</p><p> - Outstanding essay planning</p><p> - How to use quotes better than others in the class</p><p> - How to overcome writers block and procrastination</p><p>- My top tips that work for ANY essay topics</p><p>And<em> so much more</em>, in a straightforward mini course that <strong>takes no time at all </strong>and is <strong>a great companion to open up any time you have a paper due </strong>- you get access to the course material for life!</p><p><strong>This course is NOT:</strong> how to write citations e.g. Harvard style, Chicago referencing etc or any typical content along the lines of the academic support classes offered on campus at every university! It is an approachable, to-the-point mix of practical tips and tricks you can use forever on how to write a persuasive essay that makes the reader pleasantly surprised.</p><p>And of course, if you don't find it helpful for writing papers or that last-minute essay, Udemy offers a <strong>30-day guarantee</strong>, so there's no risk at all! Just everything to gain by becoming a better student and nothing to lose.</p><p>When you sign up for this course <strong>the mini-training will walk you through the essay writing process</strong>, so when you're ready for that just hit <em>enrol</em> and I'll see you inside!</p>", 
    "end_date": null, 
    "title": "Essay Writing Tips & Tricks to Improve Skills - Follow Along", 
    "price": "20.00", 
    "instructors": "Suraya Warden", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524742_e2a7.jpg", 
    "course_url": "https://www.udemy.com/write-a-persuasive-essay/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T02:50:45Z"
}