{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This study skills course covers; how and why you learn, multiple study skills methods, how to read, take notes and study from books, prioritisation, visual and auditory methods, ensuring you don't miss anything out, how to preempt exam questions as well as a general study approach and a list of apps and web based systems. This will all combine to produce a system which enables you to learn &amp; recall faster and smarter. </p><p><strong>**UPDATED OCTOBER 2015**</strong></p><p><strong>Master essential study and learning strategies for ultimate exam success!</strong></p><ul><li>Recognise the 5 reasons you study</li><li>Appreciate different learning styles </li><li>Examine condensing, summarising and cue methods </li><li>Recognise the 3 main reading styles</li><li>Learn how to study from books and take great notes first time </li><li>Understand a technique for prioritisation of study material </li><li>Learn visual and auditory approaches to study </li><li>Learn techniques for ensuring you do not miss anything out when answering questions </li><li>Appreciate the need for a great general study approach </li><li>Recognise how apps and web based systems can contribute to exam success</li></ul><strong>Learn and recall faster and smarter</strong>Having lectured and indeed studied for many years I know how daunting it can be to have to condense; weeks, months or years of learning into what is usually a very short exam. This course will give you the skills, tools, techniques, knowledge and insight to learn, study and recall that information in a way that suits your style, whilst pre-empting possible exam questions and prioritising your approach. <p>In short this course offers you a complete learning and study system that can be adapted to you and your topic. It shows your progress through pre and post critical reflective learning. </p><p>It contains 26 videos as well as  comprehensive supporting information and documents.</p><p><strong>This course is an essential 'one-stop-shop' for study skill success.</strong></p>", 
    "end_date": null, 
    "title": "Essential Study Skills: Strategies for Ultimate Success ", 
    "price": "20.00", 
    "instructors": "Sarah Simpson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408906_647d_3.jpg", 
    "course_url": "https://www.udemy.com/essential-study-skills-strategies-for-ultimate-success/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T11:03:08Z"
}