{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      Mind Mapping is the brilliantly effective thinking and learning tool devised by Tony Buzan. I&#039;ve been using Mind Maps for well over 30 years and have been fortunate enough to teach others how to use Mind Maps all over the world since 1996.  </p>  <p style=\"\">  \t     I&#039;m delighted to be able to share my understanding of this uniquely effective technique on this course. I devised the course as a hands-on, practical introduction to Mind Mapping. There are 12 separate videos along with exercises that will get you Mind Mapping effectively right from the start.  </p>  <p style=\"\">  \t     I&#039;ve included enough theory to explain how and why Mind Maps work, but kept the emphasis on practical ways to benefit from the technique - to help you to think, work, organise, learn, create, communicate and study more effectively. And more enjoyably too!  </p>  <p style=\"\">  \t     If you&#039;ve ever been frustrated that your brain feels like it&#039;s stuck in second gear, this course is for you.  </p>  <p style=\"\">  \t      If you&#039;ve always wondered about how to get the most from Mind Mapping - you are going to love this course.  </p>  <p style=\"\">  \t     In a career that has included working at Chief Finance Officer level in the computer industry, a long stint with the world&#039;s largest consultancy practice and starting and running a successful training organisation, I&#039;ve come across hundreds of techniques to improve personal effectiveness. But <strong style=\"\">Mind Mapping is the only technique that I use every single day</strong>. And I do so, quite simply, because it works.  </p>  <p style=\"\">  \t     I look forward to introducing you to this unique way of working so that you can start to benefit from Mind Maps too!  </p>  <p style=\"\">  \tPlus your will have unlimited access to our FREE resources.  </p>", 
    "end_date": null, 
    "title": "Extraordinary Learning: Mind Mapping Mastery", 
    "price": "20.00", 
    "instructors": "Illumine Training Ltd", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41521_8aed_8.jpg", 
    "course_url": "https://www.udemy.com/mind-mapping-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-13T18:05:47Z"
}