{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong> Focus Mastery - How To Increase Your Focus In Just 30 Days!</strong><strong> </strong></p><p>We all start at some point or other, during our working day, to watch notifications on Facebook, to chat with friends, to admire the colors of the houses in the window, while we are working on an important project or while writing an important email.</p><p>Have you ever wondered what would be your results if you would focus and concentrate your thoughts?</p><p>Why do you think people who do possess the ability to work hard, with determination, but not reigning in their thoughts can never achieve the success they are, however, dreaming at?</p><p>Have you ever tried to distinguish what is leading to success in your profession, or in your field?</p><p>Once you decide and manage to take your mind off multiple things and devote your complete focus and attention to the singular task at hand, you can achieve the results you want. Focus and concentrate your thoughts, and will see your results.</p><p>When your goal is to cultivate and develop the ability to align your mind and dedicate total focus and concentration on the task at hand, you can realize anything you want.</p><p>Is focusing your strength or is this rather your weakness? This question applies to everyone, irrespective of your age and profession. </p><p>Above question is raised, as to excel in any aria of your life, you need to have very well developed the two traits of focus and concentration. Once you have them, add determination and ability to work hard for the goal you are aspiring for.</p><p><strong><u>How is this Course organized?</u></strong></p><p><strong>1) How to increase your focus </strong></p><p><strong>2) Tips for developing concentration </strong></p><p><strong>3) Techniques for developing an active learning </strong></p><p><strong>4) How to improve your learning capacity </strong></p><p><strong>5) Concentration exercises for boosting and sharpening your focus </strong></p><p><strong>6) How to train your brain to get into that state of focus </strong></p><p><strong>7) How stress and anxiety affect your focus </strong></p><p><strong>8) How Rest and Sleep can benefit your concentration ability </strong></p><p><strong>9) The advantages of building your focus</strong> </p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Focus Mastery - How To Increase Your Focus In Just 30 Days!", 
    "price": 0, 
    "instructors": "Silviu Marisca, Nicole Vasilescu", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794670_5d30.jpg", 
    "course_url": "https://www.udemy.com/focus-mastery/", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T12:47:41Z"
}