{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">In this course you will learn how you learn, and learn how to improve your academic performance.</strong></p><p style=\"\">  \t  This course will help you determine the major factors influencing you ability to learn. Never get intimidated or feel lost in class ever again.</p><p style=\"\"> You will learn to recognize your preferences and your blocks to learning, and most importantly you will learn what to do to succeed and get the most from any training you take in the future.</p><p style=\"\"><strong style=\"\">Learn And Master Your Educational Efforts; A Concise Easy To Follow Program.</strong></p><p style=\"\">Some of your key take aways from this course:-</p><ol style=\"\"><li style=\"\">Know your learning style</li><li style=\"\">Know the difference between your self esteem and your self worth</li><li style=\"\">Find your ideal learning situation</li><li style=\"\">Learn how to develop your learning needs awareness for increased performance</li></ol><p style=\"\"> We will not use big words and complicated terms, we will show you these things so you know they exist but you don&#039;t need to remember any of them (except to impress your friends) The course length in approximately one hour long, but we recommend taking it a few steps at a time.</p>  <p style=\"\">  \t  If you have had difficulty in learning, or felt frustrated in learning, or simply want to understand a little about how you learn then this is the course for you.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">Complete Quiz number 1 and find your learning style.</strong></p>", 
    "end_date": null, 
    "title": "Getting more when you learn", 
    "price": "20.00", 
    "instructors": "Steve Hartshorn, M.Ed., D.A.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420448_95af_3.jpg", 
    "course_url": "https://www.udemy.com/getting-more-when-you-learn/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T18:32:31Z"
}