{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        If you&rsquo;ve ever wanted to improve your ability to memorize names and  faces by as much as 100%, 200%, even 300% (or more) &hellip; using simple  memory techniques that you can master in one hour (or less), then  this may be the most important video course you will ever attend. <br style=\"\">  \t<br style=\"\">  \t        Believe it or not, it doesn&#039;t matter if you think you have a good memory or not. <br style=\"\">  \t<br style=\"\">  \t        The information in this course will teach you:<br style=\"\">  \t<br style=\"\">  \t        &bull; Why memory is like a bicycle everyone can ride (with some minor personal adjustments).<br style=\"\">  \t<br style=\"\">  \t        &bull; The real reason why no one should ever be squeamish about memorization techniques or memorizing names and faces.<br style=\"\">  \t<br style=\"\">  \t        &bull; Why and how some of the most famous memory skills are applicable to learning and memorizing any name.<br style=\"\">  \t<br style=\"\">  \t        &bull; How to use memory techniques for storing and recalling any name you wish. <br style=\"\">  \t<br style=\"\">  \t        &bull;  Examples of how to turn boring names into exciting and unforgettable  images. (Learn how to do this and you&#039;ll be able to memorize ANYTHING).<br style=\"\">  \t<br style=\"\">  \t        &bull;  Unique memorization techniques that will have you literally &ldquo;tuning in&rdquo;  on new people that you meet. (Believe it or not, your mind wants you to  greet people this way).<br style=\"\">  \t<br style=\"\">  \t        &bull; The weakest, the middling and the most potent ways of memorizing names and faces. <br style=\"\">  \t<br style=\"\">  \t        &bull; Simple memorization technique examples that walk you through the process. <br style=\"\">  \t<br style=\"\">  \t        &bull;  Two secret ways to use relaxation to aid the memorization process so  that you memorize and recall names naturally and with ease. These two  methods alone are worth the price of this course because they will  literally eliminate stress from your body as you memorize new names the  instant you hear them. <br style=\"\">  \t<br style=\"\">  \t        &bull; And much, much more &hellip;<br style=\"\">  \t<br style=\"\">  \t        These  memorization techniques have been used by thousands of people, most of  whom previously considered themselves owners of a &ldquo;bad memory&rdquo; to make  real strides in memorizing names and faces.<br style=\"\">  \t<br style=\"\">  \t        Don&rsquo;t worry! None of these memorization techniques are rocket science. <br style=\"\">  \t<br style=\"\">  \t        Frankly,  if you can memorize a short email address or the name of a movie, then  you can use this system to memorize anyone&rsquo;s name that you wish. <br style=\"\">  \t<br style=\"\">  \t        But there&rsquo;s really no time to lose.<br style=\"\">  \t<br style=\"\">  \t        Every  day that you are not using this simple memorization technique, you are  literally stealing from yourself the joy of memorizing and recalling the  names of the important new people you meet as you easily expand the  natural abilities of your mind.  </p>", 
    "end_date": null, 
    "title": "How to Memorize Names and Faces", 
    "price": "20.00", 
    "instructors": "Anthony Metivier", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94990_057d_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-memorize-names-and-faces/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-20T17:02:01Z"
}