{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>There are so many things funnier than studying that young people can do. Am I right? What about to <strong>spend less time studying</strong> and <strong>understand more</strong>?  Are you interested how to improve study skills?<span></span></p><p>I can help you in this course! I will teach you how to <strong>learn faster</strong>, so you will have more time for your hobbies and friends. And you will <strong>improve your grades</strong> next to it because you get to know what to learn and when to learn.</p><p><strong></strong></p><p><strong></strong> <strong>Less stress more fun</strong>. Sounds good? <strong>Save hours</strong> of your time by using effective study methods. You will be amazed <strong>how fast you see the first result</strong><strong>s</strong>.  \t              </p><p> ----<br><strong></strong></p><p><strong>Join almost 700 students</strong> who are already benefiting from this cute <strong>course</strong>! <strong></strong><br></p><p>---</p>Students confirm that this course help: <em>\"It took me months to learn some new stuff before. I can learn complex computer topics only in three days now! And to master in some specific topic I require only one month now.\"</em> Navis Michael Bearly J<strong></strong><p><strong><br>This course works.</strong> It is backed by <strong>actual scientific studies</strong> done to investigate how people learn, how they remember, and how they utilize time. I have taken what these studies have to say and <strong>combined it with over 35 years of personal experience</strong> to develop study techniques that will allow you to <strong>study less and learn more</strong>.</p><p> This course is actually <strong>three courses in one</strong>. I cover <strong>brain function</strong>, <strong>time management</strong>, and <strong>study skills</strong> each in their own module so you aren't faced with a massive overhaul of your study practices. You can incorporate one technique, see the effect it has on your study time and your performance, and go on to incorporate the rest of the techniques one at a time.</p><p> I provide a <strong>broad range of information</strong> in this course, and that will be satisfactory for most of you, but if you would like to take an advanced course or read some specialized material, you're more than welcome to do so. I provide <strong>information on </strong>many <strong>additional resources</strong> on given topic at the end of each section.  \t                                  </p>  <p>  \t              -----------------------------------------------------------------------------------------------------------------  </p>    <p> The course consists of <strong>39 lectures</strong>, <strong>nine quizzes</strong>, and <strong>nine podcasts</strong>. In addition, there are several <strong>self-evaluation tests</strong> designed to help you understand your abilities so you can target areas of weakness for extra work.</p><p> The length of the lectures varies from <strong>two minutes to five minutes</strong> and it's possible to watch them all in two hours. I recommend, however, that you do not do so. The way to get the most out of this course is to <strong>take each module separately</strong> and incorporate it into your study routine before moving on to the next section.  \t                        </p>    <p>  \t                        -----------------------------------------------------------------------------------------------------------------  </p>  <p> The course is aimed at <strong>high school students</strong> and <strong>freshman college students</strong>, but will be of use to<strong> anyone who wants to improve his/her study skills</strong>.</p><p> I guarantee that <strong>you will see</strong> some <strong>results immediately</strong> after applying these techniques. You'll want to continue through the whole course, and many of the techniques require <strong>diligent practice</strong>, but you will be able to <strong>see the results right from the beginning</strong> and feel your confidence rise as you progress. You should see your grade improvement at the end of your term while practising these techniques.</p><p>This <strong>course will teach</strong> you:</p><ul><li>How to <strong>manage your time.</strong></li><li>How to <strong>take notes effectively</strong> and efficiently.</li><li>How to <strong>improve your ability to remember</strong> facts, figures, and dates.</li><li>How to <strong>effectively utilize the resources</strong> you have.</li><li>How to recognize <strong>what is important</strong> and what isn't.</li><li>The basics of <strong>deeper learning.</strong></li></ul>Most of all, this course will teach you how to <strong>be the best student you can</strong> be by finding the <strong>right balance</strong>, using the <strong>right methods</strong>, and working with the <strong>right motivation</strong> and the <strong>right timing</strong>. <p> ----------------------------------------------------------------------------------------------------------------- </p><p>This course is part of a wider project called <strong>“School Can Be Fun\"</strong> and you can find a <strong>lot of other free resources</strong> on the Facebook page, Twitter account, and YouTube channel.</p><p>And remember, there is a <strong>30 day money back guarantee</strong> so if you are unsatisfied for any reason, you can request a refund.</p>", 
    "end_date": null, 
    "title": "How to study effectively - boost your study skills. ", 
    "price": "20.00", 
    "instructors": "Vít Skála, Ph.D.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160496_a658_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-study-effectively/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-09T11:00:03Z"
}