{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis – Heighten Your Memory Retention With Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><li>1. Many times\nit happen when we find it difficult to recall the information, important days/\ndates, events/meetings or sometimes even the names of the persons we met some\ntime back. Students find it difficult to retain what they have learnt and this\nespecially happens before exam or right in the examination hall while writing\nthe exam.\n\n\n\nWhy do you think this happens? And what do you think\nwe can do to improve our memory retention capability? Well, before we move\ntowards how to retain information, we first need to understand why we forget\nthe information. The main reason is anxiety. When we are anxious, nervous or\ntense, it becomes very difficult for our subconscious mind to recall the\ninformation. Self hypnosis helps you to heighten your memory retention and this\nvideo is designed to serve this purpose.\n\n\n\n<b></b>\n\n<b>2.     \n</b><b>How Self Hypnosis Can Help?</b><b></b>\n\n1)     \nSelf\nhypnosis helps to connect with the deep sources of power and energy within you<b></b>\n\n2)     \nSelf\nhypnosis helps change your limiting beliefs and thoughts<b></b>\n\n3)     \nSelf\nhypnosis brings more mental alertness<b></b>\n\n4)     \nSelf\nHypnosis helps you a great wave of relaxation refreshing your whole body<b></b>\n\n5)     \nSelf\nhypnosis helps maintain positive attitude <b></b>\n\n6)     \nSelf\nhypnosis treats stress, anxiety, nervousness and depression successfully<b></b>\n\n<b>\n</b><strong></strong></li></ul><p>This course is ideal for students who want to heighten their memory retention and also improve their memory to score well in exams and excel in their academics . It is also helpful in general for people to improve their memory</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English including bonuses.</p><p></p>", 
    "end_date": null, 
    "title": "Hypnosis – Heighten Your Memory Retention With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579888_2d42.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-heighten-your-memory-retention-with-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T07:39:52Z"
}