{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p>\n\n<p>Hypnosis for Students improve study habits guided Hypnosis  <br></p><p>was created to give you the student an experience equaling a private hypnosis session here with me  </p>\n\n<p><strong><em></em></strong></p>\n\n<p>Hypnosis will help you learn how to change if you struggle with studying and keep making excuses as to why you should not study because it makes you feel bad or you find it difficult to stay focused on the subjects you have to study.</p>\n\n\n\n<p>This has to be the course for you to change your whole relationship to study and studying bringing with it the benefits of excellent exam results. </p>\n\n\n\n<p>How you are going to achieve this by taking this course is by using natures gift Hypnosis a personal change experience that has been used for thousands of years in the healing temples in Egypt.</p>\n\n\n\n<p>you will also be learning NLP Neuro linguistic programming techniques that will allow you to feel really great and have feelings of excellence any time.</p>\n\n\n\n<p>With hypnosis you will be programming your mind to enjoy studying and also a special bonus section with a hypnosis session to improve reading speed and information retention.</p>\n\n\n\n<p><strong><em>  What I will teach you in this course Hypnosis for Students improve study habits guided Hypnosis  </em></strong></p>\n\n\n\n<p><strong><em>1. You will begin by creating an image in your mind of what you want so that you will know where you are going by having a destination to reach with excellent exam results.</em></strong></p>\n\n\n\n<p><strong><em>2. Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</em></strong></p>\n\n\n\n<p><strong><em>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</em></strong></p>\n\n\n\n<p><strong><em>4. Learn how you naturally resist changes even changes that can be very good for you</em></strong></p>\n\n\n\n<p><strong><em>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</em></strong></p>\n\n\n\n<p><strong><em>6. Learn who can and cannot be hypnotized</em></strong></p>\n\n\n\n<p><strong><em>7. Learn how you can feel amazing any time you want to</em></strong></p>\n\n\n\n<p><strong><em>8. Hypnosis course </em></strong><strong><em>bonus section</em></strong></p>\n\n\n\n<p><strong><em>Speed reading Hypnosis mp3</em></strong></p>\n\n\n\n<p><strong><em>Perfect Memory Hypnosis mp3</em></strong></p>\n\n\n\n<p><strong><em>Improve Study Habits Hypnosis mp3</em></strong></p>\n\n\n\n<p><strong><em>How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings that have been stopping you from feeling great studying</em></strong></p>\n\n\n\n<p><strong><em>All Files and videos are downloadable for easier access</em></strong></p>", 
    "end_date": null, 
    "title": "Hypnosis for Students improve study habits guided Hypnosis", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433970_8861_2.jpg", 
    "course_url": "https://www.udemy.com/enjoy-studying-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T11:32:36Z"
}