{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis – Improve Your Study Habits With Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><ul><li>1. Most of the students face this problem – they do not find the subject interesting or they are not interested in learning. For such students forcing and scolding them to study will not do any good.</li></ul> <p></p><p>For such students self hypnosis has a solution. Self hypnosis programs your subconscious mind and make it open to learn new things and grow in life.</p> <ul><li><b>2.</b><b>How Self Hypnosis Can Help?</b></li><li><b></b></li> <li>1) Self hypnosis increases your focus and concentration<b></b></li> <li>2) Self hypnosis motivates you<b></b></li> <li>3) Self hypnosis enhances memory retention<b></b></li> <li>4) Self hypnosis increases your confidence and self-esteem<b></b></li> <li>5) Self hypnosis makes you more mentally alert<b></b></li> <li>6) Self hypnosis treats stress, anxiety, nervousness and depression successfully<b></b></li></ul></ul><p>This course is ideal for students who want to make learning interesting and want to change their studying habits , focus and concentration to achieve better results in their exams.</p><p>You will learn a lot of self hypnosis techniques and also techniques to relax your mind instantly and free yourself from negative thoughts, stress and exam anxiety.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English.</p>", 
    "end_date": null, 
    "title": "Hypnosis – Improve Your Study Habits With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581864_4cc4.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-improve-your-study-habits-with-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T05:34:53Z"
}