{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Learn the concepts of how to study using methods that mimic and map to how the brain receives and stores information. </p><p style=\"\"><strong style=\"\">Build Your Study Skills by Understanding WHY Before You Learn HOW</strong></p><p style=\"\">We will explain WHY we are going to do something before giving you the HOW we are going to do it. Understanding WHY you are going to learn something is a key factor in being able to successfully retain information. By understanding WHY, your brain will have the framework with which to process the information and the suggestions given will have relevance when we discuss the HOW. When there is a reason for something and a framework with which to associate it, your brain will find it easier to remember as it will have a context.</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\"> Whether you&#039;re a seasoned student, a student who is struggling, or you have been working for years and are looking to do some training to advance your career, this course with 9 lectures and one hour of video content will provide you with proven methods to learn and absorb more information. </p><p style=\"\">You will discover how your brain works during the learning process and then look at the different learning styles people use when they study and how they map to the way the brain sorts and stores the information.</p><p style=\"\">Learn how to get into the right mental state to study properly and look at a variety of ways to acquire the knowledge and retain the information.</p><p style=\"\"><strong style=\"\">What Am I Going To Get From This Course?</strong></p><ul style=\"\"><li style=\"\">Memory training techniques.</li><li style=\"\">An understanding of how your brain learns and stores information.</li><li style=\"\">Develop your own learning toolkit.</li><li style=\"\">Gain skills that will help you advance throughout your working life.</li><li style=\"\">Discover your own personal learning style.</li><li style=\"\">A visual, animated training method that targets the three learning styles and increases retention and accelerated learning.</li><li style=\"\">A series of quizzes after each lecture to reinforce what you have learned.</li></ul>", 
    "end_date": null, 
    "title": "Learn More With Less Effort & Succeed", 
    "price": "30.00", 
    "instructors": "AMF Training", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534440_49f6_3.jpg", 
    "course_url": "https://www.udemy.com/learn-more-with-less-effort-and-succeed/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-22T19:57:30Z"
}