{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Memory is where the rubber meets the road in accelerated learning.</p><p style=\"\">You buy books and courses.</p><p style=\"\">You spend time reading and taking notes.</p><p style=\"\">You synthesize ideas until you really understanding them.</p><p style=\"\">But none of that means anything if you don&#039;t have access to those ideas in your memory when you need them.</p><p style=\"\">The accelerated learning industry is still in it&#039;s early years.</p><p style=\"\">It&#039;s still obsessed with &quot;vanity metrics.&quot;</p><p style=\"\">What is a vanity metric?</p><p style=\"\">It&#039;s something that looks good or sounds good, but isn&#039;t connected to real world results. </p><p style=\"\">What does that look like?</p><p style=\"\">Take two doctors. Both 45 years old. Both graduated from the same medical school. One is a top surgeon who has clients flying to her from around the globe. The other just lost settled his 10th malpractice lawsuit. Who do you wanted to be treated by? Does it have anything to do with their &quot;years of experience?&quot;</p><p style=\"\">Ok, but what about vanity metrics in accelerated learning?</p><p style=\"\">I&#039;ve talked about a couple of these before in the first two courses in this series on speed reading and note taking.</p><p style=\"\">One is reading speed...WPM, or words per minute. As I said before, what is really important is not speed of reading, but speed of thinking/processing...specifically: </p><p style=\"\">How fast can you take the raw materials, the words/sentences/ideas from the book and ASSEMBLE them in to a framework of knowledge that actually makes sense to you?</p><p style=\"\">A framework that you understand and can use in the real world.</p><p style=\"\">A second vanity metric is number of books read. </p><p style=\"\">Why is this a vanity metric?</p><p style=\"\">Because you will forget over 90% of what you read after a month. If you read a book over the course of the week, you will have already forgotten over half of the first few chapters by the time you are reading the conclusion.</p><p style=\"\">And what about that last 10%? That stuff you do remember?</p><p style=\"\">Is it structured information that you can use that makes sense to you? A new fully formed skillset? </p><p style=\"\">Or is it just a random collection of unorganized factoids? </p><p style=\"\">Before I go any further, a warning. Don&#039;t buy this course and think that it is going to solve the problems above. </p><p style=\"\">You need to come to the stage of memorization having already done the right research, read and annotated the right books, and taken the right kind of notes that are structured properly.</p><p style=\"\">Memorization is expensive.</p><p style=\"\">A lot of people come to memory courses, books and trainings thinking that they are going to learn a system that makes it easy to just memorize books as they blaze through them at 1,000 wpm. </p><p style=\"\">It&#039;s a pipe dream. It&#039;s never going to happen.</p><p style=\"\">As I talk about in part 2 of this 3 course series on note taking, most of the information you consume, whether reading, listening, watching, live interaction, whatever, doesn&#039;t need to be memorized.</p><p style=\"\">So we&#039;re really only talking about 5-10%...at most 20%...of what you are &quot;learning&quot; actually needs to be memorized for long term, immediate retrieval.</p><p style=\"\">Why do I qualify the statement like that?</p><p style=\"\">First, because sometimes you only need short term retrieval. </p><p style=\"\">You are studying for a test on a subject you don&#039;t care about. You are happy to forget the information once you pass the test.</p><p style=\"\">Or you&#039;re working on a one off project or setting something up once and never need to do it again. </p><p style=\"\">Second. Immediate retrieval. This one is a bit more complicated.</p><p style=\"\">To paint broad strokes, there are two types of information. Think of it like a tree.</p><p style=\"\">There is the trunk and branches and roots, and then there is the leaves and fruit. </p><p style=\"\">Stuff like systems, frameworks, deep underlying strategies or principles, need to be remembered forever. They are the foundation of your knowledge. They are what you will connect new ideas and skills to in the future. </p><p style=\"\">The other kind of knowledge is the leaves and fruit. This kind of stuff is more at the surface. Some of it you will need immediate access to at a moment&#039;s notice, but none of it is really structuring your overall way of thinking. It&#039;s just a fact, or stat, or name or place or other piece of useful info.</p><p style=\"\">This second type of knowledge often doesn&#039;t need to be memorized. Maybe you can Google it. But for more specialized information, you will need to look it up in your own personal computer or paper files.</p><p style=\"\">This goes beyond memory, this goes to where you store information. Your memory is just one of the different options you have for storing things. It&#039;s just a little faster to access than to look it up in your paper or digital notes. </p><p style=\"\">If you have a well organized notes system, you can spend more time on memorizing the really important information, like the systems, principles, frameworks and strategies, and have quick access to the rest. </p><p style=\"\">So here&#039;s the deal. There are hundreds, if not thousands of books and courses out there on memory. What makes this course different is that it goes beyond the mechanics of mnemonics and spaced repetition, neither of which differs that much from book to book or course to course. </p><p style=\"\">It goes to thinking strategically about what to memorize, how to memorize, and how to organize your memorization activities into a larger learning system that, when implemented as a whole, gives you huge speed improvements and a massive competitive advantage in your business or career. </p><p style=\"\">Some of the big points to consider:</p><p style=\"\">-Knowing how to structure your information before you even start the memorization process will save you tons of time and energy</p><p style=\"\">-How to set up a spaced repetition system that will work the same way whether it&#039;s in paper format (and I don&#039;t mean 3x5 index cards) or OneNote, Evernote, or any other software</p><p style=\"\">-How to re-conceptualize visual mnemonics as learning a foreign language and how to achieve fluency faster (this is the weakness of traditional visual mnemonics nobody talks about)</p><p style=\"\">-How to fix another major weakness of traditional mnemonics, which is isolating information in elaborate memory palaces. This information, while technically accessible in your memory, is not actually integrated into your thinking. Learning is about building skillsets, and you need to do more after or instead of building a memory palace to get the new knowledge integrated in how you think. You may be able to fill in the blanks on a test, but you won&#039;t have actually gained the new skill or knowledge base you are looking for.</p><p style=\"\">If you are serious about improving your memory and have been frustrated by the incompleteness and ineffectiveness of other memory systems, this course is for you.</p><p style=\"\">This is not a course about memorizing names. </p><p style=\"\">It&#039;s not about memorizing decks of cards.</p><p style=\"\">It&#039;s not about memorizing digits of pi.</p><p style=\"\">Sure, you can use the mnemonics I teach for those if you want, but frankly, those are not interesting ways of using memory. They are mostly party tricks and ways to impress people who don&#039;t understand how easy it is once you know mnemonics. </p><p style=\"\">No, this course is strictly for entrepreneurs, professionals and students who want to a memory system that is fully integrated with the whole learning process and is designed for building real world skills that can help you in your business, career and life. </p><p style=\"\">If that&#039;s what you&#039;re looking for, this is the course for you. </p><p style=\"\">Timothy</p>", 
    "end_date": null, 
    "title": "Learning the Hard Way Vol 5: Memory The Hard Way", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419686_2b73_3.jpg", 
    "course_url": "https://www.udemy.com/memory-and-memorization-the-hard-way/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T22:35:54Z"
}