{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">*Note: This course is part of a 3 part series on accelerated learning, covering speed reading, note taking/synthesis, and memory.*</p><p style=\"\">Okay. Another speed reading course.</p><p style=\"\">But why &quot;The Hard Way?&quot;</p><p style=\"\">Let me let you in on a little secret. </p><p style=\"\">None of the ideas in this course, or any other accelerated learning course, are really new. At least not most of them.</p><p style=\"\">(And the other secret: WPM (words per minute) is a scam. Scroll down more to learn what I mean)</p><p style=\"\">It turns out that most of these ideas existed thousands of years ago, and were then lost by those cultures and rediscovered in the last couple decades.</p><p style=\"\">Why is this important?</p><p style=\"\">Because the courses on speed reading out there today are directed towards a mostly uninformed public that isn&#039;t aware of this history. </p><p style=\"\">And here&#039;s the truth: You will not learn that much faster if you do it the &quot;easy&quot; way. And you also won&#039;t enjoy it as much. Part of the satisfaction that comes from learning something new is wrestling with the new ideas and making sense of something that used to be confusing.</p><p style=\"\">So what is new, or different, about this course?</p><p style=\"\">The essential difference is that it is based on a larger learning system that ensures that there are no major learning &quot;leaks&quot; at any stage of your learning process.</p><p style=\"\">That means that as you go from reading, to taking notes or synthesizing the ideas in other ways, to then memorizing, you are not forgetting things, skipping important steps, or wasting any time on re-doing something you already did before.</p><p style=\"\">So what does that actually look like?</p><p style=\"\">With speed reading, the key problem is with how most people conceptualize and measure it. </p><p style=\"\">It&#039;s like this...In your car, you have two big dials (usually) on your dashboard. RPM, which is how fast the ENGINE is going, and second, MPH (miles per hour) which is how fast YOU are actually going.</p><p style=\"\">You don&#039;t go faster by increasing your RPM (which you can hear because the engine wirr starts going faster and faster, higher and higher pitch)...No, you go faster by increasing your gear as you gain speed. </p><p style=\"\">When you are going 70 on the highway, you aren&#039;t red-lining your engine (I hope) at 6 or 7,000 RMP...instead, you are at 2 or 3,000 and in your top gear.</p><p style=\"\">How does this all link back to speed reading?</p><p style=\"\">WPM is easy to measure, that&#039;s why most people use it. But it only measures what is being poured into your head, not what is sticking or making sense. </p><p style=\"\">Traditionally, to solve this problem, you would combine speed with comprehension. </p><p style=\"\">The problem is that comprehension is a mythical beast. </p><p style=\"\">It doesn&#039;t actually exist.</p><p style=\"\">First, it&#039;s usually measured based on fiction as opposed to non-fiction, which is most of what people speed-read. </p><p style=\"\">Second, it&#039;s highly dependant on your pre-existing knowledge of the subject.</p><p style=\"\">Third, it&#039;s next to impossible to self test when you are reading something in the real work.</p><p style=\"\">Fourth, It doesn&#039;t measure retention of that knowledge, or integration into a larger body of knowledge.</p><p style=\"\">What you will learn in this course is that your whole way of conceptualizing learning, in terms of WPM and number of books read needs to be thrown out the window.</p><p style=\"\">The real aim of your learning needs to be the careful and deliberate construction of new knowledge structures.</p><p style=\"\">The best way to think about it is like a house. </p><p style=\"\">First you put up the framework/framing, then you put in the rest, furnish it, etc. </p><p style=\"\">If you have a shoddy foundation or framework, nothing else about the house matters because it is not going to last and might collapse on you. </p><p style=\"\">The same is true with knowledge structures. If you are reading so fast you can&#039;t put ideas together into a coherent and actionable framework, then it doesn&#039;t really matter how fast you are going.</p><p style=\"\">Because it&#039;s not about your speed of reading.</p><p style=\"\">It&#039;s about your speed of thinking. </p><p style=\"\">Or more accurately, your speed of construction. </p><p style=\"\">The words on the page are just the raw materials. A good writer gives you good materials and a good blueprint. </p><p style=\"\">But you still need to build those ideas into real concepts in your head.</p><p style=\"\">This course is about speeding up THAT process. </p><p style=\"\">Plus, I haven&#039;t even touched on the whole section about going behind the scenes of how books are actually written, sold to publishers, negotiated, edited, published, marketed to you, etc. </p><p style=\"\">I give you a behind the scenes look at how the whole industry works, and then we zoom out and look at how the selling of not just books but all information works and how you can use that understanding to pick only the best and highest quality books to invest your time into.</p><p style=\"\">* * *</p><p style=\"\">I&#039;ll leave you with a story from the New York Times I read a few days ago. It&#039;s about successful entrepreneurs using high speed track racing (with cars) as a way to network. </p><p style=\"\">Some people think that racing cars is boring. It&#039;s just peddle to the metal. But it&#039;s actually a lot more complicated than that. </p><p style=\"\">It&#039;s about finding the perfect groove that exists on the track. Sometimes you are better off on the outside of the track. Other times, on the inside. </p><p style=\"\">And your braking and acceleration and steering all have to be perfect to stay in that groove as your circle the track. </p><p style=\"\">That&#039;s what speed reading is. </p><p style=\"\">It&#039;s not just about how fast you can go. </p><p style=\"\">It&#039;s about how well can you handle the twists and turns (conceptually) as the author throws different ideas at you in different configurations and combinations. </p><p style=\"\">Most courses teach speed reading as if it was an even NASCAR like track. </p><p style=\"\">But it&#039;s not. </p><p style=\"\">It&#039;s more like racing on city streets or a dirt track winding through a forest.</p><p style=\"\">This is the next level of speed reading. </p><p style=\"\">If you are ready for it, I look forward to seeing you in the course. </p><p style=\"\">See you on the inside,</p><p style=\"\">Timothy</p><p style=\"\">P.S.</p><p style=\"\">Still not convinced?</p><p style=\"\">Check out the videos I marked as free previews below. I always make sure to make some of the best content in the course free so that you can get a taste of what I&#039;m all about before you decide if you want to buy.</p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learning the Hard Way Vol 3 : Speed Reading the Hard Way", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419682_a636_3.jpg", 
    "course_url": "https://www.udemy.com/speed-reading-the-hard-way/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T22:32:58Z"
}