{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">What is the difference between experts and non-experts?</p><p style=\"\">Years of experience?</p><p style=\"\">Amount of published work?</p><p style=\"\">What their peers think about them?</p><p style=\"\">How much they charge per hour?</p><p style=\"\">These are some of the common ways that we judge how much of an expert someone is.</p><p style=\"\">But none of them really get at the heart of the real difference.</p><p style=\"\">It turns out there are many differences, and I&#039;m going to focus on one of the most important ones here because it relates directly to how well you take notes, and what you do with them afterwards.</p><p style=\"\">That difference is...how do you look at the problems you have to solve every day?</p><p style=\"\">Experts do this by looking deep into the problem to figure out how it&#039;s structured beneath the surface.</p><p style=\"\">Beginners don&#039;t have this depth, so they pay attention to the surface level features of what is going on.</p><p style=\"\">A simple example of this is looking at how doctors diagnose patients. But you could just as easily apply this to a mechanic fixing a car or an IT pro fixing a computer or a marketer figuring out how to fix their ads or a consultant coming in to fix a business.</p><p style=\"\">So the doctor example.</p><p style=\"\">An expert doctor looks for a few of the most important signals, or symptoms, and then quickly processes these by looking at the types of diseases that could have coursed the combination of symptoms, or problems, that are presenting on the surface.</p><p style=\"\">A beginner, student doctor, groups the symptoms in a different way. Instead of thinking about what diseases cause the problems, they group the symptoms by superficial attributes, like where they are on the body, their color, how long they have been around for, etc. </p><p style=\"\">Now, to note taking.</p><p style=\"\">How does this all apply?</p><p style=\"\">The ultimate question is how do you get to expert level faster? Or even if you don&#039;t want to get that good, how do you go from being bad at something to decent in half the time, or a quarter of the time, or even faster?</p><p style=\"\">That is where note taking comes in. </p><p style=\"\">But note taking implies that there is one way of doing it. &quot;Taking down&quot; a note.</p><p style=\"\">It&#039;s actually a lot more than that.</p><p style=\"\">It&#039;s about how do you represent information on paper, and then how does that translate into how you structure information in your head.</p><p style=\"\">That&#039;s what makes an expert.</p><p style=\"\">The years they spend going over the same information, having experiences, testing and trying things out until they have a highly structured network of information that is tightly interconnected in their memory.</p><p style=\"\">&quot;Highly Structured Network of Information&quot;</p><p style=\"\">What does that really mean though?</p><p style=\"\">Think about this metaphor. That knowledge structure is like..a house. Or a brick building. Or a skyscraper.</p><p style=\"\">As a beginner, you start with piles of unassembled pieces of information lying on the ground. </p><p style=\"\">To learn, you attach the deep structural pieces to you existing knowledge, this is like when you dig out the basement and pour the foundation into the ground. </p><p style=\"\">Next, you start building a framework.</p><p style=\"\">Then, you add the rest, the walls, the plumbing and electrical, and everything else involved in putting the building together.</p><p style=\"\">Depending on how much understanding and skill you want to achieve, you need to think differently about how you will structure your knowledge.</p><p style=\"\">A house can be built with wood. A 10 or 20 story building can be built out of brick. But you can&#039;t build a 100 story building unless you have steel and reinforced concrete. </p><p style=\"\">Back to note taking now.</p><p style=\"\">How do you build your skills up to a skyscraper level in record time?</p><p style=\"\">It required starting from the beginning with the right frameworks.</p><p style=\"\">And that means you have to have a blueprint of the framework when you start learning.</p><p style=\"\">This is where notes come in.</p><p style=\"\">When you are reading, or taking a course, or having a conversation or listening to an audio book, you are collecting materials that will eventually be the building blocks of your knowledge base.</p><p style=\"\">The question is, what about the blueprint?</p><p style=\"\">That is something you have to come up with on your own. Or in some cases, you can find an expert who lays out their blueprint for you.</p><p style=\"\">This is where more advanced note taking strategies, like mind mapping and flow charting come in.</p><p style=\"\">They are useful for representing more complex knowledge structures. </p><p style=\"\">Then there is a third part. (First part is the construction materials, second part is the blueprint)</p><p style=\"\">The third part is the map of the building and what is in it once you finish building it. </p><p style=\"\">Imagine you go to store a few boxes of junk at one of these storage facilities. </p><p style=\"\">You rent out a small room and put your stuff in it and they give you a number.</p><p style=\"\">But then you come back months later and they lost the record of where your stuff is.</p><p style=\"\">It might as well be gone, because it&#039;s going to take forever to go around to the 100s of storage units and search each one for your stuff.</p><p style=\"\">It seems crazy that this would ever happen in the real world, but it happens everyday in the learning processes most people use.</p><p style=\"\">This is why organizing your notes, and information in general, is so important. </p><p style=\"\">The final section of this course shows you how to do that. </p><p style=\"\">It gives you a simple system you can use with both your physical and digital notes and other files that works whether you are dealing with a few dozen documents, a few hundred, or even millions of documents. </p><p style=\"\">And the system works in parallel, so that things are just as easy to find digitally as physically because they are organized in exactly the same way.</p><p style=\"\">Here&#039;s the TL,DR for this letter:</p><p style=\"\">People over estimate speed reading and memorization, and under value note taking and organization.</p><p style=\"\">The only way to replicate expert levels of understanding quickly is to replicate their knowledge structure. </p><p style=\"\">Without the right kinds of notes, it&#039;s impossible to get that structure into your head.</p><p style=\"\">You need to have a system for creating that structure for each subject you want to learn, and then...AND ONLY THEN, can you start memorizing information in an efficient way. </p><p style=\"\">A memory palace with a thousand knowledge objects strewn about does not equal an expert knowledge structure. </p><p style=\"\">Not even close. </p><p style=\"\">Notes are the key to building expert level knowledge structures out of the raw materials and blueprints you get from reading.</p><p style=\"\">Organizing your notes and other files is the only way to know where your knowledge is so you can get to it when you need it. </p><p style=\"\">There will never be enough time to memorize via spaced repetition all the knowledge you need access to. Most of the information you will use in your life doesn&#039;t need to be memorized anyways. </p><p style=\"\">The only way to master this type of information and learning is to have your knowledge organized. Not memorized.</p><p style=\"\">Memorization has it&#039;s place, and I talk about that in the third course in the &quot;Accelerated Learning the Hard Way&quot; series, which comes after this one. </p><p style=\"\">Timothy</p><p style=\"\">P.S. Remember, the goal of note taking is not notes. It&#039;s all about this simple question: How do you build expert-level knowledge structures IN YOUR HEAD (via connecting neurons, structuring ideas/knowledge) as fast as possible? Any course, book or learning system that doesn&#039;t focus on this as the end goal isn&#039;t really about learning. </p><p style=\"\">You may feel good about boosting your WPM or having more books on your &quot;finished shelf,&quot; but you won&#039;t have actually achieved the expert level skills that you were going for in the first place. </p><p style=\"\">Never mistake activity for progress.</p>", 
    "end_date": null, 
    "title": "Learning the Hard Way Vol 4 : Notetaking The Hard Way", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419684_2171_2.jpg", 
    "course_url": "https://www.udemy.com/notetaking-the-hard-way/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T22:35:19Z"
}