{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>It is well known that people who speak one foreign language find it easier to then learn further languages and <strong>this is no coincidence</strong>. Multilingual people like me utilize a variety of learning tips and tricks they have picked up along their language learning journey in order to <strong>increase the power of their memory</strong> - this then allows them to recall the new words and phrases quicker and quicker until it becomes an automatic reflex. <strong>I want to share these proven secrets with you so that you can improve your memory and become a language ninja too!</strong></p>\n\n<p>  \t<em>Last Updated <strong>May</strong><em><strong> 2016</strong></em>.</em></p>\n\n<p>  \t<em>    Have you ever wondered how people seem to pick up a language so fast? Do you ever find yourself struggling with memorizing vocabulary and rules? Then this course is designed for people just like you!  </em>  </p>\n\n<p>But don't just take my word for it - here is what my students have to say:</p>\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n<p><em>\"Instructor is great to listen to and clearly knows his stuff. Impressive\" </em><strong>Peter de Voorts</strong><br></p>\n\n<p><em>\"Really helpful tips, much needed for language fans like me. High quality course, would recommend\" </em><strong>John Bates</strong></p>\n\n<p><em>\"I love this course. The information and practical exercises really do help to improve your memory and I've already seen progress!\" <strong></strong></em><strong>Frances Phipps</strong></p>\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n<p>  \t<strong>This course aims to tap into these tips and tricks that I used to become fluent in a second language and beyond, so that you too can improve your memory and become a more confident and competent linguist! Over the duration of 13 lectures we will explore each method individually, dedicating time to understand what the method involves and how it is most effectively used. I have also included example exercises for each method so that you can get started straight away! Master any Language as quickly as possible using these tips.</strong></p>\n\n<p>  \t      I look forward to seeing you on the course and becoming a small part of your language journey - bye for now!  </p>", 
    "end_date": null, 
    "title": "Master Any Language & Improve Your Memory in 10 Easy Steps!", 
    "price": "20.00", 
    "instructors": "Scott McElroy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241422_4075_3.jpg", 
    "course_url": "https://www.udemy.com/improveyourmemory/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-11T14:16:01Z"
}