{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*******************************************************************************************************</strong><strong>DOUBLE YOUR MEMORY SKILLS TODAY. ENROLL NOW!</strong></p><p><strong>Course fully updated for March, 2016!<br></strong><strong>*******************************************************************************************************</strong></p><p><strong>IMPORTANCE OF MEMORY</strong></p><p>The word memory is derived from the root <strong>“MER\"</strong> which means to remember. Your memory of names, faces, dates, events, data, details and other things concerning the day-to-day life is the measure of your ability to survive in today's fast-paced, information-dependent society. With a good memory, you don't have to fear forgetting/misplacing important things and you can overcome mental barriers that restrict you from achieving a successful career and personal life.</p><p>In most cases, poor memory is due to lack of attention or concentration, insufficient listening skills, and other inherent habits. Memory is like a muscle - the more it is used, the better it gets. The more it is neglected, the worse it gets; however, it can be honed and developed using the right methods which we will see in this course.<br></p><p>---------------------------------------------------------------------------------------------------------------------------------<br></p><p><strong>WHAT IS THIS COURSE ABOUT?</strong></p><p>\"Memory Improvement: Key Techniques To Improve Your Memory\" course is all about boosting your memory skills using key memory principles, proven memory tools and memory techniques. By the end of this course, you'll be able to double your memory and easily overcome mental barriers that restrict you from achieving a successful career and personal life.</p><p>---------------------------------------------------------------------------------------------------------------------------------<br></p><p><strong><em>So, get ready to boost your memory. I will see you on the inside!</em></strong></p>", 
    "end_date": null, 
    "title": "MEMORY TECHNIQUES: How To Double Your Memory Instantly!", 
    "price": "20.00", 
    "instructors": "Upskill Academy", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589718_c14a_7.jpg", 
    "course_url": "https://www.udemy.com/memory-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T18:39:59Z"
}