{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t          This is the non-technical, everyday memory problem parts of the Memory Shock courses taught at community colleges and the N.Y.P.D. Police Academy. It is based on material in Barry Reitman&#039;s book, &quot;Secrets, Tips, and Tricks of a Powerful Memory.&quot;  Each lecture is a brief, easy-to-follow, practical illustration of the trick to overcoming problems that make you THINK you have a poor memory. You do not have a poor memory — you&#039;ve just never been taught how to use it. The lessons are fun to watch and apply, and students of every age and level will see instant improvement. The practice suggestions are usually done with things you want to remember anyway. They are simple, easy and fun to do.  </p>  <p style=\"\">  \t  Reviews of the book and live presentations:   \t  \t    &quot;… uses simple tricks to remember almost everything … with instantaneous success.  Barry Reitman&#039;s &#039;Secrets, Tips, and  Tricks of a Powerful Memory&#039; ... is the  answer to the prayers of millions of adults who experience the  frustration of trying to remember things that are important to them.&quot;  \t<em style=\"\">  —Dr. Lynn Tepper, Gerontologist, Clinical Professor, Columbia University, NYC</em></p><p style=\"\"><em style=\"\">  \t</em>“…Not only were the strategies and tips you shared well received, but  many in attendance would have liked to have several more hours with you  to continue reviewing your system. I commend you on your course content  as well as on your instructional style; both were an absolute hit with  our audience.&quot;  \t<em style=\"\">  —Captain Daniel E. Sosnowik, Commanding Officer, Leadership Training Section, NYPD</em></p><p style=\"\">&quot;...Barry Reitman&#039;s Memory Shock presentation was both effective and valuable to professors, teachers, and graduate students.&quot; <em style=\"\">—Elaine Geller, Dir. of Field Experience &amp; Outreach, Rockland Campus, Long Island Univ.</em></p><p style=\"\"><em style=\"\"></em>  </p>", 
    "end_date": null, 
    "title": "Memory Secrets. Instantly Improve Everyday Memory 300%", 
    "price": "20.00", 
    "instructors": "Barry Reitman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407968_09f5_2.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-a-powerful-memory-fix-everyday-memory-problems/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-29T17:39:56Z"
}