{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">    Memory Improvement Secrets From The Ancients?  </strong>  </p>  <p>  \t      If you&#039;ve ever wanted some deep, philosophical insights that will give you new ways to improve memory merely by thinking more deeply about it, then this may be the most important course you ever take.  </p>  <p>  \t      Let&#039;s be honest here: Sometimes you don&#039;t need memory vitamins or photographic memory training ... Just a little inspiration from thousands of years ago!  </p>  <p>  \t<strong style=\"\">    Learn Exactly What Memory Is So You Can Improve Memory The Right Way  </strong>  </p>  <p>  \t      You know, the problem with so many people who want to know how to improve memory and how to improve concentration is that they don&#039;t think about what memory is.  </p>  <p>  \t      Not only that, they don&#039;t know much about the origins of the ultimate memory supplements: mnemonics. So if you&#039;re interested in ...  </p>  <p>  \t<strong style=\"\">    The Ultimate Supplement For Memory ...  </strong>  </p>  <p>  \t      Why not check out one of the earliest writers to talk about it?  </p>  <p>  \t      This short course will literally take no more than 30 minutes of your time. And in that short investment, you won&#039;t learn much about how to improve memory recall, but you will discover a whole new foundation for thinking about ways to memorize more.  </p>  <p>  \t<strong style=\"\">    Because If There&#039;s A Solution, It&#039;s ...  </strong>  </p>  <p>  \t      ... knowing more about the topic. Starting from the very beginning. In fact, every memory course on earth should make this short treatise on memory by Aristotle required reading.  </p>  <p>  \t<strong style=\"\">    Forget About Brain Exercises To Improve Memory For Now  </strong>  </p>  <p>  \t      In this book, you&#039;ll learn what Aristotle thinks about memory, including:  </p>  <p>  \t  * What memory is (and how it connects to the imagination)  </p>  <p>  \t  * How memory is used (and how it isn&#039;t)  </p>  <p>  \t  * The specific ways that memory, time and imagination work together to create memorable impressions ...  </p>  <p>  \t<strong style=\"\">    After That, Start With Improving Short Term Memory  </strong>  </p>  <p>  \t      And the good news is that this book gives you access to an AMAZING resource about mnemonics that will show you exactly how.  </p>  <p>  \t<strong style=\"\">    What Are You Waiting For?  </strong>  </p>  <p>  \t      Aristotle is the very first writer on memory that we have. Don&#039;t let another 2000 years past before you add his thoughts about memory to your mental database. Join this course now.  </p>", 
    "end_date": null, 
    "title": "Memory Tips From Aristotle", 
    "price": "20.00", 
    "instructors": "Anthony Metivier", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411292_a2c5.jpg", 
    "course_url": "https://www.udemy.com/memory-tips-and-aristotle-on-memory/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T19:19:57Z"
}