{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Learn how to mind map</strong> in 90 min as a complete beginner. Discover how mindmapping can <strong>transform your study</strong> strategy, saving stress and time. <strong>Saving over 2 weeks revision</strong> a year. Its especially valuable for working students. You will learn why people map and how to mind map using lots of walk through and time-lapse videos.</p><p><strong>Learn Mind Map Basics Quickly and Thoroughly Using Five Principles.</strong></p><ol><li>Discover why people mind map. </li><li>Find your mind mapping style</li><li>Learn five main principles of mind mapping.</li><li>Know which words to put on your branches.</li><li>Draw your own mind map</li></ol><p><strong>Ideal foundation</strong> course for High school pupils, University students and <strong>working students</strong>.</p><p>You’ll learn how to create a mind map in a <strong>step by step fun</strong> visual way, as you watch me draw mind maps, so you can <strong>see how its done</strong>, and the variety of techniques. Its a simple <strong>immersive</strong> way to learn how to create mind map notes is with a paper and pen. <br></p><p>Mindmap drawing is a simple and powerful learning tool. You can create a mind map straightforwardly with this course. I will show you how the only mindmap tool you need to get started is a paper and pen. You will learn how to mindmap in five easy steps. Using this simple technique you can learn how to create a <strong>mind map in an evening</strong>. </p><p>I’ve designed this course with lots of <strong>time-lapse video of maps</strong> being drawn to make it fast and visually engaging. A lot has been fitted into this fast paced course. All the main mind mapping techniques are covered. It would probably take a 5 hour course in real life to do the same without the time-lapse videos.</p><p>Mind map technique is simple, but takes a little practice, especially selecting keywords. There are some exercises and demonstrations to show how mind mapping works in real life. <strong>Knowing what words to put on the branches</strong> is an important mind map technique that is often overlooked and needs a little practice. Its normally what trips people up with actually using mind mapping in real life. There are two videos dedicated to this typical hurdle. </p><p>The course is full of creative mind map ideas which you can do <strong>without being an artist</strong>. Its like painting by numbers or colouring in once you know the techniques. See how you don’t need to be artistic to draw a mind map.</p><p>You will learn how to draw a mind map by doing the step by step walkthrough and <strong>draw a mind map in real time</strong>. </p><p>Mind mapping is <strong>great for revision</strong>. I will show you how a basic revision mind map can save you over 60 hours revision a year for high school, university or professional development.  Revision maps need a strong grasp of finding the key words to put on the branches. This is a core focus of this course. Keywords are crucial for exam revision and successful mind map revision.  </p><p>This course is the foundation for how to use mind mapping for studying. Learning mind mapping as a student is the ideal way to learn the skill. Once you have it you can use it for planning a project, business mind map and mind map brainstorming.</p><p>If your a student I’m sure you will complete this course inspired and equipped with mind map ideas that will <strong>save you time and help you learn faster.</strong></p>", 
    "end_date": null, 
    "title": "Mind Map for Beginners: Mind mapping a quick start guide.", 
    "price": "20.00", 
    "instructors": "Darius Namdaran", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/735990_ec43_7.jpg", 
    "course_url": "https://www.udemy.com/mindmapforbeginners/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-20T20:21:47Z"
}