{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Information overwhelm is one of the core problems accelerated learners face when they are deciding how to spend their time and stay productive. The key to fast learning is making sure you do the few important things well, and waste as little time as possible on everything else.</p> <p>In this course, you&#039;ll learn how to pare down your learning system to the bare essentials so that you can consistently get into the flow and maximize your learning performance. </p> <p>Studying productivity can be a double edged sword, because often the temptation is to start using new tools and techniques to improve your overall systems.</p> <p>The problem is, if you keep adding more tools and more new techniques, you end up adding a lot of complexity to your learning system, and complexity adds friction.</p> <p>That friction shows up as more decisions...because you have more options. And longer decision making cycles…because you have more options to consider at each step. </p> <p>All of this saps your energy and with it your ability to focus. Focus on what you are doing, but also make sure you are focused on the <strong style=\"\">right things</strong>, the most important things. </p> <p>You&#039;ll learn how to improve each step in your learning process by cutting it down to the bare essentials. You&#039;ll learn how to go on a learning retreat. You&#039;ll learn how to break your old outdated learning habits and replace them with a handful of effective minimalist learning practices that will improve your learning experience.</p><p>Decide today to cut down on the time you waste and get serious about your learning systems.</p><p>-Timothy</p>", 
    "end_date": null, 
    "title": "Minimalist Guide to Accelerated Learning", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514048_ee2d_2.jpg", 
    "course_url": "https://www.udemy.com/minimalist-guide-to-accelerated-learning/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T21:08:32Z"
}