{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*******************************************************************************************************</strong></p>  <p><strong> </strong></p>  <p><strong>DISCOVER HOW TO USE PROVEN TECHNIQUES TO EFFECTIVELY TAKE NOTES AND RETAIN THE RIGHT KNOWLEDGE… STARTING TODAY!</strong></p>  <p><strong> </strong></p>  <p>*******************************************************************************************************</p><p>Do you remember a time where you've taken notes and you've tried to\nrefer back to them - maybe the day before the test or maybe a day before you\nactually apply it, you look at the notes and you think, what was I thinking?\nAnd you really don’t understand your notes, you don’t really recall the notes\nand you really don’t know how to apply the notes. That could be a very\nfrustrating point in the process.</p><p>This video course was designed to help you develop an easy-to-follow note taking system that will turn your scribbles into a ‘note’-worthy study program. If you’re like the many other people who have a difficult time taking notes or who feel that their notes don’t give them the benefits they should, then this video course is for you.</p>    <p><strong>NOTE TAKING IS NOT TRANSCRIBING!</strong></p>  <p>There are ways to take notes without having to write down every single thing. Instead, you should focus on the details that you will need and that are helpful to you.</p>    <p>In this video course, I will show you a great system of note taking that will amplify your skills by reducing the time you spend taking notes. You will learn how to shorten your notes while at the same time getting much more out of them. </p>    <p>Before grabbing your pen and paper again, don’t miss out on this great opportunity to learn how to maximize your time and effort to create notes that will do wonders for you. </p><p><strong>Grab this video course today!</strong></p>", 
    "end_date": null, 
    "title": "NOTE-TAKING: How to Take Notes & Triple Your Learning Skills", 
    "price": "20.00", 
    "instructors": "Upskill Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641514_01f2_3.jpg", 
    "course_url": "https://www.udemy.com/note-taking-how-to-take-notes-triple-your-learning-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T16:15:25Z"
}