{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">GET STARTED NOW!</strong>  </p>  <p style=\"\">  \t    Instead of promising that you can improve your reading speed and memory, Alex will let you <strong style=\"\">watch the beginning of  the course for FREE! You will start to read faster within 2 hours.</strong> Guaranteed.  </p>  <p style=\"\">  \t<strong style=\"\">Join 9,257+ students</strong> already enrolled. <strong style=\"\">89% of the reviews are rated 5 stars!</strong> (Read some of the 118 reviews to make sure you are making the right decision)  </p>  <p style=\"\">  \t    Once you understand what speed reading is about, you will be confident enough to spend your money and watch the entire course. You will improve your reading speed in a way that will surprise you!  </p>  <p style=\"\">  \t<strong style=\"\">YES YOU CAN READ ENGLISH 33 TO 100%+ FASTER OR YOUR MONEY BACK!</strong>  </p>  <p style=\"\">  \t    Alex Garcez discovered that your brain loves speed, and he thinks that fast is fun - slow is boring! If you think you have short attention span to read books, documents and social media, then you probably read slowly and carefully. Instead of understanding the text you get bored and distracted, needing to skip back to re-read text countless times. The main reason is that your brain is too powerful to go at such a slow pace and will drift off into something more interesting to think about.  </p>  <p style=\"\">  \t<strong style=\"\">Alex Garcez</strong> gave up his Engineering degree in the third year because he was a very slow reader, however, his weakness became his strength, after taking a speed reading course, and deciding he was not going to become a laborer but an entrepreneur. Since then he took a Business Degree, Masters in Marketing and Advertising, and developed the <em style=\"\">Revolution Speed Reading Method. </em>He personally coached more than 3,600 people and more than 98.4% of his clients improved their reading performance by at least 33%. In fact most of his clients improve their reading speed by more than 100%.  </p>  <p style=\"\">  \t    With more than 9,257 clients taking this two hour course in 53 countries, Alex expects to motivate people to read more books. His method is based on science, and he has achieved amazing results while coaching professionals from companies such as: <strong style=\"\">Goldman Sachs, GE, J P Morgan, Google, Bloomberg, eBay, The Wall Street Journal, Sage, The Walt Disney Company, KPMG, Ernst &amp; Young, Thomson Reuters, Adecco, Lloyds Bank, Citigroup, PwC, HSBC and O2.</strong>  </p>  <p style=\"\">  \t    You will assess your reading speed at the beginning and throughout the course. <strong style=\"\">So, if you spend 3 hours reading at work and improve your reading speed, on average, by 33%, you will save a whole month of work (24 days) every single year.</strong>  </p>  <p style=\"\">  \t    Take this ultimate Speed Reading Course right now and improve your reading speed.  </p>  <p style=\"\">  \tAttention: This course has similar content to the <strong style=\"\">Basic Speed Reading for IT.</strong>  </p>", 
    "end_date": null, 
    "title": "Speed Reading for Work and Leisure.", 
    "price": "20.00", 
    "instructors": "The Speed Reading Coach", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33145_c87d_22.jpg", 
    "course_url": "https://www.udemy.com/speed-reading/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-19T22:17:49Z"
}