{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This professionally produced 9-part video course helps students struggling to read volumes of material or business people under pressure to keep up with the rate of change in their industry. You will learn how to slice through your reading pile and read faster, smarter and easier. You are guaranteed to at least double your reading speed - or better - while improving your comprehension.</p><p>The presenter, Nina Sunday, is a qualified educator and expert in training Speed Reading. Nina has pioneered teaching this skill to over 100,000 executives and students in Australia and New Zealand over two decades. </p><p>This video presents the essentials of a one-day Speed Reading program and simulates footage from a live seminar. Print off the workbook .pdf and use your own reading texts - paperback or hardback - with a pocket calculator, and participate as if you are present at a seminar.</p><p><strong><strong>Lectures:</strong></strong></p><ol><li>Introduction</li><li>Measure your reading rate - Part one</li><li>Measure your reading rate - Part two - Technical</li><li>Four poor reading habits &amp; First techniques to improve reading rate - Part one</li><li>Four poor reading habits &amp; First techniques to improve reading rate - Part two</li><li>Twice-as-fast eye exercise &amp; End speed - Part one</li><li>Twice-as-fast eye exercise &amp; End speed - Part two</li><li>Twice-as-fast eye exercise &amp; End speed - Part three</li><li>Self check .......................................................<strong>Wh</strong><strong>at People Say About This Video . . . </strong><em>'I found the Speed Reading video simple yet effective for dramatically increasing reading speed. Initially, it's a matter of breaking old (bad) reading habits so it feels a bit 'foreign' at first, but this phase does not take long to push through. I found myself reading at about 1000 wpm when the subject matter was relatively familiar. </em><em>For more difficult subject matter, speed was around 500 - 600 word per minute - a dramatic improvement on my original speed of 250 - 300 wpm. Skills are easily retained, providing you keep using the techniques.' </em><em><strong> </strong></em><em><strong>Will Swayne, Business owner, Marketing-Results</strong></em></li></ol>", 
    "end_date": null, 
    "title": "Speed Reading: Read Faster, Smarter and Easier", 
    "price": "25.00", 
    "instructors": "Nina Sunday", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550692_3c30_2.jpg", 
    "course_url": "https://www.udemy.com/speed-reading-read-faster-smarter-and-easier/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T03:02:33Z"
}