{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn tricks and techniques to drastically improve your number sense, remember long number sequences and mentally multiply numbers at lightening speed.</p><p><strong>Rid yourself of Math phobia and learn to love and manipulate numbers with this tutorial suitable for all age groups.</strong></p><ul><li>Develop better number sense - How to stop worrying and start loving numbers</li><li>Learn a fast mental way to multiply large numbers,</li><li>A cool way to check your results, mentally</li><li>An amazing method for remembering numbers and much more.</li><li>Learn High Speed Vedic Mathematics </li><li>Techniques to crack exams like SAT, GMAT, GRE, CAT, Bank PO and many more</li></ul><p><strong>Discover Lesser Known but More Powerful Alternatives</strong></p><p>Multiplication is one of the pillars of Arithmetic.</p><p>We multiply numbers when at work, in the classroom or even when thinking of life in general. Interestingly most of us rely on the same technique when multiplying. A technique drilled into our minds as young learners.</p><p>This course will provide you with alternative methods to multiply numbers and improve number sense. Methods that are much faster even when used to solve problems mentally.</p><p>So stop being envious of number crunching Sally and be the change.</p><p><strong>Content and Overview</strong></p><p>I have designed this course to be suitable for all age groups.</p><p>An introductory video will outline the road-map and enumerate reasons to embark on this fascinating journey.</p><p>The next section of the course will introduce you to a few Special Cases that will pique your curiosity and display the power of Vedic Math Techniques.</p><p>We will then raise the bar and see several techniques of rapid multiplication including a fascinating technique for doing mental math and a technique for verifying our results.</p><p>Each lesson is sprinkled by thoughtful quizzes to reinforce concepts as well as the script for each video, just in case.</p><p>So if you are a learner trying to overcome your math phobia or crack an aptitude test or keep those brain cells ticking, then this course is for you.</p><p>If you are a math teacher looking to add a spark to your teaching and more importantly enhance your knowledge base, this course is certainly for you.</p><p>To get the most from this course, the mantra is <strong>practice</strong>, and yes, lots of it.</p>", 
    "end_date": null, 
    "title": "Speed and Mental Math Tricks and Techniques", 
    "price": "20.00", 
    "instructors": "Sanjay Noronha", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518332_4fc0_8.jpg", 
    "course_url": "https://www.udemy.com/speed-math-tricks-and-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T19:31:32Z"
}