{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description:</strong></p>  <p>This is a comprehensive course that offers tips and techniques to overcome common challenges that impede a student’s success with attaining the grades they truly desire..Some of the areas covered in this course include:</p>  <ul><li>Setting Goals</li><li>Organization</li><li>Time Management</li><li>Memory</li><li>Effective Study Techniques</li><li>Tips for Taking Various Types of Tests</li><li>Tips for Writing an Essay</li><li>Guidelines for the Research Paper</li></ul>                <p>As I discuss each portion of this course, students will learn tips and techniques which successful students have applied to maintain their excellent GPA. .By the end of this course, students will be more organized, better managers of their time, and more efficient learners with their application and practice of the memory techniques and other strategies taught in this course.</p>  <p><strong>What are the requirements?</strong></p>  <ul><li>A willingness to hear the information from a different angle with an open mind.</li><li>A willingness to experiment with the different techniques and tips offered.</li><li>Patience and kindness to oneself until new study habits are formed.</li></ul>      <p><strong>What am I going to get from this course?</strong></p>  <ul><li>53 lectures and approximately 2 hours aan45 minutes of content presented in short video segments</li><li>Proven tips and techniques that boost school performance, enhance learning, and improve grades</li><li>Time management skills </li><li>Organization tips </li><li>Teacher support and availability to answer your questions within 48 hours via the Course Dashboard (excluding weekends and holidays)</li></ul>          <p><strong>Who is the target audience?</strong></p>  <ul><li>Middle School students who want to develop excellent study skills in preparation of the increased demands of high school or simply want to improve their grades currently.</li><li>High School students who want to improve their grades and become more effective learners.</li><li>Adults, entering college after a long lapse from graduating high school, who want to learn basic study skills and tips to give them an advantageous start.</li></ul>", 
    "end_date": null, 
    "title": "Supercharge Your Grades", 
    "price": "20.00", 
    "instructors": "Kimberly Schehrer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669878_4d3a_2.jpg", 
    "course_url": "https://www.udemy.com/supercharge-your-grades/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T20:27:18Z"
}