{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The Memory Palace technique, AKA the <em>Method of Loci</em> is a very powerful tool for us mortal humans to learn vast amounts of facts, figures, lists and words that seem impossible. This course guides you to be able to use the Method of Loci by building your own imaginary journey and associating memorable images with each place. </p><p><strong>You don't need to have an amazing memory like Rain Man and you don't need to take hours reciting - you just need the ability to visualise and the willingness to learn!</strong></p><p>We'll actually <em>apply</em> the method by memorising Asia's countries and their capitals in alphabetical order. At the end you'll be able to reel off the countries and their capitals forwards, and often backwards too! You'll know that Azerbaijan's capital is Baku and that South Korea's capital is Seoul - without Googling it! </p><p>We'll look at applying this method to <em>anything</em> you want to memorise in the future, and discuss how creating a memorised list becomes a 'frame' that future learning can be built upon - memorising a structure within a subject makes learning the rest of that subject easier and more interesting.</p><p>I've built this course using pictures and occasional animations to help the memorable visualisations stick in your head easier, and I've provided links to supplementary information should you wish to further your learning both for the geography element and the Method of Loci technique, BUT I've deliberately kept the course quite short in time - I want you to see how quickly you can memorise things and I want you to have more time to go out afterwards and apply your new memorising technique. </p><p>Heres the course outline:</p><ol><li>Introduction</li><li>Discuss the Method of Loci </li><li>Lets create our first Memory Palace journey</li><li>Mapping out our journey (you will need paper and pens)</li><li>Asia - Afghanistan to Indonesia</li><li><strong>Recap</strong></li><li>Asia - Iran to North Korea</li><li><strong>Recap</strong><br></li><li><strong>Test yourself</strong></li><li>Create an additional stage to our Memory Palace journey</li><li>Asia - South Korea to Pakistan</li><li><strong>Recap</strong></li><li><strong>Test yourself</strong></li><li>Asia - Philippines to Saudi Arabia</li><li>Create the last stage to this Memory Palace Journey</li><li>Asia - Singapore to Yemen</li><li><strong>Recap</strong></li><li><strong>Test Yourself</strong></li><li>Using your new memorised information as a frame for learning</li><li>Creating more Memory Palace journeys</li></ol>I can't wait to help you to learn this amazing, powerful technique. It will change your life!", 
    "end_date": null, 
    "title": "The Memory Course", 
    "price": "20.00", 
    "instructors": "Kim Debling", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555294_9ce7_3.jpg", 
    "course_url": "https://www.udemy.com/memorise-asias-countries-and-capitals-with-a-memory-palace/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T11:46:38Z"
}