{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t This course is about learning a meditative process and two muscle testing techniques to shift potentially core limiting beliefs from cellular memory that may be holding you back from connecting to your gifts and talents and taking action with your passion to vivify your dreams.  </p>  <p style=\"\">  \t  You will learn how to shift  subconscious beliefs  so they are congruent with your conscious mind, allowing you to access much more of your divine power to create your life,  </p>  <p style=\"\">  \t Materials included:  professionally created audio, video and written communications  to demonstrate the various techniques and processes.  </p>  <p style=\"\">  \t Each lesson begins with a lecture, supported by a written document and sometimes additionally by a video or audio communication. There is a small quiz for each lecture reinforcing the integrated information.  </p>  <p style=\"\">  \t Once a week,  a live session is held to support you, any questions you have as you embrace this journey of &quot;Transforming Cellular Memory &amp; Vivifying Your Dreams.&quot; The live session is held the same time each week - to be announced.  </p>  <p style=\"\">  \t Course announcements and/or content related information is displayed weekly.  </p>  <p style=\"\">  \t Additionally, questions are reviewed and answered weekly from the questions area.  I encourage peer to peer learning by inviting you to enter introductions and discussions in the Questions area.  </p>  <p style=\"\">  \t Further, I am available for 1 on 1 feedback via email: thetabrenda@gmail.com  </p>  <p style=\"\">  \t This course takes approximately 3-4 weeks to complete. Expect to spend at least 1 hour each day reviewing the content, practicing what you have learned including keeping a daily journal of your process- feelings, thoughts, questions, and reflections.  </p>  <p style=\"\">  \t Who may benefit from taking this course?  </p>  <p style=\"\">  \t Potentially anyone desiring to raise their vibration, activate passion &amp; creativity which may lead to the Soul&#039;s purpose and vivify your dreams.  </p>  <p style=\"\">  \t How does it get any better than that?  </p>", 
    "end_date": null, 
    "title": "Transform Cellular Memory & Vivify Your Dreams", 
    "price": "45.00", 
    "instructors": "Brenda Innes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49414_c61c_5.jpg", 
    "course_url": "https://www.udemy.com/transform-cellular-memory-vivify-your-dreams/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-11T19:37:29Z"
}