{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you frustrated when you forget important things? Do you remember the people you met at the last party you went to? What about those phone numbers you got but didn't have your phone or paper on you to write them down...</p><p>What if you could walk into a room and memorize everyone's full name perfectly the first time you meet them - and their phone numbers &amp; birthdays too! What if you could recall all that information instantly just by thinking of them?</p><p>What if I told you that you could memorize a 30 digit random number in 6 minutes or less and recall it minutes, hours, days, weeks or even months later. Would you believe me? What if you could memorize a long digit number to 50, 100, 1000 digits?</p><p>Be prepared to <strong>learn some of the most powerful memory techniques you've ever discovered</strong> which will help you to accomplish the above and much much more.</p><p>The fact is that <strong>the better your memory capacity and performance are, </strong></p><ul><li><strong>The faster you can learn</strong></li><li><strong>The more money you can make</strong></li><li><strong>The more you can serve the people around you</strong></li><li><strong>The more you can impress new people you meet</strong></li></ul><p><strong> </strong><em>Wouldn't you want that kind of power?</em></p><p><strong>I'll tell you a secret... </strong></p><p><em>You already have it inside of you</em> and this course will show you how to unlock it with powerful exercises and techniques that you will practice and make part of your daily life.</p><p>After this course, you will have permanently upgraded your internal \"software\" to maximize the power of your memory functions in your brain.</p><p><strong>You decide...</strong> you can either take your memory capacity &amp; performance to the next level, or stay where you are and be limited to the memory you have now.<em> Which one will it be?</em></p><p>Take the leap and <strong>click on the button to enroll now</strong> to begin your journey to an infinite memory!</p>", 
    "end_date": null, 
    "title": "Your Infinite Memory", 
    "price": "30.00", 
    "instructors": "Gabriel Both", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545594_55c9.jpg", 
    "course_url": "https://www.udemy.com/your-infinite-memory/", 
    "currency": "USD", 
    "subject_name": [
        "Memory & Study Skills"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T15:45:35Z"
}