{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Habrás comprobado como a diario <strong class=\"redactor-inline-converted\">se ofertan en tu país miles de empleos que exigen conocimientos de SAP</strong>. Aprende ya en profundidad este software partiendo desde cero, y <strong class=\"redactor-inline-converted\">sin requisitos</strong> previos conseguirás el máximo nivel de aprendizaje que te permitirá darle un giro a tu carrera profesional.\n\n  </p>\n\n\n\n<p>Además del enorme temario que aprenderás contarás con la <strong class=\"redactor-inline-converted\">tutoría de Pedro Jiménez, Instructor SAP c</strong>on más de 15 años de experiencia profesional y más de 3.000 alumnos formados en esta tecnología.\n\n  </p>\n\n\n\n<p>Sin requisitos previos podrás capacitarte a n<strong class=\"redactor-inline-converted\">ivel usuario experto y consultor</strong> con los siguientes contenidos:\n\n  </p>\n\n\n\n<ul><li>Más de 130 clases con los procesos prácticos que realizan las empresas que tienen implementado SAP.</li><li>La documentación oficial SAP.</li><li>Más de 100 fichas técnicas paso por paso de cada clase.</li><li>20 Examenes test de comprobación.</li><li>Tutoría Q&amp;A con el instructor.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>El acceso al curso es de por vida y podrás realizarlo con el ritmo que se adecue a tu trabajo o estudios, <strong class=\"redactor-inline-converted\">sin fechas límites</strong>. Para que tengas una idea, con un ritmo normal (2 horas al día) puedes en 2 meses completar el Curso y convertirte en Consultor SAP MM\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>Más de 2.400 participantes en 50 paises ya lo han realizado, aprovecha esta oportunidad, impulsa tu carrera profesional y accede a empleos tecnológicos de elevados salarios.</strong></p>", 
    "end_date": null, 
    "title": "Curso Completo Consultor SAP MM desde Cero", 
    "price": "50.00", 
    "instructors": "Pedro Jiménez", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177906_9335_3.jpg", 
    "course_url": "https://www.udemy.com/consultorsapmm/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T16:23:26Z"
}