{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t    Starting with what if often referred to as &quot;<strong style=\"\">Mini SAP</strong>&quot; the trial systems were fairly easy to install but as the commercial SAP systems have grown in complexity so too have the trial systems. As a result the trial systems installation process has become more complicated and tricky to master.  </p>  <p style=\"\">  \t    This course is a complete Step by Step guide showing you how to install the SAP NetWeaver Application Server ABAP 7.03 Trial software.  </p>  <p style=\"\">  \t    Each video shows you everything you need to successfully install your own SAP system.  </p>  <p style=\"\">  \t    You will learn:  </p>  <ul style=\"\">  \t<li style=\"\">Create a virtual machine (VM) using Oracle&#039;s VirtualBox.</li>  \t<li style=\"\">Where to download the correct Microsoft Operating Systems for your SAP system.</li>  \t<li style=\"\">What SAP software to download and discuss the system pre-requisites.</li>  \t<li style=\"\">How to backup your SAP VM installation.</li>  \t<li style=\"\">Download and install the correct Java VM.</li>  \t<li style=\"\">How to start the SAP install process for a successful install.</li>  \t<li style=\"\">How to start and stop the SAP system Instance.</li>  \t<li style=\"\">Install The SAP GUI.</li>  \t<li style=\"\">How to request a License Key using transaction SLICENSE.</li>  \t<li style=\"\">How to install the Developer Key.</li>  </ul>  <p style=\"\">  \t    Once you have completed all the steps, you will have a system that you can use to learn basic SAP system navigation, practice ABAP coding, import and export transports, create WebDynpro applications, connect with the Eclipse development environment and much much more.  </p>", 
    "end_date": null, 
    "title": "How To Install Your Own SAP Trial System Free", 
    "price": "20.00", 
    "instructors": "Peter Moxon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140976_b2e7_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-install-your-own-sap-trial-system-free/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-02T18:25:41Z"
}