{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong>Join over 1200+ students in my SAP Video Training courses.</strong></p>  <p>  \tThis Financial Accounting course is a <strong><em>'must have'</em></strong> for everyone involved with SAP Financial Accounting. If you are new to SAP, a consultant or developer you need to understand how the SAP Finance System works. This course will teach you exactly that.  </p>  <p>  \t <strong>Once you get started you will:</strong>  </p>  <ul>  \t<li>Understand How Sap Financial Accounting Works.</li>  \t<li>Master The Basics Of Sap Financial Accounting.</li>  \t<li>Learn About Important Financial Accounting Terms.</li>  \t<li>Realize The Importance Of The General Ledger And Learn About It's Features.</li>  \t<li>Learn About Sub-Ledgers, Accounts Receivable/Payable, Asset Accounting.</li>  \t<li>Overview Of How The Finance Module Integrates With Other Sap Modules.</li>  \t<li>Recognize The Organizational Elements Of R/3 And Describe The Basic Settings.</li>  \t<li>Be Able To Classify And Reconcile R/3 Documents With The Original Documents.</li>  \t<li>Learn About Opening And Closing Posting Periods.</li>  \t<li>Assign Posting Authorizations To Users.</li>  </ul>  <p>  \t           SAP is the most popular enterprise business system used by the biggest organisations in the world to help run their companies.  </p>  <p>  \t           Peter Moxon introduces you to the most important and fundamental aspects of any SAP Financial Accounting system.  </p>  <p>  \t           This training course explains SAP Financial Accounting from the ground up to ensure you learn how the finance system works and how it integrates with all the other major SAP modules.  </p>  <p>  \t           This course not only gives you an a thorough insight into how the SAP Financial Accounting systems works but is delivered in Pete's unique style that guarantees everyone who takes the course will have absolutely no problem in understanding all the topics discussed.  </p>  <p>  \t <strong>Guaranteed! <em>This is 'the' easiest way to learn and get up to speed with SAP Finance.</em></strong>  </p>  <p>  \t           Whether you are a new SAP user, Business Analyst, Project Manager or a C-Level executive, this course is designed to be your guide and introduction to SAP Financial Accounting systems.  </p>", 
    "end_date": null, 
    "title": "Learn SAP Financial Accounting - Online Training", 
    "price": "20.00", 
    "instructors": "Peter Moxon", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94448_5008_5.jpg", 
    "course_url": "https://www.udemy.com/sap-financial-accounting-overview/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T10:18:33Z"
}