{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t              The web, as well as Enterprise IT, suffers from an explosion in the volume of data. With this growing volume of data, expertise in a reporting tool is in demand. As a result, both, experienced professionals as well as newbies get a lot of new opportunities.  </p>  <p style=\"\">  \t  I have often landed on some very lucrative and long term contracts due to a certification in a lesser known tool. SAP WebI is one such tool, that is fast gaining popularity as the preferred reporting tool in a lot of organizations.  </p>  <p style=\"\">  \t  In addition, a job in report development, gives you access to data and business experts. This results in opportunity to enhance knowledge in niche business areas and the expertise in business processes.  </p>  <p style=\"\">  \t<strong style=\"\">This course will help you get started with SAP Web Intelligence</strong>. We work closely with users to answer their questions. After completing the course, you will receive additional material including:  </p>  <p style=\"\">  \t           - Quizzes to test your knowledge.  </p>  <p style=\"\">  \t           - Report development and analysis exercises for hands on practice.  </p>  <p style=\"\">  \t           - Group Q&#039;nA sessions.  </p>  <p style=\"\">  \t           - Help you to get access to a live Web Intelligence environment.  </p>  <p style=\"\">  \t          In the real world report development follows four primary stages/steps. The course is structured along those four steps:  </p>  <p style=\"\">  \t          1. Data Access  </p>  <p style=\"\">  \t          2. Data Analysis  </p>  <p style=\"\">  \t          3. Report Formatting  </p>  <p style=\"\">  \t          4. Publishing  </p>  <p style=\"\">  \t         Good Luck and touch base with our instructors for support and a more interactive training experience.  </p>", 
    "end_date": null, 
    "title": "Learn SAP WebI reporting tool: A Simple Fast-Paced Training ", 
    "price": "40.00", 
    "instructors": "Abhi Ananthram", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/197196_155e_3.jpg", 
    "course_url": "https://www.udemy.com/sapwebi101/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-11T03:21:06Z"
}