{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong>You can now join 200+ students in my SAP ABAP Objects Programming Video course.</strong></p>  <p>  \t <strong><em>SAP ABAP OBJECTS </em></strong>is the most important ABAP enhancement that all ABAP Programmers need to master. Developed by SAP and used by the largest organisations in the world to run their business systems.  </p>  <p>  \t                              In this advanced SAP ABAP Objects video training course, Peter Moxon introduces you to the fundamental Object Oriented programming techniques ABAP developers need to understand to further their development careers and maintain pace with the evolution of SAP development technology.  </p>  <p>  \t                              You will learn by watching the easy to understand lectures and live coding sessions. Peter explains step by step how to create and modify ABAP Objects code and how to integrate it with procedural ABAP coding techniques.  </p>  <p>  \t                              You will learn SAP ABAP Objects from the ground up, building on your procedural coding knowledge to ensure you have a thorough grasp of the how best to make use of OO programming techniques in SAP enterprise systems. You will slowly work through all the key aspects of ABAP Objects such as attributes, methods, class definitions and visibility scope all the way through to more advanced concepts such as inheritance, polymorphism and interfaces.  </p>  <p>  \t                              This training course not only gives you an a thorough insight into how SAP ABAP Objects works but is delivered in such a way that everyone who takes the course will have absolutely no problem in understanding all the topics discussed.  </p>  <p style=\"text-align: center;\">  \t                If you are a seasoned ABAP Programmer who needs to learn ABAP OBJECTS<br>  \t                            This course is for you!  </p>  <p>  \t                              This course makes it easy to learn SAP ABAP OBJECTS, you will be writing and testing out you own code in no time. So not to bog you down with theory this course focuses on learning through a hands-on approach and is packed full of practical step by step examples so that you are creating code from day one.  </p>  <p>  \t                              This course is <em>your</em> guide to rapid, real-world SAP Object Oriented software development.  </p>  <p>  \t                              Most SAP courses cost thousands of dollars and only allow you to scratch the surface of what it can do. While an SAP ABAP training curriculum can easy take over 50 days to complete studying full-time with SAP themselves nothing comes close to this video based course delivered by Peter Moxon who has been working with SAP ABAP and SAP BW for over 13 years.  </p>  <p>  \t                              By the completion of this online training course, you will be fully versed, and capable of working with and creating your own ABAP Objected Oriented programs in a commercial Environment.  </p>", 
    "end_date": null, 
    "title": "Learn SAP ABAP Objects - 2014 - Online Training Course", 
    "price": "20.00", 
    "instructors": "Peter Moxon", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86390_fd29_7.jpg", 
    "course_url": "https://www.udemy.com/abap-objects/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-31T11:44:57Z"
}