{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong>Join over 600+ students in this SAP Beginner Video Training course.</strong></p>  <p>  \t<strong><em>SAP </em></strong>is the most popular enterprise business system used by the biggest organisations in the world to help run their companies.  </p>  <p>  \t      This introductory course is designed for SAP beginners and will teach you the basics of the SAP system. After you have completed this course you will be comfortable working with the most commonly-used functions and features of SAP.  </p>  <p>  \t      Peter Moxon introduces you to the fundamental skills needed to understand how SAP systems work. In the course you will:  </p>  <ul>  \t<li>Learn the basics of the SAP system with clear video demonstrations</li>  \t<li>Learn how to navigate, search, and get help</li>  \t<li>Understand how to run reports and export the data to Microsoft Excel</li>  \t<li>You will get a thorough Overview of the various core modules in SAP</li>  \t<li>Learn how to customise the interface to your own liking</li>  \t<li>Work with master data and post transactions</li>  \t<li>Apply advanced tips such as Pre-Populating fields to save you time and effort with Parameter ID's.</li>  \t<li>Work with report layouts and drill-down</li>  \t<li>Download SAP reports</li>  \t<li>Understand common icons in SAP</li>  \t<li>Work with multiple sessions</li>  \t<li>Customise your local layout and desktop shortcuts</li>  </ul>  <p>  \t      You will learn by watching the instructor actually perform the operation he is instructing on, as he explains step by step how to use and navigate an SAP system.  </p>  <p>  \t      The training explains SAP from the ground up starting with the absolute basics to ensure you have a thorough grasp of the how best to use SAP enterprise systems.  </p>  <p>  \t      He slowly works you up through learning the key aspects of SAP systems introducing the Graphical User Interface and covers topics such as setting up favourite transactions, executing transaction code directly and saving your own screen layout for future use.  </p>  <p>  \t      This course not only gives you an a thorough insight into how the SAP work but is delivered in such a way that everyone who takes the course will have absolutely no problem in understanding all the topics discussed.  </p>  <p>  \t      This course makes it so easy to learn SAP, you will running transactions and analysing report data in no time.  </p>  <p>  \t      So not to bog you down with theory this course focuses on learning through a hands-on approach and is packed full of practical step by step examples so that you are using SAP from day one.  </p>  <p>  \t      Whether you are a new SAP user, Business Analyst, Project Manager or a C-Level executive, this SAP course is designed to be your guide and introduction to SAP systems.  </p>", 
    "end_date": null, 
    "title": "Learn SAP Course - Online Beginner Training", 
    "price": "20.00", 
    "instructors": "Peter Moxon", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41305_701b_8.jpg", 
    "course_url": "https://www.udemy.com/learn-sap/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-12T11:45:18Z"
}