{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>SAP es sin duda el líder indiscutible en la industria del software empresarial.</p><p>Con mucha diferencia respecto a sus competidores, se ha convertido en un estándar en las grandes empresas.</p><p>Actualmente (2015):</p><ul style=\"\"><li>está implantando en más de 291,000 empresas en 190 países.</li><li>Es utilizado por el 87% de las empresas pertenecientes a la lista Forbes Global 2000.</li><li>El 98% de las marcas más valoradas confían en él para gestionar sus procesos.</li><li>Sus clientes producen entre otros muchos productos:<ul style=\"\"><li>el 78% de la comida mundial</li></ul><ul style=\"\"><li>el 82% de los dispositivos médicos mundiales</li></ul></li></ul><p>Si todavía no te has formado en este ERP. ¿A qué esperas?</p><p><strong style=\"\">Aprende todos los conceptos clave de SAP con este curso.</strong></p><ul style=\"\"><li>Qué es SAP</li><li>Qué módulos y funcionalidad incluye</li><li>Cómo se accede y navega en este sistema</li><li>Qué tipos diferentes de datos gestiona</li><li>Qué opciones para Informes ofrece</li><li>Qué opciones de personalización se pueden utilizar</li></ul><p><strong style=\"\">Demuestra en tus entrevistas de trabajo y en tu CV que sabes de lo que estás hablando.</strong></p><p>Aunque SAP es tan extenso que no es posible conocerlo en su totalidad. Sí es posible conocer sus conceptos más importantes y de esta forma facilitar su posterior especialización en el módulo que te interese.</p><p>Además, si estás a la búsqueda de empleo, el conocimiento de este curso te proporcionará una gran ventaja respecto al resto de candidatos. Ya que demostrará que te has interesado proactivamente por mejorar tu formación en un aspecto clave.</p><p><strong style=\"\">Contenido</strong></p><p>Este curso comienza con una definición de los conceptos generales.</p><p>A continuación, mostrará demos en un sistema de prueba, donde se podrá ver de forma práctica cómo se interactúa con el sistema. Facilitando de esta forma la comprensión.</p><p>Por último se verá resumida la diferente funcionalidad de cada módulo, así como las posibilidades para generar informes y para personalizaciones del estándar.</p><strong style=\"\"></strong>", 
    "end_date": null, 
    "title": "Qué es SAP - Curso básico de introducción", 
    "price": "20.00", 
    "instructors": "Ricardo Naya Arboleya", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542160_13ce_4.jpg", 
    "course_url": "https://www.udemy.com/que-es-sap-curso-basico-de-introduccion/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T11:58:04Z"
}