{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><strong><em>Updates:</em></strong></p><p><strong><em>Get your ideal job. Grab that promotion. Stand out by learning in-demand SAP tech skills from the best.</em></strong></p><p><strong><em>Course fully updated for 2015.</em></strong></p><p><strong><em>This course now includes</em></strong><strong><em> pages of</em></strong><strong><em> </em></strong><strong><em>7 </em></strong><strong><em>further reading</em></strong><strong><em>s plus 7 bonus documents</em></strong><strong><em>, and appendices for SAP niches - enabling you to boost SAP career.</em></strong></p><p>Check out the latest amazing reviews:</p><p><strong>\"Overall it is a very good introduction to HANA and I do recommend it.\"</strong></p><p><strong>\"This course is a good start for those who are curious of what is SAP HANA and how you would benefit from this kind of technology. For those who are asking themselves whether to learn about in memory computing or not, I recommend you to take this opportunity of learning. The lectures are very informative.\"</strong></p><p>SAP is a multinational software corporation that makes enterprise software to manage business operations. More than <strong>80% of fortune 500 </strong>companies have successfully implemented SAP products. <strong>SAP was named the most valuable brand in Europe with a value of over 33 billion euros in 2015.</strong></p><p>SAP HANA is a hybrid in-memory database, which is supporting both row and column data stored, and data saves in memory and no longer on a hard disk,</p><p>According to a pay scale study, an SAP consultant earns an average salary of <strong>$1</strong><strong>2</strong><strong>0,000 per year!</strong></p><p>Welcome to the SAP HANA 101.</p><p>SAP HANA 101 is an introductory course for SAP beginners seeking to improve their HANA application skills. Throughout the course we will cover techniques used by consulting partnerships throughout the world. We're about to start an exciting journey into SAP HANA, and we even include further readings and appendices for SAP niches - enabling you to boost your SAP career.</p><p>SAP 101 topics are covered with a mixture of video lectures and workbooks:</p> <ul><li>Overview</li> <li>HANA Studio</li> <li>Architecture</li> <li>Modeling</li> <li>Data Provisioning</li> <li>Reporting</li></ul> <p>In this course, you'll stretch your SAP business knowledge, HANA technical skills and entrepreneur thinking.</p><p><strong>Every minute you delay is actually</strong><strong> </strong><strong>COSTING you money.</strong></p><p><strong>Enroll today. We'll help you succeed and land your dream job.</strong></p>", 
    "end_date": null, 
    "title": "SAP HANA - Boost Performance Through In-memory Computing", 
    "price": "20.00", 
    "instructors": "SAP BRIEF, ERPer Academy", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449212_bf07_4.jpg", 
    "course_url": "https://www.udemy.com/sap-hana-training/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T07:53:20Z"
}