{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>SAP Plant Maintenance – A mix of hands on video lessons with detail script with step by step screen shots in each lesson. Covering the Organization Structure, Master Data, Business Process Transaction and Configuration guidelines for SAP Plant Maintenance. </p><p>By taking PM course, it is will help you enhance your career by learning one of specialized logistics module. Become a super user in plant maintenance or enhance your consulting skills by learning the SAP PM. </p><p>You will learn organization structure setup needed for Plant Maintenance, the different business process and SAP transactions. The integration of PM with MM, FICO, PP and QM. </p><ul style=\"\"><li>43 lectures including 22 video lectures with about 4 hours of video content</li><li>Each course includes a step by step guide with screen shots</li><li>By learning this course, you will able to confidently work on SAP Plant Maintenance by having an understanding of the different aspects of the module</li><li>The course provides a number of techniques to find various tables and transactions in SAP, which will be useful in other SAP modules as well.</li><li>The course will enable you to enhance your ability by providing this expertise in your work place.</li><li>You should be able to show your expertise in your work place to become a key / super user, or show your skills in a implementation project.</li></ul>", 
    "end_date": null, 
    "title": "SAP Plant Maintenance Training", 
    "price": "40.00", 
    "instructors": "Farrukh Zaheer", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486604_cfcd_3.jpg", 
    "course_url": "https://www.udemy.com/sap-plant-maintenance-training/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-26T10:11:30Z"
}