{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t                  One of the most significant thing in a real project is positioning the proper product according to needs of your companies.  </p>  <p style=\"\">  \t              Therefore during this course you will firstly learn fundamental concepts and discrepancies of Business Objects products.  </p>  <p style=\"\">  \t         Afterwards you will learn the basics and most-commonly used features of SAP Business Objects Web Intelligence.  </p>  <p style=\"\">  \t        In this course you will :  </p>  <p style=\"\">  \t      -Learn how to create a web Intelligence document and share your analysis with other users<br style=\"\">  \t      -Learn how to organize ,manage and distribute documents using BI Launch Pad<br style=\"\">  \t      -Learn how to run existing reports and export the data to text files<br style=\"\">  \t      -Describe semantic layer of SAP Business Objects<br style=\"\">  \t      -Retrieve and collect data from different data sources<br style=\"\">  \t      -Learn advanced tips&amp;tricks of reporting layer<br style=\"\">  \t      -Design sample reports which commonly used in real projects  </p>  <p style=\"\">  \t    This course focuses on learning through  step by step examples rather than bogging you down with theory.  </p>  <p style=\"\">  \t  FOOTNOTE !  </p>  <p style=\"\">  \t The mainly important achievement of this course is not only will we specify  reporting demands that looks like real project business questions we will also answer these questions by using advanced reporting techniques with practical examples.  </p>", 
    "end_date": null, 
    "title": "SAP BI /SAP Business Objects Web Intelligence", 
    "price": "30.00", 
    "instructors": "Esra Ekiz", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370898_dddd_12.jpg", 
    "course_url": "https://www.udemy.com/sap-business-objects-web-intelligence/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T19:14:19Z"
}