{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Want to improve your knowledge in SAP's Supply Chain Logistics Execution? What that role in SAP? Then this is the course for you.  </p><p>With today's growing complexity in the area of Supply Chain Logistics, having both expertise and knowledge is essential in today's job marketplace. </p><p>That is why I am excited about this course. This course covers BOTH the business context of process and how it is to be configured in SAP R/3, across the different modules in SAP. No other course will cover all of these SAP modules in this kind of scope. </p><p><span></span>The course will cover Supply Chain Logistic Execution topics such as : </p><ul><li>Inbound deliveries, and when it the right time to use them</li><li>Using Sales orders to control the logistic process</li><li>Using the different rules for \"Available to Promise\"</li><li>How to create and use Outbound deliveries effectively. </li><li>Picking strategies and how they are executed in SAP</li><li>When to use packing.</li><li>Picking in SAP Warehouse Management</li><li>Packing in the SAP Handling Unit Management </li><li>What are shipments and how to use them in SAP</li><li>Key Performance Indicators, what are they and how to design them</li><li>Using Stock Transport Orders</li><li>The process of SAP Subcontracting, </li></ul><p>This covers the Sales and Distribution (SD), Material Management (MM) , Purchasing, Handling Unit Management and Warehouse Management (WM) modules in SAP.  </p><p>It is not just SAP details that this course will be covering, the course also covers </p><ul><li>The process from the perspective of the business and users.</li><li>The integration and context of Supply Chain Management .</li><li>How to run these process in SAP and why do we execute them in a particular way.</li><li>SAP \"Best Practice\".<span></span></li></ul>", 
    "end_date": null, 
    "title": "SAP : Supply Chain Logistics in R/3", 
    "price": "50.00", 
    "instructors": "Abdul Maulud", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475250_064b_4.jpg", 
    "course_url": "https://www.udemy.com/sap-supply-chain-logistics-in-r3/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T19:18:58Z"
}