{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>This course is about SAP Business Planning and consolidation (BPC), that gives an overview about BPC and how it functions. It is helpful for a BPC User or BPC Consultant for planning, Budgeting, Forecasting &amp; Consolidation.</p><p>On a single stretch you can complete the course in 2.5 hours.<br></p><p>Course covers Terminologies of BPC, basics of SAP, Reporting and overview of BPC.</p><p>In this SAP BPC video training course, Sudheer Babu introduces you to the fundamental skills needed to understand SAP BPC and start creating your own BPC Models and Reports.</p><p>This training course not only gives you a thorough insight into how the SAP BPC but is delivered in such a way that everyone who takes the course will have absolutely no problem in understanding all the topics discussed.</p><p>This course makes it so easy to learn SAP BPC, you will be developing models and testing out you own in no time. So not to bog you down with theory this course focuses on learning through a hands-on approach and is packed full of practical step by step examples so that you can learn easily from basics.</p><p>Whether you're new to SAP or just new to BPC, this SAP BPC course is your guide to rapid, real-world enterprise Tools.</p><p>Most SAP courses cost thousands of dollars and only allow you to scratch the surface of what it can do. </p><p>While an SAP BPC training curriculum can easy take over 50 days to complete studying full-time with SAP themselves nothing comes close to this video based course delivered by Sudheer Babu who has been working with SAP BPC and SAP BW for Several years.</p><p>By the completion of this online training course, you will be fully versed, and capable of working with and creating your own BPC Models and reporting in a commercial Environment.</p>", 
    "end_date": null, 
    "title": "SAP Business Planning and Consolidation(SAP BPC) 10.1  ", 
    "price": "20.00", 
    "instructors": "Sudheer Babu", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706902_f209_5.jpg", 
    "course_url": "https://www.udemy.com/sap-business-planning-and-consolidationsap-bpc-101/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-26T11:05:51Z"
}