{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Perfect Resources exceptional team of expertise, experience and education will help clients optimize MAXIMUM SAP HCM system technology and benefits.  Perfect Resources specializes in SAP HCM implementations and partners with large and mid-to-small sized clients to execute superior SAP products, on time and within budget.\n\n  </p>\n\n<p>SAP HCM End user training covers processes of the SAP HCM modules like organization management, personnel administration.  You will also learn how to navigate within the SAP HCM system and be an expert in executing standard reports, creating variants and run reports in background.\n\n  </p>\n\n<p><strong>SAP HCM made easy and helping our clients through learning and earning</strong>\n\n  </p>\n\n<ul><li>This course is for HR Generalist, Specialist who will      be managing data in the SAP HCM system\n\n</li><li>Step by step instruction on each process\n\n</li><li>After you complete this course, you will understand how      to navigate in SAP, maintain employee data, maintain organization data,      execute standard reports and learn transactions to execute certain      processes in the SAP HCM system.\n\n</li></ul>\n\n<p><strong>Take the first step to knowledge with us</strong>\n\n  </p>\n\n<p>All medium to large size companies have an ERP system to maintain their employee master data.  SAP is the # 1 ERP system in the world.  Learn the processes of the SAP HCM system and impress your employer by showing off your SAP HCM skills.\n\n  </p>\n\n<p>We define SAP in a clear and easy way to learn at your own pace.  Perfect Resources has 20+ years of HR experience and has been part of SAP HCM implementations.  This is a self-paced learning with captions and is voice enabled.  You will learn all the processes built in short videos that we help our clients every day.  SAP HCM End User training is an excellent training for those looking to work in the corporate world as a HR Generalist or HR Analyst entering and maintaining data in the SAP HCM system.</p>", 
    "end_date": null, 
    "title": "SAP HR/HCM training for beginners", 
    "price": "20.00", 
    "instructors": "Stephen Sequeira", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597568_6bdb_2.jpg", 
    "course_url": "https://www.udemy.com/sap-hcm-end-user-training/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T18:41:32Z"
}