{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>In a SAP Implementation project, in realization phase , there are several steps to do ,in order to fulfill customer's need , two of them are customization and personalization.<br>With  customization and personalization the SAP Standard Programs will works as we expect,<br>But if the customization and personalization do not fulfill customer's need , we have to do enhancement to SAP Standard Program.</p><p><br>What is enhancement ? enhancement in SAP is adding or modifying the logic of SAP standard program  without modifying it,  enhancement consist of customer exit , Business transaction event (BTE) and Business add-ins (BADI). And if the enhancement is not enough , we can do modification .</p><p><br> What is modification ?, Modification in SAP is adding or modifying the logic of standard program by modifying SAP standard object. Actually the modifications to sap standard object is not recommended, but there are several modification that is allowed by SAP . one of them is user exit . And if the modification to sap standard object is not enough and there is no standard program to fulfill customers need, we can develop new z program or we usually say customer development .</p><p><br>In this tutorial we not only learn about the theory of enhancement &amp; modification in SAP , but we also do real enhancement and modification to sap standard program such as adding screen exit in SAP Standard Purchase Order, Modifying the logic of SD Sales Order programs, adding fields to accounting document and so on .<br>OK, Enjoy the tutorial .<br></p>", 
    "end_date": null, 
    "title": "SAP ABAP : Enhancement & Modification to SAP Standard", 
    "price": "20.00", 
    "instructors": "Lukman Hakim", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348900_d4bd_2.jpg", 
    "course_url": "https://www.udemy.com/sap-abap-enhancement-modification/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T02:07:53Z"
}