{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>El módulo de Planificación de la Producción de SAP permite <strong style=\"\">planificar tanto la Fabricación como el Aprovisionamiento Externo o Compras.</strong></p><p>En este curso, el estudiante adquirirá un <strong style=\"\">entendimiento de todos los Datos Maestros involucrados</strong> en este proceso y de cómo <strong style=\"\">lanzar la Planificación de Necesidades o MRP</strong>.</p><p>Todas las lecciones contienen una <strong style=\"\">introducción teórica para entender el concepto</strong><strong style=\"\"> y</strong> una <strong style=\"\">demostración en el sistema</strong>, para afianzar el conocimiento de una manera práctica.</p><p>Para una mayor comprensión se ha creado un <strong style=\"\">caso práctico</strong> donde de una manera muy simple se simulará la p<strong style=\"\">lanificación de la fabricación de una bicicleta en SAP</strong>.</p><p>Después de una introducción y una visión general, en la segunda sección se verán todos los Datos Maestros involucrados. A continuación, cómo se crea la demanda, en especial las Necesidades Primarias. Y finalmente se verá cómo ejecutar el MRP y una demo en que se analiza el resultado.</p><p>Este curso permitirá a los alumnos adquirir un <strong style=\"\">conocimiento de lo que este módulo ofrece y de cómo configurar una demo básica.</strong></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "SAP PP - Planificación de la Producción", 
    "price": "20.00", 
    "instructors": "Ricardo Naya Arboleya", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493046_7b1e_2.jpg", 
    "course_url": "https://www.udemy.com/sap-pp-planificacion-de-la-produccion/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T06:12:34Z"
}