{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>Welcome to <strong>SAP Fiori Essentials</strong>. This course is for beginners looking to improve their SAP Fiori skills and stand from the crowd. Land your dream job or qualify for a promotion.</p><p>SAP is a multinational software corporation that makes enterprise software to manage business operations. More than <strong>80% of fortune 500 companies</strong> have successfully implemented SAP products. <strong>SAP was named the most valuable brand in Europe with a value of over 33 billion euros in 2015.</strong></p><p>Reviews:</p><p><strong>\"First course I have taken. A good hint is to take notes as you go along and review everyday to keep pace.\"</strong></p><p><strong>\"Really great course. Enjoyable to take, Simon did a great job of explaining the concepts and then giving demos, quizzes and practice. The course really brought together various threads around Fiori for me.\"</strong></p><p>Fiori is a beautiful Italian flower, that implies the ambitions of SAP on user experiences. Since it is a quite new, the needs for Fiori consultants are really high, which I bet this course is an excellent option to boost your career.</p><p>SAP consultants are in high demand and earn <strong>$120,000</strong> a year on average.</p><p>Explore SAP Product Portfolio is a beginners course that will guide you through the techniques and knowledge used by SAP consultants worldwide.</p><p>The course is taught through a mix of video and workbooks:</p><ul><li>Fiori Overview</li><li>Architecture</li><li>Installing Fiori</li><li>Configuring Fiori</li><li>Fiori Launchpad</li><li>Fiori Client</li><li>Developing Fiori Apps</li></ul><p>We've fully updated the course for 2015 and now include:</p><ul><li><strong>2 hours of HD video training including lectures and quizzes</strong></li><li><strong>7 additional readings and supplemental material for SAP niches</strong></li><li><strong>10+ 5 star reviews in just a week</strong></li><li><strong>30 day money back guaranteed</strong></li></ul><p>The course will help you think like an entrepreneur and expand your business knowledge and technical proficiency.</p><p>We'll be with you every step of your SAP career with lifetime support.</p><p><strong>What's holding you back from reaching your job potential? Enroll today and put your SAP career on a fast track.</strong></p>", 
    "end_date": null, 
    "title": "SAP Fiori - Build Your SAP Fiori Foundation", 
    "price": "20.00", 
    "instructors": "SAP BRIEF, ERPer Academy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554964_1c79_2.jpg", 
    "course_url": "https://www.udemy.com/sap-fiori/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T01:31:05Z"
}