{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>SAP is a multinational software corporation that makes enterprise software to manage business operations. More than <strong>80% of fortune 500 companies</strong> have successfully implemented SAP products. SAP was named the most valuable brand in Europe with a value of <strong>over 33 billion euros</strong> in 2015.</p>    <p>According to pay scale study, an SAP consultant earns an average salary of <strong>$120000</strong> per year!</p>    <p><strong>SAP Enterprise Resource Planning Roadmap</strong> is to show you how to explain SAP enterprise resource planning more efficiently. Most SAP ERP users are under-utilizing it because they're not aware of the many key concepts and techniques that they could be using.</p>    <p>Whether you need to learn some tips to boost your daily efficiency, develop a basic understanding in a flash, think like a pro user to ace your job interview, or just learn the top rules that every SAP ERP users should know, you can save time by learning the tips in this course.</p>    <p>In this course, Simon Richardson reveals tips and guides for senior executives, managers, business users and project teams to understand the business aspects of SAP ERP.</p>    <p>Topics include:</p>  <ul><li>Introduction</li><li>Understanding SAP Basics</li><li>Exploring Daily Productivity Boosters</li><li>Working with Logistics</li><li>Getting Started with Sales and Distribution</li><li>Overview of Materials Management</li><li>Knowing How to Explain Production Planning</li><li>Introducing Plant Maintenance</li><li>Researching Quality Management</li><li>Learning Financials</li><li>Understanding Human Capital Management</li><li>Exploring Project System</li></ul><p><strong>Enroll now, we'll help you leverage powerful ERP tech for using tricks and tips to take your SAP career to the next level.</strong></p>", 
    "end_date": null, 
    "title": "SAP ERP Roadmap: Business, Capabilities, and User Guide", 
    "price": "20.00", 
    "instructors": "SAP BRIEF", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636468_0d6b_2.jpg", 
    "course_url": "https://www.udemy.com/sap-enterprise-resource-planning/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-10T06:53:32Z"
}