{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t<strong><em>Updates:</em></strong>  </p>  <p>  \t<strong><em>Get that ideal SAP Consultant job. Grab that promotion. Stand out by learning in-demand SAP tech skills from the best.</em></strong>  </p>  <p>  \t<strong><em>Course fully updated for 2015!</em></strong>  </p>  <p>  \t<strong><em>FULL PROJECT</em></strong><strong><em>. </em></strong><strong><em>REAL BUSINESS</em></strong><strong><em>. CONCISE STRUCTURE.</em></strong></p>  <p>  \t<strong><em>This course now includes </em></strong><strong><em>real life sample</em></strong><strong><em>, further reading, and appendix to SAP niches - enabling you to boost SAP career.</em></strong>  </p><p><strong>Reviews:</strong></p><p><strong>\"This is one of the best courses I have come across. The concepts are explained with realistic examples, all of which start with the basic covering.\"</strong></p><p><strong>\"At the time I didn't know what to expect because I was a complete SAP rookie, I just wanted to learn something new and SAP Project sounded like something I would end up liking and applying later. And now I realize this course has helped me understand both SAP implementation processes and project methodology, nicely structured, nicely told.\"</strong></p><p>SAP is a multinational software corporation that makes enterprise software to manage business operations. More than <strong>80% of fortune 500 companies</strong> have successfully implemented SAP products. <strong>SAP was named the most valuable brand in Europe with a value of over 33 billion euros in 2015.</strong></p><p>Implementing SAP is a ton of work, we will help you learn potential innovations at every step along the way. We will teach you how to implement SAP in a systematic way.</p>  <p>According to pay scale study, an SAP application consultant earns an average salary of <strong>$120000 per year!</strong><strong></strong></p>  <p>  \t                      Welcome to the #1 SAP project training on the Udemy.  </p>  <p>  \t                      SAP Project 101 is the introduction to SAP project for zero-prior-experience audience. Our online training is built in partnership with SAPBRIEF and ERPer Academy, and instructed by senior ERP consultants.  </p>  <p>  \t                      SAP Project 101 topics are covered with a mixture of video lectures and workbooks:  </p>  <p>Introduction and Course Outline  </p>  <ul><li>Getting Started with SAP, ERP, SAP ERP Implementation and More!</li><li>Master Your Project Management Skills - Project Management Essentials</li><li>Phase 1 - Project Preparation</li><li>Phase 2 - Business Blueprint</li><li>Phase 3 – Realization</li><li>Phase 4 - Final Preparation</li><li>Phase 5 - Golive Support</li></ul>          <p>  \t                      You'll stretch your SAP implementation expertise, SAP business functional knowledge, SAP technical skills and entrepreneur thinking.  </p>  <p>  \t<strong>Every minute you delay is actually COSTING you money.</strong>  </p>  <p>  \t<strong>Enroll today, we'll help you succeed and land your dream job.</strong>  </p>", 
    "end_date": null, 
    "title": "SAP Project - A Step-by-step SAP Implementation Guide", 
    "price": "20.00", 
    "instructors": "SAP BRIEF, ERPer Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350526_5bd3_3.jpg", 
    "course_url": "https://www.udemy.com/sap-project/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T06:17:37Z"
}