{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t       World’s Leading Provider of Business Management Software.,Established in 1972. Headquarters in Walldorf , Germany with 82000 Customers run SAP in 120 countries. Addressing business needs of organizations ranging from Fortune 500 Global Organizations to Small &amp; Medium businesses.  </p>  <p style=\"\">  \t SAP is an acronym for Systems , Applications and Products for Data Processing  </p>  <p style=\"\">  \t       SAP ECC 6.0  (Enterprise Core Components) provide the core solutions for running enterprise business processes in Financials, Logistics and Human Resources  </p>  <p style=\"\">  \t       The term “BASIS” is a reference to the underlying technical architecture of an SAP application. The term encompasses the server infrastructure , software and the server processes that run the SAP application.  </p>  <p style=\"\">  \t       SAP consultants who design, build and manage the SAP environment are termed as BASIS consultants. They are the SAP Technical architects in the IT organization.  </p>  <p style=\"\">  \t       SAP consultants possess the skills required to administer and configure SAP specific settings in an IT landscape. They are part of a larger organization which may run a landscape consisting of several SAP and Non-SAP applications.  </p>  <p style=\"\">  \t       Taught by an instructor who carries more than 12 years plus of Real time SAP experience with numerous implementations.  </p>  <p style=\"\">  \t       This Course is designed for all Newbee into SAP Basis. This course is the first step which gives Level 1 activities as a Freshers or 2 to 4 yrs of experience in SAP Basis.  </p>  <p style=\"\">  \t          Instructor has taught all Daily Activities as a SAP Basis Administrator in any organization.  </p>  <p style=\"\">  \t         Trainer has given very clear explanation on all the monitoring tasks with examples.  </p>", 
    "end_date": null, 
    "title": "SAP Basis End User Training", 
    "price": "45.00", 
    "instructors": "Solutions Inc", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/209980_1b01_7.jpg", 
    "course_url": "https://www.udemy.com/sap-basis2/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-03T17:19:42Z"
}