{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">No doubt, SAP  is the indisputable leader in the Business Software Industry.</p><p style=\"\">Long way from its competitors, it has become an standard in big companies.</p><p style=\"\">Currently (2015):</p><ul style=\"\"><li style=\"\">It is implemented in more than 291.000 companies in 190 countries.</li><li style=\"\">It is used by the 87% of the compalnies in the Forbes Global 2000.</li><li style=\"\">The 98% of the more valuated brands trust in it for managing their processes.</li><li style=\"\">Its customers produce among other more products:<ul style=\"\"><li style=\"\">The 78% of the world food.</li><li style=\"\">The 82% of the medical devices in the world</li></ul></li></ul><p style=\"\">If you still have not got any training in this ERP... what are you waiting for?</p><p style=\"\"></p><p style=\"\"><strong style=\"\">Learn all SAP key concepts with this course.</strong></p><ul style=\"\"><li style=\"\">What is SAP</li><li style=\"\">What modules and functionality it includes</li><li style=\"\">How to access and navigate through this system</li><li style=\"\">What different data types it manages</li><li style=\"\">What different options for gettting reports offers</li><li style=\"\">What personalization options can be applied to it</li></ul><p style=\"\"><strong style=\"\">Prove in your job interviews and in your CV that you know about what you are talking.</strong></p><p style=\"\">Although SAP is so large that it is not possible to know it completely. It is possible to know its more important concepts and in this way to ease the posterior specialization in the module where you are interested.</p><p style=\"\">Besides that, if you are searching for a job, the knowledge of this course will provide you a great competitive advantage over the rest of applicants. It will prove that you have worked proactively in improving your education in a key subject.</p><p style=\"\"></p><p style=\"\"><strong style=\"\">Contents</strong></p><p style=\"\">This course starts with a definition of the general concepts.</p><p style=\"\">Next, some demonstrations in a demo system will be shown, where you will be able to see in a practical way how to interact with the system. Easing in this way the understanding.</p><p style=\"\">Lastly, you will see an overview of the functionality of the different modules, as well as the posibilities to generate reports and to make further personalizations to the standard.</p>", 
    "end_date": null, 
    "title": "What is SAP - Basic Introductory Course", 
    "price": "20.00", 
    "instructors": "Ricardo Naya Arboleya", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548954_cf83_2.jpg", 
    "course_url": "https://www.udemy.com/what-is-sap-basic-introductory-course/", 
    "currency": "USD", 
    "subject_name": [
        "SAP"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-08T12:05:04Z"
}