{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    We can read a city in a number of ways: in its plan, in the buildings that make its streets and public spaces, in the skyline. We can ask, what are the buildings or spaces saying? How do they say it? How does it all stitch together?\n\nIn this architecture course you will learn how to “read” Rome, an ancient city, reborn in the fifteenth century and reshaped substantially in the following three centuries. You will discover how Renaissance and Baroque Rome’s urban form, art, and architecture projected the city’s image of itself to its citizens (urbi) and the world (orbi).\n\nPopes, architects, scholars and sculptors invested in Rome a variety of narratives that strove to explain the city’s history, convince its citizens and visitors of its harmony, and exhort society at large to share in and shape its destiny. The city that resulted became a destination for pilgrims and Grand Tourists, and still is today.\n\nThe Meaning of Rome: The Renaissance and Baroque City is organized around three themes—the city and memory, the city as reliquary, and the city as theater. In uncovering some of the meaning of Rome, you will be equipped with the skills necessary to consider how our own cities and communities are, or could be, meaningful. You will come away from this course not only better informed about the cities of the past, but also better equipped to think about the cities of the present and the future.\n\nStudents who successfully complete all of the required course assignments will have the opportunity to compile a Digication ePortfolio and earn a digital badge. \n\n                                    ", "end_date": "2016-05-03T00:00:00Z", "title": "ARC110x: The Meaning of Rome: The Renaissance and Baroque City", "price": 0, "instructors": "David Mayernik and Jay Hobbs", "institution_name": ["University of Notre Dame"], "commitment": "4-6 hours", "subject_name": ["Art & Design"], "course_url": "https://www.edx.org/course/meaning-rome-renaissance-baroque-city-notredamex-arc110x", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-03-15T00:00:00Z"}