{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    What you’ll achieve: \nIn this project-centered course*, you will create an original four page minicomic designed around a short story of your choosing.\n\nWhat you’ll need to get started:\nThis project-centered course is designed for all-age learners (high school age and above, at least 13 years of age) who are interested in learning how to make a comic book, but have never completed one before.\n\nWhile comic books can be created with any kinds of materials, we recommend that learners have the following materials available to complete the project: at least one ream of 8.5x11 copy paper, #2 pencils and eraser, Sharpie-type fine point pens, ruler with inch measurements, and adjustable binding stapler. Learners should also have access to a printer and scanner (to facilitate digitizing work to be shared with peers on Coursera).\n\n*About Project-Centered Courses: \nProject-Centered Courses are designed to help you complete a personally meaningful real-world project, with your instructor and a community of learners with similar goals providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share.\n\n                                            Syllabus\n                        Part 1 - Course Overview &amp; Finding Your Great IdeaFor the first week we will get you everything you need to know before starting to create your comic book. Then we will focus on idea creation for your comic story. Part 2: Writing Your Comic ScriptIn part 2 we will be looking specifically at how to script your comic for publicationPart 3: ThumbnailsPart 3 will have us constructing thumbnail (aka small sketches) to plot out the look of our final comic book.Part 4: Penciling &amp; LetteringPart 4 will have us concentrate on producing the actual pages of art for our comic by penciling and lettering our pages.Part 5: InkingPart 5 will have us creating the inks (aka the dark lines that will appear when copied) for our comic.Part 6: Putting Your Comic Together &amp; Course Wrap-upGet ready to hit the comic conventions with your finished comic book copies!\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "How to Make a Comic Book (Project-Centered Course)", "price": 0, "instructors": "Patrick Yurick", "institution_name": ["High Tech High"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/make-comic-books", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}