{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    Welcome to Course FOUR!   In Modules 1-4 you will cover the final elements of the Specialization necessary to round out this introduction to the fundamentals of Photography, and prepare you for creating your own exciting project in the Capstone!  You have come a long way since the beginning of this journey from Smartphone Basics to DSLR and Beyond.  Just think of all the information you have absorbed and put to use in your assignments and quizzes, and the confidence you have gained that you CAN control the camera to make pictures you are proud to share.  \n\nHere in Course Four you will start by gaining knowledge related to content in photography, from fact to fiction, documentary to purely expressive.  Next you will learn principles, tips, and techniques for using the essential element of Light in Ambient/Natural settings.  \n\nThe flash/strobe unit, whether it is built-in to your camera or an add-on \"hotshoe\" model, will finally be something you, not the camera, controls!  You will prove to yourself that those former mysteries of Controlled Continuous and Strobe lighting will no longer be mysterious, as you apply your knowledge to creation of assignment photographs in various situations.  Sharing those pictures in Peer Review will give you the opportunity to learn from your fellow photographers' solutions to lighting challenges, and to gain insight into your own work and creative approaches too.  \n\nThere is an important word to share about Peer Review assignments for this course.  As photographers who have accomplished the quiz and photography requirements of Courses One through Three, you have the knowledge and capability to create quality photographs at a much higher rate of success, and in a much shorter time, than when you began.  You have also proven that you are a dedicated Learner, someone who has a passion for photography and is willing to put forth the extra effort necessary to accomplish your goals.  This Course is the last before the Capstone Course, in which you will be tasked with creating a project over a 2-month period of dedicated photography.  The Peer Review photography assignments have been structured with both your advanced capabilities and dedication in mind...in other words, they will require both!  Be prepared to allocate more time than you have in previous Courses for the assignments, because they will take more time and because you will really enjoy them!\n\nCourse Four ends with an overview of methods for finalizing your pictures in print form, including simple but effective matting techniques, and in web page designs as well.  The pleasures and perils of sharing in social media sites are also yours to discover.  Protecting your copyrights by understanding that concept and the ways that you can assert them, being careful about blogs and other outlets, and recognizing you are part of a community that respects the individual's creative effort, well that is  important knowledge to have in preparation for the Capstone too!  Let's get started with Module One!\n\n                                            Syllabus\n                        The Content of a PhotographWhat are the broad areas of content that are most closely associated with photography?  Why is photography well suited to image-making in these areas, and where do your interests synchronize with those of photographers past and present?  You will gain a greater understanding of those and other questions, and knowledge of a range of typical pictures in a variety of categories too, in this set of lessons.  Understanding these broad categories will help you to form your own projects, including the Capstone Project in Course 5, with confidence that you are part of a stream of tradition, building on a foundation that you as a photographer are a part of!Light Fundamentals 1.0: People, Places, Things under Ambient LightIn this Module you will begin with an overview of light itself, and learn to recognize the characteristics of typical \"ambient,\" aka continuous light natural to the environment.  From photographing early in the morning, through midday to evening, in exterior and interior environments, you will learn to recognize typical light/subject situations and be able to use new tips and techniques on how to get the best results.  People, places, and things each require nuanced approaches, even under similar lighting, and you will learn to recognize opportunities in each category.Light Fundamentals 2.0: People, Places, Things under Controlled LightIn this Module you will learn about essential light and exposure principles that are critical to your success in photography that is made with lights that you can control.  From continuous-light to built-in-camera flash to auxiliary \"hotshoe\" strobes, you will establish a solid foundation of light and lighting principles and practices, especially related to the flash.  With a built-in flash in most digital cameras, it is essential to have a full understanding of that important device.  You will have much better control of the flash with the information you gain in this Module.  Rounding out this module are lessons on practical photography activities that you will be able to apply to addressing your own individual needs for specialized picture situations, even with a Smart phone! Finishing Pictures: Options for Showing and SharingIn this Module you will survey the ways that you can bring your digital images out of the world of zeros and ones that are stored in your computer, and bring them into the world through various means of sharing.  Whether your interests are in producing prints of your photographs or quality web-based displays, you will have the knowledge to control their appearance through calibration that is essential for a professional presentation.  You will also learn about the pitfalls and dangers of sharing in social media and other sites, and how to take precautions to protect yourself, your family and friends, and your photographs.  You will also gain an understanding of standard options for dissemination of your photos in print form, on sharing sites, and even in your very own website. \n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Photography Techniques: Light, Content, and Sharing", "price": 0, "instructors": "Peter Glendinning and Mark Valentine Sullivan", "institution_name": ["Michigan State University"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/photography-techniques", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}