{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong>Course Launched 18th April 2016 - Latest After Effects CC 2016</strong></em></p>\n\n<p>After Effects is an easier and practical program to edit your videos. You will not need to engage in complicated cuts and edits to achieve a simple yet attractive movie for your video clips.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">You most probably have taken so many short videos with your camcorders, DSLR Cameras and your smart phone.</em></strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In both cases, you have all these video clips. Each clip might contain just a few seconds of watch worthy footage.   <br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Wouldn’t it be great if you could assemble all these short footages in a single movie? putting together only the most interesting or the most valuable parts. </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And the last thing you want to do, is use professional and complicated programs to put together your clips. You want an easy and simple way to:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Clip and drop</li><li>Sequence clips one after the other</li><li>Add text or some graphic</li><li>Create some kind of a transition in between the clips</li><li>Maybe animate the text and the graphic, that would be nice!</li><li>Produce your movie (or Render)</li><li>Post it on the web for people to watch</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This is what this course is all about: Putting together your home video like a pro, like if you have been in video editing for years.</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>But then, After Effects is a sophisticated program and has very many additional features, and this is why I added few of these features to make it easier for you to produce a movie just like a pro.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">*** My promise to you: </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>1.       Just after the first section you will be able to assemble your first movie and start claiming you are a pro video editor.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>2.       By the end of the second section, you will be sequencing and creating fade-ins and outs and using presets to compile all your clips into a single movie.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>3.       By the end of section three, you will become conversant in adding text using several techniques and becoming familiar with per-character animation</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By then, you can jump to create your movies and uploading. But if you want to be even more sophisticated you can to continue to section four where:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>4.       You will learn about more advanced features such as masks, shapes, creating a vignette and practicing using these techniques.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>5.       I added more on how to use Presets because they are easy to manipulate, yet they give your movies a pro look.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n<p><strong><em class=\"redactor-inline-converted\">AND if You are interested in creating a documentary or a semi professional movie and you gathered your info as short video clips. Then this course will be your guide to editing these video clips, assembling them and creating your final movie.</em></strong></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p><em>OR… If you want to start becoming a pro video editor in After Effects, then this course is surely for you. You can, Just after 2 hours or so, start creating quite some professionally looking videos.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Join me in this and start editing your videos like a pro.</p>", 
    "end_date": null, 
    "title": "After Effects Video Editing: Edit Your Home Video Like a Pro", 
    "price": "20.00", 
    "instructors": "Louay Zambarakji", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799454_a0a3_5.jpg", 
    "course_url": "https://www.udemy.com/after-effects-video-editing-edit-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T06:06:56Z"
}