{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em>Poor audio can make your video look and sound amateur. Good audio can make your videos professional and engaging.</em></p><p>By the end of this course you will feel completely comfortable with audio equipment. You will know exactly what to do to get a great sound every time.<strong></strong><br></p><p><strong>Just imagine that feeling when your videos become effortlessly professional thanks to amazing audio. No more second guessing your use of microphones and recording equipment... and no more time wasted seeking good information online.</strong></p><p>Before we continue, let me tell you a bit more about myself. I've worked on film sets as part of the sound team for adverts, short films, feature films and more.<em> </em><strong>During my time I've worked with some of the top professionals in the industry. </strong></p><p>I've worked with (and been taught by) boom operators and sound recordists that have worked on large budget feature films <em>(such as Pirates of the Caribbean, Clash of the Titans, Layer Cake, Shaun of the Dead, World War Z</em><em>)</em> and popular TV shows <em>(such as Ricky Gervais' Extras and Gavin &amp; Stacey)</em>. They in turn learned from some of the top Hollywood sound guys and legends!</p>  <p><strong>Now I want to pass these techniques and tricks on to you in this course, so that you can get a great sound in any location.</strong> </p><p><em>Over the next few hours I want to transform you in to an awesome sound recordist and microphone operator.</em></p>  <p><strong>If you record any kind of videos you can benefit greatly from this course.</strong><em> </em></p>  <p>However this course is not for you if you already have years of experience recording audio using shotgun and lavalier mics, or already work professional as a boom operator or sound recordist.</p>  <p>And this course is not for you if you don't appreciate the importance of high quality audio. <em>Heck, if that's you, why are you here?!</em></p>  <p><strong>BUT if you make videos and you care about good quality, I want you to join me. Take this course and short cut your way to audio mastery!</strong></p>  <p>After completing this course you will be able to focus on your content rather than worrying about the sound.<em> In turn this will get you more views, downloads, sales, streams - whatever it is you are after!</em><br></p>  <p>Everyone wins :)</p>  <p>Here is a taster of some of the things that you will learn in the course:</p>  <ul><li>The <strong>challenges that you will face</strong> when recording sound on location</li><li>The<strong> different microphones </strong>and how to use them</li><li>How to get a great sound <strong>regardless of your budget </strong>(even a $1 lapel mic is better than nothing!)</li><li><strong>What equipment and accessories</strong> to buy or rent</li><li>The <strong>right way to set up your recording</strong> and record at the highest quality</li><li>The <strong>recording processes</strong> that professionals use to <strong>prevent mistakes</strong></li><li><strong>What to do when it all goes wrong</strong> and your audio sounds awful or is lost</li><li>Why most people ruin their audio with<strong> EQ and compression</strong> (and what you should be doing instead)</li><li>How to make sure your audio and video are <strong>perfectly in sync every time</strong> (it’s actually really easy when you know how)</li><li>How to <strong>make your video more immersive</strong> with sound design</li><li>and a whole lot more!<br> <br> </li></ul>                      <p><em>Over time I will be sure to update the course when new equipment comes out, or if anything needs more of an explanation. Feedback is really important to me, so please don’t hesitate to drop me a message.</em></p>  <p><strong>Let’s not waste any more time – scroll up and hit that blue button!</strong></p>  <p>Or, if you still aren’t 100% convinced, check out the free previews. The whole first section is free, and you can access a free 5-minute preview at the top of this page.</p>  <p>See you inside…</p>", 
    "end_date": null, 
    "title": "Audio for Video - Recording Sound and Voice on Location ", 
    "price": "20.00", 
    "instructors": "Rob Mayzes", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645980_e579_5.jpg", 
    "course_url": "https://www.udemy.com/audio-for-video-recording-sound-on-location/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T16:36:00Z"
}