{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>GUARANTEED MONEY BACK!!!!!!!!!!!  YOU HAVE NOTHING TO LOSE ONLY TO GAIN!!!!  JOIN NOW AND START MAKING THE INCOME YOU DESERVE......\n</strong></p>\n\n<p><strong>Updated April 27, 2016</strong></p><p><br></p><p>You will be able to edit videos like a pro in just an hour or so.  I will show you all the most needed techniques for editing best video quality.  Final Cut Pro X is hands down the best editor for videos.  Combined with a few plugins that are really inexpensive and its basically a drag and drop effort.  \t</p>\n\n<p>Final Cut Pro X offers the simplest way to edit video on the market today.  Many important events have been recorded only to find the video quality was to light or dark. No worries Now.  It's now possible through Final Cut Pro X to Color Correct these video events so they appear as if professionals had edited them.  </p>\n\n<p>  \tEnroll in the course <strong>Final Cut Pro X Color Corrections Which Gives Professional Quality</strong> to learn all the editing techniques used by the pro's<strong>.  </strong>This is one course you definitely don't want to miss.   These video editing techniques will effect the way your content looks through the rest of your career.  It's virtually impossible to do anything online today which doesn't involve video.  Videos are the best way to share ideas, events, or even learn today.  </p>\n\n<p>  \tThis Course Will Teach:  </p>\n\n<p>  \t1.  Video Editing Basics  </p>\n\n<p>  \t2.  Advance Editing Strategies and Techniques  </p>\n\n<p>  \t3.  <strong>Color Corrections </strong>which can make any project appear more professional.  </p>\n\n<p>  \t4.  Audio Editing Strategies  </p>\n\n<p>  \t5.  Audio &amp; Video Syncing  </p>\n\n<p>  \t6.  Learn to use all the added Tools in this update such as the <strong>Range Tool.</strong>  </p>\n\n<p>  \t<strong>Guaranteed You Learn &amp; Enjoy or Your Money Back.  </strong>These are editing methods that will improve your overall professional look regardless what it may be.  </p>", 
    "end_date": null, 
    "title": "Become Video Editor & Creator GURU Using Final Cut Pro X", 
    "price": "20.00", 
    "instructors": "Mitch Stevens", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425370_434c_6.jpg", 
    "course_url": "https://www.udemy.com/final-cut-pro-x-color-corrections-professional-quality/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T22:13:37Z"
}