{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Drehen Sie Filme, die begeistern! Videoprofi Holger Haarmeyer zeigt live am Set, wie Sie brillante Farben, starke Kontraste und spannende Szenen schon beim Dreh erhalten – ob mit dem Camcorder, der Spiegelreflex-, einer Kompaktkamera oder Action-Cam. Sie erfahren, welche Kameraeinstellungen sich am besten eignen und wie Sie für das richtige Licht und gelungene Bildausschnitte sorgen. Dann folgt der Feinschliff: digitaler Schnitt und Nachbearbeitung, Vertonung und schließlich die Ausgabe. Kurz: Lernen Sie, wie Sie aus bewegten Bildern bewegende Bilder machen!</p><p>- Der Praxisworkshop – live beim Dreh dabei!</p><p>- Tipps für jede Ausrüstung – von Camcorder über DSLR bis Action-Cam</p><p>- Alles über Kameraeinstellungen, Belichtung, nützliches Zubehör</p><p>- Der komplette Ablauf – Von der Aufnahme über den Schnitt bis zur Ausgabe</p><p>Holger Haarmeyer ist Experte für Video und Fotografie. Das Filmen und Schneiden eigener Videos ist seit über 20 Jahren seine Leidenschaft. Schon früh begeisterten ihn die Möglichkeiten der digitalen Videowelt und er vermag es, das nötige Grundlagenwissen besonders verständlich zu vermitteln. Es macht ihm großen Spaß, beliebte Effekte aus bekannten Filmen mit einfachen Mitteln nachzustellen – in seinen Video-Trainings liefert Holger Haarmeyer viele kreative Beispiele dafür.</p>", 
    "end_date": null, 
    "title": "Besser filmen! – Die große Videoschule", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507556_e2e0.jpg", 
    "course_url": "https://www.udemy.com/besser-filmen-die-groe-videoschule/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T21:33:10Z"
}