{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Dear students, I have created this course to cover the subject of the <em>video production</em>. But one more thing - this course is about the <strong>Budget Video Production.</strong> What does it mean?</p><p>It means that this course is directed to the students, who are full of inspiration to create <em>Talking head, Screencast</em> or other <strong>Videos</strong>, but who do not have enough money for it to their mind. It could be <em>bloggers, journalists, teachers, designers</em> and other talented  people, I have concentrated only on <strong>Mac Applications</strong> users (e.g. users who could run standard <strong>Mac OS</strong> applications on their <strong>Macintosh or Windows</strong> laptops and PCs)</p><p>I'll explain you promptly how to <strong>not</strong> <em>spend a lot of money and time</em> to produce exciting and interesting<strong> movies</strong> and video stories.</p><p>The <strong>Budget Video Production</strong> course take you even less than <strong>2 hours</strong>. </p><p>It consists of <strong>10 sections</strong> that cover these subjects of video industry:</p><ul><li><em>Equipment</em></li><li><em>Software</em></li><li><em>Lighting</em></li><li><em>Background and Chroma Key </em></li><li><em>Text overlay</em></li><li><em>Video overlay and Combination</em></li><li><em>Transition Technics </em></li></ul><p>The most part of the sections is Video, but I did not forget about Slides. Drawings and Schemes are outlined there accessibly. </p><p><strong>5 Quiz Tests</strong> will help you to consolidate your knowledge.</p><p>And Finally you could create your own amazing video with effective emphasizes.</p><p>You should take this course as it is <strong>easy</strong> to go through, it covers one of the <strong>must have skills</strong>, and gives you huge capabilities of doing videos yourself using low budget and shortage of time.</p><p>This course will not probably fit you if run other than Windows or Macintosh software.</p><p>Nevertheless, Welcome to the<strong> Budget Video Production</strong>.</p><p></p>", 
    "end_date": null, 
    "title": "Budget Video Production: Shoot & Edit amazing videos Quickly", 
    "price": "20.00", 
    "instructors": "Illia Podliesnyi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561566_c1da_2.jpg", 
    "course_url": "https://www.udemy.com/budgetvideoproduction/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T12:33:30Z"
}