{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong><em>This online Cinematography Course will teach you how to shoot beautiful videos with any camera.</em></strong></p><p>This course is designed to teach you the ins and outs of professional cinematography - <em>the art of making motion pictures</em>. While there are plenty of video courses, it's hard to find a comprehensive course that teaches you everything you'd want to know about shooting video. </p><p><strong>This is the course for you, taught by a professional Hollywood cinematographer.</strong><br></p><ul><li>Learn the basics of getting great shots with any camera</li><li>Use the manual settings on your camera to expose your shot properly</li><li>Learn how to use camera movement to get more impressive shots</li><li>Light your video sets with traditional filmmaking techniques and lighting setups</li><li>Become a professional director of photography (cinematographer) with tips on how to find work in the video/film industry</li><li>Make money shooting videos</li></ul><p><strong>Improve Your Video Creation with This Complete Course</strong></p><p><strong></strong>Regardless of the type of camera you are using - DSLR, Professional Cinema Camera, GoPro, iPhone, or Film - you can shoot beautiful video. Learn professional techniques that Hollywood filmmakers are using to capture powerful images.</p><p><strong>If you want to learn how to shoot great videos and making money doing what you love, this is the course for you.</strong></p><p>This course dives right into shooting better video with 5 tips for better cinematography. You'll learn the basics of cinematography including choosing the right camera, ISO, frame rate, shutter speed, f-stop/aperture, and lens options. </p><p>Learn how to expose your videos properly, including learning the different styles of exposure styles of commercial, TV, and narrative filmmaking. </p><p>Learn how camera movement with tripods, handheld, dollys, steadicam systems, and drones can help you take beautiful shots.</p><p> Learn how to light your video shots with different styles and lighting kits.</p><p>Learn how to work with the producer, director, camera team, grip and electric team, and other departments on a film set.</p><p>Learn how to find work as a cinematographer / videographer. Learn how to network, negotiate a good rate, and get jobs.</p><p><strong><em>Start shooting better videos today!</em></strong><br></p><p>Enroll today, and we'll see you in the course.</p>", 
    "end_date": null, 
    "title": "Cinematography Course: Shoot Better Video with Any Camera", 
    "price": "20.00", 
    "instructors": "Phil Ebiner, William Carnahan", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640808_ca84.jpg", 
    "course_url": "https://www.udemy.com/online-cinematography-course-filmmaking-video-production-lighting/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T21:43:08Z"
}