{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong>Start editing your video professionally with Adobe Premiere Pro!</strong></p><p style=\"\"><strong></strong>If you are looking for a video editing application that will allow you to edit videos however you want them, Adobe Premiere Pro is the best answer. Premiere Pro is used by professionals across the world for every type of production from business &amp; marketing videos, music videos to documentaries, feature films. This full course is the best way to jump right in and start editing.<br></p>  <p style=\"\">  \t<strong>Make videos the way you imagine them!</strong>  </p>  <p style=\"\">  \t     In this complete guide to Adobe Premiere Pro video editing course, professional video editor Phil Ebiner takes you through the basic skills using Adobe Premiere Pro. You can be editing on a Mac or a PC with any version of Adobe Premiere Pro (cs3, cs4, cs5, cs6, etc) to learn in this course. This course will cover everything you need to know to start video editing, including:  </p>  <ul>  \t<li><strong>Adobe Premiere Pro Overview</strong></li>  \t<li><strong>Starting a Project</strong></li>  \t<li><strong>Organization and Subclipping</strong></li>  \t<li><strong>Timeline and Basic Editing Tools</strong></li>  \t<li><strong>Editing Audio in Adobe Premiere Pro</strong></li>  \t<li><strong>Video Effects in Adobe Premiere Pro</strong></li>  \t<li><strong>Color Correction and Grading</strong></li>  \t<li><strong>Titles and Motion</strong></li>  \t<li><strong>Exporting and Posting Online</strong></li>  \t<li><strong>and much more!</strong></li>  </ul>  <p style=\"\">  \t     Learn from someone who is currently working in the industry, who knows the most current editing techniques, and who has a Bachelor of Arts in Film and Television Production from one of the country's top film schools.  </p>  <p style=\"\">  \t<strong>BONUS: As a bonus, you'll receive supplemental video and audio clips to practice with while I teach you with.</strong>  </p>  <p style=\"\">  \t     I look forward to teaching you! Let me know if you have any questions.  </p>", 
    "end_date": null, 
    "title": "Complete Adobe Premiere Pro Video Editing Course", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47337_8bab_9.jpg", 
    "course_url": "https://www.udemy.com/adobe-premiere-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-25T16:58:18Z"
}