{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t   Want to to gain authority, credibility and celebrity status?  </p>  <p>  \t   Imagine if you were recognized as a global expert and even an icon in your industry?  </p>  <p>  \t   What if you were in great demand and you were able to charge double of what you are charging now?  </p>  <p>  \t   What if you became a celebrity in your community and dominate your niche?  </p>  <p>  \t<strong style=\"\">“Celebrity Video” formula includes:</strong>  </p>  <p>  \t   •Video tutorial how to create “real”, reality-show, interview, and celebrity style videos  </p>  <p>  \t   •PDF of my personal script I have used to build a list of over 50, 000 subscribers in 30 days  </p>  <p>  \t   •PDF of my personal script I have used to launch my Health Mastery Retreat and made $434, 000  </p>  <p>  \t <strong style=\"\">However, this formula is NOT for everyone.</strong>  </p>  <p>  \t   It is NOT for you if you are:  </p>  <p>  \t   •Looking for “get rich quick” schemes  </p>  <p>  \t   •“Fake” expert  </p>  <p>  \t   •  Not willing to do the job, i.e. lazy  </p>  <p>  \t <strong style=\"\">This is for you if you:</strong>  </p>  <p>  \t   •Have skills and knowledge in your niche  </p>  <p>  \t   •Desire to share your skills  </p>  <p>  \t   •Want to help people  </p>  <p>  \t   •Want to make money  </p>  <p>  \t  My name is Katrina Starzhynskaya and this program was created for you after I became one of the most though after and highest paid branding and media advisors to the branding, media and self-publishing industry.  </p>  <p>  \t  I’ve now gone on and used this exact formula to sell my events, books, products and consulting services over and over again.  </p>  <p>  \t   The price of this course is $297.  </p>  <p>  \t   I haven&#039;t released this to the public yet - just to people like you who are Udemy users.  </p>  <p>  \t <strong style=\"\">Claim your copy now and save over $200.</strong>  </p>  <p>  \t <strong style=\"\">Click the order now button below and start working today with “Celebrity Video” formula.</strong>  </p>  <p>  \t   Because I want to get input and testimonials, I&#039;m offering this for a considerable discount.  </p>", 
    "end_date": null, 
    "title": "Create Celebrity Style Videos", 
    "price": "40.00", 
    "instructors": "Katrina STARZHYNSKAYA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185544_3666_4.jpg", 
    "course_url": "https://www.udemy.com/celebrity-video-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-20T00:27:21Z"
}