{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Welcome to this: Perfect White Background for Video Course! </p><p>In this course I'm going to teach you how to, (from scratch) create a perfect white background video! I will cover everything from picking your wall, to what clothes to wear so the video will be as good as it can be! I have included video lectures on everything you need to know in order to get the best video possible. These videos include: Lights, Audio, Camera settings, framing, basic studio setup, editing raw footage (good or bad) and as a bonus I've even included a BONUS SECTION: HOW TO DO A PERFECT GREEN SCREEN VIDEO!</p><p>This course will take about 2 hours to complete, and you can watch it anywhere you want, at home, in the train or even at your work (if nobody's looking). You can gather this information and use it to start planning your own studio, and videos! </p><p>I will start to introduce you to the world of white back screens, we will then take a look at how to get your 'studio' right, after which we will continue with the editing of the raw videos shot in your own studio! We will then finish up with the bonus lecture: How To Do Green Screen!</p><p>If you are looking for a comprehensive all inclusive course that will teach you how to get the best white background video you've ever seen, don't hesitate any longer!</p><p>I'm sure you'll have a lot of fun learning this amazing skill, as well as putting it to the test in your very first white background video!</p><p>Mark</p>", 
    "end_date": null, 
    "title": "Create a Perfect White Background for Video!", 
    "price": "20.00", 
    "instructors": "Mark de Heide", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564948_28d0_2.jpg", 
    "course_url": "https://www.udemy.com/whitebackground/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T08:00:16Z"
}