{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Descripción del Curso</strong></p><p>Con el <strong>Curso General de Cine y Vídeo</strong> aprenderás de manera sencilla y clara los procesos que se siguen para hacer desde una película hasta un vídeo amateur. </p><p>Es verdad que existen muchos tutoriales sobre el audiovisual pero pocos tienen esta visión global sobre <strong>el proceso de producción.</strong></p><p>Al finalizar el <strong>Curso </strong>serás capaz de <strong>mirar</strong> de otra manera, ya que sabrás  cómo se ha hecho una película o serie de televisión y me sentiré halagado si he conseguido picarte con el veneno del cine, tanto por si intentas hacer un vídeo, o como espectador, degustando cualquier obra audiovisual, porque cada uno tenemos una manera de <strong>mirar</strong> y de <strong>contar.</strong> <strong></strong></p><p><strong></strong></p><p><strong>Sobre mí</strong><strong></strong><strong></strong></p><p>He <strong>dirigido</strong> series de televisión, <strong>realizado</strong> programas, documentales y he sido <strong>premiado</strong> en Festivales Internacionales. Toda esta <strong>experiencia</strong> la pongo a tu disposición y si tienes alguna duda, estaré a tu disposición para intentar resolverla.</p><p><strong></strong></p><p><strong>¿Qué me voy a encontrar en el curso?</strong></p><ul><li><strong>12 vídeos</strong> que no sobrepasan los <strong>5 minutos</strong>.</li><li>Explicaciones <strong>claras y concisas</strong>.</li><li><strong>Secuencias grabadas</strong> para el curso para una mejor comprensión de los conceptos.</li></ul><p><strong></strong></p><p><strong>Temario</strong></p><p>El <strong>Curso General de Cine y Vídeo</strong> se compone de dos partes.  En esta primera son cinco vídeos:</p><ul><li><strong>Presentación</strong></li></ul><ul><li><strong>El guion.</strong> Aprenderás lo que es una secuencia y la estructura que se repite en todo guion.</li></ul><ul><li><strong>El plano</strong>. Conocerás la nomenclatura de los planos.</li></ul><ul><li><strong>La cámara</strong>. Sabrás las partes más importantes de una cámara.</li></ul><ul><li><strong>La iluminación</strong>. Reconocerás qué tipos de iluminación se utilizan.</li></ul><p>Y en la segunda parte del Curso General de Cine y Vídeo, los siguientes vídeos:</p><ul><li><strong>El proceso de Producción</strong>. Verás que procesos se siguen para hacer una película.</li></ul><ul><li><strong>La preproducción</strong>. Sabrás cómo se prepara una película.</li></ul><ul><li><strong>El rodaje</strong>. Conocerás un concepto ligado al rodaje o grabación: el eje cinematográfico o eje de acción.</li></ul><ul><li><strong>El montaje</strong>. Aprenderás qué tipos de montaje o edición existen.</li></ul><ul><li><strong>El sonido</strong>. Oirás los distintos sonidos que se utilizan y que componen la banda sonora de cualquier película o serie de televisión.</li></ul><ul><li><strong>La postproducción de imagen</strong>. Conocerás dos conceptos como el etalonado y los efectos de postproducción de imagen</li></ul><ul><li><strong>Epílogo</strong></li></ul><p></p><p><strong>¿Me hace falta saber de cámara o de algún programa de edición?</strong></p><ul><li>No es necesario para completar el curso.</li><li>No explico tal modelo de cámara o tal programa de edición, en el curso explico la teoria cinematográfica necesaria para hacer una película o un vídeo.</li></ul><p></p><p><strong>¿A quién va dirigido?</strong></p><ul><li>A los cinéfilos y seriéfilos.</li><li>A los que estén pensando en hacer su primer vídeo.</li><li>A los que de alguna manera tengan relación con el audiovisual pero desconozcan los precesos que se siguen.</li></ul>", 
    "end_date": null, 
    "title": "Curso General de Cine y Vídeo", 
    "price": "20.00", 
    "instructors": "Juanjo Castro", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544168_1105_2.jpg", 
    "course_url": "https://www.udemy.com/curso-general-de-cine-y-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T16:15:39Z"
}