{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \tTodo Director de cualquier proyecto audiovisual, ya sea una película de cine, un  cortometraje, una serie, o incluso una web serie, es el responsable de utilizar las imágenes para narrar aquello que el guionista escribió.  </p>  <p>  \tPara ello, cuanta con una serie de recursos visuales que debe conocer y dominar. Uno de ellos es la angulación de cámara, puesto que cuando rueda una escena, el Director debe elegir correctamente la altura de cámara para conseguir  aportar la profundidad emocional que crea necesario en cada momento de la historia.  </p>  <p>  \tEn este curso No tratamos por lo tanto de enseñar únicamente en qué consiste cada tamaño de plano, sino más bien en educar la mente para aprender a utilizarlos según sea necesario en cada situación.  Los recursos visuales son como las teclas del piano, y no basta con conocerlas, sino que hay que saber a tocarlas con propiedad.  </p>  <p>  \tLos 36 ejemplos de películas de este curso te ayudarán a comprender cómo la altura de la cámara puede marcar la diferencia. Además, entre otras, estas preguntas serán respondidas:  </p>  <p>  \t¿Qué relación existe entre lo que sucede en la secuencia y la angulación elegida? ¿Qué 3 usos puede tener una angulación picada? ¿Porqué el contrapicado es más frecuente que el picado a pesar de tener menos usos? ¿Cómo podemos manipular la emoción del público hacia los personajes con las angulaciones? ¿De qué depende que una angulación sea más dramática que otra? ¿Qué tiene que ver la angulación nadir con la arquitectura? ¿Qué riesgo corremos al usar planos inclinados? ¿Qué similitudes tienen la cámara gusano y el cenital?  </p>  <p>  \tDe todas estas cuestiones y muchas más hablaremos en este curso de cine.  </p>  <p>  \tY como siempre, tendremos al final del curso una pregunta de reflexión, para que pongas en práctica los conocimientos adquiridos, a la que le adjuntamos las respuestas para que puedas autocorregirte.  </p>", 
    "end_date": null, 
    "title": "Dirección de Cámara: Alturas y Angulaciones", 
    "price": "20.00", 
    "instructors": "Jorge E. Blein", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/228160_a08a_4.jpg", 
    "course_url": "https://www.udemy.com/direccion-de-camara-alturas-y-angulaciones/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-24T08:30:37Z"
}