{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Make your talking head videos look awesome in minutes. Get amazing results from any DSLR or camera. Even your iPhone, smart phone or webcam. Without spending a fortune!</p><p><strong>[Last updated January 2016]</strong></p><p>I'll show you step-by-step how to purchase, set up and use your own DIY lighting rig (for a maximum of $47).</p><p><strong>Or you can use sunlight to improve your videos for free!</strong></p><p>This IS NOT an extensive course on video recording, DSLR camera set up and professional lighting.</p><p><em>This course is designed to bring you the best possible results in the shortest period of time. </em></p><p><strong>In just over an hour I want to transform you in to a DIY lighting guru and make your videos look professional. Without wasting any money or time.</strong></p><p>Although a knowledge of camera equipment is useful, it is not essential. Good lighting can make any camera look great, even in 'auto' mode. </p><p>Plus, you don't need a DSLR or pro camera. The lighting rig that I will show you step-by-step how to build and use will make your phone camera or webcam look awesome too.</p><p>Improving your technique for lighting is the easiest way to increase the quality of your videos and therefore increase sales, views, downloads - whatever it is you're after.<br></p><p><br></p><p><strong>In the course you will learn:</strong><br></p><ul><li>How to make your videos look awesome in minutes</li><li>The easiest way get incredible results from any camera (even an iPhone, smartphone or webcam)</li><li>How to get and build your own DIY lighting kit for under $47</li><li>The best way to use sunlight to improve your videos for free</li><li>How to chose the perfect backdrop for your talking head video</li><li>The rules for framing your video that you should never break</li></ul><p><strong>Who this course IS NOT for:</strong></p><p><em><strong></strong>- People looking for a long extensive course about cameras and videography that will teach you everything that you need to know</em></p><p><em>- People that already have a professional lighting set up.</em></p><p><em>- People that don't shoot videos themselves and pay a professional company to film for them.</em></p><p><em>- People that are on the fence about enrolling. I want all of my students to be 100% dedicated to learning. If that's not you, don't enroll. No hard feelings!</em></p><p><em><br></em></p><p><strong>Who this course IS for:</strong></p><p><em>- People looking to make their videos look amazing with the least amount of time and money spent.</em></p><p><em>- People that are always looking to improve the quality of their content.</em></p><p><em>- People who film their own videos and don't have a lighting set up.</em></p><p><em>- People that know nothing about lighting.</em></p><p><em>- Online course creators, mediapreneurs, YouTube video creators, promotional video creators, interview video creators... anyone who creates videos on a budget!</em></p><p><br></p><p><strong>Your Videos Need to Look Professional</strong></p><p>Sure, you could get by with a basic video. It may look amateur and average, but it's the content that matters right?</p><p>Not true. </p><p>The content does matter, don't get me wrong. It's still the most important thing to please your viewers and keep them engaged.</p><p><strong>But how many people will stop watching before you get a chance to win them over?</strong></p><p>How many people have decided to not buy your online course because it looks cheap? Because it looks like it might be a scam?</p><p>Many people now argue that design is king, not content.</p><p><strong>You need great design to grab the viewers attention. You need great design to gain the viewers trust and keep them there.</strong></p><p>And this doesn't only apply to web design, or graphic design - it 100% applies to video design as well.</p><p>On Udemy, you can definitely get away with average looking videos. Most of the courses on here look pretty crap (sorry).</p><p>But imagine how many more customers you would get if your promo video looked professionally filmed? </p><p><strong>How much easier would it be to grab peoples attention and stop them clicking on to a competitors course with an awesome looking promo video (this is a huge problem on Udemy - your competitors courses are right below the 'purchase' button).</strong></p><p>If you sell online courses outside of Udemy, or create promotional videos for your business, you'll understand the <em>importance </em>of having a professional quality video. </p><p><strong>It's not just beneficial to have professional looking videos, it's essential.</strong><strong> If your videos look amateur, people will lose trust in your brand immediately.</strong></p><p>\"Okay, we get it, professional looking video is important!\", I hear you shout :)</p><p>Do you know what makes all the difference between an amateur looking video and a pro looking video?</p><p><strong>Lighting.</strong></p><p>That's what I want to teach you.</p><p>Lighting can make an affordable camera look amazing. Without good lighting, an expensive professional camera would still look amateur.</p><p><em>I want to show you (step-by-step) the fastest, easiest and cheapest way to put together and use your very own lighting rig.</em></p><p>I'll show you exactly what equipment to buy (all on Amazon) to create your $47 lighting rig.</p><p><strong>Don't waste any more time. Enroll now, and short cut your way to professional talking head videos.</strong></p><p>See you inside :)</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "DIY Talking Head - Lighting and Video Production on a Budget", 
    "price": "20.00", 
    "instructors": "Rob Mayzes", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619194_a65d_3.jpg", 
    "course_url": "https://www.udemy.com/diy-talking-head/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T12:59:23Z"
}