{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>The first course that applies narrative fiction exclusively to aerial footage.</strong><br></p>\n\n<p><em>What is it about?<br></em></p>\n\n<ul><li>If you want not only to take beautiful pictures of the sky with your drone, but also <strong>tell exciting stories</strong>, that have a beginning and an end, and for them to be an authentic experience for your viewer,<strong> this is your course. </strong></li></ul>\n\n<p><em>Why take this course?</em></p>\n\n<ul><li>Here you'll learn how to make an authentic aerial production. To get the most out of your drone and your camera, first you should understand the components that each of them has.</li><li>Knowing the necessary settings, and specially how to change them to get different results, will make you discover a new world.</li><li>Based on the negative and positive experiences from all the productions already made, and adding many of the questions that users ask me, you'll learn a new air language. I'll put you in the situations that you'll face, and you'll learn ways to solve them.</li><li>Above all, this course is about telling a story. <strong>Do you ever get tired of seeing landscapes and more landscapes no matter how pretty they are? </strong>It's time to learn what a story is, what elements is made of, and especially how to apply it to aerial footage. This course is a pioneer in applying fiction exclusively to this type of recording.</li><li>You'll be joining a closed Facebook group for students where you'll be able to post your footage and get instant feedback from other students and the instructor.</li></ul><p><strong><br></strong></p><p><strong>\"This course blew my mind. Awesome job alex. The course is indeed for all levels. It teaches the basics but it goes deep into some lectures. I felt like I was in college. For all students, you can learn as much as you want with this course. He gives you the tools, you make the evolution. I recommended this to all my friends and family. </strong><strong>Absolutely 5 stars. Thanks for your great work Alex.\" ★★★★★ Sean F </strong></p>\n\n<p><em><br></em></p><p><em>How is the course structured?</em></p>\n\n<ul><li>Even when you know how to get the most out of your drone, in this course you'll learn the tools to make your productions even better.  You'll understand and apply editing and post-production processes, to both image and audio. From a good synchronization of both, color grading your footage, working on good titles, to manual audio editing that will make viewers have an even better experience.</li><li>Finally you'll do some exercises in which you'll be able to show everything that you have learned.</li></ul>\n\n<p><strong>Come on in, you won't regret it :) ! You'll enjoy and learn things that you never imagined you were able to do.</strong></p>", 
    "end_date": null, 
    "title": "Drones: how to tell aerial stories", 
    "price": "25.00", 
    "instructors": "Alex Assenmacher", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611728_e3ef_5.jpg", 
    "course_url": "https://www.udemy.com/drones-how-to-tell-aerial-stories/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T14:26:54Z"
}