{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><em style=\"\">This online DSLR Video course will teach you how to shoot amazing videos with your DSLR camera.</em></p><p style=\"\">This course is designed to teach you the ins and outs of video production, even if you have little to no experience with it, to help create videos that help you stand out from the crowd.</p><p style=\"\"><strong>Master Videography Techniques to Create Extraordinary Videos and Boost Your Freelancing Income. </strong>That's right, this is a highly desirable skill that companies are looking to pay for in this new digital world.</p><ul style=\"\"><li style=\"\">Understand How Cameras Work and What Gear You Need</li><li style=\"\">Master Shooting in Manual Mode</li><li style=\"\">Use Stabilization, Composition, and Lighting</li><li style=\"\">Learn How to Record Crystal Clear Audio</li><li style=\"\">Edit Your Videos and Share Them with the World</li></ul><p style=\"\">Regardless of what your level of experience is or what type of camera you use, this in-depth course is designed to provide you with everything you need to take your video skills to the next level.</p><p style=\"\">Whether you prefer shooting documentary, corporate, commercial, narrative or music videos, a great videographer knows how to compose a shot, light it, and edit it. By honing these skills, you can turn your passion into a career. </p><p style=\"\"><strong>Contents and Overview</strong></p><p style=\"\">You'll start with the basics and tackle how a camera operates in video mode, the types of cameras and lenses available, and equipment you'll need for accomplishing your goals. </p><p style=\"\">You'll learn about your camera settings, including how to shoot in manual mode. You'll use stabilization tools and master how to properly compose and light a scene. You'll even learn how to record audio using different microphones (shotgun, lavaliere/lapel, and even your smart phone) to get great quality sound.</p><p style=\"\">You'll then learn some advanced tips for shooting with DSLR cameras like how to shoot for slow motion, shooting a multi-camera production, and getting enough coverage. Finally, you'll learn how to edit your own videos, sync audio, add titles, and export for sharing.</p><p style=\"\">By the end of this course, your confidence as a videographer will soar. You'll have a thorough understanding of your DSLR camera and gear so you can use them to their fullest potential to take unforgettable videos and start a profitable video career.</p><p style=\"\"><strong>About the instructor:</strong></p><p style=\"\">Phil Ebiner started teaching online courses in 2012, and now has over 80,000 happy students on Udemy learning all sorts of things from photography to video making. Phil has shot and edited thousands of videos over the past 5 years that have appeared everywhere from the big Hollywood screen to television to YouTube fame. </p>", 
    "end_date": null, 
    "title": "DSLR Video Production - Start Shooting Better Video Today", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546990_e735.jpg", 
    "course_url": "https://www.udemy.com/dslr-video-production-online-course-tutorial-training/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T18:07:35Z"
}