{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Learn how to professionally shoot, edit, and process DSLR video footage. Starting from the basic concepts, and applying effective and recognized techniques to real-life examples, you will eventually master the key aspects of professional filmmaking. </p><p><strong>Become familiar with a solid production workflow (for DSLR, but also other cameras) in order to get better results, quicker. </strong><br></p><ul><li>Planning the shots and lighting the scene</li><li>Framing the shots and setting the camera</li><li>Capturing top notch audio</li><li>A structured approach in your editing software (Final Cut Pro is used as an example)</li><li>Advanced techniques for fixing problems in audio and video</li><li>Exporting to most accepted formats</li></ul><p><strong>Real-life examples show you how to behave with confidence in the most typical situations.</strong><br></p><p>Step-to-step guides on how to handle situations like: 1-a video message; 2-an interview; showing conceptual diagrams and outcome of the actual footage. Specific hints on what hardware to use, for a whole range of budget availability. But also universal principles and techniques, to be applied to any scenario you can encounter.</p><p><strong>Discover the best practices of all tasks of the filmmaking business</strong><strong> from an experienced professional.</strong></p><ul><li>controlling the depth of field</li><li>the rule of thirds</li><li>the 30 degree rule</li><li>three-point lighting</li><li>basics of the video narration grammar</li><li>coping with the limitations of given shooting environments</li><li>elegant use of post production tools</li><li>special tools for Canon users (Magic Lantern) </li></ul><p><strong>Contents and Overview</strong></p><p>This course is suitable for both beginner and amateur shooters. You will go through the basic principles of photography, become fully familiar with the concepts of exposure, focus, and depth of field, understanding how these are all intimately correlated. </p><p>The course will then teach you how to capture crisp and clean audio, showing the do's and don't's, how to optimize the use of your equipment, therefore maximizing your investment.</p><p>Then you will learn how to achieve a real professional lighting, especially for situations like video messages and interviews, but with the same concepts also applicable to all situations. Then the most common techniques for framing, planning the shots will be presented, as well as the most used types of hardware to handle your camera.</p><p>Then the post-production: editing, adjusting audio and video problems, building a solid narration with meaningful cuts, transitions and effects, according to the standard of the professional filmmaking guidelines.  </p><p>Each section contains theoretical explanation, as well as practical applications of the concepts, and real-life scenarios. Even the techniques adopted for producing this course itself are eventually shown and explained.</p><p>Special attention is given to Canon DSLRs users, and Final Cut Pro is used as an example of editing software, but all the concepts exposed are applicable and made general for all users and equipment.</p><p><br></p>", 
    "end_date": null, 
    "title": "DSLR video making: the professional workflow and methods", 
    "price": "20.00", 
    "instructors": "Andrea Conigli", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392528_b258_2.jpg", 
    "course_url": "https://www.udemy.com/professional-dslr-video-making/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T23:15:46Z"
}