{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Get started editing your own videos with an incredible free, video editing software for Windows, Linux, or IOS.</strong></p>\n\n<p> Are you looking for an easy to use, powerful video editing application? This course will teach you how to get started with video editing quickly using the free Shotcut App, which rivals some of paid software.</p>\n\n\n\n\n\n\n\n\n\n<p> You don't need to settle for video editing software that is:-</p>\n\n\n\n\n\n\n\n\n\n<ul><li>expensive, difficult to learn software that takes too long to get started,</li><li>free software that are crippled, that prevents you from making the videos you want,</li><li>simple to use, but lack the necessary tools to make professional looking videos,</li></ul>\n\n\n\n\n\n\n\n<p>\n\n</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course covers the following main topics</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Get started quickly so you can start editing the videos you shot</li><li>Overview of the program layout and tools</li><li>Basic video editing like splitting, joining, transitions</li><li>Adding titles, annotation, music, and overlays</li><li>Green screening, or chormakey</li><li>Picture-in-Picture, or PiP.</li><li>Exporting your video in high definition, HD</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Who is this course for:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Beginner video creators looking for a powerful, easy to use video editing application</li><li>Video editors who wants a pro level video editing software on a budget</li><li>Marketing video creators who want to create videos quickly</li></ul><p><strong>Sample material provided</strong></p><p>Although I encourage you to use your own video clips, sample material is also provided for the exercises.</p>", 
    "end_date": null, 
    "title": "Easy Video Editing With Shotcut Video Editor", 
    "price": "45.00", 
    "instructors": "James Woo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672994_c0b8_2.jpg", 
    "course_url": "https://www.udemy.com/easy-video-editing-shotcutapp-video-editor/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T05:56:48Z"
}