{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \tEl Director de cine es una figura que genera mucho interés, tanto para el estudiante que desea convertirse en uno como para el prófano que disfruta con sus películas. Por ello, en CineTécnica hemos querido diseñar este curso gratuito para aportar un poco de luz sobre esta figura, cuyo perfil está en boca de tantos pero cuya labor puede no quedar tan explícitamente explicada como la de los actores, iluminadores, o montadores.  </p>  <p style=\"\">  \tPor lo tanto hemos centrado este curso en una serie de ejes que lo vertebran. En primer lugar nos hemos querido centrar en las habilidades con las que debe contar un buen Director de Cine. Averiguaremos si el carácter influye en la dirección y sobre todo qué áreas de la personalidad conviene desarrollar si uno quiere asumir la responsabilidad de liderar un equipo de rodaje.  </p>  <p style=\"\">  \tTambién nos preguntaremos qué conocimientos técnicos debe haber uno estudiado para poder ser capaz de realizar un proyecto audiovisual, y nos preguntaremos cuánto recae en el Director y cuánto en su equipo técnico.  </p>  <p style=\"\">  \tEstudiaremos las diferentes actitudes que debe tener el Director en las diferentes etapas de la producción de una película: La pre-producción, el rodaje, y la post-producción.  </p>  <p style=\"\">  \tEn definitiva, este curso pretende contestar a las siguientes preguntas:  </p>  <p style=\"\">  \t¿De qué se encarga un Director de Cine? ¿Cuáles son los conocimientos que se deben tener si uno quiere dirigir? ¿Qué capacidades son necesarias? ¿Se puede dirigir siendo tímido? ¿Cómo se debe relacionar uno con el equipo técnico en un rodaje? ¿Se deben aceptar las sugerencias del equipo? ¿El Director puede rectificar una vez que ha tomado una decisión? ¿Qué mentalidad se debe tener al entrar en la sala de montaje?  </p>  <p style=\"\">  \tDe todas estas cuestiones y muchas más hablaremos en este curso de cine gratuito.  </p>  <p style=\"\">  \tY como siempre tendremos al final del curso una pregunta de reflexión, para que pongas en práctica los conocimientos adquiridos, a la que adjuntamos las respuestas para que puedas autocorregirte.  </p>", 
    "end_date": null, 
    "title": "El papel del Director de Cine", 
    "price": 0, 
    "instructors": "Jorge E. Blein", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/223772_d366_4.jpg", 
    "course_url": "https://www.udemy.com/el-papel-del-director-de-cine/", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T09:23:50Z"
}