{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Learn from a professional that has successfully produced 8 movies for under $1000 that were picked up by studios LionsGate, E One and Paramount.</strong><br></p>\n\n<p>This brand new Udemy course shows you the secrets to write screenplays for feature films that can be produced for under $1000. Stop waiting for funding for your script and write one that you can film NOW! Join the other successful filmmakers that have adapted to the new changes in the movie industry. \n\n  </p>\n\n\n\n<p>A class that is a must for ALL filmmakers that are low on cash!\n\n  </p>\n\n\n\n<p>Tired of waiting for funding to produce your script? Then you need to take this class.    \n\n  </p>\n\n\n\n<p>You will know how to take full advantage of things in movies that are free\n\n  </p>\n\n\n\n<p>This class is MOBILE ready for ON-THE-GO. \n\n  </p>\n\n\n\n<p>Every minute you delay is costing your MOVIE’S FUTURE…\n\n  </p>\n\n<p>Enroll now!\n\n  </p>\n\n\n\n<p>Nothing is kept secret – I reveal everything I do to produce micro-budget movie that actually get distribution in the U.S. and overseas.\n\n  </p>\n\n\n\n<p>As well as the Udemy 30 day money back simple guarantee, you have my personal promise that you will be delighted in what I will show you. You will kicking yourself that you haven’t started doing these things!\n\n  </p>\n\n\n\n\n\n<p>You will have a lifetime access to the course and be updated on NEW lectures.</p>", 
    "end_date": null, 
    "title": "Filmmaking Secrets! Write a ZERO Budget Movie|LITE version", 
    "price": 0, 
    "instructors": "Craig McMahon", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823208_a260.jpg", 
    "course_url": "https://www.udemy.com/filmmaking-secrets-write-a-zero-budget-movielite-version/", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T21:33:09Z"
}