{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Learn from a professional that has successfully delivered over 36 movies to distributors.</strong></p>  <p>This brand new Udemy course familiarizes you to the world of Foley. This class shows you how to better engage your audience through the use of Foley. Foley your movie FAST. Improve your chances of a distribution deal for your movie. Know what is needed for overseas deals. Foley is one of the most overlooked processes in Filmmaking. </p>  <p>Sound can make or break a film!</p>    <p>A class that is a must for ALL filmmakers!</p>    <p>Not only will you become an expert in Foley and sound design, you will also improve your overall production quality of all your VIDEO productions.</p>    <p>Does your movie feel slow? Improve your Movie’s pace through sound design. </p>    <p>I show you how I used SOUND DESIGN to resurrect a dead studio deal on a movie.</p>      <p>You will finally understand what M&amp;E is and what is needed for distribution deliverables.</p>    <p>The class is MOBILE ready for ON-THE-GO. </p>    <p>As well as the Udemy 30 day money back simple guarantee, you have my personal promise that you will be delighted in what I will show you. You will kicking yourself that you haven’t started doing these things!</p>    <p>Every minute you delay is costing your MOVIE’S FUTURE…</p>  <p>Enroll now!</p>    <p>Nothing is kept secret – I reveal everything I do as a Foley artist and sound designer. </p>    <p>You will have a lifetime access to the course and be updated on NEW lectures.</p>", 
    "end_date": null, 
    "title": "Filmmaking Secrets! The Easy Way To FOLEY Your Movie Master", 
    "price": "20.00", 
    "instructors": "Craig McMahon", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783436_5a89_5.jpg", 
    "course_url": "https://www.udemy.com/filmmaking-secrets-the-easy-way-to-foley-your-movie-master/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T20:49:08Z"
}