{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "\n\n<p>Right off the bat, you will learn the six shots that make it easy to film and edit mobile video.</p><p>The ultimate goal is to use video to tell a good story.</p><p><strong class=\"redactor-inline-converted\">\"Once I started the course, I could not quit until I had completed it. Each segment was interesting, informative, creatively presented and edited with precision. I loved the course and learned a lot from it.</strong> — Randy Hendricks<br></p><p> In this course, pro filmmaker Robb Montgomery uses real-world examples to show you how to create compelling stories using video.</p><p>How you choose your shots, craft your story, and edit your footage is what draws attention to your videos. <br></p><p>The course shows the best methods to make stunning iPhone videos that look truly professional. Over 100 tutorials in this course!<br></p><p><strong class=\"redactor-inline-converted\">“If you want to learn how you can effectively use your smartphone to create documentary stories, then Robb's course is a must.\"</strong> — Ken Katz</p>\n\n<p>Register now and quickly learn how to film and edit amazing video with an iPhone.</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<li> 100+ lectures and 7 hours of content!</li><li> Over 8,000 satisfied students are enrolled in this instructor's courses</li><li>New BONUS section on using the OSMO action cam with your iPhone to film and edit 4k video on your phone.</li><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong class=\"redactor-inline-converted\">Go from amateur to professional video maker at your own pace.</strong></p><p>This course will teach you everything you need to know to be able to earn extra money making video with your smartphone.</p>\n\n<p><strong class=\"redactor-inline-converted\">Save time and money making social video.</strong><br>Communications officers, journalists and media outlets are quickly turning to the iPhone to produce high quality video at lower cost than hiring a DSLR film crew.</p>\n\n<p><strong class=\"redactor-inline-converted\">Improve your career.</strong><br>This course will give the video skills that can help you get a better job.</p>\n\n<p><strong class=\"redactor-inline-converted\">\"This course by Robb Montgomery is packed with rich content and information on how to create videos. Each lecture provided instructional materials and tools to help you make video production easy. This is a course not to be missed. \"</strong> — Jane Lee</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<p>Journalism professors use this course in their classrooms.</p>\n\n<p><strong class=\"redactor-inline-converted\">\"Robb is one of the leading mobile journalism and storytelling trainers in the world. I took his Smart Film School course to hone my skills, but ended up learning new techniques and ways to become a better storyteller.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">There are trainers and there are educators, and then there is Robb Montgomery. Want to get a better understanding of what I mean? Then preview a Smart Film School course and I think you will agree with me.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">If you are a student, media practitioner., or just a person wanting to use new technologies to tell a visual story, then the Smart Film School will give you the skills and foundation.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">The course has helped me in my teaching at the University of Notre Dame.”</strong></p>\n\n<p>— Len Clark </p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<p>We go over the apps and gear that will transform your phone into a video camera and then each video lecture will show you the step-by-step techniques for making mobile video stories.</p>\n\n<p><strong class=\"redactor-inline-converted\">In this masterclass you will learn how to:</strong></p>\n\n<ul><li>Plan and produce short form video</li><li>Film and edit video on the smartphone</li><li>Frame and edit interviews and sound bites</li><li>Make and post video for social platforms</li><li>Set up the camera for best results</li><li>Select the best gear</li><li>Select the best apps</li><li>Use a shot pattern that simplifies video editing</li><li>Perform simple, but powerful video editing in iMovie</li><li>Produce voice over narration and write scripts</li><li>Get paid to make smartphone video</li><li>Substantially increase the quality of your videos</li><li>Understand why certain types of videos work better than others</li><li>Learn how to plan your video for the best results</li><li>Film and edit video on the smartphone</li><li>Transform 10 photos into a video story</li><li>Plan and produce short form video</li><li>Produce news stories and video packages</li><li>Make videos about your company</li><li>Make great motion shots</li><li>Choose the best microphones and lights</li><li>Execute special shots like time-lapse and hyperlapse shots</li><li>Make short films and documentaries</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><br>“I was very pleased to learn about the shooting methods and especially the apps that can allow me to control the camera and edit footage. Robb is very clear and straightforward in his teaching, and I appreciate the way his lectures are backed up with slide or text reviews. Production quality is professional. Overall, this is a course you need to take if you want to use your phone or tablet for more than a still camera. Highly recommended!”</strong> – Stephen Box</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<p>I encourage you to learn how to make video stories and take your job to the next level.</p>\n\n<p>No previous video production experience is required.</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<p>Important information before you enroll</p>\n\n<li> Take this course, risk-free. It is backed by a 30 day money-back guarantee, full refund, no questions asked.</li><li> Once enrolled, you have unlimited lifetime access to the course</li><li> You will have instant access to all updates added to the course</li><li> Take a free preview and be assured of the lecture quality</li><p><br><strong class=\"redactor-inline-converted\">“As a professional journalist I need to know how to use my mobile as a tool in my job. This course is like a guide, step by step to make video using your smartphone.”</strong> — Ioanna Iliadi</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<p>Who is this for?</p>\n\n<p><strong class=\"redactor-inline-converted\">This course is designed for storytellers: Journalists, Media educators, Classroom teachers, Communications teams, New media managers, Correspondents, Online producers, Content marketers, and Video producers.</strong></p>\n\n<p>Smart Film School certificate courses are being used by media professors in journalism schools to train the next generation in smartphone video reporting. <br></p>\n\n<p>All students earn a certificate when they complete all assignments for their class.</p>\n\n<p><strong class=\"redactor-inline-converted\">“I liked the way this course flowed from topic to topic with bite size chunks of useful information that made it easy to understand. Definitely worth the time invested in studying.” </strong>— Stephan Hendricks</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<p><strong class=\"redactor-inline-converted\">Enroll now and start making video with your mobile phone.<br></strong> Let’s get started!</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>", 
    "end_date": null, 
    "title": "Filmmaking: Shoot and Edit iPhone Video Like a Pro", 
    "price": "40.00", 
    "instructors": "Robb Montgomery", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310888_e524_20.jpg", 
    "course_url": "https://www.udemy.com/make-smartphone-video-like-a-pro-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T15:31:45Z"
}