{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Why Take this Course?</strong><br></p><p>Are you an Independent Video Creator, Youtuber, Online Business Owner, Teacher, Video Blogger or simply like to produce online videos for fun? Well, sometimes filming in a natural environment like your living room or bedroom can be a bit distracting for the viewer.</p><p>This is why many professional video productions use a backdrop for their videos, and in this course you will learn how to film and produce a video with a 100% black background.</p><p><strong>Benefits for You</strong></p><ul>\n<li>Make your Video look more Professional</li>\n<li>Create a Focused and Serious Look</li>\n<li>Get your Message across without a Distracting Background</li>\n</ul><p><strong>Examples of Use Cases</strong></p><p><strong></strong></p><ul><li>Product Reviews</li>\n<li>Demonstration Videos</li>\n<li>Show How to Assemble a Product</li>\n<li>Show How to Use a Product</li>\n<li>Instructional and Teaching Videos</li>\n<li>Video Blogs and Discussions</li>\n<li>Advertisements</li>\n</ul><p><strong>Course Overview</strong></p><p>This course is divided into 3 separate sections. The first section covers The Foundations, with real world examples, practical use cases and even a short little story. I will also give you my advice on how you can get the most out of this course.</p><p>The second section covers the practical stages, which basically is the meat of the course. This is where you will learn the step by step process for creating your black background videos.</p><p>The third section is a bonus section where I give some extra advice from my practical experience, as well as describe my own personal setup for black background video production.</p><p>You will finish the course by completing a course project, which will be to create your own black background video.</p><p><strong>What is in this Course?</strong></p><ul>\n<li>6 years of video production experience condensed into a ~ 1 hour video course</li>\n<li>Step by step instructions for creating your own black background videos</li>\n<li>A dynamic and personal style of teaching</li>\n<li>Mixed formats to create more interest for you</li></ul>", 
    "end_date": null, 
    "title": "Film and Produce a Black Background Video", 
    "price": "20.00", 
    "instructors": "Mikael Baggström", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693852_1643.jpg", 
    "course_url": "https://www.udemy.com/film-and-produce-a-black-background-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T10:07:58Z"
}