{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Before you read what I have to say, see what our other students are saying about our course:<br></p><p><strong><em>As Festival Producer with the Edmonton International Film Festival (EIFF) in Canada for nearly 15 years, I have experienced a whole lotta misinformation about what film festivals DO and I completely support the sharing of ACCURATE information in a non-biased way. To be honest, I was a bit skeptical about this course, titled FILM FESTIVAL HACKS. From the first segment, I was hooked. </em></strong></p><p><strong><em>Chris and Alex have created a fascinating journey that is relevant to both filmMAKERS and festival organizers. Chris's experience behind-the-scenes at numerous festivals combined with Alex's experiences attending festivals makes for a well-rounded and completely candid course that is less 'instruction' and more In the Actor's Studio. A few chapters into it, I thought -- (insert gratuitous coarse language here) EVERYONE needs to certify themselves as FILM FESTIVAL HACKS! </em></strong></p><p><strong><em>And the course reminded me that we (at EIFF) aren't all alone on an island, hoping that what we do will resonate with filmMAKERS and that our annual event has VALUE for everyone -- audiences included!.</em></strong><strong><em> - Kerrie Long</em></strong></p><p>-------------------------------------------------------------------------------------------------------------------</p><p>Can't get your indie film into film festivals? Are you tired of spending TONS OF CASH, you don't have, on submission fees? Want to get the inside secrets to give your film the best chance on being accepted to film festivals?</p><ul><li>Don't have <strong>the money continue submitting to film festivals?</strong></li><li>Do you want to <strong>submit to film festivals for cheap or FREE</strong><strong>?</strong></li><li>Do you want to <strong>learn how I got my films accepted into almost 600 international film festivals without paying submission fees?</strong></li><li>Do you want to <strong>Enroll NOW</strong><strong> and get into the minds of film festival programmers? Let's get started</strong><strong>? </strong></li></ul><p><strong><br></strong></p><p><strong>Film Festival Hacks is a course pulls back the curtain on the film festival business (and it <em>is</em> a business). THIS IS A MUST FOR ALL FILMMAKERS!</strong><br></p><p>-------------------------------------------------------------------------------------------------------------------</p><p><strong>Save TIME and MONEY by </strong>learning what film festivals are looking for and how to position your short or feature film to have a fighting chance of being accepted<strong>. </strong></p><p><strong>This is a LIVING COURSE, we will be adding to it and updating it often!</strong></p><p><strong>You will be taught from both sides of \"the badge.\" </strong>Alex Ferrari is an award winning filmmaker with almost <strong>600 international film festivals under his belt. </strong>He'll show you<strong> tricks and techniques on how he got his features and short films accepted with paying little or NO MONEY!</strong></p><p>Here's what <strong>legendary film critic Roger Ebert </strong>(which he met at a film festival) had to say about Alex's short film:</p><p><em><strong>\"BROKEN is essentially a demonstration of the mastery of horror imagery and techniques...effective and professional.\" - Roger Ebert (Chicago SunTimes)</strong></em></p><p><strong>On the \"other side of the badge\" is Chris Holland, </strong>author of <em><strong>Film Festival Secrets: A Handbook for Independent Filmmakers</strong></em> and festival organizer who has been on staff at two Academy-Accredited (Oscar-qualifying) film festivals<strong>. </strong></p><p>Chris has also worked closely with the staff of <strong>more than 200 festivals worldwide, </strong>including <strong>Sundance, Slamdance, AFI Fest, SXSW, and many more. </strong>Over the last decade he has consulted on<strong> festival strategy with hundreds of filmmakers</strong> just like you and helped them take control of their run on the festival circuit.</p><p>-------------------------------------------------------------------------------------------------------------------</p><p><strong><em>\"Great tips from both sides of the industry - movie producer with plenty of festival experience, and a festival guru that knows the process inside out. this will save you lots of head scratching and give you the confidence and the knowledge you need to start submitting your movie to festivals.\" - Ioannis Tsiokos</em></strong></p><p>-------------------------------------------------------------------------------------------------------------------<br></p><p><strong>Here's a bit about Film Festival Hacks:</strong></p><p><em><strong></strong></em></p><p>Included in this game changing course: <strong>more than 4 hours (and growing)</strong> of insider secrets and strategies for getting your film into film festivals (<strong>over 35 videos</strong>). <strong>There has never been an online seminar like this one -- it’s the Ultimate Film Festival Course. </strong></p><p>-------------------------------------------------------------------------------------------------------------------<br><br><strong>FILM FESTIVAL HACKS COVERS:</strong></p><p><strong>Why Submit to Film Festivals Today</strong></p><ul><li><strong>Audience Building</strong></li><li><strong>Distribution for Your Film</strong></li><li><strong>Career Building and Networking</strong></li><li><strong>Travel the World</strong></li><li><strong>Educate Yourself for FREE</strong></li><li><strong>Prize Money and Awards</strong></li></ul><p><strong>-------------------------------------------------------------------------------------------------------------------<span></span></strong></p><p><strong><strong>The Hidden Benefits of Film Festivals</strong></strong><br></p><ul><li><strong>What are Your Goals?<span></span></strong></li><li><strong>This is a Business, and the Film Festival is Your Customer<br></strong></li><li><strong>How to Do Research<br></strong></li><li><strong>How to Submit to Film Festivals for Cheap or FREE</strong></li></ul><strong><p>-------------------------------------------------------------------------------------------------------------------</p>Understanding the \"Mystery\" of How Film Festivals Program their Fests</strong><ul><li><strong></strong><strong>The Screening Process</strong></li><li><strong>Common Fears and Myths</strong></li><li><strong>Film Festivals Have an Audience to Serve</strong></li><li><strong>The #1 Predictor of Film Festival Success</strong></li></ul><p>-------------------------------------------------------------------------------------------------------------------</p><p><strong>How to Leverage a Film Festival Screening to Help Sell Your Film</strong></p><ul><li><strong>Audience Building Techniques</strong></li><li><strong>Networking with Other Film Festival Programmers<span></span></strong></li><li><strong>Discover What Distributors Want and How to Find Them<span></span></strong></li><li><strong>What are Your Chance of Getting a Traditional Distribution Deal?<span></span></strong></li></ul><p>-------------------------------------------------------------------------------------------------------------------</p><p><strong>Technical Requirements for Film Festival</strong><strong><br><span></span></strong></p><ul><strong><li><strong>What’s a DCP?</strong></li></strong><li><strong><strong><strong><strong><strong>Quicktime Compression</strong></strong></strong><br></strong></strong></li><li><strong>HDCam vs HD-SR<span></span></strong></li><li><strong>DVD and BluRay<span></span></strong></li><li><strong>Warnings and Security<span></span></strong></li></ul><p><strong><br>and much more!</strong></p><p>-------------------------------------------------------------------------------------------------------------------<br></p><p><strong><em></em>Important information before you enroll:<em></em></strong></p><ul><li>In case you find the course useless, don't forget you are covered by a<strong> 30 day money back guarantee, full refund, no questions asked!</strong></li><li>Once enrolled, you have <strong>unlimited, lifetime access to the course!</strong></li><li>You will have <strong>instant and free access to any updates</strong> I'll add to the course.</li><li>You’ll get access to the course discussion forum, where you can <strong>ask us questions</strong> and <strong>compare notes with your fellow students</strong>.</li><li>We will give you <strong>our full support</strong> regarding any issues or suggestions related to the course</li></ul><p>-------------------------------------------------------------------------------------------------------------------<br></p><p><strong>Enroll NOW</strong><strong> and learn the secrets of getting your indie film into film festival around the world! Let's get started!</strong></p>", 
    "end_date": null, 
    "title": "Film Festival Hacks: How to Submit to Festivals Like a Pro", 
    "price": "45.00", 
    "instructors": "Alex Ferrari, Christopher Holland", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733074_6d80.jpg", 
    "course_url": "https://www.udemy.com/film-festival-hacks-filmmaking/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T18:12:21Z"
}