{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong><em>This online GoPro course will teach you how to shoot and edit amazing videos with a GoPro camera.</em></strong></p><p><span>This course is designed to teach you the ins and outs of using a GoPro camera, even if you have little to no experience with them. While there are plenty of video courses, it's hard to find a comprehensive course that takes you from shooting to editing GoPro videos. </span></p><p><span><strong>Master the settings and options in your GoPro camera to create extraordinary images.</strong><br></span></p><ul><li>Master shooting with the manual settings</li><li>Choose the quality settings, frame rate, and field of view right for your project</li><li>Use the right accessories and mounts to get the shots you've dreamt of</li><li>Learn how to edit professional quality videos with GoPro Studio</li></ul><p><strong>Improve Your Video Creation Techniques &amp; Edit Great Videos</strong></p><p><strong></strong>Regardless of the type of GoPro you are using (Hero to Hero 4), this course will teach you the basics of using the GoPro. Dive into the menu to learn all of the settings. Shoot better-looking videos with amazing tips on GoPro cinematography.</p><p><strong>This course includes an entire course on how to edit videos in GoPro Studio:</strong><br></p><ul><li>Import videos and pull the best selects</li><li>Edit together a sequence of beautiful clips</li><li>Add titles, transitions, and music to improve your video</li><li>Make your video look better with color correction and grading techniques</li><li>Use style presets that make your videos AWESOME</li><li>Export HD video for online sharing</li></ul><p><strong>If you want to learn how to make great videos with a GoPro camera, this is the only course you need.</strong></p><p>Enroll today, and we'll see you in the course.</p>", 
    "end_date": null, 
    "title": "GoPro for Beginners: How to Shoot & Edit Video with a GoPro", 
    "price": "20.00", 
    "instructors": "Phil Ebiner, Anthony Ebiner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639674_3967_2.jpg", 
    "course_url": "https://www.udemy.com/gopro-tutorials-for-beginners-how-to-shoot-edit-video-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T20:54:39Z"
}