{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t Have you ever wondered how green screens work? Have you ever tried to edit your green screen but given up because it doesn't look good? Go from beginner to pro in this course on Green Screen Editing. Philip Ebiner has been editing green screen for over 5 years and is now a full time video creator at a college where he shoots and edits green screen online courses full time!  </p>  <p>  \t Whatever software you are using, this course is right for you. We have complete chapters on:  </p>  <ul>  \t<li><strong>Adobe Premiere Pro</strong></li>  \t<li><strong>Adobe After Effects</strong></li>  \t<li><strong>Final Cut Pro X</strong></li>  \t<li><strong>Final Cut Pro 7</strong></li>  </ul>  <p>  \t Each lesson is a video screencast with easy-to-follow directions. Also included are sample green screen videos to use while practicing. Follow along and really learn how to become a pro green screen editor. If you have never tried green screen editing, this course is for you. If you have some experience but just want to improve your skills, this course is also for you!  </p>  <p>  \t With over 3 hours of content, you can learn how to edit green screen in 4 different editing programs.  </p>  <p>  \t <strong>Download a free trial of </strong>Adobe After Effects from the Adobe website!  </p>  <p>  \t <strong>Download a free trial of </strong>Adobe Premiere Pro by from the Adobe website!  </p>  <p>  \t I guarantee that you will enjoy this class! Thanks!</p>", 
    "end_date": null, 
    "title": "Green Screen Editing: Final Cut, Premiere Pro, After Effects", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30411_6800_5.jpg", 
    "course_url": "https://www.udemy.com/greenscreen/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-23T20:16:46Z"
}