{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Become a green screen professional creating videos that look great.</strong></p>\n\n<p>This course is going to take you through the end to end process of making a professional looking green screen video from creating your own low-cost video studio to properly lighting the green screen, narrating the video whilst filming, using a home made auto prompter, and editing the final production.</p>\n\n\n\n\n\n\n\n<p>Green screen videos can look amazing and can help any video that you produce stand out from the crowd - meaning  better engaged viewers and increased potential for improved sales boosting your profits. Videos are everywhere these days and the last thing you want to do is to spend a long time creating a very ordinary video which achieves nothing. </p>\n\n<p>Once you create your own green screen studio you have so much more flexibility to create great looking videos and really achieve the results that you are looking for.</p>\n\n\n\n\n\n\n\n<p>In this course we first cover what exactly a green screen video is and how you can benefit from using these.</p>\n\n\n\n<p>Next we focus on how a green screen studio is structured and what Items it contains. We then give you examples of low-cost components you can purchase or construct to make your own low-cost green screen studio.</p>\n\n\n\n<p>Sometimes things go wrong and we want you to avoid the most common errors when shooting a green screen video. We include actual examples of common problems and how you can avoid these when shooting your videos.</p>\n\n\n\n<p>Finally we show you how to edit your green screen videos both in Camtasia and also in a free video editor which produces great looking results.</p>\n\n<p>Subscribe to this course now and take the first step towards making your sales and educational videos look as though they were produced by a professional studio.</p>", 
    "end_date": null, 
    "title": "Green Screen Video: Budget Studio Setup And Chroma Key Edits", 
    "price": "20.00", 
    "instructors": "Alan Higginson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834518_2b3a_3.jpg", 
    "course_url": "https://www.udemy.com/green-screen-video-budget-studio-setup-and-chroma-key-edits/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-28T15:46:05Z"
}