{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t Hoy en día enganchar al espectador es cada vez más complicado. Las expectativas de la audiencia son siempre muy altas, y su capacidad crítica está hoy en día muy desarrollada.  </p>  <p>  \t Por lo tanto, los primeros 30 minutos de una película son absolutamente decisivos para conseguir captarle la atención y establecer una buenas bases para el resto de la narración. Eso es lo que se llama el Primer Acto. En él debes enganchar al público y establecer las bases de lo que continuará. De su eficacia depende el resto del argumento.  </p>  <p>  \t En este curso aprenderás, a través de sus 47 clips de películas, a que tus guiones arranquen con fuerza suficiente como para que el público no quiera levantarse de la butaca.  </p>  <p>  \t Además, conocerás las respuestas a las siguientes preguntas: ¿Cómo usar los primeros minutos de tu película para generar más tensión dramática en el clímax? ¿De qué formas podemos generar curiosidad en la audiencia nada más comenzar la película? ¿Cuándo es necesario usar un prólogo y cuándo es opcional? ¿Cuáles son los elementos imprescindibles que debe contener un conflicto? ¿En qué consisten los 3 tipos de conflicto en los que desemboca cualquier historia? ¿Cuáles son las 3 maneras en las que el conflicto se integra en el detonante? ¿Cómo ha evolucionado el Mcguffin desde que lo acuñó Hitchcock? ¿Por qué debemos posicionar emocionalmente al público frente a los personajes durante el primer acto y cómo conseguirlo? ¿Qué tipos de Primer Punto de Giro existen, y cómo se relacionan con el tipo de detonante que tuvimos?  </p>  <p>  \t De todas estas cuestiones y muchas más hablaremos en este curso de guión audiovisual, que podrás aplicar a cualquier producto de ficción argumental, ya sea un largometraje, cortometraje, serie o incluso WebSerie.  </p>  <p>  \t Y como siempre, tendremos al final del curso una pregunta de reflexión, para que pongas en práctica los conocimientos adquiridos, a la que le adjuntamos las respuestas para que puedas autocorregirte.  </p>", 
    "end_date": null, 
    "title": "Guión de Cine: Estructura Narrativa Clásica - Primer Acto", 
    "price": "20.00", 
    "instructors": "Jorge E. Blein", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230410_a8a2_2.jpg", 
    "course_url": "https://www.udemy.com/guion-de-cine-estructura-narrativa-clasica-primer-acto/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T01:57:30Z"
}