{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t Una vez superado el arranque del guión, te enfrentas al reto del segundo acto: muchas hojas que escribir, muchas subtramas que gestionar, y un rumbo argumental que a poco que te descuides puede verse completamente alterado.  </p>  <p>  \t Se suele decir que esta es la parte más dificil de un guión, puesto que el guionista siempre sabe cómo quiere que empiece su película y cómo quiere que acabe. Y en efecto es así. Hay una gran mayoría de películas que se “desinflan” durante el segundo acto.  </p>  <p>  \t Este curso te ofrece las herramientas creativas para que eso no te suceda a ti.  </p>  <p>  \t Los 45 clips de películas de este curso te enseñarán a superar las dificultades de este acto, para que el interés de tu audiencia no decaiga ni un minuto.  </p>  <p>  \t Y, por supuesto, conocerás la respuesta de estas preguntas: ¿Por qué es un error presentar nuevos personajes ya avanzado el segundo acto y en qué situaciones excepcionales puede hacerse? ¿En qué circunstancias podemos usar las coincidencias correctamente para mover la historia hacia delante? ¿Cuál es el máximo error que podemos cometer cuando manejamos micro-objetivos? ¿Cuáles son los 5 elementos claves para generar tensión dramática durante el segundo acto? ¿Cuáles son las 4 razones para usar tramas secundarias y cómo vamos a integrarlas correctamente con la principal? ¿De qué forma un punto de crisis ayuda a generar el 2º Punto de Giro? ¿Cuáles son las 4 técnicas que existen para crear 2º Puntos de Giro? ¿Cómo conseguir que el 2º Punto de Giro sea capaz de precipitar los acontecimientos?  </p>  <p>  \t De todas estas cuestiones y muchas más hablaremos en este curso de guión audiovisual, que podrás aplicar a cualquier producto de ficción argumental, ya sea un largometraje, cortometraje, serie o incluso WebSerie.  </p>  <p>  \t Y como siempre, tendremos al final del curso una pregunta de reflexión, para que pongas en práctica los conocimientos adquiridos, a la que le adjuntamos las respuestas para que puedas autocorregirte.  </p>", 
    "end_date": null, 
    "title": "Guión de Cine: Estructura Narrativa Clásica - Segundo Acto", 
    "price": "20.00", 
    "instructors": "Jorge E. Blein", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230760_ce0f_2.jpg", 
    "course_url": "https://www.udemy.com/guion-de-cine-estructura-narrativa-clasica-segundo-acto/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T12:35:04Z"
}