{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t Cuando piensas que ya has hecho lo más difícil, llega el tercer acto. Ahora es el momento en el que tu guión debe estar a la altura. Si no es así, todo lo anterior no habrá servido para nada y los espectadores saldrán de tu película con una sensación de decepción.  </p>  <p>  \t Es frecuente que los finales decepcionen, o que la audiencia crea que no han estado a la altura. Es lógico que suceda eso, cuando el guionista ha generado expectativa pero luego no ha sabido resolverla de manera convincente. (y esto sucede tanto en largometrajes como en series…).  </p>  <p>  \t Para que esto no te suceda, te ofrecemos una serie de recursos que puedas aplicar en tus finales y conseguir que tu público salga con un gran sabor de boca.  </p>  <p>  \t Por lo tanto, con más de 35 clips de películas, este curso te permitirá incorporar al tercer acto todo tipo de herramientas narrativas para conseguir que las sorpresas y la tensión dramática del final satisfagan a tu audiencia.  </p>  <p>  \t También conocerás las respuestas a estas preguntas:  </p>  <p>  \t ¿Cuál es el error más frecuente que podemos cometer con respecto al desequilibrio de fuerzas entre los personajes? ¿Qué 5 elementos narrativos ayudan a generar tensión dramática durante el clímax? ¿Qué debemos hacer una vez que se ha acabado el clímax? ¿Cómo hay que usar las tramas secundarias durante el tercer acto? ¿A qué nos referimos cuando hablamos de “un final abierto”? ¿Cómo vamos a conseguir que un final sorpresa funcione? ¿Cuáles son las 4 formas en las que podemos cerrar nuestras tramas? ¿Qué riesgos existen cuando diseñamos un “final feliz” y uno que no lo es?  </p>  <p>  \t De todas estas cuestiones y muchas más hablaremos en este curso de guión audiovisual, que podrás aplicar a cualquier producto de ficción argumental, ya sea un largometraje, cortometraje, serie o incluso WebSerie.  </p>  <p>  \t Y como siempre, tendremos al final del curso una pregunta de reflexión, para que pongas en práctica los conocimientos adquiridos, a la que le adjuntamos las respuestas para que puedas autocorregirte.  </p>", 
    "end_date": null, 
    "title": "Guión de Cine: Estructura Narrativa Clásica - Tercer Acto", 
    "price": "20.00", 
    "instructors": "Jorge E. Blein", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230774_85f9_4.jpg", 
    "course_url": "https://www.udemy.com/guion-de-cine-estructura-narrativa-clasica-tercer-acto/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T12:53:37Z"
}