{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "Some people are fortunate enough be able to commission beautiful video biographies of family members, to be handed down and cherished for generations. But, the process is long and expensive. Not everyone can afford a video biography done by a professional.    <p style=\"\">  \t    The typical Family Legacy Video runs from $5,000 to $10,000. I know, because I&#039;ve been producing Family Legacy Videos for more than fifteen years.  </p>  <p style=\"\">  \t<strong style=\"\">The good news is that, even Hopelessly Busy People Can Make a Family Legacy Video in a Few Weekends and For Very Little Cost.</strong>  </p>  <p style=\"\">  \t    It always breaks my heart when I see families with elders who have wonderful, important stories to tell, but they never get recorded or preserved because the family either can&#039;t afford to have it done, or they just don&#039;t know what to do.  </p>  <p style=\"\">  \t    That&#039;s why I decided to develop this course: to show you how to do it yourself, and to do it quickly at very little cost.  </p>  <p style=\"\">  \t    I lead you through the process step-by-step. I&#039;ll take you from the initial idea, to getting your family member to sit in front of your camera, setting up your video shoot, getting good quality video, sound, and lighting, editing, and finally, turning the project into a polished DVD as a gift for the entire family, both now and for generations to come.  </p>  <p style=\"\">  \t<strong style=\"\">There are many reasons to create a Family Legacy Video: </strong>  </p>  <ul style=\"\">  \t<li>Celebrate someone&#039;s life</li>  \t<li>Preserve important family stories and memories</li>  \t<li>Gain insight into the struggles, choices, and forces      that shaped the person&#039;s life, which in turn shaped the life of the family</li>  \t<li>Share your wisdom and the lessons the person has      experienced</li>  \t<li>Put names and stories with those old family photos</li>  \t<li>Bring life to the family tree</li>  \t<li>Connect the generations</li>  \t<li>Bear witness to events that affected many</li>  \t<li>Give back to the family</li>  \t<li>As a gift from one generation to the next</li>  </ul>  <p style=\"\">  \t    A Family History Video may be your most important legacy. In this course, you will learn how to make one relatively quickly, and at a small fraction of the cost of hiring a professional.  </p>  <p style=\"\">  \t<strong style=\"\">Contents and Overview</strong><br style=\"\">  \t     In over 2 hours of content, including 22 lectures, this course covers why Family Legacies are important, how to choose a subject, convincing your subject to tell their story, collecting the photos and memorabilia and organizing it.  </p>  <p style=\"\">  \t    This course also covers what equipment you&#039;ll need, how to set it up for the video shoot, sound and lighting, and what kind of questions to ask your subject on camera.  </p>  <p style=\"\">  \t    You will also learn about editing your video with photos, archival footage, and music, among other important lessons.  </p>  <p style=\"\">  \t    Upon completion students will have the knowledge and skills to conceive of a biographical video documentary, featuring an important loved one in the family, set up an effective video recording session, in which the subject tells the stories from their past, including memories, experiences, wisdom and advice for future generations. They will be able to take the raw video, import it into a video editing software program, and turn it into a compelling video biography on DVD for showing the family, and for preserving for 100 years and beyond.  </p>", 
    "end_date": null, 
    "title": "Honor Your Family By Making Your Own Family History Videos", 
    "price": "20.00", 
    "instructors": "Stan Prentice", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360366_282b_10.jpg", 
    "course_url": "https://www.udemy.com/family_history_video/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T08:13:49Z"
}