{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Are you ready to start editing video stories with your iPhone?</p><p><strong>“I like the way the course is arranged. The short segments make it easy to digest and easier to remember.”</strong> — Jackie P Hampton<br></p><p>This step-by-step class teaches beginning and advanced tips to make and edit professional video content with an iPhone or iPad.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>My courses have the highest average review rating in the video category on Udemy!</p><ol><li>30 lectures and 3 hours of content!</li><li>Over 7,500 satisfied students are enrolled in the Smart Film School courses</li><li>These courses have more than 130 five-star reviews</li><li>Last month over 300 students joined Smart Film School courses</li></ol><p><strong><br>“I started making movies right away and feel very inspired. Thanks, Robb!” </strong>— Jennifer Doettling<br></p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>This course is continuously updated.</p><p><strong>“I particularly like the fact that Robb updates his courses on a regular basis with new content in this fast paced field. If something new comes out he adds it and points to how useful it can be. This course is more than just editing techniques - it is a gateway into making more effective videos for mobile. I was really impressed. I thoroughly recommend it.” </strong>— Leon Cych</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>This course will teach you everything you need to know to edit video with an iPhone or iPad.</p><p><strong>Save time and money making social video.</strong><br>Communications officers, journalists and media outlets are quickly turning to the iPhone to produce high quality video at lower cost.</p><p><strong>Improve your career.</strong><br>This course will give the video skills that can help you get a better job.</p><p>Journalism professors use this course in their classrooms.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>You will learn how to edit high quality video stories with the iMovie app.</strong></p><ul><li>Fundamentals of editing video</li><li>Building a video from sequences</li><li>Making titles and lower-thirds</li><li>Trimming and arranging clips</li><li>Shortcuts and themes that work best in iMovie</li><li>Building a video on the timeline</li><li>Managing audio</li><li>Recording voice-over narration</li><li>Making a video from still photos</li><li>Shot sizes</li><li>A six shot pattern that makes great videos</li><li>Storyboarding</li><li>Titles and lower-thirds</li><li>Sharing to social media</li><li>TV-Style cutaway edits for interviews</li><li>Speed ramping and other modern techniques</li><li>Working with time-lapse and slow motion footage</li></ul><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>I encourage you to learn how to produce video stories and take your job to the next level.</strong></p><p>No previous video production experience is required.</p><p><strong>\"This is an excellent course for beginners and also those people who want to get on board with how to make and manipulate mobile film and video to create compelling content.” </strong>— Leon Cych<br></p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>Important information before you enroll</strong></p><ul><li>Take this course, risk-free. It is backed by a 30 day money-back guarantee, full refund, no questions asked.</li><li>Once enrolled, you have unlimited lifetime access to the course</li><li>You will have instant access to all updates added to the course</li><li>Take a free preview and be assured of the lecture quality<br></li></ul><p><strong>\"Great course! Very easy to understand. I learned everything I expected, and more. I started making movies right away and feel very inspired!”</strong>— Jennifer D</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>Master iMovie video editing for iPhone <br><strong>Learn the video secrets from a world expert on mobile video and documentary film.</strong></p><p>Make pro travel videos that you can sell, or, make videos for content marketing and social video channels like Twitter, Snapchat and Facebook.</p><p>You can even use iMovie to edit videos for your video podcasts or to promote your small business.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>Who is this for?</p><p><strong>This course is designed for anyone with an interest in making better iPhone video.</strong></p><p>Small business owners, coaches, teachers, moms, travel and food lovers, filmmakers, media teachers, media students, content marketers, and journalists.</p><p><strong>“I liked the way this course flowed from topic to topic with bite size chunks of useful information that made it easy to understand. Definitely worth the time invested in studying.” </strong>— Stephan Hendricks</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p><strong>Enroll now</strong> and start editing video with iMovie on your iPhone.</p><p>Let’s get started!</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>", 
    "end_date": null, 
    "title": "iMovie app: Edit video stories on your iPhone or iPad - iOS", 
    "price": "20.00", 
    "instructors": "Robb Montgomery", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441900_2d27_4.jpg", 
    "course_url": "https://www.udemy.com/master-imovie-video-editing-app-for-iphone-pro-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T13:52:14Z"
}