{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>This course is based on iMovie for iPad and iPhone. iMovie is a film editing application by Apple which can be installed for free on all new iPhone and iPad, older models of iPhone and iPad may have to pay to install this app. </p><p>iMovie can be used to add that little bit of extra spice to your home movies. You can add transitions so that two home movies can be made to look like one. Adding Background music can make a plain video clip into something special. </p><p>You can create trailers from the predefined templates that apple have created, to have some fun with family and friends while creating something that has a Hollywood style to it. </p><p>Simple terms are used so that users of all levels will be able to understand. I have provided sample videos that can be used to practice so that you can get the most out of the course. You can use the sample videos as a basis to learn the practical elements of the iMovie app. Once you have mastered the app, you can then try the same procedures using your own videos.  I have taken the most important parts of the iMovie app and condensed it into an hour long course, you will have lifetime access to the course so you will be able to watch the video lectures over and over.  </p><p>Use this course as a way to improve the home movies on your iOS device, but most of all, use this course so you can have some fun and get the most out of your iPhone or iPad.</p>", 
    "end_date": null, 
    "title": "iMovie for iPad & iPhone", 
    "price": "20.00", 
    "instructors": "Colin Marks", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662573_829b_2.jpg", 
    "course_url": "https://www.udemy.com/imovie-for-ipad/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T00:14:20Z"
}