{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Follow award-winning broadcast professional, Andrew St Pierre White as he takes you set-by-step, as he conceptualises, shoots and edits two of his highly acclaimed TV documentaries. The first is based on a one-hour special documentary broadcast by Discovery Channel, and the second a half-hour serialised episode of a 26-part African adventure travel story.</p><p>Once released, critics used the words, \"gripping\", \"superb\", outstanding\" in their reviews of these films.</p><p>The course consists of a series of videos with details of what is being taught as written summaries.</p><p>The documentary is run, and as the story unfolds, the director/producer goes though all the thoughts, processes, equipment and creative processes used. This is a real-life event, valuable to those who both shoot and edit stories on video.</p><p>As every scene is covered, the shooting techniques, editing ideas and storytelling methods are revealed. This is an actual documentary, so what is taught is not just theory— it has become fact, and you can see the results for yourself.</p><p>The documentary was produced by an indie producer, yet still sold to major networks. How this was done is discussed.</p><p>The course lectures run to 247 minutes (±4,1 hours). With some, you may need to watch them more than once, because there is quite a lot of learning to do.</p><p>If you are interested in making serious documentary films, or telling thought-provoking videos for TV or social medial, then this course has a lot to offer.</p><p>Much of what is being taught here is not, and cannot be taught in a classroom. It goes beyond theory, as the course is based on actual, highly successful productions.</p><p><br></p>", 
    "end_date": null, 
    "title": "Intermediate video documentary making: Become a professional", 
    "price": "25.00", 
    "instructors": "Andrew St.Pierre White", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/735570_5764_2.jpg", 
    "course_url": "https://www.udemy.com/learn-by-example-gripping-tv-documentaries/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-20T15:24:36Z"
}