{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Intro to Final Cut Pro X will get you up and running editing video in almost no time at all. Over the course of 8 video lessons, you'll be thoroughly introduced to the basic post-production workflow concepts, tools, and techniques needed to get started.</p><p><strong>Become a video editing ninja by mastering the essential tools and ideas behind this revolutionary video editing software.</strong></p><p>You'll spend about an hour and a half learning from two Apple-certified trainers, and end with the confidence you need — whether you're completely new to video editing, or if you're making the switch from another program.</p>\n\n<p>The course is structured to flow in a way that makes sense and will set you up for success as you dive into the video editing workflow using Final Cut Pro X.</p><p>You'll get a bit of face time with Apple-certified pros Dominic DiMaria and Chad Stembridge, and you'll also get to see exactly what they're talking about... While they're talking about it! Screen captured video will allow you to follow along as well as compare your own screen so you always know where you are. In addition, all course videos are downloadable so you can take them on the go or have more control over how you learn.</p><p>Final Cut Pro X is a piece of software that brings about a new paradigm to the NLE (Non-Linear Editing) landscape, one that can sometimes be hard to get used to if you’re used to a different system. But once you master the principles behind Final Cut Pro X, you’ll have all the tools and know-how you’ll need to not only edit, but edit with lightning speed and efficiency...all while having complete control over your project.</p><p>You will:</p><ul><li>Begin with basic ideas behind editing in Final Cut Pro X, laying a foundation that’ll help you even before you ever open the app.</li><li>Learn how to build your Library, then bring your video footage in and organize it.</li><li>Get familiar with Final Cut Pro X's powerful organizational tools that will make your project run smoothly from start to finish.</li><li>Then, you'll jump into the timeline and discover the tools available to craft your own video.</li><li>Top it off with effects, some titles and transitions, and you'll be ready to share your video masterpiece with the world.</li></ul>\n\n\n\n\n\n<p>If you're ready to jump into Final Cut Pro X and boost your confidence editing video with this revolutionary post-production app, this is the course for you.</p>", 
    "end_date": null, 
    "title": "Intro to Final Cut Pro X", 
    "price": "20.00", 
    "instructors": "Chad Stembridge, Dominic DiMaria", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788688_0f4d_3.jpg", 
    "course_url": "https://www.udemy.com/intro-to-final-cut-pro-x/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T18:08:49Z"
}