{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong style=\"\">Are you a budding filmmaker, storyteller, brand marketer or avid smartphone photographer looking to translate your skills to video?</strong></p><p>This inspiration packed course is the most informative and revealing masterclass for iPhone filmmakers anywhere. I combine over 20 years experience in the advertising, marketing and filmmaking worlds to bring you ALL my best experiences and insights so you can master filming on your iPhone. From filming on the streets to winning at Sundance London, I&#039;m going to share with you (in 6 easy-to-follow chapters, and in 25 steps) how to perfect your iPhone videos with:</p><ul style=\"\"><li><em style=\"\"><strong style=\"\">STABILITY</strong> - how to film rock-stable videos on your iPhone, every time</em></li><li><em style=\"\"><strong style=\"\">CAMERA MODES</strong> - standard video, slo-mo, time-lapse, master them all</em></li><li><em style=\"\"><strong style=\"\">LIGHTING</strong> - harness the light around you to capture stunning videos</em></li><li><em style=\"\"><strong style=\"\">SOUND</strong> - yes, you CAN get professional sound on your iPhone videos</em></li><li><em style=\"\"><strong style=\"\">EDITING</strong> - see the APPS changing the face of pocket editing on iPhone</em></li><li><em style=\"\"><strong style=\"\">LENSES</strong> - from mild to wild, you won&#039;t believe how great these look</em></li></ul><p>I&#039;ve purposefully divided the masterclass into 6 chaptered lectures so you can learn one discipline, test the theories I&#039;ll show you, then move onto the next lecture and build on your filmmaking capacity.</p><p>You can choose to complete the chapters in any order you choose, watch one or watch them all to skill yourself with the very latest techniques and crafts to become a master pocket cinematographer!</p>", 
    "end_date": null, 
    "title": "iPhone Filmmaking", 
    "price": "20.00", 
    "instructors": "Jason  van Genderen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527352_5fd8.jpg", 
    "course_url": "https://www.udemy.com/iphone-filmmaking/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T11:13:11Z"
}