{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>DO YOU WANT TO MAKE BETTER VIDEOS?</strong><br></p><ul><li><strong>Make things that others can't.</strong> Let your videos shine with custom effects and animations that make it look professional.</li><li><strong>Don't limit your creativity!</strong> <em>Learn all the buttons, understand the interface and known how things work in Premiere Pro.</em></li><li><strong>Learn as you go.</strong> This course teaches you a good fundament. The idea behind it is that you can learn advanced things by yourself as you edit videos in Premiere Pro.</li></ul><p><strong>My name is Jordy Vandeput and I'm a professional video editor.</strong></p><ul><li>I've been teaching Premiere Pro classes <strong>since 2006</strong> in various online and local schools</li><li>I've edited commercials and promotional films for <strong>BMW</strong>, <strong>Belgacom</strong>, <strong>Isola </strong>and more</li><li>I've had an intensive 2 year <strong>online instructor training</strong> at Envato</li><li>I've had over<strong> 3 million views</strong> across Youtube and Vimeo where I host various tutorials</li></ul><p>From years of experience in teaching Premiere Pro classes, I have developed a method that teaches the fundamentals very fast. <strong>Many books and other classes sometimes show things that are not important and forget to explain stuff that IS IMPORTANT.</strong>This is a waste of your time, while you could have learned other things.</p><p><strong>WHAT WILL I LEARN?</strong></p><ol><li>We start by <strong>organising</strong> and <strong>importing</strong> our footage. You have won half the battle by doing this right.</li><li>Next we dive instantly into the <strong>editing</strong>. You will learn a <strong>professional workflow</strong> here.</li><li>As we're editing you will learn more and more tools from the <strong>user interface</strong>. Each button will be explained and used for practice.</li><li>Then comes the fun part where we'll create <strong>effects</strong>, <strong>titles</strong> and custom <strong>animations</strong>.</li><li>Finally we'll finish our video with <strong>c</strong><strong>olor corrections</strong> and <strong>audio mixing</strong> to <strong>export</strong> the video with the <strong>best quality</strong> settings in a small file format.</li></ol><p><strong>FAQ</strong></p>  <p>  \t<strong>I have Premiere Pro CS6, can I follow this course?</strong>  \t<em>Sure you can! This course has been created to get you started with the fundamental features that came from older versions.</em>  </p>  <p>  \t<strong>Will I be able to create explosions and crazy visual effects after this course?</strong>  \t        I'm sorry to let you down, but no. Premiere Pro is a cut and slice program. But it's the core of the video editing process. Visual effects lay on top of your edit which is done in other applications and then brought to Premiere Pro.  </p>  <p>  \t<strong>Do I need a fast computer?  \t</strong>As you will learn the basics you don't need a fast computer. But it will make editing much more pleasant once you can playback your footage smoothly.  </p>  <p>  \t<strong>Must I have video footage before I can take this course?  \t</strong>Nope, I've made it easy for you. In the course attachment you can find the same video footage as used within the course. There's no copyright on it, so feel free to edit those clips and share it online!  </p>", 
    "end_date": null, 
    "title": "Learn Video Editing with Premiere Pro CC for beginners", 
    "price": "25.00", 
    "instructors": "Jordy Vandeput", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315002_b4e8_5.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-adobe-premiere-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T11:56:04Z"
}