{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">Welcome! This course will teach you the very basics of final cut pro and how to get started. If your new to editing and always wanted to learn Final cut pro, this is the course for you!</p><p style=\"\">This course will teach you how to navigate through Final Cut Pro, and learn the simple basics of editing with Final Cut Pro.</p><p style=\"\">We will go over how to add music to your video, for people that are interested in making music videos, this is the course for you.</p><p style=\"\">We will teach you how to add filters to your video. If your a low-budget film maker and is interested in making movies, i will teach you how filters can improve the quality of your video.</p><p style=\"\">We will add transitions in between clips, going over the industry popular transitions, and different transitions that will add style to your video.</p><p style=\"\">And we will teach you how to export your video in the correct video format, so you can receive the best visual quality.</p><p style=\"\">video instructions for each editing step is included in the course</p><p style=\"\">the course will approximately take no more than 4hrs to complete</p><p style=\"\">the course is broken down in 3 sections; Import, editing, and export</p><p style=\"\">If your anxious to get started with final cut pro, and just don&#039;t know how to navigate through the software, I encourage you to take my course. If your coming over from iMovie and want to use a more robust software, this is the perfect course for you. </p>", 
    "end_date": null, 
    "title": "Learn Final Cut Pro X For Beginners", 
    "price": "20.00", 
    "instructors": "Donte Morris", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503948_b080_2.jpg", 
    "course_url": "https://www.udemy.com/learn-final-cut-pro-x-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-16T18:24:03Z"
}