{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong><em>************* Super  Sale **************</em></strong>  </p>\n\n<p>It will only cost $20, instead of $99. <br>So hurry up and buy it today.<br></p>\n\n\n\n<p>  \t<strong><em>*******************************************************************</em></strong>  </p>\n\n\n\n<p> The goal with this course is to learn how you can do to make voice over recording with high quality <br></p>\n\n<ul>  \t<li>You will learn how to remove background noise that your microphone will pick up.</li>  \t<li>You will learn how to prepare your room for voice over recording.</li>  \t<li>You will learn how to build things that reduce noise from enter your microphone.</li>  \t<li>You will learn how to build a pop filer that reduce bad noise come into the microphone from your  mouth.</li>  \t<li>You will learn the basic of an audio editor to make your voice over sounds better and with minimum of noise.</li>  \t<li>You will learn how to reduce background noise in your recording area and prepare you for making a great voice over.</li>  </ul>\n\n\n\n<p>  \t               Most things you will build will cost you a lot less then it would if you did buy it from the store. You find often the material in your local hardware store. You will save money to make them yourself instead of buy those for hundreds of dollars.  </p>\n\n\n\n<p>  \t               The course go through step by step what you need to know about voice over and how to record voice over with high quality-  </p>\n\n\n\n<p>  \t               You should take this course if you want high quality voice over in your videos or podcast.  </p>\n\n\n\n<p> <strong>Reviews:</strong> <br></p>\n\n<p>  \t<strong>by Julia Hidy</strong>  </p>\n\n\n\n<p>  \t<em>Important devices and highly useful audio editing clean up</em>  </p>\n\n\n\n<p>  \t<em>Soren constantly helps Udemy's instructors fix their audio tracks. He's so knowledgeable in editing, and fixing tracks so they're usable. His course helped me edit many minutes of recorded audio from a client that had constant fan hiss on it. His suggestions cleaned up the file so I didn't have to ask my client to re-record several hours of content.</em>  </p>\n\n\n\n<p>  \t<em>I highly recommend Soren as a great instructor. Soren's idea to easily block background noise from the sides and back of a mic is something that I really needed. His straightforward instructions made it really easy for me to save $200 to $800 (which is the price at B&amp;H audio) for a similar noise reduction device. I spent under $10 on his solution, and it was fast, easy and fun to put together. I highly recommend this course to any one who wants to know how to do recording and noise reduction better, and to anyone who wants to save considerable expense on audio recording equipment accessories.</em>  </p>\n\n\n\n<p>  \t<strong>by Rick Worsnop</strong>  </p>\n\n\n\n<p>  \t<em>I recommend this \"how-to\" course. It will help improve your voice recordings.</em>  </p>\n\n\n\n<p>  \t<em>This course deals with a major issue that plagues voice recordists: noise. It shows you how to reduce noise at the source, by reducing what gets into your microphone, then how to clean up what's left with your recording software.</em>  </p>\n\n\n\n<p>  \t<em>The most fun part of this course for me was the Do-It-Yourself intro to building sound modifiers, like a pop filter and sound-proof surrounds for your mic. I thought the pop filter design was particularly ingenious, and all of these DIY projects could save you a lot of cash while greatly improving your sound.</em>  </p>\n\n\n\n<p>  \t<em>The section on using audio software like Audacity or Sound Forge, to clean up noise in a recording, was also useful. The instructor used features like normalization, EQ and compression that are widely available and work similarly in most recording apps. This is the only place I felt the course fell a little short. There was a lot of normalizing and tweaking of EQ without much explanation, and that may mystify some people. In the case of a track with one or more transient peaks (from lip smacks or other extraneous noises) normalizing won't appear to do much at all. I wish the instructor had mentioned to go through the audio and manually edit out such noises before normalizing.</em>  </p>\n\n\n\n<p>  \t<em>There's some good advice in the summary bullet points at the end of the course, and I could see this material growing into a more detailed sequel.</em>  </p>\n\n\n\n<p>  \t<em>Overall, I enjoyed the course and would recommend it as well worth the $19 tuition.</em>  </p>", 
    "end_date": null, 
    "title": "Learn how to remove background noise from your microphone", 
    "price": "20.00", 
    "instructors": "Damian Gto", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174106_4ef1_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-remove-background-noise-from-your-microphone/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-27T22:40:02Z"
}