{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t  This Final Cut Pro X for Mavericks training course from Infinite Skills teaches you how to use this popular video editing software on the Mavericks operating system. This course is designed for the absolute beginner, meaning no prior experience with Final Cut Pro is required.  </p>  <p style=\"\">  \t<br style=\"\">  \t  You will start by learning about the user interface, preferences, and helpful shortcuts. This course will then teach you how to add media, including adding media from a camera and SD card, importing video from tape, and working with archives. This video tutorial will teach you how to keep your clips organized, as well as teach you editing essentials such as adding clips to the timeline, performing a batch edit, and lifting and overwriting clips. You will also learn how to complete the WEC spot. <br style=\"\">  \t<br style=\"\">  \t  Once you’ve learned the basics, this course  will teach you more advanced editing tips, including working with effects and keyframes, working with compound clips, and editing audio to make a movie. He will also share other tips and tricks, including using generators, panning audio clips, and tricks with white screens. Finally, the course teaches you how to get ready for primetime, including how to export to QuickTime, use the compressor, and export to Blu-Ray and DVD. <br style=\"\">  \t<br style=\"\">  \t  Once you have completed this computer based training course, you will be fully capable of importing, editing, and exporting your video projects using Final Cut Pro X for Mavericks. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Learning Final Cut Pro X - Video Editing Mastery ", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301316_4239_5.jpg", 
    "course_url": "https://www.udemy.com/learning-final-cut-pro-x-video-editing-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T13:33:34Z"
}