{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>O Liquid é um super programa para captura, edição e autoração.</p><p>Quem não quer aprender a capturar vídeos ? Depois editá-los adicionando filtros e efeitos ? E no final exportar ? Então esse é o curso ideal. Domine a captura e edição de vídeos neste ótimo programa, o Liquid, através deste curso totalmente online. É mostrado a importação de arquivos, a parte de transições, edição de áudio, inserir textos, edição 2D e 3D, aplicar filtros aos vídeos, capturar os vídeos e muitas outras poderosas ferramentas e funções do Liquid. Acompanhe todo o curso através de videoaulas explicativas, detalhadas, enquanto executamos passo a passo todas as tarefas que trabalhamos ao longo do curso. Neste curso online você pode estudar em casa por um material de qualidade, obter o seu certificado e uma melhor colocação profissional em pouco tempo.</p><p><strong>Veja abaixo o que você irá aprender:</strong><br></p><ul><li>Apresentação e configuração do Programa</li><li>Criando pastas e importando arquivos</li><li>Cortando e Movendo Cenas para a Timeline</li><li>Criar Transições, manipular áudio, textos</li><li>Conhecer a função dos botões e suas teclas de atalho</li><li>Renderizar os vídeos</li><li>Exportar em vários formatos</li><li>Criar sequências</li><li>Criar filtros diversos para os vídeos</li><li>Manipular a velocidade das cenas</li><li>Dominar a Timeline</li></ul><p><strong>Indicado para:</strong></p><p>Todos que querer aprender capturar vídeos, editar e exportar.</p><p><strong>Um pouco mais sobre esse curso:</strong></p><p><br>Nesse curso você vai aprender a trabalhar e manipular vídeos, podendo depois criar comerciais, desenvolver vídeo clipes utilizando os recursos oferecidos pelo Liquid. Para isso, é preciso conhecer todos os recursos, telas, funções e ferramentas desse fantástico programa de edição. Você ainda aprenderá a fazer cortes de vídeo, juntar vídeos, integrar com imagens, textos e áudios.  E para que os seus vídeos fiquem mais elaborados, o Liquid possui muitos efeitos que podem ser trabalhados durante a edição. Assim, você irá criar e editar os seus próprios video clipes com os recursos muito legais.<br></p><p>Esse curso tem a autoria de Sidnei Neitzke<br></p>", 
    "end_date": null, 
    "title": "Liquid capturar editar e exportar vídeos fantásticos", 
    "price": "30.00", 
    "instructors": "Neri Neitzke", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632474_7d82.jpg", 
    "course_url": "https://www.udemy.com/liquid-capturar-editar-e-exportar-videos-fantasticos/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T14:54:29Z"
}