{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t En este curso, tercero en el que tratamos las técnicas para diseñar un Pitching eficaz, se centra en los proyectos que pertenezcan al terreno del audiovisual, ya sea un cortometraje, un largometraje, una serie, o incluso una webserie.  </p>  <p>  \t Los Pitchings, presentaciones orales de 5 a 10 minutos de un proyecto, se han convertido hoy en día en una obligación para el guionista o productor que quieran vender su idea ante distribuidores o cualquier otro inversor, pasando por actores o equipo técnico de renombre que nos interese que colaboren con nosotros.  </p>  <p>  \t Ser capaz de aprovechar esos 5 minutos para generar interés es todo un reto, del que muchos no salen indemnes.  </p>  <p>  \t En primer lugar analizaremos los diferentes entornos que existen en los que realizar un Pitching, desde los Talent Campus o PitchFest, hasta los informales “Pitching del ascensor”, pasando por las reuniones privadas con un inversor. Cada uno tiene sus particularidades que aquí veremos.  </p>  <p>  \t A continuación entraremos en la primera información que se debe comunicar al inversor, el género de nuestro proyecto. Veremos qué posibilidades tenemos para elegir el más evocador y preciso posible.  </p>  <p>  \t Más adelante nos centraremos en la piedra angular de todo Pitching Audiovisual: La Logline, o frase que resume todo nuestro proyecto, y que contesta a la pregunta “¿De qué va?”. De su construcción dependerá que consigamos mantener el interés o que lo demos todo por perdido. Por ello desarrollaremos todas las técnicas que existen para diseñarla, mejorarla, y no cometer errores en su construcción.  </p>  <p>  \t Expondremos también los 5 enfoques que todo Pitch puede tener, según las particularidades de cada proyecto, puesto que habrá algunos más centrados en los personajes, y otros en la trama, por ejemplo.  </p>  <p>  \t Dedicaremos otro capítulo a las formas de exponer tu visión, ya sea con Teasers, Trailers y demás ayudas visuales. Aprenderemos a usarlas correctamente para que no se transformen en armas de doble filo.  </p>  <p>  \t Todo esto y mucho más es lo que trataremos en este curso, el último de los 3 que forman este bloque temático sobre los Pitching, para que puedas usar los pocos minutos de tu presentación para conseguir lo más importante que puede darte el inversor: su confianza.  </p>", 
    "end_date": null, 
    "title": "Pitching Eficaz (III) - Proyectos Audiovisuales", 
    "price": "20.00", 
    "instructors": "Jorge E. Blein", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234350_3e2a_4.jpg", 
    "course_url": "https://www.udemy.com/pitching-eficaz-iii-proyectos-audiovisuales/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-30T23:22:42Z"
}