{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Start editing your own videos with the best Windows/PC video editing software out there - PowerDirector.</strong></p><p style=\"\">If you're looking for a Windows-based video editing application that will allow you to edit professional quality videos, Cyberlink's PowerDirector is a great tool. This course will teach you everything you need to know to get started editing.</p><p style=\"\"><strong style=\"\">Make videos the way you envision them! <em style=\"\"></em></strong>If you want to make videos with great titles, music, effects, and overall quality, this is the course for you.<br style=\"\"></p><p style=\"\"><strong style=\"\">Here are the main topics of this course:</strong><br style=\"\"></p><ul style=\"\"><li style=\"\">Using easy editing and slideshow creator to make videos in less than 10 minutes</li><li style=\"\">Importing footage from any camera</li><li style=\"\">Understanding the program layout and tools</li><li style=\"\">Editing together a sequence and adding transitions</li><li style=\"\">Improving your video with graphics, music, and titles</li><li style=\"\">Producing (exporting) your video in HD quality for any device</li><li style=\"\">Creating advanced slow-motion, stabilized, color-corrected videos</li><li style=\"\">much more!</li></ul><p style=\"\"><strong style=\"\">Why is this the course that will make you successful?</strong><br style=\"\"></p><p style=\"\">Taking online courses isn't easy. It takes work and action. This course will help you succeed with concrete practice lessons. We'll walk you through each exercise. By the end of the course, you'll have a fully edited video montage that you can share with the world.</p><p style=\"\"><strong style=\"\">Who teaches this course?</strong><br style=\"\"></p><p style=\"\">Phil Ebiner is a professional video editor who has edited over 1,000 videos in the past 3 years for amazing companies. His videos have shown at film festivals, in movie theaters, on television, and on popular websites. Phil strives to teach students not only the technical skills of a video editor with this course, but also the philosophy of video editing. You'll love learning from Phil like thousands of other Udemy students.</p><p style=\"\"><em style=\"\"><strong style=\"\">Are you ready to be successful?</strong></em><br style=\"\"></p><p style=\"\"><em style=\"\"><strong style=\"\">Are you ready to edit professional-looking videos?</strong></em></p><p style=\"\">Enroll now!</p>", 
    "end_date": null, 
    "title": "Professional Video Editing with PowerDirector for PC Users", 
    "price": "50.00", 
    "instructors": "CyberLink Software, Phil Ebiner", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607058_08c5.jpg", 
    "course_url": "https://www.udemy.com/professional-video-editing-with-powerdirector-for-pc-users/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T16:23:17Z"
}