{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong>Why take this Course?</strong></p><p style=\"\"><strong></strong>Learn all the stages to get <strong>Good Audio in your Videos</strong> from a Professional Video/Audio-producer. I will teach you how to Prepare, Record, and Polish your Audio in your Videos. I truly believe that \"<strong>Audio is King</strong>\", and that you therefore should spend some time perfecting your setup and production work flow. </p><p style=\"\">Recording Good Audio is <strong>not rocket science</strong>. Even so, most people don't take the necessary steps to get good audio recordings for their videos. If you do, you will stand out!</p><p style=\"\">I have tried to condense my 15 years of experience in Video and Audio Production, into this course, so that <strong>you can get results</strong> without reading hundreds of books and articles, or recording and mixing vast amounts of music and audio tracks as I have.</p><strong></strong><strong><p style=\"\"><strong>What are the Benefits for You?</strong></p></strong><ul><li>Increase the Production Quality of your Videos with High Quality Audio</li><li>Be seen as more Professional and Trustworthy</li><li>Leave the bottom 90% (Most People have Bad Audio in their Videos)</li></ul><p style=\"\"><strong>Course Overview</strong></p><p style=\"\">You will learn the fundamentals of sound, acoustics and what echo is. I will show you practical examples of Bad Audio Recordings, and explain to you what makes them bad. I will demonstrate the most common mistakes, but also show you the best practices for getting good audio in your videos.</p><p style=\"\">We will discuss different Microphone Types, dynamic microphones vs condenser microphones, shotgun mic or lavalier etc. What equipment to use for recording the audio. How to get rid of echo, and improve the room acoustics. Also how to work around background noises and ambience.</p><p style=\"\">Then you will also learn about the importance of articulation and voice projection, and we will talk about learning to control your voice.</p><p style=\"\">You will learn about Noise Reduction, syncing audio and video tracks, and I will also share my personal expert tips from all my years of producing video and audio.</p><strong>What is in this Course?</strong><ul><li>25 video lectures totalling about 1 Hour of condensed learning experience</li><li>Step by step instructions on all the stages needed to get Good Audio in your Videos</li><li>A dynamic and personal style of teaching</li><li>Mixed formats to create more interest for you</li></ul>", 
    "end_date": null, 
    "title": "Record Audio for Video Production", 
    "price": "20.00", 
    "instructors": "Mikael Baggström", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420918_fe8b.jpg", 
    "course_url": "https://www.udemy.com/record-your-voice-for-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T09:04:35Z"
}