{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">If you&#039;ve ever recorded video at a friends wedding, your children&#039;s sports games, and many things in between but have always felt that the audio quality wasn&#039;t up to scratch, then this is the place for you!  </p>  <p style=\"\">  \t\t                Maybe you wish you&#039;d been able to hear the words spoken by the special couple at their engagement party, or want to produce voice over audio for your &#039;how-to&#039; videos, or you are actually venturing in to video production as a career, but don&#039;t know what is up or down when it comes to sound and audio?<br style=\"\">  \t\t<br style=\"\">  \t\t                Through this course, I&#039;ll be teaching you the concepts &amp; processes when it comes to &#039;upping your audio game&#039;. Learn the do&#039;s and don&#039;ts with a simple 2 hour course with myself in easy to digest practical videos (I &#039;show&#039; rather than &#039;tell&#039; wherever possible). We&#039;ll go through the concepts of what actually makes up a good sounding video, and then put all of these into context around the various microphone types that you can get. Learn how to place your mic, record clean sound and ultimately produce great sounding videos; For all video types!<br style=\"\">  \t\t<br style=\"\">  \t\t                This course will be continuously updated and refined, to ensure that even as your knowledge and experience of capturing great audio grows, you&#039;ll be aware of new techniques and tricks of the trade to always be improving your craft. Thanks for coming along, and I hope you enjoy! - Nick  \t</p>", 
    "end_date": null, 
    "title": "Record Impressive Audio For Every Video With These Insights", 
    "price": "20.00", 
    "instructors": "Nick Kelly", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373860_3714_2.jpg", 
    "course_url": "https://www.udemy.com/great-audio-for-every-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-19T11:25:53Z"
}