{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Learn shooting and editing best practices and tips that will save you money and time.</p><p><strong><span></span>Course Description</strong></p><p>When you want or need video for your organization or business, it's sometimes choppy water not knowing where to start, how to get there…and what to do if you're in over your head.</p><p>We're here to help!</p><p>Consider us your personal video navigators providing you with an insider's guide on video production for your organization or business.</p><p>We've broken down our comprehensive course, 'Chart Your Course for Effective and Affordable Video' also found on Udemy, into individual courses for those who only need specific information.</p><p>In this course, learn shooting and editing best practices and tips, how to interview effectively and troubleshoot difficult interviews, create a shot list, light on a limited budget, get good audio, understand effective intros/outros, and the basis of text, graphics and subtitles, avoid music right issues, organize your footage, store and share files and video, and how to repurpose your video.</p><p><strong>Your Teachers</strong></p><p>Scott Stohler and I (Erika Gilsdorf) are award-winning, professional video producers with a 25-year, collective video production experience around the world for such entities as National Geographic, Discovery Networks, United Airlines, Royal Caribbean Cruises, The World Bank, The Nature Conservancy, GAP, Levi's, Symantec, Old Navy, Sephora, Seacology, and CORAL. We've produced documentaries, commercials, public service announcements, short films, television programs, and training and organizational videos. The countries we've worked include the United States, Indonesia, Fiji, Italy, Spain, Honduras, Guatemala, Belize, Mexico, Cuba, Vietnam and China.</p><p>Having done everything from concept development, project management to shooting, editing, and creating some serious buzz around the videos we've produced. Scott and I know from experience what works...and what doesn't.</p><p>Our passion with providing this course is to show and empower nonprofit organizations and small businesses how to reach more people through the power of video more effectively and affordably.</p><p>Each lesson gets to the point and answers each question concisely without fluff or fillers. You don't have to listen to long lessons wading through information that isn't relevant for what you need.</p><p><strong>What am I going to get from this course?</strong></p><strong></strong><ul><li>26 Lessons; 1 hr 49 minutes of video</li><li>Downloadable resources, samples and worksheets.</li><li>Life time access; 30 day money back guarantee.</li><li>iPhone, iPad and Android accessibility</li></ul><p>By the end of this course, you will be able to save money and time by learning shooting and editing best practices.</p><p>Additionally, we want to hear from you! Do you have a video question you'd like answered that we didn't cover? As a participant with this course, you'll be able to pose questions for us to respond.</p>", 
    "end_date": null, 
    "title": "Shooting and Editing Basics", 
    "price": "20.00", 
    "instructors": "Erika Gilsdorf & Scott Stohler", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543824_75ee.jpg", 
    "course_url": "https://www.udemy.com/shooting-and-editing-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T05:25:52Z"
}