{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Follow my step by step instructions on how to setup and operate the Canon G7X to shoot great video.</p><p>This course will cover the physical controls and menu setups to unlock the video shooting potential this great little camera is capable of.</p><p><strong>Gain the confidence and know how to shoot great video with your Canon G7X.</strong></p><ul><li>What physical buttons you will use most</li><li>Minimum SD card requirements for shooting video</li><li>Which menu settings are essential for capturing the best video</li><li>Take full control in manual mode and when best to use it</li><li>How to lock focus and exposure in auto modes</li><li>Picture Styles and modifying to your taste</li><li>Overcoming the <strong>number 1 audio issue</strong></li></ul><p><strong>Benefit from my 20 years of professional video shooting experience...and mistakes!</strong></p><p><strong></strong>The Canon G7X can be picked up by virtually anyone and is capable of shooting great video in full auto. But to get the most out of it you need to know when to override the auto controls. It may be something as simple as locking focus or taking full manual control of the cameras shutter, iris, focus and ISO.</p><p>My aim for all my courses is to pass on my experience to help you shorten the learning curve so that you have the confidence to concentrate on capturing what is in front of your lens rather than worrying about the setup and workings of your camera.</p><p><strong>Course Content &amp; Overview</strong></p><p><strong></strong>The course is aimed at anyone who owns or has access to a Canon G7X or perhaps more experienced users wanting to hone their manual shooting skills. It details the menu set-ups you need, focusing, picture styles, audio and much more with some common real life examples.</p><p>One of the most popular video uses of this camera is as a personal Vlogging camera or adventure style camera and it is with these users that this course has been designed for.</p><p>Its a 10 chapter video course and contains over 45 minutes of video material with my recommendations for any accessories. If you are anything like me with my limited attention span and time, my aim is to always try and keep these courses under 1 hour as I struggle to complete anything longer!</p><p>What you will learn starts with the camera hardware and menu settings, I then move into shooting basics including auto and full manual controls, exposure, focus, audio and then some real world examples of putting it all into practice.</p><p><strong>My style is short and sharp </strong>and I only discuss the areas of the camera essential to shooting video.</p><p><strong>What this course isn’t? </strong>This course deals solely with shooting video with the Canon G7X and it does not go into shooting still pictures or post-production and video editing.My aim is to give you the essential information only for shooting video so that you can hit the ground running and get out there and start producing some great looking videos, Vlogs, family movies, youtube clips or perhaps your first short film.</p>", 
    "end_date": null, 
    "title": "Shooting Video with your Canon G7X", 
    "price": "20.00", 
    "instructors": "Grant Johnston", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744250_cf7d_2.jpg", 
    "course_url": "https://www.udemy.com/shooting-video-with-your-canon-g7x/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T23:24:28Z"
}