{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t Smoke para Mac es una potente herramienta de postproducción con herramientas que antes sólo estaba disponibles en los sistema avanzados para linux como Flame.  </p>  <p>  \tCon la desaparición de Final Cut 7, Smoke puede ser el sustituto perfecto para los editores que, acostumbrados a la suite de apple con Motion y Color, necesiten algo más que simplemente editar.  </p>  <p>  \t En este curso mostraremos Smoke 2013 desde la perspectiva de alguien recién llegado al software pero con conocimientos generales de post producción Es un curso ideal para “perderle el miedo” a Smoke.  </p>  <p>  \tEl sistema Autodesk® Smoke®, una solución todo-en-uno para la edición y acabado en línea, ofrece:  </p>  <ul>  \t<li>Rendimiento y productividad en las herramientas creativas más avanzadas de la industria para flujos de trabajo SD y HD. </li>  \t<li>Resolución mixta, arquitectura de múltiple masterización, guión sofisticado, y amplias funcionalidades de ajuste para editar y ensamblar proyectos con gran velocidad e interactividad. </li>  \t<li>Funciones de seguimiento de movimiento y DVE, Colour Warper™, Master Keyer, audio avanzado, pintura, corrección del color, texto, entorno de composición 3D. </li>  \t<li>Herramientas para mantener la consistencia del color a lo largo de todas las tomas, encantador diseño de títulos y elementos gráficos, creación de versiones, y producción de proyectos finales a múltiples formatos.</li>  \t<li>Herramientas de efectos visuales para diseño visual interactivo con participación directa del cliente.</li>  </ul>  <p>  \tEl curso es impartido por Jaime Climent.  </p>  <p>  \tEn este curso cubriremos:  </p>  <ul>  \t<li>Primeros pasos por el programa</li>  \t<li>Media</li>  \t<li>Básicos edición</li>  \t<li>Edición gestual y en el timeline</li>  \t<li>Introducción a FX</li>  \t<li>CFX</li>  \t<li>Action</li>  </ul>", 
    "end_date": null, 
    "title": "Smoke para editores Finalcut", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177996_ecc9.jpg", 
    "course_url": "https://www.udemy.com/smoke-para-editores-finalcut/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T17:58:43Z"
}