{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \tThis Color Correction with SpeedGrade and Premiere Pro training course Infinite Skills teaches you various color correction tools and techniques in Premiere Pro and SpeedGrade.  </p>  <p>  \t<br style=\"\">  \tYou will start out by learning to work with color correction tools in Premiere Pro. Jeff will teach you how to analyze tonality and adjust it with the Luma curve video effect and numeric controls. You will also learn how to adjust color with the fast color corrector, RGB curves, and create a film-like appearance with Lumetri looks. This video tutorial also shows you how to use secondary color correction techniques in Premiere Pro, including adding vignettes, changing and leaving a single color, and using secondary correction controls within effects. Once you’ve covered the color correction tools in Premiere Pro, you will learn about SpeedGrade and how the two are connected. Finally, Jeff will teach you concepts in SpeedGrade that include performing primary and secondary tonality and color correction, using SpeedGrade effects, and animating effects and color grading.<br style=\"\">  \t<br style=\"\">  \tOnce you have completed this computer based training course, you will have a comprehensive understanding of the color correction tools and concepts in Premiere Pro and SpeedGrade. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "SpeedGrade and Premiere Pro Master Video Color Correction", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222096_3326_6.jpg", 
    "course_url": "https://www.udemy.com/speedgrade-and-premiere-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-18T19:25:49Z"
}