{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Putting the Power of Video in Your Hands.<br></p><p>We all know <strong>video </strong>is important to have for your organization or business if you want to reach more people.  But when time and money are scarce, you need the quickest, easiest, and cheapest way to get it.</p><p>We're here to help.</p><p><strong>Video Basics in 5 Steps.<br></strong></p><p><strong>Step 1:  Tell it.</strong></p><p><strong>Step 2:  Plan it.</strong></p><p><strong>Step 3:  Make it.</strong></p><p><strong>Step 4:  Show it.</strong></p><p><strong>Step 5:  Promote it.</strong></p><p>From creating videos that grab and keep attention, to what goes into making them and getting them out there, this course gives tips, advice and best practices.  We're here to help you successfully make video that reaches the right people in the most affordable, strategic, and efficient way.</p><p><strong>Your Video Guides</strong><br></p><p>Scott Stohler and I (Erika Gilsdorf) are award-winning, professional video producers with a 25-year, collective video production experience around the world for such entities as National Geographic, Discovery Networks, United Airlines, Royal Caribbean Cruises, The World Bank, The Nature Conservancy, GAP, Levi's, Symantec, Old Navy, Sephora, Seacology, and CORAL. We've produced documentaries, commercials, public service announcements, short films, television programs, and training and organizational videos. The countries we've worked include the United States, Indonesia, Fiji, Italy, Spain, Honduras, Guatemala, Belize, Mexico, Cuba, Vietnam and China. </p><p>Having done everything from concept development, project management to shooting, editing, and creating some serious buzz around the videos we've produced, Scott and I know from experience what works…and what doesn't. </p><p>Our passion with providing this course is to show and empower nonprofit organizations and small businesses how to reach more people, make more money, and create more change…through the power of video.<br></p><p>Each lesson gets to the point concisely without fluff or fillers. You don't have to listen to long lessons wading through information that isn't relevant to what you need.</p><p><strong>What am I going to get with this course?</strong></p><ul><li>83 Lessons; 5+hours of video.</li><li>Downloadable resources, samples and worksheets.</li><li>Life time access; 30 day money back guarantee.</li><li>iPhone, iPad and Android accessibility</li></ul><p>By the end of this course, you'll know what it takes to make good videos and some of the best methods to show and promote them.  </p><p>We want to hear from you! With this course, feel free to ask us your questions.</p><p>We also supplement this online course with free, live webinars to cover topics more in depth and answer questions.</p>", 
    "end_date": null, 
    "title": "Successful Video in 5 Steps", 
    "price": "50.00", 
    "instructors": "Erika Gilsdorf & Scott Stohler", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544514_242a.jpg", 
    "course_url": "https://www.udemy.com/chart-your-course-for-effective-and-affordable-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T01:11:26Z"
}