{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>⇉ Watch the promo video</strong> to see How You Can Start To Master Adobe Premiere Pro CS6!</p>\n\n<p><strong>⇉ Join Over 100,000+ Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n<p><strong>⇉ 250<strong>0</strong>+ Five Star Reviews </strong>Shows Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n<p><strong>⇉ You receive 25+</strong> streamlined lectures and <strong>2+ hours of HD video content!</strong></p>\n\n\n\n<p><strong>_______________</strong></p>\n\n\n\n<p><strong>Student Reviews:</strong></p>\n\n\n\n<ul><li>Brad Ward 5 days ago</li></ul>\n\n\n\n<p><strong>Great course. </strong></p>\n\n\n\n<p>An excellent very easy to follow course. Highly recommended</p>\n\n\n\n<ul><li>Flo Reda</li></ul>\n\n\n\n<p>10 days ago</p>\n\n\n\n<p><strong>Great introductory course to Adobe Premiere pro cs6</strong></p>\n\n\n\n<p>I highly recommend this course. I started with no Adobe Premiere Pro CS6 experience but Joe and Michael makes it fun and interesting to learn the essential basics of the software in this course. Highly recommended.</p>\n\n\n\n<p><strong>______________</strong></p>\n\n\n\n<p>Producing videos is the single most valuable skill I have learned online because it allows me to share and teach everything else I know. Take this course when you are ready to speed up your learning with the video production software Adobe Premiere Pro CS6 and produce high quality professional looking videos! <br></p>\n\n\n\n<p>You can use this course at any level of video production. If you are a beginner, you can skip a lot of hours of painful learning that I took to learn Adobe Premier Pro from scratch. If you are like me and already have used some of the software like Camtasia and want to expand your abilities, you might be inspired to try Adobe Premier Pro CS6 enhance your video production abilities.<br></p>\n\n\n\n<p>As with the rest of the courses I teach, you can expect an answer in this course to any question you ask!<br></p>\n\n\n\n<p><strong>_______________</strong></p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards <strong>Mastering Adobe Premiere Pro CS6! </strong></p>\n\n\n\n<p>When I learn something new, I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em></p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p><strong>This course will not remain this price forever! It's time to take action!</strong></p>\n\n\n\n<p>Click the <strong>\"take this course\"</strong> button at the top right now!</p>\n\n\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p>See you in the course!<br></p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p>Joe Parys + Michael Nguyen </p>", 
    "end_date": null, 
    "title": "The Complete Adobe Premiere Pro CS6 Course For Beginners ", 
    "price": "45.00", 
    "instructors": "Joe Parys, Michael Nguyen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619164_198a_2.jpg", 
    "course_url": "https://www.udemy.com/adobepremierepro/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T12:23:25Z"
}