{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><span style=\"\"></span>Ce cours vous <strong style=\"\">guide pas a pas a travers toute les fonctions et tout les outils de WMM</strong>. Je ne cours pas apres le temps et sans etre lent je vous deploie ce logiciel et <strong style=\"\">vous le revele sous toute ses coutures.</strong> </p><p style=\"\">Cette <strong style=\"\">formation dure</strong> <strong style=\"\">un peu plus de 3 heures</strong>, elle est repartie <strong style=\"\">en 19 videos</strong>. Nous aborderons :</p><ol style=\"\"><li style=\"\">dans un premier temps l&#039;interface, importante pour prendre vos reperes. </li><li style=\"\">Puis ensuite nous verrons <strong style=\"\">les rubans, elements essentiels du programme</strong>, qui possedent tous leur propres utilites, dont le ruban Home (Accueil) et qui est  celui que vous utiliserez le plus. </li><li style=\"\">Et en fin de formation je vous parle rapidement des Creative Commons, vous comprendrez bien comment utiliser ces licenses pour exploiter du contenu gratuit en ligne.</li></ol><p style=\"\"><strong style=\"\">Je met a votre disposition des rushs </strong>de mon chat, Casper, qui vous permettront de tout de suite de commencer a mettre en pratique vos connaissances. Attention, Casper un chat tres charmant :)</p><p style=\"\">En sortant de cette formation,<strong style=\"\"> vous serez a meme de monter vos videos, rapidement et en toute comprehension. </strong>Je ne vous livre pas seulement des connaissances techniques propre au programme, mais <strong style=\"\">aussi des connaissances propres aux metiers de la video,</strong> sans lesquelles votre apprehension du logiciel ne peut etre que partielle. <strong style=\"\">Ce tutoriel s&#039;adresse donc a tout ceux qui souhaitent apprendre et comprendre toute les finesses de ce logiciel, et faire un premier pas vers les metier de la video.</strong>  </p>", 
    "end_date": null, 
    "title": "Tout Apprendre Sur Windows Movie Maker", 
    "price": "20.00", 
    "instructors": "Jean-Yves TRAN", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589216_8fe9_2.jpg", 
    "course_url": "https://www.udemy.com/windows-movie-maker-formation-montage-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T08:24:45Z"
}