{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Do you want to understand the creative techniques broadcast pros use when shooting for a TV show?<span></span></p><p>Would you like to be taught by a genuine TV broadcast professional?</p><p>Do you want to improve the quality of your videos, to the point where your audience can't get enough?</p><p>Are you moving from still photography to video, and are not finding it easy?</p><p>Are your videos just not getting noticed and shared on your YouTube channel?</p><p>As a professional video cameraperson, are you not getting noticed because your work is technically fine, but not creatively outstanding?</p><p><strong>Then you have come to the right place.</strong></p><p>Making great video is not some great secret that no one is willing to share. The trouble is, most video courses on the net are presented by filmmakers making wedding videos and low budget music videos for local bands. Very few are broadcast professionals. The proof is that most courses focus primarily on equipment, which requires limited creative insight.</p><p><strong>This course is different</strong></p><p>I am a broadcast professional for 37 years. And I've won international awards for my work. And I will teach you the creative elements needed to make great videos. So, if you want to improve your videos to the point where they enrapture the audience and have them begging for more, know this: It is NOT about getting better equipment!</p><p><strong>Filmmakers:</strong></p><ul><li>Professionals worry about money,</li><li>Artists worry about light and sound,</li><li>Amateurs worry about equipment.</li></ul><p>If you spend a lot of time worrying about equipment, is it not the time you stepped up to being an artist?</p><p>Even if you understand codecs, and cameras and sensors sizes and lenses, it is not enough. Knowledge without skills can never create a masterpiece.</p><p>And that is why this course is about honing your creative video skills. I do this in two parts. This course covers easy to understand shooting techniques that are used by broadcast professionals being paid upward of $1000 per day. The second course, is the creative editing: <em>Video Editing. Inspire your audience with creative flair.</em></p><p><strong>Cameras and gear</strong></p><p>If you enjoyed a great meal, would you congratulate the chef by saying, \"You must have a great stove?\" Of course you wouldn't. It's the same with filmmakers. A great film is not created by a great camera. It's created by talented, creative people. And those people use tools (cameras and lenses) to do it. </p><p>So this course is not about the tools. It is about  why a tool might be used in a particular way. So if you are in need of creative inspiration, then these courses are right for you.</p>  <p>  \t<strong>                We teach the creative part of video filmmaking.</strong>  </p>  <p>  \t                      We teach filmmaking skills at a level that can be understood by the lay-person or amateur filmmaker, from techniques used by broadcast professionals.  </p>  <p>  \t                          During this course you will learn what is needed to tell a story on video, while informing and entertaining the viewer, no matter who they are. You will learn the important elements that go to make up a story, the affect of the visual elements and the importance and affect of the audio track. You will learn to prioritise when shooting, to enable the editing process to be easy and intensely creative. By using the techniques taught here, you can become a great video storyteller.  </p><p>There are 40 lectures and 7 quizzes. Most  instruction is by video, with examples and samples.</p>  <ul>  \t<li>Part 1. Identify what kind of programs do you want to make?</li>  \t<li>Part 2. The five most important element of video storytelling. The importance of audio.</li>  \t<li>Part 3. From still photography to videography, information versus emotion. The effect that audio has on an image.</li>  \t<li>Part 4. Shooting techniques: The 4-second rule is the secret to delivering footage for the edit. We also teach editing-in-camera versus shooting for the edit, and more.</li>  \t<li>Part 5. Shooting techniques: Perspective, zooms, lenses, light, composition, perspective, shooting interviews and much more.</li>  \t<li>Part 6. Equipment ideas.</li>  \t<li>Part 7. Conclusion and introduction to the editing course</li>  </ul>  <p><strong>Your lecturer</strong></p><p>Andrew St Pierre White has 37 years as a broadcast professional, with international awards to his credit. He understands what it takes to capture great footage and audio to make compelling videos— even as a low-budget indie producer. And, wether it be a documentary series, a 30-second commercial or a YouTube product review, he has done them all. His YouTube channel boasts over four million views a year and his commercials and TV shows have been broadcast all over the world.</p><p><strong>Latest testimonial on Udemy:</strong></p>This is an excellent course for videographers who want to learn from a professional with over 30 years experience. BEST COURSE ON UDEMY. 10/10<span></span>Richard Butler, 1 hr 21 mins ago ·   <p>  \t<strong>Testimonials from our seminar attendees:</strong></p>  <p>  \t    \"Even though I used to shoot still photos for a national news organization, I had no idea how different the video story-telling process is from still photography.  In just one class with Andrew, I learned more about making a great video than I had in all my other classes combined.  Andrew's practical focus comes from 30 plus years of being a doer, not just a teacher.  And make no mistake, Andrew is a GREAT, humble and respectful teacher.  Andrew's class opened my eyes (and ears!) to how to tell compelling stories through video, and made me a much better consumer of the art as well.  Thanks, Andrew!\"  </p>  <p>  \t    Robert Towry  </p>  <p>  \t    Monument, CO, United States  </p>  <p>  \t    \" I was fortunate to attend Andrews' class in Flagstaff, Arizona this year. A still photographer at heart, I wanted to make the leap into video making. With Andrews class I have learned so much and was so motivated that I want to become the next Spielberg! The course was informative and fun, from theory to fascinating clips that kept us all wanting more! There are many teachers who teach, but Andrew inspires and knows how to tell a story! \"  </p>  <p>  \t    Connie Blaeser  </p>  <p>  \t    Spruce Grove, Alberta, Canada  </p>", 
    "end_date": null, 
    "title": "Video shooting. Techniques loved by pro broadcast directors", 
    "price": "25.00", 
    "instructors": "Andrew St.Pierre White", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420242_a7fb_8.jpg", 
    "course_url": "https://www.udemy.com/motivate-inspire-and-empower-your-video-audience/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T14:52:05Z"
}