{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>This course teaches the essential video and filmmaking skills you need to know in order to shoot great videos and films. </p><p>All the lectures are based on direct personal professional experience gained over 20 years as a director and self-shooter.</p>\n\n<p>The course is presented as a step-by-step Program that is very action-orientated, with a exercise accompanying every lecture and core topic to complete before moving on to the next one. </p>\n\n\n\n<p>In this way, you will absorb the teaching and hugely improve your films and videos.<br></p>\n\n\n\n\n\n\n\n<p>The course takes you into some territory normally associated with higher end cinematography. The main focus, though, is to instil confidence and skills into anyone owning and wishing to use a video-capable camera of any kind - camcorder, smartphone, DSLR or professional video camera.</p>\n\n\n\n\n\n\n\n<p>A key advantage of being in this course is the opportunity to ask Paul Jenkins questions regarding film and video making directly. </p>\n\n\n\n<p>Also, to put up in the course Discussions examples drawn from your work in the course Exercises in order to have it positively critiqued inside the course community and by Paul himself.<br></p>\n\n\n\n\n\n\n\n<p>By taking this course, you will emerge as a confident and skilled film and video maker. You'll know which shots to take, how to take them, how to control the filming situation to your advantage and...most importantly...have a smile on your face when you, your family and friends, and perhaps clients watch the results of your work<br></p>", 
    "end_date": null, 
    "title": "Video Maker: Key Steps to Make Great Films and Videos", 
    "price": "25.00", 
    "instructors": "Paul Jenkins", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/862346_a397.jpg", 
    "course_url": "https://www.udemy.com/video-boot-camp/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-28T16:30:57Z"
}