{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Green Screen effects are NOT JUST for the big studios any more! Move over Lucas, Spielberg ...</strong><br></p>\n\n<p>Learn how you can use a simple green screen set up to make better <strong>videos - that sell more - and increase your profits</strong>.</p>\n\n<p>The fastest (and cheapest) way to turn a low- (or no-) budget video into a professional looking work is with a green screen. And with today's inexpensive lighting systems and ubiquitous editing software, you can do it at home.</p>\n\n<p>In this easy-to-follow, step-by-step course, you'll learn how to shoot, edit, and produce professional looking green screen videos. This course covers all the basics of green screening and it even goes in depth to cover a range of topics to help beginners perfect their videos.</p>\n\n<p><strong>Launched 5 months ago - More than 2,000 enrolled and 32 FIVE-STAR Reviews!</strong><strong><br></strong></p>\n\n<p>You will learn the how to set up your green screen, lighting, camera and tripod, including the positioning of everything. </p>\n\n<p>Shooting green screen video is fun and easy.</p>\n\n<p>Then, I take you into Final Cut Pro X, and show you just how easy it is to drop out and replace your background. </p>\n\n<p>I've also included a supplemental video talks about the fascinating 100-year history of film matting, green and blue screen, and Chroma Key.</p>\n\n<p>Take this course now and discover how to turn your inexpensive educational or sales videos in dazzling, engaging works of art.</p>", 
    "end_date": null, 
    "title": "Video Production Magic: Green Screen & Chroma Key with Ease", 
    "price": "20.00", 
    "instructors": "Robert Scot", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548028_9e4d_5.jpg", 
    "course_url": "https://www.udemy.com/green-screen-video-production-ninja/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-07T15:51:09Z"
}