{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">Do you want to understand the rules broadcast professionals use when editing a TV show?</p><p style=\"\">Do you want to improve the quality of your videos, to the point where your audience can&#039;t get enough?</p><p style=\"\">Are you moving from still photography to video, and is editing is a major challenge?</p><p style=\"\">Are your videos just not getting noticed and shared on your YouTube channel?</p><p style=\"\">Your are a professional video editor, but are not getting noticed because your work is technically fine, but not creatively outstanding?</p><p style=\"\">Then you have come to the right place.</p><p style=\"\"><strong style=\"\">Operators and editors.</strong></p><p style=\"\">In the pro broadcast world, there two types of editors: Operators and editors.</p><p style=\"\">An operator is someone who should be an expert at the software, understands codecs, as well as the export parameters needed for broadcast. Very often, they are not particularly creative. Because it is the technical side that excites them most.</p><p style=\"\"><strong style=\"\">Before you do this course, I have a question:</strong></p><ol style=\"\"><li style=\"\">Do you mainly want to be taught all the technical stuff regarding video production? (called an operator-editor) Or. . . </li><li style=\"\">Do you want to become a creatively intuitive, clever video editor, that can create amazing content from your, or other people&#039;s footage? (called an editor)</li></ol><p style=\"\">If you answered 1., then this is not a course for you. I don&#039;t teach the tech stuff at all. Because, honestly, I am no expert myself. I have worked in broadcast TV as an editor for 37 years, and I still only have a basic understanding of the tech stuff. Because, believe it or not, I don&#039;t need it. And neither do you! </p><p style=\"\"><strong style=\"\">I am an editor. I am not an operator.</strong></p><p style=\"\">Editing video (understanding the software) is easy. It is taught all over the Internet. But find me a truly creative video editing course. I can&#039;t find a good one anywhere. So I created this one.</p><p style=\"\">Editing video is easy to do, but difficult to do well. The trouble is, most video courses on the net are presented by filmmakers making wedding videos and low budget music videos for local bands. Very few are broadcast professionals. The proof is that most video editing courses focus primarily on software, which requires limited creative insight.</p><p>This course is not about software. </p><p>  \t  <strong style=\"\">You will learn:</strong></p>  <ul style=\"\">  \t<li style=\"\">How to attract, grab and hold onto your audience,</li>  \t<li style=\"\">How to entertain your audience, and have them wanting more,</li>  \t<li style=\"\">How to make your edits seamless and integrated,</li>  \t<li style=\"\">How to select music, and avoid the dangers of bad music choices,</li>  \t<li style=\"\">How to avoid the traps amateurs often fall into,</li>  \t<li style=\"\">How to use the power of visual elements,</li>  \t<li style=\"\">The importance of the audio track. Oh, so important!</li>  \t<li style=\"\">Music montage editing— easy to do, but difficult to do well,</li>  \t<li style=\"\">How to edit dialogue,</li>  \t<li style=\"\">How and when to use transitions,</li>  \t<li style=\"\">How to maximise the power of sound effects,</li><li style=\"\">Some stuff about YouTube.</li><li style=\"\">Editing software and what&#039;s good, and what&#039;s less good.</li>  </ul>  <p>  \t      All these skills will make your editing experience easy and intensely creative. You can become a great filmmaker.  </p>  <p><strong style=\"\">You will need:</strong></p>  <ul style=\"\">  \t<li style=\"\"> A broadband Internet connection,</li>  \t<li style=\"\">A laptop or desktop computer.</li>  \t<li style=\"\">Editing software able to edit multi-layered audio tracks. Manipulating multi-layered audio is fundamental to good editing. Any edit software with multi-layer capability, able to handle your source footage, will do.</li><li style=\"\">A basic understanding of video editing. As this is not a software course, you will need an understanding of your software, how to ingest media from your camera card, and how to set up a time-line to begin editing.</li><li style=\"\">An ongoing project would be an advantage so you can practice some of the techniques shown right away,</li><li style=\"\">A sprit of learning something new and intensely creative,</li><li style=\"\">Be prepared to have some fun.</li></ul><p><br style=\"\"></p><p><strong style=\"\">The syllabus</strong><br style=\"\"></p>  <ul style=\"\">  \t<li style=\"\">Part One: Preparation for the edit. Knowing where everything is frees you up to be creative.</li>  \t<li style=\"\">Part Two: How to capture your audience within the first 20 seconds and keep them riveted.</li>  \t<li style=\"\">Part Three: Music choice, music montage editing, back timing for effect and more.</li>  \t<li style=\"\">Part Five: Editing styles. Lots of examples of styles and their affect on the audience,</li>  \t<li style=\"\">Part Five: Transitions, pace and the story, and editing techniques,</li>  \t<li style=\"\">Part Six: Lots of actual broadcast examples. Why they work and the techniques used,</li>  \t<li style=\"\">Part Six: You-tube and presenting to camera. We talk software to assist you in making the right choice. Also, helpful tips on creating a You-tube channel and make money from it.</li>  </ul>  <p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">Software and equipment</strong></p>  <p>  \t      Like our shooting course, we don&#039;t spend much time talking about equipment. We focus on teaching you techniques to tell a great story—whether it&#039;s a full-length documentary, a wedding, or a 30-second commercial, it&#039;s all about story-telling.  </p>  <p>You need to know the basics of your chosen editing software already. This is very important: Although what we teach is performed using computer software, this is NOT a software course. Instead of, <em style=\"\">how to use the software</em>, this is, <em style=\"\">what to do with the software</em>.  </p><p>It does not matter what software you have chosen for your editing setup. As long as you know the basics, everything will be easy to follow and understand.</p><p><strong style=\"\">Your lecturer</strong></p><p>Andrew St Pierre White has 37 years as a broadcast professional, with international awards to his credit. Included in these are Cannes Film Festival, Gold Award for Editing, New York TV, Silver Award Editing and Louries TV Awards South Africa, Grand Prix Editing.</p><p>He has edited numberless TV commercials, several documentary series, many corporate videos and some TV dramas. His work has been broadcast on major channels and networks on six continents. As a director of TV, some of his work is on YouTube, where his channel boasts over four million views a year.</p>", 
    "end_date": null, 
    "title": "Video Editing. Techniques loved by pro broadcast directors", 
    "price": "25.00", 
    "instructors": "Andrew St.Pierre White", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432902_9c4a_4.jpg", 
    "course_url": "https://www.udemy.com/creative-video-editing-how-to-edit-to-engage-your-audience/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T10:46:22Z"
}