{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>This basic video editing course will cover everything you need to know so you can start and edit your videos.</strong><strong></strong></p><p>If you want to learn how to use color grading and editing like is being done in Hollywood, you have come to the right place.<br></p><p>DaVinci Resolve is the most used application for color grading in Hollywood movies, and now, with all the new video editing options DaVinci has become one of the most powerful tools for editing, grading and delivery there are out there and <strong>you can download DaVinci Resolve for free!!!</strong></p><p>Using DaVinci you can generate 'Hollywood like' epic looks with ease for home movies with a few simple steps.</p><p>This course is designed to give you the first introduction into DaVinci Resolve. it is for people who never used it before and want to take their first step into using DaVinci Resolve as a one stop shop for their videos from editing to delivery, using the powerful tools DaVinci Resolve has to offer.</p><p>In the course we go through the whole process of:</p><ul><li>getting the footage into DaVinci Resolve,</li><li>Creating the edit, </li><li>Adding Music &amp; Titles, </li><li>Animating the Titles, </li><li>Using transitions, </li><li>Understanding the basic Color Grading tools (like color wheels, nodes). </li></ul><p><strong>By the end of this course you will be able to fire up DaVinci, edit your footage and color correct your whole video and export it.</strong></p><p>So if you are new to the whole video editing business and want to learn how to create your own videos with DaVinci Resolve, get the course, download the free footage I have for you and learn all about the software Hollywood editors use to produce epic videos.</p>", 
    "end_date": null, 
    "title": "Video Editing using DaVinci Resolve", 
    "price": "50.00", 
    "instructors": "Uri Soglowek", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605876_17a6.jpg", 
    "course_url": "https://www.udemy.com/video-editing-using-davinci-resolve-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T13:18:48Z"
}