{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>With 20+ successful Udemy courses, Roy, Adam, Dragos\n&amp; Richard have amassed 17,000+ students and over 750 five star reviews.</strong></p><p>Do\nyou find it difficult to present in front of the camera? Do you struggle to\nattract and maintain the viewer’s attention? Maybe you find it odd to see\nrecordings of yourself and think that your voice, body language and charisma\ncould be better.</p><p>The truth\nis even if you had experience presenting in front of other people before,\nproducing compelling videos can often be more challenging because you lack the\ncrowd's feedback and you can't take on their energy.</p><p><strong>Our Story</strong></p><p>You would\nthink that we were naturally good at presenting in front of\nthe camera, but in reality we had our own growing pains.</p><p>For\nexample, before launching his first Udemy course, Dragos had doubts whether he\nwould be a successful communicator in this medium. He decided to launch the\nfirst course no matter what and the feedback he received was excellent. By\nmaking a conscious effort to continuously improve, he managed to bring his\npresentation skills to the next level. It seems silly to him now that he ever\ndoubted he could make it.</p><p>Dr. Roy, on the other hand, had been conducting self-improvement training for over twenty years. However, only a year ago had he decided to start his own online business and begin generating passive income. Let's face it, endeavor like this at the age of 50 is quite a challenge but this is also why it has been so rewarding. Remember, it's never too late to take that next step. <br></p><p><strong>What This Course Will Teach You</strong></p><p>We\nbelieve that any learning process can be hacked. All it takes is a desire to\ntake action, commitment and the right guidance.</p><p>We can\nprovide you with the last element - through our experience we know the exact\nhacks and focus points that you need to understand in order to become a better\npresenter. This applies to both filming yourself in front of the camera &amp;\ndoing high quality screenshare videos.</p><p>As such,\nthis course contains:</p><ul><li><strong>The\n     On-Camera Fundamentals</strong>: Learn to use pauses, play with your tone of voice, maintain eye\n     contact and other tricks that will revolutionize your speaking technique</li><li><strong>Non-Verbal\n     Communication 101:</strong>\n     Improve your body language and charisma by understanding the variety of\n     communication patterns at your disposal</li><li><strong>The\n     Screenshare Blueprint</strong>: Engage &amp; fascinate your audience through the power of your\n     voice when doing screenshare videos</li></ul><p>As a <strong>BONUS</strong>, we've also included an entire section on\nfilming &amp; recording technicalities covering on-camera tips &amp; tricks,\nhow to record using a microphone and \nCamtasia editing fundamentals to produce your videos by yourself.</p><p><strong>The Guarantee</strong></p><p>We're\nconfident that our combined experience will help you become a better presenter\nand produce mind-blowing videos that can earn you passive income. There are\nalso a variety of FREE preview lectures so that you can convince yourself of\nthe quality of this course.</p><p>Additionally, you have a 30 day money back guarantee - so there is absolutely no risk when\npurchasing this course. If you're still not satisfied, we'll guarantee to\nprovide you with structured feedback on a video that you produce, so that you\nreceive actionable advice to help you improve your presentation skills</p><p><strong>Take Action &amp; Enroll Now!</strong></p><p>There is\nno better time to take action than now. If you truly want to channel your inner\ntalent &amp; become a better on-camera presenter, then <strong>take this course now</strong> and meet us in the virtual classroom!</p>", 
    "end_date": null, 
    "title": "Video Presentations: Screenshare & Talking Head Blueprint", 
    "price": "20.00", 
    "instructors": "Dr. Roy Naraine, Dragos Stefanescu, Adam Naraine, Richard Korbut", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/720744_5277_5.jpg", 
    "course_url": "https://www.udemy.com/video-presentations-screenshare-talking-head-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T13:20:51Z"
}