{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Are you an indie producer, shooter and work mostly on your own?</p><p>Are you working on small budgets that means hiring a crew is not possible?</p><p>Are you a one-man crew, doing almost everything yourself?</p><p>Do you have a wish to create great YouTube content, but this means that you have to do this on your own?</p><p>Do you want to improve the quality of your videos, to the point where your audience can&#039;t get enough?</p><p><strong style=\"\">Then you have come to the right place.</strong></p><p>I like to think of myself as one of the world&#039;s most experienced self-shooters. Because with basic equipment, I have made several TV documentaries that have been broadcast on TV networks, all by myself. And I can teach you how to do that.</p><p>I&#039;ve been a broadcast professional for 37 years. And much of what I have done, particularly recently, has been shot on ordinary equipment, by myself, with me as presenter. How does one do that? I even once did a single-crew, three camera shoot! Was that a world first?</p><p>Some of the best work I have done, I&#039;ve been alone in a remote environment, shooting my TV series. And I use ordinary HD video equipment. Because budgets are tight, there isn&#039;t the cash to blow on the very best gear. But that doesn&#039;t matter. Because basic equipment is better suited to the one-person shoot.</p><p><strong style=\"\">This course will help you with:</strong></p><ul style=\"\"><li>Gear choices,</li><li>Discipline while shooting,</li><li>Staying light-weight and portable,</li><li>Getting great audio, as well as video,</li><li>Confidence building and new ideas.</li></ul><p>So many independent producers are lonely people. When I edited for TV commercials, we used to call ourselves mushrooms—we stayed in a dark room and were fed bullsh*t. Like this, indie video producers work in an environment that cuts us off from humanity, Especially in the edit phase. b the shooting can be like that too. There is so much to think about, and when we are being paid for the work, so much at stake also.</p><p><strong style=\"\">Curriculum</strong></p><ul style=\"\"><li>Part 1. Introduction.</li><li>Part 2. Equipment and rig ideas for the one-person crew.  </li><li>Part 3. Compact camera rigs for the single shooter.</li><li>Part 4. Camera and microphones for easy handling</li><li>Part 5. More on microphones.</li><li>Part 6. Getting the most out of a GoPro.</li><li>Part 7. GoPro mounts</li><li>Part 8. DSLR vs Mirrorless cameras</li><li>Part 9. Shooting techniques.</li><li>Part 10. Perspective.</li><li>Part 11. Camera cases.</li><li>Part 12. Audio recording.</li><li>Part 13 The affect of shutter speed.</li><li>Part 14. Backing up and protecting your data.</li><li>Part 15. Editing concepts.</li><li>Part 16. Conclusion and summary.</li><li>Part 17. Samples of self-shooting broadcast shows by the lecturer (links)</li></ul><p><strong style=\"\">Your lecturer</strong></p><p>Andrew St Pierre White has 37 years as a broadcast professional, with international awards to his credit. His most famous solo shoot was an expedition crossing the great Kalahari Desert on his own—with no crew or backup whatsoever. The resultant TV shows included two, 24-minute documentaries for broadcast TV. They were the most popular episodes of the season.</p><p>He understands what it takes to capture great footage and audio to make compelling videos— even as a low-budget indie producer. And, wether it be a documentary series, a 30-second commercial or a YouTube product review, he has done them all. His YouTube channel boasts about four million views a year and his commercials and TV shows have been broadcast all over the world.</p><p><strong style=\"\">Testimonials from our Udemy course attendees:</strong></p><p><strong style=\"\"></strong></p><p><strong style=\"\">The Best Course about How to make video !</strong></p><p>Thank you Mr Andrew..your lectures make me understand how to shoot and edit video for the best result ! really inspiring..</p><p>Rochmad Nuryadin</p><p></p><strong style=\"\">Just what I have been looking for</strong><p>Andrew. Just a quick note to let you know how much I appreciate this course. I have been studying video-making for some time, but I always got stuck at the storytelling part.</p><p>You are now my hero and I&#039;m not even a 4x4 gearhead adventurer (yup, I looked you up). :)</p><p>For anyone in the course reading this, I don&#039;t know Andrew from Adam. I only learned about him looking through Udemy, then looked him up on Google, YouTube, Vimeo, etc.</p><p>Michael</p>", 
    "end_date": null, 
    "title": "Video shooting without a crew. Be exceptional on your own.", 
    "price": "20.00", 
    "instructors": "Andrew St.Pierre White", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487506_ac83_4.jpg", 
    "course_url": "https://www.udemy.com/video-self-shooting-video-excellence-on-your-own/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T13:41:21Z"
}