{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t<strong>What is the difference </strong>between the freelance video editor who gets paid $20/hr and the <em>professional</em> who can make $15,000 for a 60 second deliverable?  </p>  <p style=\"\">  \t<strong>Hint: it is NOT their editing skills.</strong>  </p>  <p style=\"\">  \t                                                                                                                   In this course I am going to show you how to make videos that big companies will pay you thousands for ... videos you already have the skills to make.  </p>  <p style=\"\">  \t<strong>          More specifically, I will walk you through the exact process I have used to:  </strong>  </p>  <ul>  \t<li><strong>Land video projects with Dish Network, American Express, Humana, The Home Depot, Whisper, United Way  and a bunch of other brands</strong></li>  \t<li><strong>Win a Mini Cooper Countryman from an online video contest hosted by Dairy Queen!</strong></li>  \t<li><strong>Produce a Kickstarter video for a project that got just shy of 600% of its goal ($115,000)</strong></li>  \t<li><strong>Get top rankings for youtube videos, one of which has gotten over 132,000 views</strong></li>  \t<li><strong>Consult a contestant of a national video contest that literally won him a MILLION dollars!</strong></li>  </ul>  <p style=\"\">  \t                                                                                                                   You might be thinking: “Hey Logan, this all sounds awesome! But HOW the heck am I actually going to do these things?\"  </p>  <p style=\"\">  \t                                                                                                                   I'm so glad you asked :-)  </p>  <p style=\"\">  \t<strong>          Here are just a few of the proven methods you will learn in this course:  </strong>  </p>  <ul>  \t<li><strong>How to stop the bickering of your clients and get them to respect YOU as the expert</strong></li>  \t<li><strong>The exact process I use to break through ambiguous client requests to deliver results that blow their minds and get me constant referrals</strong></li>  \t<li><strong>Step-by-step instructions on how to use the same process that the big brands like Denny's and Dominoes Pizza use to develop their commercials.</strong></li>  \t<li><strong>Communication Power-UPs that you can apply to any video to help make it perform better out in the market</strong></li>  \t<li><strong>Practical tricks to get yours videos SEEN</strong></li>  \t<li><strong>We'll even cover In-depth Youtube SEO</strong></li>  </ul>  <p style=\"\">  \t<strong>Here is the best part: </strong>You do NOT need exceptional editing skills, current clients or industry contacts. The strategies taught in this course are <em>guaranteed</em> to increase your video production earnings whether you are a veteran or are just getting started.  </p>  <hr style=\"\">  <p style=\"\">  \t<strong>Read what students are saying:</strong>  </p>  <p style=\"\">  \t<em>\"This course is, by far, the best course I have taken here on UDEMY. The production is ultra-professional, the content is compelling and engaging and Logan hosts it with a perfect blend of professionalism and subtle humor.\" </em>- Christian  </p>  <p style=\"\">  \t<em>\"Awesomest video course ever ever ever! I will give 6 stars!!!\" </em>- Syed  </p>  <p style=\"\">  \t<em>\"Make The Right Video will actually teach you something that you DON'T know! If you are a photographer, designer, or any sort of creative this course will help you out because the focus isn't on how to make the VIDEO right but how to make the RIGHT video.\" </em>- Aaron<br style=\"\">  </p>  <hr style=\"\">  <p style=\"\">  \t<strong>If you're ready</strong> to take your career to the next level through the highly refined techniques that are used by agencies and consulting companies every day, then it is time to get started!  </p>  <p style=\"\">  \t                                                                                                                   - Logan Bean, Video Production Expert and Founder of MakeTheRightVideo  </p>", 
    "end_date": null, 
    "title": "Video Production: Make The Right Video for Every Client", 
    "price": "50.00", 
    "instructors": "Logan Bean", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266204_3759_9.jpg", 
    "course_url": "https://www.udemy.com/maketherightvideo/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T04:17:14Z"
}