{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>In this class I’ll show you what 4K video is, explain why it’s the video format of the future, and teach you 4 techniques that make 4K the most dynamic and useful format to use in your video edits</p>\n\n<p>I’ve been creating video content as an editor and creative director for over a decade and in the last 5 years I’ve really seen 4K video become the format of choice in the professional world. And now, with affordable 4K capable DSLRs on the market, shooting in 4K isn’t just for the professionals.</p>\n\n\n\n\n\n<p>Now you you can also take advantage of this format!</p>\n\n\n\n\n\n<p>Drawing on my experience, I’m going to teach you some of the ways you can use 4K video in your projects to make them look better and feel like they have a higher production value.</p>\n\n\n\n\n\n<p>We’ll jump into Premiere Pro CC where I’ll show you the techniques I use to get the most out of my 4K footage using really awesome quality video samples provided by the stock footage company, Dissolve.</p>\n\n\n\n\n\n<p>This class is for editors of all levels as well as anyone interested in understanding what the big deal with 4K is! And if you’re up for a challenge, I’ll guide you in creating a simple project that’ll give you a clear insight into how powerful 4K video can be.</p>\n\n\n\n\n\n<p>So enroll now, learn about the video format of the future and how you can use it to make your projects look and feel even more awesome!</p><p>If you like this, make sure to check out my premium course: Fast, Fresh, And Exciting - How To Edit Amazing Videos.</p>", 
    "end_date": null, 
    "title": "Video Editing: Master 4K Video In 30 min", 
    "price": "20.00", 
    "instructors": "Allan Michael", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/862842_d7f0_2.jpg", 
    "course_url": "https://www.udemy.com/video-editing-master-4k-video-in-30-min/", 
    "currency": "USD", 
    "subject_name": [
        "Video Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-29T12:58:50Z"
}