{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This yoga course is focused on proper alignment and meant for students of all levels, from those who have a little yoga experience to those who are teachers. We will cover proper alignment techniques for popular yoga poses and strategies for avoiding injuries in your practice. This course comes with 11 full length sessions with me so you can put to practice immediately what you've learned. </p><p>We will break down and practice poses that you'll most often see in my classes and most Hatha yoga teachers' classes. We'll look at poses where the front leg is neutrally rotated in the pelvis and poses where the front leg is in external rotation. We'll also break down sun salutations (Surya Namaskar A and B) and variations. We also practice proper alignment in chatturanga, upward dog and downward dog. Inversions are discussed and practiced as well.</p><p>Our course is structured so that you'll watch the interactive lectures first and then practice the 30-minute vinyasa flow classes. The course will take you about 8 hours to complete. I would recommend practicing one section at a time and then the practice. Each section will take 45 minutes to an hour to complete (including the practice) and I've included quiz's after each lecture to be sure the information stays with you.</p><p>Take this course if you love yoga! I want us all to practice until we're well into our 90's, so let's make our alignment as good as it can be. This course is based on my 10 years of teaching as well as my experience as a teacher trainer. I've taught over ten 200-hour teacher training courses through YogaWorks and I'm also a teacher on the faculty of the 300-hour professional program. The YogaWorks method is the \"Gold Standard\" of teacher training, so the information you'll receive here is awesome!</p>", 
    "end_date": null, 
    "title": "8-Hour Yoga Alignment Course with Lesley Fightmaster", 
    "price": "50.00", 
    "instructors": "Lesley Fightmaster", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625274_1309_2.jpg", 
    "course_url": "https://www.udemy.com/8-hour-yoga-alignment-course-with-lesley-fightmaster/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T22:49:13Z"
}