{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is designed to provide complete and thorough instruction on the many features and tools of Articulate Storyline 2. Storyline 2 is arguably the best software on the market when it comes to eLearning authoring tools. It is what we use to build our courses. By completing this course, you should have all the knowledge necessary to build your own course from scratch and publish it in the format of your choosing. </p><p>Just as Storyline 2 is a software designed for a particular use and a specific set of users, this course won't be for everyone. Trainers, teachers, and other educational professionals are the most likely to benefit from taking this course, although we have seen other creative uses of Storyline in fields like marketing. Regardless of your position or background, we have tried to make this course accessible by minimize our use of technical jargon and by providing a theoretical basis for our approach to course development. We make every effort to explain new terms and concepts as we employ them, and we reinforce that knowledge by returning to them throughout the course. </p><p>In order to help you get the most out of this course, we have included a number of resources designed to give you hands-on experience working in Storyline 2. Throughout the course we will be working on a sample course as a means of demonstrating the concepts and processes. We've included the .story files (the file format Storyline projects are saved in for further editing) so that you can follow along and reverse engineer what we've built. We've also included the raw assets for every lecture where it is pertinent to do so. Using these assets and your own version of Storyline 2, you can replicate what we have done from the ground up. </p><p>While the bulk of the course is a mix of video and screen recordings, we do try to mix things up with some animated interludes, and maybe even a bit of comedy thrown in for good measure. The course is laid out by sections each of which cover a specific set of processes within Storyline 2. We have ordered both the lectures and sections in stages of increasingly complexity and designed them to build on one another. If you're new to the software, you'll want to start from the beginning. However, if you've done some previous work in Storyline 2, or if you are Storyline 1 user looking to make the switch to the new software, you're welcome to skip around to the topics that you are interested in learning. </p>", 
    "end_date": null, 
    "title": "Articulate Storyline 2", 
    "price": "20.00", 
    "instructors": "Inception Labs", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380946_5d34.jpg", 
    "course_url": "https://www.udemy.com/articulate-storyline2/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T16:09:06Z"
}