{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Every day we are bombarded with stories, be it through literature, films or merely gossip. Stories drive our very existence and enable us to imagine the future.</strong></p>\n\n<p>The tradition of telling stories is as old as language itself, and throughout the ages has been used to communicate wisdom and understanding from one generation of people to another.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>A wise man once said that, If history were taught in the form of stories, it would never be forgotten! 'Captivate Your Audience With Unforgettable Storytelling' begins by breaking down storytelling's secret underpinnings, hidden meanings and exploring the dynamic relationship between you, the story &amp; your intended audience.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>By the end of the course you'll be able to:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Use More Expressive &amp; Emotional Language in Your Storytelling.</li><li>Communicate Your Life's Experiences in the Form of Stories.</li><li>Understand &amp; Engage With Your Audience More Intimately.</li><li>Shape your Stories in a Way That Wins Peoples Hearts &amp; Minds.</li><li>Develop Your Imagination and Your Core Communication Skills.</li><li>Improvise for Engaging Your Intended Audience With Greater Ease.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Throughout the course, you'll discover easy-to-follow methods for building, capturing and maintaining your audience's attention. You'll acquire easy-to-use techniques for finding, selecting, and preparing your stories whether they are your own real-life experiences, ancient folk tales, or re-delivered stories that you take from this course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Whether you wish to sharpen your storytelling abilities in the boardroom, at bedtime, in the classroom or even around the bonfire with friends, 'Captivate Your Audience With Unforgettable Storytelling' has the answer. Although the context in which you tell your stories may change, these timeless methods will always remain the same.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>This course comes with a 100% Money Back Guarantee and is a treat for the heart &amp; minds of those who are new to storytelling, &amp; even for more experienced storytellers.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "Captivate Your Audience With Unforgettable Storytelling", 
    "price": "20.00", 
    "instructors": "Kain Ramsay", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609786_f6db_4.jpg", 
    "course_url": "https://www.udemy.com/captivate-your-audience-with-unforgettable-storytelling/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T08:23:31Z"
}