{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Learn How To Create a Course In Multiple Languages and Sell Them Around The World And Double Your Income!</strong></p>\n\n<p>In this course you will learn how to create your own video courses, in multiple languages you don’t speak, even if you have no previous experience of teaching people online.</p>\n\n<p>At the end of this course, you will be able to create your own video course and teach thousands of people around the world who are willing to pay for your knowledge</p>\n\n<p>I designed this course so that you will be able to create your course step by step, from finding the idea to writing the plan of your course, to shooting videos and uploading your course to different platforms.</p>\n\n<p>This course is ideal as for new instructors that are only thinking about the possibility of teaching and making money online and for those who already have experience of creating video courses and now want to reach a new, global market of online learning.</p>\n\n\n\n\n\n<p>For successful completion of this course, you do not need to meet any specific requirements besides to be open to new ideas and be willing to learn.</p>\n\n\n\n\n\n\n\n\n\n<p>If you want to get a new passive source of online income while sharing your knowledge with thousands of people around the world, read the course description below.</p>\n\n\n\n\n\n\n\n\n\n<p>There is an option to watch few lectures for free and if you’ll find this information valuable, click the button “take this course”.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Create a Course in Multiple Languages and Double  Income", 
    "price": "20.00", 
    "instructors": "Alexander Rich", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858488_6040_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-course-in-multiple-languages-and-double-income/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T11:48:43Z"
}