{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \tEste curso foi organizado para oportunizar a candidatos às carreiras públicas educacionais do Distrito Federal, conhecimento amplo e aprofundado sobre a Lei de Gestão Democrática do Sistema de Ensino Público do DF, de nº 4.751/2012.  </p>  <p>  \tPor meio das aulas, o candidato aprenderá qual o amparo legal nacional – Constituição Federal de 1988 e Lei de Diretrizes e Bases da Educação Nacional, nº 9394/96 – e, distrital, Lei Orgânica do DF. As aulas aprofundam, também, a finalidade da Lei, quais os seus princípios e como a Lei está organizada em relação aos mecanismos de participação da comunidade escolar – pais, mães, responsáveis, alunos, professores, carreira assistência – e dos representantes dos trabalhadores em educação, além da comunidade acadêmica do DF.  </p>  <p>  \tEsta participação, que se dá pela formalização de sete colegiados e pela escolha da direção da unidade escolar, por meio do voto direto, precisa ser compreendida de forma didática, a fim de que os candidatos possam, realmente, dominar todo o conteúdo da Lei de Gestão Democrática do DF.  </p>  <p>  \tPara tanto, o curso foi organizado em blocos, com duração total de, aproximadamente, duas horas. Essas aulas que compõem os blocos contam com exposição da Professora Vânia Rego - de forma contextualizada - e disponibilização, para cada temática abordada, de questões de provas, além de slides que permitem com que o candidato possa rever os conceitos trabalhados na Lei, sistematicamente, a qualquer tempo, tendo em vista que estão disponíveis para download.  </p>  <p>  \tAssim, pode-se garantir que as aulas permitem acesso a um material de estudo de qualidade, elaborado com muita responsabilidade - tanto conceitual, como didática e metodológica - e trabalhado de maneira que os candidatos tenham facilitada a compreensão necessária para responder a quaisquer questões de provas de certames acerca da Lei de Gestão Democrática do Sistema de Ensino Público do Distrito Federal.  </p>", 
    "end_date": null, 
    "title": "Domine a Lei nº 4.751 e Gabarite Todas as Questões da Prova", 
    "price": "20.00", 
    "instructors": "Vânia Costa Rego", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/271370_eaf8_7.jpg", 
    "course_url": "https://www.udemy.com/lei-n-4751/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-30T01:39:19Z"
}