{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \tSaber cómo analizar los problemas empresariales, reconciliar varias perspectivas, decidir una solución y convencer a los demás son las capacidades más importantes que debe adquirir un directivo para ejercer con éxito su profesión.  </p>  <p>  \tEl método de casos, que es uno de los principales métodos de enseñanza activa, ayuda a los alumnos a desarrollar dichas capacidades tratando problemas empresariales reales en clase y enseñándoles a pensar y decidir como directivos.  </p>  <p>  \tYa sea analizando los retos a los que se enfrenta una empresa del sector de la construcción, un parque de atracciones, un fabricante de cerámica o una línea aérea en apuros, el método de casos exige que los alumnos se pongan en el lugar de los directivos: ¿Cómo puedo mejorar las ventas? ¿Cómo puede aumentar una empresa su flujo de ingresos teniendo en cuenta su nuevo entorno competitivo? ¿Qué políticas de incentivos pueden funcionar en un sector con una elevada facturación?  </p>  <p>  \tA diferencia de los métodos de enseñanza basados en las clases impartidas por los profesores, en el método de casos, son los estudiantes los que aportan principalmente las ideas en clase. El profesor facilita y guía el debate, haciendo preguntas y fomentando la participación de toda la clase para enriquecer la discusión con distintos puntos de vista, experiencias y procedencias culturales.  </p>", 
    "end_date": null, 
    "title": "Fundamentos del Método de Casos", 
    "price": "20.00", 
    "instructors": "UNID Universidad Interamericana para el Desarrollo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274650_622c_2.jpg", 
    "course_url": "https://www.udemy.com/fundamentos-del-metodo-de-casos/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T17:27:45Z"
}