{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>The College Search and College Application process can be daunting and overwhelming!</p><p>As a <strong>parent of a high school student</strong> -- would you base one of the most important decisions of your child's life on a 15-minute conference with a high school counselor? Or a 1-hour meeting in a school cafeteria?<span></span></p><p>You will learn how -James - a highly-intelligent, gifted athlete and high school student whose dreams of getting into West Point were crushed and left this student devastated...all because his parent's made this one HUGE mistake!</p><p>Let's face it.</p><p>You're going to spend between $20,000-$300,000 on college tuition.</p><p>Before you do, let College Preparation Expert -- Michael Mastroianni -- give you a few valuable \"knowledge-gold bars\" -- so that you and your teen can begin preparing for College.</p><p>Do you have countless hours to spare -- to gain the know-how to navigate through the maze of websites, search for a college, a financial aid package OR select the right major for your child?</p><p>Michael can prepare your teen to navigate the ins and outs of College Admission and Financial aid. Lectures include: The 3 Biggest Mistakes that Will Sabotage Your Child's College Admission, What College Admission Option is Best for Your Child, How to Plan for College, and much, much more.</p><p>This course will introduce you to the vast expertise and knowledge of Michael Mastroianni-- who has helped THOUSANDS of high school students and their parents apply for and get accepted into colleges that best suited them.</p><p>You can invest in the rest of his materials through the Get Knowledge for College Mastery program.</p>", 
    "end_date": null, 
    "title": "Get Knowledge for College Boot Camp", 
    "price": "20.00", 
    "instructors": "Michael Mastroianni", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541536_551e_2.jpg", 
    "course_url": "https://www.udemy.com/get-knowledge-for-college-free/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T19:27:31Z"
}