{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t          This course compiles resources for those who are in the process of looking for a teaching position.  Once a position is gained, the course offers an overview of what to expect and how to make the most of it.  The goal is to provide resources for pre-service and 1st year teachers so they can be successful at every step of the way. This course is for new or first year teachers who are preparing for interviews, demonstration lessons and getting ready for their 1st year of teaching.  Participants will identify specific strategies and resources for interview preparation.  A 14 minute lecture offers learners specific tasks that will help prepare them for a teacher interview.  The lecture specifies specific aspects of the interview that candidates can control. Students will take each strategy and prepare for their specific interview.  They will practice responding to interview questions, preparing interview questions and  developing a solid philosophy statement.  A 17 minute lecture will help candidates work through the planning of their demonstration lesson.  Learn how to start and end the lesson, the elements that should be included, and how to identify a topic. Learn about the 5 phases that new teachers go through in their first year of teaching including: anticipation, survival, disillusionment, rejuvenation, and reflection.  Participants will learn that each phase offers an opportunity even if it is a low point.  The final 10 minute lecture offers strategies as well as some specific tools for managing time and staying productive.  Practice developing routines for both work and home situations.  Learn about the routines that will give the greatest results.  Identify the strategies that will allow you to manage your personal time and your work time the best.  All of these resources can be used throughout the first year of teaching in order to work through some of the most difficult moments.  The first year will be stressful but it can be productive and meaningful if the right resources are able to be accessed.  </p>", 
    "end_date": null, 
    "title": "Get Your 1st Teaching Job", 
    "price": "25.00", 
    "instructors": "Gabrielle Marquette M.Ed.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400554_f9b0_2.jpg", 
    "course_url": "https://www.udemy.com/get-your-1st-teaching-job/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T23:26:43Z"
}