{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>While there are other courses out there on GAFE, this course will give <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">real life examples </strong></em>on how you can use GAFE in your teaching and everyday practice.  The course will focus on the multiple uses of Google Apps for Education and how teachers can incorporate Google Apps into their classroom in order to <strong class=\"redactor-inline-converted\">improve student learning </strong>and <strong class=\"redactor-inline-converted\">assessment in instruction</strong>.  Each session will focus on a particular application, explaining how to use it, as well as <strong class=\"redactor-inline-converted\">specific examples </strong>on how it can be implemented in the classroom.  We will not only cover the basics involved in Google Apps (docs, sheets, forms, slides. classroom, sites), but we will also target specific add-ons in order to increase productivity, student learning and assessment in instruction.  These add-ons and extensions will include speech-text/text-speech software, dictionaries and translation services so the students can access the information with ease.    <strong class=\"redactor-inline-converted\">By using GAFE, teachers will be able to create and share engaging lessons, and students will be able to automatically turn in their assignments online.</strong>  Teachers will also be able to create online quizzes, and then <strong class=\"redactor-inline-converted\">automatically grade</strong> and email their students their scores and a personalized message.  They will also be able to <strong class=\"redactor-inline-converted\">track student progress, send automated emails </strong>if students are missing any work and create lessons that allow students to virtually visit places throughout the world.</p>\n\n\n\n\n\n<p>By the end of the course, participants will be able to create a Google group, create and share calendar events, Google docs, sheets, forms, slides and utilize specific add-ons to increase productivity and student performance. The end of the course will cover how to set up and use Google Classroom and Sites in order to create a platform in which students can interact virtually to share resources and assignments. <strong>The goal of this course is that participants will be able to utilize and implement the various Google Apps for Education applications in order to engage students in learning, increase productivity and use assessment in instruction.</strong></p>", 
    "end_date": null, 
    "title": "Google Apps for Education: A Guide for Educators", 
    "price": "30.00", 
    "instructors": "Amy DeMarco", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/860138_463d_4.jpg", 
    "course_url": "https://www.udemy.com/educatorhelpgafe/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-25T23:59:09Z"
}