{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Update</strong>: <em>Oct 14th - I now earn over <strong>$10,000 per month</strong> publishing short romance books. That's net to me, not my total sales. It's the cash I actually receive in my hand! This course will show you how to get started writing your short romance books.</em></p><p><strong>Why are some romance books impossible to put down, while others don’t get read past the fifth page?</strong><br></p><p>Don’t believe anyone who tells you that it’s all about the author’s talent. Unless you’re a natural born genius of romance (which most of us aren’t), then good writing is only 10% talent, and 90% skill. </p><p>Our course is aimed to help you with that 90%.</p><p>These simple tips, tricks, and practical suggestions will help you excel in the most bestselling fiction genre in the world. <em>The Love of Writing Romance</em> is divided into seven lessons delivered in a conversational tone, each dealing with different elements of writing romance:</p><p><em>1. No Fear</em></p><p>The introductory lesson is about what may stand between you, the writer, and your work, how to overcome it, and offers some practical tips on increasing your productivity.</p><p><em>2. The Art of Plotting Romance</em></p><p>The second lessons contains accessible advice on how to lay out and plot your novels and stories.</p><p>3. Lovely Scenes, Sexy Sequels</p><p>Building on the second lesson, <em>Lovely Scenes, Sexy Sequels </em>is about how you can streamline your writing while making sure it remains engaging (and emotionally impactful) throughout.</p><p><em>4. Conflicts and the In-Between</em></p><p>Conflicts! Without them, most stories aren’t worth reading. The fourth lesson in our course talks about conflicts, and how to build them.</p><p><em>5. Characters Are People Too</em></p><p>There’s nothing worse for a romance story than characters your readers won’t care about. How can you make them engaging? This is what this lesson covers.</p><p><em>6. Erotica That Doesn't Suck</em></p><p>How to write erotica … that … doesn’t … suck. What more is there to add? Examples of good and bad erotic writing, what words to avoid, and how to make sure your sexy scenes stay that way.</p><p><em>7. 10 Points of Classy Romance</em></p><p>The last lesson in our course is a comprehensive summary of everything we’ve covered so far, and a few more tips for the future.</p><p><strong>Take bold action now!</strong> Scroll up and click \"Take This Course\" and start learning how to write your first romance book. In a month or two you will be earning hundreds if not thousands of dollars passively each month!</p>", 
    "end_date": null, 
    "title": "How to Write Your First Romance Novel", 
    "price": "35.00", 
    "instructors": "Mike Yap", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635074_91b4_3.jpg", 
    "course_url": "https://www.udemy.com/writing-romance/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T17:33:36Z"
}