{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t  In this course, educators will take a deep dive into the anchor standards and practices that provide natural connections between the Common Core State Standards and the Arts.  We will be exploring in <strong>(4) lesson modules</strong> where the standards are located, what anchor standards and practices are essential to English/Language Art, Math and the Arts and how to connected them in a way that maintains the integrity of your content while creating meaningful applications for your students.  </p>  <p>  \t  Each lesson is between <strong>15-20 minutes in length</strong>, which includes time for reflection and a short, 5-minute application of the lesson&#039;s content.  The lesson is provided as a video lecture and includes the slides as a PDF so that you can print them and take notes as needed.  Each &quot;assignment&quot; is an action-oriented, practical expression of personal understanding.  </p>  <p>  \t  This course is for any educator looking to make authentic, integrated lessons a reality in their classroom.  Whether a classroom educator looking to bring in the arts through the Common Core, or as an arts educator who is looking for some help in utilizing the Common Core State Standards <strong>without sacrificing their arts time</strong>, this course will help make the process manageable and practical.  </p>", 
    "end_date": null, 
    "title": "How to Connect the Common Core and Arts Standards", 
    "price": "30.00", 
    "instructors": "Susan Riley", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305430_7f28_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-connect-the-common-core-and-arts-standards/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-22T15:08:32Z"
}