{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><em>How children develop mathematical understanding during the early years is very important.Brain develops very rapidly in Early Childhood and Children are naturally interested in the Mathematical patterns around them.</em></p><p><em>If you could build a strong base on the 10 essential Mathematical concepts in your child, you could make him/her a MATHS GENIOUS.</em></p>  <p><em>Exposure to early Maths is very important as it sets them on a path towards intelligence and confidence in later life.</em></p>  <p><em>Early exposure to math will make your child’s comfortable with Maths skills. Also, opportunities to practice these skills will increase your child’s confidence  making him or her a true genius. </em></p><p><em>If your child does not become comfortable with maths concepts at a young age, she will lack confidence in her abilities and may struggle as more advanced math concepts are introduced at school.</em></p><p><em>The methods taught here are proved, result oriented ones</em></p><p><br></p><p><strong>Contents</strong></p><p>All the 10 essential Mathematical Concepts are covered.</p><p>Tips and Techniques to Make Maths fun and interesting.</p><p>Evaluation Methods.</p><p>Downloadable samples of Lesson plan, evaluation sheet, and summary of the course.</p><p>The course contains more than 90% of video content.</p><p>Video Lessons are taught in easy to understand interactive way</p>", 
    "end_date": null, 
    "title": "How to Help  your Child become a Maths Genius", 
    "price": "25.00", 
    "instructors": "Shameela Yoosuf Ali", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520394_5ed4_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-help-your-child-become-a-maths-genius/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T15:13:07Z"
}