{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">The Introduction to Environment Rating Scales is a three part course consisting of several lectures. The focus of Part 1 is to introduce learners to the history and development of the Environment Rating Scales, explain how Environment Rating Scales are structured, provide an overview of the Infant/Toddler and Early Childhood Environment Rating Scales, and  to provide an overview of the space and furnishings and personal care routines subscales. In Part 2, learners will be introduced to the Quality Start System for Louisiana, and the Social Emotional Subscales, and their importance in assessing quality in early childhood programs. The major focus of Part 3 is to introduce learners to the process of scoring the ERS, and what to expect prior, during, and after and ERS evaluation. </p><p style=\"\">After completing all three parts of this training, learners should understand not only the reasoning behind and research that supports the Environment Rating Scales, but also gain an understanding about how the scales are organized, and how they can be utilized in helping child care providers set up classroom environments that foster active learning, health, and safety; thus improving the quality of early care and education programs for young children. </p> <p style=\"\"><strong style=\"\">This course is worth 3 training credit hours.</strong></p>", 
    "end_date": null, 
    "title": "Introduction to ERS", 
    "price": 0, 
    "instructors": "Barbara Wood, Nicholy Johnson, Tracy Jones", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462584_dbbb_6.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-ers/", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T03:05:34Z"
}