{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>¿Has notado que tus alumnos se distraen en clase, se aburren o que están desmotivados y sin ganas de aprender? ¿Crees que algo ha cambiado en la sociedad y que tus alumnos ya no están en sincronía con el modelo educativo que tu tuviste?</p><p>Si te has formulado este tipo de preguntas alguna vez es que tu también crees que algo se puede hacer para cambiar estos hechos. Y por lo tanto estás buscando cursos como este para mejorar como docente.</p><p>En este curso vas a aprender una nueva metodología educativa llamada Flipped Classroom o clase invertida con la que motivar a tus alumnos a querer aprender, a querer involucrarse en tus clases y a responsabilizarse de su aprendizaje.</p><p>El curso está formado por 5 sesiones con las que aprenderás a invertir tu clase desde cero, paso a paso y te ofrece los materiales y herramientas online que necesitas para tener un éxito absoluto. En pocas sesiones notarás como algo va cambiando en tus clases, tus alumnos te pedirán más clases invertidas o flipped classroom. ¡El aburrimiento de las clases teóricas dictadas tienen fecha de caducidad!</p><p>Lo bueno es que esta metodología sirve tanto para matemáticas, tecnología, lenguas, inglés o cualquier otra materia que se pueda enseñar en un colegio, escuela o instituto. Pero ya existen profesores de universidad que lo usan en sus clases. Es el futuro, es la evolución de la educación y tu eres de los primeros en descubrirlo.</p><p>¿Cuándo empezamos?</p>", 
    "end_date": null, 
    "title": "La clase invertida con Flipped Classroom!", 
    "price": "25.00", 
    "instructors": "Profesor Carles Gòdia", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475140_a686_3.jpg", 
    "course_url": "https://www.udemy.com/la-clase-invertida-con-flipped-classroom/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T16:52:24Z"
}