{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>In this intensive, systematic course you will learn to confidently and safely practice Reflexology Healing massage for personal and professional use.</p><p>By the end of the Course you will have learnt and practiced:</p><ul> <li>Reflexology foot massage techniques</li> <li>You will understand Reflex point location in depth</li> <li>Have a deeper knowledge of Traditional Chinese Medicine (TCM) concepts</li> <li>Studied Acupuncture Meridian locations and Theory</li> <li>You will know various medical applications of each of the Reflex point areas</li> <li>During the course you will have gained an awareness of the connections of the Reflex areas and their associated organs and parts of the body</li> <li>At the end of the course you will be able to confidently perform a Reflexology foot massage treatment</li> <li>You will have a deeper understanding of TCM Meridian Theory and treatment principles of Traditional Chinese Medicine</li></ul> The structure of the course involves: <ul><li>Reflex Point locations</li><li>Theory lectures on TCM</li><li>Acupuncture Meridian Theory</li><li>Practical lessons on Reflexology massage techniques</li><li>Signs and symptoms of dysfunctions in the body by Reflexology palpitation</li></ul>You will gain a deep and practical understanding of the Reflex points and how they relate to meridians and organs in the body and, learn to remove blockages to restore vital energy to the body.It is recommended that you do a daily Qigong practice to develop you sensitivity and awareness to your own energy and others. (See my courses on Udemy, 'Learn Secret Chinese Exercises: Live stress free &amp; happy' and 'Learn Secret Chinese Exercises: Live energized &amp; happy now').", 
    "end_date": null, 
    "title": "Learn Advanced Reflexology and TCM for Health Practitioners ", 
    "price": "50.00", 
    "instructors": "Peter Caughey", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562260_94b5.jpg", 
    "course_url": "https://www.udemy.com/learn-advanced-reflexology-and-tcm-for-health-practitioners/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T03:51:21Z"
}