{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<strong style=\"\">The Most important skill of the 21st Century is the ability to learn!</strong>  </p>  <p>  \t  Regardless of your age or background, your ability to learn and adapt is critical in our rapidly changing world.  </p>  <p>  \t  While you may have spent a lot of time in school learning <strong style=\"\">&quot;WHAT&quot;</strong> to learn, you probably didn&#039;t spend a lot of time learning <strong style=\"\">&quot;HOW&quot;</strong> to learn.  </p>  <p>  \t  This course focuses on &quot;How to Learn&quot; is is designed to bridge the gap.  </p>  <p>  \t  This hands-on course is designed to equip you with practical, effective ways to improve your ability to learn just about anything.  </p>  <p>  \t  In addition to providing information on how to <strong style=\"\">supercharge your memory</strong>, we&#039;ll also discuss how your brain works and dispel some common misconceptions about learning that may be standing in your way.  </p>  <p>  \t  I&#039;ll even be covering some tips and tricks for <strong style=\"\">learning a new language</strong>.  </p>  <p>  \t  Finally I&#039;ll provide you with some <strong style=\"\">amazing learning resources and destinations</strong> that can unleash your new skills on and take your learning to the next level!  </p>  <p>  \t  This course is for anyone interested in enriching their studies, their career or their life by becoming a more effective learner.  </p>  <p>  \t  Let me show you how. Sign up and learn how to learn today!  </p>", 
    "end_date": null, 
    "title": "Learning to Learn", 
    "price": "20.00", 
    "instructors": "Richard Hart", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28380_f6ce_9.jpg", 
    "course_url": "https://www.udemy.com/learning-to-learn/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-01T17:50:23Z"
}