{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Ante los retos que enfrentan las instituciones educativas como consecuencia de la sociedad del conocimiento y de la globalización en la que están inmersas, se requiere replantear el liderazgo educativo, buscar líderes que consigan traducir el planteamiento estratégico en ejecución operacional, función que engloba el análisis de la situación, la toma de decisiones, la capacidad de persuasión y las competencias relativas a la gestión de personas. Nuestro curso “liderazgo educativo en el aula&quot;, esta basado en la ponencia de Gros et al (2013), presentada en el XXXII Seminario Interuniversitario de Teoría de la Educación sobre Liderazgo y Educación de la Universidad de Cantabria, Santander España, en la que alude la evolución que ha tenido el Liderazgo en distintas décadas, así en los 80 se distinguía por buscar líderes controladores con una visión racionalista y burocrática de las organizaciones, en tanto en los 90 centran la atención en líderes que tuvieran la capacidad de planificar y ejecutar estratégicamente, repensando conceptos, innovando en la organización y haciendo posible el crecimiento, en la actualidad aseveran las escuelas requiere una nueva visión del liderazgo, éste debe de ser de corresponsabilidad de los actores que intervienen: padres de familia, alumnos, directivos, profesorado y autoridades educativas. Mencionan también que el binomio liderazgo-educación se convierte en pertinente si nos lleva a la reflexión pedagógica de como asumirlo en los diferentes contextos educativos, así dividen el liderazgo educativo en tres dimensiones: pedagógico, distribuido y moral, las cuales están relacionadas y garantizan un liderazgo eficaz, reto de todo actor educativo.</p>", 
    "end_date": null, 
    "title": "Liderazgo educativo en el aula", 
    "price": "20.00", 
    "instructors": "UNID Universidad Interamericana para el Desarrollo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507184_0ef6_2.jpg", 
    "course_url": "https://www.udemy.com/liderazgo-educativo-en-el-aula/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T14:58:11Z"
}