{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t&quot;<em style=\"\">What a great resource! Especially helpful for shy or introverted young people</em>.&quot; Dr. Pauline Wallin, Clinical and Media Psychologist <a href=\"http://drwallin.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">http://drwallin.com</a>  </p>  <p>  \t What do you want to be when you grow up?  </p>  <p>  \t As a high school or college student you probably hear that question a lot.  </p>  <p>  \t It&rsquo;s an exciting time of life with many social activities and memories in the making as the clock is counting down to the day you begin your career.  </p>  <p>  \t But, whether you realize or it not, you&rsquo;re already making strides towards becoming the person you will be when you soon &ldquo;grow up.&rdquo;  </p>  <p>  \t To help you make the most of this time and give you opportunities to be successful, I developed this how-to course on personal branding and networking. You&rsquo;ll also learn about how to position your skills and how to make connections on LinkedIn.  </p>  <p>  \t Mixing videos with presentations, the course is conveniently delivered on-demand. You may progress at your own pace, which makes it easy to update and upgrade your accomplishments and network as you move though high school and into college.  </p>  <p>  \t <strong style=\"\">About Your Instructor</strong>  </p>  <p>  \t Barbara Rozgonyi is the mother of three creative young adults and is a nationally recognized expert on the topics of social media, marketing, PR and personal branding. She&rsquo;s developed programs for many organizations, including one of the largest community college in the U.S., the College of DuPage in Glen Ellyn, Illinois. The author of the LinkedIn chapter in &quot;Success Secrets of the Social Media Marketing Superstars,&quot; Barbara blogs at <a href=\"http://wiredprworks.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">http://wiredprworks.com</a>. In September 2013, she was honored to be selected as one of two U.S. reporters to cover Social Media Week Berlin for Nokia. An accomplished speaker and sales trainer, she enjoys teaching people and companies how to optimize their LinkedIn profiles.  </p>", 
    "end_date": null, 
    "title": "LinkedIn Career Success Starter for High School & College", 
    "price": "45.00", 
    "instructors": "Barbara Rozgonyi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/115328_b32f_7.jpg", 
    "course_url": "https://www.udemy.com/get-linked-into-college-success-and-beyond/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-05T02:40:00Z"
}