{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Are you tired of people clicking past your videos after just a few seconds?<br>Do your scrolling credits look like they were made by grade schooler?<br>Have you ever wished you could capture your audience’s attention in the very first millisecond that they view your films?<br>Do you want to save time &amp; money, instead of hiring some guy halfway around the world to create your titles for 5 bucks, only to have him take too long and then misspell your name in the titles?<br>THIS COURSE IS FOR YOU.<br><br>Hi, I’m Seth Estrada - and I’ve produced professional content for private schools, fully accredited universities, and the internal training department of a major Hollywood studio.<br><br>In this course, I’ll share my knowledge of Blender 3D software and give you to FREE templates to make it easy for beginners to hit the ground running and make professional, Hollywood quality text and titles in less than an hour- and you’ll be able to use these titles, royalty-free, and customize them for future use on other projects! </p><p>This is worth your time.<br><br>Who is this course for? Teachers, online video producers, independent filmmakers, or anyone who wants to make Hollywood quality titles and text, without shelling out major cash.<br><br>Best of all, I’m offering this short but powerful course <strong>ABSOLUTELY FREE, FOR LIFE, as a way to give back to the Udemy community… so what are you waiting for? </strong>Click over there where it says “Take This Course” and improve the curb appeal of your films and videos TODAY in less than an hour.</p>", 
    "end_date": null, 
    "title": "Make Awesome 3D Titles Using free Tools", 
    "price": 0, 
    "instructors": "Seth Estrada", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592374_364e_4.jpg", 
    "course_url": "https://www.udemy.com/make-awesome-3d-titles-using-free-tools/", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T00:02:42Z"
}