{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>How to Make Essential Monthly Income Teaching Online!</strong></p>\n\n<p><strong>SPECIAL REPORT: </strong><em>Landing</em><em> Your First Online University Adjunct Instructor Job ...</em></p>\n\n<p>Are you struggling to <strong>pay </strong>the bills? Are you <strong>working </strong>in a different job than what your graduate degree trained you for? Do you have a <strong>solid </strong>graduate degree gathering dust? Do you have a trustworthy <strong>mastermind </strong>team with another family member(s)?</p>\n\n<p>There are <strong>hundreds </strong>of online universities desperately seeking your services!</p>\n\n<p>I am <strong>Dr. Scott Brown</strong>.  I have three <strong>decades </strong>of experience as both an adjunct instructor and tenure track professor.  </p>\n\n<p>Check out my <strong>Udemy profile</strong>.  I very likely have more academic experience inside the higher education <strong>ivory tower</strong> system than anybody you know.</p>\n\n<p>In this course you will receive a <strong>planned process</strong> for getting and keeping jobs as an adjunct online university instructor. Expect to make about <strong>$2,000 per course</strong> you teach over an 8 to 10-week period.</p>\n\n<ul><li>“<em>After thousands of years of teachers and students sitting in the same room talking, something else is here …</em> “ <strong>-Nathan Faries</strong><em>, Adjunct English Professor</em></li></ul><p><strong>Enroll now!</strong></p>\n\n<p>Every month that <strong>passes </strong>is time wasted in your career development as an online university adjunct instructor.</p>\n\n<p>This course comes with a 30 day no questions asked <strong>guarantee </strong>fulfilled by Udemy as third party.</p>\n\n<p><strong>Enroll </strong>right now!<strong> -Dr. Scott Brown</strong></p>\n\n<p><strong>P.S.</strong> Isn’t that home <strong>mortgage </strong>coming due in a few days.  Here is a way to very possibly help <strong>pay </strong>it.</p>\n\n<p><strong>P.P.S.</strong> Enroll now <strong>risk free</strong>!</p>", 
    "end_date": null, 
    "title": "Make a Living Teaching Online — Get Your First Academic Job!", 
    "price": "20.00", 
    "instructors": "Dr. Scott Brown, Linda Gilbertie, Daniel Hall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706274_b087_2.jpg", 
    "course_url": "https://www.udemy.com/making-money-teaching-online-get-your-first-academic-job/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-25T10:29:32Z"
}