{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>In diesem Kurs lernen Sie moderne und anschauliche Lehrmethoden kennen, die Sie anschließend direkt einsetzen können, um Inhalte zu vermitteln und nachhaltig zu verankern. Der richtige Mix der merk-würdigen Lehrmethoden ist der Schlüssel zu maximaler Lernleistung.</p><p>Trainer-Ausbilderin Barbara Messer stellt Ihnen anschaulich und mit einem Augenzwinkern die fünf Elemente moderner Suggestopädie vor. Durch den Einsatz werden Ihre Inhalte garantiert im Gedächtnis bleiben. </p><p>Spiele und aktivierende Methoden erfüllen in Trainings, Seminaren und im Unterricht gleich mehrere Funktionen: Sie können als Metapher dienen und so Inhalte einführen, sie können zur Transfersicherung dienen, indem Inhalte verankert werden. Aber auch Erfahrungen transportieren, für Aufmerksamkeit und Konzentration sorgen oder die Situation auflockern. Trainerin und Moderatorin Amelie Funcke zeigt Ihnen in diesem Kursteil den gekonnten Einsatz verschiedener Arten von Seminarspielen. Sie gibt Ihnen konkrete Spieletipps an die Hand und liefert dazu Anleitungen, wie Sie die Teilnehmenden ganz leicht dazu bekommen, gerne zu spielen.</p><p>Storytelling wird als Lehrmethode immer beliebter. Mit guten Geschichten machen Sie Inhalte anschaulich, stellen Zusammenhänge her und bleiben durch die emotionale Ansprache im Gedächtnis Ihres Publikums. Unternehmensberaterin Sigrid Hauer zeigt Ihnen, wie Sie Ihr Publikum mit Geschichten für sich und für Ihre Inhalte gewinnen. </p>", 
    "end_date": null, 
    "title": "Moderne Lehrmethoden: Suggestopädie, Spiele und Storytelling", 
    "price": "30.00", 
    "instructors": "Academy Edition, Barbara Messer, Amelie Funcke, Sigrid Hauer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/813476_9587.jpg", 
    "course_url": "https://www.udemy.com/moderne-lehrmethoden-suggestopadie-spiele-storytelling/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-05T12:53:58Z"
}