{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t          What are MOOCs? I am sure a lot of you have heard the name but where did they come from? Why have they caught the public&#039;s imagination so much in the last few years? How do they fit into the online education sphere? What are some ways training providers could use MOOCs to help them meet their business goals in the Singapore Adult Education and Training Market?  </p>  <p style=\"\">  \t          Join us on this intro course where we will explore these questions and more. This course has a particular relevance for both trainers and providers in Singapore. We are going to take a look at some of the business cases for building a MOOCs along with online courses and answer that question as to why your organisation might want to consider doing this. We will try to answer that question &quot;How will my organisation get our money back?&quot;</p><p style=\"\"> In addition, we are going to look at some real world examples of organisations and training companies that have built and profited from building these types of courses and are who are finding that online education can be very successful and profitable. </p>  <p style=\"\">  \t          It will take about 120 mins to complete and comprises of a mixture of short videos, downloadable PDF notes.  </p><p style=\"\">There are no course requiremnemtns other that in interest in online education.</p>", 
    "end_date": null, 
    "title": "MOOCs, The Business Case", 
    "price": 0, 
    "instructors": "IAL (Institute for Adult Learning) Singapore    Sg", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296199_2a05_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-moocs/", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T08:27:12Z"
}