{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p> This course is the product of years of working both in the nonprofit<br>and for-profit sectors. Doing so has equipped me with a good insight<br>of their differences and similarities. A key difference in managing<br>finances in the private sector versus the nonprofit sector is the<br>altruistic mission of a nonprofit. Many believe that the private<br>sector is purposed solely to attain a financial reward or profit<br>while the nonprofit objective is simply to “do good”. Although<br>some may question the accuracy of this statement none can deny that<br>both the nonprofit and the for-profit sectors require financial<br>resources in order to function. In reality, a nonprofit, not unlike<br>a for-profit organization, need to have a financial grasp. In fact,<br>doing so is integral to the sustainability and the continuation of<br>the nonprofit to provide a much needed public service.</p>\n\n\n\n\n\n\n\n<p>This course seeks to equip nonprofit leaders, employees, volunteers,<br>funders, and anyone else with an interest in a nonprofit, with the<br>strategies and techniques that can minimize the obfuscation that can<br>arise in managing nonprofit finances. This course identifies best<br>practices in order for nonprofits to not only survive but strive in<br>an environment that has proven challenging for a great many<br>nonprofits—small to large.</p>\n\n\n\n\n\n\n\n\n\n<p>The primary focus is on providing strategies and tips on analyzing<br>the finances of a nonprofit. This course discusses budgets, cash,<br>costs, financial statements, establishing internal controls, various<br>financial ratios used to evaluate nonprofit finances, and real world<br>practices on how to use them. Whether as a new nonprofit or one that<br>has been around for decades this course concisely provide a high<br>level view of the complexities of finance in an easy to understand<br>layout.</p>\n\n\n\n\n\n\n\n\n\n<p>It is the hope and desire of the authors, staff, and board of Bolder<br>Business Consultants that this material proves beneficial for those<br>currently working at a nonprofit, funding a nonprofit, as well as for<br>those who aspire to fund or work at a nonprofit.</p>", 
    "end_date": null, 
    "title": "Nonprofit Financial Management", 
    "price": "50.00", 
    "instructors": "Bolder Business", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/800052_6704_2.jpg", 
    "course_url": "https://www.udemy.com/bolderbiz_nonprofit-finance/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T18:57:07Z"
}