{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Aprende a crear tu primer proyecto e-Learning como todo un profesional</strong>  </p>  <p style=\"\">  \t          Te aseguro que este curso te será de mucho provecho, además ahorrarás  muchísimo tiempo, pues yo ya he invertido cientos de horas en examinar  con detalle las herramientas y plataformas que te presento en este curso  y así poder obtener los mejores resultados.  </p>  <p style=\"\">  \t          Así que no puedes dejar pasar esta oportunidad de aprender de una  sola vez y en un sólo lugar, lo que yo ya he aprendido en más de una  década.  </p>  <p style=\"\">  \t         He seleccionado para ti las mejores y más accesibles herramientas para desarrollo e-Learning, de manera que puedas empezar hoy mismo a trabajar en tu proyecto con cero inversión inicial.  </p>  <p style=\"\">  \t<strong style=\"\">iSpring Free: de PowerPoint a Flash y HTML5<br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t        Te enseñaré como instalar y utilizar un software totalmente gratuito que te permitirá convertir tus PowerPoint a Flash y HTML5.  </p>  <p style=\"\">  \t<strong style=\"\">iSpring Free QuizMaker: Creación de Evaluaciones</strong>  </p>  <p style=\"\">  \t       Te enseñaré como crear atractivas y sencillas evaluaciones y como se registran los resultados en una playaforma e-Learning.  </p>  <p style=\"\">  \t<strong style=\"\">Publicación en Internet</strong>  </p>  <p style=\"\">  \t      Te ensañaré como publicar en Internet tus contenidos multimedia de manera sencilla y totalmente gratis.  </p>", 
    "end_date": null, 
    "title": "Novatos en e-Learning: Crea tu proyecto educativo on-line", 
    "price": "50.00", 
    "instructors": "Sr. Patricio Bustamante M.", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130198_0b2f_2.jpg", 
    "course_url": "https://www.udemy.com/novatos-en-e-learning/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-06T19:59:17Z"
}