{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Are you looking for a beginning art course for your child?</strong></p><p><strong>Are you seeking a course that will ensure artistic success and confidence?</strong></p><p><strong>Would you like an experienced teacher guiding your child through the creative process?</strong><em></em></p><p>The <em>Art </em><em>for Kids: Oil Pastel Painting </em>course may be just what you are looking for! Designed with beginners in mind, this course is perfect for children ages 8-12 years old. With a total of 7 fun and unique oil pastel art projects, your child will learn the skills to create masterpieces of their own long after the course is complete.</p><p>The teaching process used is a kid-tested, step-by-step method that will both inspire and delight your child into painting action! </p><p>Students will learn basic oil pastel techniques and apply these techniques to complete their projects. The<em> Art for Kids: Oil Pastel Painting </em>course is designed to give children the tools they need to begin their artistic journey into self-expression, reflection, and creative thinking.</p><p>Before each art lesson begins, your child will be presented with a slideshow that provides scientific facts and images about each subject. These facts and images will help your child make important connections between art and science.</p><p><strong>There are two steps in each art project:</strong></p><ul><li>Step 1: Background and Outline</li><li>Step 2: Apply Color to Painting </li></ul><p><strong>Supplies and materials needed for this course:</strong></p><ul><li>oil pastels</li><li>thick black paper (5 sheets)</li><li>brown paper grocery bags (2 large bags) or brown craft paper (2 large pieces)</li><li>pencil with eraser</li><li>scissors</li><li>bowl or plate to use as a template</li><li>paper towels</li><li>paper mat to protect work area</li></ul><p><strong>I would love to hear from you.</strong></p><p>Please let me know if you have questions, comments, or suggestions. I will get back to you ASAP.</p><p><strong>About the Instructor:</strong></p><p>My name is Miss Em and teaching art to children is what I love to do! I pride myself on creating dynamic, meaningful, and engaging art lessons that are taught in a relaxing and joyful way. I have nearly 20 years teaching experience in the elementary classroom and in the art studio, and I feel that I have a good grasp on how to create an environment that makes children feel happy, motivated, confident, and successful.</p><p>I look forward to seeing both you and your child in this<em> Oil Pastel Painting </em>course.</p><p><strong>Let the creative fun begin!</strong></p>", 
    "end_date": null, 
    "title": "Oil Pastel Painting: Art Projects and Techniques for Kids", 
    "price": "25.00", 
    "instructors": "Ms. Em Winn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641854_b3fe_3.jpg", 
    "course_url": "https://www.udemy.com/oil-pastel-paintings-art-projects-and-techniques-for-kids/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T22:21:54Z"
}