{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \tThere are <strong style=\"\">5 roadblocks</strong> most students face when it comes to effective learning and success in school.  </p>  <p>  \tI'll be cover all 5 of them in these in this video, but before I get to that I'd like to share a personal experience with you  </p>  <p>  \t ///////////////////////////////////////////////////////////////////////////////////////////  </p>  <p>  \tHi I'm <strong style=\"\">Richard Hart</strong>,  </p>  <p>  \tI was a university student just like you and in my first year of school, I almost flunked out before I discovered a  <strong style=\"\">major oversight</strong> in modern education.  </p>  <p>  \tYou see, I spent the majority of my schooling being told <strong style=\"\">WHAT </strong>to learn, but not much time at all was spent showing me <strong style=\"\">HOW </strong>to learn.  </p>  <p>  \tAs a result I spent countless hours every night trying to stay on top of my studies, but constantly feeling like I was falling farther and father behind. At one point I seriously questioned whether I was cut out for University and had what it takes to succeed. I was trying my best, but my best just didn't seem to be good enough.  </p>  <p>  \tOnce I realized what <strong style=\"\">the problem really was</strong>, I began to <strong style=\"\">find the solution</strong> and was able to significantly improve the way I learned and ultimately graduate with honours.  </p>  <p>  \tSo here are the 5 major roadblocks I faced as a student and how I overcame them.  </p>  <p>  \t<strong style=\"\">Roadblock 1</strong> - I didn't understand how my memory worked and how to use it effectively  </p>  <p>  \tOnce I had a better understanding of how my brain worked, I was able to to radically boost my ability to remember whatever I wanted, which had an instant almost impact on my grades.  </p>  <p>  \t<strong style=\"\">Roadblock 2</strong> - I failed to understand the powerful impact sleep had on my learning.  </p>  <p>  \tOnce I cut out the cramming and late night studying and began to get regular sleep and leverage the power of naps, my ability to learn exploded.  </p>  <p>  \t<strong style=\"\">Roadblock 3</strong> - I had no idea how my brain worked and how to study effectively.  </p>  <p>  \tI learned how to break down what I was trying to learn into bite sized chucks, leverage short study sessions and make use of spaced repetition.  </p>  <p>  \t<strong style=\"\">Roadblock 4</strong>- I felt like I was the worlds slowest reader!  </p>  <p>  \tThere is a lot to read in university and college and man did it take me a long time to do it before I found simple and practical ways to boost my reading speed.  </p>  <p>  \t<strong style=\"\">Roadblock 5</strong> - While I understood what procrastination was, I often found it difficult to overcome.  </p>  <p>  \tWhen you're feeling overwhelmed or distracted it can be easy procrastination can take hold. Once I understood the reasons behind procrastination, I was better able to take control over my studies and my life.  </p>  <p>  \tSince graduating I spent over a decade continuing to hone my ability to learn and teach and I'm still shocked that to this very day students are still not being taught How to learn effectively in school.  </p>  <p>  \tI created this course to close the gap, so that any student taking this course can benefit from my experience and begin to master the skills and techniques for effective learning.  </p>  <p>  \t ///////////////////////////////////////////////////////////////////////////////////////////  </p>  <p>  \tIn just over 1 hour, my unique, highly focused, hands on course I'll show you how to:  </p>  <p>  \t-Understand how your brain works and learn to use it more effectively  </p>  <p>  \t<strong style=\"\">-Radically boost your memory and recall.</strong>  </p>  <p>  \t<strong style=\"\">-Make sleep and breaks work to your advantage</strong>  </p>  <p>  \t<strong style=\"\">-Detect and deal with stress</strong>  </p>  <p>  \t<strong style=\"\">-Improve your learning by improving what you eat</strong>  </p>  <p>  \t-Free up more time by learning to read faster  </p>  <p>  \t<strong style=\"\">-Practical and effective ways to tackle procrastination head on</strong>  </p>  <p>  \tAs a former student and a successful college and online instructor, I believe any student can and will benefit from my new course.  </p>  <p>  \tBut if your still not sure, don't forget, Udemy has a <strong style=\"\">30 day money back guarantee</strong>. So take my course, watch every video, try every exercise and if you don't feel it's helped you improve your ability to learn, just ask for a refund within the first 30 days. It's that simple.  </p>  <p>  \tRemember, your education is <strong style=\"\">one of the biggest investments you will ever make</strong>, so make it count!  </p>  <p>  \tSign up and start learning how to kick @$$ in school today!  </p>", 
    "end_date": null, 
    "title": "Overcome The 5 Roadblocks To Learning In Schools", 
    "price": "20.00", 
    "instructors": "Richard Hart", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/52591_31a5_5.jpg", 
    "course_url": "https://www.udemy.com/learning-samurai/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-06T18:10:49Z"
}