{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong></strong></p>\n\n<p>This course is not sponsored by or affiliated with Udemy, Inc.</p>\n\n<p><strong>In just over an hour from now you'll know for sure if Udemy is the right platform for your online courses. So save yourself time on trawling through articles, courses and Facebook groups and find out everything you need to know in one place – fast!</strong><br></p>\n\n<p>It's no secret that creating online courses is booming right now. After all, who wouldn't want to package up what they know and sell it to make passive income online?</p>\n\n\n\n<p>But the problem is that all the different ways of selling courses online are booming too. In fact it could take you a lot longer to research all your options that it does to actually create your course.</p>\n\n\n\n<p>I know what it's like, I've been there. It took me months to trawl through courses, articles and Facebook groups on <strong>how</strong> to make a Udemy course just to find out <strong>if I should </strong>make a Udemy course!</p>\n\n\n\n<p>And when I finally did publish my course on Udemy, the coaches, trainers, therapists and other information product creators I know had loads of questions for me:</p>\n\n\n\n<ul><li>Why did you pick Udemy?</li><li>Do all those discounts mean you don't make much money? (The answer is 'no', by the way!)</li><li>Why would you put courses on a 3rd party platform and not your own site?</li><li>Are all those Udemy course coupons compulsory?</li><li>How much video do you need to make? And how long will it all take?</li><li>What equipment do you need to make videos? Do you need to get your face in front of a camera?</li><li>Can you export the email addresses of your clients into your email marketing service? If not, what do you do?</li><li>(And from the Europeans) What about EU VAT?</li></ul>\n\n\n\n<p><strong>So I've put what I've learned in this course, both from my research and my own personal experience. I've done all the digging and experimenting so you don't have to.</strong></p>\n\n\n\n<p>I'll share what I've learned from experienced and successful Udemy instructors, what I've discovered as I've worked through creating and promoting my own Udemy courses, plus where to find the best of the official information from Udemy. </p>\n\n\n\n<p>It's not just a list of recordings, either. I'm waiting inside to answer any questions you may have.</p>\n\n\n\n<p>There's a no-questions-asked 30 day money back guarantee, so you've got nothing to lose. (Except loads of time if you <em>don't</em> take this course!).</p>\n\n\n\n<p>So come join me and take the course!</p>\n\n\n\n<p>(Updated June 2016)</p>\n\n\n\n<p>#udemy #udemycourse #elearning #udemycoursecreation</p>", 
    "end_date": null, 
    "title": "Should you make a Udemy course? - Unofficial", 
    "price": "20.00", 
    "instructors": "Helen Lindop", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477024_2752_2.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-creation-should-you-make-a-udemy-course/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T12:32:16Z"
}