{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t       This course provides all teachers, lecturers and education assistants with a basic awareness of how the voice works, how to keep it healthy and how to use it to best effect in the teaching environment. Teachers have to use their voices day in and and day out and it is so easy for the professional voice to be taken for granted until there is a problem - this course helps prevent such problems.  Many teachers will regularly suffer voice disorders through mis-use or just, quite simply, over-use!  This course helps equip the teacher with the knowledge to keep their voice healthy, flexible and able to meet the demands of the profession.  </p>  <p>  \t       All technical terms (relevant to a basic understanding of voice) are fully explained and general educational terminology is kept to a minimum and would be familiar to all classroom practitioners.  </p>  <p>  \t       The course consists of video and audio lectures with visual illustrations and practical exercises.  </p>  <p>  \t       Over two and three quarter hours of detailed material provide relevant insight into how to make the most of the teaching voice. Obviously, allowing for factual consolidation and exercise practice the course will take longer to complete and it can be left to the student to schedule  and allocate  their own  time commitment.  </p>  <p>  \t       The course (video and audio lectures) is structured logically,  each giving examples and exercises that are easy to follow at home. It is possible to work through sequentially and then jump back to rework a section of the student&#039;s choice.  </p>  <p>  \t       Teachers and lecturers can be considered to be professional voice users yet few have formal voice training.  This course can fill that essential gap and help provide the basic understanding of the vocal mechanism, how to take care of it and use it well in a variety of educational situations.  </p>", 
    "end_date": null, 
    "title": "Speak with Impact and Variety: Voice skills for Educators", 
    "price": "20.00", 
    "instructors": "Marina Deestan-Jones", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258818_5832_9.jpg", 
    "course_url": "https://www.udemy.com/professional-voice-care-and-awareness-for-educators/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T07:11:32Z"
}