{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<h4>FROM THE DESK OF MS. KELLY KNOCHE</h4>  <p>  \t<strong>To: New and stressed current teachers</strong>  </p>  <p>  \t   Dear fellow teachers,  </p>  <p>  \t         I know what is feels like to put the needs of my students ahead of mine - to do everything I can to make their lives better.  </p>  <p>  \t         Teachers are constantly told to put the students first. Its the reason we all went into the profession right?  I did that and, in the process, forgot about myself. I realized that something was missing and I didn’t feel complete.  </p>  <p>  \t         Most advice to avoid burnout goes something like this: “Take care of yourself, eat well, exercise, and get plenty of sleep.”  </p>  <p>  \t         That advice is usually peppered with: “Make time to cook your lunches, meet with parents and coworkers until 6pm, and prepare at night for your upcoming day.”  </p>  <p>  \t         This balance of time didn’t make sense to me. The actual time it takes be my best teacher-self didn’t align with the expectations of being a teacher and living a balanced, healthy life.  </p>  <p>  \t         I had dreamed of someone sharing tools with me that I could use in the 10 minutes of free time I had in between classes that allowed me to reset and recenter.  </p>  <p>  \t         Teacher Equilibrium is the course I wish I had when I first started.  </p>  <p>  \t<em>According to studies, most teachers experience job stress at least two to four times a day, with more than 75% of teachers’ health problems attributed to stress.</em>  </p>  <p>  \t         Teacher burnout is almost epidemic in the US and is one of the causes of the 17% annual attrition rate amongst educators.  </p>  <p>  \t         In this course we identify the three primary factors of teacher burnout and give you the tools and techniques you need in order to best manage and overcome them.  </p>  <p>  \t         Discover your balanced self and find your Teacher Equilibrium.  </p>  <p>  \t         Each section of this course is broken down into three (3) segments:  </p>  <ol>  \t<li><strong>Individual</strong>: perform on your own in the privacy of your classroom or home </li>  \t<li><strong>Interactive</strong>: help you with interactions with students and coworkers </li>  \t<li><strong>Integrated</strong>: bring your students into the work that you&#039;re doing</li>  </ol>  <p>  \t         In addition to these segments we provide a reflection tool which gives you the necessary framework to reflect upon your workday to continuously grow and improve.  </p>  <p>  \t         These strategies have been created and tested by two educators with 10 years combined teaching experience. Both Kelly and Lance have used these strategies in their classrooms with students successfully, as you’ll see in the course.  </p>  <p>  \t         You will see firsthand in a live 4th grade classroom how these strategies can be employed and how powerful they can be once implemented.  </p>  <p>  \t         Teacher Equilibrium includes 51 lectures. Each video is less than three (3) minutes. The videos are easy to watch and are accessible on any computer or smartphone that allows you to go at your own pace. You can start employing the strategies you&#039;ll learn here right away.  </p>  <p>  \t         This course is designed for an educator’s schedule to fit neatly into your busy days.  </p>  <p>  \t         Also included are lesson plans that you can print out and have with you at all times.  </p>  <p>  \t         Upon completion of this course and the implementation of these strategies, you will be able to:  </p>  <ul>  \t<li>Effectively communicate with students to end needless arguments and keep your classroom on track </li>  \t<li>Understand how students are feeling, so you can be more empathetic</li>  \t<li>Craft your own personal creed which will guide you through your toughest times </li>  \t<li>Create strategies that will help students keep themselves accountable and take the burden off of you</li>  </ul>  <p>  \t<em><br>  \t</em>  </p>  <p>  \t         I hope to see you in the discussion boards soon!  </p>  <p>  \t         Best,  </p>  <p>  \t         Ms. Knoche  </p>  <p>  \t<em><br>  \t</em>  </p>  <p>  \t<em><strong>The greatest use of a life is to spend it for something that will outlast it.</strong></em>  </p>  <p>  \t<em>- William James</em>  </p>", 
    "end_date": null, 
    "title": "Teacher Equilibrium: Be Happy and Avoid Burnout (K-12)", 
    "price": "50.00", 
    "instructors": "Kelly Knoche, Lance Hunter Burbank", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234364_6b10_2.jpg", 
    "course_url": "https://www.udemy.com/teacher-equilibrium-preventing-burnout/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-31T00:01:53Z"
}