{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Homeschool parents are often overwhelmed at the thought of being responsible for academically preparing their children for adulthood (especially if their children are wanting to attend college).  One area of particular concern is upper-level math.  While teaching the basics in elementary school may come easily, the thought of teaching algebra and beyond is enough to cause some homeschool parents to at least consider giving up homeschooling altogether.</p><p>I want to be part of the solution to this problem.</p><p>As a college math instructor for 14 years, I've seen the attitudes and levels of preparedness with which students enter the classroom.  I have experienced first-hand the negative effects of teachers who lacked both the confidence and the motivation for teaching math effectively.  Those bad attitudes were contagious, and they spread quickly and widely.</p><p>I believe that a better understanding of the way students learn is critical for teachers at any level who want to teach in a way that their students will understand.  I do not have a degree in education, so this course does not use a lot of educational jargon.  It is based on my own experiences in the classroom as well as in teaching my own children at home.</p><p>The course is short and to-the-point.  It is not intended as a full coverage of the field of math education.  My goal is to give teachers (and homeschool moms, in particular) information that can be easily applied and have a clear and positive impact on the way they approach teaching math.</p><p>Like all Udemy courses, this one comes with a 100% satisfaction guarantee.  If you enroll in the course and don't find it to be at all useful, Udemy will refund your money without hesitation.  You have nothing to lose but confidence to gain.</p>", 
    "end_date": null, 
    "title": "Teach Math Without Tears - Yours or Theirs", 
    "price": "20.00", 
    "instructors": "Laura Baggett", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520344_89ed_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-teach-math-effectively/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T14:25:44Z"
}