{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t  What is the course about?  </p>  <ul>  \t<li>Have you ever considered becoming an University Professor? in a live classroom?</li>  \t<li>Do you have skills and experience that, if shared, can make a difference in someone&#039;s life? </li>  \t<li>This course teaches someone how to become an Adjunct University Professor in a live classroom even if they have never taught before. </li>  \t<li>The course can also benefit existing Adjunct University Professors who want to enhance their teaching skills &amp; performance.  </li>  </ul>  <p>  \t      Background:  </p>  <p>  \t    Adjunct &quot;part time&quot; university instructors are being hired by universities more than ever before.  Adjunct Professors number approximately 1 - 1.5 million in the US alone.  Up to 50 - 85% of university faculty staff are adjuncts - especially in community colleges.  Even elite private universities like Georgetown University have more than 50% of their faculty staff as adjuncts.  </p>  <p>  \t    What kind of materials are included?  </p>  <ul>  \t<li>The course consists of 38 video lectures which include the following:  \t<ul>  \t\t<li>Student testimonials of actual students</li>  \t\t<li>Funny Movie clips used to emphasize key points</li>  \t\t<li>Live in-class instruction video clips of Professor Lacouture in action!</li>  \t\t<li>There are +5 hours of content to complete.</li>  \t</ul>  \t</li>  </ul>  <p>  \t    Why take this course?  </p>  <ul>  \t<li>Take this course if you ever dreamed of becoming an university professor in a live classroom....this course will teach you how!</li>  \t<li>Take this course if you are already an Adjunct University Professor and want to improve your teaching skills and performance </li>  </ul>", 
    "end_date": null, 
    "title": "Teacher Training: Become an Adjunct University Professor ", 
    "price": "40.00", 
    "instructors": "Luis E. Lacouture", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130608_a45a_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-become-an-adjunct-university-professor/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-07T20:21:03Z"
}