{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">The ability to find, shoot and tell a visual story with just a smartphone is a skill that can be learned, and taught to students.</strong></p><p><strong class=\"redactor-inline-converted\">Modern teachers and students carry powerful mobile </strong><strong class=\"redactor-inline-converted\">video devices into classrooms every day. </strong>Learn and teach students how to make amazing video stories with your smartphone.</p>\n\n<ul><li>Get the apps and gear that make great video</li><li>Master shot sizes and film patterns</li><li>Capture smooth, high quality video</li><li>Transform photos and a script into a video clip</li><li>Make a newsmaker video from soundbites and sequences</li><li>Learn how to conduct a video interview</li><li>Record amazing voice over narration</li><li>Edit video stories on your smartphone</li><li>Fix common problems with audio and pictures</li><li>Master the fundamentals of telling a video story</li></ul>\n\n<p><strong>Everyone has a story to tell.</strong></p>\n\n<p>This self-directed, certificate course can be completed in less than two hours. </p>\n\n<p>This course was designed for the Ashoka Network of Changemaker Schools, which gathers 200+ schools around the world that are transforming the experience of education and enabling all students to become changemakers: young people with the skills and confidence to change the world for the good of all.<br></p><p>The course features video lessons that teach video storytelling methods in less than two hours.</p>\n\n<p>WHAT TYPE OF SMARTPHONE AND APPS WILL I NEED?</p>\n\n<p>Access to an iPhone 5 or newer, or iPad/iPad mini is needed for best results. Apps for Android will be included in the course and the filming exercises will be able to be completed using either an Apple or Android device.</p>\n\n<p>A list of apps will be shown in the course. Most are free, but some may incur a small one-time cost.</p>\n\n<p>Research shows that visual content is the key to increasing comprehension and visual storytelling methods are more effective and memorable.</p>\n\n<p>Study after study shows that you can magnify your messaging by mastering visual storytelling techniques.  </p>\n\n<ol>  \t<li>Content with relevant images gets 94 percent more views than content without.</li>  \t<li>Tweets with images receive 150 percent more retweets and twice the engagement.</li>  \t<li>Images are more important than hashtags and usernames in social media content campaigns.</li>  \t<li>50 percent of all Internet users have reposted a photo or video they have found online.</li>  \t<li>Photo and video posts on Pinterest refer more traffic than Twitter, StumbleUpon, LinkedIn and Google+ combined.</li>  \t<li>Studies show our brains not only process visuals faster, but they retain and transmit much more information when it's delivered visually.</li>  \t<li>The brain processes visuals 60,000 times faster than it does text</li>  \t<li>Sixty-three percent of social media is made up of images.</li>  </ol>", 
    "end_date": null, 
    "title": "Tell your Ashoka Changemaker Story with Smartphone Video", 
    "price": "25.00", 
    "instructors": "Robb Montgomery", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409846_f772_2.jpg", 
    "course_url": "https://www.udemy.com/make-video-stories-with-your-smartphone-classroom-teachers/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T11:16:58Z"
}