{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>A Day in the Life of a Principal is a self paced course that will give you a first person experience into what a principal has to do, daily. This course is for anyone who is considering going into administration or anyone who is already in a program for administration. Below are some things to consider before taking this course.</p><ul><li>This course is not lengthy, however there are several writing assignments that will take some time.Total course time should not be more than 2-3 hours.</li><li>This course is broken down by hours in the day and was a true day in the life of your course instructor, who is an elementary principal in a typical suburban neighborhood.</li><li>When working on assignments, you must take some liberties when reacting to situations. Any issue in a principals day can be answered with \" I will get back to you on that.\" For this course, the expectation is that you will dive deeper into finding answers and make decisions. It is OK to make assumptions about the situation, just remember to explain them in your answer.</li><li>When moving through the course you will have an explanation of what is going on during that time. This usually includes something that has to be done or included on a list. You will run into emails, voicemail, telephone calls, observations,teacher conflict just to name a few.</li></ul><p>Good Luck and enjoy your Day in the Life of a Principal!</p><p><br></p>", 
    "end_date": null, 
    "title": "The Day in the Life of a Principal", 
    "price": "25.00", 
    "instructors": "Dr. Rob Furman", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/827234_fced_3.jpg", 
    "course_url": "https://www.udemy.com/principal/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-20T16:46:17Z"
}