{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p class=\"MsoNormal\" style=\"\">  \t This course was developed to help all teachers improve upon their craft.  It is designed to be useful to all stages of teaching whether you are in the beginning or a veteran.<br style=\"\">  \t<br style=\"\">  \t  We have examined what has and hasn’t worked in our 15+ years of teaching and 10 years of homeschooling.  We compiled our experience and resources to create a course that teaches you all the things that good teachers do, and how they do them.  <br style=\"\">  \t<br style=\"\">  \t  In the course, we look at everything from examining your motives and objectives in teaching, classroom management skills, creation of tests &amp; evaluative questioning techniques, record keeping, to lesson planning.<br style=\"\">  \t<br style=\"\">  \t  We show you how to understand your learners via their learning styles.  We start by discovering which styles they have and then teach you how to develop strategies that best work with an individual’s strengths and weakness.  Then we work on how to transform a learner&#039;s weakness into a strength.  </p>  <p style=\"\">  \t We look into activating students’ brains for optimal learning.  We do this by learning about the regions of the brain that different learning styles reside in.  We teach you how to reach a developing mind creating long term memory recall.<br style=\"\">  \t<br style=\"\">  \t  All of this is designed to help you, the parent teacher, to create a zest for exuberant lifelong learning in your children.<br style=\"\">  \t<br style=\"\">  \t<!--[if !supportLineBreakNewLine]-->  \t<br style=\"\">  \t<!--[endif]-->  </p>", 
    "end_date": null, 
    "title": "Those Who Can, Teach Their Children", 
    "price": "20.00", 
    "instructors": "Nathan & Nicole Bills", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/196834_5486_3.jpg", 
    "course_url": "https://www.udemy.com/those-who-can-teach-their-children/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-10T11:50:24Z"
}