{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Why should you take this course?</strong>  </p>  <p style=\"\">  \tThe results of hundreds of trainer surveys and key adult learning research went into the design of this program.  We combined our own experience with specific strategies shared by the trainers in our surveys to develop a program that can produce real and meaningful change in your energy level.  Training and teaching doesn’t have to leave you feeling burned out.  We can show you how to get your energy back and actually enjoy yourself when you teach.  </p>  <p style=\"\">  \t      This 2 hour program focuses on activities and habits that allow you to boost your energy and reduce your stress in the classroom.  It helps you identify and harness your natural strengths to get more done with less effort.  It also provides techniques for controlling apathetic and negative learners.  If you want to feel more energy and enthusiasm in your classroom, then you won’t want to miss this program.  You&#039;ll also get a 35 page workbook and a slideshow notes handout to follow along with every technique you learn.  </p>  <p style=\"\">  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p style=\"\">  \t&quot;Your passion for helping trainers is so contagious.  When I work with you, not only do I want to be a better trainer, I want to be able to help others the way that you helped me.&quot;  </p>  <p style=\"\">  \t- <strong style=\"\">Sarah Gernetzke</strong> -<em style=\"\"> Corporate Software Trainer</em>  </p>  <p style=\"\">  \t&quot;Jason’s methods set the standard by which other trainers measure themselves.  When I experience a problem in class or another trainer asks me for advice, the first thing that goes through my mind is, what would Jason do in this situation?&quot;  </p>  <p style=\"\">  \t- <strong style=\"\">Bren Mochocki -</strong> <em style=\"\">Software Trainer &amp; Corporate Trainer Coach</em>  </p>", 
    "end_date": null, 
    "title": "Train the Trainer Calm: Remove Classroom Fear and Stress", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266516_6e0e_13.jpg", 
    "course_url": "https://www.udemy.com/healthy-trainer-ensure-you-lead-a-well-balanced-life/", 
    "currency": "USD", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T14:45:14Z"
}