{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Ovo je <strong>osnovni kurs o karijernom  vođenju</strong>, namenjen pre svega početnicima u ovoj oblasti i onima koji još uvek nemaju puno iskustva u sprovođenju aktivnosti karijernog vođenja, ali ga mogu koristiti i svi drugi nastavnici, posebno jer  predstavlja veliki broj aktivnosti koje Vam mogu biti vodilja i inspiracija u osmišljavanju sopstvenih aktivnosti karijernog vođenja.</p>\n\n<p>Na kursu ćete imati prilike da se upoznate sa osnovnim pojmovima u vezi sa karijernim vođenjem i savetovanjem, veštinama za upravljanje karijerom, savremenim shvatanjem karijere, ali i  sa zakonskim obavezama koje srednje škole imaju u vezi sa sprovođenjem aktivnosti KViS.</p>\n\n\n\n<p>Takođe, kroz poglavlja o samoproceni , karijernom informisanju, upoznavanju zanimanja, o predstavljanju poslodavcima, planiranju i donošenju odluka, individualnom radu sa učenicima i organizaciji školskog tima su, pored teorijskih osnova, predstavljene konkretne aktivnosti koje možete da sprovedete na osnovu priloženih upustava, ali i da osmislite sopstvene aktivnosti KViS, koristeći kao vodilju pripreme i savete vaših kolega koji su učestvovali u stvaranju ovog kursa. </p>\n\n\n\n<p>Na kraju ćete saznati i koje resurse možete koristiti kao materijal u sprovođenju aktivnosti KViS sa učenicima, kako da ostvarite saradnju sa lokalnim partnerima, kao i kako da se dodatno usavršite u ovoj oblasti.</p>\n\n\n\n<p>Dakle, ako ste nastavnik ili sturčni saradnik u srednjoj školi i želite da više saznate o karijernom vođenju i savetovanju, kako da sprovodite ove aktivnosti u radu sa učenicima i kakve koristi od takvih aktivnosti će Vaši učenici imati, ovo je kurs za Vas. Naravno, kurs je besplatan, a možtete mu pristupiti u bilo kom trenutku sa bilo kog mesta i sami odlučiti kojim tempom ćete prelaziti date sadržaje. <br></p>", 
    "end_date": null, 
    "title": "Uvod u karijerno vođenje u srednjoj školi", 
    "price": 0, 
    "instructors": "Marko Bankovic, Sofija Petrovic, Jadranka Lilic, Miljana Kitanovic, Mirko Markovic, Biljana Djordjevic, Maja Svetozarevic", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482290_87ed_3.jpg", 
    "course_url": "https://www.udemy.com/karijerno-vodjenje/", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T16:47:17Z"
}