{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t   In High School, you learn how to write standard 5 paragraph essays. This is great when you go through standardized tests like SAT&#039;s and state exams. Unfortunately, many students arrive in college and are thrown into a much more complex essay-writing world. This course is designed to give you several approaches to defeat the college essay. I will not be focusing on grammar, and I&#039;m not going to bore you to death with fancy terms and rhetoric. That is the job of your college professor. I will, though, give you the tips and ideas you need to succeed!  </p>  <p style=\"\">  \t The course is broken down into several sections, similar to how you would go about the process of writing an actual paper. Sections include research, writing, and citing. Finally. many good tips that come from experience and suggestions from university professors. All video lectures have an accompanying text-based lecture for easier access on a slower connection or just for your review! Quizzes are given to help you gauge your progress. And finally, there is a discussion segment called Wednesday Weekly Writing Wisdom where we dive into one particular topic each Wednesday to help you build your writing skill.  </p>  <p style=\"\">  \t An important note is that this course is a supplement to good instruction in your college class. It is not a replacement for class in the event that you decide to not attend or give attention, but it will help you improve your work.  </p>  <p style=\"\">  \t As always, if you have questions beyond what the course covers, you are welcome to start a discussion within the course or send me a message. I am also willing to review essays (as long as they aren&#039;t excessively long)  </p>  <p style=\"\">  \t I hope you are interested in this course and are willing to take the step to improve your college level essays! Happy writing!  </p>", 
    "end_date": null, 
    "title": "Write an Effective College-Level Essay", 
    "price": 0, 
    "instructors": "Cain Towers", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160652_7916_2.jpg", 
    "course_url": "https://www.udemy.com/effectivecollegeessay/", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-09T19:27:35Z"
}