{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>В этом курсе я изложу вам свой взгляд на то, как развивается сознание ребенка в современном мире и как социальная среда влияет на это развитие. В своем рассказе я не буду следовать существующим учебникам по психическому развитию ребенка. Моя цель состоит в том, чтобы осветить и проиллюстрировать проблемы, которые с моей точки зрения являются ключевыми для понимания этого развития.</p>  <p>Я начну этот курс с обсуждения того, как теория Российского психолога Льва Выготского может помочь нам понять отличие между необычными когнитивными способностями младенцев и аналогичными способностями у старших детей и взрослых.</p>  <p>Я продолжу обсуждением некоторых моделей того, как работает наша способность обучаться и развивать наше мышление.</p>  <p>Я проиллюстрирую эти модели своими экспериментами по восприятию мышлению и произвольному поведению детей.</p>  <p>Я закончу курс описанием и обсуждением длительных психолого-педагогических экспериментов, проведенных в детских садах Москвы, целью которых было способствовать развитию у детей независимости и креативности в их суждениях и поведении за счет увеличения способности детей сопротивляться сбивающим сигналам идущим от социального окружения.</p>  <p>Курс состоит из четырех секций, восьми лекций с ссылками на релевантные публикации, и теста. Лекции включают авторский текст, авторские видео, видео с детьми, выполняющими задачу на произвольное поведение, графики и рисунки с анимацией.</p>  <p>Я построил этот курс для студентов гуманитарных вузов, специалистов в области обучения и воспитания детей, медицины, психологии, детских писателей и художников и всех тех, кого интересуют те аспекты когнитивного развития детей, которые не освещены в обычных учебниках.</p>", 
    "end_date": null, 
    "title": "Когнитивное Развитие в Социальном Контексте: Эксперименты и ", 
    "price": 0, 
    "instructors": "Eugene Subbotsky", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642260_479e_3.jpg", 
    "course_url": "https://www.udemy.com/wuxkpzjt/", 
    "subject_name": [
        "Educational Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T09:29:15Z"
}