{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>♛♛♛ Updated 08.04.2016 ♛♛♛ - Updated with new option buy ad's</p>\n\n<p><strong>Hey, App developers! </strong></p>\n\n<p>Do you want to make money with apps but is struggling and making only small number of downloads and very low ECPM? I can help you increase your downloads and ECPM. At the same time, I can help you with Chartboost revenue and that's for sure!!! So, are you ready to start making money? No.. no.. I'm not talking about small money, I'm talking about REAL money, Life-style Changing Money.</p>\n\n<p>I've been a newbie in this business, just like you. I took courses and learned by experience. This course summarizes my knowledge about Chartboost and more relevant information. I'm going to share with you about app business in general.</p>\n\n<p>Learn step by step how we make amazing ECPM's with our own apps, no bullshit!</p>\n\n<ul><li>REAL accounts</li><li>REAL time</li><li>REAL money</li></ul>\n\n<p>- I will provide you with methods of monetization of the campaigns for advertisers and publishers.</p>\n\n<p>- You will have access with our tools, increase your Chartboost CTR and ECPM and lastly, your revenue</p>\n\n<p>- You will learn the correct and most efficient way to talk to your developers, no time wasting and most importantly, you will know how to add your ads in the app</p>\n\n<p>- You will learn advanced tactics about campaign filtering, advertising and publishing</p>\n\n<p>- You will learn how to use CPC or CPI campaigns and even when not using Chartboost at all</p>\n\n<p>I personally created this course. A real guy that really makes a living doing this stuff... This is the course I have created for my clients, for the Indie developers and even for the big app companies who want to simply ways to make more money.</p>\n\n<p>I'm sure you're thinking to yourself, “Hey this guy is a scammer, and only wants to take my money\". Let me tell you one thing: YOU DON'T HAVE ANY RISK!</p>\n\n<p>If your business does not improve drastically within 30 days upon walking through the steps of this course… Like I said, ALL MONEY BACK GUARANTEED, no questions asked.</p>\n\n<p>I offer a 30 day Money Back Guarantee in this course !!!</p>\n\n<p>Tolik</p>\n\n<p>AskTolik ASO and Marketing Services</p>", 
    "end_date": null, 
    "title": "(NEW) Chartboost Course 2015  - Become a Top EPCM Publisher", 
    "price": "30.00", 
    "instructors": "Anatoli (Tolik) Eidelman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618548_0054_5.jpg", 
    "course_url": "https://www.udemy.com/chartboost-revenue-100-epcm-become-a-top-publisher-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T22:03:26Z"
}