{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Boost your campaign's performance with <strong>25% on average, to peaks far above 300%</strong>!</p><p>With <strong>inside information</strong> from an <strong>official Facebook Marketing Partner</strong>, you'll learn everything about how to optimise your Facebook &amp; Instagram campaigns, your ad sets, budget, ad creatives and bidding. Everything is detailed in step by step instructions and live demos.</p><p>I'll personally guarantee you that you will earn back the fee of this course <strong>OR YOU WILL GET YOUR MONEY BACK!</strong></p><p><strong>Why should you take this course?</strong></p><ul><li>If your campaigns didn't reach their desired result</li><li>If you have campaigns which are mysteriously not \"running\"</li><li>If you feel your current costs per conversion are too high </li><li>If you want to get more results from your campaigns with the same budget</li><li>If you want to advice clients, friends and family on optimising their Facebook &amp; Instagram campaigns.</li><li>If you want to go hands on with a Facebook Marketing Partner!</li></ul><p><strong><br></strong></p><p><strong>How is this course structured?</strong></p><ul><li>This course is designed in such a way that even if you have never optimised a Facebook or Instagram campaign, that you'll still be able to become an expert in less than an hour.</li><li>We'll start with talking about ad set budgets and how to optimise them</li><li>I'll explain you how to set up a solid testing structure</li><li>You'll learn how to set up and adjust your optimisation in ads manager &amp; power editor</li><li>You'll learn why you need multiple ad creatives to prevent your campaign from loosing money</li><li>You'll learn all about optimising your bidding strategy and we go hands on in ads manager</li></ul>", 
    "end_date": null, 
    "title": "(NEW) How to optimise your Facebook & Instagram Ad Campaigns", 
    "price": "50.00", 
    "instructors": "Achmed Awad", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761448_7c18_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-optimise-your-facebook-instagram-ad-campaigns/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T13:22:01Z"
}