{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course, you’ll learn how to write copy that grabs attention and motivates prospects to buy. </p>\n\n<p>I designed this course for anyone who wants a shortcut to learning how to write great copy. By the end of this course, you’ll be able to write copy that gets noticed, gets read and gets results.\n\n  </p>\n\n\n\n\n\n\n\n<p>You and I will examine the most successful advertising campaign in history. I’m talking about the newspaper ads for Volkswagen that ran during the 1960s and 1970s. This campaign took a boring, ugly, unknown product and made it one of the most talked-about, popular products in history. I’m going to show you dozens of ads from this campaign. Each one is a case study in how to write clever, powerful, funny, amazing copy. \n\n  </p>\n\n\n\n<p>You'll see how a successful ad is built. We'll cover headlines, visuals, opening lines, body copy, format of a sales pitch, testimonials, features and benefits, reader engagement, humour, irony, keys to being original, endings, and plenty more.<br></p>\n\n\n\n\n\n\n\n\n\n<p>I designed this course for two people: copywriters who want to improve their craft, and aspiring copywriters who want to learn what <u>actually works</u> in copywriting.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>This course contains no theory—just dozens of examples of copy that works, and a detailed explanation of why it works. To get a good idea of what we’ll cover, preview some of the lessons below. Then take this course. Forty years from now, people might be talking about your copy. Hey, you never know.</p>", 
    "end_date": null, 
    "title": "30 Copywriting Secrets from the Best Ad Campaign of All Time", 
    "price": "20.00", 
    "instructors": "Alan Sharpe", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848226_d18c_4.jpg", 
    "course_url": "https://www.udemy.com/30-copywriting-secrets-from-the-best-ad-campaign-of-all-time/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T16:56:16Z"
}