{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">04/02/2015</strong></em>  </p>  <p>  \t<strong style=\"\"><span style=\"\">Update new video of new dashboard - take a look</span></strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">Updated new video how we touch 100 ECPM!!! + Big Package Bonus for Casino Reskiners!!!</strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">Our FREE code Promotion finished!!! , We get many email who still want buy the course also we get many emails from people who start make 80% more revnue , if you still wan&#039;t the course you can ping us to appninjaz@gmail.com and we send you some dicount coupon we promote now , not hasitate ask discount !!!</strong></em>  </p>  <p>  \t                  Hey app developers, do you want to make money???  No.. no..  I’m not talking about small money, I’m talking about REAL money. <strong style=\"\">Life-style Changing Money</strong>.  </p>  <p>  \t                I’ve been new to this business, just like you. I took courses, I learned by experience. <strong style=\"\">This course summarizes my entire successful online career.</strong>  </p>  <p>  \t                  I’m sure you’re thinking to yourself, <em style=\"\">“Hey this guy is a scammer, and only wants to take my money</em>”. Let me tell you 1 thing: <strong style=\"\">You DON’T Have Any RISK!  </strong>  </p>  <p>  \t                  I provide in this course, a <strong style=\"\">30 days Money Back Guarantee!!  </strong>  </p>  <p>  \t                  If your business does not improve drastically, within these 30 days, and you’ve walked through the steps of this course… Like I said, all money back, no questions asked.  </p>  <p>  \t                  Learn step by step no bullshit , how we make 70-80 ECPM in Casino apps  </p>  <ul style=\"\">  \t<li style=\"\">real accounts</li>  \t<li style=\"\">real time</li>  \t<li style=\"\">real money</li>  </ul>  <p>  \t                  Some Clients Reviews  </p>  <p>  \t<em style=\"\">  &quot;Finally a well-organized guide, clear and step by step that I will study for a while.     </em><em style=\"\">This course will take you on a short journey teaching you step by step how to reach guaranteed success&quot; Jonny Cole 5 Stars</em>  </p>  <p>  \t<em style=\"\">&quot;Thanks for your work :)&quot;</em> Rab F 5 Stars  </p>  <p>  \t<em style=\"\">  &quot;Thanks Tolik. Lots of good insights and going straight to the point. Looking forward to future tips :) &quot;</em> - Alicia Choo 5 Stars  </p>  <p>  \t                  Watch this course now and start making money from your apps today!!!  </p>  <p>  \t                Course Features :  </p>  <p>  \t                  - provide you with basic skills to open apps and create campaigns.  </p>  <p>  \t                  - provide you with methods of monetization for campaigns.  </p>  <p>  \t                  - you will get our tools to get make magic in chartboost ECPM for pennies.  </p>  <p>  \t                  - you&#039;ll learn the correct and most efficient way to talk to your developers, no time wasting.  </p>  <p>  \t                  Total course duration is 90 min, it might seem short but it includes lots of content with huge value for you.  </p>  <p>  \t                  You must take this course if you want to learn how to increase your revenues from ad&#039;s companies in ChartBoost  </p>  <p>  \t                  This course was created by myself, a real guy that really makes a living doing this stuff... this is the course I have created for my clients, for the Indie developers and even for the big app companies who want to simply make more money  </p>  <p>  \t                  if the price is too high for you check with us about coupons and ping to email appninjaz@gmail.com , if we have promotion coupons we try to help U  </p>  <p>  \t                  Thanks, see you out there!  </p>  <p>  \t                  Tolik  </p>  <p>  \t                  App Ninjaz Inc for you.  </p>", 
    "end_date": null, 
    "title": "70 ECPM Not Magic it's knowledge - Chartboost Revnue Course", 
    "price": "50.00", 
    "instructors": "Yaniv Golan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305076_6a3a_4.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-tutorial-on-how-to-make-money-with-chartboost/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-22T00:46:12Z"
}