{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Making Money Online With Solo Ads. </strong></p><p>This training is meant for newbies\nin internet marketing. If want to learn how start making money online, this\ncourse is for you.</p><p><strong>Learning Outcome:</strong></p><ol><li>Prepare Your Webpage To Attract Visitors</li><li>Prepare An Irresistible Free Gift To Giveaway</li><li>Generate Traffic To Your Website</li><li>Profit From Selling Solo Ads</li></ol><p><strong>Bonus Materials: </strong>It is my habit of rewarding my students who take action. Upon completing every module, send me your work and I will send you your reward. Yes, I want to help you with your business I will reward you with tools to achieve success. </p><p>Show me your effort and I will guarantee your success.</p><p><strong>How Fast You Can Start: </strong>You can complete the course in a day and implement the action steps at your own pace.</p><p><strong>Step By Step Guidance.</strong> I will be showing you the exact steps to build your business. You get to look over my shoulder while I set everything from scratch.</p><p><strong>Why Take This Course:</strong> If you tried internet marketing, affiliate marketing or creating your own product but failed, it is normal. It takes a lot of skill to be successful at those. </p><p>The good news: being a solo ad seller is the perfect stepping stone to learn and master the basics of internet marketing. Selling solo ads is the best way to generate income while learning the business.</p>", 
    "end_date": null, 
    "title": "Beginner Tutorial on Solo Ads for Online Business Owners", 
    "price": 0, 
    "instructors": "Jay Tiew Jin Jie", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633714_04be_4.jpg", 
    "course_url": "https://www.udemy.com/beginner-tutorial-on-solo-ads-for-online-business-owners/", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T16:06:48Z"
}