{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you want to advertise your website/product online but don't know where to start then this Bing Ads course is for you. This introductory course will guide you through all the basics of Bing Ads. You will learn how to create your campaigns, the importance of demographic targeting, choosing the right keywords and the secret to getting clicks for under 10c.</p><p>If you have no experience with online advertising or are just starting out, learn how to setup your first Bing Ads campaign the right way. This course will provide you with a shortcut to creating campaigns fast and getting hundreds of clicks. In particular you will learn:</p> <ul><li>Why Bing is the <strong>Best Starting Platform</strong> for your Pay Per Click Campaigns</li> <li>How to create your 1<sup>st</sup> Bing campaign using my Simple <strong>Step-by-Step</strong> process</li> <li>Learn how to avoid the <strong>2 Biggest Mistakes</strong> that newbies make when starting on Bing (and avoid blowing your budget in 1 day)</li> <li>The best <strong>FREE tool</strong> to create your keyword lists for your campaigns</li> <li>The secret to getting <strong>Clicks for Under 10c</strong></li> <li>Create ads like the pros using my <strong>#1 Secret for Ad Creation</strong></li></ul> <p>So if you are serious about getting started advertising online then take Bing Ads for Beginners. Take the course and 1 hour from know you could be setting your first Bing Ads Campaign!</p>", 
    "end_date": null, 
    "title": "Bing PPC Ads For Beginners: Setup Campaigns Like the Pros", 
    "price": "35.00", 
    "instructors": "Tom Wiztek", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617122_ae27_4.jpg", 
    "course_url": "https://www.udemy.com/bing-ads-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T08:53:44Z"
}