{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Last Updated April, 2016!</p>\n\n\n\n<p>When you’re starting a business with little money, you need to bootstrap. Bootstrapping means you pay for and learn how to do it all in the beginning, including the designing of your items with programs like Adobe® Photoshop. You have very little time and NO idea how to go about it…</p>\n\n\n\n\n\n<p>Welcome to this course. You will be introduced to Adobe® Photoshop where you will learn quickly how to design things such as business cards and print advertisements. With a low monthly cost, you will have the skills and know-how to build whatever you need quickly and efficiently.</p>\n\n\n\n\n\n\n\n<p>This course walks you through such things as setting up your workspace (and what it is), color modes, masking, intermediate masking, making a full-page ad and a business card, shortcuts, and others as well!</p>\n\n\n\n\n\n\n\n<p>This is an accelerated Crash Course. You will not only learn how to use the program but you will learn how to use the shortcuts to save time. The faster you learn to use shortcuts, the faster you will get your projects done, and that’s money saved.</p><p><strong><em class=\"redactor-inline-converted\">Enroll Now!</em></strong></p><p><em>Note: This is the Photoshop portion of the Build your Business by Bootstrapping series. Other portions of the course will be coming soon.</em></p><p><br></p>", 
    "end_date": null, 
    "title": "Build Your Business by Bootstrapping Series - Photoshop", 
    "price": "50.00", 
    "instructors": "Carlos Gonzalez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348254_76f9_3.jpg", 
    "course_url": "https://www.udemy.com/photoshop-for-business-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T19:48:08Z"
}