{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>STUDENT REVIEW FOR THIS COPYWRITING COURSE:</strong></p><p><strong><em>\"As a top gun copywriter for 15 years now, I understand how to write good copy. And the best way is to always be learning... learning about the product you write copy about and learning to write copy. I can say, very sincerely, that this is a terrific primer for copywriting. There are great tips for new copywriters and for us old, grizzly hacks, there are a lot of 'reminders'... and \"Oh, yeah! Ah plumb fergot that!\" moments.\"</em> -Scott Paton </strong><br></p><p><strong>What Is The Most Critical Element That Can Make Or Break Any Business?</strong></p><ul><li>That critical element is SALES.</li></ul><p>Without sales, your business is dead in the water.</p><p><strong></strong></p><p><strong>What Is The Most Critical Element That Determines Whether You Make Sales?</strong></p><ul><li>That critical element is COPYWRITING.</li></ul><p><strong></strong></p><p><strong>What Is Copywriting? </strong></p><p>Copywriting is the art of persuading your customers to buy from you by using the printed word - on a brochure, on a website, in a sales presentation, in an investor's pitch or in a video.</p><p>Many business owners invest hundreds of thousands in their business only to drop the ball with the most important part of their business - their copywriting!</p><p>This course is like a \"workshop\" where we will walk through a step-by-step process to getting your high-quality sales copy written.</p><p>We will cover the 10 critical elements of a salesletter / video script, in order.</p><p>And, as we cover each element you will get:</p><ol><li>What the copywriting element is and how to create the best one for your business</li><li>Real-world examples of this element (from the instructor's actual websites / clients</li><li>An implementation exercise so that you put your newfound knowledge into action!</li></ol><p>When you complete this course, you will have a powerful salesletter. brochure, investor pitch or sales video!</p><p>Do not struggle with poor sales copy - take this course now and begin making more sales as soon as possible!</p><p>Your enrollment today is backed by Udemy's 30-day, no-questions-asked, money-back guarantee, so you have no risk and a lot more sales to gain!</p><p>Enroll today - you'll be glad you did.</p>", 
    "end_date": null, 
    "title": "Copywriting Mastery - Step By Step To Powerful Sales Copy", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358618_6f6f.jpg", 
    "course_url": "https://www.udemy.com/copywriting-make-your-website-ads-videos-sell-more/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T20:02:47Z"
}