{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>By far one of the most important aspects of owning a website or reaching out to people is by the use of News Letters if done correctly you can build a great society of loyal members!</strong></p><p>This course is suitable for Beginners and Asvanced users alike, I will show you how you can quickly and easily create news letters, our subscriber system of choice for these lessons is MailChimp, within this I will show you how to set up a Subscriber List, a template for future use and also how to embedd code into any HTML page / Website, with a few hiddens goodies as well.</p><p>What we will learn:</p><ul><li>Set up a News Letter template in Mail Chimp</li><li>Create a new subscriber/member list</li><li>Install and use GIMP a FREE Image editor</li><li>Quick lesson on both GIMP and Photoshop</li><li>Import and Export subscribers</li><li>Set up Pop up and install on a website</li><li>Create a simple capture form to put into any HTML page</li><li>And loads more...</li></ul><p>What you need?</p><ul><li>A Mail Chimp Account (its ok we will set this up in the course)</li><li>Photoshop or GIMP (Photoshop is very expensive so if you dont have this use GIMP a free piece of sftware for Digital Editing)</li><li>If you wish to follow along with the course and create a Custom Template you will need Dreamweaver (It is not essential to do this section you can just choose a template from Mail Chimp, I show you how to set this up in course)</li><li>Screen capture software this is good but not essential</li></ul><p>Follow along and Have fun creating New letters.<br></p>", 
    "end_date": null, 
    "title": "Creating and Sending a News Letter and capturing subscribers", 
    "price": "20.00", 
    "instructors": "David Newton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624680_4ef6.jpg", 
    "course_url": "https://www.udemy.com/creating-and-sending-a-news-letter-and-capturing-subscribers/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T13:45:44Z"
}