{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t  We are all too familiar with the traditional billboards and signage we see in city streets (think Times Square in NYC). Display advertising &ndash; after all &ndash; is a phenomenal method for building brand affinity and keeping a brand top-of-mind. While this is no different from the digital marketing realm, online display advertising takes it one step further by enabling you to target your &lsquo;online&rsquo; billboards at your ideal consumer.  </p>  <p style=\"\">  \t  If your display ads aren&rsquo;t reaching the right consumers, chances are you&rsquo;re missing 5 key components in your online strategy. Display advertising &ndash; when done correctly &ndash; can target who you want, when you want, while boosting your marketing ROI!  </p>  <p style=\"\">  \t  This condensed course will uncover industry techniques and strategies that will help your business drive conversions and significantly enhance brand recall in your customers and prospects.  </p>  <p style=\"\">  \t  This course is a must for any business or marketing professional who is looking to leverage Display Advertising as part of their overall marketing strategy. Whether you are just starting to online campaigns or are a &quot;seasoned pro&quot; this session will provide you with key takeaways so that you can ensure your Display Advertising efforts measurably contribute to your business&#039; brand image.  </p>  <p style=\"\">  \t  In addition, by attending this course, you&#039;ll also receive the complimentary Executive Summary and White Paper that are designed to help keep your display advertising campaigns on track.  </p>", 
    "end_date": null, 
    "title": "Display Advertising - Key Components for Campaign Success", 
    "price": "20.00", 
    "instructors": "Digital Marketing Simplified - WSI Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/153082_2eb9_2.jpg", 
    "course_url": "https://www.udemy.com/display-advertising/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-26T16:26:49Z"
}