{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Você não precisa ser um especialista em propaganda ou contratar uma empresa para fazer anúncios na Internet para <strong>SEU </strong>negócio!</p><p>Não importa se você tem uma empresa física ou tem um negócio digital...</p><p>...anunciar seus produtos ou serviços na internet vem se tornando uma prática obrigatória para quem quer escalar o seu negócio!</p><p>Você sabia que, <strong>só no Brasil,</strong> o Facebook tem mais de <strong>92 milhões de usuários</strong>, o que representa <strong>45,40%</strong> da população brasileira?</p><p>...e que todas as informações pessoais que nós compartilhamos lá podem ser utilizadas por <strong>sua empresa</strong> para encontrar exatamente o público que <strong><strong>você</strong> </strong>deseja conquistar?</p><p>A boa notícia é que existe um caminho para você chegar no seu público de forma hiper segmentada, encontrando exatamente os seus melhores clientes...</p><p>...este caminho se chama: Anúncios patrocinados do <strong>Facebook Ads</strong>.</p><p>Aprender a anunciar no Facebook é um passo essencial para quem já é ou pretende ser um micro ou pequeno empresário!</p><p>O melhor é que nenhum conhecimento prévio é necessário para fazer o curso <strong>Facebook Ads: Do Zero ao Seu 1º Anúncio em 1 hora.</strong>  </p><p>Você só precisa utilizar sua conta pessoal do Facebook (se não tiver, crie uma :) e investir um pouco do seu tempo!</p><p>Depois do curso você estará apto a criar e otimizar campanhas no Facebook e aumentar sua carteira de clientes, leads e, consequentemente, os lucros do seu negócio!</p><p>As vídeo aulas estão organizas em módulos sequenciais e que te permitem <strong>aprender e praticar ao mesmo tempo</strong>:</p><ul><li>Introdução e Mapa do Curso;</li><li>Módulo Configuração: Criação e configuração da conta Business, Fan Page, Contas de Anúncio e Forma de Pagamento;</li><li>Módulo Seu Público: Mapeamento da Persona e explorando o Facebook <em>Audience Insights</em>;</li><li>Anúncio: Configurando a Campanha, Grupos de Anúncio, Orçamento, Segmentação de Público, Imagens e Aprovação dos anúncios;</li><li>Turbinando: Avaliando as métricas e turbinando a campanha;</li><li>Remarketing: Use agora e multiplique seus resultados.</li><li>Dicas e Bônus: Conteúdos extra!</li></ul><p><br></p><p><span></span></p>", 
    "end_date": null, 
    "title": "Facebook Ads: Do Zero ao Seu 1º Anúncio em 1 hora", 
    "price": "20.00", 
    "instructors": "Lucas Rêgo", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639338_c2e5_7.jpg", 
    "course_url": "https://www.udemy.com/facebook-ads-do-zero-ao-seu-1o-anuncio-em-1-hora/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T15:18:48Z"
}