{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tLa primera lección de este curso la aprenderás ahora mismo y se resume en esta frase: “<strong>Google Adwords es suficientemente sencillo como para que cualquiera pueda fracasar y pagar más con sus campañas de Coste por Clic</strong>”.  </p>  <p>  \t<strong>Seguro que habrás leído que Google Adwords es muy sencillo de utilizar</strong>. Su interfaz tan bonita, potente e intuitiva y la propia publicidad que Google hace en torno a su sistema hacen sentir a cualquiera capaz de configurar una campaña y ver cómo sus anuncios aparecen en los resultados del conocido buscador.  </p>  <p>  \t<strong>Pero realmente Google Adwords es una herramienta muy potente, compleja y de cuya configuración dependen factores críticos</strong> como cuánto pagarás por cada clic, cuanto deberás invertir o en qué posición y qué rendimiento darán tus anuncios.  </p>  <p>  \tEn este curso práctico aprenderás, a través de <strong>lecciones teóricas y vídeos con demostraciones prácticas</strong> los entresijos de la configuración de Google Adwords, conceptos importantes relativos al medio publicitario online y trucos y consejos para <strong>conseguir pagar el mínimo y obtener el máximo rendimiento a tus campañas de PPC, ya sean para la red de búsqueda como display</strong>.  </p>  <p>  \tEl curso está estructurado en las siguientes secciones:  </p>  <ul>  \t<p>  \t\t·Conceptos teóricos sobre Google Adwords.  \t</p>  \t<p>  \t\t·Creación y gestión de una campaña para la red de búsqueda.  \t</p>  \t<p>  \t\t·Creación y gestión de una campaña para la red de Display.  \t</p>  </ul>  <p>  \tPor su carácter práctico, <strong>este curso no está enfocado a profesionales que quieran obtener la certificación de partner sino para profesionales del Marketing o empresarios</strong> que quieran gestionar con éxito sus propias campañas y conseguir los mejores resultados.  </p>  <p>  \tAl realizar este curso obtendrás los conocimientos que he ido adquiriendo a lo largo de toda mi experiencia gestionando cuentas de clientes en distintos sectores y para distintos casos.  </p>  <p>  \tEste curso es <strong>práctico y sencillo de asimilar.</strong>  </p>", 
    "end_date": null, 
    "title": "Google Adwords para anunciarse con éxito", 
    "price": "40.00", 
    "instructors": "Víctor Campuzano", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322174_ab95_2.jpg", 
    "course_url": "https://www.udemy.com/google-adwords-para-anunciarse-con-exito/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T16:08:07Z"
}