{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Website Owners, App Developers &amp; Video/Games Producers</strong> - Overwhelmed with all the ways to make money online? When it comes to online advertising there's banner advertising, direct and indirect sales, affiliate marketing, text links, sponsorships, pop-ups and pop-unders. Where do you begin? If you find yourself repeating this question over and over then look no further than this comprehensive guide to making money with online advertising.  </p>  <p>  \tYou will learn how the online advertising industry works, all the key players and how to connect your content (website, app, video, game, etc) with quality advertisers. We'll discuss the difference between selling directly and working through third parties like ad networks and ad exchanges. Finally, we'll dive into your business model and figure out what are the right moves for YOU.  </p>  <p>  \t<strong style=\"\">In this course we will cover:</strong>  </p>  <ol style=\"\">  \t<li>Introduction to Online Advertising </li>  \t<li>Ad Networks and AdSense</li>  \t<li>Ad Exchanges and the Google Ad Exchange </li>  \t<li>Mobile Web and App</li>  \t<li>Optimizing the Performance of Your Ads<br style=\"\">  \t</li>  \t<li>Choosing the right advertising partner for YOUR business </li>  </ol>  <p>  \tAs a <strong style=\"\">BONUS</strong>, we'll also dive into ad serving and explore:  </p>  <ul style=\"\">  \t<li>What is ad serving?</li>  \t<li>How does ad serving work and do I need an ad server?</li>  \t<li>What is the best ad server for me? </li>  </ul>  <p>  \t<strong style=\"\">Take this course and discover all the ways to make money online today! </strong>  </p>", 
    "end_date": null, 
    "title": "How The Online Advertising Industry Works", 
    "price": "20.00", 
    "instructors": "Michael Peggs", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47214_25d2_5.jpg", 
    "course_url": "https://www.udemy.com/making-money-online/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-24T22:55:23Z"
}