{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><em style=\"\">&quot;Titles name a book, and names are important. A good name can make or break you.&quot; - Scott Westerfield</em></p><p style=\"\">----------------------------------------------------------------------------------------------------------------------------</p><p style=\"\">You&#039;ve finished your course, book or script. Now what? Your title awaits! The big question is: what is the best title for my book? How can I name it to not only best convey the message I want to communicate, but to also grab peoples&#039; attention?</p><p style=\"\"><strong style=\"\">Discover The Secrets Of Creating A Killer Title</strong></p><ul style=\"\"><li style=\"\">Build the ultimate title for your book or course, word by word, that maximizes attention,</li><li style=\"\">Learn how to combine persuasive elements to make a good title great,</li><li style=\"\">Jack up curiosity levels til they&#039;re sky high so that people can&#039;t help but check out your content.</li></ul><p style=\"\">11 Tried-And-True Strategies To Masterfully Title Your Work For Optimum Persuasion</p><p style=\"\">I&#039;m an avid follower of the 80/20 Rule. 80/20 dictates that of all the things you can focus on in your work, the title is the most important. A strong title can sell a weak book, but not the other way around.</p><p style=\"\">A book that&#039;s been underperforming on Kindle can suddenly sell like hotcakes, all from changing a couple words. Your titles will have curiosity dripping of them by the time you finish this course!</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">You will discover 11 proven strategies for titling your work in this course. To back up the lectures, I&#039;ve included screenshots from Kindle that show real books using the kinds of titles I say work. Many are best sellers, and for good reason.</p><p style=\"\">Don&#039;t suffer from Crap Title Syndrome. Pick up this course today and learn how you can optimize your course or book title to perfection. Join a rapidly growing community of students learning and sharing their success.</p>", 
    "end_date": null, 
    "title": "How To Create A Title That Sells", 
    "price": "20.00", 
    "instructors": "Johnson Kee", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464422_aaea_3.jpg", 
    "course_url": "https://www.udemy.com/killer-titles/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T22:19:48Z"
}