{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Audio Advertising – A Booming and Growing Industry</strong></p>\n\n\n\n<p>AM &amp; FM radio, satellite radio, streaming services, podcasts. Together, they’re a booming, multibillion industry. And all of them carry audio advertising. That means there are outstanding opportunities for those who know how to create radio commercials and other types of audio ads – and those opportunities are growing.\n\n  </p>\n\n\n\n<p><strong>How Do You Take Advantage of the Opportunities?</strong>\n\n  </p>\n\n\n\n<p>But to take advantage of them, you must know how to create audio commercials that sell. This course provides you with a step-by-step, start-to-finish process that will enable you to easily write audio commercials and get them produced. You’ll be able to create commercials that work to sell all kinds of products, services and more.\n\n  </p>\n\n\n\n<p><strong>Who Are We to Teach You?</strong>\n\n  </p>\n\n<p>How do you we know? Because we – your instructors, the principals of The Norman Agency, “The Sound of Marketing”® – have created thousands of audio advertising campaigns during our careers, for consumer-focused products and services as well as B2B clients. And what we’ll teach you are the skills and techniques that we use year in and year out.</p>\n\n<p><strong>What Are You Going to Get from This Course?</strong>\n\n  </p>\n\n<p>·      3 hours of lectures</p>\n\n<p>·      proven techniques\n\n  </p>\n\n<p>·      downloadable examples\n\n  </p>\n\n<p>·      customizable templates\n\n  </p>\n\n<p>·      the confidence to write and get your audio ads produced\n\n  </p>\n\n<p>·      access to your instructors through the comments section; answers to your questions within two business days</p>", 
    "end_date": null, 
    "title": "How to Create Audio Commercials that Sell", 
    "price": "35.00", 
    "instructors": "Jim Norman, Becky Norman", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815444_5bdb.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-audio-commercials-that-sell/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T13:23:08Z"
}