{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are you selling something online or offline? Creating Ads or Sales Pages?</strong><br></p>\n\n<p>Then this course is for you!</p>\n\n\n\n\n\n\n\n<p>In this course, you will learn different methods of making people click and/or buy using simple, psychological tricks. This work for ads, banners, emails, landing pages and all other media! Whatever you are doing, if you are using advertising in your business, this course will help you make your ads top-performing!</p><p>Whatever businessmodel you have, at some point, you'll have to convince people to do something. This is usually the most important part: <strong>The better you convince, the more success you'll have</strong><strong>. </strong>Which is why learning to sell and convince is an incredibly valuable skill, especially in Internet Marketing. This course will help you do just that, learn new ways of persuasion and learn to apply them easily.</p>\n\n\n\n\n\n\n\n<p>These powerful methods will help you increase your conversion rates and make you more money simply by supercharging your ads. You can use them in all niches, as an affiliate or product creator, in ads and in sales copy. These methods are based on very simple psychological tricks that work anywhere, anytime. </p>\n\n\n\n\n\n\n\n<p>The course isn't incredibly long, true. Instead, I wanted to make it short and to the point, value packed until the end. Did I succeed? Take the course and find out!</p>", 
    "end_date": null, 
    "title": "Killer Advertisement - Basic Tricks To Double Your Clicks", 
    "price": 0, 
    "instructors": "Benjamin Schwalb", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/863098_2f3e_3.jpg", 
    "course_url": "https://www.udemy.com/killer-advertisement-basic-tricks-to-double-your-clicks/", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-29T20:14:29Z"
}