{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">In this course you will learn how to create highly effective Adwords campaigns for your business that are quick and easy to manage and make you and your business more money.</p><p style=\"\">The truth is you don&#039;t need to pay an expensive ad agency to do this for you, anyone with a few spare hours per month can run a successful Adwords campaign, you really only need to know two things:</p><ol style=\"\"><li style=\"\">How to set up your campaigns properly.</li><li style=\"\">How to manage and optimize your campaigns effectively</li></ol><p style=\"\">This may sound very simple, but its the truth. </p><p style=\"\">After working with Adwords clients for over 8 years now, the most common, recurring problem I see with failing campaigns, is they have been set up poorly and the owner has no idea how to manage them.</p><p style=\"\">This course is designed to solve this problem by giving you a step by step road map for setting up and managing high quality Adwords campaigns </p><p style=\"\"><strong style=\"\">What Will You Learn In This Course</strong><strong style=\"\">? </strong></p><p style=\"\">In this course I will show you step by step how to set up and manage your campaigns for the maximum possible results, this includes:</p><ul style=\"\"><li style=\"\">How to set up your account and campaigns</li><li style=\"\">How to find your way around the Adwords platform</li><li style=\"\">How to properly structure your campaigns</li><li style=\"\">How to perform effective keyword research</li><li style=\"\">How to write high quality, compelling ads</li><li style=\"\">How to effectively track conversions so you know what is working</li><li style=\"\">How to optimize you account to continually make campaigns more profitable</li><strong style=\"\"></strong><li style=\"\"><strong style=\"\">BONUS - </strong>How to create advanced display re-marketing campaigns</li><li style=\"\">And much more</li></ul><p style=\"\">What&#039;s more, I will be on hand to answer any questions you might have.</p><p style=\"\">So what are you waiting for? lets get started! click the take this course button and I will see you in the members area</p>", 
    "end_date": null, 
    "title": "Learn Google Adwords & Save Thousands on Agency Fees", 
    "price": "20.00", 
    "instructors": "Carl Lewis", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500994_b401_5.jpg", 
    "course_url": "https://www.udemy.com/learn-google-adwords-save-thousands-on-agency-fees/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-13T13:23:16Z"
}