{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you <strong></strong>want to be <strong>successful </strong>with <strong>Email Marketing </strong>you will <strong>LOVE </strong>this Udemy course<strong></strong>! You <strong></strong>will learn the<strong> </strong><strong>principles </strong>and <strong>strategies</strong> that work for us and that we have used to build Email Marketing campaigns for over <strong>500 businesses successfully! </strong>Join this course today to master MailChimp and start to profit from building an email list!<strong></strong><br><strong></strong></p><p><strong>JOIN THE 30,000+ HAPPY STUDENTS I HAVE TAUGHT AND CONSULTED ON MARKETING!</strong></p><p><strong>Do\n you want to partake in a CONSTANTLY updated Email Marketing \ncourse that teaches you everything required for successful marketing on MailChimp from A to Z?!</strong><br><strong></strong>  </p>  <p>  \t  Three reasons to TAKE THIS COURSE right now!  </p>  <ol><li>You get <strong>lifetime access</strong> to lectures, including new lectures every month (<strong>content is added constantly</strong> as updates roll out).</li><li>You can <strong>ask me questions</strong> and <strong>see me respond</strong> to every single one of them thoughtfully!</li><li>What\n you will learn in this course is original, tested, and very detailed! Master the platform MailChimp and learn the Email Marketing strategies I implement for clients \ndaily! This \ncourse will also layout how to optimize your email content, continue to build your email lists and then evaluate key metrics from the data MailChimp provides. Make the most of your email \nmarketing and make it easy, so you can  get back to what you do best, \nrunning your business! </li></ol><p>In this course, you will learn <strong>Email Marketing</strong> from beginner level to advanced on MailChimp!</p><p>You\n will be able to be able to build squeeze pages and sign up/opt in forms to grow your email lists and increase your potential customers. You will be able to create hyper segmented email capture lists for more effective, targeted email marketing in the future. You will be able to build and design professional email campaigns that drive higher conversions. You will be able to A/B split test emails and analyze the proper data to make your next email even better! Join this course \nnow to learn how to take your brand, product or service to the next \nlevel with the power of Email Marketing! </p><p><strong>TAKE\n A STEP IN THE RIGHT DIRECTION WITH YOUR LIFE AND LEARN HOW EMAIL MARKETING WILL MAKE YOUR BUSINESSES A \nHOUSEHOLD NAME!  ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "Learn Email Marketing A-Z Using Mailchimp", 
    "price": "20.00", 
    "instructors": "Coursenvy Online", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573994_a4a8.jpg", 
    "course_url": "https://www.udemy.com/mailchimp-email-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T22:18:14Z"
}