{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Mailing Lists, Newsletters, and Users… Oh My</strong>  </p>  <p style=\"\">  \t    MailChimp is a free mailing list maintenance system that also provides a web based interface to creating professional looking emails to be sent to those lists.  This course guides you through the use of Mailchimp from defining a simple mailing list to creating and sending your first email.  </p>  <p style=\"\">  \t<strong style=\"\">See How to Increase Your Business Through Targeted Email Campaigns</strong>  </p>  <p style=\"\">  \t    This course is primarily focused on teaching you how to use the Mailchimp web based interface to create, maintain, and analyze your mailing lists and email campaigns.  However, it also provides important insight into what to include in your newsletters and how to establish personal relationships with your most important customers.  </p>  <p style=\"\">  \t<strong style=\"\">Let Me Be Your Guide…</strong>  </p>  <p style=\"\">  \t    Mailchimp is pretty easy to use, but you still might appreciate a guiding hand as you begin to use the tool to build your business in exciting new directions.  </p><p style=\"\"><strong style=\"\">Note:</strong> If you&#039;re serious about email marketing, you might want to consider Get Response or some other mailing list service as MailChimp has a reputation to being unfriendly to internet marketers.  One student mentioned difficulties that arise from including affiliate links in your emails.  MailChimp is still appropriate for less aggressive business mail.</p>", 
    "end_date": null, 
    "title": "MailChimp for Free: Build Email Mailing Lists +Squeeze Pages", 
    "price": "20.00", 
    "instructors": "Author/Publisher Brian Jackson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260388_991e_2.jpg", 
    "course_url": "https://www.udemy.com/mailchimp2/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-13T04:04:45Z"
}