{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Probably you saw many <strong>ads and banners</strong> on different websites and thought how <strong>great they look</strong>. And they also seem to<strong> make you want to click on them to </strong>find out more about that product or service, no matter what it's about.</p><p>If you are like most people you said yourself \"<em>They look awesome, but it is too difficult for me and paying an ad graphic designer would cost a fortune..</em>.\"</p><p>This is true... and not. </p><p>It is true that paying a designer to create your banners or the ads you use on your websites or Facebook could cost you a lot of money. </p><p>But it is not true you cannot do it by yourself.</p><p>Since ads, banners are one of the most important type of images you can use on a blog or online, having your own ads &amp; banners usually help a lot in positioning your products, your services in your niche (asumming you know your niche and have products that can realy help people get results).</p><p>This course is <strong>a beginner course on how to create eye catching, professional looking ads for websites and blogging</strong>, by using Canva's free tool. It is intended for people who want to promote their (or someone else's) products and services and want the visitors of his website click on those ads, not just admire how nice they look... (like ...\"<em>cool banner, I wonder what is this about..</em>\" &amp; click)</p><p>And to also <strong>capture attention on websites.</strong></p><p>You don't need any graphic design experience, just<strong> start from zero and create amazing ads and banners</strong> that look awesome.</p><p>You will learn</p><ul><li>how to create your Canva account,</li><li>how to use the design dashboard,</li><li>how to add images,</li><li>how to format the text areas,</li><li>how to find out already prepared text blocks that look professional,</li><li>how to add shapes and thousands of possible professional looking graphic elements (for free),</li><li>how to create the best converting types of ads types and which are those,</li><li>how to create a eye catching skyscrapper (and we don't talk about buildings here...)</li><li>how to create a Facebook ads in a couple a minutes, the right way,</li><li>how to create one of the most used, best selling size of ads in minutes: and yes, here the size matters,</li><li>how to export your ads, your banners from Canva to your blogs, your websites or Facebook</li></ul><p>By taking it, you will be able to understand and<strong> master the art of creating high converting ads images</strong> in the step by step demonstrations. </p><p>In your own pace.</p><p>My name is Florin Rosoga, I managed hundreds of social media and websites campaigns for myself or my clients in the last years.</p><p>One of the most important elements when seling on a website are the ads, the banners images you use. Since social media and websites is a visual place, an engaging image will improve your website &amp; social media campaign conversion.</p><p>Because <strong>you want the visitors attention to pay attention to that ad</strong>, you don't want them to ignore it.</p><p>But</p><p>But <strong>you don't want your visitors to admire your ad</strong>, to say \"what a nice looking banner\" and to ignore it.</p><p><u><strong>You want your visitors to click on the ad!</strong></u></p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about creating this kind of ads in minutes, for free and without any previous graphic experience.<br></p><p>The entire course can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next... <strong><u>click the Take this Course button</u></strong> top right and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p><strong>Stop struggling with boring ads everyone ignores</strong> and start mastering ad design in minutes, just like a pro!</p><p><strong>Thank you for reading this and learning about my course </strong>... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE</strong> to get started!<br></p>", 
    "end_date": null, 
    "title": "Make Attractive and Professional Website Banner Ads", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642660_ec8a_6.jpg", 
    "course_url": "https://www.udemy.com/eye-catching-professional-ads-banners-with-canva-ad-banners-tool/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T18:00:33Z"
}