{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><span></span></p><p><span></span></p><p><strong>“Adjusting Your Practice For Maximum Success”</strong></p><p>“How To Dominate Any Chiropractic Market You Choose  With Laser Precision and Awesomely Powerful Marketing Strategies That Work, Regardless Of The Economy.\"</p><p>You Can Use Our Marketing System To: Get More Patient Into You Office, Make More Money And Help More People Get Healthy. <br></p><p><strong>What Is This Course About? </strong></p><p>In this course we will take a look at marketing ideas that work for Chiropractors.<br> We will get rid of the stress associated with getting you message to the masses by using marketing for Chiropractors that works. We will explore together how to adjust your practice for maximum success with laser precision and awesomely powerful chiropractic marketing strategies that work”  </p><p><strong>What Terminology Should You Expect In The Course?</strong></p><p>Everything is broken down into easy to understand concepts. </p><p><br></p><p><strong>How Long Will The Course Take To Complete? </strong></p><p>The videos are no longer than 15 minutes each. You can do as many or as few as you want at one time. The time it takes you is entirely at your own pace. </p><p><strong>Why Take This Course? </strong></p><p>This course will increase you chiropractic marketing knowledge and open you up to new ways to get more patients into your office and onto you adjustment table. </p><p>This course will increase your income if you want it to. </p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Marketing For Chiropractors", 
    "price": "20.00", 
    "instructors": "Mark Joseph", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721168_642b_3.jpg", 
    "course_url": "https://www.udemy.com/marketing-for-chiropractors/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T20:09:17Z"
}