{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Want to learn how you can get quality clicks to your offers for under 10c a click?</p>  <p>And get onto the next biggest traffic source that is still in its early phase?</p>  <p>Mobile Advertising is growing fast. The use of smartphones is increasing rapidly. Statistics show that there are more global phone users then desktop users. And phone users keep growing at a faster pace. Furthermore consumers are becoming more comfortable with online purchases using their phone.</p>  <p>That’s why mobile advertising is going to be big. Now is the time to equip yourself with the skills necessary to create profitable mobile ad campaigns.</p>  <p>If you want to start using mobile advertisements then this course can help.</p>  <p>You will learn all about mobile advertisements</p>  <ul><li>You will learn the different types of mobile ads</li><li>How to create campaigns properly</li><li>The best sources for mobile traffic</li><li>How you can leverage your new skills to promote other peoples offers and earn money</li></ul>        <p>Even if you have no prior experience with online advertising, we will show you how easily you can get started. By the end of this course you will be able to setup your own mobile advertising campaigns in under 15 minutes.</p>  <p>Don’t get left behind during this huge trend. Enrol today and prepare yourself with the skills necessary to get profitable mobile advertising campaigns.</p>", 
    "end_date": null, 
    "title": "Mobile Traffic Academy: Get Targeted Traffic To Your Website", 
    "price": "20.00", 
    "instructors": "Tom Wiztek", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634010_d7c5.jpg", 
    "course_url": "https://www.udemy.com/mobile-traffic-academy/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T20:05:36Z"
}