{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Ninja Advertising: Sell More, Go Viral and Retartget.</strong>  </p>      <p>  \t<em>- Would you like to be getting more traffic to your website? </em>  </p>  <p>  \t<em>- What is your plan to convert browsers into buyers?</em>  </p>  <p>  \t<em>- Are there online marketing elements you know you need to do but can't find the time?</em>  </p>  <p>  \t<em>- Would you like to stand out above your competition?</em>  </p>    <p>  \t<strong></strong></p><p><strong>If you answered “YES\" to any of these, then this Ninja Advertising course is for you.</strong>  </p>    <p>  \t<strong>----------------------------------------------------------------------------------</strong>  </p>    <p>  \t               With so many different marketing platforms available, business owners  often operate in the TRIAL &amp; ERROR mode. </p><p> They try the latest social  media site because they hear other businesses talking about it.  They  start a blog because someone said they needed one. </p><p>They build a website  because everyone needs a website. While social media, blogs and websites are important, there is not one combination that works for every business.</p>  <p>  \t               NINJA  Advertising provides a focus on using the right tools and social  media platforms EFFECTIVELY AND EFFICIENTLY.  It offers a blueprint that  keeps the business on track, without chasing the latest fad.  </p>  <p>  \t               Ultimately, <strong>Ninja Advertising is about increasing traffic to your door,  improving search engine rankings and converting browsers into buyers.</strong>  </p><p>Click the Green <strong>\"Take This Course\" </strong>button in the top right hand corner of this page right now and we will be happy to see you on the other side to explore Ninja Advertising together! Wish you a<strong> Happy Learning!</strong><strong></strong><br></p>", 
    "end_date": null, 
    "title": "Ninja Advertising: Sell More Online", 
    "price": "20.00", 
    "instructors": "iMarketer Training", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222292_0bee_3.jpg", 
    "course_url": "https://www.udemy.com/ninja-marketing-tactics/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-18T23:48:11Z"
}