{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Este curso sumamente práctico está diseñado para que <strong>empresarios</strong>, <strong>gerentes comerciales</strong> y <strong>ejecutivos a cargo del área de ventas o mercadotecnia</strong> aprovechen las herramientas de la <strong>neurociencia</strong> y la <strong>psicología</strong> para entender la mente de su consumidor y así saber cómo venderle más.</p><p></p><p>Al final del curso: </p><ul><li>Entenderás las razones conscientes e inconscientes que motivan la compra.</li><li>Sabrás como posicionar tu marca en la mente de tu consumidor.</li><li>Estarás listo para lanzar exitosamente tu producto o servicio teniendo en cuenta el nombre ideal, tendencias, momentos de consumo, etc.</li><li>Sabrás cuál es el medio más efectivo para tu campaña.</li><li>Identificarás tu nicho psicográfico para saber a quién le estás vendiendo.</li><li>Conocerás las técnicas y metodologías más avanzadas de investigación, para que puedas tomar decisiones con la certeza de estar innovando.</li></ul> <p>El curso incluye material extra como:</p><ul><li>Más 10 casos de éxito en innovación, disponibles para su descarga.</li><li>1 checklist para el lanzamiento de tu producto o servicio.</li></ul> <p>Debes de tomar este curso si tienes a tu cargo una marca y quieres preparar su lanzamiento o posicionarte de manera permanente en la mente de tu cliente. El curso esta estructurado de manera que puedas ir dando los pasos para lograrlo de manera exitosa.</p>", 
    "end_date": null, 
    "title": "Seminario de Neuromarketing e Innovación", 
    "price": "50.00", 
    "instructors": "Ricardo Perret", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/388148_9452_2.jpg", 
    "course_url": "https://www.udemy.com/seminario-de-neuromarketing-e-innovacion/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-08T01:11:58Z"
}