{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>***Course fully updated April 2015 and will continue to be updated to cover any new Facebook ad regulations or general best practice***</em></strong><br></p><p>You <em>know</em> you need to grow your business - rapidly. And you've heard that Facebook advertising can be a great way to do that. But you just haven't succeeded in it. Maybe you worry about the costs. Or maybe you just don't consider yourself an expert in advertising. Perhaps you've given Facebook advertising a go already but found it difficult, expensive and unprofitable. </p><p>If this is you, then you'll find this course hugely beneficial. Because Facebook advertising is one of the <strong>best ways</strong> of promoting your business and growing it rapidly. You just need to know <strong>how to do it right</strong>. </p><p>Over the course of 30 simple, short videos, I'll teach you:</p><ol><li><strong>How to start advertising </strong>on Facebook</li><li>Most importantly, I'll explain to you how to advertise <strong>profitably</strong>. </li><li>I'll show you step-by-step how I achieve <strong>consistently low cost ads</strong> for <strong>highly targeted customer leads</strong></li><li><strong></strong>And I'll show you how <strong>you</strong> can achieve the same l<strong>ow cost, targeted leads</strong> for your own business (whatever the industry)</li><li>I'll also show you <strong>how to create a professional, high-performing ad</strong> - <em>even if you have zero design or copywriting skills</em>.</li></ol> <p>So don't waste any more time on expensive ads, poor leads and poor traffic. Make a decision right now to change your business for the better. Start today and <strong>discover the secret tricks to achieving growth </strong>through one of the best advertising platforms around at the moment - Facebook. And start seeing a <strong>steady flow of new, highly targeted leads</strong> for your business.</p>", 
    "end_date": null, 
    "title": "Social Media Marketing: Acquire Leads with Facebook Ads", 
    "price": "20.00", 
    "instructors": "Lauren Lambie", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462912_5d19_2.jpg", 
    "course_url": "https://www.udemy.com/facebook-ads-how-i-get-cheap-leads-on-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T11:32:55Z"
}