{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Your website is your online presence.</strong> It is the first time many of your customers engage with you, so it’s important that it reflects <strong>you</strong> while also <strong>speaking to your audience</strong>.<br></p><p>In this course, you will learn how to write web content for <em>your</em> audience that is optimized for the best comprehension. In other words, you'll have a website that both <strong>y</strong><strong>ou and your customers will love</strong><strong>!</strong></p><p><strong>After completing Writing for the Web you will be able to:</strong></p><ul><li>determine your audience (worksheet included)</li><li>find your brand's voice (worksheet included)</li><li>apply website best practices</li><li>organize website content</li><li>convert existing materials into website content</li><li>write new website content</li><li>edit website content</li><li>keep your website up to date</li></ul><p><strong>I am a believer in creating websites that are easy to use</strong>, and I designed this course with the average person in mind. You don’t need to be a marketing guru to create an amazing website!</p><p>I will share with you what I’ve learned in the past <strong>16 years of creating and managing websites</strong> for businesses, government agencies, and nonprofits. I’ve spoken on this topic at conferences and taught it in classrooms, and I’m happy to welcome you to my virtual classroom.   <br></p><p>This course is for you if you want a website for <strong>personal use</strong>:</p><ul><li>personal branding</li><li>portfolio or digital resume</li><li>mommy bloggers, daddy bloggers - any type of bloggers!</li><li>DIYers</li><li>fandom</li></ul><p>This course is for you if you want a website for <strong>your business</strong>:</p><ul><li>small business</li><li>entrepreneur</li></ul><p>This course is for you if <strong>your boss</strong> just assigned you the task of <strong>webmaster</strong>.</p><p>The course is for you if you <strong>have a website</strong>, but want to <strong>update</strong> it.</p><p>This course is for you if you’re <strong>ready </strong>to get your website going, but <strong>don’t know where to start</strong>.</p><p><strong>In other words, I created this course for you!</strong></p><p>Check out a few of my lectures, available for free, then enroll for lifetime access, including all updates I make as technology and best practices change. What are you waiting for? Your website is calling!</p>", 
    "end_date": null, 
    "title": "Writing For the Web - How to Write Great Content That Sells", 
    "price": "50.00", 
    "instructors": "Dana Sheehan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684454_ab08_2.jpg", 
    "course_url": "https://www.udemy.com/writing-for-the-web-by-dana/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T00:44:33Z"
}