{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">هل تريد ربح ألاف الدولارات من الانترنت و بدا جني الارباح و تكوين ثروتك و العمل من المنزل ؟ </p><p style=\"\">كورس الربح من الانترنت باستخدام مواقع اختصار الروابط علي الانترنت سوف يساعدك لتحقيق هذا الحلم </p><p style=\"\">- سوف نتعلم في هذه الدورة علي اهم مواقع اختصار الروابط في العالم و اصدقها </p><p style=\"\">- مقدمة عن موقع ادفلي الأول في العالم في اختصار الروابط و كيفية انشاء حساب علي الموقع و تسجيل البيانات بالكامل .</p><p style=\"\">- ما هيا طرق الدفع المختلفة علي موقع ادفلي لاستلام الارباح الخاصة بك عن طريق الموقع</p><p style=\"\">- كيف تقوم باختصار الروابط و وتحليل المشاهدات و البلدان التي شاهدت الاعلانات الخاصة بالروابط المختصرة و حساب الارباح لكل رابط .</p><p style=\"\">- ما هو الموقع الثاني علي العالم في اختصار الروابط و كيفية انشاء حساب علي موقع شورتست .</p><p style=\"\">- ما هيا اهم الادوات التي سوف تستخدمها في موقع شورتست و كيفية انشاء رابط مختصر لجني الارباح من الاعلانات التي سوف تظهر علية .</p><p style=\"\">- ما هو اول موقع عربي للروابط المختصرة و ما هيا الميزات التي تميزه عن غيرة من الموقع و هو ما يعرف باديومي .</p><p style=\"\">- ما هيا اهم طرق الدفع التي تميز موقع اديومي عن غيرة دون الحاجه لفيزا لاسلام ارباحك .</p><p style=\"\">* كيفية تفعيل حساب الباي بال الخاص بك لاستلام الارباح الخاصة بك علي الانترنت .</p><p style=\"\">كيف تحصل علي فيزا اميريكية مجانا لاستلام الاموال و استلام 25$ مجانا في حسابك علي الفيزا .</p>", 
    "end_date": null, 
    "title": "الربح من اختصار الروابط علي الانترنت والعمل من المنزل", 
    "price": "20.00", 
    "instructors": "Remon Samry Dawoud", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556144_e495.jpg", 
    "course_url": "https://www.udemy.com/make-money-machine-with-short-links/", 
    "currency": "USD", 
    "subject_name": [
        "Advertising"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T09:24:25Z"
}