{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">In this introductory, basic course, students will get a great start in learning to belly dance for fitness, fun, or performance! Belly dance has existed since ancient times, and continues to mesmerize audiences today. Originally performed to prepare women for childbirth, the dance is a naturally good core workout, designed to power muscles in your core, legs, arms, and back. Absolutely anyone can benefit and enjoy this art form--including men, children, and women of all shapes and sizes! Learning and performing belly dance can do wonders for self esteem, self confidence, and promote positive body image!</p><p style=\"\">In this course, Shyama will teach hip movements like slides, circles, and shimmies, as well as variations on these moves. Combinations will be taught using individual moves to form the building blocks of a dance choreography of your own. Students will explore precise technique, fluidity, and varying speeds. After completing this course, students will have a foundation for continuing their dance study, and for practicing on their own.</p><p style=\"\">Whether you are looking to form a new and unique fitness regimen, learn a new style of dance, drill moves you already know, or just want to try something different, this course is for you! Shyama breaks down moves to their simplest aspects so students can follow along and learn the techniques.</p><p style=\"\">This course is just one of a set of beginner courses Shyama intends to make. Keep looking for more classes, and feel free to make suggestions to the instructor!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Belly Dance Basics: Hip Slides, Circles, & Shimmies", 
    "price": "30.00", 
    "instructors": "Amanda Garion", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/454882_aff8_4.jpg", 
    "course_url": "https://www.udemy.com/bellydancebasics1/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T16:19:19Z"
}