{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<h4 style=\"\">Are you ready to earn money while you have fun with kids? Anyone can do it!</h4>  <p style=\"\">  \t  Imagine going to work with a smile on your face, getting exercise as the hoop whirls around your waist. Imagine earning more money while working less hours, all while making a difference in children&#039;s lives.  </p>  <p style=\"\">  \t  What if you knew exactly what to say when you pick up the phone to pitch your classes? Or had a website so tempting, people were lining up to buy your hoop dance classes for kids?  </p>  <p style=\"\">  \t  It&#039;s possible! And I&#039;ll show you how to do it quickly and easily. Hundreds of my students worldwide have decided to invest in this course, and now they are teaching classes and booking hula hoop parties.  </p>  <p style=\"\">  \t  This course covers what to teach (simple games, fun choreography, easy-to-learn tricks) and how to teach it (lesson plans, how to teach different ages). More importantly, you learn to MARKET and SELL your classes so that you fill your calendar with classes and hula hoop parties.  </p>  <p style=\"\">  \t  You learn all about this business from someone who has been in your shoes before. Whether you are a curious beginner or an expert hoop dancer, you&#039;ll be able to take this course today and start teaching next week.  </p>  <p style=\"\">  \t  Try it out for 30 days and implement all of the strategies. You must conclude that this course BLOWS YOUR MIND or I insist on giving you a full refund.  </p>  <h4 style=\"\"></h4>", 
    "end_date": null, 
    "title": "Create, Market and Sell Hoop Dance Classes for Kids. ", 
    "price": "45.00", 
    "instructors": "Sarah Maccarelli Jordan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/128654_c8a1_7.jpg", 
    "course_url": "https://www.udemy.com/hoopingwithkids/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-03T18:56:20Z"
}