{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\t         I have been dancing everything from hip hop to tap to ballet, and there isn&#039;t a dance that gives me as much pleasure as the Charleston! There is a reason why Charleston swept the nation during the 1920s and is once again sweeping the world with an incredible rebirth! This dance is ridiculously fun, easy to learn and some how provides the depth for a life long journey of discovery and improvement.\r\n</p>\r\n<p>\r\n\t <a href=\"https://www.youtube.com/results?search_query=i+charleston&amp;oq=i+charleston&amp;gs_l=youtube.3..0l10.1622.3570.0.4155.12.9.0.3.3.1.137.813.4j5.9.0...0.0...1ac.1.11.youtube.y5DDXeNmeR0\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">If you don&#039;t believe me, just Search &quot;I Charleston&quot; on youtube.</a>\r\n</p>\r\n<p>\r\n\t    In this course you will start out with the basic&#039;s, but we are going to take it much further. I am going to give detailed breakdowns of the Advanced Charleston steps that only a handful of dancers in the world know, and took me over 12 years to figure out how to actually do properly.\r\n</p>\r\n<p>\r\n\t         I think Charleston is most natural dance for the human body. It is based the body movement of walking combined with the head boppin&#039; rhythm of authentic jazz and swing music. Now it has evolved to where you can dance it to your not only swing, but just about any for of pop music found today.\r\n</p>\r\n<p>\r\n\t           Though simple at first glance, the Charleston expands into a variety of styles that are exciting and dynamic to dance once learned. They offer a great physical challenge for people looking to improve their dance skills and coordination since it is based on counter body movement and balancing the upper and lower body movements.\r\n</p>\r\n<p>\r\n\t         A lot of the footwork and body movement found in Swing Dancing and Lindy Hop along with modern street dances like Shuffling, Hip Hop, Locking, House is based on the Charleston. Learning this dance is probably one of the best things you can do to strengthen your dance foundation and improve coordination and Rhythm.\r\n</p>\r\n<p>\r\n\t             Once you have mastered the steps in this course, an endless world of improvisation is at your finger tips using vernacular jazz movements and self expression. In addition, it will open the doors to the world of swing dancing, Lindy Hop, Authentic Jazz and an <a href=\"http://icharlestontheworld.com/I_Charleston_the_world/Map.html\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">international community of friendly dancers.</a>\r\n</p>\r\n<p>\r\n\t  Lastly, I can get through an hour of CrossFit or yoga but struggle to Charleston for more that 40 minutes. It is simply one of the most intense calorie munching workout&#039;s when done right. In this course, getting fit becomes the sweet side effect of having fun.\r\n</p>", 
    "end_date": null, 
    "title": "Dance the Charleston", 
    "price": "45.00", 
    "instructors": "Dax Hock", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/78338_5c69_8.jpg", 
    "course_url": "https://www.udemy.com/charleston/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-14T02:11:35Z"
}