{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<em style=\"\">Do you want to learn hip hop dance? Do you want to learn hip hop dance so badly? Do you wish you could dance like recording artists such as Chris Brown, Jason Derulo or Usher? Or was step up one of your favourite movies and you always thought to yourself, I wish I could dance like that. If this describes you, then you have come to the right place.</em>  </p>  <p>  \t<strong style=\"\">           Easy2DanceHipHop</strong> is a hip hop dance course designed to teach beginners cool hip hop dance moves. By getting you to go through a step by step system that is easy to follow, therefore, helping you to learn the moves within a short period of time. Also Easy2DanceHipHop will teach you how to be a unique, unpredictable and just overall entertaining hip hop dancer.  </p>  <p>  \t           Now imagine being able to really dance to your favourite song when it comes on in the club or at a party. Imagine the look on your friends and family’s faces when you start busting out these cool hip hop dance moves and then have them come up to you afterwards saying, “how did you do that”, “that was amazing”, “I didn’t know you could dance”, “where did you learn how to dance like that”. Well you don’t have to imagine any more because this unique hip hop dance course will give you all that and more.  </p>  <p>  \t        Whether you want to learn hip hop dance moves just for fun or whether you want to learn just a few moves to show off to your friends or at a party, then this course will be perfect for you but if you want to develop your hip hop dancing to an advanced level or to the point where you may want to enter competitions in the future then this hip hop dance course will be a great starting point for you.  </p>  <p>  \t<strong style=\"\"><em style=\"\">   In this hip hop dance course you will be learning</em></strong>:  </p>  <ul style=\"\">  \t<li style=\"\">A number of hip hop dance moves which will be split into 4 parts: steps, spins, glides and get downs. You will learn all these moves in a step by step way therefore making it easier to learn. </li>  \t<li style=\"\">An insight into the mental side of hip hop dancing as I teach you the importance of adding personality and creativity into your dancing because hip hop dance is not just all about learning moves and just doing it but hip hop dance is also about bring your own style, individuality and creativity to the dance which will make your hip hop dancing more entertaining, unique, exciting and unpredictable.</li>  \t<li style=\"\">How to combine the moves together and the right ways to combine moves together. So that when you dance it is like one smooth motion and not stop start, stop start.</li>  \t<li style=\"\">Some practising tips to help you learn the moves quicker and to help you develop confidence (especially for beginners) when you dance in public. </li>  </ul>  <p>  \t    In this course I am going to teach you how to be an individual hip hop dancer, so <strong style=\"\">NO CHOREOGRAPHY</strong> and what I mean by this is that I will teach you how to dance hip hop on your own because I don’t want your dancing to be just choreographed routines but instead I want you to have creativity and originality when you dance hip hop which will make your dancing more entertaining and exciting to watch as well as allowing you to be able to freestyle.  </p>  <p>  \t        You can go through this course at your own pace, so the only person you need to keep up with is yourself. So if all this sounds exciting to you and you are interested in giving Easy2DanceHipHop a try then all you have to do is enrol in this course, so you can get started on learning hip hop dance.  </p>", 
    "end_date": null, 
    "title": "Easy-2-Dance-Hip-Hop|The Ultimate Hip Hop Dance Course", 
    "price": "35.00", 
    "instructors": "Lolu Fenuyi", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408506_9f46_12.jpg", 
    "course_url": "https://www.udemy.com/easy2dancehiphop/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-30T22:54:03Z"
}