{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Der <strong class=\"redactor-inline-converted\">#1 Online-Tanzkurs</strong>, um endlich sicher auf jeder Tanzfläche zu werden.\n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">Traust Du D</strong><strong class=\"redactor-inline-converted\">ich auf Veranstaltungen nicht so richtig auf die Tanzfläche?</strong> Weißt Du nicht, was für Bewegungen Du machen kannst und was gut aussieht? Oder hast Du Schwierigkeiten eine zweite Person zum Tanzen aufzufordern, weil Du Dich dafür einfach nicht sicher genug fühlst?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Dann lerne mit diesem Udemy-Kurs <strong class=\"redactor-inline-converted\">innerhalb von nur einer Woche Discofox tanzen</strong>. Discofox ist der beliebteste Tanz im deutschsprachigen Raum. Denn er ist zum einen schnell zu erlernen und passt zum anderen zu fast jeder Musikrichtung - egal ob Pop, Schlager, House oder Electro.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In diesem Kurs lernst Du von einem ausgebildeten Tanzlehrer die richtigen Schritte und schöne Drehungen mit denen Du bald <strong class=\"redactor-inline-converted\">attraktiv auf jeder Tanzfläche überzeugen</strong> kannst. Du erhältst viele Profitipps und mithilfe eingebauter Übungsphasen schaust Du nicht zur zu, sondern lernst effektiv durch ständiges Mitmachen.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Wenn Du noch nie zu zweit getanzt hast oder Dich dabei unsicher fühlst, bist Du hier genau richtig. Der Kurs ist auf Tanz-Einsteiger zugeschnitten und <strong>wir fangen wirklich ganz von vorne an</strong>, damit Du garantiert mitkommst.</p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Endlich Tanzen Lernen - Der #1 Discofox-Kurs für Einsteiger", 
    "price": "25.00", 
    "instructors": "Dein Tanzlehrer: Manuel :-)", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830774_927f.jpg", 
    "course_url": "https://www.udemy.com/discofox-tanzen-lernen-einsteiger/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T19:02:03Z"
}