{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Updates:</strong></p>\n\n<ul><li><strong>New Routine </strong>to Robin Shulz  \"Sugah\"</li></ul>\n\n\n\n<p><strong>Course fully updated on May 2016</strong></p>\n\n\n\n<p><strong>Learn and Master Simple Hip Hop Routines To Your Favorite Songs!</strong></p>\n\n\n\n<p>Ever wanted to learn hip hop dance but felt too shy to go to a studio or don't have a studio nearby to learn? </p>\n\n\n\n<p>Don't worry, my friends! I'm here to teach you! You'll be learning basic routines that will get you jump started in really learning how to move and groove. </p>\n\n\n\n<p>If you've ever seen crews such as Poreotics, Mix'd Elements, Jabbawockees, they all started at the same place: THE BEGINNING. </p>\n\n\n\n<p>They weren't magically professionals.</p>\n\n\n\n<p><strong>I created this dance course for absolute beginners. No dance experience needed.</strong> So if you're a dancer with 2-3 years experience, this class is NOT for you.</p>\n\n\n\n<p>I'll be teaching you:</p>\n\n\n\n<ul><li>Basics of understanding eight counts</li><li>Textures so your dance doesn't look monotonous</li><li>How to perform without looking like a deer in the headlights.</li></ul>\n\n\n\n<p>The focus of this class: <strong>You understanding the dance and feeling confident about it.</strong></p>\n\n\n\n<p>I take you through a series of routines that are broken down to the finest detail so you can perform it in your very own home.</p>\n\n\n\n<p>Whether you're looking for choreography to learn or moves to just be able to use on the dance floor, this class is perfect for you.</p>\n\n\n\n<p>This class is constantly being updated with new routines with the most-up-to-date music. You can use these routines for your weddings, quinceneras, talent shows, or the dance floor. </p>\n\n\n\n<p>It's entirely up to you.</p>\n\n\n\n<p>By the end of this class, you'll be able to perform these routines with ease and feel confident in yourself as a dancer. You can use these routines for your own purposes such as a wedding, bar mitzvah, talent show, etc.</p>", 
    "end_date": null, 
    "title": "Hip Hop Dance For Beginners", 
    "price": "50.00", 
    "instructors": "Emeroy Bernardo", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393732_7789_4.jpg", 
    "course_url": "https://www.udemy.com/hip-hop-dance-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T08:19:48Z"
}