{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>UPDATE:</strong></p>\n\n<p>June 2016: New Routine to Rihanna's \"Work\"</p>\n\n<p><strong>Learn Hip Hop Dance To Your Favorite Songs with International Choreographer and Dancer Cyrian Reed!</strong></p>\n\n<p><strong>Course Description:</strong></p>\n\n\n\n<p>This course is designed to give students an awesome opportunity to learn the art form of Hip Hop (Urban Street Dance) and become a part of the Hip Hop Community. </p>\n\n\n\n<p>The course is created for beginning dancers who feel like they're too shy to dance or perhaps, those dancers that need a boost in their performance proficiency. </p>\n\n\n\n<p>The different Hip Hop techniques will be taught from several lectures and demonstrations. Classes will consist of the breakdown of Hip Hop sequences/ routines. Students will be able to review related video presentations, and other scholarly works that emphasize the history of Hip Hop culture and its’ positive impact on the progression of dance today.<br></p>\n\n\n\n<p><strong>Course Objective: </strong></p>\n\n\n\n<ul><li>Exhibit basic understanding of eight counts (1,2, 3, 4, 5, 6, 7, 8)</li><li>Demonstrate proficiency in the various styles that reflect Hip Hop such as breaking, funk styles (popping/locking), sub-styles (waves/ glides), commercial and street genres. </li><li>Learn several six – eight count routines so that you can improve your muscle memory and retention</li><li>Learn the vocabulary used within the various Hip Hop (Urban Street Dance) dance forms</li><li>Increase rhythmic awareness and the importance that musicality plays in street dance</li><li>Discuss the importance, meaning, and practice of “ Freestyle Dance” within Hip Hop culture</li></ul>\n\n\n\n<p><strong>Course Breakdown:</strong></p>\n\n\n\n<p>32 lectures</p>\n\n\n\n<p>5 hours of instructions</p>\n\n\n\n<p><strong>Course Requirements:</strong></p>\n\n\n\n<ul><li>A comfortable space or room to dance </li><li>Comfortable clothes to dance in  </li><li>A positive attitude </li></ul>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>What I Want You To Know:</strong></p>\n\n\n\n<p><strong>I want you to know that</strong>……There is a dancer in everybody!</p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>I want you to know that</strong>…… You must log into class, be ready work with a positive attitude and stay committed to developing into a Hip Hop dancer. </p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>I want you to know that</strong>……. I am devoted and dedicated to cultivating each individual students’ own artistic expression of dance. </p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>I want you know that</strong> …… Proficiency in dance comes from practice and no professional becomes an expert over night but from years of mastering their dance skills.  </p>", 
    "end_date": null, 
    "title": "Hip Hop Dance For Beginners with Cyrian Reed", 
    "price": "30.00", 
    "instructors": "Cyrian Reed, Emeroy Bernardo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664480_0ca5.jpg", 
    "course_url": "https://www.udemy.com/hip-hop-dance-for-beginners-with-cyrian-reed/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T08:56:47Z"
}