{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\t<strong>Updates:</strong>  </p>  <p><strong>Over 1,500 Students Enrolled with 13 five-star reviews!</strong></p>  <p>\t<strong>Course fully updated on June 2015.</strong>  </p>  <p>\t Did you miss you chance to learn breakdancing in the 80s? </p><p>Want to learn some of the moves you see on the movies and television such as Step Up and America's Best Dance Crew?</p>  <p>\t <strong>Join over 1500+ students who've successfully taken this course and go from zero to breakdancing hero.</strong></p>  <p>\t Whether you want to learn how to dance or simply just show of to friends, <em><strong>How To Breakdance Mini-Course</strong></em> will walk you through some of the most basic b-boy/break dancing moves that seem like magic to your audience.</p>  <p>\t Each lesson starts with a demonstration followed up with a breakdown of each move. Once you've gained a better understanding of each move, we put them together in a simple routine for you to practice!</p>  <p>\t<strong>What Will You Be Getting?</strong>  </p>  <p>\t You'll be gaining immediate access to over 22 lectures and 2+ hours worth of content, each lesson designed for you to learn easily. Using my 10 years as a dance crew director and dance instructor I've created clear and simple lessons which you'll find easy to understand, and more importantly, absorb.</p>  <p>\t If you want to quickly learn some awesome b-boy moves without having to spend a lot of money or hours in a dance studio, then this course is perfect for you.</p>  <p>\t<strong>What are the 3 Parts of Foundation B-Boying?</strong>  </p>  <p>\t The illusion for a lot of dancing is that people tell themselves that they can't do it. What they're seeing is simply the sum of it's parts. Everything is just a combination of smaller pieces. Foundation B-boying is broken down to three fundamental parts:</p>  <ol>\t<li>Top Rocks\t The part of b-boying where you're dancing up top. Think of this as your epic introduction to your dance.</li>\t<li>Footwork\t This is where you're showing of your fancy footwork on the floor making everyone think that this dance is complex, when in reality you know otherwise.</li>\t<li>Freezes\t This is the period at the end of every sentence. This is where you finish your dance not with a bang, but with a calm, cool, and controlled freeze.</li>  </ol>  <p>\t Throughout the 22 lectures you'll quickly learn:</p>  <ul>\t<li><strong>The elements of foundation breakdancing.</strong></li>\t<li><strong>The history of breakdancing.\t</strong></li>\t<li><strong>How to top rock, do foot work, and freeze</strong></li>\t<li><strong>How to piece all the moves together</strong></li>\t<li><strong>Methods to train at home so you improve faster</strong></li>  </ul>  <p>\t<strong>How long will the course take? </strong>  </p>  <p>\t The course can take about a month to really understand all the moves and another month to really master them depending on how much you practice.</p>  <p>\t The beauty of this course is that you can go at your own rate, build confidence in your dance, and show off to your friends and family.</p>  <p>\t I hope you guys enroll and find that this is the best mini b-boy course out there. If you have any questions, feel free to contact me!</p>  <p>\t Sign up for How To Breakdance Mini-Course and start getting' down today!</p>", 
    "end_date": null, 
    "title": "How To Breakdance Mini-Course", 
    "price": "30.00", 
    "instructors": "Emeroy Bernardo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/180268_cd8a_2.jpg", 
    "course_url": "https://www.udemy.com/b-boybreakdance-mini-course/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-11T09:09:17Z"
}