{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tThis is a Club Dance Crash Course you can digest in one sitting.  All the essentials you need to to help you look more cool, confident, and connect with people when you&#039;re out dancing.  </p>  <p>  \t Simple techniques anyone can learn even if you&#039;re not athletic, step by step instruction to get more coordination and comfortable in your body.  </p>  <p>  \t        Most of us just want to go out to socialize and dance when the situation calls for it.  We don’t want to be professional dancers, but we do want to be able to enjoy ourselves and not feel embarrassed when we&#039;re around people dancing.  </p>  <p>  \t   The problem is that many of us don&#039;t know how... and you may have already searched and been disappointed to see that most of the dance videos out there are for Ballroom dancing or Hip Hop choreography.  </p>  <p>  \t   These easy-to-learn moves will become your &quot;go to repetoire&quot; that you can show off anytime, anywhere!    Stop feeling left out and join the fun!    These moves were chosen specifically because they are fun and easy to learn even without ANY dance experience.  </p>  <p>  \t Learn the moves and use them TONIGHT to help you approach and attract successfully at clubs.    Many of the principles in these videos are focused on how to approach hotties on the dance floor so they welcome you.  </p>  <p>  \tBuild a connection through your dance moves then turn up the heat as you get intimate with them.    You can use these moves anytime at Bars, Clubs, Weddings, and Parties.    Gain the confidence to get over that self consciousness about looking silly not knowing what you’re doing.  </p>  <p>  \tYou’ll finally be able to enjoy going out and dancing, instead of holding your drink watching everyone else have all the fun.  </p>", 
    "end_date": null, 
    "title": "How To Club Dance-Crash Course For Men|Openers, Basic Moves", 
    "price": "40.00", 
    "instructors": "Chi Szeto", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367794_fbcf_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-club-dance-crash-course-for-men/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T03:53:21Z"
}