{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This video will take you from twerk fail to twerk pro even if you don't know the first thing about the moves.</p><p>  \t  Produced by the preeminent force in dance training Chi \"Club Dance King\" Szeto and taught by famous twerkers Kelsey Mobley and Kendra Oyesanya!  </p>  <p>  \t    Shake It Like You Mean It With Twerks  \t    That'll Do Your Booty Proud!  </p>  <p>  \t    Now's Your Chance To Shine.  </p>  <p>  \t    Dancing makes me feel SO <em>damn</em> free.  \t  \t    It's like flying – I get so high on the music.  \t  \t    Beats pounding, popping it with my girls, feeling the rhythm.  \t  \t    I wouldn't swap that feeling for anything. Powerful, sexy, strong – I love it.  </p>  <p>  \t    BUT Nothing In The ENTIRE WORLD Feels  \t    Worse Than Knowing You Can't Dance.  </p>  <p>  \t    Except when you realize that others know it too.  </p>  <p>  \t    It may only have been 1 year since Miley Cyrus brought twerking to the masses but I remember my first twerk in a freestyle, and I tell you girl it was NOT pretty.  \t  \t    It was like a bad high school movie.  \t  \t    Jerking and thrusting like a choking fish.  \t  \t    I'm serious! I can laugh now but looking back I remember the feeling of going home, standing in front of the mirror and feeling like a loser.  </p>  <p>  \t    Turns Out, Twerking Is EASIER Than It Looks!  </p>  <li>There's an easy way to get low without losing your balance!        •A small adjustment will stop your hips and pelvis aching.        •Transitions are easy when you break it down step by step        •There's a trick to ground twerking that just takes practice.        •Why your freestyle just looks clumsy?        Yes... Twerking is a skill. But it's just a dance move like any others you know. With a little bit of time and practice it's possible to put down the clumsy and freestyle like a pro!</li>  <p>  \t    Imagine If You Could Shake It Like Nicki Minaj?  </p>  <p>  \t    I'm serious girl!  \t  \t    Nicki's famous style is a credit to how much she practiced!  \t  \t    She features in her own and other videos and can <strong>OWN</strong> the center of any freestyle circle.  \t  \t    She shakes it like a pro because she is – imagine if you could do the same?  \t  \t    Imagine how it would feel to get off the sidelines?  \t  \t    You could finally become a dancer instead of a watcher.  \t  \t    You could take your place on the floor and feel like the powerful and sexy woman you are.  \t  \t    You could <strong>OWN</strong> it too!  </p>  <p>  \t    How Would It Be To NEVER Have To Go Through The Torture Of A Twerk Fail Ever Again…  </p>", 
    "end_date": null, 
    "title": "How to Twerk Dance, Twerk Tutorial - A Tale of Two Twerkers", 
    "price": "40.00", 
    "instructors": "Chi Szeto", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369882_e3f3_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-twerk-dance-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-14T02:21:47Z"
}