{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hello, my name is LaNaie and I will be teaching this Intermediate Hip Hop class!</p><p>I've danced since I was a baby, even though I didn't know how to actually dance, I used to bounce around and try to dance. I teach my friends and family how to dance a lot, too!</p><p>My ideal student is someone who likes to dance and they know how to dance, but they need practice, help, and motivation. They want to dance and they know to push themselves and they won’t give up. They won’t stop in the middle of the course because they can’t do it--they will keep on practicing. <br></p><p>I created this course with my Udemy mentor as part of the Spark Mentorship Program.</p><p>Spark is a national nonprofit that re-engages underserved seventh and eighth grade students, keeping them on track and ready for success in high school and beyond through workplace-based apprenticeships that uniquely combine mentoring, project-based learning, skill building and career exploration.</p><p><strong>In this class I’ll teach you:</strong><br></p><ul><li>how to stay motivated</li><li>how to count beats</li><li>to express yourself through dance</li><li>how to have confidence</li><li>how to go out in front of an audience without being shy</li><li>a new dance!</li></ul><p><strong><br></strong></p><p><strong>At the end of the class you’ll be able to:</strong></p><ul><li>know more dances</li><li>be better at dancing </li><li>know how to do the moves physically and full out. (In order to dance you have to have a lot of energy. You can’t do it half way.)</li></ul><p><strong><br></strong></p><p><strong>The structure of the course is:</strong></p><ul><li>First, I'll introduce the course, then I'll welcome you, then I'll give you my best tips to stay motivated and counts beats. </li><li>Next, I'll teach you the dance! Each lecture is two counts of 8. Because some people learn a little slower than others, I’ll go over the dance fast and then I’ll go over it slowly. </li><li>By the end, you'll know ten counts of 8 of the dance!</li></ul>", 
    "end_date": null, 
    "title": "LaNaie's Intermediate Hip Hop Class", 
    "price": 0, 
    "instructors": "LaNaie M.", 
    "commitment": "21 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673960_02b8.jpg", 
    "course_url": "https://www.udemy.com/lanaies-intermediate-hip-hop-class/", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T01:32:56Z"
}