{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\t     This is the 3rd Part of the &quot; Learn Ladies Styling for Salsa ON 1 and ON 2 Course.\r\n</p>\r\n<p>\r\n\t     SOY LATINA Ladies Styling Training Program\r\n</p>\r\n<p>\r\n\t     In this course you are going to take everything you have learned in the previous courses to another level by learning sexy and feminine Arm movements and their application to the Cuban Motion.\r\n</p>\r\n<p>\r\n\t     You will also start learning &quot;drills&quot; or exercises to prepare you for the steps you will learn and style in Part 4.\r\n</p>\r\n<p>\r\n\t <strong> SOY LATINA Ladies Styling Training Program</strong>\r\n</p>\r\n<p>\r\n\t  About SOY LATINA:\r\n</p>\r\n<p>\r\n\t  Soy Latina is a specially designed Ladies Styling Training Programme developed by one of the world’s top Latin Dance instructors, Irene Miguel. Soy Latina offers the most complete step-by-step Ladies Styling training program ever created. From Beginners to Advanced dancers as well as Teachers, this unique Training Program promises to develop your Ladies Styling so that you shine on the dance floor! With over 20 years of teaching experience, Irene Miguel has developed this special training programme for women of all levels, ages and abilities. Through Soy Latina you will gain a deeper understanding of Salsa Ladies Styling and will develop soft, feminine arm styling and movement to your dance. Soy Latina is divided in 3 levels; Foundation, Intermediate and Advanced. Each lesson relates to individual shines and partner work that will help you refine the smallest details of your styling and will make you look great when styling! After this course you will simply be the only one worth watching on the dance floor! So please shine responsibly!\r\n</p>\r\n<p>\r\n\t <strong> SOY LATINA - &quot;Impressive&quot; &quot;As good as it gets&quot;</strong>\r\n</p>\r\n<p>\r\n\t  Irene Miguel, one of the most creative forces in the world of salsa dancing, has just released her most ambitious home study guide for dancers yet. Here, she presents Soy Latina, a ladies&#039; salsa styling training programme, poured out over 8 hours of instruction and an impressive five DVD set.\r\n</p>\r\n<p>\r\n\t  The first course covers the fundamental principals of ladies&#039; salsa styling, including posture, Cuban motion, push, hand design as well as a store of arm positions, taught without and with music. On course 2, there are breakdowns of basic On1 and On2 footwork patterns, followed by footwork patterns with styling. Moving onto more advanced arm styling and shine work on course 3, Irene introduces her Danzalifestyle system, with its special accent on musicality and more.Time for dancers to go deeper on course 4, as Irene teaches a score of shines to suit a range of musical rhythms, all demonstrated without and with music. After all the intensive work-outs, dancers reap the reward on course 5. Here, Irene guides salseras through footwork and styling in partner-work. The culmination is instruction on how to marry up posture, hand and arm styling and Cuban motion with partner-work.\r\n</p>\r\n<p>\r\n\t  The setting is Irene&#039;s uncluttered studio, with all instruction given by Irene herself. Mostly, she teaches with her back to the viewer, facing a wall-size studio mirror, so you can pick up every detail. This gives the impression that this is for real - it&#039;s just you and Irene, in her studio, in a private one-to-one session. As good as it gets in terms of digital dance instruction. Well structured, with high production values, each section and disk building naturally from one to the next, this is suitable for women salsa/mambo dancers at all levels, from beginners to instructors.<br>\r\n\t  This course could serve a double purpose for dancers, as it has the potential to open up a new route to teaching. Irene is looking for dancers who excel at this foundation level programme to take on more advanced training, working towards qualifying as Soy Latina Ladies&#039; Salsa Styling teachers.For more information on becoming a Soy Latina instructor, Soy Latina workshops and intensive courses,\r\n</p>", 
    "end_date": null, 
    "title": "Learn Ladies Styling for Salsa ON 1 and ON 2. Part 3", 
    "price": "20.00", 
    "instructors": "Irene Miguel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/186548_0ffa_2.jpg", 
    "course_url": "https://www.udemy.com/soylatinapart3/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-21T17:10:09Z"
}