{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Course fully updated on May 2016.</strong><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">What's New:</strong></p>\n\n<p>Added May 2016:</p>\n\n<ul><li>Footwork drill with interval training to improve your speed and endurance.</li></ul>\n\n<p><strong>Learn how to breakdance in just 4 weeks!</strong></p><p><strong></strong>But first a few questions...</p>\n\n<ul><li>Are you worried about dancing because of your lack of rhythm?</li><li>Do you want to be able to show be the life of the dance floor?</li><li>Are you tired of looking through tutorial after tutorial?</li></ul>\n\n<p>\tI understand because I've been there.</p>\n\n<p>\tI know what it's like to just be a spectator while others got the attention.</p>\n\n<p>\tI know it's tough especially if you have no idea where to start.</p>\n\n<p>Or even worst...</p>\n\n<p>You don't have enough time.</p>\n\n<p>Whether you're a serious dancer or someone who just wants to learn some awesome moves, <strong class=\"redactor-inline-converted\">How To Break Dance For Beginners is perfect for giving you a jump start in learning the world's most athletic dance within minutes.</strong></p>\n\n<p>\tIf you've taken classes or watched videos but still feel like you're not getting anywhere, I don't blame you.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">Most teachers nowadays just show you how to do a dance move, but don't tell you anything about how to apply it in an actual situation where there's an audience.</strong></p>\n\n<p>\tLearning moves, practicing, and watching videos is great, but if you're not using any of it on the dance floor, it's pointless.</p>\n\n<p>\tSince 2009, I've been training hundreds of students from all ages to learn how to breakdance. </p>\n\n<p>I've also had the pleasure of dancing with crews such as Culture Shock, Mix'd Elements, Hit The Floor, and co-founding my team, Family Bizness.</p>\n\n<p>Based on my dance and teaching experience, I show you guys the bits and pieces of of what makes this dance unique and how exactly what I do to make this dance my own.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">\"Emeroy is a very motivated and driven instructor and director who always ensures that his students gain a full knowledge and understanding of any dance style he teaches, including terminology and the history. He also teaches his students valuable life lessons as he makes them better dancers, teammates, and individuals.\"  </strong></p>\n\n<p><strong class=\"redactor-inline-converted\">\t-Stephanie Hagberg, </strong><strong class=\"redactor-inline-converted\">Breed Dance Crew, Culture Shock Dance Troupe</strong>  </p>\n\n<p>\t<strong class=\"redactor-inline-converted\">Each lesson gives you a brief demonstration of the move along with detailed, step-by-step instruction in how to perform them.</strong> Not only that, each move is shown in different angles so you can fully understand what you're doing at all times.</p>\n\n<p>Once you better understand those moves, I show you how to put them together.</p>\n\n<p>\tToday you can learn how to breakdance at home without ever stepping foot into a dance studio and with ZERO experience.</p>\n\n<p>\tYou're goal is to learn the moves that you like and easily create a combination that you can easily show off to your friends, family, or audience.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">Like I said, no experience needed.</strong></p>\n\n<p>\t<strong class=\"redactor-inline-converted\">Imagine...</strong></p>\n\n<ul>\t<li>Being the center of attention when people see you on the dance floor.</li>\t<li>Confidence on the dance floor beyond you've ever imagined</li>\t<li>Being able to look like you've been working at it for months, when you've only been working at it for weeks</li>\t<li>How badass you would feel when people see you</li>  </ul>\n\n<p>\t<strong class=\"redactor-inline-converted\"><em>\"When I was his student, he would continuously push me and my teammates to keep going until we finish; \"No pain, no gain.\" Having him as a dance coach has taught me that nothing in life comes easy. You get what you receive through the amount of work you put in it.\"</em>  </strong></p>\n\n<p><strong class=\"redactor-inline-converted\">\t-Jazlynn Pastor, </strong><em><strong class=\"redactor-inline-converted\">Marvels Dance Crew</strong></em>  </p>\n\n<p>\t<strong class=\"redactor-inline-converted\">How To Breakdance For Beginners Will Show You...</strong></p>\n\n<p>\t<strong class=\"redactor-inline-converted\">1. The Basics</strong></p>\n\n<p>\tThis is where you learn the most important part of ANY b-boy/b-girl/breakdancer, warm ups so you don't get injured, the basic groove so you don't look stiff, and the history so you understand the mentality of a b-boy.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">2. Top Rocks</strong></p>\n\n<p>\tThis is the part of b-boying/breakdancing where you're still dancing on two feet. This is where you introduce to others who you are and let your character shine.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">3. Transition Moves/Go Downs</strong></p>\n\n<p>\tThis is where you go from the top and transition to your footwork with some style.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">4. Footwork</strong></p>\n\n<p>\tThis is where you're using both your hands AND your feet to make footwork patterns that dazzle your audience.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">5. Freezes</strong></p>\n\n<p>\tThis is the period or the exclamation point at the end of your sentence. How dynamic you want to finish is completely up to you.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">6. Power Moves</strong></p>\n\n<p>\tThis element of breaking is what brought it's popularity. Adding this to your repretoire will give you athleticism that will compliment your smooth footwork, controlled freezes, and dynamic top rocks.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">7. Concepts and Exercises</strong></p>\n\n<p>\tThis is where you start learning how to start taking all the moves you learned and start piecing them as one fluid motion so when you perform in front of an audience you're focused more on having fun instead of thinking about the moves.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">8. Bonuses</strong></p>\n\n<p>\tI give you guys music, behind the scenes training with a student, my practice methodology so you guys can improve much quicker, and much, much more.</p>\n\n<p><strong class=\"redactor-inline-converted\">9. A Step-By-Step Cirrculum to Get You Started</strong></p>\n\n<p>Have no idea where to get started? Start off at Day 1 and start learning. By the end of it, you'll have your own combination you can show off to friends.</p>\n\n<p><strong class=\"redactor-inline-converted\">10. A Massive Library of Moves</strong></p>\n\n<p>Need a little variety in your step? Check out the massive library of moves that you can use in your combinations.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\"><em>\"</em><em>Emeroy</em><em> makes sure he always delivers and gives amazing product. He will guide you the best way he can to make you understand what your learning. What's great about him is that he's always prepared.\"</em>  </strong></p>\n\n<p><strong class=\"redactor-inline-converted\">\t-Marc Miranda, </strong><em><strong class=\"redactor-inline-converted\">Family Bizness Dance Crew</strong></em>  </p>\n\n<p>\t<strong class=\"redactor-inline-converted\">How Long Will This Course Take?</strong></p>\n\n<p>\tThe beauty of How To Breakdance for Beginners is that you can go at your own rate. </p>\n\n<p>This course has packed a years worth of moves for you to practice. </p>\n\n<p>You can get pretty good at this dance within a month with only a FEW of the moves. </p>\n\n<p>You don't need to know how to do every single move listed, you just need to know enough to enjoy.</p>\n\n<p>\tIn this course I show you how my method in piecing everything together so you start creating your own flow in this dance.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">I also give you the a 30 Day guarantee. I believe so strongly in this course that you will love what you'll learn within the next 2 hours.</strong></p>\n\n<p>\tWhat's the difference between this and How To Breakdance Mini-Course?</p>\n\n<p>\tThis course offers you more moves to learn and concepts in how to build confidence in your skills. How To Breakdance Mini-Course was just a taste for what you can create.</p>", 
    "end_date": null, 
    "title": "Learn How to Breakdance and Rule The Dance Floor", 
    "price": "50.00", 
    "instructors": "Emeroy Bernardo", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184124_7c5d_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-breakdance-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-17T19:45:13Z"
}