{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">Easy2Wave</em></strong> is a streetdance course for beginners, which focuses specifically on teaching the basics and fundamentals of how to wave and the waving concept. Each move will be taught in a step by step way making it easier to learn.  </p>  <p>  \t       This is a great course for anyone who is interested in learning other styles within streetdance such as waving and it will increase your street dance repertoire.  </p>  <p>  \t       The aim of this course is not just to teach you the basics and fundamentals of how to wave but also this course will teach you how to be creative with your waving.  </p>  <p>  \t<strong style=\"\"><em style=\"\">   In this course you will be learning</em></strong>:  </p>  <p>  \t       • Step by Step how to wave including how to arm wave, body wave and combining both arm wave and body wave together  </p>  <p>  \t     • How to be creative with your waving using a number of variations of the arm wave, body wave, and combination of both wave types  </p>  <p>  \t     • Creative ways on how to make you’re waving more entertaining and unpredictable.  </p>  <p>  \t     • An insight on how to freestyle wave.  </p>  <p>  \t       You can go through this course at your own pace; so if you are interested in learning the art of waving, then enrol in this course where you will learn step by step how to wave and how to be creative with your waving.  </p>", 
    "end_date": null, 
    "title": "Learn How To Wave|Easy-2-Wave (Street Dance Course)", 
    "price": 0, 
    "instructors": "Lolu Fenuyi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426260_824c_5.jpg", 
    "course_url": "https://www.udemy.com/easy2wave/", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T20:39:32Z"
}