{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>    </p><p>If you like the course please give us a rating and a review!&nbsp; Spread the word!</p><p><span>This course goes over the many different ways you can slide  and glide around the dance floor, including Michael Jacksons famous “moonwalk”.  You will be taught exercises, drills and vocabulary moves ranging from complete  beginner to intermediate moves.&nbsp;</span><br style=\"\"></p>    <p>Rob (the instructor) teaches from his home town dance studio  and includes slow motion, varied angles, close ups and annotations to help  improve the learning.&nbsp; You will need to  put the practice in and also stop and rest when you need to, as the moves are  quite intensive on certain leg muscles.&nbsp;  The course lasts approx. 1 hour, and will really help those who are  trying to understand exactly how the illusion of the slide/glide actually  works.</p>    <p>Rob is also available for any questions regarding the video  so if there is anything you are stuck on then just ask!</p><p>    </p><p>The thing with gliding is that it looks easy, but at first  it really isn’t.&nbsp; Don’t expect results  too quickly and don’t be disappointed if you don’t see an improvement as soon  as you would like.&nbsp; Keep practicing, take  your time and with discipline and perseverance (like most things in life) you  will get there!</p>    <p>If you like the course please give us a rating and a review!&nbsp; Spread the word!</p>  ", 
    "end_date": null, 
    "title": "Learn how to street dance - Slides and Glides (Moonwallking)", 
    "price": "20.00", 
    "instructors": "Smoov  Groove", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50027_3e56_4.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-street-dance-slides-and-glides-moonwallking/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-16T09:41:49Z"
}