{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t    Want to learn more? Check out the &quot;what you&#039;ll learn preview&quot;.  </p>  <p style=\"\">  \t     Learn locking easily and rapidly today! This course is about guiding someone with no dance experience to a good locker as fast as possible. You&#039;ll learn the important details and practice methods of every move, along with how to become a creative locker.  </p>  <p style=\"\">  \t       Why learn Locking? Maybe you just want to learn a new style of dance. Or, maybe you want to perform or bust out funky moves on the dance floor. There are tons of possibilities for where to Lock! You can Lock at parties, in the club, in talent shows, at weddings, at the mall, and basically anytime a remotely funky song comes on.  </p>  <p style=\"\">  \t              This course contains the tutorial videos I wish I had when I first started out. These videos are only available on Udemy. What&#039;s more, the course costs less than the price of a 1-on-1 dance class in NYC.  </p>  <p style=\"\">  \t              If you want to see locking in action, check out the pros. Search up on YouTube: &quot;Hilty and Bosch Locking&quot; or &quot;locking khan korea&#039;s got talent&quot;.  </p>  <p style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \t               In this course, you&#039;ll learn all of the basic to advanced moves. I start out teaching you how to best practice dance and get good quickly. Then, the course is structured so that the harder moves build on the more basic, making your learning straightforward and incremental. Locking combinations are interspersed in the course to help you synthesize what you&#039;ve learned.<br style=\"\">  \t<br style=\"\">  \t               This is how a lesson goes: each lesson begins with a demonstration of the move, so you know what you&#039;ll learn. Then, the move is deconstructed and explained, we do it together to a slow count, and finally at full speed to the music. Often times, I&#039;ll show you variations.  If a move is relatively harder, there will be practice methods in the break down to help you master it.  </p>  <p style=\"\">  \t       How long will the course take? The course can take 2 months, or a year to complete, depending on how much you practice. Don&#039;t worry if it takes some time though. Learning to dance requires both your brain and body to adjust. Bottom line is, it&#039;s an online course and you can progress at your own pace.  </p>  <p style=\"\">  \t              I hope you decide to enroll in what I truly believe is one of the best online sources for learning locking. If you have any questions, feel free to reach out.  </p>", 
    "end_date": null, 
    "title": "Learn Locking | A hip-hop funk dance", 
    "price": "30.00", 
    "instructors": "Ernest Chan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131048_6c62_4.jpg", 
    "course_url": "https://www.udemy.com/learn-locking/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-08T21:30:12Z"
}