{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This <strong>FREE </strong>course is a<span> <strong>lecture</strong> and there are no dance steps in this course. Please keep that in mind before you enroll . <strong></strong><span></span></span></p><p>This is a course on the four basic techniques that comprise the style of dancing called Popping.  We call it the Core 4 System. These four techniques form the basis of popping and act as a foundation for all further learning. </p><p>We will cover:</p><ul><li>Hitting: Also referred to as popping which is the contraction of key muscle groups.</li><li>Waving: Basic joint isolation that gives the illusion of traveling motion across your body.</li><li>Tutting:  Covers the movement of arms and hands to create ninety degree angels.</li><li>  Mind Set: We talk about ways to combine the first three techniques in order to create your own  personal style. </li></ul><p>This series of introductory videos cover the theory behind our teaching system and why we believe that these four elements make up the basis of Popping.  Then there are separate detailed explanation for Hitting, Waving, Tutting and Mind Set.  We also have a final lesson in this series that talks about how to use your newly learned techniques as a beginner and how to practice. Or for seasoned dancers how to apply your new moves to what you already know.  The course will take about 30 minutes to complete.</p><p>If you are just trying popping for the first time this is an excellent   resource for you.  This set of  videos talk about the moves that form the basis of all other   popping techniques. Once mastered these can be used to learn more   advanced styles and moves.  We will be adding more videos to this course . So watch often and practice to your favorite funk songs!</p>", 
    "end_date": null, 
    "title": "Popping dance tutorial | How to get started | Core 4 Basic", 
    "price": 0, 
    "instructors": "Popping Dance Academy", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443964_807f_2.jpg", 
    "course_url": "https://www.udemy.com/popping-dance-tutorial-core-4-basic/", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T17:35:22Z"
}