{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>My course is going to give you a solid foundation to grow as a Salsa dancer. I won&#039;t teach you to dance like me, but I teach you to dance like YOU and find your own rhythm, style, and fulfill your dancing potential! My goal in building this course is to help you to recognize your natural dancing capabilities make sure you feel confidence every time you get on the dance floor.</p><p>With the strong foundation you will build by taking this Salsa dancing course, you definitely will not feel shy anytime you go out. After taking this course you do not have to be worry about stumbling, bumbling or looking silly on the dance floor. Most importantly, my course will help you to build confidence and guide you on your journey to connect with yourself and incorporate your personality into your dancing.</p><p>A lot of people asked me why I dance Salsa. When I dance salsa, I feel free. I get lost in the music. I can just feel my body moving with the beat when I am following the lead or taking charge and leading my partner. For me Dancing is more like a form of meditation than a physical skill. Every time I dance I get a different feeling I feel excited, happy, fun, sensual, or sometimes even romantic. Every dance invokes a different feeling and no two dances are the same, even with the same partner I get a different feeling every time.</p><p>Your goal in taking this course might be to learn how to dance Salsa but my goal as an instructor is to share with you my passion for dancing and give you all the tools you need to go from Start-to-Star in no time!</p><p>I am Sita Sojintarit but you can call me “Gift.” I&#039;m a professional dancer, instructor, and choreographer. I majored in dance at the prestigious Slippery Rock University at Pennsylvania State and I have been dancing for more than 15 years. I specialize in latin dances such as Salsa and Bachata. And in this course, i&#039;m going to teach you how to dance Salsa like you have been doing it for years.</p><p>So what are you waiting for? </p><p>Come join me inside the course and we can we get started right away!</p>", 
    "end_date": null, 
    "title": "Salsa dancing from Start-to-Star!", 
    "price": "25.00", 
    "instructors": "Sita Sojintarit", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482918_4aae.jpg", 
    "course_url": "https://www.udemy.com/salsa-dancing-from-start-to-star/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T06:27:43Z"
}