{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Course Description </p><p style=\"\"><strong>My Musicality classes have </strong><strong>been taken by many students locally and across the world at some of the best Bachata Congresses and Festivals.</strong></p><p style=\"\"><em>LATEST: Course Fully Updated!</em></p><p style=\"\"> Start learning how to listen to Bachata Music with no experience whatsoever, immediately. <em><strong>Nothing to lose. Learn from anywhere in the world.</strong></em></p><p style=\"\"> Nothing is needed - Just your ears and little dance space so you can practice along with the videos. </p>+++++++++++++++++++++++ <p style=\"\"> About this course: </p> <ul><li><em>Many happy and VERY satisfied students after taking this course.</em></li><li><em>Nothing is required.</em></li><li><em>Full, free lifetime access.</em></li><li><em>All future extra lectures and upgrades are always included for free.</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li><li></li></ul> <strong>LEARN HOW TO \"FEEL THE MUSIC\"</strong><p style=\"\">When I started learning how to dance, I had friends telling me to just \"Feel the Music.\" I had a hard time understanding what that meant and I explain exactly how to do it in this course.<br style=\"\"></p><p style=\"\"> Today, you can start to learn how to transform the way you listen to music - and with ZERO prior experience! You will start hearing the things we discuss in this course on the first Bachata song you listen to!</p><p style=\"\"> Your initial goal is practice all of the steps discussed to improve your Bachata Musicality. </p><p style=\"\"> <strong>You will need no partner to learn the topics discussed or huge amount of dance space</strong> - I show you how to instantly identify the different instruments in Bachata, Learn about patterns in the music ... and I go into full detail showing exactly how you, like me, can learn Bachata musicality by listening to Bachata in different ways.</p><p style=\"\"> I stress that you need no prior experience and there's nothing extra to buy or pay for. Nothing! </p><p style=\"\"><strong><em> You'll learn: </em></strong></p> <ol><li><strong><em>Basic Bachata Instruments. (Bongo, Bass Guitar, Rhythm Guitar, Lead Guitar, Guira, and Vocals.)</em></strong></li><li><strong><em>How to count, Stay on time throughout a whole song.</em></strong></li><li><strong><em>Learn what a 9 Bar Phrase is and how to fix it. </em></strong></li><li><strong><em>About the layout of Bachata Songs. (Majao, Derecho, Mambo.)</em></strong></li><li><strong><em>How to play with accents or hits in the music.</em></strong></li><li><strong><em>Tips and Tricks on how to know expect things coming in a song you have only heard for the first time.</em></strong></li><li><strong><em>How to \"feel the music\"</em></strong></li></ol><strong><em></em></strong><p style=\"\"><strong><em>... and much, much more!</em></strong> </p><p style=\"\"> So, you've read this far! Thank you. </p><p style=\"\"> <em>One final very important point</em>. </p><p style=\"\"> Click the \"take this course\" button, top right, now ... Don't let this opportunity pass you by! Everyday without this information is a day lost! </p>  ", 
    "end_date": null, 
    "title": "Secrets to Learning Bachata Musicality with Guided Practice!", 
    "price": "50.00", 
    "instructors": "Demetrio Rosario", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582492_6c6b_2.jpg", 
    "course_url": "https://www.udemy.com/bachatamusicality/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T21:13:39Z"
}