{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  Este curso está pensado para que tu empieces a ganar segurdad en tus pasos.  </p>  <p style=\"\">  \t  Si quieres mejroar tu fomra de caminar con so tacones y caminar como una DIOSA.  </p>  <p style=\"\">  \t  Este es tu curso....  </p>  <p style=\"\">  \t  ¿Tienes tacones que nunca te pones poruqe no te sientes segura?  </p>  <p style=\"\">  \t  ¿Te apasionan los tacones y te gustaría caminar de una fomra excelente?  </p>  <p style=\"\">  \t  Irradia pasión, poder, fuerza, liderazgo en cada paso que des en la oficina, en casa, en tus reuniones laborales y sociales..... Camina con tacones de fomra inteligente  </p>  <p style=\"\">  \t Cada semana actualizaremos la parte final para qeu recibas los vídeo-trucos para que tu forma de caminar sea lo más segura e inteligente para que solo así puedas caminar como una auténtica DIOSA que eres.  </p>  <p style=\"\">  \t Este curso tiene algo especial y es que por la compra del curso, vas a tener acceso a tres clases on-line con Alina Heels con material extra que solo obtendrás on-line en vivo en esas clases. Por lo que esto es más que un curso, esto es una trnsformación de tu forma de caminar, de tu actitud y de tu poder!  </p>  <p style=\"\">  \t Empezamos a ser diosas?  </p>  <p style=\"\">  \tADEMÁS Tienes un increible BONO:  </p>  <p style=\"\">  \t2 clases on line en vivo conmigo!! Donde repasaremos y añadiré más lecciones...  </p>  <p style=\"\">  \tCUANDO? el 12 de Julio y el 28 de Agosto!  </p>  <p style=\"\">  \tNOS vemos dentro!  </p>", 
    "end_date": null, 
    "title": "Sin La Muerte Por Tacones", 
    "price": "20.00", 
    "instructors": "Coach postural y mov. consciente Alina Heels", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235924_bf68_2.jpg", 
    "course_url": "https://www.udemy.com/sin-la-muerte-por-tacones/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T21:35:36Z"
}