{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course students will learn Ekonkon dance and the Kutiro drum rhythm as rendered by the Jola people of Senegal (Casamnce) West Africa. Students will begin with a slide presentation discussing the history of the Ekonkon dance, the region and people who perform the dance, when and for what occasion the dance is rendered. Next is a series of demonstration videos of the natural dance movements of the Ekonkon dance technique, followed by the solo Ekonkon movements and lastly a video with live drummers playing the Ekonkon rhythm on Kutiro drum. Further, an example of the call by the drummer to begin and/or change movement, known as a “break”  will be demonstrated. As a bonus  there is a video that demonstrations the formation of a <strong>Bantaban </strong>(circle), which is where dancers gather together and demonstration their knowledge of the technique and movements in a compilation of movements put together in improvisation, beginning with the Ekonkon song and accompanied by the drummers.</p>\n\n<p>By the end of this lecture students will know the history behind the movements in the Ekonkon dance, understand the purpose of the movements, can sing the Ekonkon song, have experience in how to execute the movements, understand the rhythm and recognize the 'break\" in the rhythm, and have the ability and skill to attend and participate in a West African dance class with confidence.</p>", 
    "end_date": null, 
    "title": "West African Dance I", 
    "price": "40.00", 
    "instructors": "Bakara Johnson", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620012_a4e7.jpg", 
    "course_url": "https://www.udemy.com/west-african-dance-1/", 
    "currency": "USD", 
    "subject_name": [
        "Dance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T04:54:32Z"
}