{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Africa as a continent is rich in natural resources and minerals and has increasing rates of wealth in some countries. The course will explore why there continues to be many sub-Saharan African countries which perform poorly on development indicators for reducing poverty, hunger and unemployment and improving maternal health and access to quality reproductive health services.\n\nExplore sustainable development and the post-2015 agenda\n\nThis free online course will assess progress made to date in the achievement of the UN Millennium Development Goals and will provide information from key people in international development to discuss whether the proposed UN post-2015 sustainable development agenda can be achieved in sub-Saharan Africa.\n\nThe course is designed for anyone with a passion for humanity, human rights and sustainable development. You will learn to think critically and communicate effectively about development stories, past, present and future.\n\nWe will introduce the key concepts in sustainable development, the historical background and current context. You will look at the organisations involved in development and how they have changed over time.\n\nWe will also explain how development data are constructed, and the strengths and limitations of different types of evidence. We will highlight who has been counted in development data, how robust the data are and who is missing from data sets.\n\nLearn with experts in sub-­Saharan Africa\n\nYou will learn with experts from the University of Aberdeen Centre for Sustainable International Development (CSID), who have extensive experience of living and working in sub­-Saharan Africa.\n\nThey will bring a multi-sectoral and interdisciplinary perspective to the course, recognising that a range of approaches is required, to tease out the complexity of sustainable development and help us understand why inclusive development has not yet been realised.\n\nThe course will use academic texts alongside films, music and novels, enabling you to analyse different ways of seeing, listening and experiencing received wisdoms about development. You will also get the opportunity to discuss your own experiences with other learners worldwide and to learn from experts from the UN, national governments and development partners from sub-Saharan Africa.  These experts include: Madame Zainab Hawa Bangura (UN Secretary-General Special Representative on Sexual Violence in Conflict); Dr Agnes Binagwaho (Minister of Health, Rwanda); Sir Malcolm Bruce (Chair of the UK Parliamentary Select Committee on International Development); and an ex-President of Nigeria, Olesegun Obasanjo.\n\n\n                                    ", 
    "end_date": "2016-03-07T00:00:00Z", 
    "title": "Africa: Sustainable Development for All?", 
    "price": 0, 
    "instructors": "Hilary Homans", 
    "institution_name": [
        "University of Aberdeen"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/africa-sustainable-development?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-01-25T00:00:00Z"
}