{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Learning Objectives:\r\nO objetivo geral do curso Alterações Climáticas: o contexto das experiências de vida é introduzir o conceito de alterações climáticas no contexto do desenvolvimento sustentável, relacionando-o com as experiências vivenciadas por cada um de como, por exemplo, adaptar e mitigar os seu efeitos, relacionados com cheias, falta de água, subida no nível do mar, erosão costeira, e outros.\r\nAssim, algumas das questões fundamentais que se procuram desenvolver neste curso são:\r\nComo é que as alterações climáticas estão, e poderão vir, a influenciar a nossa sociedade e o nosso dia-a-dia?Como podemos avaliar o que nos é dito sobre o que fazer relativamente às alterações climáticas, de modo a tomarmos as nossas decisões de uma forma racional e informada?Como é que as nossa tomadas de posição e comportamentos podem influenciar o futuro da sociedade e do planeta?Com este curso não se pretende determinar o que deve ser feito, mas ajudar-vos a compreender e a analisar criticamente as orientações elaboradas sob uma diversidade de perspetivas. Abordaremos, então, a vertente da ciência, da política, da economia e a componente social das alterações climáticas, assim como a sua ligação com a sustentabilidade.\n\n                                    ", 
    "end_date": "2016-06-01T00:00:00Z", 
    "title": "Alterações Climáticas: o contexto das experiências de vida", 
    "price": 0, 
    "instructors": "Paula Nicolau", 
    "institution_name": [
        "Universidade Aberta"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://platform.europeanmoocs.eu/course_alteraes_climticas_ligando_cin", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "EMMA"
    ], 
    "start_date": "2016-04-06T00:00:00Z"
}