{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    No region on Earth is immune from natural disasters. As we gain scientific understanding into the causes and nature of such phenomena, we become better able to mitigate the effects of disasters. Yet as the world's population continues to grow, an increasingly large number of people are at risk.\n\nThis science course examines different types of natural disasters and our ability, or inability, to control and predict such events. You will gain an appreciation of natural disasters beyond the newspaper headlines, and will better understand how the effects of disasters can be reduced.\n\nThere is an urgent need for people from all walks of life to better understand the scientific principles behind the occurrence of natural disasters:\n\nCity planners need to know where, and where not, to site buildings.\n\tPoliticians need to make scientifically informed decisions.\n\tEmergency management officials need to understand the nature of a potential disaster and ways to mitigate such an event.\n\tJournalists need to report scientifically accurate information.\nLearner Testimonial:\n\n“Professors Stix and Gyakum have created and presented an engaging course, and have helped in my quest for a better understanding of the world around me.” – Previous Student\n\n                                    ", 
    "end_date": "2016-04-13T00:00:00Z", 
    "title": "ATOC185x: Natural Disasters", 
    "price": 0, 
    "instructors": "John Stix and John Gyakum", 
    "institution_name": [
        "McGill University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/natural-disasters-mcgillx-atoc185x-1", 
    "duration": "13 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-13T00:00:00Z"
}