{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    La France a été officiellement nommée pays hôte de la 21e conférence climat en 2015 (Paris 2015/COP21). Selon les experts, «le réchauffement du système climatique est sans équivoque».Des changements profonds sont désormais inéluctables, bien qu’il existe encore des incertitudes sur leur ampleur. Face à ce changement de climat qui affectera de nombreux secteurs d’activités, l’adaptation de notre territoire et de la planète au changement climatique est devenue un enjeu majeur qui appelle une mobilisation nationale et internationale.Le MOOC «Causes et enjeux du changement climatique», produit et coordonné par l'Université Virtuelle Environnement et Développement durable (UVED), vise à tracer un tableau général du problème du changement climatique, en donnant aux apprenants des éléments suffisants pour être capables d’opposer une réflexion personnelle aux polémiques multiples qui ont entouré ce problème. Il se développera en trois temps, de durées inégales :\r\n\r\nQu’est-ce que le climat et comment peut-il changer ;\r\nAgir en réduisant les émissions de gaz à effet de serre ;\r\nAgir en s’adaptant aux changements climatiques.\r\n\r\nLes parties 2 et 3 s’articuleront avec des éléments plus politiques concernant les négociations internationales, mais en se limitant à décrire l’interface entre diagnostic scientifique et demande sociétale.Hervé Le Treut, professeur à l'Université Pierre et Marie Curie et à l'École Polytechnique, directeur de l'Institut Pierre-Simon Laplace, en est le référent scientifique et Jean Jouzel (CEA) en est le parrain.36 experts-scientifiques issus de 17 établissements différents sont impliqués dans ce projet.\n\n                                    ", 
    "end_date": "2015-11-30T00:00:00Z", 
    "title": "Causes et enjeux du changement climatique", 
    "price": 0, 
    "instructors": "Nadia Maïzi, Pascale Braconnot and Sylvie Joussaume", 
    "institution_name": [
        "UVED"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/uved/34003/session01/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-10-19T00:00:00Z"
}