{
    "selfpaced": true, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Environmental problems do not recognize geographic or disciplinary boundaries. In order to develop sustainable solutions to environmental challenges we must incorporate the natural and social sciences and also deeply engage local communities. Through the lens of coastal systems and the human communities dependent upon them, we will explore how coupled human-natural systems interact. Participants will be introduced to fundamental concepts in coastal environmental science and will learn how to collect and evaluate data to solve real-world local environmental problems.\r\nIntroduction to Coastal Environmental Science Lab\r\nUnique to this course is the infusion of real environmental scientists who will introduce you to their work in the coastal environments of Massachusetts and guide you in lab and field activities to help you apply in practice concepts from a broad array of topics introduced in the course.\r\nThe course is free as a non-credit open course. The course may be taken for credit by registering through UMass Boston (details below).\r\nPrerequisites\r\nThe course is best suited for high school seniors and learners with an undergraduate level understanding of environmental science, but is open to everyone interested in the field.\r\n \r\nFor a sample of topics explored in the course, explore this map with video lectures from the Fall 2013 offering of the course, grouped in five main topics:\r\n\r\nThe Natural History of Your Place\r\nThe Human History of Your Place\r\nHow Healthy is Your Living Environment?\r\nHow Can We Adapt to Climate Change?\r\nHow Can We Scale from Local to Global to Local?\r\n\r\n \n\n                                            Syllabus\n                        \r\n\r\n\r\nWeek 1              \r\nTopic\r\nThe Natural History of Your Place\r\n\r\n\r\nLab\r\nSampling Biodiversity\r\n\r\n\r\nWeek 2\r\nTopic\r\nThe Human History of Your Place\r\n\r\n\r\nLab\r\nEcoBeaker\r\n\r\n\r\nWeek 3\r\nTopic\r\nHow Healthy and Resilient is Your Environment?\r\n\r\n\r\nLab\r\nWatersheds and Topographic Maps\r\n\r\n\r\nWeek 4\r\nTopic\r\nGlobal Change and Variation\r\n\r\n\r\nLab\r\nThe Rock Cycle\r\n\r\n\r\nWeek 5\r\nTopic\r\nHow Can We Scale from Local to Global to Local?\r\n\r\n\r\nLab\r\nWeather\r\n\r\n\r\nWeek 6\r\nTopic\r\nHow Can We Respond and Adapt to Changes?\r\n\r\n\r\nLab\r\nEnergy\r\n\r\n\r\n\n                                    ", 
    "end_date": "2014-08-25T00:00:00Z", 
    "title": "Coasts and Communities", 
    "price": 0, 
    "instructors": "Dr. Robyn Hannigan and Dr. Anamarija Frankic", 
    "institution_name": [
        "University of Massachusetts Boston"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://openeducation.blackboard.com/mooc-catalog/courseDetails/view?course_id=_161_1", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open Education by Blackboard"
    ], 
    "start_date": "2014-07-14T00:00:00Z"
}