{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Introduction to Environmental Science, ENVX, was first offered in early 2015.\n\nEnvironmental science is the study of patterns and processes in the natural world and their modification by human activity.  To understand current environmental problems, we need to consider physical, biological and chemical processes that are often the basis of those problems. This course will give you the skills necessary to address the environmental issues we are facing today by examining scientific principles and the application of those principles to natural systems.  This course will survey some of the many environmental science topics at an introductory level, ultimately considering the sustainability of human activities on the planet.\n\nEnvironmental impacts on Earth come from the number of people and the amount and types of resources that they use. By applying scientific principles and considering real-world examples, we will examine:\n\nThe field of environmental science and how to think like an environmental scientist\n\tThe human population and the ways in which changes in the population affect the environment\n\tAgriculture, soils and the environmental implications of eating meat, vegetables, local, organic, sustainable, industrial and other types of food\n\tNon-renewable fossil fuels with a focus on coal, petroleum and natural gas and the benefits and consequences of using each\n\tRenewable fuels such as wind and solar and identify that even renewable “green” energy sources have impacts as well as benefits\n\tBiodiversity and global change, which are the integrating units of environmental science\nEducation method\nThe course will utilize video lectures, interviews with experts, readings, discussions, multiple choice and prompted discussions and one graded quiz per week. There will also be several optional live office hours on Google Hangouts.\n\nCompletion of self-assessments, contributions to discussion and quiz scores will determine the final grade. \n\n                                    ", 
    "end_date": "2015-07-13T00:00:00Z", 
    "title": "DART.ENVS.02X: Introduction to Environmental Science", 
    "price": 0, 
    "instructors": "Andrew J. Friedland", 
    "institution_name": [
        "Dartmouth"
    ], 
    "commitment": "5 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/introduction-environmental-science-dartmouthx-dart-envs-02x", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-06-15T00:00:00Z"
}