{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    More than 2.5 billion of the world’s poor rely on agriculture for their livelihood. Helping these smallholder farmers gain access to better products and inputs has the potential to improve their lives permanently. When farmers grow more food and earn more income, they are better able to provide for their families, send their children to school and invest in improving their farms. Growing Prosperity: Developing Repeatable Models To Scale The Adoption of Agricultural Innovations, a new report by Acumen and Bain &amp; Company produced with support from the Bill and Melinda Gates Foundation, unveils how social enterprises can find new, effective ways to profitably serve these hard-to-reach customers at scale. Based on extensive research conducted in five countries across South Asia and Sub-Saharan Africa, including interviews with more than 300 smallholder farmers, Growing Prosperity proposes how these companies can give poor customers much-needed access to the right products and services at the right time to help pull them out of poverty.\r\nIn this short course, you’ll hear directly from the authors about the report’s highlights and the new frameworks they developed.  You’ll also begin to explore ways you can apply these tools and insights to your own work to scale adoption of products and services at the base of the pyramid. This is the first in a series of short courses based on the report.\r\nYOU'LL LOVE THIS COURSE IF:\r\n\r\nYou are looking to achieve positive change in the world and scale your approach across markets\r\nYou are curious about how social sector organizations can apply cutting edge business principles and models\r\nYou want to learn about approaches to scaling adoption of products or services at the bottom of the pyramid\r\nYou are working to improve the livelihoods of smallholder farmers by introducing new agricultural innovations\r\n\r\nWHAT YOU'LL LEARN:\r\nBy the end of this course, you will be able to:\r\n\r\nExplain the challenges of scaling adoption of agricultural innovations\r\nUnderstand the basics of the “4As to Adoption” framework and the repeatable models framework\r\nArticulate key insights about how to spur greater adoption of innovative products and services among some of the world’s poorest customers\r\n\r\nHOW THE COURSE WORKS\r\nThis is a +Acumen short course that will take approximately 2 hours to complete.  The course materials will remain open and you can come back to it at any time.\r\nThere are no in-person teachers or facilitators for this course, but we will have technical and subject matter experts available to assist you online. You can take this course either in a group or on your own. The course will be offered through a third party learning platform called NovoEd.\r\nCourse content will consist of a recorded webinar, readings, and a short assignment. You can take this course with a group or individually.\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Developing Repeatable Models® to Scale Your Impact", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "+Acumen"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://plusacumen.org/courses/growing-prosperity/", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-01-29T00:00:00Z"
}