{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    energy-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Join\n              internationally-acclaimed researcher and award-winning\n              educator Richard Alley in an exploration of the role of\n              energy in our environment and our future. Energy use has\n              done great good for humans by giving those in the\n              developed world the equivalent of 100 energy \"serfs\" to do\n              our bidding, making up roughly 10% of the economy, and\n              powering most of the economy.  However, the unintended\n              consequences of energy use are affecting people around the\n              world and changing the climate in ways that will make life\n              much harder.  Numerous options exist for development of a\n              sustainable energy system that provides a stronger\n              economy, more jobs, and greater security that is more\n              consistent with ethical principles.  The course explores\n              these issues.\n               \n              “Energy, the Environment, and Our Future” will combine\n              student-centered instructional materials and film clips\n              from the PBS TV series Earth: The Operators' Manual, also\n              hosted by Richard Alley, to tell the history, present, and\n              possible futures of human energy use.  \n            \n            \n\n                                            Syllabus\n                        (Subject to change before course begins)●    Lesson 1. Sustainability: Why Energy Matters (and Money)  ●    Lesson 2. What is Energy—Units and Such; What we use, and how much good it does  ●    Lesson 3. Oil, Coal and Natural Gas, Drilling and Fracking and Reserves  ●    Lesson 4. Global Warming I—Physics ●    Lesson 5. Global Warming II—History  and Impacts ●    Lesson 6. Options: Solar, Wind●    Lesson 7. Options: Geothermal, Waves, Tides, Nukes●    Lesson 8. Options: Conservation●    Lesson 9. Options: Geo-Engineering●    Lesson 10. Economics●    Lesson 11. Policy Options●    Lesson 12. Ethical issues \n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Energy, the Environment, and Our Future", 
    "price": 0, 
    "instructors": "Richard B. Alley", 
    "institution_name": [
        "Pennsylvania State University"
    ], 
    "commitment": "6-9 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/course/energy", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-01-06T00:00:00Z"
}