{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Energy technology is a highly multidisciplinary subject, which extends from engineering (e.g. mechanical, chemical, civil, environmental and electrical) to economy and ecology. This course is designed for students with limited engineering knowledge. It gives a broad overview of energy technology, mainly focusing on electric power generation. Before introducing technical aspects of power generation, impacts of excessive fossil fuel consumption to the environment, such as global warming, ozone depletion, acid rain and emissive pollutants, are addressed. In addition, strategies and challenges of energy security and social justice for resource-poor countries, such as an island region of Taiwan, will be emphasized.\n\nThe technical topics cover most of the existing and emerging technologies, which include:\n\nFossil Fuel and Thermal Power Plants\n\tFuel Cells\n\tSolar Energy → Photovoltaic &amp; Concentrating Solar\n\tWind Energy\n\tHydroelectric Power &amp; Ocean Energy\n\tGeothermal Energy\n\tBiomass Energy\n\tNuclear Energy\nThe students will gain comprehensive knowledge of the above listed energy technologies, in which the working principles, their practical applications and the latest progresses are emphasized. Based on the knowledge learn in the classes, the students will be aware about the pros and cons of these technologies, and be able to make their choices for selecting the most desired energy. The course will also provide guidance for those who are interested in perusing their future careers or advanced educations in energy-related fields.\n\nThis course was developed and is being offered by National Chiao-Tung University through OECx.\n\n能源科技是一門高度跨領域的課程，其範疇可從工程領域(包含機械、化工、土木、環境和電機)延伸到經濟與生態學等。本課程主要為介紹基本能源工程知識的通識性課程，提供學生全面性的能源科技概述。內容以介紹發電技術為主，並介紹過度使用化石燃料對環境影響，如全球暖化、臭氧層破壞、酸雨和排放污染物等。本課程主題涵蓋現有成熟和新興發展能源技術，包括：\n\n化石燃料與原動力(發電)廠\n\t燃料電池\n\t太陽能 - 光伏特效應與集中式熱能\n\t風能\n\t水力與海洋能\n\t地熱\n\t生質能\n\t核能\n學生於修習此課程後，將可整體性了解能源技術的相關基本知識，包含其工作原理、實際應用和最新發展。同時於修習後亦可了解到上述技術的優缺點，以為未來選擇最適用能源方式的判斷依據。本課程亦可對未來有興趣從事能源領域工作或進行能源技術深造的同學提供參考。\n\n \n\n                                    ", 
    "end_date": "2014-12-01T00:00:00Z", 
    "title": "Energy103: Energy ─ The Technology You Must Know in the 21st Century | 能源 ─ 21世紀你必須了解的科技!", 
    "price": 0, 
    "instructors": "Ching-Yao Chen", 
    "institution_name": [
        "Open Education Consortium (OEC)"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/energy-technology-you-must-know-21st-oecx-energy103", 
    "duration": "6 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-10-20T00:00:00Z"
}