{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    How can food systems become more sustainable in the face of population growth, urbanisation, and environmental degradation? How can a food systems approach help in achieving the Sustainable Development Goals? This course will explore how natural resources are currently used to take the food we eat from the field or ocean to our plates.\n\nUnderstand food systems in Southeast Asia\n\nAlong the chain of steps from how food is produced to when it is consumed, a variety of earth’s natural resources, from land and water to biodiversity and fossil fuels, are used in many different ways. During this course you will take a closer look at these relationships in Southeast Asia, examining trends in the region’s food systems, and the range of actors involved.\n\nExamine the environmental and socioeconomic implications of food systems\n\nAs our populations grow, our resources and natural environments are under increasing pressure, and in many cases we are not using them in a sustainable way. During this course we’ll review the impacts of food systems and their activities, from production to consumption including waste, on human health, natural resources, and the wider environment.\n\nExplore ways of making food systems sustainable\n\nAfter looking at the relationships between food systems, natural resources, the environment, and people’s well being, we’ll focus on how to think about and implement change. We will further explore the food systems approach to natural resource use, and discuss policy and practice options for a transition towards more sustainable, resource-smart food systems.\n\n\n                                    ", 
    "end_date": "2016-09-12T00:00:00Z", 
    "title": "Food and Our Future: Sustainable Food Systems in Southeast Asia", 
    "price": 0, 
    "instructors": "Matthew Fielding", 
    "institution_name": [
        "Stockholm Environment Institute"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/food-systems-southeast-asia?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-08-08T00:00:00Z"
}