{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Feeding nine billion people in 2050 without exhausting the planetary reserves is perhaps the greatest challenge mankind has ever faced. This environmental studies course will examine the principles of production ecology and the ‘availability pillar’ of global food security that lie at the heart of food production, which can be applied to both crops and animal production. This course will discuss why yields in some parts of the world are lagging behind and identify the agro-ecological drivers that shape the wide diversity of production systems.\n\nFurthermore, key issues relating to the closing of yield gaps and the difference in visions of sustainability will be explored.\n\nThis online course will be of great interest to international students and those with varied educational backgrounds, both professionally and culturally, to enrich their views and action perspectives related to global food security and food systems. Professor Ken E. Giller will introduce learners to crop production and underlying bio-physical principles in order to identify constraining factors in yield formation. He will explain how to assess yield gaps at the level of fields and production systems around the world, contributing to efficient resource management. Wageningen University and Research, through its unique systems-based approach to food systems, adds the phase of primary production to the broad context of global food security.\n\n                                    ", 
    "end_date": "2017-05-04T00:00:00Z", 
    "title": "FSSCPx: Food Security and Sustainability: Crop production", 
    "price": 0, 
    "instructors": "Ken Giller, Gerrie van de Ven and ​Harrie Lovenstein", 
    "institution_name": [
        "Wageningen University"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/food-security-sustainability-crop-wageningenx-fsscpx", 
    "duration": "46 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-16T00:00:00Z"
}