{
    "selfpaced": true, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    You and your family, business organization, civic group, or classroom can now enjoy a fun and entertaining way to learn about our weather from Oklahoma’s own Gary England! The University of Oklahoma and award-winning meteorologist Gary England have collaborated to create two exciting series.\r\n“Gary England’s Tornado Alley” consists of short, entertaining videos that give people of all ages a better understanding of Oklahoma’s severe weather patterns and events. This entertaining series makes it easy and fun for you to become familiar with the fundamentals of our weather, the history of weather forecasting, and the technology used by meteorology professionals to keep the public as safe as possible. Using Janux's social discussion forum, participants are able to interact directly with Gary and share their own weather stories and experiences with people around the globe.\r\n“Gary England’s El Niño” is the newest Sooner Series, diving into the causes of El Niño and the effects it has on all parts of the world. The 2015 El Niño is quite possibly the strongest El Niño in history, and Gary’s use of incredible graphics helps explain the abnormal weather conditions that we have been experiencing over the last several months. These powerful visuals combined with Gary’s expertise provide an unparalleled opportunity to learn more about this force of nature.\r\nBoth series are being offered at no cost through multiple media channels, including iTunes U, YouTube, and OU’s Janux online learning platform.\r\nThese videos have been professionally produced by NextThought, and each series has been released in its entirety, so as to fit your schedule.\n\n                                            Syllabus\n                        The Miracle of El NiñoFrom Darwin to TahitiRiding the JetGoing DeepAs the Ocean MovesMaking WavesPacific North American PatternMother Nature on StageOceans SevenHurricanes and TornadoesHistory Guides the FutureEverything is Connected\n                                    ", 
    "end_date": null, 
    "title": "Gary England's El Niño", 
    "price": 0, 
    "instructors": "Gary England", 
    "institution_name": [
        "The University of Oklahoma"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://garyengland.ou.edu/", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Janux"
    ], 
    "start_date": "2016-06-11T00:00:00Z"
}