{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Téléchargez le manuel d'utilisation du MOOC : en français (http://papaco.org/wp-content/uploads/2016/04/Guide-MOOC_FR.pdf) ou en anglais (http://papaco.org/wp-content/uploads/2016/04/Guide-MOOC_ENG.pdf).\n\n\nCe cours porte sur les zones qui sont dédiées à la protection de la nature, les «aires protégées» : comment elles fonctionnent et pourquoi elles sont si importantes dans le maintien de la santé de l’environnement de notre monde en plein développement, et plus particulièrement en Afrique.\nIl vous aidera à comprendre les défis de la conservation en Afrique et comment les aires protégées peuvent aider à y faire face, du niveau local à l’échelle internationale. L'objectif est de découvrir et comprendre comment améliorer la gouvernance et la gestion de ces territoires uniques. \n\nLe cours fournit une connaissance globale des éléments clés de la gestion et de la gouvernance des aires protégées en Afrique.\nDans chacun des sept modules du cours, nous abordons un thème clef relatif à la conservation de la nature au travers des aires protégées. Nous verrons les concepts à comprendre au préalable, la planification, à toutes ses échelles, la gouvernance et ses multiples ressorts, l’efficacité de la gestion pour de meilleurs impacts, les techniques à employer sur le terrain, le financement de la conservation et enfin l’actualité brûlante du moment.  Nous parlerons d’aménagement du territoire, de transfrontalier, de connectivité, de surveillance, de restauration des sites, d’éducation environnementale, d’équité, de services des écosystèmes, de populations locales, de tourisme, de climat, d’aires marines protégées, de conventions internationales… bref de tout ce qu’il faut connaître pour pouvoir conserver durablement ces aires protégées.\n\nDe nombreux intervenants prendront la parole et viendront illustrer par leur expérience de terrain les cours coordonnés par les quatre intervenants principaux, partenaires du RESCIF : Paul Ndiaye, de l’UCAD à Dakar, Paul Ouedraogo, du secrétariat de la Convention RAMSAR, Sylvie Goyet qui a dirigé la Fondation Internationale du Banc d’Arguin et Geoffroy Mauvais, qui est de l’Union Internationale pour la Conservation de la Nature (UICN-Papaco) et collaborateur externe au Collège des Humanités de l’EPFL. Le MOOC est coproduit par André Hoffmann, UICN-Papaco et l’EPFL.\n\nSi vous avez des questions sur le MOOC n'hésitez pas à consulter le guide du MOOC (en français : http://papaco.org/wp-content/uploads/2016/04/Guide-MOOC_FR.pdf et en anglais : http://papaco.org/wp-content/uploads/2016/04/Guide-MOOC_ENG.pdf).\n\nFAQ\n\nQ : Quelles sont les connaissances nécessaires pour profiter au mieux du cours ?\nR : Le Mooc a été développé pour apporter une information générale au travers des vidéos et permettre un approfondissement volontaire au travers des documents consultables. Que vous soyez novice ou professionnel de la conservation, vous pourrez donc trouver le niveau d’information qui vous intéresse.\n\n \nQ : Quels sont les aspects les plus remarquables de ce cours ?\nR : Le cours est construit sur les meilleures pratiques proposées par la commission mondiale des aires protégées et fait appel à de nombreux experts pour illustrer leurs principes afin de passer de la théorie à la pratique. Bien que général, le cours s’attache à illustrer concrètement les concepts évoqués.\n\n \nQ : Quelle est la spécificité de ce cours sur la conservation de la nature ?\nR : Le cours aborde la conservation de la nature au travers de la gestion et de la gouvernance des aires protégées, en prenant l’exemple du continent africain. Les leçons apprises sont utilisables partout cependant, en les adaptant aux contextes des autres zones géographiques.\n \n\nQ : Quelles ressources sont nécessaires pour suivre le cours ?\nR : Aucun support de cours n’est nécessaire. L’information principale est présentée dans les vidéos et des documents, sites web, publications… sont proposés en complément. Un résumé des principaux points à connaître est aussi préparé pour la plupart des thèmes abordés.\n\n \nQ : Comment vais-je interagir avec les autres inscrits à ce Mooc ?\nR : Un forum sera mis en place dès le début du cours permettant de recueillir les questions, les remarques, les critiques et les suggestions de tous. Des sujets pouvant faire l’objet de débats seront proposés et animés et les participants souhaitant rejoindre le réseau des acteurs de la conservation déjà constitué par l’UICN-Papaco pourront le faire volontairement. Le MOOC a aussi un groupe Facebook sur lesquels tous les inscrits peuvent échanger : https://www.facebook.com/groups/167668443583415/. \n\n \nQ : Quelle reconnaissance du cours si je passe tous les examens ?\nR : Chaque module, un examen permettra de valider les connaissances acquises. Les participants ayant passé avec succès tous les examens peuvent recevoir une attestation de réussite de Coursera. Les étudiants peuvent aussi passer un examen en présentiel, ce qui leur permettra de recevoir une attestation de l'EPFL et de l'UICN et 2 crédits universitaires (ECTS).\n\n \nQ : Quelles suites peut-on envisager ?\nR : Si vous rejoignez le réseau de l’UICN-Papaco, vous recevrez tous les mois la lettre sur les AP d’Afrique. Ceux et celles qui auront obtenu l’attestation de réussite au Mooc pourront aussi bénéficier (sous réserve de prérequis académiques) d’un accès privilégié aux formations en présentiel organisées par l’UICN-Papaco (Diplôme d’université en 8 semaines ou Master en 2 ans).\n\n                                            Syllabus\n                        Module 1 - Concepts clésComment définir les aires protégées ? Comment sont-elles réparties ? A quoi servent-elles ? Comment les différentie-t-on ? La convention du module : la CDB.Module 2 - PlanificationPlanification d'une aire protégée ou d'un réseau, planification intégrée et gestion des aires protégées transfrontalières. La convention du module : les objectifs d'Aïchi.Module 3 - Gouvernance Qu'est-ce-que la gouvernance ? Quels sont les 4 types de gouvernance des aires protégées ? La convention du module : le protocole de Nagoya. Module 4 - Efficacité des aires protégéesGestion et efficacité des AP. Comment évaluer l'efficacité ? Comment adapter la gestion des AP pour la rendre plus efficace ? La convention du module : la Convention du patrimoine mondial. Module 5 - Spécificités de la gestion des aires protégées Quelques spécificités de gestion des aires protégées en Afrique. La convention du module : la CITES.Module 6 - Financement durableComment financer durablement la gestion des aires protégées ? La convention du module : la CMS. Module 7 : Actualité de la conservationThèmes d'actualité de la conservation en Afrique : changement climatique, connectivité, équité, trafic, etc. La convention du module : la convention de RAMSAR. \n                                    ", 
    "end_date": "2016-05-20T00:00:00Z", 
    "title": "Gestion des aires protégées en Afrique", 
    "price": 0, 
    "instructors": "Geoffroy Mauvais", 
    "institution_name": [
        "École Polytechnique Fédérale de Lausanne"
    ], 
    "commitment": "5 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/aires-protegees", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-04-01T00:00:00Z"
}