{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Si en el mundo existe tanta agua dulce, 35 millones de km3 para ser exactos… ¿cómo es posible que hoy más de 750 millones de personas no tengan acceso al agua? Al mismo tiempo, el continente Americano cuenta con el 31% de las reservas de agua dulce del mundo. ¿Es posible que los países que conforman América Latina puedan aprovechar esta situación y transformarla en una gran oportunidad?\n\nSi deseas dar respuesta a estas preguntas y otras parecidas, ¡este curso es para ti! Su objetivo es que quienes participen tomen conciencia sobre la creciente demanda de agua a nivel mundial y la situación privilegiada de América Latina y el Caribe en este contexto.\n\nDe esta forma, el curso te llevará hacia una reflexión sobre el rol del agua en la sociedad, sus usos y su potencial y, además, te presentará los métodos y herramientas existentes para la asignación de los recursos hídricos disponibles y, así, obtener el máximo beneficio y evitar el despilfarro. No te pierdas la oportunidad de analizar los usos del agua y riesgos del acceso a los recursos hídricos en la región, a través de la mirada interdisciplinar.\n\nAdemás, haremos uso de aplicaciones web, como juegos o interacciones que promueven la colaboración y la aplicabilidad de los conceptos presentados por nuestros instructores. Incluso, a lo largo del curso, las actividades propuestas permitirán al participante poner en práctica lo aprendido en su lugar de residencia.\n\nYa lo sabes: ¡te esperamos en “Agua en América Latina: abundancia en medio de la escasez mundial”\n\n                                    ", 
    "end_date": "2016-07-12T00:00:00Z", 
    "title": "IDB3x: Agua en América Latina: Abundancia en medio de la escasez mundial", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "IDB ( Inter-American Development Bank )"
    ], 
    "commitment": "6-7 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/agua-en-america-latina-abundancia-en-idbx-idb3x-0", 
    "duration": "10 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-05-03T00:00:00Z"
}