{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Ce cours sera enseigné en français.\nThis course will be taught in French.\n\nQuel lien existe-t-il entre l’exploitation des ressources naturelles (terre, eau, ressources minières, forêts, ...) et le développement durable ? Ce cours vous permettra de comprendre les opportunités mais aussi les défis que la présence de ressources naturelles offre, tant au niveau local que global. En analysant les effets socio-économiques et écologiques de la ruée actuelle vers ces ressources naturelles, vous comprendrez mieux les liens entre crise agraire, crise alimentaire et crise environnementale. A partir d’études de cas spécifiques, c’est votre regard sur les dynamiques globales contemporaines qui en sera modifié.\nA la fin du cours, par rapport à des problématiques liées à la gestion des ressources naturelles (ruée sur la terre, le sous-sol, l’eau et/ou la forêt), vous serez capables de:\n\ncomprendre, comparer et analyser des modèles théoriques qui permettent de décoder de telles problématiques\n\tdécomposer ces problématiques en causes, conséquences, solutions et points de vue divergents sur ces trois elements\n\trepérer, dans votre environnement, des cas d'étude qui illustrent ces problématiques et leur appliquer le processus de décomposition vu dans le cours.\nVous serez invités à choisir deux ressources naturelles parmi les quatre proposées. Vous développerez les apprentissages annoncés au travers de présentations vidéo par la professeur et par des experts, de QCM, d’un jeu de plateau à jouer avec vos proches (Land Rush), de débats et de cas d’étude proposés par vous, que vous schématiserez et présenterez aux autres via une activité d’évaluation par les pairs.\n\nWhat kind of link exists between the exploitation of natural resources (land, water, minerals, forests) and sustainable development? This course aims to understand the opportunities and challenges implied by the presence of natural resources at both local and global levels. You will be analyzing the socioeconomic and ecological effects of the contemporary natural resource rush. This will help you to gain a better understanding of the links between land, food and environmental crises. Through the analysis of specific case studies, you’ll look at contemporary global dynamics in a different way.\n\n                                    ", 
    "end_date": "2016-04-04T00:00:00Z", 
    "title": "Louv4x: Ressources naturelles et développement durable", 
    "price": 0, 
    "instructors": "An Ansoms", 
    "institution_name": [], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/ressources-naturelles-et-developpement-louvainx-louv4x-0", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-02-08T00:00:00Z"
}