{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Since early humans first moved out of Africa, the world’s climate has had a continual impact on our history. Now, the climate itself is being shaped by civilisation.\n\nThis free online course from the University of Reading will take you on this fascinating journey through time. Over five weeks, we’ll explore how climate shapes the way we live, the food we eat, the water we drink and the cities we live in.\n\nFrom the fundamental science of the atmosphere to the social, economic and political consequences of climate change, our expert archaeologists, scientists, geographers and engineers will guide you.\n\nWe’ll start with an overview of the climatic system, how it’s changed over time and how it’s predicted to change in future. Then, we’ll focus on the impact of climate change on our lives. Finally, we’ll take a look at policy - why it’s needed, what’s been done and what’s next.\n\nTogether, we’ll find out what climate change means for you and the part we play in the climate of the future. Looking back, we’ll see examples of inspiring innovation and resilience, and ask: can our ingenuity see us through the challenges that lie ahead?\n\nYou can find out more in Maria Noguer’s post for the FutureLearn blog: “2015: a pivotal year for creating a resilient society”.\n\n\n                                    ", 
    "end_date": "2015-12-14T00:00:00Z", 
    "title": "Our Changing Climate: Past, Present and Future", 
    "price": 0, 
    "instructors": "Maria Noguer", 
    "institution_name": [
        "University of Reading"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/our-changing-climate?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-11-09T00:00:00Z"
}