{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Energy issues have always been important in international relations, but in recent years may have become even more important than in the past due to the widespread awareness of existing limits to energy sources and negative climate impacts. The course discusses global trends in energy consumption and production, various available scenarios for potential developments in the coming decades, the availability of oil reserves and the evolution of the oil industry. It then discusses natural gas and highlights the differences between oil and gas. It will also discuss renewable energy sources, nuclear energy and EU energy policy.The course aims at providing students whose main interest is in international relations a background on energy resources, technology and economic realities to allow them to correctly interpret the political impact of current developments. It also aims at providing students, who already have a technical background in energy science or engineering, with the broad global view of energy issues that will allow them to better understand the social, economic and political impact of their technical knowledge.The course is divided into 8 sequences. Each sequence is largely illustrated with different types of contents : video either produced by the professor or extracted from professional and academic sources, interviews with specialists of the field, animated graphics and diagrams, international companies scenarios, press and scientific articles.\n\n                                            Syllabus\n                        Week #1 : Introduction to global energy trends and scenariosEnergy and Development – Energy Transitions – Energy PovertyWeek #2 : Oil formation, exploration and productionOil formation – different kinds of deposits – exploration technology – production technology – environmental impactWeek #3 : Global oil reserves and resourcesEnergy and Development – Energy Transitions – Energy Povertdistribution of global oil reserves and resources - what is the meaning of reserves – oil production – the impact of nonconventional oilWeek #4 : Gas: The economics of natural gasWhat is natural gas and how it differs from oil – gas networks – pipeline gas – LNGWeek #5 : The geopolitics of natural gasDomestic production and imports of gas in Europe – EU-Russia relations – security of supply issuesWeek #6 : Renewable energy sourcesMain sources of renewable energy – renewable sources for heat and transport – renewable sources for power generation – intermittencyWeek #7 : Nuclear energyNuclear after Fukushima - economics of nuclear energy – waste disposal – safety – alternative nuclear technologies – nuclear energy and non-proliferationWeek #8 : Dilemmas of (European) energy policyEnergy and competitiveness – energy security – energy and the environment\n                                    ", 
    "end_date": "2015-11-09T00:00:00Z", 
    "title": "Politics and Economics of International Energy", 
    "price": 0, 
    "instructors": "Giacomo Luciani", 
    "institution_name": [
        "Sciences Pro"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/SciencesPo/05006S02/session02/about", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}