{
    "selfpaced": true, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    The climate change and the shortage of the fossil resources are energy-related topics that lead to discussions about the energy supply of the future: On a local and on a global level, in professional and in private contexts. Following the catastrophe in Fukushima the awareness for the necessity of discussing increased. In Germany, the reaction resulted in the so-called “Energiewende” – the energy transition. While English – as lingua franca – cannot solve the problems of energy supply, it can at least aid finding the right words when talking about finding a solution. Within the wide field of energy, this MOOC focuses on the topics closely related to energy transition. However, it will not give a deep insight into the technical terminology e.g. of a power plant.\n\n                                            Syllabus\n                        Chapter 1: Energy Transition – Introduction What is the Energy Transition, and why do we need it? A look at the concept of moving away from fossil fuels and toward renewable and sustainable energy sources. Some big-picture ideas: public policy, implementation targets, energy security.\r\nChapter 2: Generation How is power generated? An overview of our current situation (fossil fuel and nuclear powered thermal energy plants), a look at turbines and energy conversion, and a short introduction to the mature renewable technologies that are currently on the market (biomass, wind, solar, geothermal, hydro).\r\nChapter 3: Transmission and Distribution How does power get from where it is generated, to where it is consumed? An examination of our current infrastructure (the power grid) and the importance and challenges of keeping the grid balanced. Introduction to the next generation of infrastructure: smart grid technology - what it is, and the fundamentals of how it works.\r\nChapter 4: Storage How can we integrate renewables into the existing energy infrastructure? The current system is demand-oriented; renewables are inherently supply-driven. One key way to bridge this gap is by using energy storage. This is an overview of the most promising technologies currently available (pumped-storage hydro, batteries, compressed air, thermal energy storage, power-to-gas methane synthesis).\r\nChapter 5: Efficiency and Usage The two pillars of the Energy Transition are sustainable energy and energy efficiency. Without efficiency, energy demand continues to grow unchecked and the Transition will fail. This unit focuses particularly on energy use/consumption in buildings, and the enormous role human behaviour plays in efficiency and the reduction of energy demand.\r\nChapter 6: Future of Energy Research in sustainable energy and energy efficiency continues to advance - what are some potential untapped sources of energy? What are the effects the technologies of today will have on the future? How can renewable energy improve energy access and energy equality in a world of ever-growing energy demand?\n                                    ", 
    "end_date": "2015-11-02T00:00:00Z", 
    "title": "Power Up: English for the Energy Transition", 
    "price": 0, 
    "instructors": "Julia Thompson-Kleser", 
    "institution_name": [
        "Center for Technology Enhanced Learning"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://iversity.org/en/courses/power-up-english-for-the-energy-transition-march-2016", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2015-09-21T00:00:00Z"
}