{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso tiene como objetivo analizar los conceptos de responsabilidad social y sostenibilidad, con la finalidad de analizar y fomentar la reflexión sobre el impacto global de las empresas en el entorno en que operan. Para ello, es esencial conocer qué es la contabilidad social, cuáles es el paradigma de la sostenibilidad y cuál es la respuesta de las empresas ante este nuevo contexto, temas que vamos a abordar en este curso. Por último, presentaremos diversas iniciativas que en la actualidad se presentan a nivel internacional, y nos centraremos especialmente en los informes de sostenibilidad y la iniciativa Global Reporting Initiative –GRI– por ser la que ha conseguido hegemonía en el contexto internacional: sobre qué informan las empresas, cómo se estructura etc... Ikastaro honetan gizarte erantzukizuna eta jasangarritasunaren kontzeptuak landuko ditugu, enpresek beraien ingurunean duten eragin osoari buruzko azterketa eta gogoeta bultzatzeko asmoz, hau da; eragin ekonomiko, sozial, eta ingurumenezkoak. Horretarako giza-kontabilitatea zer den, zein teoriek laguntzen gaituen jasangarritasunaren paradigma ulertzen eta zein den enpresek testuinguru berri honen aurrean emandako erantzuna jorratuko dira. Azkenik, egun alor honetan planteatzen diren nazioarteko ekimen desberdinak aurkeztuko ditugu, mundu mailan nagusitu den Global Reporting Initiative –GRI- jasangarritasun txostenak osatzeko ereduari atal berezi bat eskainiz: zeri buruzko informazioa ematen duten, nola osatzen eta egituratzen diren hausnartuz, besteak beste.\n\n                                    ", 
    "end_date": "2015-10-21T00:00:00Z", 
    "title": "Responsabilidad social y memorias de sostenibilidad/ Gizarte Erantzukizuna eta jasangarritasun txostenak", 
    "price": 0, 
    "instructors": "Ainhoa Garayar", 
    "institution_name": [
        "University of the Basque Country"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.miriadax.net/web/gizarte_erantzukizuna", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Miríada X"
    ], 
    "start_date": "2015-09-16T00:00:00Z"
}