{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Nous donnerons aux apprenants des clés méthodologiques de détermination des roches et des minéraux les plus courants. On se bornera à la reconnaissance de neuf roches et de neuf minéraux. Le cours se veut simple et appliqué. Les critères de reconnaissance présentés sont uniquement des critères macroscopiques. Ce parti pris limite considérablement les champs d’investigation. Il permet néanmoins de répondre aux questions généralement abordées sur le terrain par l’ingénieur, le technicien ou plus simplement le curieux naturaliste qui souhaite examiner les roches qu’il rencontre. Il arrivera parfois de ne pas pouvoir conclure sur la classification d’une roche. Dans ce cas, ce qui importe est la méthodologie suivie et les conclusions sur les propriétés déduites des observations. Le second objectif est d’associer à ces roches et minéraux leurs propriétés essentielles afin de mieux cerner les problèmes susceptibles de se présenter lorsqu’on construit un bâtiment ou un ouvrage d’art, on aménage un secteur ou encore lorsqu’on exploite directement le matériau. Ces éléments théoriques sont un préalable indispensable mais n’affranchissent pas de la pratique sur le terrain et de l’observation d’échantillons qui conduiront à la maîtrise de l’exercice d’identification.\n\n                                            Syllabus\n                        Semaine 1 : Généralités. Genèse et cycle des roches.Semaine 2 : Textures des roches.Semaine 3 : Compositions des roches. Identification des minéraux.Semaine 4 : Identification des roches courantes.Semaine 5 : Propriétés et utilisations des minéraux courants.Semaine 6 : Propriétés et utilisation des roches courantes.\n                                    ", 
    "end_date": "2016-03-09T00:00:00Z", 
    "title": "Roches et minéraux courants : genèse, identification et utilisations", 
    "price": 0, 
    "instructors": "Evelyne Pradal and Didier Nectoux", 
    "institution_name": [
        "Institut Mines-Télécom"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/MinesTelecom/04004S03/session03/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-01-27T00:00:00Z"
}