{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    Meteorology is fundamental for sailing safety and is the very essence of strategy for winning any regatta. It is also the science most directly linked to ocean sailing.\r\nWhether you are already a sailing fan or not, on this course you can learn about the mechanics of global weather and what knowledge of that sailors require. You will learn about the foundations of ocean meteorology, how digital files are generated based on prediction models and how sailors receive these via satellite and then integrate them into high-performance navigation software. This knowledge is useful both in sailing and in other activities conditioned by meteorology across the planet.\r\nYou will also learn how to analyse the meteorological characteristics of the Barcelona World Racecourse, which crosses up to 12 different climate zones, with the boats going up against some of the world's most extreme weather phenomena. The regatta takes the yachts through the Mediterranean Sea, the North and South Atlantic, the Indian and South Pacific Oceans. You will learn how to use thefoundations of climate and meteorology strategy to win a regatta and you will gain insight into how the sailors experience this science first hand as they race across the oceans.\r\nTo follow the course it is recommended that you have some basic knowledge of meteorology.\r\nWhen the course has been completed, students may request a certificate from the University of Barcelona (UB).\n\n                                            Syllabus\n                        Module 1Understanding maritime meteorologyHistory. The four weather factors. The atmosphere and the mechanics of global weather.\r\nModule 2Meteorological predictionHow prediction models are generated. Reliability and accuracy. Predictability. Forecasting structures. Basic prediction modelling at sea. The GRIB format.\r\nModule 3The sailor as meteorologistA general approach to meteorological routing. A navigator's tools. The VPP and polar curves. Route calculation. Short, medium and long term strategy and tactics. Daily routines on board. Routing in practice. Personal experience.\r\nModule 4Ocean regattas and meteorologyClimatology and the design of ocean racing yachts. The IMOCA 60. Climatology and the planning of a round the world regatta. The Race Directors and meteorological updates.\r\nModule 5Barcelona World Race analysis: from the Mediterranean Sea to the Indian OceanAn analysis of the legs of the regatta based on meteorological situations from the BWR 2010/11. The Gibraltar Strait passage, from east to west. Strategy for the trade winds. Passing the Canary Islands. The doldrums. The St Helena High and the approach to the Cape of Good Hope.\r\nModule 6Barcelona World Race analysis: from the Indian Ocean to the Mediterranean SeaThe Southern Ocean. The danger of ice. Tropical cyclones in the Pacific Ocean. Rounding Cape Horn. The Atlantic from south to north. The Levant storms in the Gibraltar Strait.\n                                    ", 
    "end_date": "2014-12-29T00:00:00Z", 
    "title": "Strategies for winning. Meteorology in a round the world regatta", 
    "price": 0, 
    "instructors": "Santi Serrat, Jordi Barinaga, Marcel van Triest and Tomàs Molina", 
    "institution_name": [
        "University of Barcelona"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.canvas.net/courses/strategies-for-winning-meteorology-in-a-round-the-world-regatta", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2014-11-17T00:00:00Z"
}