{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, we will provide you with a basic introduction into crystallography. The focus is placed upon the symmetry elements, which occur in crystals. The arrangement of the atoms inside the crystal needs a more detailed description than the overall shape of the crystal (morphology). We want to show you how symmetry is classified in a hierarchical way. We want our students to gain the ability to discover symmetry on their own.\r\nWhat will I learn?\r\nAt the end of the course you will be aware of the similarities between the patterns on wallpaper and the structures of crystals, be able to classify the innumerable appearances of crystals into the seven different crystal systems, know how to find crystallographic data and how to analyze it regarding symmetry, you will understand the International Tables for Crystallography and will be familiar with software for analyzing and drawing crystals structures.\r\nWhat do I have to know?\r\nBasic knowledge in chemistry (atoms, simple molecules).\n\n                                            Syllabus\n                        \r\n\r\nChapter    Topic\r\n\r\n\r\n\r\nChapter 1\r\n       Introduction to Crystals and Crystal Systems\r\n\r\n\r\nChapter 2\r\n       Crystal Systems, Fractional Coordinates, and Morphology of Crystals\r\n\r\n\r\nChapter 3\r\n       The World of Symmetry, Crystal classes and Plane groups\r\n\r\n\r\nChapter 4\r\n       Glide planes, Screw axes and Space groups\r\n\r\n\r\nChapter 5\r\n       Quasicrystals and Real Crystal Structures (in 3D)\r\n\r\n\r\nChapter 6\r\n       Metal-Organic Frameworks and Networks\r\n\r\n\r\nChapter 7\r\n       Practising Topology Determination, Tilings\r\n\r\n\r\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "The Fascination of Crystals and Symmetry", 
    "price": 0, 
    "instructors": "Frank Hoffmann, Michael Fröba and Michael Sartor", 
    "institution_name": [
        "Universität Hamburg"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://iversity.org/courses/the-fascination-of-crystals-and-symmetry-b789b437-ceb3-412f-9482-772b6f1e413e", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2014-10-14T00:00:00Z"
}