{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    With the need to reduce carbon emissions around the world, the way we generate our power has to change and nuclear energy is back on the political agenda. But do you know your fission from your fusion? Would you like the knowledge to make an informed decision?\n\nThe question of whether we should get electricity from nuclear power remains a tough one for governments all over the world. While it offers a sustainable, low carbon and secure way of meeting our energy needs, big questions surround the economic viability, the perceived dangers and the public acceptability associated with power plant operations and radioactive wastes.\n\nNuclear power stations currently generate around 18% of the UK’s electricity production. The majority of the current reactors are scheduled to be decommissioned by 2023 and we could be facing an energy ‘gap’.\n\nThis free course will delve into the science behind nuclear power and explain what happens inside a nuclear reactor and what it means for an element to be radioactive. It will explore some of the risks of producing nuclear power and examine the arguments for and against including it in future energy planning as well as looking at other potential future solutions.\n\nYou can find out more in Sam Smidt’s post for the FutureLearn blog: “Can nuclear power solve the energy gap?”\n\n\n                                    ", 
    "end_date": "2016-10-24T00:00:00Z", 
    "title": "The Science of Nuclear Energy", 
    "price": 0, 
    "instructors": "Sam Smidt and Gemma Warrine", 
    "institution_name": [
        "The Open University"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/the-science-of-nuclear-energy?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-26T00:00:00Z"
}