{
    "selfpaced": false, 
    "topic_name": [
        "Environmental Science"
    ], 
    "description": "\n\n                    \n                    \n                    The importance of water to our cities\n\nWater plays a central role in almost every aspect of our urban environment and quality of life in our cities. Alarmingly, the combined impacts of rapid population growth and climate change are now posing a severe threat to the liveability and resilience of our cities.\n\nA new approach to urban design\n\nHowever, it is possible to design water systems that provide cities with the capacity to cope with these threats. So-called “water sensitive urban design” creates water sensitive cities that enhance and protect the health of watercourses and wetlands; mitigate flood risk and damage; and create public spaces that harvest, clean and recycle water.\n\nThis approach poses complex planning and urban design challenges. And it requires solutions that address equally complex and interrelated considerations, such as social, environmental, political, economic, planning and engineering disciplines.\n\nLearn from a team of experts\n\nYou’ll hear from leading researchers and thought-leaders in Australia and internationally about key actions in delivering water sensitive cities. You’ll consider and discuss the latest solutions and concepts on urban design and modelling, climate change adaptation, behaviour change, and social and government engagement.  Specifically, you’ll consider:\n\n\n  the emerging challenges facing our cities\n  how water sensitive cities can be the driver for more resilient cities\n  how water can be managed in our cities to improve their liveability\n  the potential for stormwater, urban aquatic systems, and green infrastructure to improve the urban climate\n  how changes in human behaviour and institutions can complement and assist transitions to water sensitive cities.\n\n\nA practical course\n\nWe’ll focus on effective ways to create water sensitive cities as we draw upon case studies from Australia and around the world. We’ll ask you to share examples and insights from wherever in the world you live, and we’ll challenge you to consider how you can help make your urban environment more water sensitive.\n\nYou can find out more in Robert Skinner’s Can water help our cities cope with rapid urbanisation and climate change? blog post for FutureLearn.\n\n\n                                    ", 
    "end_date": "2016-06-20T00:00:00Z", 
    "title": "Water for Liveable and Resilient Cities", 
    "price": 0, 
    "instructors": "Robert Skinner", 
    "institution_name": [
        "Monash University"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/liveable-cities?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-02T00:00:00Z"
}