{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    The World Health Organisation (WHO), when reporting on the escalating threat of antimicrobial resistance (AMR), warned that without urgent action, we’re heading for an era in which common infections, which have been treatable with antibiotics for decades, can kill once more. In some parts of the world, this sadly is already a reality.\n\nUnderstand antimicrobial stewardship\n\nAntimicrobial stewardship is a fast-growing field that aims to address this issue by managing our use of antibiotics to slow down or reduce the occurrence of antimicrobial resistance.\n\nThis free online course will help you understand what antimicrobial stewardship is and how you can apply it everyday. Although the focus is for prescribing in the hospital setting, the skill set can be applied and adapted to other healthcare settings. The intention of the course is to stimulate and encourage further inquiry and learning in this important area.\n\nImprove antibiotic prescribing\n\nDesigned for healthcare professionals, this six-week course will inform you about - and empower you to provide - safe, high-quality antibiotic use.\n\nYou’ll interact with colleagues globally, to understand what antibiotic resistance means - and why the World Economic Forum has placed it alongside terrorism and climate change on its global risk register.\n\nYou’ll develop the skills and interventions that underpin antimicrobial stewardship, learning to promote responsible prescribing, to reduce variation in practice, and waste and harm from antibiotic overuse and misuse, thereby enhancing patient safety and outcomes.\n\nLearn with healthcare professionals globally\n\nDelivered by the University of Dundee in partnership with the British Society for Antimicrobial Chemotherapy, this is a truly global course, enabling you to meet and learn from professionals working across a range of healthcare communities and economies.\n\nWhy not invite colleagues and team members in your healthcare setting to join you and learn together? We welcome you to the course and look forward to learning, sharing and working with you.\n\n\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Antimicrobial Stewardship: Managing Antibiotic Resistance", 
    "price": 0, 
    "instructors": "Dilip Nathwani", 
    "institution_name": [
        "University of Dundee"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/antimicrobial-stewardship?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-23T00:00:00Z"
}