{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    Dementia is a global health problem, placing pressure upon health and social care systems and budgets and drastically changing the lives of partners and families of those affected. The World Health Organisation (WHO) estimates there are currently 35.6 million people living with dementia, a number that will double by 2030 and triple by 2050 (WHO, 2012). Dementia has already had a significant impact on society, and this will only increase.\r\nThis course will help you to address the global challenge of dementia. It has a strong focus on integrative collaborations and partnerships as a way to reduce barriers between services and to provide seamless care for people living with dementia. You will learn about communication and compassion, and how you can help the person living with dementia to maintain independence, control, and a good quality of life. We will also consider what happens at the end of life. There is currently no cure for dementia and the final phase of life can be a challenge, not just for the person living with dementia, but also for their family and other people around them.\r\nThe course will build as a narrative through six modules, each one using what has been taken from the previous modules. Each will be badged separately and an E-Certificate for successful completion to a standard will be awarded.\r\nThe course is presented by University of Derby Online Learning, which is the thriving distance learning division of the University of Derby. Since 2001, the University of Derby has offered online distance learning to students who required more flexible study options. As demand for these popular online distance learning courses increased, the University learned to tailor course content specifically for online delivery and in 2011, based on the increasing success of their distance learning courses, the University launched the University of Derby Online Learning (UDOL).\r\nToday, their online distance learning degrees continue to match the high academic standards you would expect in any British university. They also continue to exploit the latest research into online study to refine course delivery and increase the success of online distance learning students. UDOL’s vocational online distance learning courses are particularly suited to busy, working professionals. Many of the courses are accredited by a professional body, so you can be sure that course content is relevant, and your qualification will be recognised and valued by your industry.\r\nWith all the above in mind you can expect to receive an outstanding higher education experience by simply completing this free, six-week course.\n\n                                            Syllabus\n                        Week 1: Introduction to dementiaWeek 2: Communication and compassionWeek 3: Independence, control, and quality of lifeWeek 4: Dementia as a global health priorityWeek 5: Integrating careWeek 6: End of life care\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Bridging the Dementia Divide: Supporting People living with Dementia", 
    "price": 0, 
    "instructors": "David Robertshaw", 
    "institution_name": [
        "University of Derby"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.canvas.net/browse/uderby/courses/bridging-the-dementia-divide-1", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2016-03-07T00:00:00Z"
}