{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/cariesmanagement\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/cariesmanagement-003/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    cariesmanagement-001\n                                                                    cariesmanagement-002\n                                                                    cariesmanagement-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Dental Caries (tooth decay) is a bacterially based disease that progresses\nwhen acid produced by bacterial action on dietary fermentable carbohydrates\ntravels into the tooth and dissolves the carbonated hydroxyapatite mineral.\n This process is called demineralization.\n\nPathological factors, including acidogenic bacteria, salivary dysfunction, and\ndietary carbohydrates are related to caries progression.  Protective factors, which include\nantibacterials, salivary calcium, phosphate and proteins, salivary flow, and\nfluoride in saliva can balance, prevent or reverse dental caries through a\nprocess of remineralization. \nRemineralization is a natural and reliable repair mechanism for\nnon-cavitated carious lesions.\n\nThis course will provide the scientific basis behind the “caries balance”\nconcept, which is the key to caries management by risk assessment in clinical\npractice.  If pathological factors\nprevail caries progresses.  If protective\nfactors prevail the caries process is halted or reversed.\n\nThe course will present tools to implement  CAMBRA, “caries management by risk assessment,”\nin your clinical setting.  It can be in\nimplemented medical and dental settings, and can benefit children and adults of\nall ages. Implementation in dental practice provides patients with genuine hope\nand success for the management of their oral health.  It is a practice builder for dentistry.\n\n                                            Syllabus\n                        Week 1:Understand what dental caries isUnderstand the concept of the caries balanceKnow the three principal pathological factors of caries formationUnderstand that multiple bacterial species are responsible for dental cariesUnderstand the role of frequent ingestion of fermentable carbohydrates in dental cariesRecognize hyposalivation, how this occurs, and its importance in caries progressionWeek 2:Refine the concept of the caries balance Know and understand the multiple caries protective components in salivaUnderstand demineralization and the role of fluorideUnderstand remineralization and the role of fluoride Week 3:Understand remineralization and the role of fluoride Understand how fluoride interacts with cariogenic bacteria Know the three main mechanisms of action of fluoride Know about fluoride toothpastes and fluoride mouthrinsesWeek 4:Know about fluoride products for the dental office and for home use by prescription Know why high concentration fluoride products are used for high caries risk individuals Know the antibacterial products currently available for caries control Understand the root caries process including similarities and differences with coronal cariesWeek 5: Understand the distinction among disease indicators, pathological (biological risk) factors, and protective factorsKnow that the CAMBRA risk assessment method is validated in clinical use in thousands of patients for 6 years through adultKnow the bacterial assessment methodsUnderstand the sequence for the entire CAMBRA method Week 6:Know how to assess caries risk for an individual as low, moderate, high, or extreme Know the currently recommended chemical therapy for patients at low, moderate, high, or extreme risk To study numerous examples of risk assessment and therapy and how to build this into the treatment plan Understand the differences between risk assessment for young children, older children, and adults \n                                    ", 
    "end_date": "2015-05-18T00:00:00Z", 
    "title": "Caries Management by Risk Assessment (CAMBRA)", 
    "price": 0, 
    "instructors": "John Featherstone", 
    "institution_name": [
        "University of California, San Francisco"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/course/cariesmanagement", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-04-06T00:00:00Z"
}