{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    If you are a carer looking after a family member with dementia in your own home or a professional working with people with dementia, this free online course will help you better understand the person and develop the skills needed to manage their challenging behaviour.\n\nUnderstand and manage challenging behaviour\n\nThe symptoms of dementia vary (depending on the cause and the individual), but often include memory loss, mood changes, communication and motivation problems, a reduced ability to plan and problems with controlling their own behaviour.\n\nSome symptoms, such as restlessness, agitation and communication difficulties, can be challenging for you as a carer, and this can cause you high levels of stress and burden.\n\nLearn from other dementia carers and academic experts\n\nDr Alison Coates is a dual-trained adult and mental health nurse and has experience of working in a range of different clinical environments. She is the author of the textbook ‘Nursing Older People’ and currently works at the University of Birmingham teaching mental health nursing with a focus on older adults. Dr Chris Wagstaff has experience of working in a variety of different clinical environments over the past 25 years and has taught widely about a number of different mental health issues.  Nutmeg Hallett has a background in forensic nursing, is currently undertaking PhD research investigating violence prevention in clinical settings and is a lecturer in mental health nursing.\n\nIn this course, we will use case studies to explore these challenging behaviours and find out how other carers manage them both at home and in a residential care setting. You will explore how using a person-centred approach can reduce challenging behaviours. We will cover specific interventions that can help you, particularly focusing on de-escalation skills.\n\n\n                                    ", 
    "end_date": "2016-05-30T00:00:00Z", 
    "title": "Dementia: Understanding and Managing Challenging Behaviour", 
    "price": 0, 
    "instructors": "Christopher Wagstaff", 
    "institution_name": [
        "University of Birmingham"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/dementia?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-09T00:00:00Z"
}