{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    Diabetes and obesity are growing health problems in rich and poor countries alike. With this course you will get updated on cutting-edge diabetes and obesity research including biological, genetic and clinical aspects as well as prevention and epidemiology of diabetes and obesity. All provided by high-profile scientists from one the world's leading universities in diabetes research.\n\nWe hope you will enjoy our course\n\nBest Wishes\n\nJens Juul Holst, Signe Sørensen Torekov and Nicolai Wewer Albrechtsen\n\nDepartment of Biomedical Sciences\nNovo Nordisk Foundation Center for Basic Metabolic Research \nFaculty of Health and Medical Sciences\nUniversity of Copenhagen\n\n                                            Syllabus\n                        Introduction and epidemiology of diabetes We are delighted to be able to welcome you to Diabetes – a Global Challenge. In module 1, we will focus on the epidemiology of diabetes and obesity which we lead us to this week discussion topic: \"What the greatest diabetes challenges of our time might be in your opinion?\"  You can either post your opinion as text or as a link to a short video statement.Obesity and Prevention of DiabetesWe will start module 2 together by discussing physical activity, its influence on obesity, insulin resistance and the prevention of diabetes.Physiological Regulation of Plasma Glucose During module 3 we will focus on physiological  regulation of plasma glucose. Professor Jens Juul Holst will guide you through the complex regulation of glucose in humans. This will be difficult but hang on you will see the usefulness of what you learn in this module during the subsequent modules where we will discuss the incretins and treatment of hyperglycemia The incretinsIncretin biology  is now applied in treating subjects with diabetes and recently approved by the FDA for weight reduction. But what does they do? Don't hesitate to start watching the videos because in this module you will learn all about the incretin lead byProfessor Jens Juul HolstClinical manifestation of Diabetes and TreatmentWe hope that you enjoyed last modules about glucose regulation and incretin biology thus it may seems more advanced compared to first modules.We hope you stay with us and learn more about Clinical Manifestation of Diabetes and Treatment by Professor Allan Vaag and treatment of hyperglycemia by Professor Sten Madsbad.Inflammatory Beta-cell Destruction in DiabetesInflammatory beta-cell destruction in diabetes by professor Thomas Mandrup-Poulsen. During this module we Professor Mandrup-Poulsen will guide you through cytokines mediated destruction of the pancreatic beta-cells furthermore their potentiality as drugs targets.  Genetic Aspects of DiabetesGenetics are important for understanding and treating diabetes. In this module Professor Torben Hansen will discuss the genetic aspects of diabetesTranslational AspectsTranslational medicine? Learn more by watching our new module by Assistant Professor Torekov. In this module we will discuss two case of translational aspects to highlight its importance. In other words we will go from bench to bedside.Development of antidiabetic agentsHave you ever thought \"how to develop a antidiabetic agent?\" Professor Birgitte Holst will take you through some potential drug targets and how to use G-protein coupled receptor for treatment of diabetesStem Cell Based Therapy of DiabetesModule 10 will focus on 'Stem Cell Based Therapy of Diabetes' and the question 'What are the advantages and disadvantages in cell therapy of diabetes?' is raised by Professor Ole Dragsbæk-Madsen. Peer Graded AssignmentTry to summarize all what you have learn watching these modules and have fun with writing a peer-graded assignment. The goal is simply to integrate what you have learned and put this together in a practical solution based manner. \n                                    ", 
    "end_date": "2016-08-22T00:00:00Z", 
    "title": "Diabetes - a Global Challenge", 
    "price": 0, 
    "instructors": "Jens Juul Holst and Signe Sørensen  Torekov", 
    "institution_name": [
        "University of Copenhagen"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/learn/diabetes", 
    "duration": "11 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}