{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    Cancer is a disease that affects around one-third of the human population, irrespective of nationality or ethnic origins. There are many types of cancer, but they all have one thing in common - they begin as rebel or mutant cells.\n\nUnderstand the DNA mutations behind cancer\n\nIn this free online course, you’ll learn about the fundamental biological concepts that inform our current understanding of cancer development, the molecular genetics behind it and its spread within the body.\n\nOver six weeks, we’ll explore some of the fundamental differences between normal cells and cancer cells. We’ll introduce the concept of DNA mutations and the emerging area of epigenetics, identifying how cancer cells are able to trick our blood vessels and immune system to grow uncontrollably.\n\nFinally, we’ll discuss how our understanding of genetics has helped both refine conventional treatments like radiation and chemotherapy, and inform the design of new treatments that can target specific proteins within cancer cells.\n\nLearn with leading researchers and clinical oncologists\n\nOn the course, you’ll learn with some of the University of Bath’s leading cancer researchers, as well as clinical oncologists who treat cancer everyday at the Royal United Hospital in Bath.\n\nThe course will give you a taster of studying this subject further, whether at undergraduate or postgraduate level. You can visit the university’s Department of Biology and Biochemistry or Department of Pharmacy and Pharmacology to find out more about the programmes available and the research they carry out.\n\n\n                                    ", 
    "end_date": "2016-10-17T00:00:00Z", 
    "title": "Inside Cancer: How Genes Influence Cancer Development", 
    "price": 0, 
    "instructors": "Momna Hejmadi", 
    "institution_name": [
        "University of Bath"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/inside-cancer?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-05T00:00:00Z"
}