{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    Frecuentemente nos llegan noticias sobre la aparición de nuevas infecciones virales: un nuevo virus de la gripe H7N9 en China, que se ha cobrado ya varias muertes; una nueva cepa de coronavirus en Oriente Medio y Europa; casos de fiebres tropicales y dengue en el sur de Europa o brotes del virus del Nilo Occidental en mitad de los EE.UU. Síndrome Respiratorio Agudo y Severo (SARS), Ébola en África, gripe aviar H5N1, gripe porcina en México, SIDA, … Se calcula que la denominada gripe española de 1918 causó más de 25 millones de muertos. Desde que se descubrió el primer caso de SIDA en 1981, ha habido unos 60 millones de personas infectadas de las cuales más de 20 millones han muerto. ¿Qué tienen en común todas estas infecciones?: que han sido causadas por un virus. Hoy en día, en pleno siglo XXI, ¿puede un virus cambiar el mundo?, ¿puede haber una nueva epidemia mundial?, ¿por qué surgen nuevas infecciones virales? En este curso el Dr. Ignacio López-Goñi explicará qué es un virus, cómo se trasmiten, hablará de cuál es el origen del virus del SIDA y de cómo se originan los nuevos virus de la gripe. Os enseñará cómo se puede trabajar con ellos y cómo podemos controlarlos. Todo ello con los últimos avances científicos en virología. Contestará a estas y otras preguntas en un lenguaje científico pero muy divulgativo\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Pandemias: nuevas infecciones virales", 
    "price": 0, 
    "instructors": "Ignacio López-Goñi", 
    "institution_name": [
        "Universidad de Navarra"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursesites.com/webapps/Bb-sites-course-creation-BBLEARN/courseHomepage.htmlx?course_id=_279505_1", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Open Education by Blackboard"
    ], 
    "start_date": "2013-12-19T00:00:00Z"
}