{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    Talking about cancer can be tough. You might be worried that you’ll say the wrong thing or that you simply don’t know enough about the subject. Perhaps you feel unsure about how the conversation will go or you’ve tried in the past and had a difficult experience. Maybe you’re not even sure if it’s your job.\n\nIn this course, you’ll learn how to encourage people to make healthy lifestyle changes, access local services or visit their doctor promptly if they notice changes to their body. You’ll develop a personal plan for talking about cancer and where to find reliable  information.\n\n1 in 2 people will develop cancer in their lifetime, and at Cancer Research UK we think it’s essential to get people talking about the disease. This course will give you the tips, tools and confidence to have simple, effective conversations that could help save lives.\n\nLearn with experts from Cancer Research UK\n\nThe course will draw on the knowledge of experts from Cancer Research UK, led by Cancer Awareness Trainers with a wealth of experience talking to patients, families and health workers. You will meet people with first-hand experience of talking about cancer, listen in on different conversations and learn best practices for discussing cancer.\n\nBuild up confidence to talk about cancer\n\nThis free online course will help you:\n\n\n  understand the facts\n  develop your approach\n  share good practice\n  and build your confidence\n\n\nOver the course of 3 weeks, we will equip you with tips and tools to talk about cancer without feeling embarrassed or awkward, enabling you to make a real difference to people’s lives.\n\n\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Talking About Cancer", 
    "price": 0, 
    "instructors": "Gillian Kilgour", 
    "institution_name": [
        "Cancer Research UK"
    ], 
    "commitment": "1 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/talking-about-cancer?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}