{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/americandisease\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/americandisease-001/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    americandisease-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This online course introduces the history and practice of drug policy. Students will learn about drug laws and their origins, and the complex task of drug policy analysis. The course also tackles contemporary issues in drug control, such as marijuana policy and prescription drug misuse. At the completion of this course, students should be able to:Discuss federal and state responses to drugs from the late 1800s to the presentCompare pre-and post-Nixon-era drug policyAnalyze drug policies to determine how well they advance stated goalsDescribe how processes in the brain are affected by drug use and addiction\n\n                                            Syllabus\n                        Part 1: A Short History of Drug Control\n1. Course Introduction and Syllabus\n2. Drugs in the New Republic and Federal and State Responses\n3. The Nixon Era\n4. After Nixon – present\n5. Introduction to Drug Policy Analysis (Use Reduction &amp; Harm Reduction)Part 2: Special Topics in Drug Control\n6. Marijuana Policy\n7. Nonmedical Use of Prescription Drugs8. The Brain and Addiction\n9. Law Enforcement and Crime10. Global and Innovative Approaches \n                                    ", 
    "end_date": "2014-09-22T00:00:00Z", 
    "title": "The American Disease: Drugs and Drug Control in the USA", 
    "price": 0, 
    "instructors": "Kevin Sabet and Michael Nias", 
    "institution_name": [
        "University of Florida"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/course/americandisease", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-07-14T00:00:00Z"
}