{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/mentalhealth\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/mentalhealth-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    mentalhealth-001\n                                                                    mentalhealth-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Mental health and mental illness used to be something that people didn’t\ntalk about, but now it seems every time we open a newspaper we are hearing\nabout the importance of mental health, or the consequences of mental illness.\nAt this point in our history we understand mental illness and mental health\nto be largely influenced by biological factors, specifically, workings\nof the brain. At the same time, we have always known that social factors\nplay a very strong role in promoting mental health and can make big differences\nin who gets mentally ill, who gets treated for mental illness, and how\npeople can achieve good quality of life after a mental health diagnosis.\n\nThis course is an opportunity to explore how social practices and ideas\ncontribute to the ways in which society, families and individuals are affected\nby mental health and mental illness. We will look at issues like why some\npeople think mental illness is a myth, how people think about mental health\nand illness in different cultures, who gets mentally ill and why, how families\nare affected by mental illness and what interventions are available to\ntreat mental illness and promote mental health.\n\n                                            Syllabus\n                        Week One: A brief history of madness \nWeek Two: What is mental health and what causes mental\n    illness?\nWeek Three: The social context of diagnosis and treatment\n    of mental illnesses\nWeek Four: Culture, mental health and mental illness\nWeek Five: Families, caregiving and mental illness\nWeek Six: Society, communities and mental health\n                                    ", 
    "end_date": "2013-08-05T00:00:00Z", 
    "title": "The Social Context of Mental Health and Illness", 
    "price": 0, 
    "instructors": "Charmaine Williams", 
    "institution_name": [
        "University of Toronto"
    ], 
    "commitment": "5-7 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/course/mentalhealth", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2013-06-24T00:00:00Z"
}