{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    Understanding Drugs and Addiction, is also running in Chinese, starting 25 April 2016. To find out more and enrol, visit the course page.\n\nWe are all touched by addiction – personally, within our circle of family and friends, and within our community. Addiction and its related harms can be crippling for those affected and the people around them.\n\nBut how does addiction develop? What can we do to treat it? And what can we do to prevent it?\n\nExplore how addiction develops\n\nIn this free online course, we’ll explore how addiction develops, looking at the environmental, genetic and personal risks involved.\n\nWe’ll examine what happens when a drug enters your body and your brain, how your brain changes, and how this process can make recovering from addiction such a challenge.\n\nYou’ll learn how we can best treat addiction, and how national and international policies help limit the harms from addiction.\n\nMeet experts in addiction science and treatment\n\nKing’s College London is a world leader in the science and treatment of addiction. Educators on this course are drawn from a variety of disciplines throughout the university, and work together to understand and respond to addiction.\n\nEach week, we’ll be joined by some of the world’s leading scientists, who will present cutting edge neuroscientific research - research that will lead to a greater understanding of how addiction develops and how we can treat it most effectively.\n\nBy understanding addiction, we can shed light on the greater issues of self-control and choice. Indeed, we will develop a greater understanding of ourselves.\n\n\n                                    ", 
    "end_date": "2016-04-18T00:00:00Z", 
    "title": "Understanding Drugs and Addiction", 
    "price": 0, 
    "instructors": "Kyle Dyer", 
    "institution_name": [
        "King's College London"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/understanding-drugs-and-addiction?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-03-07T00:00:00Z"
}