{
    "selfpaced": false, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    Существует множество инфекционных заболеваний, причины которых долгие годы казались необъяснимыми. Только в последние десятилетия стало понятно: более 70% из них вызваны вирусами. Причина большинства случаев рака печени — вирусы гепатитов В и С, рака шейки матки – папилломавирусы, более половины случаев диабета 2-го типа обусловлено последствиями заражения вирусом краснухи и другими вирусами. Вирусы — это то, что касается каждого из нас.\nВ нашем курсе вы узнаете о том, как устроены вирусы, чем они отличаются от живых организмов и какие механизмы используют для того, чтобы поразить клетки человека. Это поможет вам понять, как работают противовирусные препараты и вакцины. \nОРВИ, кишечные инфекции, гепатиты, корь, краснуха, бешенство, СПИД — вот далеко не полный список заболеваний, которые имеют вирусную природу. Разобраться в многообразии вирусов вам помогут учёные, которые каждый день работают с ними в лабораториях. Они расскажут об актуальных проблемах и задачах современной вирусологии, которые у всех на слуху. Например, о том, зачем исследователи воссоздали вирус гриппа «испанки», унёсший в начале прошлого века десятки миллионов человеческих жизней, а также о том, что такое вирус Эбола, и почему он опасен.\nВы побываете в современной вирусологической лаборатории и увидите, как нужно работать с вирусами, чтобы исключить вероятность заражения персонала и выхода вируса за пределы лаборатории. И конечно же, вы узнаете, как можно использовать вирусы на благо человека.\n\n                                            Syllabus\n                        Введение в вирусологиюВ этом модуле вас ждёт знакомство с миром вирусов. Вы познакомитесь с основными понятиями, которыми пользуются ученые для описания вирусных частиц, с принципами классификации вирусов, а также с тем, как развивается противовирусный иммунный ответ, и какие существуют методы диагностики вирусных инфекций. Кроме того, чтобы вам было легче ориентироваться в описании жизненного цикла вирусов, мы вспомним основные молекулярно-биологические процессы, которые происходят в клетках.Острые респираторные вирусные инфекцииПрактически все люди время от времени сталкиваются с респираторными заболеваниями. Основная причина их возникновения — вирусы. В этом модуле мы расскажем, представители каких вирусных семейств вызывают ОРВИ, каковы особенности их жизненного цикла, а также какие симптомы, кроме респираторных, могут вызывать те или иные вирусные агенты.Гастровирусы и вирусы гепатитов А, В и СЭта часть нашего курса посвящена вирусам, которые вызывают гепатиты и кишечные заболевания. Несмотря на обобщающее название, причинами гепатитов могут быть совершенно различные вирусы. Мы расскажем, какие именно вирусы вызывают различные гепатиты, какие существуют методы лечения, и как можно обезопасить себя от заражения. Кроме того, в этом модуле вы узнаете, какие вирусы могут вызывать острые кишечные инфекции, как они устроены, и какие механизмы используют для поражения клеток человека.Разные вирусыВ этом модуле собрана информация о важных и интересных вирусных семействах, представители которых вызывают такие всем известные заболевания, как бешенство, краснуха, герпес, СПИД и другие. Вы узнаете о том, как устроены эти вирусы, почему они способны вызывать те или иные симптомы, а также какие средства лечения и профилактики этих болезней уже разработаны.Особо опасные вирусы и принципы биологической безопасностиО вирусе Эбола сейчас знает практически каждый человек. Самые опасные вирусы, которые казались лишь объектом изучения немногих вирусологических лабораторий в мире, оказались на первых полосах мировых новостей. Что представляют собой вирусы, способные вызывать устрашающие геморрагические лихорадки и другие опасные заболевания, вы узнаете в этом модуле. А также мы расскажем, как организуются лаборатории, в которых учёные могут безопасно работать с такими опасными агентами, как, например, вирус натуральной оспы.Антивирусные препараты и вакцины Заключительная лекционная часть нашего курса посвящена тому, как разрабатываются новые противовирусные препараты, учитывая накопленные знания об особенностях жизненных циклов различных вирусов. Кроме того, в этом модуле мы расскажем и о том, какие бывают вакцины , из чего они состоят, а также об антивакцинаторском движении и некоторых последствиях его активности. В заключительных лекциях  модуля вы узнаете и о том, каким образом сейчас используют вирусы на благо человека.Заключительная неделя: практические задания Заключительная неделя курса не содержит новых лекций. Мы предлагаем вам в течение этой недели освежить материал курса и выполнить два задания: пройти итоговый тест по курсу и написать небольшую письменную работу.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Основы вирусологии (Introduction to Virology)", 
    "price": 0, 
    "instructors": "Sergey Netesov, Margarita Tarasova and Artem Tikunov", 
    "institution_name": [
        "Novosibirsk State University "
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/learn/nsu-virology", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}