{
    "selfpaced": true, 
    "topic_name": [
        "Disease & Disorders"
    ], 
    "description": "\n\n                    \n                    \n                    超级细菌肆虐、感染无药可医，人类正面临前所未有的困境。\n面对这危及每个人的严酷现实，是坐以待毙还是奋力反击？相信你心中已有答案。\n本课程将以独特、新颖的视角，为你展现抗菌药和超级细菌间博弈的历程；以深入浅出、生动形象的课件，教你抗菌药与超级细菌的知识；以浅显易懂、亦庄亦谐的教学情景剧，让你辩证地看待菌药的关系。\n战争已经打响，智慧勇敢的你，快来加入我们的行列，从自身做起阻止超级细菌的产生与蔓延。\n\n                                            Syllabus\n                        开课致辞你是否知道，在没有抗菌药的时代，人们可能因为一次普通的感染而丧命？你是否以为，在有着众多抗菌药的今天，面对细菌感染我们大可高枕无忧？你听到了吗？战争的号角已经吹响！超级细菌魔鬼般汹汹来袭，它在宣战！天使般庇护人类的抗菌药已岌岌可危！天使和魔鬼间的殊死搏战已是剑拔弩张！    我是复旦大学药学院汤文璐，医药学者和师者的双重使命促使我开设了这门MOOC，为人类打赢这场博弈克尽一份绵薄之力：敲响超级细菌肆虐的警钟，传播实用易懂的抗菌药知识，提高合理使用抗菌药的意识，教育民众投入延缓耐药菌产生的实际行动。    这场天使和魔鬼的博弈，战况的介绍按MOOC特点分为7个专题，每个专题介绍4个知识点；按照传统课程的说法，就是整个课程有7章28节的内容。    来吧！让我们一起走进这门MOOC——《抗菌药与超级细菌 — 天使与魔鬼的博弈》，找到遏制抗菌药滥用与反击细菌耐药的答案。当你们每一位学习者都成了抵御细菌耐药的生力军，我们终将赢得这场菌药博弈。WEEK1：第一章 超级细菌的肆虐激烈的博弈打响了！正邪较量，知己知彼方能百战不殆。首先就让我们揭开魔鬼的面纱，看清超级细菌的真面目，这就是第一章——超级细菌的肆虐。    本章分为四个小节，第一节领教魔鬼的威力；第二节摸清细菌的家底；第三节剖析细菌耐药的原因；第四节洞悉除魔的方略。    超级细菌肆虐，人类正被逼向后抗生素时代的险境。不战则亡。同学们，让我们应战吧：迎击魔鬼拯救人类！WEEK2：第二章 抗菌药的发现历史曾经，抗菌药天使般拯救人类脱离感染的困境；如今，抗菌药却成了魔鬼的温床！要说清抗菌药的是是非非，还得从源头说起。让我们在历史长河里漫游，用一个个人文故事串起抗菌药诞生的科学之旅，这就是第二章——抗菌药的发现历史。    本章分为四个小节，第一节追溯抗菌药的前身——迎击病原；第二节揭幕抗菌药的里程碑——百浪多息；第三节发射抗菌药的原子弹——青霉素；第四节苦寻白色瘟疫的克星——链霉素。    每一种熠熠生辉的抗菌药如天使降临，曾挽救了病菌感染中痛苦挣扎的人类。这段历史值得铭记，更呼唤我们每个人担负起护佑天使的重任。WEEK3：第三章 抗菌药的分类与机制天使降临，人类有了遏制魔鬼的武器；但超级细菌横行，抗菌药威力每况愈下。菌药鏖战之际，我们不能打无准备之仗，必须对抗菌药这一利器有全面透彻的了解和把握，这就是第三章——抗菌药的分类与机制。    本章分为四个小节，第一节概览抗菌药的法宝；第二节了解攻破细菌铠甲和防护衣的抗菌药；第三节认识剥夺细菌生命基础的抗菌药；第四节知晓阻断细菌繁殖根源的抗菌药。    即便你是非医药专业的普通人，掌握疗效秘笈成为了抗菌药作用百事通，不仅可在日常生活中受益匪浅，更可在这场菌药博弈中助天使一臂之力。WEEK4：第四章 抗菌药的不良反应武器，既可杀敌也可自伤；抗菌药，就像一把双刃剑，给人类带来极大的益处也造成意想不到的伤害。掌握了抗菌药疗效的一面，同样需要了解其存在安全隐患的另一面，这就是第四章——抗菌药的不良反应。    本章分为四个小节，第一节解读“是药三分毒”、洞悉药物不良反应；第二节了解抗菌药常见的不良反应；第三节知晓抗菌药特殊的不良反应；第四节把握抗菌药不良反应的防治措施。    具备抗菌药物不良反应的知识，我们既能高悬达摩斯之剑对其安全隐患常保警惕之心，以免伤及自身；也能果断出招智慧用药，尽显抗菌威力，用好抗菌药这把双刃剑。WEEK5：第五章 抗菌药的滥用抗菌药如天使拯救了人类，人类的肆意妄为却深深地伤害了这位天使。自吞苦果，人类集体成了耐药一族，当真正的恶魔——超级细菌来袭时，已无药可医！这就是第五章——抗菌药的滥用。    本章分为四个小节，第一节概览抗菌药从“原子弹”沦落至望“菌”兴叹的滥用状况；第二节挖掘抗菌药滥用的深层次原因；第三节展现抗菌药滥用的骇人后果；第四节揭示抗菌药滥用的防控宝典。    正是抗菌药的滥用催生了超级细菌，恰似天使孕育了魔鬼。痛定思痛，让我们积极行动起来，人人智用、善用抗菌药，呵护天使、停止滥用、斩断魔鬼的温床。WEEK6：第六章 抗菌药的使用误区儿时的记忆是否似曾相识：一有头疼脑热，焦急的妈妈就像搬来救星般递上了抗菌药……然而，抗菌药并不是“万能药”，不同人群也有不同的用药方法和用药剂量，不能千人一药。特别的抗菌药，给特别的“你”，这就是第六章——抗菌药的使用误区。    本章分为四个小节，第一节切忌盲目跟风，直击日常生活中抗菌药的八大使用误区；第二节不可爸爸吃啥我吃啥，剖析儿童抗菌药的使用误区；第三节其实母子相连，提醒怀孕和哺乳期的妈妈抗菌药的合理使用；第四节须知特殊人群特殊对待，警示年老和肝、肾病者抗菌药的合理使用。    人类因蒙昧无知而误用错用抗菌药，致使天使折翼魔鬼逞凶。让我们迷途知返，用知识武装自己、合理使用抗菌药，细心呵护人类健康的守护天使，不给魔鬼可乘之机。WEEK7：第七章 抗菌药的监管“抵御耐药性——今天不采取行动，明天就无药可用！”2011年世界卫生日的主题警示着：耐药菌横行魔鬼当道、抗菌药告急天使式微，战事已到了生死存亡的危急关头。起来，不愿被魔鬼蹂躏的人们，让我们站在全球的战略高度既严防死守更主动出击，誓要打赢这场菌药之战！这就是最后的第七章——抗菌药的监管。    本章分为四个小节，第一节聚焦WHO如何协调各国联动亮剑，遏制耐药菌的嚣张气焰；第二节且看“买抗生素比买枪还难”的美国如何斩妖除魔；第三节一睹“连动物使用抗菌药也受管制”的欧盟如何围追堵截；第四节见证“监管之路曲折但毅然前行”的中国如何知难而进。    天使与魔鬼的激战已呈白热化，如何应对菌药博弈已是全人类的命题。要完胜这场战争，你、我、他，我们每个人都要积极应战！虽任重道远，但我们众志成城。\n                                    ", 
    "end_date": "2016-01-14T00:00:00Z", 
    "title": "抗菌药与超级细菌 －－天使与魔鬼的博弈", 
    "price": 0, 
    "instructors": "汤文璐", 
    "institution_name": [
        "Fudan University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/learn/kangjunyao-chaojixijun", 
    "duration": "7 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-11-26T00:00:00Z"
}