{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><em>Este curso usa a versão mais atual do Adobe Spark Video (antigo Adobe Voice).</em></p>\n\n<p><em><strong>Todos os vídeos deste curso foram criados usando Adobe Spark Video no IPad.</strong><br></em></p>\n\n\n\n<p>Chega de apresentações bonitas e chatas. Crie videos dinâmicos e atraentes, narrados ou não, de forma simples e rápida usando apenas seu IPad / IPhone e o <strong>Adobe Spark Video</strong> (gratuito!). </p>\n\n\n\n<p><em><strong>Criar videos no Adobe Spark Video é mais rápido do que criar apresentações usando PowerPoint ou Keynote !</strong></em></p>\n\n\n\n<p><strong>Crie Videos ou Cursos Inteiros Para:</strong></p>\n\n\n\n<ul><li>Aulas on-line ou presenciais;</li><li>Demonstração de produtos e serviços;</li><li>Apresentação de ideias;</li><li>Propaganda;</li><li>E muito mais !</li></ul>\n\n\n\n<p><strong>Por que usar videos ao invés de apresentações tradicionais ?</strong><br></p>\n\n\n\n<ol><li>Pessoas consumem videos diariamente em propagandas na TV, em painéis em shoppings, para se divertir (YouTube) e até para estudar !</li><li>Videos podem ser publicados facilmente na Internet, permitindo que seus alunos ou clientes possam assistir os videos quantas vezes quiserem.</li><li>A mistura de som e imagens em movimento aprimora a retenção da informação.</li><li>Bons videos são envolventes.</li></ol>\n\n\n\n<p><em><strong>Qualquer pessoa pode aprender a criar videos !</strong></em><br></p>\n\n\n\n<p>Diferente das ferramentas de apresentação tradicionais, o Adobe Spark Video foi projetado para criar videos de forma muito rápida. Nada da complexidade de ferramentas como PowerPoint ou Keynote. Com o Adobe Spark Video, todo o processo é simplificado, para você focar apenas no conteúdo e na mensagem.</p>\n\n\n\n<p><strong>Objetivos e Conteúdo do Curso</strong></p>\n\n\n\n<p>Neste curso, você aprenderá como planejar e criar videos e até cursos inteiros, de forma rápida e eficiente, usando apenas seu IPad / IPhone e o Adobe Spark Video. Crie videos onde quer que você esteja!<strong></strong></p>\n\n\n\n<p>Além de cobrir todas as funcionalidades do Adobe Voice, este curso orienta sobre como planejar seus videos e até cursos inteiros, usando uma metodologia que estimula a velocidade. O próprio Adobe Spark Video foi projetado para velocidade na criação de videos.</p>\n\n\n\n<p>O curso também orienta sobre as diversas formas de compartilhar seus videos. V<strong>ocê pode até criar um Canal Próprio no YouTube !</strong></p>\n\n\n\n<p><strong>IMPORTANTE !</strong> Você não está sozinho nesta jornada, use o recurso de Discussões para me fazer perguntas. Eu te ajudarei nesta jornada de transformar seu conteúdo e videos interessantes e agradáveis.</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Adobe Spark Video : Crie Cursos e Aulas na Velocidade da Luz", 
    "price": "20.00", 
    "instructors": "Professor Paulo Andrade, Ph.D.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441634_3a13_4.jpg", 
    "course_url": "https://www.udemy.com/aprenda-adobe-voice/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T01:34:58Z"
}