{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><em></em><em>This course uses the latest version of Adobe Spark Video (previous know as Adobe Voice).</em></p>\n\n<p><em><strong>All the videos in this course were created using Adobe Spark Video, a free IPad, IPhone App from Adobe. Spark Video is also a Web Tool. Videos are coming !</strong></em></p>\n\n<p>No more beautiful and boring presentations. Create dynamic and attractive videos, narrated or not, easily and quickly using only your iPad / IPhone and Adobe Spark Video (Free!).</p>\n\n<p><strong>Create videos in Adobe Spark Video is faster than creating presentations using PowerPoint or Keynote!</strong></p>\n\n<p><strong>Create Videos or Whole Courses To:</strong></p>\n\n<ul><li>Help in online or face to face classes;</li><li>Explain something;</li><li>Introduce products and services;</li><li>Present ideas;</li><li>And much more!</li></ul>\n\n<p><br></p>\n\n<p><strong>Why use videos instead of traditional presentations?</strong></p>\n\n<ol><li>People consume videos daily in TV ads, on billboards in shopping malls, for fun (YouTube) and even to study!</li><li>Videos can be easily published on the Internet, allowing your students or clients to watch the videos as many times as they wish, and anywhere.</li><li>The mix of sound and moving images improves the retention of information.</li><li>Good videos are engaging.</li></ol>\n\n<p><em><strong>With this course, anyone can learn to create videos!</strong></em></p>\n\n<p>Unlike traditional presentation tools, Adobe Spark Video is designed to create videos fast and without the complexity of tools like PowerPoint or Keynote. With Adobe Voice, the whole process is simplified so  that you can focus on the content and the message.</p>\n\n<p><strong>Objectives and Course Content</strong></p>\n\n<p>In this course, you will learn how to plan and create videos and entire courses, quickly and efficiently, using only your iPad / IPhone and Adobe Spark Video. You can create your videos wherever you are.</p>\n\n<p>In addition to cover all Adobe Spark Video´s features, this course guides you on how to plan your videos and courses using a methodology that fosters speed. Adobe Spark Video itself was designed for speed.</p>\n\n<p>This course also provides guidance on the various ways to share your videos. <strong>Y</strong><strong>ou can even create your own YouTube Channel!</strong></p>\n\n<p><strong>IMPORTANT! </strong>You are not alone on this journey, use the Discussion feature to ask me questions. I will help you on this journey to transform your content in interesting and enjoyable videos. And I included exercises for you to try and share.</p>", 
    "end_date": null, 
    "title": "Adobe Spark Video : Free Video and Course Creation Tool", 
    "price": "20.00", 
    "instructors": "Professor Paulo Andrade, Ph.D.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467122_69e2_4.jpg", 
    "course_url": "https://www.udemy.com/adobe-voice/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T03:27:53Z"
}