{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<span class=\"Apple-style-span\"><strong style=\"\">Why should you take this course?</strong></span>  </p>  <p>  \t<span class=\"Apple-style-span\">The most comprehensive, easy to understand, applicable set of adult education techniques on the planet. This 8 hour program is one of the most comprehensive, easy to understand, applicable set of adult learning techniques available anywhere. You&#039;ll learn everything you need to motivate adult learners, keep them interested, deal with challenging or disgruntled participants, and maximize learning. Whether you are a trainer looking for all of the tools you need, or your organization needs to quickly roll out a complete train-the-trainer curriculum, this is the program for you. </span>  </p>  <p>  \t<span class=\"Apple-style-span\"><strong style=\"\"> Bonus: I</strong>ncludes a 150+page workbook, training checklists, review templates and a learning style assessment.</span>  </p>  <p>  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p>  \t“I took this course from Jason on adult education, and it was a phenomenally useful experience.  Jason gave me a strong theoretical background for teaching adults, and also a huge arsenal of tools and strategies for engaging adults in the classroom.  I&#039;d recommend this course to anyone who needs to teach adults.&quot;  </p>  <p>  \t<strong style=\"\">- Simon Tanzman</strong>- Corporate Trainer  </p>  <p>  \t“Just wanted to thank you for the very helpful and informative Video Training these past two days.   Although I have taught adult users for &gt; 13 years at Midlands Tech. and have many student &#039;peace and war stories&#039; of my own, I feel like I learned many helpful tidbits of information that will be so very useful as I train the LMC staff in the future. Thanks again.&quot;  </p>  <p>  \t<strong style=\"\">- Stephanie DiMaggio</strong>- Credentialed Trainer  </p>  <p>  \t“It helped me understand effective communication techniques as well as group dynamics. These have set me up for success not only in direct teaching situations, but also in settings from small informal meetings all the way up to meetings with executives.&quot;  </p>  <p>  \t<strong style=\"\">- Aaron Rutkowski</strong>- Project Manager  </p>", 
    "end_date": null, 
    "title": "Adult Education Essentials: Boost Learning Production & ROI", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137188_eb3a_15.jpg", 
    "course_url": "https://www.udemy.com/training-essentials-of-adult-education/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-23T18:49:30Z"
}