{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Willkommen zu der Udemy Dozenten Community!</strong>  </p>  <p style=\"\">  \t               Wenn Sie ein neuer Dozent auf Udemy sind oder ein bestehender, der ein paar weitere Tricks lernen möchte, dann sind Sie an der richtigen Stelle. Dieser Kurs ist die erste Anlaufstelle für alle Dinge in Bezug auf die Kurserstellung. Das Udemy Dozenten Team hat diesen Kurs so konzipiert, dass er kontinuierlich weiterentwickelt und auf dem neusten Stand gehalten wird. Die folgenden Themen werden wir abdecken:  </p>  <ul style=\"\">  \t<li style=\"\">Wie erstellen Sie Ihren Udemy Kurs, vom Anfang bis zum Ende.</li>  \t<li style=\"\">Die Udemy Qualitätsstandards: damit Sie sicherstellen können, dass Ihr Kurs die Anforderungen erfüllt.</li>  \t<li style=\"\">Wie Sie Ihr Kursthema wählen, Ihre Zielgruppe identifizieren, und die Gliederung des Kurses planen.</li>  \t<li style=\"\">Wie Sie Ihren Kurs filmen: die praktischen Grundlagen für hervorragenden Ton und Video, und die entsprechende Bearbeitung, um Ihren Kurs ausgezeichnet aussehen zu lassen.</li>  \t<li style=\"\">Wie der Kurs erfolgreich in unserem Marktplatz mit Hilfe des Kursfotos, Werbevideo, und Kursseite positioniert wird, um Teilnehmer zu gewinnen.</li>  \t<li style=\"\">Der Udemy Review Prozess.</li>  \t<li style=\"\">Werbestrategien, Unterrichtstipps, und wie Änderungen nach der Veröffentlichung vorgenommen werden können.</li>  </ul>  <p style=\"\">  \t        Darüber hinaus, sehen Sie diesen Kurs als Startpunkt für die Entdeckung der Udemy Dozenten Community. Wir leiten Sie zu all unseren Ressourcen wie auch Communities in denen Sie sich mit anderen Dozenten und dem Udemy Team austauschen können.<br style=\"\">  </p>  <p style=\"\">  \t        Bereit für die Reise der Kurserstellung? Let&#039;s go!  </p>", 
    "end_date": null, 
    "title": "Anleitung zum Erstellen eines Udemy-Kurses", 
    "price": 0, 
    "instructors": "Udemy Dozenten Team", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/268386_fdba_2.jpg", 
    "course_url": "https://www.udemy.com/offizieller-udemy-dozenten-kurs/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-25T00:19:59Z"
}