{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<h4 style=\"\"><strong style=\"\">Mobile apps are empowering for people of all ages and abilities</strong></h4>  <p style=\"\">  \t        As librarians and educators, we are passionate about learning and access to information for all. Contrary to the popular idea that apps are only useful for “consumption,” the best mobile apps are being used effectively as tools to enable learning and knowledge creation.  </p>  <p style=\"\">  \t<strong style=\"\">Got iPads, but no time to discover the best apps?</strong>  </p>  <p style=\"\">  \t        If you’ve ever felt overwhelmed by the number of apps available and not sure where to start with finding the best ones, you’re not alone!  </p>  <p style=\"\">  \t        Many librarians have told me that they feel  </p>  <ul style=\"\">  \t<li style=\"\">excited about having new iPads, but not sure of the best apps to recommend and use.</li>  \t<li style=\"\">overwhelmed by the sheer number of apps available.</li>  \t<li style=\"\">unsure where to start with finding and evaluating the best educational apps.</li>  \t<li style=\"\">worried about the digital divide and the loss of access to information for all.</li>  </ul>  <p style=\"\">  \t        You might have new iPads in your library or school, but what are the best learning experiences you can create with them? You know that just throwing technology at a problem is NOT the way to go.  </p>  <p style=\"\">  \t<strong style=\"\">When you become “app-literate,” you serve your community by becoming their go-to expert on mobile apps.</strong>  </p>  <p style=\"\">  \t        When you become an app expert, you become the go-to person for your community—evaluating, reviewing and recommending the very best apps for knowledge creation and active learning. You gain influence in your community by designing innovative programs and services that use mobile apps for learning.  </p>", 
    "end_date": null, 
    "title": "Apps for Librarians & Educators", 
    "price": "50.00", 
    "instructors": "Nicole Hennig", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8621_1136_5.jpg", 
    "course_url": "https://www.udemy.com/apps4librarians/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-07-17T20:31:58Z"
}