{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<strong style=\"\">Diseño y desarrollo de ambientes educativos interactivos</strong>  </p>  <p>  \t    Articulate Storyline te ofrece la posibilidad de desarrollar prácticamente cualquier tipo de contenidos altamente interactivo, sin necesidad de que tengas que ser un experto en programación o multimedia.  </p>  <p>  \tComenzaremos con lo básico e iremos avanzado hasta poder crear contenidos más atractivos, motivantes, efectivos, novedosos e interactivos.  </p>  <p>  \t<strong style=\"\">Gamificación: </strong> Gracias al uso de variables, condiciones y los disparadores, con  Articulate Storyline puedes crear contenidos más lúdicos que permitan  introducir estructuras creativas e innovadoras provenientes de los  juegos, de menara de convertir una actividad a priori aburrida en otra  actividad que motive a la persona a participar en ella.  </p>  <p>  \t<strong style=\"\">Escenarios y Roles:</strong> Saca provecho de la flexibilidad de trabajar con los personajes que te  ofrece Articulate Storyline y has que el alumno se involucre y sea  virtualmente parte del curso.  </p>  <p>  \t<strong style=\"\">Escenarios Ramificados:</strong>  Aprovecha las posibilidades  de branching o ramificación que ofrecen las preguntas y envía al alumno a  diferentes escenarios dependiendo de su respuesta y de sus  conocimientos previos  </p>", 
    "end_date": null, 
    "title": "Articulate Storyline 2: Desarrollando e-Learning interactivo", 
    "price": "50.00", 
    "instructors": "Sr. Patricio Bustamante M.", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374776_33d9_4.jpg", 
    "course_url": "https://www.udemy.com/articulate-storyline-2/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-21T01:46:08Z"
}