{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>What am I going to get from this course?</strong><strong></strong></p><p><strong>The best ever course on Udemy about the Prezi for creating handful,beautiful and attractive presentation.</strong></p><p><br><strong></strong></p><p><em>Get a free Prezi account at www.prezi.com, so you can do the hands-on exercises. That's all you need!</em><em></em><br></p><p><strong>Learn how to create stunning Prezi presentations quickly. </strong></p><p>Use powerpoint all the time? Sounds boring! Spice up your presentations and bolster them with creativity. Allow your students to create mind boggling presentations. Prezi is for ever<strong>yone. </strong></p><p><strong>Find out why millions of people have switched to Prezi</strong><strong></strong></p><p>Professional speakers, trainers, teachers, marketers, and anyone else who presents ideas to others will benefit from taking this course. If you regularly use Microsoft PowerPoint or Apple Keynote, you won't want to miss this opportunity to compare them to Prezi. Its open, infinite canvas gives you the freedom to break away from typical linear slideshows and wow your audience with exciting, cinematic movement. <br>This course is taught by a professional trainer, so you will benefit from instruction that is carefully designed to maximize your learning investment. Prezi concepts are clearly explained, and skills are carefully demonstrated. Detailed, step-by-step instructions for hands-on exercises are available to download and print. Experiential learning is a must for mastering the nuances of Prezi. </p><p><em>You should take this course if you are curious about what Prezi is and how it works. If you have already used Prezi this course is probably not for you.</em><em></em></p><p><em></em></p><p><strong>This course is developed teachers and educators in mind. However, since the course includes fundamentals, it can be taken by pretty much anybody! </strong><br></p><p><em></em></p>", 
    "end_date": null, 
    "title": "Be A Great Presenter Using Prezi", 
    "price": "20.00", 
    "instructors": "irtiza ali", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747042_c7d2_2.jpg", 
    "course_url": "https://www.udemy.com/great-presenter-using-prezi/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T17:02:46Z"
}