{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>You wake up every morning to go to work and your days have become a bona-fide daily grind, not to mention it's turning out to be a bit monotonous.  You can almost expect to constantly have to give your attention to those \"oh-so wonderful\" students that choose to make poor decisions all...day...long, or that \"special\" staff member that changes your mood (and not for the better) without even having to say a word, or even having to present or sit through a professional development that both the audience and the presenter knows will be ineffective. That is, unless you have the fundamentals.  You see, all of the fancy instructional strategies or critical pedagogy will continue to be useless to you personally if you don't have a clear understanding of some very key elements.</p>\n\n<p>At last! </p>\n\n\n\n<p> You now have access to a meaningful course for educators that reemphasizes that hard work, sacrifice, perseverance,  competitive drive, selflessness and respect for the common person is the price that every one of us must pay to win in life.  These often lost and forgotten treasures will be revisited in this course with an emphasis on having a <strong><em>WINNING ATTITUDE.  </em></strong>As an educator, whether you are an administrator, teacher or school personnel, you will be equipped to guide your  students to become champions, which will ultimately make your job easier.  This course is the<em> first in a series </em>from the <strong>Be a Winner Playbook for Educators </strong>where you will be reacquainted with the <em>discipline</em> and the<em> will </em>to win, which already lies in each educator.   </p><p>DISCLAIMER:  This course and presentation, including examples are provided for informational purposes only, the Instructors makes no warranties, either expressed or implied.<br></p>", 
    "end_date": null, 
    "title": "BE A WINNER: Become a Winning Educator at a Difficult School", 
    "price": "50.00", 
    "instructors": "Nikki Ace, Wesley Ace", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695996_2bc0_3.jpg", 
    "course_url": "https://www.udemy.com/be-a-winner-winning-attitude/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T23:54:29Z"
}