{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<em>Are people naturally drawn to you? Can you hold the attention of others?  Are you the person to go to when you need something easily explained?  </em>  </p>  <p>Whether you are looking to launch a training career, or you simply want to be more effective in sharing your information and teaching others, this course is for you.</p>  <p>  \t    Perhaps you are new to the world of workplace training or are an expert in your field and have to deliver training to your team. Either way we have your back, we've bundled decades of experience with the best links to research and resources from leading professionals around the world, into an easy to digest course.</p>  <p>  \t    This is a comprehensive, easy to understand introduction to the world of training. By completing the course you will learn the most quick and effective tips and tricks to kick start your journey to becoming a great trainer.  </p>  <p>  \t    An experienced facilitator is always looking for new resources, ideas and techniques to maximise their effectiveness in the classroom. This course will provide heaps of tips and tricks with a fresh perspective for seasoned veterans.  </p>  <p><strong><br></strong></p><p><strong>What am I going to get from this course?</strong><br></p>  <ul>  \t<li>Over 15 Lectures and 2 hours of video content.</li>  \t<li>A quick start to get you to a level of competency </li>  \t<li>Quick Wins - simple techniques  you can implement quickly to see immediate improvements.</li>  \t<li>A  selection of hacks or cheats that when applied, will prevent or solve some of the bigger problems that can disrupt learning.</li>  \t<li>A powerful 'trainer's toolkit' that you can build on throughout your career. </li><li>Learn from decades of experience to prevent making common rookie mistakes in the classroom.</li>  </ul>", 
    "end_date": null, 
    "title": "Become an Epic Workplace Trainer", 
    "price": "20.00", 
    "instructors": "Epic Learning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437334_ea59_13.jpg", 
    "course_url": "https://www.udemy.com/become-an-epic-trainer/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T08:29:36Z"
}