{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Are you tired of hearing people telling you how Udemy can make you millions?\n\n  </p>\n\n\n\n<p>Do you have at least one thing in the entire world you are good at?\n\n  </p>\n\n\n\n\n\n\n\n<p>If your answer to both questions is <strong><em>“YES”</em></strong>, then it’s time for you to harness the power of the ultimate passive income machine: Udemy.\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>Take The Best Seat In The House &amp; Master The Art Of Creating Udemy Courses That Sell. </strong>\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>You are going to learn:</strong></p>\n\n\n\n<ul><li>Creating an online course that sells</li><li>How to outperform your competitors</li><li>Becoming an instructor that people care about</li><li>How to gain thousands of students and their trust</li><li>Creating valuable content &amp; resources</li><li>Sustaining a career as an online video teacher on Udemy</li></ul>\n\n\n\n<p><br>I honestly believe that with Udemy you have the opportunity of a lifetime.<br></p>\n\n\n\n\n\n\n\n<p><strong><em>Here are more reasons why NOW is the best time for you to start teaching online:</em></strong></p>\n\n\n\n<ul><li>There are a lot of people out there who want to learn what you already know</li><li>Someone else is going to teach it to them when you could do it better</li><li>The online teaching world has never been more lucrative than it is right now</li><li>You can easily make a full time income teaching online</li><li>No one can teach exactly the way you can</li></ul>\n\n\n\n<p><strong><br>Contents And Overview</strong><br></p>\n\n\n\n\n\n\n\n<p>By the time you complete this course, you’ll be equipped with a powerful system to create online courses that other people buy and fall in love with.\n\n  </p>\n\n\n\n\n\n\n\n<p>First, we’ll cover how to pick a topic for your first online training. You’ll discover the exact process to pick a course topic other people want to learn about. \n\n  </p>\n\n\n\n\n\n\n\n<p>You’ll learn how to structure and outline your course, why it’s absolutely imperative to create a smaller course first to build up your following, and how to craft powerful sales material like a promotional video to turn visitors into paying students. \n\n \n\n The next section is all about becoming a Udemy instructor that other people can connect with. I’ll share with you proven tips &amp; strategies to guarantee an outstanding learning experience for your audience. We’ll also cover how to get tons of 5 star reviews and how you can outperform your competition.\n\n  </p>\n\n\n\n\n\n\n\n<p>Section 4 is about sustaining your online teaching career. I’ll get you in the right mindset; explain why you should never sacrifice quality for quantity, and how to meet your personal goals as an instructor on Udemy. \n\n  </p>\n\n\n\n\n\n\n\n<p>By the time you complete this training, you’ll know my exact blueprint to create high quality courses that other people buy like clockwork.\n\n \n\n \n\n  </p>\n\n\n\n\n\n<p>So enroll now and lets get started creating your future!\n\n  </p>\n\n\n\n\n\n\n\n<p>-Kendall Knight</p>", 
    "end_date": null, 
    "title": "Become An Online Course Creator People Love In 2016!", 
    "price": "20.00", 
    "instructors": "Kendall Knight, Sandor Kiss", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802560_43e9_4.jpg", 
    "course_url": "https://www.udemy.com/become-an-online-course-creator-people-love-in-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T03:16:04Z"
}