{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Bible 1 - Enjoy Reading the Bible - Use Sentence Block Diagram Method!</strong></p><p><strong>Learn Piano with Rosa -</strong><strong> </strong><strong>Rosa</strong><strong>'s Piano Online School\n-  Teaching 32 Courses!</strong></p><p><strong>OVER 10,000 </strong><span></span>Successful students\nhave already taken my piano online courses since July\n2014 with <strong>231 - 5 Star Reviews</strong></p><p><strong>Course Updated: </strong>November 15, 2015</p><p>*************************************************************************<br></p><p><strong>The Bible is the one book that we should read at least once in our life time!</strong></p><p>Do you enjoy reading the Bible?</p><p>Most people find the Bible difficult to read because of the layout of the Bible.  In many old versions, the verses are all cluttered together without any paragraph divisions.  Even with some of the newer versions where the verses are divided line by line, it is still difficult to absorb the message in the Bible.</p><p>Many serious Christians want to dig into the Bible to understand the main themes but only to discover that they are reading a lot of commentaries on the Bible rather than the Bible itself.  They are turning to reference books to read what the message of the Bible is about.  This is really a round about way to 'read' the Bible.</p><p>In this course, you are going to discover the message of the Bible by 'reading' the Bible, and not commentaries or other reference books.  You will be amazed at your progress when you use my method.</p><p><strong>Here's the Secret:  </strong>I am going to show you my Sentence BLOCK Diagram technique that will help you interact with the long difficult passages in the Bible. I will lay out the steps for you so that you can see how I modify the traditional \"sentence diagram\" to a much simplified method to understand the main theme and sub themes of the passage.  </p><p>After you learn my method, you will be able to further parallel the phrases and modifiers with their respective conjunctions in the passage. </p><p>You will see how the text of the Bible flow out in its structure that you can develop lesson outlines easily for Bible studies, sermons, and Sunday School.</p><p>You will discover great richness and deep insight into the Word of God.</p><p>Enroll into this course and let's have some fun together,<br></p><p>Rosa</p><p><br></p><p>***************************************************************************</p><p><strong>About Rosa's Piano Online Course:</strong></p><ul><li><em>Over </em><strong><em>10,000</em></strong><em> </em><em>very happy students already in my classes</em></li><li><em>See the </em><strong><em>5 Star Reviews</em></strong><em> from VERY satisfied students</em></li><li><em>You get free lifetime access</em></li><li><em>All videos are at your finger tips to watch anytime &amp; anywhere</em></li><li><em>All future extra lectures and upgrades are </em><strong><em>always free</em></strong></li><li><em>Unconditional </em><strong><em>30 day money-back guarantee</em></strong><em> and that's my personal promise to your success!</em></li><li><em>Join this happy family of students </em></li></ul><p><strong><em>Enroll into this course</em></strong></p><p><br></p><p><br></p><p><br></p><ul><li><em></em></li></ul>", 
    "end_date": null, 
    "title": "Bible #1 - Enjoy Reading the Bible - Sentence Block Diagram ", 
    "price": "20.00", 
    "instructors": "Rosa Suen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620132_11a7_3.jpg", 
    "course_url": "https://www.udemy.com/bible-1-enjoy-reading-the-bible-sentence-block-diagram/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T08:56:23Z"
}