{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t  Last update: January 17, 2016! Camtasia Mastery is for everyone who uses Camtasia Studio to make videos.  From beginners learning what the program is about, to experienced users who want to learn how to take animations and hosting to the next level, this course has loads of information for learners of all experience levels.  </p>  <p>  \t      The Camtasia Mastery sections are divided into several bite-sized videos.  This allows you to go through the course in order, or jump to any of the topics you need help with. Most videos are only 2-3 minutes long but the course is packed with over 6½ hours of instruction.  You can get exactly what you need, when you need it - no more scouring hours of videos to try and find the one nugget of information you need.  </p><p>Be sure to check out all of the course reviews to see how students love this course. From beginners to long-time users, you WILL learn how to best use Camtasia Studio.</p>  <p>  \t    Post your questions. I reply to most student questions and comments within 3 days (usually faster).  The best questions will get a video answer. I will create a video to fully answer great questions. Video answers (and questions) are shared with all students in a special section at the end of the course.  </p>  <p>  \t      If you are creating training videos with Camtasia, you will learn tricks and tips to save you time and make your videos look great!  </p>", 
    "end_date": null, 
    "title": "Camtasia Mastery - Creating Killer Videos w/ Camtasia Studio", 
    "price": "50.00", 
    "instructors": "Ron Hogue", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326562_324d.jpg", 
    "course_url": "https://www.udemy.com/camtasia-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T18:06:25Z"
}