{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>***BRAND NEW COURSE ON UDEMY - NOVEMBER 2015***</strong></p><p>Student Feedback:</p><p><strong><em>\"One of the best courses I've taken</em></strong></p><p><strong><em>One of the best courses I've taken. Succinct, well made, covered off the major points that I needed to know in order to get straight in and start using the Camtasia programme.</em></strong></p><p><strong><em>I'd bought Camtasia 6.0 back in the day, didn't really use it much as I never really got to grips with the basics. Found the editing and timeline stuff so bitty and difficult.</em></strong></p><p><strong><em>Years later (now) and I buy the upgrade Camtasia 8.0 and thought the interface looks better and cleaner, but still didn't feel too comfortable using it, but was willing to spend time learning it because I want to teach courses via Udemy.</em></strong></p><p><strong><em>A couple of weeks later and I somehow come across a promo for this course. It does exactly what it says on the tin. In the few lessons (27 at time of writing) it has got me up to speed and to the point that I feel truly comfortable just doing it...capturing my screen or presentation and then editing it quickly and without a load of fuss.</em></strong></p><p><strong><em>Well done...I highly recommend this course.</em></strong></p><p><em><strong>P.S. There is one other tip given in this course that truly knocked it out of the park for me and that I wish I'd known about 3 years ago...but that's life! \" </strong><em>Gareth Thomas</em></em><br><em>______________________________________________</em></p><p><strong><em>Wow!!! Great!!</em></strong></p><p><em><strong>I have been fascinated by your editing skills and lectures slides, so I was pleasantly surprised when I saw that you have made a course on it. And the step-by-step explanations really helped. Now I am also going to record some green-screen lectures for my courses. Wow - you saved me tons of research and trial and error. Thanks!! </strong> </em><em>Martin\nGeorgiev</em><br>_______________________________________________</p><p><strong><em>\"The Best</em></strong></p><p><em><strong>This Course is The best. I joined Two Courses Before But this one is the best.\" </strong></em><em><strong>Wael Rashed</strong></em><br>_______________________________________________</p><p><em><strong>\"Helpful course indeed</strong></em></p><p><em><strong>The course was very useful, and helped me learn camtasia. The thing that stood out - and something that made comprehension easy - was that the instructor went through different lectures by using the same example - a sample video. The journey from a raw video to the finished product made it easy for me to understand the things covered a lot better.\" Anil Yadav</strong></em><em></em></p><p>_______________________________________________</p><p><strong>Using Camtasia 8 for Windows you'll learn to create dynamic, beautifully edited videos in a flash! </strong><br></p><p>Video editing need not take hours. Video editing in Camtasia need not be frustrating. Amazing videos that make you money should be a natural by-product of your passion for teaching.  In this course you will leap the video-editing learning curve and in under 45-minutes, you'll be prepared to make compelling, engaging and \"comment-worthy\" videos. </p><p>Real practice. The course walks you through a step-by-step process for editing videos. You'll join me as we film, edit and produce a REAL video that will be used in an actual course.  </p><p>Everything in this course is <strong>'indexed'</strong>. <strong>Indexing</strong> the content in a logical format will make it super simple for you to come back to any lecture, any time, and within a few minutes get the knowledge you need. </p><p><br></p>", 
    "end_date": null, 
    "title": "Camtasia Video Edit Mastery: Camtasia Training Green Screen ", 
    "price": "20.00", 
    "instructors": "NLP, Positive Psychology Coach Patrick Howell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618084_753e_2.jpg", 
    "course_url": "https://www.udemy.com/camtasia-udemy-instructor-video-editing-green-screen-teach-online/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T13:25:12Z"
}