{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n\n<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Are you ready for more Udemy course topic ideas? Are you struggling with coming up with your next Udemy course idea (or even another infoproduct idea)?</p><p>I launched my first Udemy course on August 7th 2015. In under 12 weeks, I have 18 courses live in the Udemy marketplace (and multiple courses in the pipeline!)</p><p>Using the techniques and strategies outlined in this course, you can create course topics rapidly and with ease.</p><p>You will learn a number of methods to creating your next Udemy course. You will discover how to name your next course or product. Master the words that will yield bid results!</p><p>You will discover how to take other peoples' questions and convert that into a profitable course.</p><p>Discover the techniques to get experts to say \"yes\" to an interview (and find out how you can minimize your effort by facilitating the experts are asking questions) and so much more!</p><p>This course comes with a 30 day money back guarantee, so take this course today and start your own rapid fire idea generation.</p><p><br></p><p><span></span><br></p>", 
    "end_date": null, 
    "title": "Coming Up with Appealing Udemy Course Topics - Unofficial", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646512_17bd_3.jpg", 
    "course_url": "https://www.udemy.com/course-topics/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T06:43:03Z"
}