{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Vous êtes enseignant.</p><p>Vous souhaitez réaliser vous même une vidéo explicative ou pédagogique dans le cadre de vos cours.</p><p>Le coût moyen de production d'une vidéo explicative est d'environ de 1500 euros HT la minute, et les services de création de \"whiteboards videos\" comme PowToon, même s'ils sont plus accessibles financièrement et constituent de bons facilitateurs techniques, ne vous aideront pas à sélectionner, scénariser, organiser mais seulement monter et produire votre vidéo.<br><br>Vous pouvez donc d'une part économiser et d'autre part investir durablement en apprenant à réaliser vous même des vidéos pédagogiques pour vos cours.<br><br>Cette formation répond à ce manque et vous accompagne afin que vous puissiez <strong>concevoir et produire vous même des vidéos</strong> en accompagnement de vos cours en classe.</p><p><strong>L'objectif de ce cours</strong>: Vous apporter des bases sur la façon dont vos apprenants mémorisent en ligne et vous aider à concevoir et produire vous même des <em>contenus vidéos pédagogiques interactifs</em>.</p><p><strong>Vous y trouverez:</strong> Des vidéos démontrant les savoir-faire techniques pour la scénarisation et la réalisation de contenus audiovisuels (son et image), notamment lié aux enregistrements des contenus audio et vidéo.</p><p><strong>Vous y trouverez aussi:</strong> Des documents pdf et des slides présentant les concepts clefs de la mémorisation via l'image et le son, notamment lié à la sémiologie graphique (science du sens des images)</p><p><strong>Vous y trouverez enfin:</strong> Des Quizz et des exercices vous permettant de valider et de mettre en pratique les notions apprises et tester votre apprentissage en créant votre propre vidéo pédagogique.</p><p><strong>Vous y découvrirez comment :</strong></p><ol><li><strong>Rédiger un script</strong>: C'est l'équivalent du scénario au cinéma ! Comment allez-vous dérouler le contenu de votre vidéo, écrire la timeline de votre présentation en image et en son ? Vous apprendrez à rédiger un script.</li><li><strong><strong>Dessiner / Représenter un storyboard</strong>:</strong> C'est la traduction en planches (plans image et plan son) qui découle de votre script. Vous apprendrez à \"dessiner\" un storyboard, même sans savoir dessiner.</li><li><strong><strong>Enregistrer une voix-off</strong>:</strong> Vous apprendrez à rédiger un texte destiné à être lu comme à la radio et si vous n'avez pas les compétences pour l'enregistrer vous-même, nous vous apprendrons comment sous-traiter à bas coût la réalisation de votre voix-off que vous n'aurez plus qu'a poser dans camtasia pour la monter avec vos images.</li><li><strong><strong>Créer des illustrations</strong>: </strong>L'important est que vous sachiez ce que vous voulez comme illustrations, dessins, objets signalétiques que vous les dessiniez vous même ou que vous les donniez à faire pour pas cher sur Fiverr par exemple.</li><li><strong>Produire des vidéos à partir de contenus statiques</strong>: Créer une vidéo à partir de google slides, Créer un diaporama à partir de photos en un clic avec FFMPEG.</li><li><strong>Adapter des méthodes de réalisation</strong>: Savoir écrire manuellement sur un écran comme dans la Khan Academy, présenter des images en incrustation en fond vert comme les présentateurs météo ou bien utiliser les méthodes du karaoké pour l'apprentissage des langues.</li><li><strong>Utiliser dans la vidéo les méthodes de mémorisation</strong> : le pointage, la répétition, la comparaison</li><li><strong>monter l'ensemble de votre vidéo</strong>: Vous apprendrez à utiliser Camtasia afin de mettre tous ces éléments en musique.</li><li><strong>Choisir des musiques</strong>: Qu'elles sont destinées à l'intro ou pour les transitions, nous vous montrerons où les choisir et comment les créer vous-même.</li></ol>", 
    "end_date": null, 
    "title": "Concevoir et réaliser des vidéos pédagogiques", 
    "price": "20.00", 
    "instructors": "Franck Du Mesnil", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/710908_5a26_5.jpg", 
    "course_url": "https://www.udemy.com/concevoir-et-realiser-des-videos-pedagogiques/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T16:55:54Z"
}