{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>JUST RELEASED MARCH 2015!!!</p><p>Video is one of the most powerful tools to connect with your audience. The thought of putting yourself on camera might seem intimidating at first, but when you know how to do it with ease + confidence - people notice. </p><p>And why is this so important?<strong style=\"\"> Because people do business (and buy courses!) from individuals they like and trust. And when they can connect with them - by seeing them on camera - they become fans (and students!) for life.</strong></p><p>Being on camera is not about playing a role, it&#039;s about being yourself - free from inhibition and fear. It&#039;s about <strong style=\"\">sharing your most authentic self, in a way that is so engaging, people feel like they know you</strong>. In this class, I cover the exact skills you need to:</p><ul style=\"\"><li>overcome feelings of doubt and insecurity - so you can be confident on camera</li><li>prepare your material - so you speak naturally + offer real value</li><li>connect with the lens - so your audience feels like you are talking to them</li><li>look your best on camera - so you can impress your fans + still be yourself</li><li>create a mini professional studio - so you can get started RIGHT NOW</li></ul><p>Let me take the fear out of this process. <strong style=\"\">In a few short hours, I will show you how easy it is to share your BEST SELF on camera.</strong>  And the videos you will create can be published EVERYWHERE - your courses, on Facebook, in webinars, on Instagram, and with clients - the possibilities are endless.<br style=\"\"></p><p>What do you have to lose? You have a 30-day money-back guarantee to put these techniques into action. <strong style=\"\">Create a video - and GET MY PERSONAL FEEDBACK - and if you don&#039;t see your videos improve - you can always request a refund</strong>. It&#039;s that simple.</p><p>Your audience is waiting to meet you. Enroll NOW.</p>", 
    "end_date": null, 
    "title": "Confidence On Camera: Make Amazing Videos, Easily.", 
    "price": "40.00", 
    "instructors": "Alexa Fischer", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441920_0fd8_6.jpg", 
    "course_url": "https://www.udemy.com/be-comfortable-and-confident-on-camera/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T14:19:41Z"
}