{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><em><strong>\"This lecture enforced my teaching and gave me a number of ideas.\"</strong></em></p>  <p>  \t<em><strong>\"The slides and videos are visually appealing. The structure and pace of the course were clear and manageable.\"</strong></em>  </p>  <p>  \t<em><strong>\"This is a well instructed course with lots of info and examples about how to deliver EAP classes.\"</strong></em>  </p>  <p>  \tIf you have ever wanted to help your students who want to get into university, you may have been frustrated with the lack of support offered in the way of teacher training. Making the transition from being a grad student in TESOL, or even from being an ESL/EFL teacher to teaching EAP can be daunting. This course seeks to fill that training gap, and will provide you with the knowledge you need to get started teaching EAP.  </p>  <p>  \t             <strong>Please note</strong> that this course does<strong> not </strong>cover teaching composition or academic writing, as those areas would require their own course. Writing is mentioned briefly here, but you would do well to do some independent research on teaching second language writing. In addition, you are not given strategies for teaching academic reading in this course. The aim here is to give <em>teachers who are new to EAP</em> a <strong>foundation</strong> from which to build a course or courses. </p>  <p>  \t<strong>  If you need to transition into teaching English for Academic Purposes, enroll today and be a confident teacher tomorrow. Your students will thank you!  </strong>  </p>", 
    "end_date": null, 
    "title": "Continuing Education: Teach English for Academic Purposes ", 
    "price": "20.00", 
    "instructors": "ELT Online", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/77336_410b_23.jpg", 
    "course_url": "https://www.udemy.com/teach-eap/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-12T04:33:42Z"
}