{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.\n</p>\n\n<p>Are you ready to create a new course on Udemy? The first step is to learn what makes a good topic for your Udemy course. That’s exactly what this course will teach you. You will go through the step-by-step process I use when deciding what to create a course on, and you will have a strong idea of how popular the subject will be before you invest the time and effort to create your course.<br></p>\n\n\n\n\n\n\n\n<p><strong>Of All The Things You Could Teach, What Are Students Most Wanting To Learn?</strong></p>\n\n\n\n\n\n\n\n<p>* How to use the brainstorming technique to find course topics you might not have even considered before<br></p>\n\n\n\n\n\n\n\n<p>* How to do research within Udemy to see how much competition there is, and if students are searching Udemy for it<br>* How to do web research to see how much demand there is for a course on this elsewhere, even if nothing similar exists on Udemy</p>\n\n\n\n\n\n\n\n<p>You will know what is the best topic to teach by the end of this course!<br></p>\n\n\n\n\n\n\n\n<p><br>Topic selection is one of the most important early steps along the course creation process, yet one that is often glossed over or overlooked. Many instructors come to Udemy with a first course in mind already, and so the first question they ask is \"what camera should I buy?\" But a little time diving deeper on the course topic will pay long-term benefits, as you will find a solid place among all the thousands of courses out there and know in advance what makes your course unique compared to all the courses in your category. It's not enough to do this process at the end, as you're trying to sell the course. You have to spend some time at the beginning to find this spot.<br><br>This course will guide you through a custom process for discovering what's best for you. We'll go through a <strong>brainstorming process</strong> to discover hidden course topics that you might not normally think to teach. We'll <strong>evaluate </strong>these ideas to discover the best prospects, and I'll give you the criteria that I use to filter them. You will then learn a basic <strong>research </strong>process for evaluating the strength of the best prospects, and finally, <strong>narrow it down</strong> to the best topic for you.<br><br>In the <strong>advanced part</strong> of the course, we'll go through even more course topic generating ideas, competitive analysis techniques, as well as course ideas evaluation methods if you want to take that to the next level. But I often find the core process enough to get the idea into the course creation stage.</p>\n\n\n\n\n\n\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.</p>\n\n\n\n\n\n\n\n<p><br><strong>Enroll today and start your Udemy journey with confidence!</strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Course Topic Selection for Udemy - Unofficial", 
    "price": "25.00", 
    "instructors": "Scott Duffy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632744_a544.jpg", 
    "course_url": "https://www.udemy.com/topic-selection/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T18:57:16Z"
}