{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">If you're confused or overwhelmed with the process of taking your content, ideas or expertise, and creating a course, workshop or presentation out of them, this 12 Step Challenge will give you the Blueprint for getting started. </p><p style=\"\">Based on the foundations of best practice teaching and learning, consider it an introduction to how to create learning experiences that WORK - teaching and learning isn't just about compiling a bunch of information and throwing at your clients, hoping they'll get something out of it. </p><p style=\"\">It's about leading them on a learning journey, tapping into how they learn, and providing them a scaffolded, organised approach to your results based learning experience. </p><p style=\"\">Be introduced to the 12 Steps within the 4 PILLARS of Creating Quality Learning Experiences; Connect, Create, Communicate and Critique, with a short video for each of the 12 Steps, and the 12 Step Blueprint. </p><p style=\"\">CONNECT: really tap into your learners and understand the problems they need solving, how they learn most effectively, and set up clear expectations around the learning experience right from the outset. </p><p style=\"\">CREATE: define the outcomes that your learners will walk away with, scaffold the lessons and the content within them effectively so that you are taking them on an organised path to applying their new skills. </p><p style=\"\">COMMUNICATE: learn the basics of how to structure your presentations, visual aids and hone your delivery techniques so that you are engaging inspiring and motivating your clients achieve success in your field. </p><p style=\"\">CRITIQUE: evaluating, reviewing and reflecting on how your course, workshop or presentation has performed, is paramount to continually improving your reputation, and the learning experiences you have on offer. Earn a reputation as a professional who cares about delivering high quality outcomes for your clients, and continually improving your content and services. </p><p style=\"\">This 12 Step Challenge is the introduction to the full 4 PILLARS e-Course, which provides full templates, workbooks, demonstrations and examples of all the recommended activities in the Challenge, including a crash course in basic curriculum development and teacher training theories and methodologies. </p>", 
    "end_date": null, 
    "title": "Create Real Change: Create a Quality Learning Experience", 
    "price": 0, 
    "instructors": "Maria Doyle", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565694_55b6_3.jpg", 
    "course_url": "https://www.udemy.com/create-real-change/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T03:53:00Z"
}