{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>You have many ideas for awesome Udemy courses, and you want to turn those ideas into realities. You want to put in the work, but one thing always stops you: time. Other obligations get in the way which results in less time for Udemy. As a part-time instructor, it is difficult to juggle Udemy with work and family.</p><p>But this is something that deep down within your heart, you know you must do. You have such a strong desire to teach others and create your own courses. You want all of this to be done at the comfort of your home. The 9-to-5 job may bring in revenue, but the job is a pair of golden handcuffs at best. </p><p>Empowering others is something that you love to do, but how can you make it happen part-time? I am a full-time high school student who finds time in his day to make Udemy happen. I am a firm believer that age is not a limit to success which is why I decided to start early.</p><p>I may only be on Udemy part-time, but I am living up to my passion. I enjoy creating courses and adding videos to my existing courses. The mission behind this course is for you to discover how, regardless of your schedule, you can make Udemy work for you. </p><p>Unlike most of the other successful instructors, I know what it means to truly be a part-time instructor. I am a part-time instructor every day who also writes blog posts and sends posts to my 300,000+ social media followers all on the side. </p><p>In this course, you will discover how you can become successful on Udemy regardless of whether you are a full-time or part-time instructor.</p><p>If you are ready to take your business to the next level, then click \"Take This Course\" now.</p>", 
    "end_date": null, 
    "title": "Create Udemy Courses Part-Time or Full-Time - Unofficial", 
    "price": "20.00", 
    "instructors": "Marc Guberti", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669968_c9af_3.jpg", 
    "course_url": "https://www.udemy.com/unofficial-create-successful-udemy-courses-part-time-or-full-time/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T23:17:54Z"
}