{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.</p>\n\n<p>  \t                Have you been thinking about creating a class on Udemy?  Creating a Udemy class is great way to share your knowledge and also create a very profitable income stream.  You don't have to spend hundreds of dollars on software like Camtasia or Microsoft Office to create a professional caliber class!  This class shows you FREE software programs that you can use to make your Udemy class.  It also goes over the basic Windows PC hardware requirements you will need.  Three different free presentation software programs are demonstrated.  Free screen capture and editing software is shown and explained.  Free software to combine video clips is demonstrated.  Future recommended hardware upgrades are also covered.  Save your money and use the free software resources shown in this class.  </p>  <p>  \t                What is all included in this class?  </p>  <p>  \t                14 total video lectures:  </p>  <ol>  \t<li>Welcome to this class!</li>  \t<li> Computer Hardware  </li>  \t<li> Presentation Microsoft - PowerPoint Online</li><li> Presentation Software- Google Docs Slides  </li><li>Presentation Software - OpenOffice Impress</li>  \t<li>Free Screen Recording Software</li>  \t<li> Free Video Player and Editing Software  </li>  \t<li>Free Video Joining Software  </li>  \t<li>Thoughts About Upgrading your Hardware</li>  \t<li>Microphone Sound Quality Comparison and Sound Recording Tips</li>  \t<li>An Easy Way to Create Your Course Image</li>  \t<li> Update About Microspft Clipart</li><li>Putting It All Together to Make a Class  </li>  \t<li>Final Thoughts</li>  </ol>  <p>  \t                Over 59+ minutes of downloadable content  </p>  <p>  \t                What topics will be covered in this class?  </p>  <ul>  \t<li>Know what basic PC hardware resources are needed for creating an Udemy class  </li>  </ul>  <ul>  \t<li>Find and download free presentation and screen capture software  </li>  </ul>  <ul>  \t<li>Use free presentation and screen capture software  </li>  </ul>  <ul>  \t<li>Join video clips together  </li>  </ul>  <ul>  \t<li>Edit and create videos for Udemy classes</li>  \t<li>List of recommended hardware upgrades for microphones and webcams</li>  </ul>  <p>  \t                Tags:  </p>  <p>  \t                Udemy, no cost, free, software, hardware, creating, editing, Google Docs, slides, OpenOffice, impress, screen capture,  presentation software, PowerPoint online, video clips, joining, video editing, microphone, webcam, save, money, instructor, success, training, creating, first, Camtasia, Microsof, clipart, bing images   </p>", 
    "end_date": null, 
    "title": "Create Udemy Courses with Complimentary Software - Unofficial", 
    "price": "20.00", 
    "instructors": "Andy Jennings", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311172_d7e4_4.jpg", 
    "course_url": "https://www.udemy.com/unofficial-create-udemy-courses-with-complimentary-software/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T00:30:52Z"
}