{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>This is the only crash course you will ever need to learn how to become a master online educator, where the students are the focus - not the technology!</strong></p><p><strong>Based on years of research in higher education and online pedagogy, this course is designed to maximize every student's learning experience and help instructors learn the best ways to develop curricula and content. This course will be helpful for bloggers, and internet marketers as well - looking to create an online presence and community. </strong></p><p>Anyone can talk into a camera or provide facts and information, but online learning truly struggles to compete with the attention and interests of students. Therefore, rather than just supplying information and hoping that students delve in and grasp it - this course empowers you with 12 tools for excellence in stimulating and capturing the interest of your students - no matter what subject you are teaching. Whether you are a professor, coach or trainer, this course will help you learn the ideal approach for opening a student's mind in an online environment and show the exact tools, resources, and technology you should and should NOT be using for online learning.</p><p>This course guarantees to give you the skills, perspective and confidence to:</p><ul><li>Easily create engaging lessons that trigger the learning process</li><li>Avoid the 3 biggest mistakes in online course design</li><li>Plug into the mind of the student</li><li>Learn which digital resources and technology should be used</li><li>Tutorial on how to use the technology</li><li>Learn to simplify the student’s learning experience</li><li>Discover how to save precious time by using what works</li></ul>", 
    "end_date": null, 
    "title": "Create & Teach Online Courses as a Master Educator ", 
    "price": "25.00", 
    "instructors": "Ari Sytner, M.Ed, LMSW", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702166_5114_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-master-online-educator/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T14:21:29Z"
}