{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong>The Ultimate Udemy Course Creation Blue-Print</strong></p>\n\n\n\n\n\n\n\n<p><strong><em></em>RE: </strong>“<em>How I Quadrupled Sales Via the Udemy Black Friday 2015 Launch Process</em>.”<strong></strong></p>\n\n\n\n\n\n\n\n<p>Dear soon to be <strong>Udemy Instructor</strong>, have we got a package for you! </p>\n\n\n\n\n\n\n\n<p> On <strong>October 5<sup>th</sup></strong> a message flashed across the top of my browser announcing the <strong>#BlackFriday2015 Course Launch Challenge</strong>. Daniel Hall, J.D. had recently been extremely excited about a talk on <strong>dividend investing</strong>.  I normally made that a 1 lecture topic of my first <strong>stock investing</strong> course.</p>\n\n\n\n\n\n\n\n<p>When I looked at the 5 challenges for the competition I <strong>freaked out</strong>. Some required a level of production quality above my <strong>skillset</strong>.  </p>\n\n\n\n\n\n\n\n<p>So I <strong>morphed out</strong> the dividend idea into a new Udemy offering co-authored with international thought leader Daniel Hall, J.D.  </p>\n\n\n\n\n\n\n\n<p>We did not win one of the <strong>coveted 10 spots</strong> on the Udemy Facebook page.  But we did get into the drawing and were one of many courses <strong>tweeted</strong>.  </p>\n\n\n\n\n\n\n\n<p>This rocketed my sales in November by <strong>4 fold</strong>.  </p>\n\n\n\n\n\n\n\n<p>You are probably <strong>sitting</strong> now where I was in May of 2015.  My research budget had been <strong>pulled</strong> at the University.  </p>\n\n\n\n\n\n\n\n<p>I needed more cash to pay for data and the cost of my <strong>research assistants</strong>.  </p>\n\n\n\n\n\n\n\n<p>I had <strong>no idea</strong> what to do.  I reached out to Daniel Hall because he has this <strong>uncanny</strong> <strong>6<sup>th</sup> sense </strong>for money making opportunities nobody else sees.  He recommended I start publishing my Amazon bestselling books and courses on investing through Udemy.  </p>\n\n\n\n\n\n\n\n<p>I am planning a 5-day walk on the <strong>English Way</strong> to Santiago de Campostela deep in the heart of Galicia.  My <strong>earnings</strong> in November have already paid for the trip for both Marisol and I.  </p>\n\n\n\n\n\n\n\n<p><strong>An MBA Level Training on Udemy Course Creation!</strong></p>\n\n\n\n\n\n\n\n<p>I am also the coordinator of the <strong>University of Puerto Rico MBA Student Act 20 and Act 22 Guide</strong> as an associate professor of finance of the <strong>AACSB Accredited Graduate School of Business</strong>.  This program helps me train my students to run the official guide to tax incentives and <strong>relocation</strong> in Puerto Rico.  </p>\n\n\n\n\n\n\n\n<p>Here is what my students have <strong>written</strong> regarding my instruction, </p>\n\n\n\n\n\n\n\n<p>“<em>What I found most beneficial about the course was the diversity of topics each week</em>.” <strong>-C.M. May 18, 2015</strong></p>\n\n\n\n\n\n\n\n<p>“<em>I want to thank the Professor for assisting me in providing effective guidance in all my assignments and help me gain knowledge in this subject</em>.” <strong>-T.S. May 19, 2015</strong></p>\n\n\n\n\n\n\n\n<p>“<em>This course has been very beneficial in many respects</em>.” <strong>-S.M. May 19, 2015.</strong></p>\n\n\n\n\n\n\n\n<p>Enroll now while this course is <strong>just $20</strong>! </p>\n\n\n\n\n\n\n\n<p>Don’t miss out on knowledge that helped increase my sales by four fold in <strong>#BlackFriday2015</strong>! </p>\n\n\n\n\n\n\n\n<p>This course has a no-brainer <strong>30-day money back guaranteed offer</strong> fulfilled by Udemy as 3<sup>rd</sup> party.  I can’t wait to meet you inside, <strong>-Scott</strong></p>\n\n\n\n\n\n\n\n<p>Dr. Scott Brown, <strong>#1 Rated Udemy Dividend Course Instructor</strong> and <strong>Associate Professor of Finance</strong> of the AACSB Accredited Graduate School of Business of the University of Puerto Rico</p>\n\n\n\n\n\n\n\n<p>Again, enroll now to discover how my sales exploded in <strong>November of 2015</strong>!  </p>\n\n\n\n\n\n\n\n<p><strong>P.S. WARNING:</strong> This course will be offered at this price for a limited time.  </p>\n\n\n\n\n\n\n\n<p><strong>P.P.S.</strong> Enroll now under the <strong>Udemy 30 day money back guarantee</strong>! </p>", 
    "end_date": null, 
    "title": "Create a Successful & Popular Udemy Course - Unofficial", 
    "price": "20.00", 
    "instructors": "Dr. Scott Brown, Daniel Hall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674320_c1a1_2.jpg", 
    "course_url": "https://www.udemy.com/maximizing-your-odds-of-success-for-udemy-black-friday-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T11:04:41Z"
}