{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\nAs a new or current instructor at Udemy, creating a course can be very challenging. The course will provide the instructor the necessary instruction to use the ISD Instructional Model to organize and manage the courseware development. If you need a special tool to assist you to design your course, then this course manager database is an important part of your courseware development process. This course has 1.5 hours of lectures and 12 lectures.<p></p>\n\n<p>I have created a course that includes a relational database (Course Manager) that will accelerate your courseware design. The course will includes the relational database \"Course Manager\" that is used the manage the course design and development.</p>\n\n<p>In addition to being more productive developing your course, I am using the ISD Instructional Systems Design model for the database development. The ISD model has a proven history where the course development model is used to manage the many elements of the development process, and to improve the productivity of the course development.</p>\n\n<p>The ISD model has been updated for online course development with many new features.</p>\n\n<p>This course will improve the quality of your instruction by providing a framework that includes; course analysis, a course outline screen, course objectives screen, course design screen, media used, and testing and evaluation screens. Each one of these steps in the development process are enhanced through the usage of the Course Manager database. The course manager may be used for each individual course being developed. This process creates a knowledge base for future course design. With each course you develop, you will add to your skill as a courseware developer.</p>\n\n<p>The database will also include a lesson guide that can be used for scripting your course and narrating from that screen into a video presentations. Some bonus features are; a website library for collecting course related website information, and a sales and promotion screen to track both promotions and coupons to include summaries for sales.</p>\n\n<p>To add to the development process you can use this course authors 40 years of course design to ask questions and improve your overall knowledge for course development.</p>", 
    "end_date": null, 
    "title": "Creating Courses: Udemy Course Manager Database - Unofficial", 
    "price": "20.00", 
    "instructors": "Vaughn Clement", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422564_56b6_8.jpg", 
    "course_url": "https://www.udemy.com/isd-instructional-systems-design-udemy-course-manage-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-15T16:36:46Z"
}