{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Si eres un nuevo instructor o un instructor existente que quiere conocer nuevos trucos y consejos, estás en el lugar adecuado. Este curso pretende ser el sitio clave donde podrás encontrar toda la información sobre cómo crear tu curso en Udemy. Desde el Equipo de Instructores de Udemy hemos creado este curso para que esté constantemente actualizado con los recursos más al día que necesitarás. Esto es lo que cubriremos:</span>  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Cómo crear tu curso Udemy, de principio a fin.</span></li>  \t<li style=\"\"><span style=\"\">Los estándares de calidad de Udemy para que puedas crear tu curso de la calidad que esperamos.</span></li>  \t<li style=\"\"><span style=\"\">Cómo escoger el tema de tu curso, identificar tu público objetivo y planear el esquema de tu curso.</span></li>  \t<li style=\"\"><span style=\"\">Cómo filmar el curso: los consejos sobre cómo grabar un buen vídeo y un bien audio, y como editar tus vídeos.</span></li>  \t<li style=\"\"><span style=\"\">Cómo posicionar tu curso para el éxito en el marketplace de Udemy, usando tu imagen, tu vídeo de promoción y tu página de promoción del curso para conseguir estudiantes.</span></li>  \t<li style=\"\"><span style=\"\">El proceso de revisión de Udemy.</span></li>  \t<li style=\"\"><span style=\"\">Estrategias de promoción, consejos didácticos, y cómo hacer cambios en tu curso una vez publicado.</span></li>  </ul>  <p style=\"\">  \tAdemás, considera este curso como el punto de partida para explorar la comunidad de instructores de Udemy. Te daremos todos nuestros recursos así como acceso a la comunidad de instructores donde podrás conversar e interaccionar con otros instructores (así como con el equipo de Udemy).  </p>  <p style=\"\">  \t¿Listo para empezar a crear tu curso? ¡Vamos a ello!  </p>", 
    "end_date": null, 
    "title": "Cómo crear un curso Udemy", 
    "price": 0, 
    "instructors": "Equipo De Instructores De Udemy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273176_4cea_6.jpg", 
    "course_url": "https://www.udemy.com/como-crear-un-curso-online-udemy/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-01T21:40:26Z"
}