{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course provides the latest expertly curated materials on this topic by a university president focused on disruptive innovation who spent years developing them. </p><p>I've tried to curate the \"best of the best\" of materials in this field including: <strong>unbundling universities, unbundling faculty</strong>, online education, emerging markets, Base of the Pyramid strategy, <strong>Lean Startup for education, Blue Ocean Strategy</strong> for education, accreditation, for profits and MOOCs and examining implications for specific markets like faith-based/Christian higher education. I provide a summary of \"Cliff's Notes\" on each topic in a brief video, and have links to the top videos and bibliography on each topic. While most people will take this course individually, <strong>this course is designed to also be used by individuals or as a \"flipped classroom\"</strong> discussion among students or leaders at your institution to discuss these materials after reviewing them.</p><p>I am the <strong>President of City Vision University</strong> where we are bringing radically affordable education through a <strong>$2,000 associate's degree and a $5,000 bachelor's degree</strong>. I previously <strong>co-founded MIT's Internet Telephony Consortium </strong>with one of the fathers of the Internet (David Clark) focused on disruption in the telecommunications industry. Before spending the past 20 years living with and serving the poor with disruptive educational technologies, I worked as a consultant to Sprint, venture capitalist and internet startups.  </p><p>I just finished reading tens of thousands of pages and hundreds of articles and videos as a part of my doctoral dissertation. I have literally put <strong>thousands of hours of work into the materials in this course just as if I were publishing a book</strong>. I am providing it for free because I want to see change happen in this industry.</p><p>My hope is that you could use this course materials to be a change agent to bring innovation to your institution.  </p><p>You can also find versions of this course on: iTunes University, YouTube and Slideshare.<br></p>", 
    "end_date": null, 
    "title": "Disruptive Innovation in Higher Education", 
    "price": 0, 
    "instructors": "Dr. Andrew Sears", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726910_062d_3.jpg", 
    "course_url": "https://www.udemy.com/disruptive-innovation-in-higher-education/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T15:26:57Z"
}