{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.\n</p><p>Your <strong><em>forever free</em></strong> guide to protecting your video courses and getting the illegal content taken off the web. Yes, it's possible to do!<br></p>\n\n<p>In this course, we'll go through <strong>7 easy things</strong> you can do to make it harder for pirates to steal your course content.</p>\n\n<p>Listen, let's be realistic here. You can't stop a determined pirate from getting your course content downloaded to their computer and share it across the web. But you can make it harder for them, and so why not make it a little bit harder and hopefully the pirated version of your course is less complete, missing some things, and encourages people who watch it to find your paid course to get the complete experience?</p>\n\n<p>We'll also go through the <strong>5 simple steps</strong> to getting your stolen content taken down from the web. Do you think it's impossible to put the genie back in the bottle and remove videos from the web once they've been uploaded? Well it's not that hard to do. You can remove the links from Google quickly and easily, and that's half the battle. If all you do is remove the links from Google, it's a major victory. But if you really care, you can get the file hosts to remove those files from their servers as well. </p>\n\n<p>In this course, I show you how to do all that.</p>\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "DMCA for Udemy: Techniques for Fighting Piracy - Unofficial", 
    "price": 0, 
    "instructors": "Scott Duffy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691344_3c1d.jpg", 
    "course_url": "https://www.udemy.com/udemy-dmca/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T20:12:39Z"
}