{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>   While working on my Master's in Instructional Design &amp; Technology, I decided to create training for substitute teaching for my Capstone course after attending former school district based training. Also prior to starting Substitute teaching, I spoke with other substitute teachers who felt that more help was needed with the classroom atmosphere. As a classroom teacher, I saw the gaps in the relationship between being a classroom teacher and not coming back to chaos in the classroom, while your out. I have identified some probable causes for instructional solutions. So I have created some tools to help substitutes and teachers in the classroom in the long term. </p>\n\n\n\n<p><em><br></em></p><p><em>          This course will help with preparing you before, during, and after you reach the classroom. This course was designed to be the guide for helping you to use the resources that are available after you take this course for more assistance in the classroom. This course will be a guide for utilizing the resources described below: </em></p><em>\n\n<p>Blog- will be used for feedback from other substitutes about the course </p>\n\n<p>Tools- found on the Weebly page such as seating charts, book reference guides, and </p>\n\n<p> lesson plans for special needs assignments. </p>\n\n<p>Webcasts- for you to share learning experiences in the classroom using the tools  </p>\n\n<p>So what are you waiting for? Let's begin the course today! </p>\n\n<p>  </p>\n\n<p>The problems that you can expect to solve are: </p>\n\n<p>* Retain more employment at schools </p>\n\n<p>* To reach the mandatory goals of working Mondays and Fridays </p>\n\n<p>* Provide behavior management training for grade specific age groups </p>\n\n<p>* To reach the monetary incentives currently in place</p>\n\n</em><p><em></em></p>", 
    "end_date": null, 
    "title": "Effective Substitute Teaching", 
    "price": "20.00", 
    "instructors": "L.V Pinkston", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842070_eca0_12.jpg", 
    "course_url": "https://www.udemy.com/effective-substitute-teaching/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-07T14:50:26Z"
}