{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Are you new to ESL teaching ?</strong></p><p><strong>Want to get better at explaining the ins and outs of English?</strong></p><p><strong>Want quality lesson plans, audio and downloadables - all in one place?</strong><br></p>  <p>Then this course is for you.  </p><p>Designed for for new ESL trainers, it capitalises on my many years' experience as a language trainer, distilling knowledge I wish I'd had in the early days of my teaching career.</p>  <p>  \t<strong>Practical tips and resources?</strong>  This course has got it.  </p>  <p>  \t<strong>Foundation skills?</strong>  This course covers it.  And the course constantly grows with you.  </p>  <p>  \t  With a better understanding of <strong>what English grammar is</strong>  and <strong>how</strong> we can effectively teach it, we help our students express themselves accurately and effectively.</p><p><strong>The purpose of this course is to present English grammar in a lyrical, easy-to understand way through the power of story-telling coupled with explanations, tables, exercises and images.  It can be taken sequentially or in bite-sized-pieces depending on need.</strong><br></p>  <p>  \t      Material will be regularly added, and feedback is actively sought.  So please consider this your ongoing reference for continual learning and improvement.  </p>  <p>  \t<strong>  Be the best ESL trainer you can be!  </strong>  </p>", 
    "end_date": null, 
    "title": "English Made Easy: Language Hacks for ESL Trainers ", 
    "price": "20.00", 
    "instructors": "Jacqueline Seidel", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/344138_48e9_4.jpg", 
    "course_url": "https://www.udemy.com/english-for-esl-trainers/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-14T13:53:05Z"
}