{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is designed for women's ministry leaders, youth leaders, and caring adults who want to help our young women learn about and reclaim their identities in Christ.</p><p>Many of the issues we currently identify as stemming from \"low self-esteem\" will only be remedied when our young ladies realize who they already are in Christ. It's one thing to tell a girl to ignore negative messaging about her worth, but it's quite another to help her claim positive messages from God for herself.</p><p>This course will empower anyone who works with young ladies to lead them to see the truth about who they are in Christ.</p><p>This course is taught by video, with the guides, exercises and Leader's notes in pdf format so you can make copies for your group discussions. It should take you about two hours to watch and complete the materials for yourself before you teach, but it has ample enough materials and discussion topics to lead a course that would last an around 4 hours.</p><p>The curriculum includes: </p><ul><li>4 signs to tell if your girl is struggling with identity issues and simple ways you can address them now</li><li>Bible discovery guides that demonstrate the characteristics of Christ that make Him attractive as a personal friend, and the subsequent influence of God as creator and a personal friend to give true identity markers</li><li>A guide to critical thinking about media messaging and how it shapes identity<strong><u></u></strong></li><li>Practical media deconstruction exercise you can do right now to help your girl reclaim her identity from false messaging</li><li>Testimony from a Christian counselor on how false identity causes pain for young people</li><li>Testimony from a recovering eating disorder sufferer on how identity in Christ saved her</li><li>Additional resources<strong><u></u></strong></li></ul><p>Thank you so much for considering this course. I know it will be a blessing to the girl(s) you work with!</p>", 
    "end_date": null, 
    "title": "ENOUGH: steal back  your teen girls' identity in Christ!", 
    "price": 0, 
    "instructors": "Amie Regester", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641680_2e90.jpg", 
    "course_url": "https://www.udemy.com/identity/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T19:19:16Z"
}