{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Yoga Instructors, </strong>  </p>  <p style=\"\">  \t Welcome to your next Evolution!  </p>  <p style=\"\">  \t These beautiful training sessions, filmed live at Yoga Yoga in Austin, will give you all my latest tools to make you one of the most fresh, cutting edge and effective yoga teachers in your area. This means you will likely experience:  </p>  <p style=\"\">  \t <strong style=\"\">INCREASED CLASS SIZES:</strong><br style=\"\">  \t  Since your teaching will make students feel more empowered, keep them safer and spark more results, they will choose your classes, and attend more often.  </p>  <p style=\"\">  \t <strong style=\"\">INCREASED INCOME:</strong><br style=\"\">  \t  With bigger classes, you can teach workshops, retreats and special trainings that will boost your standing in your yoga community&hellip;as well as your bank account.  </p>  <p style=\"\">  \t <strong style=\"\">INCREASED SATISFACTION IN YOUR JOB:</strong><br style=\"\">  \t  When you know how to instruct your students in the most powerful ways, and are clear on why you&rsquo;re moving them, and from where, you will feel more grounded in your own knowledge, and that feels amazing.  </p>  <h5 style=\"\">Take it from actual teachers:</h5>  <p style=\"\">  \t &quot;There are very few yoga teachers whose work I unreservedly recommend. Sadie Nardini is one of them.&quot;<br style=\"\">  \t  -Leslie Kaminoff, yoga educator and renowned author of Yoga Anatomy  </p>  <p style=\"\">  \t &quot;Since I have taken Sadie&#039;s teacher training I have taught yoga at Hunter College, in some of Manhattan&#039;s best yoga studios, and in fortune 500 companies. In addition to now being certified to teach core-strength vinyasa, Sadie&#039;s training has also taken my own practice to amazing new heights. It&#039;s knowledge I will probably use for the rest of my life.&quot;<br style=\"\">  \t  -Bari (Founder of DeStress at Your Desk)  </p>  <p style=\"\">  \t &quot;Sadie&#039;s teacher training has revolutionized my yoga practice and teaching. I&#039;m a stronger, more confident yogi, able to perform asanas that were once far out of my reach, and have also become a teacher who has a lot of good, strong knowledge to share. She will provide you with a great understanding of yogic anatomy and sequencing, put forward simply and with a deep wisdom that comes from years of being one of the world&rsquo;s top instructors. You will come out of this training with the knowledge to be a great yoga teacher or student, along with a better, stronger sense of yourself as a practitioner of life. Don&#039;t miss out!&quot;<br style=\"\">  \t  -Brian (Punk Rock Yoga teacher)  </p>  <h5 style=\"\">When you invest in the Evolution Training, you will learn:</h5>  <ul style=\"\">  \t<li style=\"\">How most of today&rsquo;s yoga instruction actually limits the student from reaching their true potential in each pose, and actually can cause strain, joint compression and injury--and how to fix it.</li>  \t<li style=\"\">The latest anatomy of our new discoveries about the body&rsquo;s feet-to-head muscle meridians. This is as important to your student&rsquo;s bodies as drinking water is to life.</li>  \t<li style=\"\">The exact verbal cues and words to use to undo outer body tension and repetitive stress and wake up the Core Strength Muscle Meridian.</li>  \t<li style=\"\">The exact order in which you must teach the Core Strength Muscle Meridian in, in order to properly activate it and empower your students.</li>  \t<li style=\"\">For the first time, all of this information is broken down part by part and shown in each type of sequence and singular yoga postures, so you can clearly understand how to instruct, align and adjust the poses.</li>  </ul>  <h5 style=\"\">THE DIFFERENCE BETWEEN EVOLUTION AND ROCK STAR:</h5>  <p style=\"\">  \t The difference between the Rockstar and Evolution trainings I offer online is that the Rockstar is a more general overview of all the major muscle meridians of the body. It provides discussion of the philosophy behind them, as well as Finding Your Voice and Sequencing from the Core sections for teachers, home practice, or anyone&mdash;these concepts apply to every area of your life.  </p>  <p style=\"\">  \t The Rockstar, therefore, is a more foundational training, and then the Evolution goes into specifics of how to translate that information clearly to your students and into every pose. The Evolution is super-focused on the Core Strength Muscle Meridian&mdash;how to reveal it, how to adjust it, how to power it up in each asana.  </p>  <p style=\"\">  \t They are true compliments to one another, and you could do one or the other and learn a ton, but the best way is to do the Rockstar, then the Evolution.  </p>  <p style=\"\">  \t The Evolution Training also has all-new information from the Rockstar, including:  </p>  <p style=\"\">  \t <strong style=\"\">CORE STRENGTH ADJUSTMENTS</strong><br style=\"\">  \t  New adjustments that assist the student to progress without disconnecting them from the Core Strength Meridian. What to look for, how to adjust manually and verbally, and communicate your intentions clearly through touch.  </p>  <p style=\"\">  \t <strong style=\"\">PHYSICS OF YOGA</strong><br style=\"\">  \t  How to use Newton&rsquo;s 3 Laws of Motion, Laws of Nature and physics to make an extremely big difference in how light, strong, free and decompressive the poses can be. I would never teach again without this information.  </p>  <p style=\"\">  \t <strong style=\"\">BRAND NEW BINDS</strong><br style=\"\">  \t  New arm binding and shoulder-opening alignment that goes against most current yoga instruction, but is actually the only way to anatomically free the shoulders and not strain them while stretching or binding.  </p>  <p style=\"\">  \t <strong style=\"\">POSE-BY-POSE INSTRUCTION SUPPORT</strong><br style=\"\">  \t  Many more detailed instructions about how to cue every type of pose, from Chaturanga to Full Wheel, Warrior One, Handstand, Crow, and more. Most of these poses need to seriously shift from how you were likely teaching them to be most effective for your students and not hurt them over time.  </p>  <p style=\"\">  \t <strong style=\"\">A CORE STRENGTH CUEING TEMPLATE</strong><br style=\"\">  \t  To give you the order to use, every time, to get the most effective activation of your students&rsquo; whole body core strength.  </p>  <p style=\"\">  \t <strong style=\"\">AN EVOLUTION OUTLINE</strong><br style=\"\">  \t  Text notes of the most important concepts for you to have for reference during the training, and beyond!  </p>  <p style=\"\">  \t You won&rsquo;t believe the difference in this next Evolution of your yoga teaching, and of yoga in general. I can&rsquo;t wait for you to use this to rock your next class&hellip;and apply it for a lifetime.  </p>  <p style=\"\">  \t Namaste!  xo Sadie  </p>", 
    "end_date": null, 
    "title": "Evolution Teacher Training", 
    "price": "50.00", 
    "instructors": "Sadie Nardini", 
    "commitment": "18.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/69652_9e9c_5.jpg", 
    "course_url": "https://www.udemy.com/evolution-teacher-training/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-25T14:14:17Z"
}