{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>As an instructor, trainer, facilitator or teacher, how many of these situations can you relate to?<br></p><ul><li>Those students in the back row stop paying attention 30 minutes into your training and you're just not sure how to bring them back.</li><li>Only a handful of your students typically ask questions, but you'd like to know how to get more students involved.</li><li>You know that asking questions would get more students involved, but you're scared of losing control of the conversation and/or the class.</li><li>Because more of your students are quiet, you assume they are comprehending what you are teaching. But then those same students email or call you only days after your course with questions that they should know the answers to.</li><li>You regularly find yourself with way too much material to cover in the time that you have, which leaves you feeling rushed and exhausted.</li></ul><p>Here's what I know: These classroom scenarios are very, very common. But, by tackling these scenarios the right way, you can be profoundly more effective in the classroom than you currently are or ever thought you could be!</p><p>In this 36-lesson, 4-hour course, we will learn:</p><ul><li>Six critical facts and principles about your students and how they learn</li><li>Which of your current classroom techniques are not working and why they aren't working</li><li>How to apply the participant-centered tips and techniques of Facilitation</li></ul><p>If you are willing to critically evaluate your current approach to training, be open to learning some new training techniques, and do some hard work both during and after this course, I will partner with you to help you become a dramatically more effective and confident trainer, instructor, facilitator, or teacher.</p><p>In other words: Once you've completed the <em>Facilitation Basics</em> course, you will never look at training the same way again!<br></p>", 
    "end_date": null, 
    "title": "Facilitation Basics: Engaging Adult Learners", 
    "price": "25.00", 
    "instructors": "Ken Brown", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630358_bd73_2.jpg", 
    "course_url": "https://www.udemy.com/facilitation-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T13:58:08Z"
}