{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\"><span style=\"\">This course is for teachers who are about to implement Fast ForWord in their schools, or who simply want to understand more about the programs and how they could assist their students.&nbsp;</span>The course will cover the neuroscience principles behind the Fast ForWord programs by beginning with language development and its connection to reading and learning. The organisation, sequencing and implementation of the Fast ForWord programs will be explained. The course will also cover how to manage and enrol students and track their progress.&nbsp;</p><p style=\"\">The course is delivered by video and printable resources. The videos are lectures given by Devon Barnes, clinical director at LearnFast Australia. Devon brings over 40 years of experience in helping struggling learners with language and learning difficulties. The course is administered by the Fast ForWord team at LearnFast Australia, who have been successfully helping learners with this great program since 1999.</p><p style=\"\">The course should take you about 5 hours to complete, which includes time for watching the videos, reading the supporting material, and completing your course evaluation. If you wish to go deeper in your understanding of the Fast ForWord programs and the science involved, then please feel free to explore the recommended further readings given throughout the course.</p>  ", 
    "end_date": null, 
    "title": "Fast ForWord Training for Schools", 
    "price": "50.00", 
    "instructors": "Peter Barnes", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54453_902c_5.jpg", 
    "course_url": "https://www.udemy.com/fast-forword-training-for-schools/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-16T10:34:53Z"
}