{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Would you like to create <strong>best-selling online courses</strong> that has students longing for more?</p>  <p>Would you like to <strong>spice up</strong> your current courses or <strong>PowerPoint presentations</strong> and give them that <strong>extra sizzle</strong> that keeps your audience' attention?</p>  <p>Do you want to <strong>increase enrollments</strong> and <strong>increase your reviews</strong>?</p>  <p>Then you're in the right place!</p>  <p>This course is all about <strong>green or blue screen recording</strong> and replacing your background with moving <strong>videos</strong> or <strong>gorgeous static pictures</strong> that give your online courses that <strong>extra spice</strong> that keeps your audience glued to your educational material.</p>  <p>In this course I will show you where to get your <strong>green or blue screen</strong> (we’ll cover what the difference is as well). We’ll talk about all of the <strong>technology</strong> you need to create awesome online courses that will have students want to enroll in all of your other courses as well. We’ll talk about your <strong>camera</strong>, <strong>microphone</strong>, your <strong>audio</strong> and your <strong>video editing software</strong>. </p>  <p><strong>I will be using Camtasia for PC to show you how to edit your videos.</strong></p>  <p>We will cover where to get your royalty free videos and static background pictures and how to insert them behind your ‘talking head’ to make your videos look <strong>dazzling</strong>. </p>  <p>All students receive <strong>5 free static backgrounds </strong>that I had my graphic designer create especially for you.</p>  <p>Come on in and <strong>join me</strong>, a <em>Udemy </em><strong><em></em>best-selling instructor</strong>, along with thousands of other students from over <strong>90 countries</strong> all over the world, and learn how to <strong>set your videos apart </strong>from the masses by giving it that little <strong>extra </strong>that makes your clients and students want to enroll in all of your courses.</p>", 
    "end_date": null, 
    "title": "For Healers and Coaches: Video Creation For Online Courses", 
    "price": "30.00", 
    "instructors": "Cha~zay Sandhriel Ph.D.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741930_e418.jpg", 
    "course_url": "https://www.udemy.com/green-screen-video-course/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T07:49:51Z"
}