{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>If you know that <strong>online teaching</strong> is the right move for you but you don’t know how to get started, this course is for you! </p>  <p>If you have volumes of wisdom to share with a <strong>global audience</strong> and want to create <strong>online courses</strong> to spread your knowledge, this course is for you.</p>  <p>Are you in the mind/body/spirit field working as a <strong>healer</strong>, <strong>coach</strong> or <strong>consultant</strong> and want to take your in-person business to an <strong>online platform</strong>?</p>  <p>Are you tried of <strong>trading time for money </strong>and want to create<strong> passive income streams </strong>with<strong> online courses</strong>?</p>  <p>Are you ready to start spreading your most-important <strong>message</strong> to a <strong>worldwide audience </strong>and <strong>get paid handsomely</strong> while you’re at it?</p>  <p>Then you’ve come to the right place!</p>  <p>As a <strong>Reiki Master</strong> and <strong>Holistic Life Coach</strong> I know how hard it can be to see one client at a time and I’m here to show you an <strong>easier way</strong>. One where you won’t have to give up your <strong>private practice</strong>, if you choose to continue seeing one-on-one clients. With what I’m about to show you, not only can you keep your <strong>in-person practice</strong> but I will show you how to create <strong>passive income streams</strong> while building your practice with even more clients that are willing to pay generously for your <strong>wisdom and knowledge</strong>.</p>  <p>It’s time to bring your knowledge to an <strong>online platform</strong>. Say it once, set it and ‘forget’ it. Share your wisdom so what you have to teach is available <strong>24 hours a day, 7 days a week </strong>and to a <strong>global audience</strong>. Or perhaps you’re not currently seeing face-to-face clients and simply want to build an <strong>online practice</strong> with your healing and coaching techniques?</p>  <p>I left the corporate world more than 12 years ago to become a <strong>consultant</strong> and later a <strong>coach</strong> and <strong>workshop leader</strong>. I’ve been teaching small and large groups in person as well as online for over a decade. I have <strong>thousands of students</strong> and am one of Udemy’s <strong>best-selling instructors</strong>. I create and publish courses in 3-5 days and I still run a global coaching business. </p>  <p>I look forward to helping you spread your message while helping you generate <strong>multiple, generous </strong>and<strong> passive streams of income</strong>.</p>", 
    "end_date": null, 
    "title": "For Healers and Coaches, Getting Started With Online Courses", 
    "price": "20.00", 
    "instructors": "Cha~zay Sandhriel Ph.D.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/773974_c671_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-online-courses/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T13:59:19Z"
}