{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong>Here is a 5 star review. Fadi Al-Aswadi \"Amazing course this course is amazing, it motivated me to make new courses to help other people. </strong><strong>Thank you Nikhil..\"</strong></p><p>Are you ready to have the DRIVE you need to create your Udemy courses fast? This course has been designed specifically for new and current Udemy instructors. DRIVE will show you how I've created 6 Udemy courses in a few short weeks and have over 3300 students as of right now.</p><p>This course will delve into the principles that will DRIVE you to success and not just incremental success but you will see exponential success once you understand and apply the principles shared in this course.</p><p>You will learn the power of deadlines and how to create the motivation you require. You will also learn why making money should not be the main motivation and why something else much larger is the real reason for the DRIVE you need.</p><p>Start now and learn how to create Udemy courses quickly and break through the barriers to make it happen!</p>", 
    "end_date": null, 
    "title": "Get the Motivation to Create Udemy Courses Fast - Unofficial", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635408_69d9_2.jpg", 
    "course_url": "https://www.udemy.com/motivation-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T00:55:08Z"
}