{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t    Are you a teacher in a <strong style=\"\">Google Apps for Education</strong> district? If not, will you be going Google soon? If so, take advantage of this course on the Google Classroom. Teachers of all levels; elementary, secondary, post-secondary will benefit from using <strong style=\"\">Google Classroom</strong> as an online learning platform. This is a comprehensive course covering topics from the basics of classroom, to how you can use it with your students, to lessons to teach your students how to use the application to a final side-by-side view of the teacher and student platforms.  </p>  <p>  \t    The course is broken down into 8 sections, the introductory section, followed by 6 learning modules, and ending with an overview and wrap-up of the course. Each of the 6 learning modules will contain a video lecture, ranging from 45 seconds to 10 minutes and a handout with each lecture explaining the step-by-step process on paper. Each module will end with a multiple-choice question quiz to test your understanding of the topic. Modules 1-4 will contain challenge activities to try what you learned on your own. Finally, at the end of the course you will receive PDF files of the instructions for each module that you can download and use if you forget the material later.  </p>  <p>  \t    With nearly <strong style=\"\">2 hours of video</strong> showing step-by-step processes you are sure to become a successful online educator with Google Classroom. Use a little less paper in your classroom by starting the course today.  </p>", 
    "end_date": null, 
    "title": "Google Classroom", 
    "price": "40.00", 
    "instructors": "Amelia Kline", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380130_38bd_3.jpg", 
    "course_url": "https://www.udemy.com/google-classroom/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T16:53:39Z"
}