{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t  Este curso de <strong style=\"\">Audacity,</strong> es curso especialmente diseñado para que puedas <strong style=\"\">crear tus propias narraciones</strong> y para que crees audio de excelente calidad de manera sencilla y económica, para ser utilizado en el desarrollo de proyectos multimedia más sofisticados.  </p>  <p>  \t  Este curso es perfecto para quienes desean crear lecciones en formato de podcast o para quienes desean obtener audio de buena calidad para aplicar en sus proyectos multimedia.  </p>  <p>  \t<strong style=\"\">Audacity no tiene nada que envidiar a costos software de pago</strong>, pues te permitirá grabar, editar y aplicar efectos tal cual lo hacen otros programas, pero de una manera sencilla y totalmente gratis.  </p>  <p>  \t  En el curso verás que <strong style=\"\">no necesitas invertir en micrófonos caros ni especializados</strong>, para obtener audio de buena calidad.  </p>  <p>  \t  Una voz con música de fondo, sin duda que permite crear un ambiente mucho más personal y profesional, es por eso que explicaré como <strong style=\"\">Audacity te permite mezclar audio y voz de manera prácticamente automática</strong>.  </p>  <p>  \t  No necesitas ser un experto ni hacer toda la grabación a la perfección, pues te mostraré como yo realizo mi grabación y como hago <strong style=\"\">para cubrir los errores o mejorar la calidad de mi audio final.</strong>  </p>  <p>  \t  Algunas veces necesito crear voces para aplicar a personajes, con Audacity esto muy sencillo, y te mostraré como <strong style=\"\">cambiar el tono de la voz para que puedas obtener esa voz que estás buscando</strong> para tu personaje.  </p>  <p>  \t  En resumen en este curso te explico todo lo que necesitas saber para crear un <strong style=\"\">audio a un nivel muy profesional pero de manera sencilla y económica</strong>  </p>", 
    "end_date": null, 
    "title": "Grabar y editar audio con Audacity, como todo un profesional", 
    "price": "30.00", 
    "instructors": "Sr. Patricio Bustamante M.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381396_6445_3.jpg", 
    "course_url": "https://www.udemy.com/edicion-de-audio-con-audacity/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-31T04:40:43Z"
}