{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t <em>Are you looking for an easy way to help your child improve his/her penmanship skills and legibility?</em>  </p>  <p>  \t <em>Does the thought of practicing handwriting send your child into hiding? </em>  </p>  <p>  \t <em>What if there was an easy, fun way for your child to practice improving handwriting skills?</em>  </p>  <p>  \t   Handwriting Improvement for Kids is the perfect solution<em>!  </em>This course is specifically designed for 2<sup><span>nd </span></sup><span>through</span> 5<sup><span>th</span></sup> <span>grade</span> students looking to improve their penmanship skills.  </p>  <p>  \t <span>路</span>Your child will be taken on a fun filled adventure with our hero, Captain Pencil, as he discovers the 10 handwriting secrets and returns them to Leadville School  </p>  <p>  \t <span>路</span>Along the way your child will learn specific, time tested tips and tricks that will improve the look of his/her handwriting  </p>  <p>  \t   路This course includes 32 downloadable practices pages that allow children to lock in new skills  and break bad habits.  </p>  <p>  \t   路There is also a special section for teachers and parents, so you can support your child's learning.. Additional lectures on Pencil Grip, Lefties and Continued Practice Ideas are included .  </p>  <p>  \t  Instructor Availability: Best of all, Monica, a licensed Occupational Therapist is available to answer your specific questions about handwriting skills..  </p>  <p>  \t  Sign up today and we look forward to seeing you in Leadville!!!  </p>  <p>  \t <strong></strong>  </p>", 
    "end_date": null, 
    "title": "Handwriting Improvement For Kids", 
    "price": "30.00", 
    "instructors": "Monica Fortunato OTR/L", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/75992_8215_3.jpg", 
    "course_url": "https://www.udemy.com/handwriting-improvement-for-kids/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-09T01:48:15Z"
}