{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong><em></em>**Updated as of May 2016**</strong></p>\n\n<p><strong><br>Learn How to Create A Udemy Course Extremely Fast! In 3 Hours Time I Show You How I Create All My Course Content From Scratch, &amp; Still Meet Udemy's Quality Standards, So I Can Move Straight Into Editing &amp; Upload</strong></p>\n\n\n\n\n\n<ul><li>Design a succinct yet effective Udemy course with just a few hours of development</li><li>Learn the basics of Keynote - from formatting, to animation, and recording</li><li>Learn how to Screen Record a course presentation using ScreenFlow</li><li>Learn how to edit lectures using ScreenFlow's native workspace</li><li>Pull all the pieces together to create a beautiful course that excels in to-the-point brevity</li></ul>\n\n\n\n\n\n<p><strong>I started by observing all of Udemy's minimum expectations, then designed a short course around those expectations. The result is a high-quality course from the ground up! </strong><br></p>\n\n\n\n<p>One day on my day off from work, I set myself up to the challenge of creating a complete Udemy course that meets all of Udemy's quality standards in only 3 hours time. My vision was for the sort of student, be it a Udemy newcomer or a merely busy person that's eager to dive into teaching online. Who maybe doesn't have much time to dedicate a month let alone a week's worth of attention to developing a full course. In this course I show that sort of student how to take-off and get right into course creation for the Udemy platform.</p>\n\n\n\n\n\n<p>It was quite a challenge limiting myself to the minimum amount of lectures and content, but needless to say, it was a success! It even changed my perspective on long courses. I discovered that there's a way to condense material and still be entirely effective with the outcome. I no longer feel like I need to jam tons of material within one course. Sometimes the topic at hand lends itself to a more concentrated time frame. Such is my revelation with this course I have for you.</p>\n\n\n\n\n\n<p>You too can create a course that's concise, yet effective. This course was designed for the person that needs a jumpstart to teaching online. That needs a quick guided tour of Udemy's most emphasized standards. Who wants to learn how to create content and move quickly into editing and polishing before upload to Udemy.</p>", 
    "end_date": null, 
    "title": "How I Create a Udemy Course in 3 Hours Or Less - Unofficial", 
    "price": "35.00", 
    "instructors": "Cory Kensinger", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594274_848c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-udemy-course-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T19:01:14Z"
}