{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>  \t<strong>UPDATE: This course is completely updated and current through August 2015!</strong>  </p>  <p>  \t        <strong>Over 2,800 students have joined this course!  Don't get left behind - join today if you are serious about starting your own successful online business.</strong> </p><p>Get this course today! It is a road map to how you can EASILY build an online business selling the best products in the world - digital products (courses)! </p><p> Inside the course I give you an EXACT blueprint to how you can be successful in creating digital products of your own that you own and that will make you passive and residual income for years to come. </p><p> You should definitely consider joining this active course - I am extremely responsive inside the course answering questions from students and helping them build their own online businesses. I look forward to working with you, as well.  \t  \t                      --------------------------------------------------------------------------------------------------------  \t  \t                      Creating and selling your own courses via the Internet is the \"gold rush\" of our times! </p><p>And, you should definitely get your share of it - starting today. </p><p>If you want a real and easy way to make money working from home...you have found it. </p><p>Would you like to learn how to make money from your home from a seasoned Internet Marketing veteran that has created and sold online courses? </p><p>Be sure to check out the Proof Video(s) below to see exactly how I did it - and, to learn exactly how you can do it as well. </p><p>Can you follow easy directions that are included in this course and create your own online business that will pay you for years to come? </p><p>Do you want to start your own business that you can be proud of - starting today?  \t  \t                      If you answered “Yes\" to any of the questions above then you are well on your way to your own financial freedom. </p><p> Selling courses that teach people \"how to do things\" truly is one of the best ways to create real wealth for yourself.  </p>  <p>  \t                      Online courses are exploding right now - and, people are buying them right and left to learn everything from digital photography to how to how to build their own flying drones (yes - you read that right...there are courses out there that help people build flying drones). </p><p>My point - you can create a course on just about any subject and there will be people waiting and wanting to give YOU money for your course! </p><p>People want information and courses that help them improve their lives or just teach them a new skill - so, why shouldn't you be there selling your own courses and making a nice living in the process? </p><p> The answer - you should be! </p><p>And, with my course you can easily accomplish this - starting today! </p><p>This course will take you by the hand and easily guide you step-by-step to creating your own online products empire.</p><p>Are you intrigued?  Interested?  Think you can do this?  -- Well, truth be told ANYBODY can do this business! </p><p>Trust me - you can do this!  \t  \t                      If this is you – then you should definitely get this course:  \t  </p>  <ul>  \t<li>      Do you need more money?</li>  </ul>    <ul>  \t<li>      Do you want to quit your current job?</li>  </ul>    <ul>  \t<li>      Do you need money to catch up on your bills?</li>  </ul>    <ul>  \t<li>      Do you have a family that is depending on you?</li>  </ul>    <ul>  \t<li>      Do you just need extra money?</li>  </ul>    <ul>  \t<li>      Do you want to buy a new car, go on vacation, or start saving for retirement?</li>  </ul>    <ul>  \t<li>      Are you worried about the economy and need a second income?</li>  </ul>    <ul>  \t<li>      Do you want to have a business that you can be proud of?</li>  </ul>    <ul>  \t<li>    All of the above?</li>  </ul>  <p>  \t  \t                      This course will teach you everything that you need to know. </p><p>It is jam-packed with the EXACT STEPS that you need to easily follow to create your own online home business.  \t  \t                      This course is your road map to success. </p><p> Oh, and as a student of this course – you will get my help as well. I will be with you every step of the way. </p><p>You will be able to ask me any question(s) that you may have in the member's area. </p><p>This course is going to show you exactly how to be successful and make money. You will learn how to create a four to five-figure monthly business. </p><p>Within a few months you could quite possibly quit your job if you like – with the knowledge that you are going to learn from this course. </p><p>You will have the freedom to make that choice!  \t  \t                      This easy-to-follow course is going to expand and get bigger as well. I will constantly be updating it.   \t  \t                      Why – well, because I am not just teaching this business. </p><p>I actually run a successful online course creation and sales business, as well. I am always testing new ways to expand my business – and, I share all of my insider secrets with my students! </p><p>With my complete support of you every step of the way, you can easily become a real “make money from home\" success story. </p><p>You can be one of those people that you see that has it all – all you need to do is take this course and you will be on your way. </p><p>Also, I want to remind you that you have a 100% totally unconditional money-back guarantee with this course that completely protects you.  \t  \t                      Take my course – study it, test it, implement it…and, if for whatever reason you are not happy then you can get a 100% “no-questions asked\" refund. </p><p> You will have 30 days to test drive my course and be covered by this 100% money-back guarantee. So, you have absolutely no risk! </p><p> So, take the next step and get this course.  \t  \t                      This is opportunity knocking on your door! Take advantage of it. Cash in on it.  \t  \t                      So, do not get left behind. </p><p>Join the other successful students that are already cashing in – start today! </p><p>To your success, </p><p>Austin Hilton  </p>", 
    "end_date": null, 
    "title": "How to Create a Career Selling Courses On Udemy - Unofficial", 
    "price": "20.00", 
    "instructors": "Austin Hilton", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408266_e957_5.jpg", 
    "course_url": "https://www.udemy.com/unofficial-how-to-create-a-career-selling-courses-on-udemy/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-30T16:40:21Z"
}