{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong></strong></p>\n\n<p><strong>GUARANTEED MONEY BACK!!!!!!!!!!!  YOU HAVE NOTHING TO LOSE ONLY TO GAIN!!!!  JOIN NOW AND START MAKING THE INCOME YOU DESERVE......\n</strong></p>\n\n<p><strong>Updated April 27, 2016</strong></p><p><strong>Are you tired of being broke?  Who isn't!!!!! B</strong><strong>ecome a successful Entrepreneur today. Build a Your Own Digital Business which earns money every month.</strong></p>\n\n<p>Our Course shows in detail how to earn money on a consistent level every month.  <strong>Not a GIMMICK, here today and gone tomorrow</strong>.  This is no scheme but proven strategies I use today to make my living online.  I have decided to teach others so they can enjoy the same freedoms.</p>\n\n\n\n\n\n<p>In<strong> </strong>this course,<strong> How To Become An Entrepreneur Earn $4K Monthly Using Our Tips,</strong><strong> </strong>we teach you how to make money using ten different techniques from platforms to sell your products online to how to make money on Youtube with lots in between.  This is one of the most informative courses on Udemy.</p>\n\n\n\n\n\n<p><strong>This Course Will Teach Students</strong>:</p>\n\n\n\n\n\n<ul><li>How to use Youtube to earn revenue</li><li> Best Affiliate Programs for Earning Money Through Blogging</li><li> How To Make Money Selling Video Courses</li><li> Some of the best ways to get traffic</li><li> How to build an Email List</li><li> Learn to use Wordpress to Earn Money Blogging</li><li> Tips for Using Wordpress</li><li> How To Make Money Using Facebook Campaigns</li></ul>\n\n\n\n\n\n<p>How to sell your own info products to make money online with platforms such as <strong>Udemy, JVZoo, ClickBank, Affiliates, Blogging, Facebook Ads, and more.</strong>  It's safe to say that out of all these Startups you are certain to fall in love with at least one startup or ways to make money from your home.<strong>  Be your own Boss.</strong></p>\n\n\n\n\n\n<p><strong>Enroll in this course</strong> today to start earning money online.  We share not just 5 ways but 10 ways to earn money online.  We have made it simple to choose one of the options to start earning more money today.</p>\n\n\n\n\n\n<p><strong>Added Bonus Materials:(Over $299 Value)</strong></p>\n\n\n\n\n\n<p>Get 38 page E-Book which tells how to make money online.</p>\n\n\n\n\n\n<p>Plus get 11 Page E-Book which tells How To Speed Up Wordpress Site</p>", 
    "end_date": null, 
    "title": "How to Sell Online Courses on Sites like Udemy - Unofficial", 
    "price": "20.00", 
    "instructors": "Mitch Stevens", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507310_eb4c_2.jpg", 
    "course_url": "https://www.udemy.com/build-a-business-with-online-courses/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T17:11:10Z"
}