{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>This course will reveal to you how to find a highly converting topic for your next Udemy course.</p>    <p>You have the chance to look behind the scenes of two Top 100 Udemy instructors with more than 40,000 students and discover how they identify bestselling topics for their online courses.</p>    <p>Join this class and let me show you how we brainstorm topic ideas systematically and validate your ideas with our proven &amp; tested research formula. <br> </p>  <p><strong>Learn How to Take the Best Seat in The House &amp; Reap the Benefits Of Discovering A Topic People Want To Learn About.</strong></p>    <ul><li>Get hundreds of topic ideas by brainstorming systematically </li><li>How to validate your topic idea in 5 easy steps </li><li>Online course creation shortcuts from Top 100 Udemy instructors</li></ul><p><br><strong>Contents and Overview</strong></p>    <p>This course will walk you through all the steps of identifying a hot topic for your next online course on Udemy. </p>    <p>First, we’ll cover how this course is structured and why it’s worth investing your time and effort into creating a great training. <br> <br> After covering five common misconceptions we encounter on a daily basis when it comes to crafting a digital product, we’ll move on to the core of this training. <br> <br> Section 2 is all about brainstorming course topics systematically. I’ll show you step-by-step how we use four 100% free tools to come up with proven &amp; tested course topics in minutes. If you are not the most creative person, you’ll absolutely love this part. <br> <br> In Section 3, we’ll take the next step and validate potential course topics. We’ll run your course topics through a filter of five criteria to be 100% sure that the time &amp; effort you invest into creating a course will pay off. </p>    <p>By the time you complete the course, you’ll be able to identify dozens of potential topics for your next online course like a bestselling instructor on Udemy!</p>", 
    "end_date": null, 
    "title": "How to Find a Hot Topic for Your Udemy Course - Unofficial", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733350_4f77_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-a-hot-topic-for-your-udemy-course/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T21:36:46Z"
}