{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><em>\"Jacqueline has consistently encouraged and motivated all students through her natural warmth, charisma and incorporation of specific material and scenarios\". - Tino P. (Treuen, DE)</em></p>  <p>If you have been tasked with organising or providing in-house training for your colleagues, then <strong>this course is for you</strong>.  Or perhaps you're an HR professional needing to brush up your instructional design skills?  <strong>Come on in</strong>.</p><p>  \t        This powerful course skilfully weaves <strong>adult learning principles</strong> and theories with <strong>practical strategies</strong> for <strong>designing and delivering competency-based training programs</strong>, and puts the latest trends and techniques at your fingertips.   It also includes a <strong>wealth of resources</strong> for you to download and customise.  </p>  <p>  \t        This course will show you how to become a navigator, a facilitator of learning, not simply a presenter of information PLUS provide you with customisable templates which you can adapt to your workplace.  In addition, this course includes interviews with experienced training professional across a range of industries, each providing insights to better inform you and your work.</p>  <p>  \t        You'll <strong>build confidence</strong>, <strong>improve your training techniques</strong>, <strong>engage your audience</strong> from the beginning, <strong>leave your trainees praising your training abilities. and win more training contracts.</strong>  </p>  <p>  \t<strong>What tyre you waiting for?  Enrol now and let's get cracking!</strong>  </p>  <p><em>\"(She) consistently demonstrated awareness of what clients needed as individuals and what would benefit their organisation.\" - D.L. (Zwickau, DE)</em></p>", 
    "end_date": null, 
    "title": "How To Be The Best Corporate Trainer You Can Be", 
    "price": "30.00", 
    "instructors": "Jacqueline Seidel", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292290_a673_5.jpg", 
    "course_url": "https://www.udemy.com/train_the_trainer/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T11:32:13Z"
}