{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>Are you looking to build a Udemy course? If you are, you may have asked yourself the question “is there demand for my course?” or “how can I be <u>sure</u> that my course will be a success?”</p>  <p>These are extremely valid concerns that you should have as a course creator. Even if there is demand for your course, with over 30,000 courses taught by 18,000 instructors, it’s easy for your course to get lost amongst the competition. </p>  <p>But have no fear! There is a new tool on the block… Impactana. In the following 8 part video series, I’m going to show you how you can use Impactana to generate at the click-of-a-button:</p>  <ul><li>An understanding of whether there is any demand for your Udemy course idea… </li><li>A tonne of course curriculum ideas based on previously popular udemy courses and online content…</li><li>And a huge list of industry influencers who would be willing to promote your course…</li></ul>      <p>Armed with these tools, the chances of your course succeeding dramatically improve. With over 8 million hungry Udemy students, Udemy offers a huge opportunity to teachers wishing to spread their knowledge and earn serious money. </p>  <p>Sign up to Impactana’s Udemy Mastery Series absolutely free. Make sure you sign up for a free trial with Impactana to use throughout the duration of the course. I’ll see you there!</p>", 
    "end_date": null, 
    "title": "How to Create a Udemy Course That Works - Unofficial", 
    "price": 0, 
    "instructors": "Christoph C. Cemper", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715844_d908_3.jpg", 
    "course_url": "https://www.udemy.com/unofficial-how-to-create-a-udemy-course-that-works/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T18:08:30Z"
}