{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>It's the 2nd week after my 1st course went live on Udemy, this is my 3rd course, I created it in 5 hours. I've been talking to my students and a lot of people, it seems there are vast amount of people spending months to plan to create a Udemy course and spent weeks to research if Udemy is the right platform for them. <br></p><p>I was shocked. </p><p>Don't let the perfectionism stop you taking massive actions. The amount of time you talking about creating a course, argue with your instructors, or worry about how many lectures you should put in, you can create one already. </p><p>In this course I am going to show you how you can publish your first Udemy course fast. I often hear people debating if they should publish a course on Udemy, hesitation is what cost more time than just take action. </p><p>Instead of complaining about your worry and concerns, spent the same energy create your first Udemy course, testing this market. No one can tell you what will work what will not work until you take action testing your ideas. My 1st course is a dead fish in the pound, but I learned from my inexperience, my second course and third course all received sales and feedbacks within first 15 hours of course went live. I don't have an email list and it was only my second week on Udemy teaching!</p><p><strong></strong>Think about how much difference it can make you for your life if you can create and publish your Udemy course super fast. You can get everything ready as fast as in 3 hours, depends on your computer speed.</p><p><strong>This Course Released on 9/16/2015 with 13 lectures</strong></p><p><strong>[Updates] </strong></p><p><strong> Added 2 videos on 9/17/2015</strong></p><p><strong>Added 7 videos on 9/18/2015</strong></p><p><strong>Added 3 video on 9/21/2015</strong></p><p><strong>Added 3 quiz on 9/23/2015</strong></p><p><strong>Added 2 videos on 9/30/2015</strong></p><p><strong>Added 2 lectures on 10/18/2015</strong></p><p><strong>Added 1 lecture on 10/21/2015</strong></p>", 
    "end_date": null, 
    "title": "How to Publish a Udemy Course Super Fast - Unofficial", 
    "price": "20.00", 
    "instructors": "Qianjun Befanis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609274_b25c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-publish-your-first-udemy-course-in-3-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T17:19:02Z"
}