{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<strong style=\"\">Welcome to the Udemy Instructor Community! </strong>  </p>  <p>  \t  If you are a new instructor on Udemy, or an existing instructor looking to pick up some new tricks, you&#039;ve come to the right place.  This course is your one-stop-shop for all things related to course creation.  The Udemy instructor team has created this course to be a constantly evolving, continually updated resource for all of your course creation needs.  Here&#039;s what we&#039;ll cover:  </p>  <ul style=\"\">  \t<li>How to create your Udemy course, from beginning to end.</li>  \t<li>The Udemy quality standards: so you can make sure your course is up to par.</li>  \t<li>How to pick your course topic, identify your target audience, and plan your outline.</li>  \t<li>How to actually film your course: the nuts and bolts of capturing awesome audio and video, and high quality editing to make sure your course looks amazing.</li>  \t<li>How to position your course for success in the marketplace, using your course image, promo video, and landing page to convert students.</li>  \t<li>The Udemy review process</li>  \t<li>Promotional strategies, teaching tips, and how to make edits to your course post-publishing.</li>  </ul>  <p>  \t Additionally, think of this course as the jumping-off point for your exploration into the Udemy Instructor Community.  We&#039;ll direct you to all of our resources as well as our communities where you can join the conversation and interact with other instructors (as well as the Udemy team).  </p>  <p>  \t Ready to start your course creation journey?  Let&#039;s go!  </p>", 
    "end_date": null, 
    "title": "How to Create Your Udemy Course", 
    "price": 0, 
    "instructors": "Udemy Instructor Team", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244336_6f63_2.jpg", 
    "course_url": "https://www.udemy.com/official-udemy-instructor-course/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T18:22:52Z"
}