{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong style=\"\">Discover the 12 specific points that you need to hit in less than 2 minutes.</strong></p><p>Learn How To Maximize The #1 Marketing Tool Available – Your Promo Video…</p><p><strong style=\"\">A bad promo video can 'un-sell' your course in the first 18 seconds!</strong></p><p><strong style=\"\"> </strong></p><p><strong style=\"\">Think About This: </strong>They Won't Buy Your Course… Until They Buy You, </p><p>– They Can't Buy You Until They Can Buy Into The Fact That You Know What They Want To Learn…</p><p>Find out how you can identify yourself as the professional they need to learn from.</p><p><strong style=\"\">How to Create a Udemy Promo Video that Sells Your Course is a complete 1-on-1 coaching session. The entire course has been built with 1 purpose in mind… to help you sell more courses.</strong></p><p>You've worked too hard creating high quality course to leave the most important 2 minutes to chance.</p><p>Don't get caught in the frustrating trap so many others keep finding themselves in. Get the inside stuff no one else gets… learn the strategy behind sparking interest, building credibility, creating opportunity and motivating your future students to take that next ultra-important step of buying your course. </p><p><strong style=\"\"> </strong></p><p><strong style=\"\">Learn 5 different way to increase the value of your course.</strong></p><p>Understanding what to say, how to say it and when is an often overlooked piece missed by those who leave their success to chance.</p><p>Strat to deliver your message in a way that makes it easy for people to buy. Uncover the easy-to-do / easy-not-to do techniques that separate the professionals from the amateurs.</p><p>Let's start coaching to a very specific communication model, one that has both strategy and technique built into every sentence. Help your students make the mental shift from nice to have to Must Have!</p><p>Every section includes a follow along guide so you can take notes. To guarantee you complete the course with a personalized script that you can drop into your next promotional video - I've also included a script building worksheet for each of the 12 points we will be covering.</p>", 
    "end_date": null, 
    "title": "How to Create a Udemy Promo Video That Works - Unofficial", 
    "price": "35.00", 
    "instructors": "Bob Marx", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512928_2d8f_8.jpg", 
    "course_url": "https://www.udemy.com/udemy-promo-video/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T16:44:25Z"
}