{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>\r\n\t<strong>getSMART</strong> - Make it mission-critical to be educationally Specific, Measurable, Achievable, Relevant, and Timely to reach your goal.\r\n</p>\r\n<p>\r\n\t <strong>What is the course about?</strong>\r\n</p>\r\n<ol>\r\n\t<li>This tool takes a refreshing approach to the problem of student motivation.</li>\r\n\t<li>It doesn’t sugarcoat the need to work hard in school: with straight talk, it explains the reason why working hard is necessary.</li>\r\n\t<li>It offers a unique method for kids to research career possibilities that includes interviewing experts and visiting places of business.</li>\r\n\t<li>It addresses the illusion of “not being smart enough” that holds so many students back from realizing their full potential.</li>\r\n</ol>\r\n<p>\r\n\t<strong>What are people saying? </strong>\r\n</p>\r\n<ul>\r\n\t<li>&quot;The Student’s Advantage’ is absolutely the best compilation of vital information for learning that I’ve ever seen!  When I was reading this, I was constantly saying ‘yes, yes, yes, hallelujah!’  In my opinion the much needed basic information found in ‘The Student’s Advantage’ should be taught in mandatory classes in high school and to all students in their first year of college.” <br>\r\n\t<em>-Linda Dobson, Teacher</em></li>\r\n</ul>\r\n<ul>\r\n\t<li>“Wyne Ince has stepped forward as a motivational speaker and writer for students of the high school level on how to approach education not only on a daily basis but also on a philosophical basis.  This is perhaps one of the more devoted books focusing on teenagers as any on the market.”  <br>\r\n\t<em>-Grady Harp </em></li>\r\n</ul>\r\n<ul>\r\n\t<li>“Ince tells of success stories of students who began their education with numerous dysfunctions, but by applying the ‘7 Secrets’ emerged as future leaders in a myriad of fields.  I have been teaching English for many years and I will recommend this book to my students as a worthwhile resource for those who wish to advance to higher education or even to make the most out of their high school years.”  <br>\r\n\t<em>- Martin Asiner, Adjunct College Instructor</em></li>\r\n</ul>\r\n<h5>\r\n<p>\r\n\t <strong>What kind of materials are included?</strong><strong><br>\r\n\t </strong>\r\n</p>\r\n</h5>\r\n<h5>\r\n<ul>\r\n\t<li>Video clips and practical assignments</li>\r\n</ul>\r\n</h5>\r\n<h5>\r\n<p>\r\n\t <strong><strong></strong></strong>\r\n</p>\r\n</h5>", 
    "end_date": null, 
    "title": "How to Succeed in School or College", 
    "price": "20.00", 
    "instructors": "iUseMyBrain2 Project", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/74824_56bc_7.jpg", 
    "course_url": "https://www.udemy.com/iusemybrain2/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-07T01:06:58Z"
}