{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<strong style=\"\">Leverage the Power of the Internet</strong>  </p>  <p>  \t          Recent studies reveal that teachers want professional learning opportunities that are useful, relevant and provide hands-on learning experiences in the classroom.  Teachers are eager for resources that have an immediate, real-world application, that can meet the varied and diverse needs of their students. Web-technology is a powerful way to meet all of these goals.  </p>  <p>  \t          This course is designed to empower you with new knowledge and skill by teaching you how to integrate and apply web-technology into your daily learning environment. Learn how to leverage the power of the internet and &quot;power-up&quot; your lessons and daily activities by using web-based tools and technologies that wake-up, engage and excite students. I will introduce you to some of the best and latest tools that educators all over the globe are using and finding huge success!  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">We Help Good Teachers Be Great!</strong>  </p>  <p>  \t          You are already good at what you do! This course will make you stand out and give you a “talkable difference” in your educational workplace.  </p>  <p>  \t          Learn how to turn <em style=\"\">good</em> lessons into <em style=\"\">great</em> lessons by infusing them with the creative power of high interest web-technology, and user-friendly web tools. This doesn’t mean that you have to throw out your tried and true strategies and lessons. See how making small adjustments and changes can lead to huge differences in outcome while still meeting your goals and common core standards.  </p>  <p>  \t<strong style=\"\">Develop your new expertise in web-technology while students achieve greater levels of creativity, digital literacy and academic success.</strong>  </p>  <p>  \t<strong style=\"\">What&#039;s Inside:</strong>  </p>  <ul style=\"\">  \t<li>Build confidence as a digital age professional</li>  \t<li>Recognize how to embrace change or be left behind</li>  \t<li>Learn to use a variety of web 2.0 tools and technologies </li>  \t<li>Learn to tame the paper monster and get insanely organized using online productivity tools</li>  \t<li>Find out how using a <em style=\"\">virtual assistant </em>can help you manage a multitude of tasks</li>  \t<li>Learn how to use your new knowledge to grow as a professional</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \t      This course includes 27 short lectures in the form of video, screencasts, and documents.  These lectures introduce and demonstrate the use of various web-based technology tools that are applicable for immediate classroom use. Using web technology is fun for teachers and students, and very easy to learn.  No advanced knowledge or training is required.  </p>  <p>  \t      Students also learn to use web-based productivity tools that help teachers collect, present, archive and manage classroom content. These tools are designed to help teachers streamline day to day responsibilities, helping them to work more efficiently and stress-less.  </p>  <p>  \t      Students also learn about the idea of using a virtual assistant. Virtual assistants provide a “second set of virtual hands” to teachers by completing tasks and projects via the internet. Virtual assistants are often used in business, but are gaining popularity in the education sector to help manage the ever-increasing demands of being a teacher.  Students learn about the cost of using a virtual assistant and the process of hiring one.  </p>  <p>  \t      Students will leave this course having developed a new expertise in educational web-technology.  They will have a greater understanding of how web-technology can be used to enrich learning, motivate students, and increase academic success, all the while meeting district goals and common core standards. This new expertise translates into solid ideas that can be directly integrated into existing lesson plans and shared with colleagues and administrators.  </p>  <p>  \t<strong style=\"\">Who is this course for? </strong>  </p>  <ul style=\"\">  \t<li>Teachers: New hires and seasoned educators</li>  \t<li>Teachers who like to try new things and find new avenues for teaching and reaching students.</li>  \t<li>Teachers who aren’t afraid to learn from their students.</li>  \t<li>Anyone who is curious about web-technology</li>  \t<li>Anyone who wants to create a valubele new skill set</li>  </ul>", 
    "end_date": null, 
    "title": "How to Wake Up Students With Web Technology", 
    "price": "25.00", 
    "instructors": "Sharon LaVigne", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/201486_00f6_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-wake-up-students-with-web-technology/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-18T23:55:17Z"
}