{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>  \t                              “I Know The Exact Amount of Money You Will Earn on the Course You Never Make.”  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">Learn How to Create a High Quality UDEMY Course in Just 5 Day's !</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Understand the Value of What You Already Know</strong></li>  \t<li style=\"\"><strong style=\"\">Learn a Step-by-Step System</strong></li>  \t<li style=\"\"><strong style=\"\">Discover an Easy Way to Create Content</strong></li>  \t<li style=\"\"><strong style=\"\">Get the Inside Secrets to Produce &amp; Record Your Next Course</strong></li>  </ul>  <p style=\"\">  \t<strong style=\"\">Get Those Ideas Out of Your Head &amp; Onto the Screen...FASTER</strong>  </p>  <p>  \t                                      Do you have something to share?  Does the idea of creating a course to sell on UDEMY sound like something you would like to do… if only you had the time?  </p>  <p>  \t                                      During a 7 week period I created, produced, submitted and am now selling 8 NEW courses on Udemy.  </p>  <p>  \t<strong style=\"\">From January 1 through February 10<sup style=\"\">th</sup> 2015 – I published 8 Courses – in my spare time…</strong>  </p>  <p>  \t                                      Usually the biggest reason we fail to get started or accomplish our goals is the strategy we are using is setting us up to fail.  </p>  <p>  \t<strong style=\"\">How to Create a Udemy Course in just 5 days </strong>  </p>  <p>  \t<strong style=\"\">This is a complete system – nothing is left out.</strong>  </p>  <p>  \t                                      Let’s walk through step by step, the exact process you can use, to create content and produce a high quality course.  </p>  <p>  \t                                      Everything becomes easy when you know how – learn a system that will help you get the information that’s already in your head onto the screen.  </p>  <p>  \t<strong style=\"\">Start producing your course, sharing your valuable information now.</strong>  </p>  <p>  \t                                      In the past 15 years I’ve had a chance to works with tons of individuals in all kinds of professions.  One thing I’ve noticed again and again…  We tend to discount the value of what we know.  </p>  <p>  \t                                      Think about it…  if you were to add it up…  All the time, effort, energy and money spent learning everything about your subject – I’ll bet it’s pretty impressive.  </p>  <p>  \t                                      Typically the biggest road block to getting started isn’t taking that first step… it’s knowing what to do after you get started.  </p>  <p>  \t                                      Mapping out your thoughts and ideas.  Creating a high quality course that you’re proud of while adding value to the life’s of those who buy it. – Getting your thoughts and ideas out of your head and onto the screen.  </p>  <p>  \t<strong style=\"\">Save time by learning a system that can guide you through the entire process.  Get it done in 5 days!</strong>  </p>  <p style=\"\">  \t                                    Achieve your entrepreneurship dreams by creating courses on: lean start-up, developing a business plan, and launching your venture.  </p>", 
    "end_date": null, 
    "title": "How to Create A Udemy Course in 5 Days or Less - Unofficial", 
    "price": "45.00", 
    "instructors": "Bob Marx", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416836_ace5_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-udemy-course-in-5-days-or-less-part-time/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T22:58:06Z"
}