{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.</p>\n\n<ul><li>This course is taught by a <strong>full time Udemy instructor</strong></li><li><strong>20'000 satisfied students</strong> enrolled in my courses</li><li><strong>300+ TOP reviews</strong> in my courses</li></ul><p><em>LATEST: Course Updated Again for November 2015</em></p><p>This course will give you a clear step by step blueprint to create your profitable udemy course in 3 days only so you can make extra money easily! No experience needed!</p><p><strong>Create Your Profitable Course on Udemy In 3 Days Only With My Proven Step By Step Blueprint.</strong></p><ul><li>Create your Udemy course from A to Z</li><li>Produce your course really easily</li><li>Udemy Marketing Secrets Revealed</li><li>Udemy Course Promotion Secrets</li></ul><p><strong>Your Profitable Udemy Course In 3 Days Only!</strong></p><p>Udemy has paid out $1.6 million to the top 10 instructors. But you don't need to be a top 10 instructor to make a lot of money on Udemy. Udemy generates milions of dollars per year. The most interesting fact is that everyone can make money teaching their skills on Udemy. Why not you?<br></p><p><strong>Content and Overview</strong></p><p><strong></strong>COURSE CREATION: You will learn how to generate topic ideas for your course, how to select your profitable course topic, how to keep your motivation at 100% through the whole creation process, I'll walk you through the complete process of course creation. Everything is included.</p><p>=&gt; You will have your complete course defined in one day only! You will save a lot of time with this section!</p><p>COURSE PRODUCTION: Learn to produce a Udemy course in minutes without friction. You will learn which equipment to use (FREE up to 120$). Which software to use, how to record, edit and produce your videos the easiest way! I'll share all the tips to make your life easier while producing your course.</p><p>=&gt; You will be able to record, edit and produce your lectures without any headaches!</p><p>COURSE MARKETING: Learn everything you need to know about the udemy marketing. Learn exactly how to create a high conversion promo video, an amazing course descirpiton, how to select your course title &amp; subtitle to rank high on the Udemy search algorithm &amp; so much more!</p><p>=&gt; You will be able to boost your sales 10x with the techniques in this course.</p><p><span></span>COURSE PROMOTION: Learn all the udemy promotion secrets! Learn how to get a lot of reviews, how to deal with the negative ones, how to really make money from your promotional announcements, how to get thousands of new students! And a lot more!</p><p>=&gt; YOu will learn anything you need to know about promotion on Udemy.</p><p><strong>This course has a 30 day money back guarantee. You can try this course and see how much money you can make on Udemy! Why not trying? You can only make money from this deal!</strong></p>", 
    "end_date": null, 
    "title": "How to Create, Market, & Promote a Udemy Course - Unofficial", 
    "price": "20.00", 
    "instructors": "Alain W.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/574456_f09b_14.jpg", 
    "course_url": "https://www.udemy.com/unofficial-how-to-create-market-and-promote-a-udemy-course/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T09:45:04Z"
}