{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>Nothing converts higher than online video. Human beings process visual information 600,000 times faster than the written word. If you have a product to sell, a message to deliver or a subject to teach, video is the most effective way to connect with your audience. In fact, putting video on a landing page increases conversion by 80%. And, by 2017, 75% of all internet traffic will be video. </p><p>This course is geared towards those that have a message, product or service to sell but are beginners at online video and are looking for a simple solution yet effective solution using their iPhone 5, 5s or 6 to create beautiful looking and sounding videos. </p><p>This course will teach you everything you need to know to put yourself on high quality HD video using just your iPhone and an additional $70 worth of gear. In addition, you'll learn how to avoid the top mistakes people make on camera and how to look and feel your best while effectively sharing your passions and expertise.</p><p>In this course you will learn:</p><ul><li>What gear you will need to create great looking and sounding videos using your iPhone</li><li>A step-by-step process to create your video set-up using the techniques I use for my own videos</li><li>How to use simple, free and flattering lighting techniques to make you look your best on-camera</li><li>How to edit your footage in iMovie and get it ready for upload</li><li>How to avoid the common mistakes people make when on camera</li><li>How to overcome camera fright. </li></ul><p>This course is structured in easy to follow step-by-step videos that show you chronologically how to create your videos assuming you know very little, if anything, about putting yourself on-camera. </p><p>This is course is great for those who want to get themselves on video, looking and sounding good, but are new to video or don't have the budget for expensive cameras and lights.  </p>", 
    "end_date": null, 
    "title": "How to Create Udemy Videos with Your iPhone - Unofficial", 
    "price": "45.00", 
    "instructors": "Michael Cinquino", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532274_946f_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-udemy-videos-with-your-iphone/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T15:43:12Z"
}