{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t         Learn the foundations of life coaching and how to make serious cash as a life coach. If you enjoy helping people achieve success in their lives then you should take this course. You will learn the basics of becoming a life coach, how to start your own coaching business, how to sell and market your coaching products while making money online all from the comfort of your home.  </p>  <p style=\"\">  \t        We&rsquo;ll cover all the basics you need to get started and on your way of becoming a life coach, how to start an effective coaching sessions and how to build the basic building blocks of your coaching business.  </p>  <p style=\"\">  \t        In these tutorial videos,  you&#039;ll learn how to ask thought-provoking detailed questions,  in oder to help your clients set realistic and obtainable goals, how to go from stuck to unstuck, hold them accountable and help them reach their dreams. And, learn how to get your coaching business up and running in a short period  of time on a limited budget.  </p>  <ul style=\"\">  \t<li style=\"\">Promote your business on Facebook</li>  \t<li style=\"\">Increase your Facebook post exponentially and get clients</li>  \t<li style=\"\">Package and sell your coaching products</li>  \t<li style=\"\">Get more clients by advertising with social media and affiliate markets</li>  \t<li style=\"\">Listen to live audio coaching session</li>  </ul>", 
    "end_date": null, 
    "title": "How to Become a Life Coach and Get Paid", 
    "price": "20.00", 
    "instructors": "Tina Stith-Twine", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131052_a46b_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-life-coach-and-get-paid/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-08T22:03:30Z"
}