{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This is a step-by-step guide to learning the phonetic chart. You will learn why, how and when, as an English language teacher, you should use phonetic symbols and how this will dramatically improve your teaching of pronunciation. This is a proven method which has been taught to many language teachers with great results.</p>\n\n\n\n\n\n\n\n<p>First of all, you will learn the phonetic symbols from the International Phonetic Chart and the practise how to transcribe any accent of English - American, British, Australian, etc. you will then learn about different phonetic scripts, how to use the phonetic chart in the classroom, You will become much more effective in teaching pronunciation and help your students remember the pronunciation of new words.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You will appreciate this practical and informative video workshop and your students will appreciate your using the phonetic chart.</p>\n\n\n\n<p><strong>Some comments:</strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>“You present very well on the video, Luke. It is academically sound.”</p>\n\n\n\n<p><strong>Mr Lance Ebert, Deputy Principal, Excelsior College, Sydney</strong></p>\n\n\n\n\n\n\n\n<p>“The video is thoroughly practical and useful, as I am used to from you.”\n\n  </p>\n\n\n\n\n\n<p><strong>Ms Joss Brockie, Director of Studies and long term colleague, Gold Coast</strong>\n\n  </p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "How, when & why to use The Phonetic Chart", 
    "price": "20.00", 
    "instructors": "Luke Zimmermann", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622766_4263_3.jpg", 
    "course_url": "https://www.udemy.com/how-when-why-to-use-the-phonetic-chart/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-26T03:43:19Z"
}