{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><em>\"Very useful course - well presented with loads of useful info. I think Roma just about covers the voice from every angle\"!<br></em></p><p><em>\"I'm not an instructor but am starting a podcast. </em><em>I'd found myself a bit hesitant, partially because of a lack of confidence in my voice. The exercises in Roma's course have been very useful in not only improving my vocal quality, but giving me more confidence to actually launch my next project. Definitely recommended.\"</em><br></p><p><br></p><p><strong>Are\nyou producing online courses or podcasting but feel like your voice needs a little\nhelp?</strong><br></p><p>Maybe you are having trouble with practical things like\nprojection, vocal fatigue, or changes in vocal tone. <em>Let me teach you\nsome practical things you can learn quickly that will help you stand\nout as an instructor or podcast presenter.</em></p><p>My name is Roma Waterman, I have been a professional vocal coach,\nsinger/songwriter, author and speaker for over 20 years. One\nof the biggest comments I receive is <em>“How can I improve my voice to\nbe a great online instructor or for podcasting?” </em>This is why I created this course!</p><p>Let me give you tips you can implement to improve your voice straight\naway. <strong>This is an easy, no fuss, get to the point program that will\nget you doing what you really want to do....teach, and teach well!</strong><br></p><p>I have created 19\neasy to listen to lectures to help you learn fast – so you can get\non with the business of producing a winning course. There are PDF\nPrintouts and notes, and simple\nquizzes to test your knowledge. </p><p><span></span>As\n\ta top vocal instructor I know the in's and out's of what it takes to\n\tcreate a prime voice that sells. You don't need to be a singer or actor to\n\tlearn these essential tips that many performers use. </p><p><strong>What you need is a little bit of time training your voice to perform well to set\n\tyou up for a lifetime of communicating brilliantly.</strong></p><p><strong></strong>This\n\tcourse will help you recognise\n\twhat makes an amazing online instructor stand out among the rest!</p><p><br></p>", 
    "end_date": null, 
    "title": "Improve Your Speaking Voice to Teach Online or Podcast", 
    "price": "20.00", 
    "instructors": "Roma Waterman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657458_1190_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-improve-your-voice-to-teach-an-awesome-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T04:20:56Z"
}