{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Social media has revolutionized communication, business and even the way we interact day to day. This detailed course will show you how social networks can be used to innovate the classroom and broaden your own professional skill-set and personal learning network.</strong>  </p>  <p style=\"\">  \t        Leigh Technology Academy ICT teacher and social media addict Toby Adams presents this comprehensive and fun introduction to social media in education. With tutorials taking you through the four major social networks (Twitter, Facebook, Google+, Pinterest), the course provides everything you need to get up to speed in social media as well as create, build and grow your personal learning network.  </p>  <p style=\"\">  \t<strong style=\"\">What is covered in this course?</strong>  </p>  <ol style=\"\">  \t<li style=\"\">Twitter</li>  \t<li style=\"\">Facebook</li>  \t<li style=\"\">Google+</li>  \t<li style=\"\">Pinterest</li>  </ol>  <p style=\"\">  \t<strong style=\"\">What will you master on successful completion of this course?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Choosing the right social network for you and your school</li>  \t<li style=\"\">Understanding the key differences and benefits between different social networks</li>  \t<li style=\"\">Ensuring privacy and security settings are put in place</li>  \t<li style=\"\">Using social networks to find and share content and media</li>  \t<li style=\"\">Using social media to grow and nurture an invaluable personal learning network (PLN)</li>  \t<li style=\"\">Setting up school and class pages on social networks</li>  \t<li style=\"\">Using social media to build a community in your school and professional network</li>  \t<li style=\"\">Applying practical examples in your personal networks and with your students</li>  </ul>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Discounts are available for group, school or district purchases</strong> - please c</em>ontact us<em style=\"\"> to inquire further.</em>  </p>", 
    "end_date": null, 
    "title": "Introduction To Social Media In Education", 
    "price": 0, 
    "instructors": "Fractus Learning", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49220_6d58_6.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-social-media-in-education/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-10T11:14:15Z"
}