{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Crea de forma fácil y rápida contenidos e-learning efectivos y motivantes</strong>  </p>  <p style=\"\">  \t                iSpring Suite 7 permite incorporar una pestaña en PowerPoint que brinda acceso a una serie de opciones y características con las que podrás crear contenidos e-learning al tradicional estilo de PowerPoint.  </p>  <p style=\"\">  \t             Este curso esta diseñado para que prácticamente cualquier persona pueda,  en sólo algunos minutos, crear contenidos para cursos e-learning sin  necesidad de ser un experto  </p>  <p style=\"\">  \t    iSpring es una herramienta muy intuitiva, pero para poder sacarle el máximo provecho hay que dedicarla algún tiempo y probar sus opciones avanzas, las que sin duda marcarán la diferencia para que obtengas un contenido de primer nivel.  </p>  <p style=\"\">  \t    En este curso comienzo cubriendo los aspectos básicos, para luego ir a aquellos puntos más avanzados y que muy pocas personas conocen y aprovechan.<br style=\"\">  </p>  <p style=\"\">  \t<strong style=\"\">Presentaciones con Narración</strong>  </p>  <p style=\"\">  \t          Te explicaré paso a paso como incorporar narración, ya sean en formato de audio o video, a cada una de las  diapositivas de tu PowerPoint, de esta manera tus alumnos comprenderán y  se engancharán mejor con tus presentaciones.  </p>  <p style=\"\">  \t<strong style=\"\">Evaluaciones Interactivas</strong>  </p>  <p style=\"\">  \t        Con iSpring QuizMaker podrás crear evaluaciones y encuestas altamente interactivas y motivantes. Podrás ofrecer a tus  alumnos la posibilidad de medir el nivel de aprendizaje que están  alcanzo gracias a tu curso.  </p>  <p style=\"\">  \t<strong style=\"\">Interactivos Prediseñados</strong>  </p>  <p style=\"\">  \t        Con iSpring Visual, podrás cautivar a tus alumnos con espectaculares contenidos interactivos.   Te enseñaré a utilizar los  interactivos que ya están prediseñados y podrás crea una  experiencia única en tus alumnos.  </p>  <p style=\"\">  \t<strong style=\"\">Publicación en plataformas LMS</strong>  </p>  <p style=\"\">  \t      No tan sólo te explicaré como utilizar iSpring Suite para crear contenidos, sino que también te mostraré como publicar el contenido e-Learning que desarrolles. Ingresaremos a una plataforma e-Learning, para que puedas ver paso a paso como dejar tu contenido disponible en Internet.  </p>  <p style=\"\">  \t  Este curso es lo que necesitas para poder crear contenidos e-Learning, de manera fácil, rápida y sencilla con una de mis herramientas favoritas para desarrollo e-Learning.  </p>", 
    "end_date": null, 
    "title": "iSpring Suite 7: Crear contenidos y actividades e-Learning", 
    "price": "50.00", 
    "instructors": "Sr. Patricio Bustamante M.", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255824_295a_9.jpg", 
    "course_url": "https://www.udemy.com/ispring-suite-7/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-04T21:50:13Z"
}