{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Hello, and thank you for your interest in this course. This course is about how to use the professional screen capture and recording program called: ScreenFlow. I am using version 5 of the program in this course. </p><p>ScreenFlow is what I have used to create dozens of courses and lessons for Udemy. In this course I take you through an actual course I was editing to show you the features of this tool. I use a very behind-the-scenes approach, showing you my screen, and giving you a workflow approach to using ScreenFlow. </p><p>By the time you are finished with this course, I will help you to understand and use ScreenFlow, so that you have become comfortable with the software. I have divided up my lessons into smaller pieces, so that when you are editing your own content, that you will be able to use the lessons as a reference. When you ask, how did he do this or that technique, you can quickly reference the lesson and apply it in your own project. </p><p>This course is to the point, and though I do take a few lessons to explain my thought process, or give you expert advise about how to edit, direct or produce, I try to keep things concise and to the point. You will notice that the lessons are short, just what you need. </p><p>The course is designed as a workflow, and I made it that way. The course is in the order that I use ScreenFlow. I do not just go through menu items, or look at lists of commands, I take you through an actual project. When starting a project, you do A, B, C, D, E and then F, G, H and over here you do I , J, K, and then you are ready for this step and done. I will show you where to find things in the program, but I show you the commands that you need and where to find them, and explain to you how the writers of the software thought, which will give you a better understanding of the program and how to use it. </p><p>I wrote this course independent of experience level with the software, and out of a need that I saw, where there was not much documentation to get up and running with the software. I know that once you take this course it will become a standard tool in your toolbox, just like it has become in mine. Enroll now, and I'll start getting you comfortable with ScreenFlow. </p><p><br></p>", 
    "end_date": null, 
    "title": "Learn to Produce with ScreenFlow", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635568_d30e_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-produce-with-screenflow/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T04:54:28Z"
}