{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Did you ever wish you could sit next to someone who has been using Final Cut Pro for years, and learn how to do a video project the easy and simple way? Did you every wish it would be easy to go back and reference lessons, because they were short and easy to locate? These questions are what led me to make and design this course. I decided to make a course I'd want to take myself. What I most wanted to know when I started working with Final Cut Pro was, how do you get a project from start to finish, and show me some tips and tricks along the way. </p><p>That is why this course exists, it is to give you that knowledge, the knowledge I wish I had when I started. Knowing about what tools are available is a good piece of information, but knowing how to use those tools can change who you are, and what you are able to do. <br></p><p>This course is designed with beginner to the advanced in mind. If you want to know how to work with a library, or event or project, or you want to dig deeper into Final Cut Pro, and learn about the terminal and hidden files and features, then you are covered, either way. </p><p>The lessons in this course are taken from a screencast of myself working on the promo video for this course. That's right, you are working on this course, the actual course. You sit with me, and I take you though all the steps that I did, from importing to managing content, to making a project, adding assets to that project, and then removing noise, hum, and hiss from the audio, to video effects, video titles, pitfalls, editing and exporting. </p><p>I show you how to do complicated tasks with powerful software in an easy and repeatable fashion. If you follow my steps you will be able to easily apply the same techniques and methods to your own projects and videos. As a handy added bonus, you also get access to retake any lesson, and since I spent the time to chop them into bite-sized pieces, you will be able to locate the exact lesson you want to reference in the future. I spent days and hours making this course to save you, what could easily take 3-12 months to learn on your own. </p><p>I hope you enjoy taking this course, and learning from me. I enjoyed making this course, and I want you to take my knowledge and use it to improve your skills and abilities. Enroll Now, and let's begin learning to edit with Final Cut Pro X.</p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Editing with Final Cut Pro X", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618792_62fc_2.jpg", 
    "course_url": "https://www.udemy.com/learn-editing-with-final-cut-pro-x/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T04:26:32Z"
}