{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>This course covers a logical, step-by-step approach to learning ScreenFlow 5 as quickly as possible.</strong></p><p><strong>Featured Review:</strong></p><p><em><strong>Overall Perfect Introduction to ScreenFlow 5:</strong></em></p><p><em>Sunday, July 19, 2015: Finished this course in one sitting</em></p><p><em>The course title says it all. Laurence Kim clearly knows what he's doing and provides an immediate and perfect introduction into ScreenFlow 5. I was pretty intimidated with the software at first because I didn't know how to use it, but the structure and tips that Laurence provides in this course is just perfect. It's practical, short, and easy to follow along.</em></p><p><em>I learned to apply the tips while watching the courses and lectures at the same time which made me realize how easy it was to apply the tips. I'd definitely recommend this short and easy course. Feeling pretty excited and more confident about the possibilities of creating worthwhile videos, and lectures in the future.</em></p><p>After teaching thousands of people from Fortune 500 companies to individual entrepreneurs for the past 10 years, I've come to learn the teaching methods that work best, especially when learning technical topics like software. People learn best by watching in bite size bits, then practicing what they've just learned.</p><p>Rather than taking a long time to explain what every menu and button does, I simply start building a ScreenFlow 5 project.</p><p>You'll watch me:</p><ul><li>create a new ScreenFlow project</li><li>import media files like video files, audio files and jpeg image files</li><li>record my screen with a voiceover</li><li>record video using my webcam</li><li>edit the video</li><li>add special effects like text, annotations and call-outs</li><li>add transitions between video clips</li><li>add music tracks to a video</li><li>edit the audio</li><li>export the project into your desired format</li></ul><p></p><p>The format is watch, then replicate. I'll perform a bite-size task, then you'll perform that same task on your own project. That, my friends, is the fastest way to learn. There's no theory, there's only <em><strong>doing</strong></em>.</p><p>Each lecture will be short and to the point. 90% of the lectures are under 4 minutes and 100% of them are under 5 minutes. There is zero fluff and nothing has been added to make the course longer. In fact, my goal was to teach the material in the shortest possible time.</p><p>Throughout the course there will be practice exercises that tell you <strong>exactly </strong>what to do next as you build your sample ScreenFlow project along with me. Nothing is left to guesswork - you'll know what the assignment is.</p><p><strong>What will I walk away with after completing the course?</strong></p><p>After finishing this course you'll be able to complete a fantastic ScreenFlow 5 project in a short amount of time.</p>", 
    "end_date": null, 
    "title": "Learn ScreenFlow 5 Fast", 
    "price": "20.00", 
    "instructors": "Laurence Kim", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480414_8a1a_2.jpg", 
    "course_url": "https://www.udemy.com/learn-screenflow-5-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-19T16:13:20Z"
}