{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Learn exactly how you can create wealth by learning how to trade options. This easy-to-learn course will show you all the necessary aspects of trading options.</strong></p><p>Options can be complicated if it's taught in a way doesn't make sense for the average trader. This course will make everything simple. If it's not important or not useful in the learning process, it's not here! </p><p>I want you to learn, not from the point-of-view of a textbook, but from a personal level and from someone who learned trading by trial-and-error, through reading books, watching courses, and taking the time to make everything simple.</p><p>Every options course will teach you how to trade options, but this is the only course that will teach you how to trade options in a way that makes sense and cuts through all the unnecessary jargon.</p><p>Trading options is a process and a learning experience. In this course you'll learn the basics of options:<br></p><ul><li>Know yourself and the type of trader you are</li><li>What an option is exactly?</li><li>How an option looks like</li><li>What is a call option?</li><li>How to trade call option</li><li>What is a put option?</li><li>How to trade a put option</li><li>And much, much, more...</li></ul><p>After you've learned how to trade options here, I'm writing another course on the six simple strategies I use and how you easily obtain a 20% annualized return if you do it right!</p><p>I don't teach you in order to give you a handout, I teach you in order to get a hand up in your investing.</p><p>Whether you're supplementing your income, growing your wealth, or saving for retirement, learning how to invest for yourself is the greatest knowledge you can have.</p><p>I'm available for any questions and comments. Learning never ends.  <br></p><p><br></p>", 
    "end_date": null, 
    "title": "Learn How to Create Wealth Trading Options", 
    "price": "25.00", 
    "instructors": "Kyle Colman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818344_9ca8_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-create-wealth-trading-options/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T03:08:00Z"
}