{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Vous êtes formateurs débutant ou intéressé par la pédagogie, vous souhaitez compléter votre information sur les différentes méthodes, ce MOOC d'introduction est fait pour vous.</p>\n\n<p>L'animation d'un cours ou d'une formation passe par l'utilisation d'une (ou plusieurs) méthode(s) pédagogique(s).</p>\n\n\n\n<p>Dans ce cours, vous aurez une <strong>information synthétique</strong> sur les différences fondamentales entre les méthodes. Vous pourrez définir les différentes démarches pédagogiques ainsi que les méthodes qui en découlent. Vous obtiendrez une information sur les activités concrètes qui seront menées au service des méthodes utilisées. Cette capsule formative se veut avant tout <strong>pragmatique</strong> et initiera une réflexion sur des situations concrètes.</p>\n\n\n\n<p>Ce cours de très courte durée est composé de quatre thématiques:</p>\n\n\n\n<ol><li>Avant de choisir une méthode</li><li>La question qui guidera vos choix</li><li>Les différentes démarches pédagogiques et méthodes qui en découlent</li><li>Les activités concrètes qui seront menées</li></ol>\n\n\n\n<p>La matière sera abondamment illustrée par de courts exposés ainsi que certains exemples de méthodes pédagogiques (séquences vidéo HD). Un QCM de positionnement vous est proposé. Une production personnelle vous est demandée pour l'évaluation finale. Cette dernière permettra une interaction lors de retours entre pairs.</p>\n\n\n\n<p>Pour cette formation, un maximum de 2 heures de travail personnel sont à prévoir (estimation moyenne).</p>\n\n\n\n<p><strong><em>Ce MOOC d'introduction est entièrement gratuit et essentiellement centré sur l’aspect pratique.</em></strong></p>\n\n\n\n<p><strong><em><br></em></strong></p>\n\n\n\n<p><strong><em><br></em></strong></p>\n\n\n\n<p><strong><em><br></em></strong></p>", 
    "end_date": null, 
    "title": "Les méthodes pédagogiques", 
    "price": 0, 
    "instructors": "UO-FWB Université Ouverte de la Fédération Wallonie - Bruxelles, leslie Moreau, Monsieur URBAIN Laurent", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526132_346f_4.jpg", 
    "course_url": "https://www.udemy.com/les-methodes-pedagogiques/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T16:38:48Z"
}