{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \tVelkommen til det 21.århundrede og til Danmarks måske første onlinekursus for lærere. Er du underviser er dette kursus lige det, du har brug for i forhold til at blive klædt på til at give dine elever en spændende og tidssvarende undervisning, der giver dem de kompetencer, som de vil få brug for i det 21.århundrede.  </p>  <p>  \tJeg har det af og til sådan, at jeg har følt, at jeg har gået over broen, som du kan se på billedet, når jeg skulle definere, hvad mine elever i virkeligheden har brug for at lære. Det satte jeg mig for at undersøge og dette kursus er resultatet.  </p>  <p>  \tMed udgangspunkt i samfundets ændringer skal vi se på teorier om læring i det 21.århundrede, forskellige bud på, hvad eleverne skal lære og hvordan man så kan lære dem det. Vi skal også undersøge, hvordan man sætter mål og evaluerer på, om målene bliver nået.  </p>  <p>  \tI kurset vil du møde teorier og tanker, men også praktiske tips tilpasset en dansk undervisningssammenhæng. Kurset er opbygget af en række undervisningsvideoer, som du kan se i dit eget tempo og når du har tid. Der vil også være masser af links til ressourcer fra den vide verden og vigtigst af alt, så har du mulighed for at diskutere med dine medstuderende og mig, både via denne platform, men også på #didaktiktips på Twitter.  </p>  <p>  \tKig venligst moduloversigten igennem, så du har et billede af, hvad det hele handler om. Jeg glæder mig til at lære sammen med dig og sammen kan vi måske komme helskindede over broen til gavn for vore elever.  </p>  <p>  \tvh Martin  </p>", 
    "end_date": null, 
    "title": "Læring i det 21.århundrede", 
    "price": 0, 
    "instructors": "Martin Jørgensen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306368_f300_3.jpg", 
    "course_url": "https://www.udemy.com/lring-i-det-21arhundrede/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-23T20:20:26Z"
}