{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>What is the biggest difference between the most successful Udemy instructors and everyone else?</p><p>They have a website.</p><p>They have other things going on OUTSIDE Udemy.</p><p>It might be a simple website.</p><p>It might be a blog.</p><p>They may even host a Podcast and a Youtube channel.</p><p>Whatever the case may be, the essential factor in their teaching business is that they have a website.</p><p>A single hub that brings together everything they are doing online, and maximizes their course sales in the process.</p><p>Here's the funny thing though, about websites.</p><p>Many instructors have website that struggle to make any sales.</p><p>Why?</p><p>Because they aren't optimized for sending students to Udemy. </p><p>Let's run some numbers:</p><p>When you look at your Revenue Statement, you usually see a mix of two things.</p><p>Udemy Organic Sales and Affiliate Sales. 50% sales and 25% sales.</p><p>And then every once in a while some 97% sales when you run your Promo Announcements twice a month (you're doing this already, right?)</p><p>Now let's talk about where you are losing money in this equation.</p><p>When your prospective students starts browsing around on Udemy, looking for a new course, they also have their eye on discounts. Most aren't buying without one.</p><p>So what do they do?</p><p>&gt;&gt;New Tab&lt;&lt;...Google....Course Title + Author.......&gt;&gt;SEARCH&lt;&lt;</p><p>And what do you think shows up?</p><p>Your course?</p><p> Or someone else's?</p><p>If you don't have a website, it's not going to be your site.</p><p>So what happens?</p><p>They click on someone else's site, find a link to your course and go buy it using the site owner's affiliate link. </p><p>That affiliate link makes it so that our Mystery Site Owner gets 50% of the sale of <strong style=\"\">your course, </strong>Udemy gets a quarter and you get a quarter. </p><p>And what's more? </p><p>If that student buys a couple other courses you've taught, you're only getting a 25% cut of those courses also.</p><p>How does having your own website change that?</p><p>Well, to put it simply, you are going to get to turn a lot of those 25% sales into 97% sales....</p><p><strong style=\"\">Effectively </strong></p><p><strong style=\"\">Quadrupling </strong></p><p><strong style=\"\">Your</strong></p><p><strong style=\"\">Income.</strong></p><p>Sure, there's a bunch of other stuff in this course about building a Podcast, Youtube, Blog, etc, but that right there is more than enough reason to get started today.</p><p>Every day you wait on getting a website set up is another day you're missing out on those 97% sales.</p><p>Getting a website set up that is optimized for Udemy is the single most important thing most Udemy instructors can do to increase their sales immediately.</p><p>But let's say you're still reading. Because you're a long term thinker.</p><p>Well, there's more.</p><p>This website is also optimized for building your list. </p><p>Haven't started doing this yet?</p><p>Tsk. Tsk.</p><p>You gotta be building your list.</p><p>That's the first commandment of internet business. </p><p>And this website will get you up and running in no time flat.</p><p>Look, I know what it's like. </p><p>You're a teacher, and you probably don't enjoy all this marketing stuff.</p><p>That's why we made this website so that you literally don't have to write a single new word of copy (aka words on your website), all you have to do is copy and paste what you've already written for your Udemy profile.</p><p>Sure, you can add more later, but it's not necessary for you to start seeing results.</p><p>Last thing I'll say, is I had a hard time convincing Rob to create this course with me. Usually people pay him thousands of dollars to create a website, and most Udemy instructors can't afford that. </p><p>We went back and forth over a couple weeks and finally agreed on this simplified, Udemy-Optimized version that has just enough for the person who has never created a website before, and enough stretch to work for those of you who want to really build up an online teaching empire with a Podcast, YouTube channel, Blog, etc. </p><p>The most valuable part of this course is actually the discussion forum. You'll be able to ask Rob and I any and all questions you want. We'll be there with you every step of the way until you have your website up and running and helping you succeed on Udemy.</p><p>We look forward to seeing you in the course,</p><p>Timothy and Rob</p>", 
    "end_date": null, 
    "title": "Mastering Udemy Vol 1: Create a Website - Unofficial", 
    "price": "20.00", 
    "instructors": "Timothy Kenny, Rob Wilson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576610_2a99_3.jpg", 
    "course_url": "https://www.udemy.com/wordpress-website-to-increase-sales-for-udemy-instructors/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T14:49:25Z"
}