{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>Back in the day, the rule of thumb with video editing is that you will spend 1 hour to edit 1 minute, that's right, 60 seconds, worth of footage. That's for an interview, a film, a TV show, a documentary, etc.</p><p>Nowadays, it's more like 10-20 minutes of editing per minute of video.</p><p>In this course, you're going to learn how to change that. <strong>You're going to learn how to edit an entire course that is 3-4 hours long in less than 30 minutes.</strong></p><p><strong>I know that sounds crazy, but it's true. It's one of the most important parts of my (Timothy's) course creation system.</strong></p><p>You're also going to learn how to batch render videos so that you can literally edit an entire course in less than an hour, and then let it render all 20 or 30 lectures as individual videos while you sleep. </p><p>You wake up in the morning and all you need to do is rename the files and upload them to your course.</p><p>When I was first creating courses on Udemy, I was easily spending 10-20 hours editing each course. Now it's usually under an hour.</p><p>As a teacher, your focus should be on your content, not on your video setup or editing. This course works in tandem with our previous course on how to set up a DIY video studio and picks up right where the other one leaves off.</p><p>The single most important metric for Udemy instructors (unless you are doing paid marketing) is how many courses you have created. As long as you are teaching high quality content, creating more courses is the most direct path to success on Udemy.</p><p><strong>Knowing how to edit quickly and get your courses out the door will literally save you hundreds of hours over the next year.</strong></p><p>But enough about that...</p><p>You are also going to learn the process of ingesting your footage.</p><p>What does that mean?</p><p>It's an industry term for getting your footage onto your computer, getting it organized, labeled, backed up and ready to edit. </p><p>Organization is huge if you plan on being a successful Udemy instructor. Our systems are battle tested across the more than 60 courses Phil and I have published. </p><p>Not being organized is ok when you have a few courses, but it becomes unmanageable as you start to scale up or want to outsource.</p><p>But what if you want to spend more time editing, and really up your production value? </p><p>Phil will be teaching two sections on the Adobe suite, on Premiere Pro and After Effects.</p><p>Phil publishes some of the highest quality videos on Udemy, and he'll show you how he does his post production using the Adobe Suite pipeline.</p><p>We look forward to seeing you in the course, and we'll both be available to answer your questions in the discussion section.</p><p>Finally, if you are a Mac or PC person, don't worry, we have you covered. Phil is a Mac guy, I'm a PC guy. For the most part, there aren't any differences. But everything we talk about in this course works equally as well whether you are on a Mac or PC.</p><p>See you in the course,</p><p>Timothy and Phil</p>", 
    "end_date": null, 
    "title": "Mastering Udemy Vol 3: Video Editing Systems - Unofficial", 
    "price": "20.00", 
    "instructors": "Timothy Kenny, Phil Ebiner", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639582_15d8.jpg", 
    "course_url": "https://www.udemy.com/mastering-udemy-series-accelerated-video-editing-systems/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T19:32:42Z"
}