{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Want to create and run a <strong>world-class</strong> online Learning Management System? Want to learn <strong>Moodle Administration</strong> trusted by <strong>80 million users worldwide</strong>? Want a powerful skill on your resume? </p><p>Whatever your motivation to learn Moodle Administration, you've come to the right place. </p><p><em><strong>This course is the </strong><strong>FIRST</strong><strong>, most comprehensive, cost effective Moodle 3.0 Administration course on the entire web - or your money back.</strong></em>  </p><p><strong>COURSE UPDATE - JAN 26TH 2016</strong></p><ol><li><em>Two additional debug lessons added to Moodle installation section</em></li><li><em>RESOURCES section updated with new content</em></li></ol><p><br></p><p>Moodle\n is trusted by institutions and organizations large and small, including\n Shell, London School of Economics, State University of New York, \nMicrosoft and the Open University. </p><p>Moodle's worldwide numbers of \nmore than 65,000+ Institutions and 80 million users across both academic\n and enterprise level usage makes it the <em>world's most widely used learning platform.</em><br></p><p><strong>Master the World's Most Popular Learning Management System - MOODLE <em><strong></strong></em><strong>ADMINISTRATION</strong><em><strong></strong></em> in this Comprehensive Course.  </strong></p><ul><li>Learn the LATEST version - Moodle 3.0 - and stay miles AHEAD of the curve</li><li>Start from the very basics - this course makes no assumptions</li><li>Earn promotions with your new skills - Become indispensable in your institution </li><li>Learn how to install Moodle 3.0 on your Windows laptop - or just use \nMoodle's powerful and full fledged DEMO site for all of your learning \nand experimentation</li><li>LEARN TO LEVERAGE from thousands of FREE themes and plugins - learning activities, plagiarism, reporting, course formatting - and <em>a whole lot more</em></li></ul><p><br><strong></strong></p><p><strong>Learn MOODLE 3.0 ADMINISTRATION to create Powerful Learning Experiences for your Learners</strong></p><ul><li><em>Any Device, Any Where</em> - learn to create online classes that can be used on ANY device with a screen and learners can access from <em>Anywhere</em></li><em></em><li><em>High Engagement with Social Tools</em> - like the Discussion forum,  WIKI, blogs</li><li>Save\n Hundreds of hours and Thousands of dollars - with automated tools such \nas bulk upload for students, courses etc</li><li>INSTANTLY change the entire look and feel with top class themes</li><li>Support FLIP\n classes, BLENDED learning or PURE online!! Whatever the game may be.</li></ul><p><strong>What am I going to get from this course?</strong></p><ol><li>A step-by-step video tutorial starting from the absolute basics - all the way to advanced topics. </li><li>230 minutes of video lecture - over 45 separate lessons</li><li>Countless hours saved with Moodle's automation tools </li><li>Respect of your Peers, Educators, Students, School Administrators</li><li>A powerful and absolutely essential teaching tool that is indispensable in the future of education</li><li>A lifetime access to this course - and all future updates, enhancements</li><li>Very detailed instructions on how to \ninstall on a Windows computer (non-production usage)</li><li>Tips, \ntricks, pitfalls and other points distilled from a lot of experience - \nthese are distributed through out the course lessons</li></ol>", 
    "end_date": null, 
    "title": "Moodle Administration Tutorial: Beginner, Intermediate Guide", 
    "price": "25.00", 
    "instructors": "Srikanth Shirodkar", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692610_1985.jpg", 
    "course_url": "https://www.udemy.com/moodle-administration-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T04:14:31Z"
}