{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t  This course is designed to guide you from a complete beginner level to being an expert Moodle teacher. I cover both the technical and the teaching aspects, helping you not only to create a course easily, but to create it effectively, engaging your students in the best possible way. If you’re teaching with Moodle and need a little help with any aspect of it, then this course is for you.  </p>  <p>  \t  This course was created using Moodle 2.7 - but even the newest version of Moodle hasn't changed much so it's still applicable.</p>  <p>  \t  In this course we’ll start by looking at how Moodle works as a website, including how to most easily navigate around the system. This is, surprisingly, pretty difficult for many to get to grips with. Next, we’ll look at the structure of a Moodle course, including a section on busting much of the jargon that tends to confuse matters in the Moodle world. Finally, we’ll explore blocks and how they can be used to enhance a course, adding extra features to make yours and your students’ lives easier.  </p>  <p>  \t  Following introductions, we’ll get into the meat of the course, namely Resources and Activities. I’ll cover the full range of resources, including:  </p>  <ul>  \t<li>Labels, and how they can be used to signpost a course</li>  \t<li>Pages, and their main uses in Moodle</li>  \t<li>Books and how they can guide students through material</li>  \t<li>Files and URLs, and how both can add extra depth to a course</li>  </ul>  <p>  \t  Then, we’ll get into the most common activities in use on Moodle, particularly Assignments, Chats and Forums. These are the base elements of creating interactive learning on Moodle and can be used to enhance any online course.  </p>  <p>  \t  This course is a great introduction to teaching effectively in Moodle, but I’m certainly not finished yet. I’ll be expanding this course out to include every aspect of Moodle over the coming months, and I’d appreciate your help in doing so. By that, I just mean your suggestions on what to cover next! Moodle is a huge application, so let me know what elements you’re struggling with. Once you buy into the course, I’ll commit to answering your questions in the feedback comments and creating videos to cover those points.  </p>  <p>  \t  I’d love you to get involved now and help me create the best Moodle course on the web. As an incentive I’m currently selling the course at a pretty low price in order to try to source that feedback. If you buy in now and help me out, you’ll be able to access the material permanently in future, even after I complete the materials and raise the price. Thanks for your help!  </p>", 
    "end_date": null, 
    "title": "Moodle: From Novice Teacher to Expert Online Educator", 
    "price": 0, 
    "instructors": "Dr Colin Gray", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274770_bc14_3.jpg", 
    "course_url": "https://www.udemy.com/learn-moodle/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T21:34:05Z"
}