{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Looking to create a <strong class=\"redactor-inline-converted\">world-class</strong> online course? Want to learn a LMS that is trusted by 80+ million users worldwide? Want a powerful skill on your resume? </p>\n\n<p>Whatever your motivation to learn Moodle, you've come to the right place. </p>\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">This course is the </strong><strong class=\"redactor-inline-converted\">FIRST</strong><strong class=\"redactor-inline-converted\">, </strong>most comprehensive<strong class=\"redactor-inline-converted\"> and </strong></em><strong class=\"redactor-inline-converted\">cost effective</strong><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\"> Moodle 3.0 course on the entire web - or your money back.</strong></em>  </p>\n\n<p><strong class=\"redactor-inline-converted\">Course Update: 10th Apr, 2016</strong></p>\n\n<ol><li>6 new lessons to the course, new section titled <strong class=\"redactor-inline-converted\">\"BONUS: BEST PRACTICES for FULL MOODLE COURSE LIFECYCLE\"</strong></li><li>New section added on \"Roles and Permissions\" in Moodle</li><li>Two additional debug lessons added in the \"Installation\" section</li><li>Resources section new content added &amp; updated</li></ol>\n\n<p>Moodle is trusted by institutions and organizations large and small, including Shell, London School of Economics, State University of New York, Microsoft and the Open University. </p>\n\n<p>Moodle's worldwide numbers of more than 60,000+ Institutions and 80+ million users across both academic and enterprise level usage makes it the <em class=\"redactor-inline-converted\">world's most widely used learning platform.</em><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Master the World's Most Popular Learning Management System - MOODLE in this Comprehensive Course.  </strong></p>\n\n<ul><li>Learn the LATEST version - Moodle 3.0 - and stay miles AHEAD of the curve</li><li>Start from the very basics - this course makes no assumptions</li><li>Earn promotions with your new skills - Become indispensable in your institution </li><li>BONUS - learn how to install Moodle 3.0 on your Windows laptop - or just use Moodle's powerful and full fledged DEMO site for all of your learning and experimentation</li><li>Create HIGH LEARNER ENGAGEMENT - Practice Quizzes, Video Lessons, embed YouTube   videos, Glossaries, Assignments, Books, Surveys, Question Banks and <em class=\"redactor-inline-converted\">a whole lot more</em></li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Learn Moodle 3.0 to create Powerful Learning Experiences for your Learners</strong></p>\n\n<ul><li><em class=\"redactor-inline-converted\">Any Device, Any Where</em> - learn to create online classes that can be used on ANY device with a screen and learners can access from <em class=\"redactor-inline-converted\">Anywhere</em></li><li><em class=\"redactor-inline-converted\">High Engagement with Social Tools</em> - like the Discussion forum,  WIKI, blogs</li><li>Save Hundreds of hours and Thousands of dollars - with automated tools such as reusing the course structure, self evaluated quizzes, Gradebook, Video lectures etc</li><li>Leverage the power of sites like YouTube for how-tos, Wikipedia for articles - literally embed ANYTHING into your own course</li><li>FLIP classes!! Have students prepare for topics BEFORE they come into your physical classes. Create lectures ONCE - and have it reused millions of times</li><li>BLENDED learning - mix and merge online, offline learning to create very powerful blended classes</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">What am I going to get from this course?</strong></p>\n\n<ol><li>A step-by-step video tutorial starting from the absolute basics - all the way to advanced topics. </li><li>Video lectures, extensive resources, PDFs etc - over 44 separate lessons</li><li>Countess hours saved with Moodle's learning and teaching automation tools (like the Quiz and Grade Book)</li><li>Respect of peers, students, school administrators</li><li>A powerful and absolutely essential teaching tool that is indispensable in the future of education</li><li>A lifetime access to this course - and all future updates, enhancements</li><li>BONUS: Administration section including very detailed instructions on how to install on a Windows computer (non-production usage)</li><li>Tips, tricks, pitfalls and other points distilled from a lot of experience - these are distributed through out the course lessons</li></ol>", 
    "end_date": null, 
    "title": "Moodle 3.x Masterclass: Your Complete Guide to Moodle 3.0", 
    "price": "25.00", 
    "instructors": "Srikanth Shirodkar", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622824_a40b.jpg", 
    "course_url": "https://www.udemy.com/moodle-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-26T05:30:24Z"
}