{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Want to install the world's favorite Learning Management System Moodle - on your own laptop or desktop inexpensively - to learn, experiment and have some fun doing it?<br> </p><p>Have you been frustrated trying to install Apache, PHP, MySQL and Moodle - without the easy documentation - reduced to pulling out your hair and tears?<br></p><p>Whatever your motivation to install Moodle on Windows, you've come to the right place. </p><p><em><strong>This course will teach you to install Moodle on Windows - or your money back.</strong></em>  </p><p>UNTIL you learn how to do it - installing the full technology stack needed - i.e. Apache, PHP and MySQL - followed by Moodle can be a exercise in frustration, patience and endless sifting through lots of documentation, forums and error messages. <br></p><p>This course will save you countless hours trying to install all that is needed for Moodle. We will start right from the very beginning and go till the end. <br></p><p>What you learn in this course (Apache, PHP, MySQL) - you can then use to install hundreds of other popular Open Source projects like Wordpress, Drupal and Joomla - to just name 3. <br></p><strong>Install the Full Technology Stack needed for Moodle - and then reuse it as much as you like!<br></strong><ul><li>Start from the very basics - this course makes no assumptions</li><li>Learn new skills - Become indispensable in your institution </li><li>BONUS\n lessons - Essential beginner  Moodle admin lessons added</li></ul><br><p><strong>What am I going to get from this course?</strong></p><ol><li>A step-by-step video tutorial starting from the absolute basics - all the way to completion </li><li>Countess hours saved learning to install on your own - from hundreds of forums, often outdated instructions, unhelpful error messages. </li><li>Respect of your peers, students, school administrators - and everyone who will benefit from your learning.</li><li>Learning this tech stack opens the doors for installing fantastic open source projects for you - some of which include Wordpress, Drupal, Joomla. </li><li>A lifetime access to this course - and all future updates, enhancements</li><li>BONUS:\n Some simple Moodle Admin lessons included - more will be coming. </li><li>Tips, \ntricks, pitfalls and other points distilled from a lot of experience - \nthese are distributed through out the course lessons</li></ol>", 
    "end_date": null, 
    "title": "Moodle: Learn to Host on  any Windows Computer", 
    "price": "20.00", 
    "instructors": "Srikanth Shirodkar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649400_ef2d.jpg", 
    "course_url": "https://www.udemy.com/install-moodle-on-windows/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T06:02:51Z"
}