{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>Build the skills you need to confidently create your own online course using Moodle 3!  </p>\n\n<p>This introductory course will walk you step-by-step through the process of getting your course set up and ready to go using Moodle.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Create your own online course as you master the latest version of Moodle.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  <li>Navigate like a pro</li><li>Plan your course</li>  <li>Create the “Look and Feel” You’re Going For</li>  <li>Add Resources and Activities</li>  <li>Get familiar with the Gradebook </li> </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">A Powerful Tool at your Fingertips</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Moodle is currently the most widely used Learning Management System with over 70 million users in schools, universities, and businesses all around the world. Moodle is an open source learning management system that is free and easy to learn.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is perfect for anyone who wants to learn how to build a course using Moodle 3.  It will take you step-by-step through the course creation process. It could be instrumental in helping you to become the resident “Moodle Guru” at your place of employment, springboarding you into offering training to employees or courses to paying clients, or creating an online extension of your classroom where you can flip your class or share information, resources, and activities with your students.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Contents and Overview</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is set up in a way that you can view the content in relatively small pieces and then get into your own course and practice what you’ve just learned about.  If you do not currently have access to your own Moodle course, no need to worry!  There are several free options to choose from that will allow you to practice. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll begin getting comfortable with Moodle’s navigation and getting your course set up just how you want it by tweaking settings and adding different blocks.  Depending on the overall goals for your course, this can mean very different things for different people.  Moodle is a flexible tool that can allow you to do so many things to make your course your own.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll add resources and activities to your course.  I’ll introduce you to each one, talk about how you can use them in your course, and show you how to get them set up and ready to go!  By the time we’re done, you’ll be able to add content, embed videos, create quizzes and assignments and much more within your course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Together we’ll explore the gradebook and look at different ways you can set it up.  Moodle’s gradebook is a powerful functional tool that when utilized properly can save you a lot of time and energy.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I'll be with you every step of the way to answer questions and provide support.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p> Upon completion of this course, you will have the knowledge and confidence you need to create your own course in Moodle 3.</p>", 
    "end_date": null, 
    "title": "Moodle 3 Course Creation: The Basics", 
    "price": "20.00", 
    "instructors": "Laureen Ferry", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/771654_eb98_4.jpg", 
    "course_url": "https://www.udemy.com/moodle-3-course-creation-the-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-23T13:02:38Z"
}