{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><em>This Course is not sponsored by or affiliated with Udemy, Inc.<br></em></p><p><em>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></em></p><p><em>This is THE Course every Student and Instructor on Udemy must have!</em></p>\n\n<p>Are you a Student struggling to find the best course to solve your pain or problem?</p>\n\n<p>Are you an Instructor trying to create really engaging and competitive courses?</p>\n\n<p>How can you quickly and easily find the best Courses?</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p><strong><em>This Free Course is an Introduction to my Main Course which contains the full data set that I have compiled and which I will up date periodically.  This Course is designed to enable you to have a risk free opportunity to try out the amazing Visokio Omniscope Viewer and all it is capable of.</em></strong></p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>The main drawback with traditional search methods is that the results are dependant on and skewed by:</p>\n\n<ul><li>Search Algorithms</li><li>Search Engine Optimisation variations between courses</li><li>And FUNDAMENTALLY - Knowing what to search for!</li></ul>\n\n<p>How can you in put a search term if you do not know exactly what you are looking for????</p>\n\n<p>There has to be a better way!</p>\n\n<p>There is - that is exactly why I created this course, probably the most difficult course I have made to date!</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><strong>The KEY is the VISOKIO OMNISCOPE which you can download for free as I have created all the data files in the right format for you to analyse and research.</strong></p>\n\n<p>I have identified over 18,000 courses in the Main Course which I provide for your analysis. This is not a complete list, as I have not hacked the Udemy site, but is a strong representation of the courses available</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p>Now you can look at the whole Udemy Market Place on one page and drill down to find what you are looking for! Its not difficult</p>\n\n<p><strong>In this Course you will discover:</strong></p>\n\n<ul><li><em>Why Holistic Search beats more traditional approaches</em></li><li><em>The dangers of unconscious incompetence</em></li><li><em>How Students can benefit from the course</em></li><li><em>How Instructors can benefit from the course</em></li><li><em>What Data is included in the Data Set</em></li><li><em>How to download the Visokio Viewer from Visokio's website</em></li><li><em>How to open it and load the data file</em></li><li><em>A full tutorial on the Omniscope Viewer (complements of Visokio themselves)</em></li><li><em>How to search in the Omniscope Viewer</em></li><li><em>How to explore Udemy Categories</em></li><li><em>The Top 100 Udemy Instructors, by various criteria</em></li><li><em>The Top 100 Udemy Courses, by various criteria</em></li></ul>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><strong>What Jerry Banfield, Leading Udemy Instructor has to say about the Main Course!</strong></p>\n\n<p><strong>\"Very effective for learning more about Udemy in just a few minutes</strong></p>\n\n<p><em>If you want to learn more about the Udemy marketplace and love data visualizations, you might have the same experience I did here. I figured I could give this course at least 15 minutes today to skim through and see what John came up with. In just 15 minutes I learned a lot about Udemy I did not know such as what courses are the top and I discovered a lot of instructors I had never heard of that have top courses on Udemy. In just a few minutes this course was helpful for me in motivating me to continue working on Udemy and learning more about what works to get students and grow here. Thank you John! There is a TON of depth here in the course if you go through and download the program and data sets on John offers. I may give this a shot when I am done filming my lectures!\"</em>  5 Stars</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p>This course is very hands on! I show you how to use the Omniscope - an amazing piece of data visualisation software - and provide you with the data files so that you can do your own analysis!</p>\n\n<p><em><strong>The VISOKIO OMNISCOPE is the Differentiator</strong></em></p>\n\n<p>You will not find another course like this anywhere in Udemy!</p>\n\n<ul><li>How are you going to use this information?</li><li>To improve your course selection?</li><li>To find new courses, topics and instructors?</li><li>Or perhaps you are an instructor, looking for new Topic areas to create courses in!</li></ul>\n\n<p><strong>Information is Power - I have handed you the information - use it wisely!</strong></p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><em>Disclaimer: The Data Set in this Course is limited to a sample set based on the courses which were listed in the Udemy Market Place in October 2014.  I have endeavoured to provide a useful data set but it is far from complete.  For the full data set please check out the Bonus Lecture for an inexpensive upgrade offer.</em></p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p>So, what are you waiting for!</p>\n\n<p><strong>Discover Courses and Instructors in a way you never have before! Enrol Today!</strong></p>\n\n<p><strong>See you in the Course!<br></strong></p>\n\n<p><strong>best regards</strong></p>\n\n<p><strong>John</strong></p>", 
    "end_date": null, 
    "title": "My Unofficial Directory of Udemy Courses (Lite Version)", 
    "price": 0, 
    "instructors": "John Colley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/681364_e657.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-directory-lite/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-26T08:37:10Z"
}