{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<ul style=\"\">  \t<li style=\"\">This course is for new or first year teachers who are getting ready to plan for a new year. Every teacher has a horror story about their first year of teaching.  Many veteran teachers and new teachers alike believe this is part of some horrible initiation that every new teacher has to go through.  This course is for those new teachers who don&#039;t want to have a horror story.  Participants will learn lesson planning, classroom management and relationship strategies that are key to getting off to a good start and will improve their chances of having a successful year.  Participants will learn step by step instructions for creating lessons that will engage students. You will be able to access a lesson planning template with guiding questions to help you develop your lessons using the ideas of backwards design (Understanding by Design).  You will prioritize the most important classroom management routines and procedures to focus on during the first month and learn how to effectively implement those routines and procedures. You will learn which relationships to harness in the first month in order to get off to the best start possible.  Finally, you will learn how to plan an amazing first day.  In addition to the lesson planning template, you will have access to a lecture and lesson planning template specifically organized for planning group work, one of the main pitfalls for new teachers.  Participants will receive twenty-three lectures divided up into four sections: lesson planning, classroom management, relationships and planning the first day.  There is an introduction and conclusion for each section with a total of 30 minutes of video lectures that provide steps and tasks to complete.  If the process is followed, you will leave the course with a solid plan for the first month of school that will ensure a smooth year.</li>  </ul>", 
    "end_date": null, 
    "title": "New teacher's guide to the first month of school", 
    "price": "20.00", 
    "instructors": "Gabrielle Marquette M.Ed.", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244430_6548_3.jpg", 
    "course_url": "https://www.udemy.com/new-teachers-guide-1st-month/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T20:41:21Z"
}