{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t                        Create excitement, motivate adult learners, keep them interested and maximize online learning and retention. This 8 hour online training program dives deeply into the strategies, techniques and tools you need to lead effective online training sessions.  You&#039;ll learn how to create excitement, motivate adult learners, keep them interested, maximize learning, and make them feel as though you are right in the same room with them.  </p>  <p>  \t                *Bonus: Includes a 130-page workbook to read and follow along with the course.  </p>  <p>  \t<strong style=\"\">Why should you take this course?</strong>  </p>  <p>  \t                        There was a time when Jason Teteak made the shift to training not just in person, but online as well. This program will help you take your virtual training to another level. You&#039;re going to learn not only how to more easily do it yourself, but how to be more genuine and even start to have your students teach each other for you! Even if you don&#039;t have any virtual classes yet at this point, you won&#039;t want to miss this for when you do.  </p>  <p>  \t                        You may have seen other “gurus&quot; teach you how to train virtually. Chances are, they gave you their language and you may even use it verbatim. There is a 75% chance that they didn&#039;t give you the right language for your learning style. Most gurus don&#039;t explain why it works, they just explain that it does. If you&#039;re going to teach your own topics and concepts, you need to understand why it works.  </p>  <p>  \t                        The reason we are so excited to have you see Jason dive in on some of this is that through the process of being taught by him, you will find new pieces of gold that are within you that you didn&#039;t even know were there and they will help you become a better trainer virtually.  </p>  <p>  \t                        Lastly, there are very few virtual trainers that have their students train classes with hem . . . we do. We&#039;re going to prove it in this program with real case studies that will give you some amazing ideas for your own virtual training.  </p>  <p>  \t                        As a collective team, we have come up with some amazing things. The techniques in this program will help you experience more fun and freedom with your virtual training. They will help you boost your student success rate with your training. It is exciting to see what will be uncovered. One of these four learning styles will be right up your alley, and the others will offer good insight and complement the things you&#039;re already doing so you can reach others as you teach.  </p>  <p>  \t<strong style=\"\">Why Rule the Room?</strong>  </p>  <p>  \t                        Adult learning is fundamentally important to everything we do so we&#039;ve spent a lot of time perfecting the various ways to do it.  Our programs are unique and practical because we model every technique we suggest so you can see exactly how it&#039;s done as you learn.  This program is no exception.  If you want to know how to remove the distance barrier from adult learning you&#039;ve found the program you&#039;re looking for.  </p>  <p>  \t                        There are three key reasons why Rule the Room is different:  </p>  <ol style=\"\">  \t<li><strong style=\"\">You&#039;ll      learn WHY it works. </strong>We don&#039;t just show you how to do it or      what to do. We tell you WHY it works so you can learn to “fish&quot; on your      own.</li>  \t<li><strong style=\"\">You&#039;ll      learn in YOUR unique learning style. </strong>We all communicate differently.      That&#039;s why every lesson is taught with four unique learning styles (step,      research, talk and create).  You&#039;ll      also learn how to teach in those four styles when you teach your virtual      classes.</li>  \t<li><strong style=\"\">You&#039;ll      be able to APPLY practical techniques right away. </strong>This      training actually makes sense. World-renowned trainer, Jason Teteak, is      able to decode the magic that happens when top virtual trainers are      meeting with their students online. He then bottles up the secret sauce      and presents it to you so you can easily understand how to use it in your      own style and apply it to any situation.</li>  </ol>  <p>  \t                    After interviewing literally hundreds of trainers and instructors, we discovered the top ninety-one things they worry about when it comes to training classes online. Ask yourself, have you ever had any of concerns about doing the following things in a virtual training environment?  </p>  <ul style=\"\">  \t<li>How to gain audience&#039;s attention quickly; capture their &#039;buy in&#039; ….let go of the old software; comfort their fears; overcome their resistance…?</li>  \t<li>How to “sell&quot; it so our end users will be receptive to the training?</li>  \t<li>How to create initial excitement about the topic?</li>  \t<li>How can you connect immediately with your audience virtual?</li>  \t<li>How to gain initial rapport?</li>  \t<li>How do breaks work? Should I offer them more often?</li>  \t<li>Use pictures of people&#039;s faces to trainee introductions during welcome.</li>  \t<li>How to create a personal connection?</li>  \t<li>How to have trainees visually interested in something that I&#039;m teaching remotely?</li>  \t<li>How to keep slides engaging while still including your main points?</li>  \t<li>How do you keep their attention virtually for 4-8 hours of class?</li>  \t<li>What are some ideas for keeping the energy level up?</li>  \t<li>How to stay high energy without people in the room?</li>  \t<li>How to keep my voice on the fine line between annoyingly enthusiastic and boring?</li>  \t<li>How to speak (loud/soft/tone/inflection)?</li>  \t<li>How to encourage conversation during and after class?</li>  \t<li>How do you still make it interactive?</li>  \t<li>How to utilize the chat to garner participation from participants who don&#039;t want to talk out loud?</li>  \t<li>How to incorporate exercises so that it does not just become a demonstration?</li>  \t<li>How to engage all trainees in the class, when learning needs and styles are so different?</li>  \t<li>How to ask questions and get answers.</li>  \t<li>How can I ensure trainees are following along?</li>  \t<li>If we can&#039;t watch trainees&#039; facial expressions or see their screens if we&#039;re roaming in the back of a class, what are some ways other than asking to check that we&#039;re on the same page?</li>  \t<li>How to have trainees visually interested in something that I&#039;m teaching remotely?</li>  \t<li>How best to simulate the training environment for the learners?</li>  \t<li>How to mute the audience effectively?</li>  \t<li>How to set an appropriate pace?</li>  \t<li>How can the trainer pick up on the cues of when to slow down, speed up, repeat, etc…?</li>  \t<li>How can you get buy-in from 50 people spread throughout the country to go slower or faster than they would like?</li>  \t<li>Providing avenues for active feedback (e.g. polls, questions, guided demos).</li>  \t<li>If I normally write something on a white board, can I still do that?  What about for sticky notes?</li>  \t<li>How to use visual aids effectively</li>  \t<li>How do you get trainees to write things down?</li>  \t<li>What are some verbal and other strategies for eliciting feedback? Too slow/too fast?</li>  \t<li>How to check for retention?</li>  \t<li>How to check for understanding?</li>  \t<li>Best practices for benchmarking the audience.</li>  \t<li>How to validate that they are “getting it&quot; since you can&#039;t look at their faces/ read their body language.</li>  \t<li>How to continually ensure they are, absorbing, and not just going through the on-line motions?</li>  \t<li>How to track students and how to make sure and confirm they are getting the material and are practicing when they need to be?</li>  \t<li>Techniques for assessing comprehension/pace on the fly.</li>  \t<li>How to read trainees?</li>  \t<li>Providing trainees with activities that they can do alongside the course that presents you with feedback of their progress</li>  \t<li>How is hands-on support managed if someone is struggling?</li>  \t<li>How to assist struggling learners?</li>  \t<li>How to use a moderator and a facilitator for the sessions?</li>  \t<li>How to offer assistance to someone/steer them in the right direction without calling it out in front of everyone?</li>  \t<li>How to maintain excitement about the topic?</li>  \t<li>How can you continue connect with your audience when you can&#039;t physically interact with them?</li>  \t<li>How to maintain rapport?</li>  \t<li>How to manage breaks throughout the day?</li>  \t<li>How to continue to grow a good relationship with trainees?</li>  \t<li>How to keep class from feeling impersonal?</li>  \t<li>How to stay high energy without people in the room?</li>  \t<li>How can a person who feeds off fun tell jokes and know if they are working?</li>  \t<li>Help someone who is struggling with an exercise</li>  \t<li>How to discreetly offer assistance to someone/steer them in the right direction without calling it out in front of everyone?</li>  \t<li>How to provide more one-on-one like help when you don&#039;t want to interrupt everyone else.</li>  \t<li>How can you monitor/support while doing independent exercises?</li>  \t<li>How is hands-on support managed if someone is struggling?</li>  \t<li>How to incorporate exercises so that it does not just become a demonstration?</li>  \t<li>Ability to track students and how to make sure and confirm they are getting the material and are practicing when they need to be?</li>  \t<li>What ideas do you have for coordinating activities remotely and doing benchmark checks with your group?</li>  \t<li>Keeping the class on-task during activities.</li>  \t<li>How to collect and respond to questions in a timely manner?</li>  \t<li>How to get them to interact (ask/answer questions)?</li>  \t<li>How to encourage questions and conversation during and after class?</li>  \t<li>How to keep the class on-task?</li>  \t<li>How to answer questions?</li>  \t<li>How to manage audience questions?</li>  \t<li>How to field questions when they can come in in different formats?</li>  \t<li>How to coordinate questions from attendees?</li>  \t<li>How to utilize a moderator and a facilitator for the sessions to manage the chat?</li>  \t<li>How to make trainees feel comfortable enough to ask questions?</li>  \t<li>How to dealing with technical difficulties?</li>  \t<li>How to trouble shoot end-users logging in or delays in starting the session?</li>  \t<li>How to manage technical issues related to delivering the class while also staying focused on the material and teaching?</li>  \t<li>What sort of tech juggling is required—i.e., how many machines does one have to be running, monitoring, using at once, and what&#039;s the best way to handle that?</li>  \t<li>How to do all of the setup/logistics?</li>  \t<li>Room set-up: What&#039;s the best camera position?  Should I sit/stand?</li>  \t<li>What is a manageable amount of participants to have in a virtual class?</li>  \t<li>Where we do it?</li>  \t<li>How to ensure that all class members have appropriate workstations set up for the class (correct versions of internet explorer, fast enough processing speed, etc.)?</li>  \t<li>How many people are on your end?</li>  \t<li>What are the hardware/software requirements to access training remotely?</li>  \t<li>Setting up the technical requirements.</li>  \t<li>How would we be providing trainees access to environments?</li>  \t<li>What would be the audio solution, just calling into the conference line over a speaker phone</li>  \t<li>What would the video solution be?  Would there be a video feed so that trainees could see the trainer / whiteboard, etc.?</li>  \t<li>A rule of thumb for how long it should take to prepare. (For example, we say 40 hrs. for a 15 min lesson)?</li>  \t<li>Steps to take when preparing for a virtual class.</li>  </ul>  <p>  \t                    We&#039;ll address how to handle each of these twenty seven concerns and more in this program. You&#039;ll learn how to open well, teach an engaging lesson, ensure they got it, maintain credibility and rapport, facilitate an activity, handle questions, manage technical issues, and close well so that your students learn from you just as well in a virtual environment as they would in person.  </p>  <p>  \t                    Most gurus just say, “Here&#039;s the gold dust,&quot; and then people don&#039;t know what to do with it, or it simply doesn&#039;t work. The point is that they don&#039;t give the precursors as to <em style=\"\">why </em>it works. In this program, we will break down each and every technique to make it simple and easy and tell you <em style=\"\">why </em>it works so that you can apply it to new situations day after day in your training, such as how to get your students to model concepts <em style=\"\">for </em>you.  </p>  <p>  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p>  \t                      “The virtual class I took was a phenomenal opportunity to add effective tools to my training when running a webcast. The information provided about keeping an audience engaged, excited, and motivated in a virtual class was top notch because of its immediate impact in training. Thanks for your help!&quot;  </p>  <p>  \t<em style=\"\">John Frutiger, </em><em style=\"\">Software Trainer</em>  </p>  <p>  \t                      “Jason&#039;s advice is practical, straightforward, and incredibly helpful for anyone looking to greatly improve his or her presentation skills.&quot;  </p>  <p>  \t<em style=\"\">Ryan Anderson, </em><em style=\"\">Director of Instructional Design &amp; Development, </em><em style=\"\">UW Extension - CE, Outreach &amp; E-learning</em>  </p>  <p>  \t                      “These courses on how to create and deliver effective webcasts have fundamentally improved the quality of my webcasts. They teach specific techniques and principles that are easy to put into practice. I considered myself an expert webcaster and I frequently delivered webcasts to hundreds of attendees, but by following the techniques I learned, my audiences are more engaged than ever before and often take immediate actions based on my webcasts. Furthermore, I&#039;ve seen novices with little or no webcasting experience deliver engaging, smooth, professional webcasts after being trained and following the specific techniques that are taught.&quot;  </p>  <p>  \t<em style=\"\">Joe McGuire, </em><em style=\"\">HealthCare Business Intelligence</em>  </p>", 
    "end_date": null, 
    "title": "Online Train the Trainer Pro: No Beginners Allowed!", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312934_6842_8.jpg", 
    "course_url": "https://www.udemy.com/virtual-training-effective-methods-for-online-training/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T16:03:31Z"
}