{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">This course covers software tips, business strategies and marketing techniques to help online teachers boost their income and cut out the most common wastes of time and money.</p><p style=\"\"><strong style=\"\">Deliver amazing online lessons to paying students around the world</strong></p><p style=\"\">In this course, I am going to show you:</p><ul style=\"\"><li>How to<strong style=\"\"> deliver outstanding 1-to-1 online lessons </strong> with the perfect materials, no matter if you find them online or offline</li><li>Exactly <strong style=\"\">how to find the right tools for free</strong> so you spend as much time as possible teaching and getting paid</li><li>A <strong style=\"\">system</strong> <strong style=\"\">for recruiting new customers</strong> so you will never have complaints, hassle and frustrations with students again (yes, contracts!!)</li></ul><p style=\"\">Online training is one of the fastest growing and most fascinating industries in the 21st century economy. From CEOs to five-year-olds, the world is catching on to online lessons and you have the chance to break free and become a teacher on the cutting edge of technology.<br style=\"\"></p><ol style=\"\"><li>You will be able to <strong style=\"\">work from anywhere</strong></li><li>You&#039;ll get to make <strong style=\"\">meaningful connections</strong> with students around the world</li><li>You&#039;ll get to <strong style=\"\">teach your favourite topics</strong> whenever you want</li><li>You&#039;ll work independently: <strong style=\"\"> No boss, no set hours, no earning limit</strong></li></ol><p style=\"\">You don&#039;t want to waste 50% of your earnings by giving them to a tutoring agency. You don&#039;t want to be told how and what to teach. In this course, I will take you through my tried-and-tested processes to help you build a business that works for you. </p><p style=\"\">Start by discovering key tools and how online teachers can use them: <strong style=\"\">Skype, Evernote, Google Docs and many more are FREE and at your fingertips</strong>. I will discuss my own set-up to help you build your teaching system without a penny of investment.<br style=\"\"></p><p style=\"\">In the next section, you&#039;ll discover <strong style=\"\">how to stand out as a professional teacher and eliminate cheapskate or timewasting students. </strong>Learn how to write terms and conditions that help students be happy, not angry. And discover my 5 Step Booking Process so your students will always turn up and pay you.</p><p style=\"\">Finally, the <strong style=\"\">Marketing Section </strong>of this course will give invaluable tips on how to set your prices, how to promote yourself and what an online teacher&#039;s brand really means.</p><p style=\"\">Here&#039;s what my real students say:</p><p style=\"\"><strong style=\"\"><em style=\"\">I am extremely pleased with Kerstin as a tutor. We use FaceTime and Google Docs (and occasionally Skype when FaceTime is uncooperative) to communicate between Lancaster, England, and Houston, Texas. I am learning and making progress and I am excited about it!</em></strong></p><p style=\"\">If you would also love testimonials like this one, then don&#039;t hesitate and discover my Online Teaching Tricks today. </p><p style=\"\">I promise you will become more productive, more confident and <strong style=\"\"> more profitable </strong> in just a few days -- or your money back!<br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Online Teaching Live Lesson Strategies For Teachers & Tutors", 
    "price": "30.00", 
    "instructors": "Kerstin Hammes Cable", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455612_fb07_3.jpg", 
    "course_url": "https://www.udemy.com/online-teaching-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T10:56:31Z"
}