{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p style=\"\"><strong style=\"\"><em style=\"\">Note: Price of the course will go up from $49 to $249 when more lectures are added, so join now and get the benefit</em></strong></p><p style=\"\"><strong style=\"\"><em style=\"\">Additional Lectures will be added very soon.</em></strong></p><p style=\"\">This course is for those who are looking for promote their course, and want to know how to increase their sales. If you've taken the time and effort to publish your Udemy course and did everything you were supposed to - but you're disappointed because the sales are just not rolling in then this course is for you.</p><p style=\"\">This course will walk you through each step and show you exactly how to turn your Udemy courses into more profit and how to engage students. You will learn how to promote your course on social network sites like youtube, facebook, twitter and many more.</p><p style=\"\">In this course you will learn how to promote your course using different techniques and also increase your course SEO (search engine optimization) and I will show you different promotion techniques that most successful instructors on Udemy are using so that you can start making more money on Udemy with your courses.</p><p style=\"\">This course teaches you all the tricks and tips to increase your udemy course sales.</p>", 
    "end_date": null, 
    "title": "Online course marketing tips and tricks", 
    "price": "25.00", 
    "instructors": "DoEdu IT Educations", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448178_0709_2.jpg", 
    "course_url": "https://www.udemy.com/online-course-marketing-tips-and-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T00:00:12Z"
}