{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p style=\"\">What makes the difference between minor and massive profits on Udemy?</p><p style=\"\">Whether you're an accomplished instructor or a newbie, you probably want to create an awesome course and generate longterm sales. </p><p style=\"\">One of the biggest success factors is the consistent creation of high-quality courses.  This takes a lot of time and energy.  Plus, you have to market and optimize your content over time, all while engaging with your students.  </p><p style=\"\"><strong style=\"\">What if you could completely transform your workflow by offloading the most time consuming and tedious Udemy-related tasks?  </strong></p><p style=\"\">What if you could multiply your work and exponentially increase your enrollments and sales? </p><p style=\"\">What if accomplishing this feat was completely affordable and tailored to your budget? </p><p style=\"\">In this course, you'll get access to <strong style=\"\">18+ step-by-step video instructions </strong>for outsourcing high-value Udemy tasks with the help low-cost virtual assistants and other freelancers.  </p><p style=\"\">By the end, you'll know how to do the following: </p><ul style=\"\"><li style=\"\">Outsource 18+ Udemy-related tasks</li><li style=\"\">Automate course marketing and engagement</li><li style=\"\">Increase creation efficiency </li><li style=\"\">Improve course quality </li><li style=\"\">Cut out annoying tasks</li><li style=\"\">Learn hiring and delegation skills using Upwork</li><li style=\"\"><strong style=\"\">Increase profits, audience, and overall impact</strong></li></ul><p style=\"\"><br style=\"\">I'm Dan Englander and I'll be your instructor. I've successfully managed outsourced freelancers in all sorts of different situations, from B2B lead generation, to book marketing, and most importantly right here on Udemy.<br style=\"\"></p><p style=\"\">You're an ideal student if you want to improve your Udemy results and save time. If you're new to Udemy and/or outsourcing, you'll learn the basics.  If you're advanced, you'll benefit from a ton of specific strategies and hacks. </p><p style=\"\">Taking a few hours on this course could mean the difference between hundreds of hours of misspent time and thousands of dollars in long term profits. <br style=\"\"><br style=\"\">As a reminder, this course comes with a 30-day, no questions asked, money-back guarantee.  I hope to see you inside! </p><p style=\"\">Cheers,</p><p style=\"\">Dan</p><p style=\"\"><br style=\"\"> </p>", 
    "end_date": null, 
    "title": "Outsourcing Udemy: Automate Course Creation - Unofficial", 
    "price": "25.00", 
    "instructors": "Dan Englander", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587558_f1cf_3.jpg", 
    "course_url": "https://www.udemy.com/unofficial-outsourcing-udemy-automate-course-creation/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T17:06:53Z"
}