{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>You may have thought about doing green screen, or wanted to use it in making your course. However, it can be a frustrating experience if you don't know what to do, or know what target you are aiming to hit. </p><p>After I learned the secrets of doing green screen professionally, and with consistent and repeatable results, for many videos and courses, I decided to share with you all the secrets I've learned, and break it down in a way, that anyone can understand. <br></p><p>In this comprehensive course I walk you though the equipment you need, how to set it up, how to get the results, and then I take you behind the scenes so you see exactly what I did. I even take you with me, while editing the promo video, and other lessons in this course. </p><p>You will learn and see everything that goes into it. Whether you have seasoned experience and want to add green screen to your toolbox, or you have never shot video, and don't know what to buy, I cover the basis. I even have a discount to a final cut primer course, that I offer you after you enroll in this course to beef up your final cut skills. </p><p>I want you to be successful, but not just that, I want you to be able to approach green screen, and the technique with ease. I want you to be comfortable, feeling that you will soon be able to attain all the results that I show you for your own work, and projects. I want you to be equipped with all the knowledge that I have, so you can be successful. </p><p>I have designed this course, so that you can be more efficient, more productive, and take green screen from an overwhelming task, to a routine in your workflow. </p><p>I've spent a long time, finding out just how to get the green screen technique and process down to a science, one that is quick and easy to repeat. Once you take this course, you will walk away with that knowledge, and it will empower you to do it on your own. </p><p>In this course, I also cover multiple angles, and multiple cameras, and show you some advanced techniques. I want everyone to get something out of this course. </p><p>In addition to that, I also covering editing multiple camera angles, and suggest ways to improve and become more efficient in your usage of such techniques. </p><p>After this course you should be able to hit the ground running, producing and directing with the green screen technique. I can tell you it is a lot easier to be able to learn something, when you can see the whole process, from start to finish. When you can see what the goal is, what you are aiming to accomplish, it is much easier to repeat something, when you have a clear idea of what it is you are supposed to repeat. That is my desire in this course, to instill in you the knowledge that I have, so you have that clear idea, and you understand from start to finish what I am doing, and then you can achieve professional results as well. </p>", 
    "end_date": null, 
    "title": "Professional Green Screen Technique", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/583334_e248_2.jpg", 
    "course_url": "https://www.udemy.com/professional-green-screen-technique/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T20:17:17Z"
}