{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><u>This course is not sponsored by or affiliated with Udemy .Inc</u></p><p><em class=\"redactor-inline-converted\">------------------------------------------------------------------------------------</em></p>\n\n<p><em class=\"redactor-inline-converted\">✔  Brand New: Released 8/03/15 </em><em class=\"redactor-inline-converted\">(30 days Money Back Guarantee)</em></p>\n\n<p><em class=\"redactor-inline-converted\">------------------------------------------------------------------------------------</em></p>\n\n<p><em class=\"redactor-inline-converted\">The “Online Course\" Industry is estimated to be worth $56.2 Billion In 2014. How much of its share are you earning? BUILD and PUBLISH a Udemy course in 5 hours or less. Start a stream of passive income. Change millions of lives worldwide.</em></p>\n\n<p>Why do most 'wannabe' Udemy Instructor procrastinate to build their first Udemy course? Even I kept procrastinating for more than 4 months. Finally, I found the answer. <strong>This course is a result of that Answer.</strong><br></p>\n\n<p><strong>You will be able to BUILD and PUBLISH a Udemy course in 5 hours or less with my proven techniques.</strong></p>\n\n<p>After taking this course, I bet you will develop an urge to build your own course in 5 hours or less.It will be a record in itself. Or let's say, you will break all other records.</p>\n\n<p>This course is an actionable approach to building your course step-by-step as a beginner. I cover the psychology to beat procrastination and a lot of tips and hacks to quickly build the right mindset, trick your mind to, plan, prepare and execute your ideas into reality.</p>\n\n<p>✔ LEARN HOW TO TRICK YOUR BRAIN</p>\n\n<p>✔ LEARN HOW TO PLAN RIGHT</p>\n\n<p>✔ LEARN HOW TO PREPARE FOR YOUR COURSE</p>\n\n<p>✔ LEARN HOW TO EXECUTE WITHIN 5 HOURS</p>\n\n<p><strong>How is this course structured?</strong><br></p>\n\n<p>I have taken a whole new approach to make this course more interactive. You will find<strong> Video Lectures, Audio Lectures, Visual Workbooks, Quizzes to Weekly Q&amp;A sessions.</strong></p>\n\n<p>There is also a Final Test. <strong>Anybody who scores a perfect 100% is going to win some SURPRISE GIFTS along the way. </strong></p>\n\n<p>It's really exciting once you get started with this course. I am waiting to see you on the inside....</p>\n\n<p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Publish a Udemy Course in 5 Hours or Less - Unofficial", 
    "price": 0, 
    "instructors": "Harshajyoti Das", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430640_c193_6.jpg", 
    "course_url": "https://www.udemy.com/create-an-udemy-course-in-5-hours/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T05:10:56Z"
}