{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t  Are you an educator looking to create additional resources for your students? Do you want to create original video content, but you&#039;re just not sure where to start? Perhaps you want to create supplement materials to augment a live class? If you answered &#039;yes&#039; to any of these questions then this course is for you. <span style=\"\">I&#039;ve produced original content for several years under the Alanis Business Academy brand. From experience I can tell you just how time-consuming and frustrating creating original video content can be. Save yourself time, money, and frustration by learning the process that I use to produce original videos and begin your journey as a content creator.</span>  </p>  <p>  \t<strong style=\"\">What is the course about? <br style=\"\">  \t</strong><em style=\"\">Ready, Set, Record: Creating Video Content for the Classroom </em><span style=\"\">is a step-by-step comprehensive guide to tackling the process of creating original video content. Producing original video content can be an overwhelming and time-consuming process, but it doesn&#039;t have to be. This course will give you the skills to produce your own professional videos without the headache of learning by trial-and-error.</span>  </p>  <p>  \t<span style=\"\"><strong style=\"\">What kind of materials are included?</strong><br style=\"\">  \tThis course includes</span><span style=\"\"> 8 easy-to-follow lessons spanning over 120 minutes of instruction as well as a 59-page e-book that provides simple step-by-step instructions to performing many of the common functions using Screenflow. To test your knowledge you&#039;ll also have the opportunity to attempt six different quizzes covering a variety of content presented in this course. </span>  </p>  <p>  \t<span style=\"\"><strong style=\"\">How long will the course take to complete?<br style=\"\">  \t</strong>Although this course can be consumed in one sitting, it&#039;s recommended that you following along with the video creation process by crafting your own video. Doing so will help you get the full value out of the course. Although this will slow the speed at which you progress through the course, you&#039;ll be much more competent by the end. Following this recommendation will allow you to complete this course and produce your first video in 7 - 10 days. </span>  </p>  <p>  \t<span style=\"\"><strong style=\"\">Why take this course?<br style=\"\">  \t</strong>You should enroll in this course if you wan to improve the instruction of your physical, online, or hybrid course using original video content. Save yourself time and money by following my exact process for producing short and engaging videos. <br style=\"\">  \t<strong style=\"\"></strong></span>  </p>  <p>  </p>", 
    "end_date": null, 
    "title": "Ready, Set, Record: Creating Video Content for the Classroom", 
    "price": "20.00", 
    "instructors": "Matthew Alanis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415608_58d5_4.jpg", 
    "course_url": "https://www.udemy.com/tutorialvideos/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T05:49:07Z"
}