{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<div style=\"\">  \t<p>  \t\t This course is a framework for developing the characteristics of exceptional teaching, through focusing on one thing at a time, using a customised version of the 13x4 for education, the 9x4.  \t</p>  \t<p>  \t\t It&#039;s part of Tom Cassidy&#039;s Reason-Ability series.  \t</p>  \t<p>  \t\t Meta studies of the characteristics of exceptional teaching point to a number of key qualities that these teachers possess. My own research on the impact of teaching on student outcomes, from 2005-2012 using the 4Matrix system, supports these findings and I have now extended these conclusions into an actionable framework.  \t</p>  \t<p>  \t\t 2. How does it work?  \t</p>  \t<p>  \t\t There are 9 broad characteristics of exceptional teaching, each representing either something teachers believe or something they do. In order to develop these characteristics, you concentrate on just one aspect at a time, on a weekly basis until you have covered all 9. This takes 9 weeks. At that point, you repeat the cycle and continue to repeat it until you have completed the cycle 4 times. This takes 36 weeks which corresponds with the length of the academic year, hence The 9x4.  \t</p>  </div>  <p>  \t The idea of ‘One thing at a time’ as a developmental tool is not new. It was first turned into a system by Benjamin Franklin who used it to master the skills he required to develop his character. It has often been referred to as the Franklin 13, or Franklin’s Thirteen virtues, since he was working on the full 52 weeks in a year and 13x4 = 52.  </p>", 
    "end_date": null, 
    "title": "Reasonable Teaching: The 13x4 to Master The Art of Teaching", 
    "price": 0, 
    "instructors": "Tom Cassidy, Bryan Sykes, Mark Rogers, Sam Brown, Bill Aronson", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189044_7f15_4.jpg", 
    "course_url": "https://www.udemy.com/reasonable-teaching-the-13x4-to-master-the-art-of-teaching/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-26T11:31:49Z"
}