{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<ul>  \t<p>  \t\t                         <strong><strong>**This course is completely updated and tailored to help you achieve great results in 2016! Let's make this year a great one guys**</strong></strong></p>  \t<p>  \t\t<strong> I will offer Skype support to every student who asks for it. If you have a problem/question, send me a private message and we will set a time for the call.</strong>  \t</p>  \t<p>  \t\t                       -----------------------------------------------------------------------------------------------------------  \t</p>  \t<p>  \t\t                       Would you like to know how to create high quality video content?  \t</p>  \t<p>  \t\t                       Would you like to finally start getting involved with Udemy, Youtube, or any other video-sharing network?  \t</p>  \t<p>  \t\t                       Can you follow the easy instructions I will lay down for you to master the art of screencast production in no time at all?  \t</p>  \t<p>  \t\t                       That's what I thought!  \t</p>  \t<ul>  \t\t<p>  \t\t\t                       Let me help you !  \t\t</p>  \t\t<p>  \t\t\t                       In this course,I will teach you which free softwares to use, and how you can use them to shorten your learning curve, and start creating video content right away.  \t\t</p>  \t\t<p>  \t\t\t                       In this course, you will learn :  \t\t</p>  \t\t<li> The fundamentals to a good video.</li>  \t\t<li> How to apply these fundamentals and how to go pro from the very start.</li>  \t\t<li> How to make sure you don't make the beginner's most frequent mistakes.</li>  \t\t<li> How to actually record your audio and your videos, the easy way.</li>  \t\t<li> How to do this using <strong>only free resources.</strong></li>  \t</ul>  \t<p>  \t\t                       Upon enrolling, you will get my personal help. I will answer any question that you may have in the member's area, and I also offer Skype support if needed.  \t</p>  \t<p>  \t\t                       I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk !  \t</p>  \t<p>  \t\t                       You can get started right after you have taken my course -That meansTODAY!  \t</p>  \t<ul>  \t\t<p>  \t\t\t                       Click the \"Take This Course\" button now. That's your first step to making a living producing your very own videos. Every minute that goes by without action is one minute you'll never get back.  \t\t</p>  \t\t<p>  \t\t\t                       Cheers!  \t\t</p>  \t\t<p>  \t\t\t                       Howard  \t\t</p><p>Tags: Record Your Screen , Sceencast, HD Videos</p>  \t</ul>  </ul>", 
    "end_date": null, 
    "title": "Record Your Screen Like A Pro: Create Sellable HD Videos!", 
    "price": "50.00", 
    "instructors": "Howard Lynch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/344040_37bb_4.jpg", 
    "course_url": "https://www.udemy.com/create-great-free-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-14T11:12:52Z"
}