{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>As teachers and school administrators, we experience the huge amount of conflict that comes through our schools. Using restorative approaches, this course will give you the tools you need to resolve conflict effectively, and in a way that builds community and trust among your students. </p>  <p><strong style=\"\">Start building a culture of peace in your classroom </strong></p>  <p>By the end of the course you will be able to:</p>  <ul style=\"\"><li style=\"\">Understand the benefits of restorative approaches </li><li style=\"\">Intervene in a conflict in a meaningful way using the three restorative questions</li><li style=\"\">Assess conflicts and choose the most appropriate response </li><li style=\"\">Address negative behaviours in your classroom by leading restorative peace circles</li></ul>  <p><strong style=\"\">Powerful skills that will transform your approach to conflict</strong></p>  <p>Conflict are a necessary part of life, and our experience as a teacher - but it doesn&#039;t have to be negative. Restorative approaches are based on the idea that conflicts provide useful momentum for positive change. Coming from the practice of restorative justice pioneered in prisons, restorative approaches involve the wrong-do&#039;ers, the victims, and the community in &#039;making things right&#039;.</p>  <p>This course will give you an overview of how these proven approaches can be adapted for your classroom. By providing a host of examples you&#039;ll understand how restorative approaches can be applied in situations as diverse as students leaving behind a mess, to an intense and emotional bullying situation. </p>  <p>Designed with the busy 7-12 grade teacher or administrator in mind, this course will take you just over an hour to complete. Suitable for those with no prior experience, it&#039;s the perfect starter course to help you understand the value of these approaches, and get you applying them right away. </p>  <p>Packed with additional resources you&#039;ll be able to take a deep dive into areas that are particularly relevant to you. You&#039;ll receive a verifiable certificate upon completing the course, and learn techniques that you&#039;ll be able to build on throughout your teaching career.</p><p>We&#039;ve shared real life examples, summary sheets, and quizzes to ensure you walk away with the tools you need to start building a culture of peace in your school.</p>", 
    "end_date": null, 
    "title": "Restorative Approaches for Teachers 101", 
    "price": "35.00", 
    "instructors": "Jessica Lax, Dave Farthing", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329612_6e08_2.jpg", 
    "course_url": "https://www.udemy.com/restorative-approaches/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T17:19:40Z"
}