{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \tNo matter what type of yoga you teach now, if you want to be one of the most magnetic, knowledgable teachers around, and rise to the top of the crop, you cannot miss out on the uber-valuable information contained in this training that you won&rsquo;t get anywhere else!  </p>  <p style=\"\">  \tJoin me, Sadie Nardini, a teacher who started out with 5-10 students in most classes, who couldn&rsquo;t get a prime time class unless I subbed for some more popular instructor, and who now rocks it in front of hundreds of eager students in some of the largest conferences and studios in the world.  </p>  <p style=\"\">  \tI went from being an unknown teacher in the huge, competitive pond of New York City to one of the rising faces in the yoga world, making DVDs for Gaiam, publishing books and teaching at the Yoga Journal Conferences. I still pinch myself sometimes.  </p>  <p style=\"\">  \tBut I&rsquo;m not some charmed yogini whom Lady Luck happened to take by the hand. There is a process to shining like the rockstar you already are, so brightly that more students and opportunities are attracted to you than you can believe. Ever since I learned the tools, and started using them, I&rsquo;ve been on a steady rocket ship boost to pure prosperity and passionate living, every day.  </p>  <p style=\"\">  \tA sweet side effect is that my income has risen by about 1000% since my days struggling to get people into my classes.  </p>  <p style=\"\">  \t<strong style=\"\">I did it, and I can teach you what you need to be able to do it, too. </strong>  </p>  <p style=\"\">  \tThe Rockstar Teacher Training is the secret weapon of a growing number of instructors of all styles, ages, abilities and levels. You don&rsquo;t have to be loud or want to be a yoga star to be a Rockstar. This training meets you where you are, then empowers you to take whatever style of teaching you love, and turn it up to 11 in how much more effective and clear (and inspiringly fun) it will become for your students.  </p>  <p style=\"\">  \tWith more students and larger classes, your world opens up to workshops, retreats, DVDs, even trainings of your own, and much more! But you have to know what your students really want, most of all: A teacher who is vibrant, knows more about the body than most, moves it in a specific way that people resonate with more, and who can share all of this in an exciting, creative way.  </p>  <p style=\"\">  \t<strong style=\"\">You have to Rock Who You Are.</strong>  </p>  <p style=\"\">  \tNot only that, but at the end of your training, which you can take all the time you want to complete--I will give you a coveted certification in Core Strength Vinyasa Yoga that you can add to your bio, start calling your classes CSV Yoga, or just take the information that works for you, and use it to turboboost your existing style! It&rsquo;s all good.  </p>  <p style=\"\">  \tBecoming a Rockstar is simple! Just watch, and learn.  </p>  <p style=\"\">  \tJoin Sadie for her fantastic, 40-hour RockstarTeacher Training, the video portion of which was filmed live at Kripalu, one of the premier mind/body centers in the country! With this information, you&rsquo;ll be a step ahead of the curve.  </p>  <p style=\"\">  \tWatch at your own pace, and receive a Certification in Sadie&rsquo;s Style, to compliment your existing certification or style. Plus, get 10 hours of Continuing Ed Credits through Yoga Alliance or count all 40 hours toward your 200-hour training under Non-Contact Hours in Anatomy, Technique, Philosophy and more!  </p>  <p style=\"\">  \tSpecifically, you&rsquo;ll get:  </p>  <h5 style=\"\">THE ROCKSTAR VIDEO: SADIE&rsquo;S TRAINING LIVE AT KRIPALU: </h5>  <ul style=\"\">  \t<li style=\"\">Beautifully shot video of Sadie&rsquo;s weeklong Core Strength Vinyasa  Yoga Teacher Training-you feel like you&rsquo;re right there with the group!</li>  \t<li style=\"\">Begin with Sadie&rsquo;s Core Conversations, where she details the focus for the session ahead. There is often a skeleton involved.  </li>  \t<li style=\"\">8 full Core Strength Vinyasa Yoga flow classes to observe Sadie  teaching and sequencing for more ideas for your own classes--see how  Sadie integrates the knowledge into real time. You can watch, or do the  classes and get your yoga workout in while you learn! </li>  </ul>  <h5 style=\"\">And more:</h5>  <ul style=\"\">  \t<li style=\"\">New-generation anatomy sessions that teach not single muscles but  muscle meridians, our holistic power centers, something every yoga  instructor must know about in order to be the most effective teacher. </li>  \t<li style=\"\">How to powerfully use the newly-discovered myofascial meridians to  build instant strength and avoid common injury pitfalls in the yoga  postures.</li>  \t<li style=\"\">An in-depth study of what it takes to properly ground, support, core-connect to and express from every pose. </li>  \t<li style=\"\">Mistakes teachers often make in cueing classes, and misalignments  students commonly do by instructing and doing yoga from the more  superficial meridians. </li>  \t<li style=\"\">How to switch the focus of a yoga practice and teaching from outer to inner.</li>  \t<li style=\"\">Sadie&rsquo;s Core Poses, new moves that counter-balance and deeply strengthen your usual routine.</li>  \t<li style=\"\">Core yoga philosophies of transformation and Self-centering, and  how to parallel them in a physical practice--and in your life, to effect  total transformation and empowerment.</li>  \t<li style=\"\">Alignment information for how to put the elusive &ldquo;core&rdquo; back into  all the poses, making even the most challenging like Crow, Handstand and  Headstand much more possible.</li>  \t<li style=\"\">A game-changing conversation about Finding Your Voice, Discovering  Your Core Message, and Sequencing From the Core. Your personal truth,  your yoga, and your creativity will amplify in just this one session!</li>  \t<li style=\"\">Tools to support you to develop an even stronger sense of self and  Core Relationship. The more core strong you are on all levels, the more  authentic and successful a rockstar you will become.</li>  </ul>  <h5 style=\"\">AND JUST SO YOU&#039;LL ROCK HARDER</h5>  <p style=\"\">  \tSadie has created these Rockstar Yoga Teacher E-books for you to  download, keep--and use as a huge yoga teaching resource for years to  come:  </p>  <p style=\"\">  \t<strong style=\"\">CORE STRENGTH VINYASA YOGA FOUNDATIONS:</strong><br style=\"\">  \t Over 100 pages of revolutionary yoga information about this style of  yoga, and how to use new discoveries about anatomy and alignment to  exponentially improve your teaching and understanding of how the body  moves on the mat. Use Sadie&rsquo;s perspectives and tools with any style of  yoga you do or teach now!  </p>  <p style=\"\">  \t<strong style=\"\">CORE POSE INSTRUCTION MANUAL:</strong><br style=\"\">  \t Learn Sadie&rsquo;s Core Poses: new variations that amplify the benefits for  any student! Also, you&rsquo;ll discover how to instruct the Core Poses--and  many commonly-taught poses too, using Sadie&rsquo;s powerful 3-Part  Instruction. You will be amazed at the difference in your students&rsquo;  strength and capability in their practice when you start instructing in  the opposite way from most teachers out there!  </p>  <p style=\"\">  \t<strong style=\"\">ROCK YOUR SEQUENCING FROM THE CORE: </strong><br style=\"\">  \t Sadie&rsquo;s Top Core Sequencing Tips, invaluable secret tools for finding  your voice, speaking from your unique Core Message, and sequencing your  classes for the most powerful effect.  </p>", 
    "end_date": null, 
    "title": "Rockstar Teacher Training", 
    "price": "50.00", 
    "instructors": "Sadie Nardini", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67686_32f4_9.jpg", 
    "course_url": "https://www.udemy.com/rockstar-teacher-training/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-21T18:48:33Z"
}