{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<ul><p><strong>Course Update</strong><strong> - April 2016</strong> I updated the entire course to reflect changes in OBS.<br><strong class=\"redactor-inline-converted\"></strong></p><p><strong class=\"redactor-inline-converted\">S</strong><strong class=\"redactor-inline-converted\">creen capture video</strong> is a good way to get started with video creation and editing, regardless of whether you want to create videos tutorials, e courses, or even marketing videos.</p>Once you are comfortable creating screen capture videos, you can step up to the next level with webcam or even a DSLR videos.<br><br><li>Do you want to make <strong class=\"redactor-inline-converted\">screen capture presentation videos</strong> that look and sound great?</li><li>You don't have much experience with video or audio recording tools?</li><li>Or, you know a something about making video but want to take it to the next level</li><li>You don't want to spend too much money to get started?</li><li>You don't want to waste a lot of time, and want to get started fast</li></ul>\n\n<p>If that's you, then this course is for you.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">You will learn how to</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Use a <strong class=\"redactor-inline-converted\">free software</strong> that runs in <strong class=\"redactor-inline-converted\">Windows, OS X and Linux</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It is very flexible,  is powerful, yet is<strong class=\"redactor-inline-converted\"> easy to learn and use</strong> without a steep learning curve like other video software. There are some tips to get the settings right for sharp, high quality screen recording.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Video capture software can cost hundred of dollars, and requires a lot of time just to get your first video out.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course:-</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>I will explain the important settings for you to get started, </li><li>I'll show you how to start with a simple screen capture video before proceeding to more advance video recording that includes recording your webcam creating a picture-in-picture effect</li><li>you will also be able to do green screen or chroma key video right from your home or office studio</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This <strong class=\"redactor-inline-converted\">course takes just under 1 hour</strong>. The reason you see 2 hours total is because I cover both versions OBS.</p>", 
    "end_date": null, 
    "title": "Screen Capture Videos With Open Broadcaster Software", 
    "price": "35.00", 
    "instructors": "James Woo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559448_1007_2.jpg", 
    "course_url": "https://www.udemy.com/amazing-screen-capture-videos-with-open-broadcaster-software/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T14:31:02Z"
}