{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>***Funktioniert der Kurs auch mit Screenflow 6? Ja. Die Videos wurden zwar mit Screenflow 5 aufgenommen, bleiben aber auch für Screenflow 6 relevant.***</strong></p>\n\n<p>Hast du auch genug davon, dich statt des Schneidens deiner Videos mit dem Erlernen von Screenflow herumzuschlagen?<br></p>\n\n<p>Ich bin Gian, komme aus der Schweiz und verdiene mein Geld im Internet. Unter anderem mit dem Erstellen von Onlinekursen. In diesem Kurs nehme ich dich an die Hand und führe dich Schritt für Schritt durch Screenflow 5. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Ob der Kurs für dich ist?</strong></p>\n\n\n\n<p>Egal ob du Kurse kreierst, Youtube Videos machst oder ein Promovideo für deine Homepage willst. Ohne vernünftiges Beherrschen eines guten Screencastprogramms wird das Ganze entweder ein Murks, ziemlich teuer oder reine Zeitverschwendung. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Zudem: </strong>Um dich heutzutage von der Masse abzuheben, brauchst du gute Videos. Und um gute Videos zu produzieren, ist es unumgänglich, das entsprechende Programm aus dem FF zu beherrschen.</p>\n\n\n\n<p>Aber warum soll ausgerechnet ich dir Screenflow beibringen?</p>\n\n\n\n<ul><li>Nun, ich weiß, wie mühsam es ist, wenn man eine gewisse Vorstellung hat und diese dann an der Umsetzung scheitert, weil man schlicht und ergreifend die Funktionen nicht gut genug kennt.</li><li>Ich weiß, wieviel Zeit man mit der Internetrecherche verschwendet, um sich dann am Schluss mit einem billigen Kompromiss zufrieden zugeben, weil man die gesuchte Funktion trotzdem nicht gefunden hat.</li><li>Ich weiß, wie frustrierend es ist, Stunden, Tage oder gar Wochen damit verbracht zu haben, sein ganzes Herzblut in einen Kurs zu stecken, um dann am Schluss an den richtigen Exporteinstellungen der Videos zu scheitern.</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Was dir der Kurs bringt</strong></p>\n\n\n\n<ul><li>Stell dir vor, wie gut du dich fühlst, wenn du endlich fähig bist, deine Ideen 1 zu 1 in deinen Videos umzusetzen.</li><li>Stell dir vor, wie befriedigend es ist, deine Zeit und deine Energie nicht mehr ins Herausfinden bestimmter Funktionen innerhalb Screenflow, sondern ins Umsetzen deiner Ideen zu investieren.</li><li>Stell dir vor, wie beruhigend es ist, zu wissen, dass du nach Absolvieren dieses Kurses fähig bist, freche Screencast Videos zu erstellen.</li></ul>\n\n\n\n<p>Und nicht nur das, falls gewünscht, kannst jetzt sogar Verwandte und Freunde mit spektakulären Urlaubsvideos beeindrucken. </p>\n\n\n\n<p><em>Kannst dir vorstellen, wie es sich anfühlt, endlich DIE Videos zu produzieren, die du dir erträumst?</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Warum noch zögern?</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Meld dich jetzt für diesen Kurs an und du wirst es garantiert nicht bereuen. Garantiert? Ja, GARANTIERT. <em>Denn</em> </strong><em><strong class=\"redactor-inline-converted\">du hast eine 30 Tage Geld zurück Garantie - ohne Angabe von Gründen, einfach so.</strong></em></p>\n\n\n\n<p>Zögere also nicht mehr und greif zu. <strong class=\"redactor-inline-converted\">Melde dich JETZT für diesen Kurs an und lerne Screenflow 5 Schritt für Schritt, einfach und schnell beherrschen.</strong> Worauf wartest du?</p>", 
    "end_date": null, 
    "title": "Screenflow 5 Schritt für Schritt, einfach und schnell lernen", 
    "price": "40.00", 
    "instructors": "Gian Camichel", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611580_8c01_3.jpg", 
    "course_url": "https://www.udemy.com/screenflow-5-einfach-und-schnell-lernen-kurs-deutsch/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T11:03:49Z"
}