{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<strong>Learn the Fundamentals of ScreenFlow (version 5) and begin creating your own online course now.</strong>  </p>  <p>  \t                             You will start with a demonstration of a feature-rich screencasting project -- then you&#039;ll learn to replicate it.  </p>  <p>  \t        Included in this interactive course are:  </p>  <ul>  \t<li>exercise files to help you reinforce the &quot;video knowledge&quot; in this feature rich course.</li>  \t<li>on-going performance support from the instructor and hundreds of other screencasting practitioners via a highly active member&#039;s only community forum. (Included with your purchase of this course.)</li>  </ul>  <p>  \t                             In this course, you&#039;ll learn how to use ScreenFlow for Macintosh -- one of the &quot;Big 3&quot; video screen capture and editing software programs in the market used by professional screencasters and online learning professionals.  But, your learning won&#039;t stop there.  </p>  <p>  \t  This course is delivered by one of Telestream&#039;s exclusive community of <em>ScreenFlow Insiders</em>, online learning architect at one of Forbes&#039; 100 Most Promising Companies in America, and professional screencaster with over 80 4+ star reviews.  </p>  <p>  \t<strong>Testimonials</strong>  </p>  <p>  \t                             &quot;<strong>Fantastic!</strong> Mel does such a wonderful job explaining ScreenFlow. I was a complete novice with the software and now I feel confident to record video, edit it, and publish it... I&#039;ve taken a few classes here and this is definitely one of the best ones. Great content and a quality course. Thanks Mel!&quot;<br>  \t<em>~ Biba Atta, Udemy student</em>  </p>  <p>  \t                             &quot;<strong>Don&#039;t waste your time with any other educator - Mel&#039;s the best.</strong> I spent a bit of time scouring the web for training videos on ScreenFlow. I wish I had found Mel sooner... Mel&#039;s engaging style is something I hope to even half emulate one day. He is generous, humorous and knows a lot. Compared to what else is out there, he&#039;s a gem and I thank him or the huge effort he puts into sharing his knowledge.&quot;<br>  \t<em>~ Helen Crozier, Udemy student</em>  </p>  <p>  \t<em>&quot;</em><strong>Awesome training!</strong> I wanted to learn screencasting so I went to YouTube and found some videos here and there but nothing well structured that will guarantee a learning experience from A to Z... I was lucky enough to bump into Mel&#039;s... I SINCERELY believe that this course went beyond my expectations. I loved this course. Straight to the point, very easy to understand and follow, with exercises...Thank you Mel, AWESOME training. I am completely sold on any training I may need in the future that has your name on it.&quot;<br>  \t<em>~ Hazel Vallejos, Udemy student</em>  </p>  <p>  \t<strong>Go beyond the classroom.  </strong>Learn how to transform your live presentations, workshops and live training courses to a digitized format that&#039;s easily shared, easily consumed and potentially profitable.  </p>  <p>  \t<strong>Don&#039;t be boring.</strong> Learn to kick your online presentations up a notch from run-of-the-mill online presentations by overlaying quality audio and synchronizing live action web video to increase your audience&#039;s engagement.  </p>", 
    "end_date": null, 
    "title": "ScreenFlow (v5) Essentials: Teach Online Today!", 
    "price": "25.00", 
    "instructors": "Mel Aclaro", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369806_be0a_2.jpg", 
    "course_url": "https://www.udemy.com/screenflow-v5-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-13T22:54:34Z"
}