{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong style=\"\"></strong><strong style=\"\">&#039;Screenflow Superstar - 9 Ways To Make Money Screencasting&#039; </strong>will not only teach you how to use ScreenFlow 5 like an expert, you will also discover nine specific ways that you can put your newly gained screen cast skills to use in the real world, and make money with your movies.</p><p><strong style=\"\">HOW YOU WILL BENEFIT FROM THIS COURSE...</strong></p><p>The course is two-fold:</p><ul style=\"\"><li style=\"\">It <strong style=\"\">teaches exatcly how to use Screenflow screencasting and video editing software</strong> in easy to follow tutorials - from Beginner to Experienced.</li><li style=\"\">It shows <strong style=\"\">nine specific ways you can use your screen cast and video editing skills to make money and share your value with the world</strong>. I am also certain that these will inspire ideas of your own!</li></ul><p><strong style=\"\">WHAT&#039;S INSIDE THE SCHOOL ROOM?</strong></p><p>See exactly how I am using ScreenFlow 5 every day to generate nine different streams of income - everything from simple promo videos for local businesses to online workshops and software tutorials. Many of these methods and strategies also make money on autopilot once you get them in motion.</p><p>The course will teach you all you need to know about how to use Screenflow - from the very basics of opening a new Screen flow project, right through to actually delivering your content to your audience, both online and offline.</p><p>You will learn in simple easy-to-follow step-by-step tutorials how to produce professional results using ScreenFlow to:</p><ul style=\"\"><li style=\"\">Capture your screen and create awesome screencasts</li><li style=\"\">Edit your videos like a pro</li><li style=\"\">The quickest, easiest and best ways to add transitions and effects</li><li style=\"\">Ninja secrets to increase your productivty and video quality</li><li style=\"\">How to export your videos for great results</li><li style=\"\">How to create straight to camera videos that work and look great</li><li style=\"\">Audio and video equipment suggestions for the best results without breaking the bank</li><li style=\"\">Lighting techniques on a tight budget</li><li style=\"\">Green screening tips and tricks</li><li style=\"\">Using Keynote and Powerpoint together with Screenflow for excellent results</li><li style=\"\">Other video generation software that you can use alongside Screenflow to add a little extra spice to your videos</li><li style=\"\">Where to host your videos - both free and paid</li><li style=\"\">How to actually deliver your videos online</li><li style=\"\">Different ways to sell and profit from your video creations</li><li style=\"\">Two places you can get professionally duplicated and printed DVDs created and sent anywhere in the world for just a few dollars</li></ul><p>Plus a whole lot more...</p><p><strong style=\"\">---------------------------------------------------</strong></p><p><strong style=\"\">***** ALSO INCLUDED - BONUS MODULE *****</strong></p><p><strong style=\"\">BONUS MODULE - VIDEO GUIDE TO MASTERING AMAZON AWS S3 </strong></p><p><strong style=\"\">---------------------------------------------------<br style=\"\"></strong></p><p>If you plan to host your videos on Amazon S3 this in depth BONUS module will walk you through every detail you need to know to do so securely. Developed by a friend of mine who is an Amazon S3 expert, this additional module is worth the price of admission alone! </p><p><br style=\"\"></p><p><strong style=\"\">STUDENT BENEFITS</strong></p><p>I always add new videos to my courses as I learn new things myself, and this course will be no exception - I already have some additional videos in the pipeline. As a student on the course, you get any additional training added to the course completely free of charge. </p><p><strong style=\"\">WHO IS DAVID LEE MARTIN?</strong></p><p>As a professional online trainer and a creativity coach, I already have well over 10,000 students on my courses, ranging from an online Bible school, online dance workshops, to training for writers, web designers, and entrepreneurs. I also run a sucessful local web design business that keeps me plugged in to my community and some of the challenges that brick and mortar businesses are facing today. </p><p>I love to teach and train others, and put new skills into their hands that they can then take and use to get their own unique creations and value out to a waiting world. </p><p>I am 100% committed to your success, and would love to see you on the course.</p><p>You are also covered by the unconditional, Udemy backed, 30 day money-back guarantee - but I am 100% confident, as we work together, you will succeed in all that you put your hand to ... just like my thousands of other Udemy students.</p>", 
    "end_date": null, 
    "title": "Screenflow Superstar - 9 Ways To Build A Business With Video", 
    "price": "30.00", 
    "instructors": "David Lee Martin", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444722_6e9b_3.jpg", 
    "course_url": "https://www.udemy.com/screenflow-screencast-superstar/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T11:39:24Z"
}