{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course will provide you with all you need to know to get started teaching Business English. If you are a teacher new to teaching business English; an experienced teacher looking for professional development opportunities; an MA TESOL student wanting to learn about this branch of ELT; a program coordinator at a TESOL Certificate program; or even an Advanced-Level Business English student; you will find this course useful.</p>  <p>  \t            You will learn the basics of course design and assessment, as well as foundations for teaching English for Business Purposes (EBP) that will improve your teaching skills in any teaching situation.  </p>  <p>  \t               Each lecture includes additional materials which you can use in your own classroom or as professional development.  </p>  <p>  \t      Start learning today -- earn higher teaching evaluations <strong>and</strong> gain a reputation as a professional teacher. If you follow the principles outlined in this course, you will be ahead of 95% of other teachers.  </p>  <p>  \t      What students are saying about \"Skills Upgrade: Teach Business English:\"</p>  <p>  \t<strong><em>“Greatly structured course.\"  </em></strong>  </p>    <p>  \t<strong><em>“It will enhance your knowledge and career in teaching English!\"  </em></strong>  </p>    <p>  \t<strong><em>“During the course, I began to feel much more confident that I could successfully teach a Business English course.\"</em></strong>  </p>    <p>  \t<strong>Enroll NOW and take your teaching to new heights!</strong>  </p>", 
    "end_date": null, 
    "title": "Skills Upgrade: Teach Business English (Language Teaching)", 
    "price": "25.00", 
    "instructors": "ELT Online", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107820_c14b_19.jpg", 
    "course_url": "https://www.udemy.com/businessenglish/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-19T07:48:02Z"
}