{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n\n<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong>I absolutely love this ONE star review from Abigail:</strong></p><p>Abigail Wall says \"<strong>Not very useful </strong>-<strong> </strong>Bonus material about salary negotiation is unrelated to topic of the course, I found most of the content does not help you create your Udemy course and isn't concrete enough.\"</p><p>When you take my free course, you get personal access to me. I charge clients thousands of dollars for a day with me, and you get similar personal contact for free. So ask me questions :)</p><p><span></span>The reviewer chose to review the course based on bonus material provided that showed how I think differently. Not only that, the content in this course has helped me create 37 Udemy courses in 5 months!  I dare you to find out how many courses the reviewer has!</p><p>My strongest suggestion to anyone contemplating taking my course (or any of my courses) is to realize who you are taking advice from. You can decide if you want to learn from someone who has 37 courses created in a very short time or from someone who sits on the sidelines and waits for the perfect opportunity.</p><p>This course is for those who want results and for those who take action. If you are an information junkie, simply find another course to take. </p><p>Have you struggled to come up with Udemy course ideas? In this course I will reveal how I effortlessly come up with Udemy course ideas.</p><p>I started producing Udemy courses in late July and my first Udemy course was released on August 7th 2015. Since then I've been rapidly creating courses as I've found it such a rewarding experiencing being able to teach thousands of students all over the world.</p><p>In the first 3 months, I created 28 Udemy courses!</p><p>This course will reveal a 5 step process to come up with ideas effortlessly but the only way this course will work for you is if you take action! Come up with ideas and implement and get courses completed.</p><p>I'll reveal the 3 categories of courses I almost exclusively focus on and why you should too!</p><p>You will also learn how to find YOUR REASON - without your reason you will find yourself procrastinating and most likely failing. You will also learn how to find starving markets and you will be shown some free market research tool to uncover hot markets easily.</p><p>You will also discover an easy content creation process - this will be a game changer to get content quickly!</p>", 
    "end_date": null, 
    "title": "Step-by-Step Guide to Making Udemy Courses - Unofficial", 
    "price": 0, 
    "instructors": "Nikhil Parekh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664274_cb88_2.jpg", 
    "course_url": "https://www.udemy.com/unofficial-udemy-course/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T01:44:21Z"
}