{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n\n\n<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p>Most existing and new Udemy Instructors are struggling with extreme overwhelm. How do I know? I struggled in the beginning too!</p><p>In early 2014, I first heard about Udemy but I was too busy on other projects to take too much notice. In June and July 2015, I was alerted to the power of Udemy again. </p><p>This time I started paying attention. Where was I to start? I looked up some instructors and started learning from them, but some provided conflicting strategies and I was completely confused. Towards the middle of July 2015, I decided to take action and create my first course. I wanted to reduce the overwhelm, so I tuned out and started focusing on taking MASSIVE ACTION. </p><p>Within the first 12 weeks I had finished and released 28 Udemy courses! I am currently working on many more courses and the main reason is I've overcome the overwhelm factor.</p><p>In this course, you will learn the biggest mistakes new and existing instructors are making and how you can avoid these mistakes.</p><p>You will learn how to stop listening to everybody and discover how to start taking action. You will also be shown why trying to do multiple courses at once will be one of your biggest downfalls. Internalize this - ONE COURSE AT A TIME.</p><p>You will be shown why consistency is critical and why you need to focus on one course at a time. Learn how to overcome the challenges of not being an expert (and the good news is you don't have to be an expert!)</p><p>Isn't it time you started playing in the game instead of being a spectator in the stands?</p><p>This course comes with a 30 day money back guarantee so enroll today.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Stress-Free Ways to Create Udemy Courses - Unofficial", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/675130_ed96_2.jpg", 
    "course_url": "https://www.udemy.com/feeling-overwhelmed/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-20T01:03:22Z"
}