{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t      Are your students motivated to learn?  Having a classroom of students who eagerly enter the room each morning anxious to get started on the work for the day is a joy few teachers experience.In this course you will learn how to work with your students to help them tap into the intrinsic motivation they already have to learn and be a successful student.  </p>  <p style=\"\">  \t      In this course you will learn how to:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t      ·Create a classroom learning environment where students want to be and want to learn.  \t</p>  \t<p style=\"\">  \t\t      ·Teach your students to be active participants in their learning and do it within a social context  \t</p>  \t<p style=\"\">  \t\t      ·Teach your students to actively choose the topics they will study within the broader context of the curriculum  \t</p>  \t<p style=\"\">  \t\t      ·Build a learning community in the classroom where the students get to know you and each other  \t</p>  \t<p style=\"\">  \t\t      ·Remove marks from students’ work as much as possible and focus on positive feedback and concrete suggestions for improving work.  \t</p>  \t<p style=\"\">  \t\t      ·Evaluate students primarily to help them to develop their ability.  Follow up assignments with a personal conversation about their work, what they did well, and what they could do to improve.  \t</p>  \t<p style=\"\">  \t\t      ·Provide a learning environment where an inability to do something is not viewed as a failure but rather a situation which needs more instruction.  \t</p>  </ul>  <p style=\"\">  \t      The Student Motivation course is divided into seven modules.  Each module contains a series of lectures explaining what you need to do and why and it concludes with lecture on concrete, actionable steps you can take to implement the ideas discussed in the module. Each lecture is available in three formats.The video lecture is complimented by an audio recording in MP3 format that you can download to your favorite listening device and listen to whenever and wherever you wish.There is also a copy of the lecture in PDF format that you can download and read and use to make notes on.  </p>  <p style=\"\">  \t      Each lecture is delivered by Dr. Wayne Sheldrick author of Amazon bestselling books: <em style=\"\">Classroom Management Made Easy </em>and <em style=\"\">The First Week of School</em>. Dr. Sheldrick has more than 25 years experience in the classroom as well as working with teachers to help them better meet the needs of their students and make their teaching experience more enjoyable.  </p>  <p style=\"\">  \t      Don&#039;t forget that you can buy this course for a friend or family member who wants to help their students be the best they can be.<strong style=\"\"> Student Motivation is a gift that will change the life of that teacher you know!</strong>  </p>  <p style=\"\">  \t      Just click the <strong style=\"\">Take This Course</strong> button on the right to begin the Student Motivation course and start to change your teaching experience forever.<br style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Student Motivation", 
    "price": "30.00", 
    "instructors": "Dr. Wayne Sheldrick", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124890_2944_6.jpg", 
    "course_url": "https://www.udemy.com/student-motivation/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-25T03:10:30Z"
}