{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>Do you want to teach online and be rewarded for doing what you love?</p>\n\n<p>Join this course to discover <strong>\"KC's secret package\"</strong> that Udemy instructors wish they knew about earlier!</p>\n\n\n\n\n\n\n\n<p><strong><em>KC's secret package will teach you a proven system to make money from your course even BEFORE you dive into creating it.</em></strong></p>\n\n\n\n\n\n\n\n<p>Whether you are an aspiring, new or existing instructor on Udemy, if you want to add tremendous value to your earning potential, this is a course that you don't want to miss!</p>\n\n\n\n\n\n\n\n<p><br>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br></p>\n\n\n\n\n\n\n\n\n\n<p><em><strong>\"What No One Else Talks About</strong></em></p>\n\n\n\n\n\n\n\n\n\n<p><em>I heard another Udemy instructor once say he borrowed $50,000 to start his Udemy career. In this course, KC teaches you how he made $2,000 from his Udemy course before he even started it. I don't know about you but I like that way much more. And it gets better! His process is easily duplicatable. Great course for anyone thinking about teaching online or frustrated with their results. Highly recommended.\" </em><em>– Scott Paton</em></p>\n\n\n\n\n\n\n\n\n\n<p>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::</p>\n\n\n\n\n\n\n\n\n\n<p><br>Do you have a <em>great </em>idea about a course that you want to create on Udemy, but you wonder whether anyone will buy it?<br></p>\n\n<p>Or do you ever worry about investing time and effort into creating a new course when you're not even sure whether you can make money from it?</p>\n\n\n\n\n\n<p>If you are overwhelmed by doubts, don't fret. <strong>This course will teach you</strong><strong> a simple winning strategy that will guarantee your course to be profitable even before you go ahead and create it  </strong><strong>– <em>no matter what topic you teach!</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>You don't have to hold back your dream of creating the course that you have always wanted to share with the world!</em><br></p>\n\n\n\n\n\n\n\n<p><em>Whether it's your first, second, or your fifth course, you will have the practical means to make money from your next Udemy course after learning the strategies mapped out in this course!</em></p>\n\n\n\n\n\n<p><br>********************************************************</p>\n\n\n\n\n\n\n\n\n\n<p><strong>ONE-TIME ENROLLMENT FOR LIFETIME LEARNING</strong></p>\n\n\n\n\n\n\n\n\n\n<p>This course will stay regularly updated to bring you the most up-to-date knowledge and tips!</p>\n\n\n\n\n\n\n\n\n\n<p>By enrolling in this course now, you will receive all future updates <em>automatically at no extra</em><em> charge</em>.<br></p>\n\n\n\n\n\n<p>Yes! You get lifetime updates – and it's free.<em> That's lots of real money saved!</em></p>\n\n\n\n\n\n\n\n\n\n<p>********************************************************<br></p>\n\n\n\n\n\n\n\n\n\n<p><strong><br>Why The Secret Package?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Let's face it, every Udemy instructor has to deal with a great amount of stress and uncertainty when it comes to launching a new course. </p>\n\n\n\n\n\n\n\n\n\n<p>No matter how rich your course content is, how engaging your delivery is or how crisp your audio quality is <em>–</em> there is no clear answer as to whether your course will be z<em>ero</em> or <em>h</em><em>ero</em> until you get it published.</p>\n\n\n\n\n\n\n\n\n\n<p>After all the hard work of planning and recording your course, you are faced with the fear of not knowing whether anyone is going to buy your course...<br></p>\n\n\n\n\n\n\n\n\n\n<p>Many course instructors have had their fair share of disappointments, but it doesn't have to be this way for you.</p>\n\n\n\n\n\n\n\n\n\n<p>The good news is, you can do it the <em>smarter </em>way and enjoy incredibly different <em>results </em>because you are right here!</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Based on a unique idea that I devised, you will discover exactly how you can generate profits from your Udemy course <em>EVEN </em><em>BEFORE YOUR COURSE IS CREATED!</em></strong><br></p>\n\n\n\n<p><em>You will be able to keep risks and uncertainties at bay because </em><em>you are already profitable even before you dive into creating the course itself!</em></p>\n\n\n\n\n\n\n\n\n\n<p>I have personally used my \"secret package\" with a great amount of success – <strong>garnering more than US$2,000 in profits</strong> –<strong> </strong>even before I started to create my online course, and you will learn exactly how to duplicate this system after taking this course!</p>\n\n\n\n\n\n\n\n\n\n<p><em><br>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::</em></p>\n\n\n\n\n\n\n\n\n\n<p><em><strong>\"Awesome and Mind blowing course!</strong></em></p>\n\n\n\n\n\n\n\n\n\n<p><em>This is an awesome and mind blowing course! This course is packaged with rich content and surprises! I am really very impressed with this course! I simply love the secret package! It was also very obvious that KC Tan has a genuine interest in helping his students. He is very encouraging and show you step by step how you can come up with your own Udemy course and he will be there to help and support! Upon completion of the course, I am very motivated to quickly start planning for my course! I would definitely recommend this course to my friends! Thank you KC!\" </em><em>– Angel Abundant</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::</em></p>\n\n\n\n\n\n\n\n\n\n<p><br><u>IMPORTANT:</u></p>\n\n\n\n<p>The primary objective of this course is to empower you with the strategies to make your Udemy course profitable even before you create it. It perfectly <em>complements </em>other \"How To Create Profitable Udemy Course\" courses out there perfectly (especially the official Udemy course, \"How To Create Your Udemy Course\") which cover topics relating to course creation and marketing in much greater depth.</p>\n\n\n\n\n\n\n\n\n\n<p><br>Here is a quick summary of what you will learn in this course:</p>\n\n\n\n\n\n\n\n\n\n<p><strong><br>Section 1: Why This Course And Why Teach Online?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>You will learn why this course is different from others and the unique value that this course provides. You will also learn what are the top three commitments you must keep to be a profitable Udemy instructor.</p>\n\n\n\n\n\n\n\n\n\n<p><strong><br>Section 2: Plan Your Course For Success!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>In this section, you will learn how to select a topic to teach and what are the things you need before recording your course. I will also share with you my “Secret Package\" and how I use it!</p>\n\n\n\n\n\n\n\n\n\n<p><strong><br>Section 3: The Secret Package!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>This section is one of the most important parts of this entire course. You will learn how to devise your own secret package to make a profit before you create your course. This is the core message: only create the course when someone pays. This ensures you make a profit first!</p>\n\n\n\n\n\n\n\n\n\n<p><strong><br>Section 4: Simple Course Creation</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Once you have gotten your funds, the second half of the course focuses on helping you to get started easily on creating your Udemy course. Here you will learn what are the best practices to follow when it comes to recording a simple online course and what are recording equipment that I personally use.</p>\n\n\n\n\n\n\n\n\n\n<p><strong><br>Section 5: How To Start Getting Students To Sign Up For Your Course</strong></p>\n\n\n\n\n\n\n\n\n\n<p>This section covers promotion strategies to help you attract students to sign up for your course, using Phase 1 and 2 Marketing tactics. This section will be regularly updated with more marketing tips!</p>\n\n\n\n\n\n\n\n\n\n<p><strong><br>Section 6: Generating More Profits!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>You will learn how you can generate even more profits after you have published your course in Udemy! Watch this section for inspiration to add more value to your students!</p>\n\n\n\n\n\n\n\n\n\n<p><br>To help you get the most out of this course, all the information in this course is explained to you in simple terms, and broken down into actionable steps that will be easy to understand and follow.<br></p>\n\n\n\n\n\n\n\n\n\n<p>I will walk you through all the steps with over 20 concise video lessons as well as step-by-step action plans so that you can effectively apply what you have just learnt!</p>\n\n\n\n\n\n\n\n\n\n<p><em>Above all, if you get stuck or experience any difficulties along the way, you won't ever have to struggle on your own and worry about having no one to turn to for help.</em></p>\n\n\n\n\n\n\n\n\n\n<p>Because upon becoming a student of this course, you will receive continuous support from me – help that comes with no expiry. I will be here to share my advice and answers to all your questions whenever you need help from me :)</p>\n\n\n\n\n\n\n\n\n\n<p><em><br>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::</em></p>\n\n\n\n\n\n\n\n\n\n<p><em><strong>\"What A Nice Surprise!</strong></em></p>\n\n\n\n\n\n\n\n\n\n<p><em>If you're thinking about taking this course, don't hesitate! Wait until you watch the \"secret package\" lecture! Here's a new approach to creating courses! Love the clear presentations and step by step action plans! Nicely done Mr. Tan!\"</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>– Lan Anders</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong><br>I trust that this course will</strong> <strong>give you the confidence and assurance that you need to forge ahead with the creation of your first Udemy course and more!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>You already have all the knowledge and expertise to teach a great course, and all you need now is access to the profit strategy taught in this course!</p>\n\n\n\n\n\n\n\n\n\n<p>This is a gift that only you can give yourself, so act on it and I welcome you to join my course!</p>\n\n\n\n\n\n\n\n\n\n<p><br>************************************************************************</p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>30-DAY COOLING-OFF PERIOD</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>If you are not completely satisfied with this course, you have the option to cancel it within the first 30 days and get all your money back. No questions asked, no hassles.</em></p>\n\n\n\n\n\n\n\n\n\n<p>************************************************************************</p>\n\n\n\n\n\n\n\n\n\n<p><br>Now, it is all up to you.</p>\n\n\n\n\n\n<p>If you have read up all the way till here, I believe you are serious about learning and you have a great attitude to succeed!</p>\n\n\n\n<p><strong><em>Click the 'Take This Course' button on top to enroll yourself and start seeing the results for yourself!<br><br></em></strong></p>", 
    "end_date": null, 
    "title": "Teach on Udemy: How To Create Your First Course – Unofficial", 
    "price": "30.00", 
    "instructors": "KC Tan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550616_8c62.jpg", 
    "course_url": "https://www.udemy.com/unofficial-teach-on-udemy-how-to-create-your-first-course/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T01:26:27Z"
}