{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">COURSE UPDATED in April 2016 with brand new lessons and strategies that will get you prepared for teaching online.</strong></p>\n\n<p>  \t  Get ready to make $1,000s per month by teaching online. If you have a passion or special knowledge to share, you can become an online teacher sharing your interests with others.  </p>\n\n\n\n\n\n\n\n<p>  \t  By showing you how to think, create, share, and build your own online courses, this program will have you making passive income in no time simply by sharing your knowledge with others.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Learn How to Share Your Wealth of Knowledge Online to Boost Your Income.</strong>  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Learn Dynamic Course Creation and Presentation Skills</li>  \t<li>Adopt New Audio and Video Techniques for Lectures</li>  \t<li>Discover How to Sell Your Course Online and Create a Brand</li>  \t<li>Identify Course Promotion Techniques That Work</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Share Your Knowledge with a World of Students</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  Unlike traditional brick-and-mortar schools, online schools provide students with flexibility, and this is very helpful to working adults.  </p>\n\n\n\n\n\n\n\n<p>  \t  This is also valuable to those who wish to educate, but want to continue pursuing a career outside of education while still having the opportunity to teach.  </p>\n\n\n\n\n\n\n\n<p>  \t  This course shows you the ins and outs of creating your own courses so you can start sharing your knowledge and making money.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Contents and Overview</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  Through 100+ lectures you'll learn what it's like to be an online teacher, drafting your ideas and building your first course.  </p>\n\n\n\n\n\n\n\n<p>  \t  In the section on creating a course, we'll show you how to create a master, professional style video including PowerPoint presentations and web examples to include in your lessons.  </p>\n\n\n\n\n\n\n\n<p>  \t  Next, you'll learn how to promote and share your course, writing descriptions and keywords to effectively promote courses and tackle marketing strategies.  </p>\n\n\n\n\n\n\n\n<p>  \t  Finally, you'll begin to brand and build your website. You'll learn how to use podcasts, email list, YouTube channel, and social media presence on various networks to boost your class size..  </p>\n\n\n\n\n\n\n\n<p>  \t  Upon completion of this course, you'll know how to create and promote your classes, right down to setting up your own site, self-hosting, and establishing the right keywords, descriptions, promotion strategy, and prices.  </p>\n\n\n\n\n\n\n\n<p>  \t  ***Plus, you'll have access to bonus course building materials to help you take your online course structure to the next level.  </p>\n\n\n\n\n\n\n\n<p>  \t  When you finish this course, you'll feel confident to share your wisdom online, and have access to a community of other online instructors so you can continue to gain more insight for success.  </p>", 
    "end_date": null, 
    "title": "Teach Online Courses: Complete Udemy Course Creation Guide - Unofficial", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "27.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124030_ad83_10.jpg", 
    "course_url": "https://www.udemy.com/teach-online-courses-complete-udemy-course-creation-guide-unofficial/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-23T01:08:31Z"
}