{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Please note: the price for this course will increase to $79 on Jan. 21, 2015.</strong>  </p>  <p style=\"\">  \t        Do you dream of seeing the world but have no way to finance it? Would you like to experience the adventure of a lifetime while making enough money to pay off your debt or build your savings? Do you speak the most in-demand language in the world…English? If the answer to these is yes, then a job teaching English as a Foreign Language is the key to getting your dreams off the ground at last!  </p>  <p style=\"\">  \t                    No, you don’t need to be a career English teacher or a grammar expert. In fact, the demand for native English speakers is so high that 100,000 EFL teaching positions will open all over the world this year…and there aren’t enough teachers to fill them!  </p>  <p style=\"\">  \t                    I&#039;ve taught in South Korea, Bolivia, and Lithuania, all without having TESOL/TEFL certification or a specialized degree in English as a Foreign Language. What I did was find opportunities and seize them...and it&#039;ll be even easier for you. This comprehensive 2 1/2-hour course includes a basic toolkit of international teaching job resources, lots of information on specific types of jobs in different countries, a guide to essential EFL terms and concepts, ideas for planning and delivering lessons, lots of sample lessons, handouts, activities and games, and occasional silliness. No quizzes, no homework – but be sure to pay careful attention to the videos and slideshows, take notes, bookmark websites, and get ready to take off on your journey into teaching abroad!  </p>  <ul style=\"\">  \t<li style=\"\">More than 500 million (some estimates approach 1 billion) non-native English speakers take some form of English class each year, including more than 100 million in China alone. </li>  \t<li style=\"\">Eighty percent of English teachers abroad in non-native English speaking countries – particularly in public schools – are not native English speakers themselves because there are simply not enough native English speaking teachers to meet demand.</li>  \t<li style=\"\">In both China and South Korea, approximately 1,000 new English teachers are hired each month. In China, this number will double in the coming years.</li>  \t<li style=\"\">In 2011, Turkey announced plans to recruit 40,000 foreign English teachers in the next five years.  </li>  \t<p style=\"\">  \t\t                    ·Because nearly half of all English teachers abroad will leave their position and return to their home country at the end of each year, this means more than 100,000 positions for English teachers abroad become available each year:  \t</p>  \t<p style=\"\">  \t\t                    All of this means that schools and language institutes are constantly facing a need to hire new teachers.  \t</p>  </ul>  <p style=\"\">  \t                    Now is your chance – whether you&#039;re just finishing school, looking for a mid-career change, or want the ultimate retirement experience. I&#039;ve met people of all ages and backgrounds who heeded the call to an international teaching and travel adventure. The one thing they all had in common was the courage, the creativity, and the caring to be excellent teachers. You can do it too.  </p>  <p style=\"\">  \t                    Go ahead and enroll NOW to make your dream of teaching, traveling, and earning a reality in 2015! You have a 30-day money-back guarantee...what have you got to lose?  </p>", 
    "end_date": null, 
    "title": "Teach English abroad without certification or experience!", 
    "price": "20.00", 
    "instructors": "Val Rendel", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334390_ff99_5.jpg", 
    "course_url": "https://www.udemy.com/teach-english-abroad-efl-teaching-for-anyone-anywhere/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T23:06:18Z"
}