{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">What if you could develop a &quot;toolkit&quot; virtually full of digital apps to check for student understanding and engage students? This course provides you with that very toolkit loaded with 19 FREE technology tools to check for student comprehension.<br style=\"\"></p><p style=\"\"><strong style=\"\">HERE&#039;S WHAT OTHERS ARE SAYING ABOUT THIS COURSE:</strong></p><p style=\"\"><em style=\"\">Lots of creative ideas, lots of possibilities presented in a succinct and efficient way. This course will save you a lot of time and get your creative juices going. --Ursula Nash</em><br style=\"\"></p><p style=\"\"><em style=\"\">The instructor is very organized , clear and straightforward.  </em><em style=\"\">I am waiting for your next course. --Ehabob</em><br style=\"\"></p><p style=\"\"><em style=\"\">This is an excellent course for any teacher looking for fun ways to engage students, check for understanding, and provide a variety of methods to help students discover and learn in the classroom. --Kathy Dungey<br style=\"\"></em></p><p style=\"\"><em style=\"\">This course is another example of Rita practicing what she preaches and giving the learner a hands on, step-by-step program that will ensure success. --Trish Evens</em></p><p style=\"\"><strong style=\"\">LATEST:  Updated September 2015 to include two more tech tools!</strong></p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li style=\"\">28 lectures and nearly 4 hours of content</li><li style=\"\">Technology tools to give all students (especially the shy ones) a voice in the classroom</li><li style=\"\">Polling tools</li><li style=\"\">Games to check for understanding</li><li style=\"\">Technology programs to see what students comprehend while watching videos</li><li style=\"\">Quiz Tools</li><li style=\"\">A &quot;task list&quot; to print out for each digital program to be used as a mini-tutorial</li></ul><strong style=\"\">Who is the target audience?</strong><ul style=\"\"><li style=\"\">Teachers, student teachers, and college instructors</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">As a veteran public school teacher for 34 years and my district&#039;s technology integration specialist, I&#039;ve learned what works and what doesn&#039;t work in the classroom. I&#039;ve also sought technology to engage students while at the same time checking comprehension levels. The free apps provided in this class are those I feel will best benefit any teacher in the classroom who wants to conduct formative assessment to help improve student learning,or for any student teacher who will be entering the field of education and wants to be prepared to analyze student data on day one. <strong style=\"\">Join us now.  Be part of the success and don&#039;t be left behind in this digital age! </strong></p><p style=\"\"><strong style=\"\"><em style=\"\">And, the unconditional Udemy 30 day money-back guarantee is also my promise that this course will provide you with awesome tools to engage your students and help them learn and succeed in your class.</em></strong></p>", 
    "end_date": null, 
    "title": "Teacher Tech Tips--Easily Boost Teacher & Student Success", 
    "price": "20.00", 
    "instructors": "Rita Phillips, Ed. M.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498036_f639_8.jpg", 
    "course_url": "https://www.udemy.com/tech-tools-4-the-21st-century-classroom/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-10T04:30:00Z"
}