{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Do you have access to Google Apps for Education?</strong></p><p style=\"\"><strong style=\"\">Are you tired of printing, collecting, and grading worksheets?</strong></p><p style=\"\"><strong style=\"\">Do you want to create dynamic lessons for your students that engage them in new ways?</strong></p><p style=\"\">Then this is the right course for you. This course is packed with simple to follow lessons that will show you how to use <strong style=\"\">Google Classroom</strong> like an expert.<strong style=\"\"> </strong></p><p style=\"\">With Google Classroom, teachers can create dynamic lessons that are student centered, collaborative, and memorable. Like you, I am a teacher that is trying to find ways to engage my students fully. I&#039;ve been teaching for the past <strong style=\"\">five years</strong> in online, blended, and bricks and mortar settings.</p><p style=\"\">Google Classroom provides an easy to use learning management system that students of all levels will be able to interact with. I&#039;ve taken the time to explore the ins and outs of Google Classroom and I&#039;ve identified the common pitfalls that come with using something new.</p><p style=\"\">By the end of this course you will be able to use Google Classroom like an pro and create engaging lessons for your students. With Google Classroom you will be able to teach your students at all times, weather they are in school or not.  </p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Teaching with Google Classroom", 
    "price": "20.00", 
    "instructors": "Nathan Nagele", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428492_3c40.jpg", 
    "course_url": "https://www.udemy.com/googleclassroom/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T15:02:42Z"
}