{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t       Are you a teacher who wants to better inspire and engage your students?  </p>  <p>  \t   Do you want your students to be excited about school and about learning?  </p>  <p>  \t       Do you want to engage your students through technology that speaks to them?  </p>  <p>  \t       Let me show you how the iPad can be used to inspire, engage and mentor your students.  </p>  <p>  \t       Specifically, you will discover:  </p>  <p>  \t<span></span><span>Why use iPads in education?</span>  </p>  <p>  \t<span></span><span>How to incorporate iPads into your daily lesson plans.</span>  </p>  <p>  \t<span></span><span>Which are the best iPad apps for the classroom?</span>  </p>  <p>  \t<span></span><span>How these iPad apps can positively affect learning    outcomes.</span>  </p>  <p>  \tScreencasting, App Smash, Augmented Reality, Flip Teaching and MORE!  </p>  <ul>  </ul>  <p>  \t       This iPad course is unique in that it not only highlights some of the best educational iPad apps available, but it also shows you how to implement the iPad into your classroom and how to use the iPad as a highly-effective teaching tool.<br>  \t<span>The iPad is quickly becoming the most innovative and exciting technology based teaching tool to come along in years. Many schools across the country have purchased iPads for their students however comprehensive and essential </span><strong>iPad training</strong><span> to properly utilize the full power of the iPad and its best educational apps is not available.<br>  \t<br>  \tProfessor </span><strong>Karina Barley</strong><span>, an expert in iPad use within the classroom, has a Master in Education specializing in Technology and Special Education. She has written over 20 courses on 21st Century Education, iPads in Education, and Autism Awareness, available to teachers in the United States, Australia and Singapore.<br>  \t<br>  \tShe will guide you through the benefits of using iPads in Education, how you can transform your classroom and enhance your teaching experience like never before. </span>  </p>  <p>  \t       Enroll today and receive Udemy&#039;s 30-day, satisfaction guarantee.  </p>", 
    "end_date": null, 
    "title": "Teach with the iPad - Inspire, Engage and Mentor with EdTech", 
    "price": "35.00", 
    "instructors": "Karina Barley - M.Ed.", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/89622_b259_14.jpg", 
    "course_url": "https://www.udemy.com/inspire-engage-and-mentor-your-students-with-ipad-and-ipad-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-08T06:45:16Z"
}