{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>LATEST: Course Last Updated 10th June 2016</p>\n\n<p>************************************************<br></p>\n\n<p>Become a better ESL English teacher so that you'll get more job satisfaction, teacher better lessons, earn promotions and make sure your students are getting the best learning experience ever!</p>\n\n<p>+++++++++++++++++++++++<br></p>\n\n<p>About this course:</p>\n\n<ul><li><em>No workbooks, CD's or anything else is required</em></li><li><em>Tons of satisfied students</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul>\n\n<p>+++++++++++++++++++++++</p>\n\n<p><strong>This course teaches new and veteran ESL teachers alike how to be the best at classroom management. Using the tips and tricks found in this course, you'll be able to have a class that respects what you are doing and love the teaching that you provide.</strong></p>\n\n<p>You'll also be able to react to negative situations that might arise in your classroom and nip them right in the bud before they even get started.</p>\n\n<p><strong>Interested in becoming a better ESL teacher? Read on!</strong></p>\n\n<p>As an ESL teacher, I've tried<strong> many methods and techniques throughout the years</strong> and now I can confidently say that I know what works and what doesn't. <strong>What will get you results and what will simply leave you spinning your wheels without knowing what to do.</strong></p>\n\n<p>In this course, I will give you the answers that you've been looking for when it comes to classroom management so that you can avoid the pitfalls and frustrations that all teachers, new and veterans, go through.</p>\n\n<p>This course is divided in a number of section, with multiple videos in each section. Although the main focus is on classroom management, there are also other sections relating specifically to student needs, learning styles, you as the teacher, etc. Have a look at the course curriculum below for more information.</p>\n\n<p><strong>The course is presented in easy to understand terminology and allows you, as the student, to take their knowledge of classroom management to the next level.<br></strong></p>\n\n<p>To watch the course videos, you will need roughly around two hours. However, as a student, you are encouraged to take an active role throughout the course, by taking down notes and more importantly, implementing what you learn in your day to day teaching.</p>\n\n<p><strong>If you believe that you are ready to take your English teaching to the next level, then this is the course for you. The content covered in the videos will ensure that you are able to go to the next level with your current teaching and improve in the areas where you are lacking.</strong></p>\n\n<p>If you're a <strong>passionate</strong> English teacher who just wants to make your <strong>students respond better</strong> to your teaching, this is the course for you. If you want to make your <strong>classes more fun</strong> and more engaging, this is the <strong>course for you.</strong></p>\n\n<p><strong>Click the \"Start Learning\" button to get started.</strong></p>\n\n<p>I'll speak to you on the inside.</p>\n\n<p>Kevin</p>", 
    "end_date": null, 
    "title": "The Kickass Guide To ESL Teaching", 
    "price": "20.00", 
    "instructors": "Kevin Farrugia", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733510_e191_2.jpg", 
    "course_url": "https://www.udemy.com/complete-classroom-control-become-a-better-esl-teacher/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T23:46:03Z"
}