{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<span class=\"Apple-style-span\" style=\"\">¿Te dedicas a la docencia? ¿Te manejas con la tecnología? ¿Sabes cómo utilizar las nuevas tecnologías para la docencia?</span>  </p>  <p style=\"\">  \t<span class=\"Apple-style-span\" style=\"\"><br style=\"\">  \t</span>  </p>  <p class=\"MsoNormal\" style=\"\">  \t       Las nuevas tecnologías de la información y comunicación pueden ser integradas en la enseñanza con diferentes propósitos y esto requiere cambiar paradigmas educativos tradicionales; formas de pensar y de actuar en la labor docente.  </p>  <p class=\"MsoNormal\" style=\"\">  \t<strong style=\"\"> </strong>  </p>  <p class=\"MsoNormal\" style=\"\">  \t       Sus posibilidades son grandes especialmente para el aprendizaje permanente, individualizado y autónomo, para rentabilizar la enseñanza, dar mayor flexibilidad en el aprendizaje, facilitar el acceso a variados recursos y métodospara el conocimiento y la enseñanza interactiva a distancia.  </p>  <p class=\"MsoNormal\" style=\"\">  </p>  <p class=\"MsoNormal\" style=\"\">  \t       La demanda derivada de las nuevas tecnologías de la enseñanza exige una redefinición de la figura docente. El concepto de docente como instructor del conocimiento se transforma en un concepto de experto en gestión deinformación sobre una materia determinada. Requiere actualizar su conocimiento sobre las tecnologías y como integrarlo en su labor pedagógica y docente.  </p>  <p class=\"MsoNormal\" style=\"\">  </p>  <p class=\"MsoNormal\" style=\"\">  \t       El propósito de este curso es acompañarte en tu aprendizaje sobre el desarrollo de habilidades para el uso de la tecnología en tu labor docente.  </p>  <p class=\"MsoNormal\" style=\"\">  </p>  <p class=\"MsoNormal\" style=\"\">  \t       El curso está estructurado en cuatro módulos con más de 3  horas de vídeo-grabación y además tienes disponible el contenido del curso en formato PDF.  </p>  <!--EndFragment-->", 
    "end_date": null, 
    "title": "TIC para la enseñanza", 
    "price": "20.00", 
    "instructors": "Julia García Escudero", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230566_16fa_3.jpg", 
    "course_url": "https://www.udemy.com/tic-para-la-ensenanza/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T08:11:03Z"
}