{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Why should you take this course?</strong>  </p>  <p style=\"\">  \tShow credibility, build rapport, make things easy to understand and answer questions with a room full of 100 or more...This 1 hour program addresses the difficulties associated with facilitating a very large group or presenting to a vast audience.  You&#039;ve already learned how to show credibility, build rapport, make things easy to understand, and answer questions, but how can you do these things with a room full of 100 or even 500 participants?  There are specific strategies to do it successfully and you&#039;ll find them all right here.  </p>  <p style=\"\">  \tOur experience has taught us that successful communication is very different when the audience is big.  We&#039;ve done it hundreds of times so we know exactly what you need to do differently to effectively engage and motivate audiences of any size, and we can leverage this experience to help you get results.  </p>  <p style=\"\">  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p style=\"\">  \t“It&#039;s so simple and never taught.  College teaches all the wacked out, in depth theory and pedagogy without giving presenters the simple steps of what to do, that&#039;s the brilliance of these classes.  A lot of us know the why, now we get to know the how.  The theory that you teach is practical and effective.  Learning through college teaches a lot of high level information and assumes the basics (or the basics are not thought to be needed because college is taught by experts not by teachers). These classes give those basics that, though many of them may be getting done, they are brought to consciousness to do them effectively, consistently, and across all areas.&quot;  </p>  <p style=\"\">  \t<strong style=\"\">- Christopher Chalhoub</strong> - Corporate Trainer  </p>  <p style=\"\">  \t“Jason is a master at understanding people.  What has been interesting to me is that Jason uses his own techniques to “rule the room&quot; when he is teaching you how to rule the room. It&#039;s a sight to behold!  Every time I was in a room with Jason, whether he was presenting or it was just a meeting, he always was able to grab people&#039;s attention immediately and make you feel like it was the most worthwhile time you have ever spent.&quot;  </p>  <p style=\"\">  \t<strong style=\"\">- Jeremy Wright</strong> - Project Manager  </p>  <p style=\"\">  \t&quot;Jason&#039;s techniques break down speaking fundamentals that can make anyone a more powerful and relatable speaker. His tips have revolutionized my presentations at large conferences, and internally to PerBlue employees.&quot;  </p>  <p style=\"\">  \t<strong style=\"\">- Justin Beck</strong> - CEO - PerBlue  </p>", 
    "end_date": null, 
    "title": "Train the Trainer Plus: Train Large Classes", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251704_7e03_5.jpg", 
    "course_url": "https://www.udemy.com/train-large-classes-keep-100-students-listening-learning/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-27T17:47:13Z"
}