{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<span class=\"Apple-style-span\"><strong style=\"\">Why should you take this course?</strong></span>  </p>    <p>  \tImmediately implement these techniques and instantly see the profound impact they have on your audience.  Instantly learn how to train, teach or facilitate any short class. In this 4 hour program you will see Jason model exactly how to show confidence, build rapport, motivate and teach adult learners, and feel comfortable doing it.  </p>  <p>  \t<strong style=\"\"> Bonus: </strong>This course includes a 65 page workbook and a learning styles assessment.  <span class=\"Apple-style-span\"></span><span class=\"Apple-style-span\"></span>  </p>  <p>  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p>  \t&quot;I think this program is something you&#039;re going to want to look into. I&#039;ve been blown away by it…Rule the Room identifies some needs in Education that are being very much neglected by instructors who are very well intentioned, who desperately want their students to learn, but they just don&#039;t know what they&#039;re missing and I&#039;ve been one of these instructors.&quot;  </p>  <p>  \t<strong style=\"\">- Paul Olson</strong>-  <em style=\"\">University of Michigan TA</em>  </p>  <p>  \t“This is one of the best classes I have taken – it focuses on simple concepts that are crucial to engagement and retention of material.  The class focused on a variety of presentation techniques for conveying messages clearly to a broad spectrum of learners.&quot;  </p>  <p>  \t<strong style=\"\">- Rachel Lawson </strong>- <em style=\"\">Corporate Trainer and Project Manager</em>  </p>  <p>  \t“Jason helped me to realize that The Golden Rule cannot clumsily be applied to teaching. If I teach others the exact way that I want to be taught, it could very well be that only a quarter of my students get what I&#039;m trying to say!  Jason explains the scientific reasoning behind each of his techniques. This has made it easy for me to adapt his suggestions over time to meet the unique needs of my students, according to the subject material.&quot;  </p>  <p>  \t<strong style=\"\">- Ben Llewellyn</strong>- <em style=\"\">Quality Assurance Trainer</em>  </p>", 
    "end_date": null, 
    "title": "Train the Trainer 101: For Beginners Only!", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137216_9f38_20.jpg", 
    "course_url": "https://www.udemy.com/an-accelerated-guide-to-adult-learning-for-trainers/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-23T19:47:55Z"
}