{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p style=\"\">  \t<strong style=\"\"><em style=\"\">BOOM!</em></strong>  </p>  <p style=\"\">  \t              That's the impression you want your Udemy course landing pages to give.  </p>  <p style=\"\">  \t<em style=\"\">Knowing </em>that and <em style=\"\">doing </em>that are two different things!  </p>  <p style=\"\">  \t              Developed by a linguist/communication scientist specifically for Udemy instructors, this course takes you through the steps of constructing Udemy landing pages that impact and compel. We discuss each section of the landing page individually, with insights and tips to make every section strong and impactful. From writing bios and titles to offering free lecture previews, this course answers some questions we all have when developing these sections. Transform your landing page with clear direction from a seasoned university instructor in language and communication.  </p>  <p style=\"\">  \t<strong style=\"\">CONTENTS</strong>  </p>  <p style=\"\">  \t              Udemy landing pages require a unique set of skills: good writing, good pedagogy, and good structure. Because of the multiple skills required, constructing quality landing pages is a challenge for most people, since most people don't possess this sort of background. I do!.  </p>  <p style=\"\">  \t          This course covers all of the above areas. The course offers a unique set of skills training, specific to the Udemy landing page. It discusses some rhetorical theory and demonstrates with some examples. The course includes:  </p>  <p style=\"\">  \t              - Tips for strengthening your writing, drawn from linguistic theory and top writing books.  </p>  <p style=\"\">  \t              - Pedagogical tools, and use of your landing page as a peek to the pedagogical instrument (your course).  </p>  <p style=\"\">  \t              - Tips for creating a solid course structure that will make your course more complete and more effective.  </p>  <p style=\"\">  \t              - Samples from real courses (with permission). These are worked through as part of most lectures, so you can hear commentary on actual landing pages and see how landing pages transform with a few simple tips. Before-and-after samples are also provided as separate files, with changes marked.  </p>  <p style=\"\">  \t<strong style=\"\">Step by step</strong>  </p>  <p style=\"\">  \t              Individual lectures target each specific component of the landing page, as you'll see by glancing at the curriculum below. Tips are supported by rhetorical theory and working examples where relevant.  </p>  <p style=\"\">  \t              Regular quizzes test your ability to apply what you've learned.  </p>  <p style=\"\">  \t<strong style=\"\">Enroll today!</strong>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Special introductory price</strong></em>! Start improving your landing pages, and watch your course enrollments soar!  </p>", 
    "end_date": null, 
    "title": "Udemy Landing Pages to Impact and Compel - Unofficial", 
    "price": "20.00", 
    "instructors": "Dr. Michele Poff", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366696_bb07_5.jpg", 
    "course_url": "https://www.udemy.com/unofficial-udemy-landing-pages-to-impact-and-compel/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T16:01:15Z"
}