{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong><em></em></strong></p><p>This Course is not sponsored by or affiliated with Udemy, Inc.</p>\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p><strong><em>This is THE Course every Student and Instructor on Udemy must have!</em></strong></p>\n\n<p>Are you a Student struggling to find the best course to solve your pain or problem?</p>\n\n<p>Are you an Instructor trying to create really engaging and competitive courses?</p>\n\n<p><strong>How can you quickly and easily find the best Courses?</strong></p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>A quick word on Pricing - I have deliberately priced this course very low to make this information available and accessible to as many people as possible.  Please tell your friends about this course!</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>The main drawback with traditional search methods is that the results are dependant on and skewed by:</p>\n\n<ul><li>Search Algorithms</li><li>Search Engine Optimisation variations between courses</li><li>And <strong>FUNDAMENTALLY</strong> - Knowing what to search for!</li></ul>\n\n<p><strong>How can you in put a search term if you do not know exactly what you are looking for????</strong></p>\n\n<p>There has to be a better way!</p>\n\n<p>There is - that is exactly why I created this course, probably the most difficult course I have made to date!</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><strong>The KEY is the VISOKIO OMNISCOPE </strong>which you can download for free as I have created all the data files in the right format for you to analyse and research.</p>\n\n<p>I have identified over 18,000 courses in the Udemy Market Place which I provide for your analysis.  This is not a complete list, as I have not hacked the Udemy site, but is a strong representation of the courses available</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p>Now you can look at the whole Udemy Market Place on one page and drill down to find what you are looking for!  Its not difficult</p>\n\n<p>In this Course you will discover:</p>\n\n<ul><li>Why Holistic Search beats more traditional approaches</li><li>The dangers of unconscious incompetence</li><li>How Students can benefit from the course</li><li>How Instructors can benefit from the course</li><li>What Data is included in the Data Set</li><li>How to download the Visokio Viewer from Visokio's website</li><li>How to open it and load the data file</li><li>A full tutorial on the Omniscope Viewer (complements of Visokio themselves)</li><li>How to search in the Omniscope Viewer</li><li>How to explore Udemy Categories</li><li>The Top 100 Udemy Instructors, by various criteria</li><li>The Top 100 Udemy Courses, by various criteria</li></ul>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><strong>What Jerry Banfield, Leading Udemy Instructor has to say about this Course!</strong></p>\n\n<p><strong>\"Very effective for learning more about Udemy in just a few minutes</strong></p>\n\n<p><em>If you want to learn more about the Udemy marketplace and love data visualizations, you might have the same experience I did here. I figured I could give this course at least 15 minutes today to skim through and see what John came up with. In just 15 minutes I learned a lot about Udemy I did not know such as what courses are the top and I discovered a lot of instructors I had never heard of that have top courses on Udemy. In just a few minutes this course was helpful for me in motivating me to continue working on Udemy and learning more about what works to get students and grow here. Thank you John! There is a TON of depth here in the course if you go through and download the program and data sets on John offers. I may give this a shot when I am done filming my lectures!\"</em>  <strong>5 Stars</strong></p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><strong>This course is very hands on!  I show you how to use the Omniscope - an amazing piece of data visualisation software - and provide you with the data files so that you can do your own analysis!</strong></p>\n\n<p><strong><em>The VISOKIO OMNISCOPE is the Differentiator</em></strong></p>\n\n<p>You will not find another course like this anywhere in Udemy!</p>\n\n<ul><li><strong>How are you going to use this information?</strong></li><li><strong>To improve your course selection?</strong></li><li><strong>To find new courses, topics and instructors?</strong></li><li><strong>Or perhaps you are an instructor, looking for new Topic areas to create courses in!</strong></li></ul>\n\n<p><strong>Information is Power -</strong> I have handed you the information - use it wisely!</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><em><strong>Disclaimer:</strong> The Data Set in this Course does not contain every course on Udemy!  I have done my best (and continue to do so) to compile a data set of as many Udemy Courses as I have been able to.  There are over 18,000 courses in the data set as I launch and I hope to increase this number over the coming weeks!</em></p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><strong>So, what are you waiting for!</strong></p>\n\n<p><strong>Discover Courses and Instructors in a way you never have before!  Enrol Today!</strong></p>\n\n<p><em>(Don't forget the 30 Day Money Back Guarantee!  You really have nothing to lose and everything to gain!)</em></p>\n\n<p><strong>See you in the Course!</strong></p>\n\n<p><strong>best regards</strong></p>\n\n<p><strong>John</strong></p>", 
    "end_date": null, 
    "title": "Udemy Course Directory - Discover Courses Fast - Unofficial", 
    "price": "20.00", 
    "instructors": "John Colley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661840_12a9.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-directory/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T08:07:13Z"
}