{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><strong>Udemy Course Creation</strong></p>\n\n<p>Udemy course creation for those that want to create high quality in depth courses that deliver value to their students and teach online successfully.</p>\n\n<p><strong>Make Money Selling Your Expertise</strong></p>\n\n<p>  \t                                          Do you have expertise locked up in your brain that you think other people would be interested in?  </p>\n\n<p>  \t                                          Do you want to reach a wider audience?  </p>\n\n<p>  \t                                          Do you want to earn residual income from your expertise, income that continually works for you with only minimal effort on your part?  </p>\n\n<p>  \t                                          Then video training could be the very thing you have been looking for, a way to share your expertise to a wide audience and get paid for it again and again, whilst you are spending time with your family, enjoying your hobbies and even sleeping!  </p>\n\n<p>  \t                                          A video training course income never stops working for you.  </p>\n\n<blockquote>  \t<em class=\"redactor-inline-converted\">Do not go blindly into your course.  \t  \t                                            Mark makes good points in making a professional looking course on the thrift side. Save time and money by learning the tricks of the trade first. Making an online course requires preparation, planning, and proper tools.   \t  \t                                         ~ April Alunsina Pagaling     </em>  </blockquote>\n\n<p>  \t<strong>Plan / Construct / Launch / Market Your Udemy Course</strong>  </p>\n\n<p>  \t              We will guide you through how to plan, launch and market your course with inside tips and techniques that will enable you to shorten your learning curve.  </p>\n\n<p>  \t<strong>Differentiate Yourself With Quality Presentations</strong>  </p>\n\n<p>  \t                                      The online learning market is growing at an exponential rate, this means lots of opportunity, but also lots of competition in each sector.  </p>\n\n<p>  \t                                      To succeed in this new era of online training, your courses have to be powerful and professionally presented.  </p>\n\n<p>  \t                                      A media rich presentation, with slideshows, screenshares, talking heads and green screen technology will be much more powerful than a screen share video with audio.  </p>\n\n<p>  \t                                      Students want to engage with their instructors and this course will show you how to create media rich presentations that give that personal touch so that students come back for more courses.  </p>\n\n<p>  \t<strong>Create Udemy Training Courses On A Budget</strong>  </p>\n\n<p>  \t                                          Video production can be expensive and time consuming to learn.  </p>\n\n<p>  \t                                          But what if you could produce video content on a low budget?  </p>\n\n<p>  \t                                          Creating high quality video training courses with the simple low budget set up that we teach you is now possible.  </p>\n\n<p>  \t                                          This course will give you all the information you need to get going.  </p>\n\n<p>  \t<strong>Your Creativity</strong>  </p>\n\n<p>  \t                                                    Being creative when technology is getting in the way can be very difficult, with this course, all the technical aspects of filming a presentation have been simplified so you have enough knowledge to actually get on with filming your course.  </p>\n\n<p>  \t                                                    The powerful techniques and tools detailed in the course will enable you to create highly engaging course material and content that will help promote the value of your course and your expertise.  </p>\n\n<p>  \t<strong>Making Sales With Your Udemy Course</strong></p>\n\n<p>  \t          We will take you through the process of creating social proof for your course and how to set up a sales funnel to maximise your profits.  </p>\n\n<p>  \t<strong>Who Is This Course Suitable For?</strong>  </p>\n\n<p>  \t                                                    This course is suitable for trainers, teachers and coaches who want to create quality video productions on a low budget and want an introduction to video production.  </p>\n\n<p>  \t                                                    No background in video production is required, just the desire to learn and the ability to follow simple instructions.  </p>\n\n<p>  \t<strong>What You Will Learn</strong>  </p>\n\n<ul>  \t<li>How to plan a Udemy course</li>  \t<li>How to launch your Udemy course</li>  \t<li>How to market your Udemy course</li>  \t<li>How to set up a sales funnel outside of Udemy</li>  \t<li>Getting the sale</li>  \t<li>Course copywriting</li>  \t<li>How to light a subject</li>  \t<li>How to light a green screen backdrop</li>  \t<li>Basic audio set up</li>  \t<li>Hardware choice</li>  \t<li>Camera choice</li>  \t<li>Camera position and composition</li>  \t<li>Creating green screen video presentations</li>  \t<li>How to build a presentation using xsplit</li>  \t<li>How to incorporate screenshares into your live production</li>  \t<li>How to incorporate slideshows into your live production</li>  \t<li>How to incorporate picture in picture video</li>  \t<li>How to add scrolling text</li>  </ul>\n\n<p>  \t<strong>What Equipment Will You Need?</strong>  </p>\n\n<p>  \t                                                    You will need basic video and audio equipment.  </p>\n\n<p>  \t                                          The course we have created is as budget conscious as possible whilst maintaining certain quality levels and the recommended equipment is optional depending on whether you use XSplit or not (which is not essential - just recommended).  </p>\n\n<p>  \t                                                    Equipment Includes:  </p>\n\n<ul>  \t<li>A PC with a modern processor, 8gb ram and silent fans</li>  \t<li>You will also need a modern graphics card that supports 2 to 3 monitors</li>  \t<li>A camera, either a webcam, camcorder or DSLR</li>  \t<li>You will also need a video capture card if you are using camcorders or a DSLR</li>  \t<li>External microphone</li>  \t<li>Green screen backdrop</li>  \t<li>5 or 6 low cost continuous video lights</li>  \t<li>Low cost sound proofing (blankets etc)</li>  \t<li>Xsplit software</li>  </ul>\n\n<p>  \t<strong>The Course</strong>  </p>\n\n<p>  \t                                                    Creating a video course can be a complex expensive task, with this course you will learn how to compose a talking heads video, change your background dynamically, whilst recording, with green screen technology, add powerpoint presentations into your background whilst filming as well as other cutting edge techniques like screen capture, picture in picture video, scrolling text, and how to add animation sequences to the beginning of your videos.  </p>\n\n<p>  \t                                                    You will learn the basics of setting up Xsplit, the software used in this course and how to use it to create powerful video content that will engage students.  </p>\n\n<p>  \t<strong>What Is Not Included In The Course</strong>  </p>\n\n<p>  \t                                                    Video editing is not included in the course, this course shows you how to capture the video, audio and presentations and how to mix all the elements live, you will still need to edit footage after filming, which is beyond the scope of this course.  </p>\n\n<p>  \t<strong>Questions This Course Answers:</strong>  </p>\n\n<ul>  \t<li>How do I create a Udemy video course</li>  \t<li>How do I build a video course</li>  \t<li>How do I film a video course</li>  \t<li>How do I plan a video course</li>  </ul>", 
    "end_date": null, 
    "title": "Udemy - Udemy Professional Course Creation - Unofficial", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350812_0375_10.jpg", 
    "course_url": "https://www.udemy.com/unofficial-udemy-professional-course-creation/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T12:40:18Z"
}