{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.\n</p>\n\n<p><strong class=\"redactor-inline-converted\">&gt;&gt;&gt; The #1 Udemy SEO course, anywhere on the web. Contains regular educational announcements with SEO tips and notifying new changes to Udemy's search. &lt;&lt;&lt;</strong></p>\n\n\n\n\n\n<p>Course up to date as of JUNE 2016 including the latest search algorithm changes!!! New video added APR 2016. <strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">EIGHTY-FOUR REVIEWS, 5.0 STARS AVERAGE on only 400 STUDENTS!!! THANK YOU!!!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Alan K says, \"...<em>my course moved up the ranking ... from page two to page one within two hours .... thanks Scott</em>\"</p>\n\n\n\n\n\n\n\n\n\n<p>Tobi A says, \"<em>This is the best course I have taken on Udemy</em>\"</p>\n\n\n\n\n\n\n\n\n\n<p>Jack W says, \"<em>...started seeing results overnight</em>\" </p>\n\n\n\n\n\n\n\n\n\n<p>Jonas S says, \"<em>Essential for every Udemy instructor</em>\"</p>\n\n\n\n\n\n\n\n\n\n<p>SEO on Udemy is somewhat mysterious, as there are no step-by-step guides that exist that tell you exactly how to choose your title, subtitle, and what exactly to say in your description. Udemy is at it's heart a search engine running on top of a marketplace, and so Udemy HAS to have a way of ranking in the order that makes the most sense for what the student is searching for at the time. SEO absolutely can work on Udemy, you just need to know a few things about how Udemy search works.</p>\n\n\n\n\n\n\n\n\n\n<p>  \t         There are not many sources to explain how Udemy search works, and not much research into Udemy SEO. Udemy themselves do not explain how search works. But we can derive some SEO conclusions, both from what we see when we do searches, and from experience working behind the scenes with other search engines.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t         Knowing Google SEO will only help a little. Udemy search engine is not as sophisticated as Google. And there are very limited ways we can modify our course. </p>\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">What you will learn:</strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t           • How Udemy search works  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t           • Difference between Google search and Udemy search  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t           • How to decide what keywords to target  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t           • Competitive analysis </p>\n\n\n\n\n\n\n\n\n\n<p>  \t           • How to get ranked in Udemy search using SEO  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t           • How to get ranked in Google search using SEO  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t           • Testing SEO changes  </p>\n\n\n\n\n\n\n\n\n\n<p>• Advanced Udemy SEO -- new lectures just added!!!</p>\n\n\n\n\n\n\n\n\n\n<p>• Tons of bonus lectures, and new ones added every month</p>\n\n\n\n\n\n\n\n\n\n<p>I have helped dozens of Udemy instructors move their courses up from page 8, 4, or 2 of search on to page 1. And I can help you too. <strong class=\"redactor-inline-converted\">These steps for improving your Udemy search result are tested, proven, and easy to implement.</strong> And the course is presented clearly and is easy to follow. I even give you a <strong class=\"redactor-inline-converted\">FREE downloadable Udemy SEO PDF cheat sheet</strong> of all the tips. Print it out, keep it by your desk, and implement the tips on that sheet. </p>\n\n\n\n\n\n\n\n\n\n<p>You will make your money back from the price of this course. Udemy guarantees it with their no-risk 30 day money back guarantee, but more importantly, I guarantee it. If your course is not on page 1 of your desired search keyword and you buy my course and implement my suggestions, <strong class=\"redactor-inline-converted\">you will move up in the search rankings, or I will personally help you do that</strong>. </p>\n\n\n\n\n\n\n\n\n\n<p>As well, I will keep this course up-to-date with the latest from Udemy even if they change their algorithm. This is your long-term resource for this information. With over sixty five-star reviews, this course contains proven material for improving your search result. And with only 400 students in the course, the information actually fairly exclusive. </p>\n\n\n\n\n\n\n\n\n\n<p>You really have nothing to lose.</p>\n\n\n\n\n\n\n\n\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.<br></p>", 
    "end_date": null, 
    "title": "Udemy SEO: Winning the Udemy Search Engine - Unofficial", 
    "price": "30.00", 
    "instructors": "Scott Duffy", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418882_f1e7_7.jpg", 
    "course_url": "https://www.udemy.com/seo-udemy-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T01:54:15Z"
}