{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p><span></span></p><ul><li>Over <strong>3500 happy students</strong> enrolled in my courses</li><li>Currently <strong>103 out of 124 4- and 5-star reviews</strong></li><li>No risk involved. Watch the <strong>PREVIEW VIDEOS</strong>!</li></ul>\n\n<hr>\n\n\n\n<p><strong>Do you say these things to yourself:</strong></p>\n\n\n\n<ul><li>I hate being in front of the camera, but I know that to be successful online, I've got to learn how to do it!</li><li>When I press the record button on the camera, it's like my confidence instantly drains right out of me</li><li>Why doesn't my mouth and brain don't work properly when I'm in front of the camera - it's unbelievably frustrating!</li><li>I'm a professional teacher/presenter and I can't believe how difficult of a time I have recording a simple video</li><li>I'm tired of nonsense advice like: 'just be yourself', and 'think of the camera as your friend' - <em>it doesn't work!</em><em></em></li><li>I'm tired of spending hours/days writing scripts for videos where I sound like I'm reading a book and look stiffer than a board on camera</li><li>How can I record high-quality videos quickly?</li><li>How do other people record great videos with so little effort - how can I be like them?!?</li><li>I want to create great videos - <em>HELP!!!</em></li></ul>\n\n\n\n<p>If you've said any of these things to yourself in the past week, you're going to love this course!</p>\n\n\n\n<p>Not only does it answer all these questions (and more), but the course is delivered to you in a energetic, simple, and fun way (<strong>check out the preview videos</strong>).<br></p>\n\n<hr>\n\n\n\n<p><strong>So...what makes this course so unique?</strong></p>\n\n\n\n<ul><li>My relentless focus on delivering high-quality content within the course</li><li>The high value of the ideas</li><li>The unique and engaging way lessons are presented</li><li>How practical and usable the ideas are that I teach you</li><li>The transformation you'll see in yourself</li><li>The transformation others will see in you</li></ul>\n\n\n\n<hr>\n\n\n\n<p><strong>This course is for you if you:</strong></p>\n\n\n\n<ul><li>Want to quickly create amazing talking-head videos for your students, listeners, and fans!</li><li>Have very little time to watch boring, complicated lessons</li><li>Tired of ideas that are really nothing more then weak, boring cliche's that are largely worthless nonsense ('be yourself', 'love the camera', 'let go of your fear', etc.)</li><li>Enjoy video training over book-learnin'</li><li>Want actionable, practical strategies and tools that you can use right now - today</li><li>Think visual guides for the course content is cool and useful for reference later</li><li>Like having some fun while you learn</li></ul>\n\n\n\n<p>Scan the lessons below, and <strong>be sure to watch some of the FREE preview videos</strong> to see for yourself that what I just said is true!</p>\n\n\n\n<hr>\n\n\n\n<p>After you're done watching the free preview videos (and your brain has adjusted to how awesome it feels), then follow these steps:</p>\n\n\n\n<ol><li>Join the course</li><li>Watch <em>all</em> the videos</li><li>Download <em>all</em> the included guides (I call these LifeMaps)</li><li>Put what you learn into action</li><li>Come back and let me know what you think - if you like what you've learned, leave a lovely (that means nice) review, if not, get a lovely refund (you have a full 30 days to do this)</li></ol>\n\n\n\n<hr>\n\n\n\n<p>Be amazing!</p>\n\n\n\n<p>Derek</p>", 
    "end_date": null, 
    "title": "Udemy: How To Create Great Talking Head Videos - Unofficial", 
    "price": 0, 
    "instructors": "Derek Franklin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570422_3c4f_4.jpg", 
    "course_url": "https://www.udemy.com/udemy-how-to-create-great-talking-head-videos/", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T19:59:32Z"
}