{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>Learn how to create amazing courses on Udemy by using the seven simple steps to Udemy success.  Don't put off being successful on Udemy any longer, <strong>Enroll Now!</strong>  <em>Course Creation -  February 4, 2016</em></p><p>Over <strong>1,500 students </strong>enrolled!</p><p><strong>Understand the Seven Simple Steps Needed to Produce Effective Courses on Udemy.</strong></p><ul><li>Learn the most effective ways to create your title</li><li>Learn the most effective methods to create your subtitle and course summary</li><li>Learn the how to shoot video in order to create content for your course</li><li>Learn how to shoot a great promo video</li></ul><p><strong><br></strong></p><p><strong>Content and Overview</strong><br></p><p>This crash course will teach you the Seven Simple Steps to Udemy Success! It all starts with your title, subtitle, and course summary.  From there, you'll discover ways to shoot better video and to enhance the visual aspect of your course.  </p><p>It's a unique course in that you will learn how to use the Udemy Studio to your advantage.  It goes hand in hand with learning the best way to price your course and the best way to interact with your students.<br></p><p>After that, you will learn how to effectively use previews and thumbnails in order to drive sales.  All in all, you'll understand how to have success on Udemy!</p><p><br></p><p><strong>By the End of the Course You Will Be Able To:</strong><span></span></p><ul><li>Create strong, effective titles and subtitles</li><li>Produce quality video for any subject type</li><li>Use the Udemy Studio for maximum advantage</li><li>Price your course for highest earning potential</li></ul>", 
    "end_date": null, 
    "title": "Udemy: Unofficial Udemy Crash Course 2 Udemy Course Creation", 
    "price": "25.00", 
    "instructors": "Pippin Jag", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750550_ff93_4.jpg", 
    "course_url": "https://www.udemy.com/udemy-seven-simple-steps-to-udemy-success/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T21:49:02Z"
}