{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n\n==========================================================================<p></p><p><strong>Udemy Insights: New lecture added 10 of August 2015!</strong></p><p><strong>==========================================================================</strong></p><p><strong>Important for all (potential) Udemy Course Instructors</strong></p><p>You are looking at this course and asking yourself should I invest in this course yes or no? Let me answer that question for you, right away! This course is worth 6 months of your time. The lessons learned in here took me at least 6 month to realize. </p><p><strong>Is $27 too much for 6 month of time saving tips? </strong></p><p>Perhaps you might say, well this course is short! Well, yes, I love giving you the same information in a far more fluffy way but no! I realize if I can learn something in 5 seconds I would rather get that than offering the same information in a useless \"thicker\" way. </p><p>And besides, if you think like that, you really must watch this course, as this will address those points with insights! You will love it! </p><p>Are you really serious in your Udemy carrier? Well, if so perhaps you should start to invest in essential knowledge! This course will give you a far better foundation. Don`t believe me? Well, you be the judge! You can watch a lecture for free, and see yourself! </p><p>==========================================================================</p><p><strong>BONUS: Inspiring highly interesting Udemology Insiders Newsletter</strong></p><p>==========================================================================</p><p>In this course I decided to give you an additional bonus when you join! Every course needs a steady flow of fresh information! This is why I dedicate a weekly Udemology Insiders Newsletter. This newsletter is designed to help potential course instructors with new insights and understandings. </p><p>Every week (max 4 a month) you will receive a value packed insiders newsletter. You will understand things that you really should know! You will learn Udemy insiders terms such as: </p><ol><li>URP</li><li>Expect the expected</li><li>Paradox of the course buying process</li><li>The real definition of Engagement</li><li>Secrets of getting more ratings</li><li>The definition of great a reat course </li><li>and alot more! </li><li>95 / 5 rule of course watching</li></ol><p>==========================================================================</p><p><strong>Udemy Insights: I wish I knew this before I started on Udemy!</strong></p><p>==========================================================================</p><p>This course is Udemy course designed for (potential) course instructors. This course gives you special insights and ideas that are important and help you set your course apart from the others. </p><p>Too many Udemy course instructors struggle and still have questions even before they start out on Udemy. However, the real question of a course instructor is not how to create a great course but what to do after the course is done. </p><p>==========================================================================</p><p><strong>What to do after the course has been published!</strong></p><p>==========================================================================</p><p>This course gives you 5 insights at the moment. Yes only five insights but they cost me a ton of time to realize. Many of these things are all from my personal experience and understanding all those mistakes I made and perhaps many others did as well. </p><p>Learning this will help you to understand Udemy better and shapes your mind with a new mindset! Why am I saying this? Well, working on Udemy and truly enjoying and having success requires a specific way of thinking. I know because I made this mistake myself. </p><p>==========================================================================</p><p><strong>What will I be able to do at the end of this course?</strong></p><p>==========================================================================</p><p>At the end of this course you will start to realize more what you are doing. Being aware is the first step of the journey. You want to understand what you are doing and how the improve your course in new manners. </p><p>Every question gives you alot of insights and tells you what you can do to improve your position to stand out of the crowd. With over 20 thousand courses this will be important. How to get picked and how to get your students come back everytime.</p><p>==========================================================================</p><p><strong>Is this course for me?</strong> </p><p>==========================================================================</p><p>If you are a Udemy course instructor this course is really meant for you! If you are pondering to start on Udemy (I truly hope you do!) than this course is for you. Udemy is wonderful and this here are some insightful tips for every course instructor! </p><p>==========================================================================</p><p><strong>Take this course right now!</strong></p><p>==========================================================================</p>", 
    "end_date": null, 
    "title": "Udemy Insights: Get Your Course to Work for You - Unofficial", 
    "price": "20.00", 
    "instructors": "Nicky Wong", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527362_d482_2.jpg", 
    "course_url": "https://www.udemy.com/unofficial-udemy-insights-get-your-course-to-work-for-you/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T11:34:13Z"
}