{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.<br></p>\n\n<p>  \t<strong>Want to Make $10,000 Or More per Year Authoring Udemy Courses?</strong>  </p>  <p>  \t                      The udemy team recently announced that 1/4 of its instructors make more than $10,000 per year selling their Udemy courses online. More than $10,000.  That's a lot of passive income to simply watch pass you by without acting. Maybe it's time you considered taking your piece of the pie.  </p>    <ul><li><strong>5+ Hours of High Quality Online Video Training!</strong></li><li><strong>Over 6600 Students Currently Enrolled!!</strong></li><li><strong>57 x ***** 5 Star ***** Reviews!!!</strong></li></ul><p><strong></strong></p><p><strong></strong></p>    <p>  \t<strong>Learn What it Takes to Produce and Sell a Udemy Course</strong>  </p>  <p>  \t                      This course explains how to create Udemy courses using PowerPoint and the Camtasia Screen Recorder and Video Editing software. It includes everything you need to know to create stunning screencast based presentations on your Windows based PC. The course concludes with information on pricing and marketing your course that will set you well on the path to becoming one of the Udemy $10,000+/yr elite.  </p>    <p>  \t<strong><em>Good instructor</em></strong>   \t<em>Brian is a good instructor. He explains things well and for that I learned a lot of things easily. I'll be a future Udemy instructor and this course is definitely helps. Thank you Brian.</em>   \t<em>---Joni Esteban (<strong>5 Stars</strong>)</em>  </p>    <p>  \t<strong>Learn PowerPoint Slide Animation</strong>  </p>  <p>  \t                      Rather than using PowerPoint to produce bland presentation slides, this course will show you how to animate PowerPoint slides to produce stunning production and course logo videos and show you simple ways to add movement to your slide presentations to maintain your audience's attention.  </p>  <p>  \t                      In this course you'll learn to use PowerPoint to:  </p>  <ul>  \t<li>Create a course image</li>  \t<li>Animate production logos</li>  \t<li>Animate course logos</li>  \t<li>Animate lecture slides</li>  </ul>  <p>  \t                      Learn to add exciting PowerPoint presentations to your Udemy lectures.  </p>    <p>  \t<strong><em>Fantastic course!</em></strong>   \t<em> If you are trying to learn how to publish on Udemy, this is a great course! I learned more about using Camtasia and publishing on Udemy than I have with all the other information I have found! Really good stuff! Highly recommend!</em>   \t<em> ---Josh Gwin, MBA (<strong>5 Stars</strong>)</em>  </p>    <p>  \t<strong>Learn Camtasia Studio Screencasting</strong>  </p>  <p>  \t                      Camtasia Studio is the premiere Windows PC based screen capture and video editing tool. In this course I'll show you the ins and outs of Camtasia Studio recording and walk you through the video production process from beginning to end. From video recording through editing tasks such as deleting unwanted scenes, zooming and panning, and adding callouts -- it's all here.  </p>  <p>  \t                      In this course you'll learn to use the Camtasia video recorder and editor to:  </p>  <ul>  \t<li>Capture screencasts</li>  \t<li>Capture PowerPoint presentations</li>  \t<li>Edit your videos and merge media</li>  \t<li>Zoom, pan, and annotate your videos</li>  \t<li>Produce your course lectures for upload to Udemy</li>  </ul>  <p>  \t                      Learn everything you need to know to become proficient with Camtasia Studio.  </p>  <p>  \t                      But wait, there's more...  </p>    <p>  \t<strong><em>This course is excellent.   \t</em></strong><em>This course is well organised, clearly presented, and provides step-by-step instructions on the do's and don't of how to successfully create a Udemy course. It answered a lot of the questions I had and alerted me to other important considerations. I feel that I now have a blueprint that will guide me as I go through my course creation steps.   \t</em><em>---Silvia Wright-Davies (<strong>5 Stars</strong>)</em>  </p>    <p>  \t<strong>Learn Udemy Course Production and Marketing</strong>  </p>  <p>  \t                      Learn to navigate the udemy website and to use the interface to produce and market your course videos. Learn to price your courses to sell. Learn to promote your courses so that customers will want to own a copy. Learn to monitor sales and take action to keep the money rolling in.  </p>    <p>  \t<strong>Don't forget the standard Udemy 30 return policy, no questions asked!   \t                       This should make your decision a no-brainer ;-)</strong>  </p>    <p>  \t                      Online education has rapidly become the preferred learning method most students. This is the wave of the present, not the future... Get in on this trend now before it's too late.  </p>  <p>  \t                      Best of luck with your new course!  </p>  <p>  \t                      ---Brian  </p>", 
    "end_date": null, 
    "title": "Udemy Course Creation: Camtasia and PowerPoint - Unofficial", 
    "price": "20.00", 
    "instructors": "Author/Publisher Brian Jackson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260386_0ad5_10.jpg", 
    "course_url": "https://www.udemy.com/udemy-camtasia-and-powerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-13T04:01:32Z"
}