{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Do You Have Trouble With Finding Valuable And Relevant Information To Put In Your Courses? Do You Want To Know How To Expand Your Knowledge Base And Bring 1000x More Value To Your Students?</strong></p>\n\n<p>Welcome To The <strong>100k Udemy Academy: Gathering Information For Course Content.</strong><br><br>If you're aiming to make 6 figures through Udemy, you need content that deserve 6 figures. This means extremely valuable, high quality material that you know your audience will love.<br><br>In this course I show you:</p>\n\n<p>1. How to find content that you know 100% your students will love (through user reviews and upvote systems)<br>2. Have a complete methodology to finding information for every single course you put out<br>3. How to structure your information in a way thats insightful and relevant to what ever your teaching.</p>\n\n<p>Having pre knowledge about your topic is great, but why not make it even better by comparing what you have in your head with what other people are saying and the what most relevant information is right now.<br><br>That's what this course is all about.<br></p>\n\n<p>I show you the only 4 sources you need to finding highly valuable and relevant information that your students will love, and it won't take more than 1 - 2 hours.</p>\n\n<p>So if you want to make your course stand out and take it to the next level, this is the training you need.<br><br>Get started right now.</p>", 
    "end_date": null, 
    "title": "Udemy Academy: Gathering Info For Course Content- Unofficial", 
    "price": "20.00", 
    "instructors": "Mr Daniel Boehm", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801830_6b3b_2.jpg", 
    "course_url": "https://www.udemy.com/100k-udemy-academy-gathering-information-for-course-content/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T12:34:03Z"
}