{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong><em><strong>“This course is not sponsored by or affiliated with Udemy, Inc.”</strong><br></em></strong></p><ul><li><em><strong>Over 40,500 people from 179 countries enrolled in my courses  \t</strong></em></li>  \t<li><em>&lt;</em></li>  \t<li><em><em><em><strong>Overall, 1100+ </strong></em><em><strong>Reviews from very happy students</strong></em></em></em></li></ul>\n\n<p><strong><em><br><br></em></strong>This course is a complete blueprint for creating online courses. I'm going to show you exactly what strategies I have used to attract over 40,500  clients while traveling to over 50 countries around the world. <br>Congratulations for  your commitment to create a bestselling Udemy course.</p>\n\n\n\n<p>  \t  \t                                       <strong>What some customers say about my courses:</strong></p>\n\n\n\n<p><em><strong>\"Great! Now I know how to do a course! Thanks Jimmy!\" </strong>- </em>Wojciech Nowak</p>\n\n\n\n<p><em><strong>\"Excellent Course, masterfully presented, and truly inspiring. </strong></em><em><strong>This course immediately engages &amp; inspires you take take action and begin developing your own Udemy content library</strong>. Not only is this a \"How To\" but it also involes great detail on marketing strategies, that quite frankly, I do not see on many of the other courses in my niche category. I am excited to begin filming very soon at taking massive action toward making some extra income online\". </em>- Faraad Haashim</p>\n\n\n\n<p><em><strong>\"Fantastic course. </strong></em><em><strong>Jimmy covered off everything I was interested in.</strong> Plus, his support is incredible - answered ALL my questions super fast. Thanks Jimmy!!\" </em>- Kirill Eremenko</p>\n\n\n\n<p><strong><em>\"</em></strong><strong><em>Outstanding Content &amp; Delivery! </em></strong><em><strong>This is actually my first Udemy review I have written. I have been through a number of course and feel COMPELLED to write a strong 5-star review for Jimmy and this course. </strong>Not only is Jimmy's character and expertise very impressive, but his delivery and professional production is SO much higher than all the other courses I have previously consumed...\" -</em> Janet Bruno</p>\n\n\n\n<p><em><strong>\"Excellent information. </strong>I just published my first Udemy course and will definitely take in some of your advice on presentation style and points you bring out in the (pre, during and post launch phases) marketing sections. Very professional and well done\". </em>- Andre Kasberger</p>", 
    "end_date": null, 
    "title": "Udemy Course Creation and Promotion Mastery - Unofficial", 
    "price": "30.00", 
    "instructors": "Jimmy Naraine", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288482_7085_6.jpg", 
    "course_url": "https://www.udemy.com/unofficial-udemy-course-creation-and-promotion-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T20:42:58Z"
}