{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><em>This course is not sponsored by or affiliated with Udemy, Inc.</em></p>\n\n<p><strong>Udemy Promotional Videos</strong></p>\n\n\n<p>Learn how to create a Udemy promotional video and improve your Udemy marketing and Udemy sales!</p>\n\n\n\n<p><strong>You have just 5 to 12 seconds</strong></p>\n\n\n\n<p>To get someone's attention with your promo video</p>\n\n\n\n<p>You then have about 1 minute to persuade someone to buy your product</p>\n\n\n\n<p><strong>A good promo increases sales</strong></p>\n\n\n\n<p>It is a proven fact that a good promo video will dramatically increase your sell through rate…</p>\n\n\n\n<p>The promotional video is the most powerful tool for getting sales on your course landing page</p>\n\n\n\n<p><strong>But what makes a good promo video?</strong></p>\n\n\n\n<p>What are the things you need to do and the things you need to avoid?</p>\n\n\n\n<p>A bad video will cause you to lose potential sales…</p>\n\n\n\n<p>A good video will generate sales for you…</p>\n\n\n\n<p><strong>Learn how to create good promo videos that convert!</strong></p>\n\n\n\n<p>In this course you will learn the psychological steps that a buyer takes when buying your course</p>\n\n\n\n<p>And you will learn how to incorporate that process into your promo video…</p>\n\n\n\n<p>You will also learn how to film your video and create simple powerful talking heads promos that get sales!</p>\n\n\n\n<p><strong>So why listen to me?</strong></p>\n\n\n\n<p>I run an online marketing and video production company that helps businesses create powerful marketing strategies and we also specialise in video marketing.</p>\n\n\n\n<p>The company is called SME Heroes and is very easy to find...</p>\n\n\n\n<p>What I teach here are the techniques we use commercially, to produce marketing videos for our clients, who pay us thousands of pounds to produce their videos for them.</p>\n\n\n\n<p><strong>Who is this course for?</strong></p>\n\n\n\n<p>Do you have an online course that needs a good promo so that you can get more sales?</p>\n\n\n\n<p>Maybe you run a business and want to produce a simple, yet powerful promotional video on a budget?</p>\n\n\n\n<p>You may even want to learn some video production techniques, like filming talking heads to improve your marketing videos?</p>\n\n\n\n<p>If you answered yes to any of these questions, then this course is for you.</p>\n\n\n\n<p><strong>What is covered in the course:</strong></p>\n\n\n\n<ul><li>The difference between a promotional video and a introductory video</li><li>Psychology of a promotional video</li><li>AIDA scripting techniques</li><li>Choosing a camera</li><li>Choosing lights and sound equipment on a budget</li><li>Teleprompters on a budget</li><li>Creating your own studio</li><li>Setting up your lighting</li><li>Setting up your sound</li><li>Setting up your camera</li><li>Setting up your composition</li><li>On camera presence</li><li>Intros &amp; outros</li><li>Keynote animation tips</li><li>Basic editing skills you need to learn</li><li>Example promotional videos</li></ul>\n\n\n\n<p><strong>Take the course:</strong></p>\n\n\n\n<p>Before we go any further, let me just say, I don't want you to be disappointed.</p>\n\n\n\n<p>If you don't like the course for any reason, you can request a full refund in the first 30 days, no questions asked.</p>\n\n\n\n<p>So join me on the other side and learn how to create powerful, yet simple promotional videos that will generate sales!</p>", 
    "end_date": null, 
    "title": "Udemy Marketing - Create  A Udemy Promo Video - Unofficial", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/549240_f051_3.jpg", 
    "course_url": "https://www.udemy.com/promotional-video-production/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-08T17:50:05Z"
}