{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  <strong>Updates:</strong>  </p>\n\n<ul>  \t<li><strong>Over 1773 students have enrolled in the last few weeks and have left only 5 Star ecstatic reviews.</strong></li>  \t<li><strong>Course updated 7th of June, 2016</strong></li>  \t<li><strong>Includes the *NEW* Screenflow 6 features</strong></li><li><strong>Includes an interview between me and Alexa Fischer on communicating on video</strong></li>  </ul>\n\n\n\n<p>  \t                             Welcome to this <strong>insanely practical</strong> course on Screenflow.  </p>\n\n\n\n<p>  \t                             This is not a course like any other you can find online.  \t                              It's not about the technical aspects of Screenflow, even though it teaches them to you fully and clearly.</p>\n\n\n\n<p>This course is actually a <strong>practical, down to earth, results oriented, project based, coaching platform</strong>. Go straight to what you need and instantly learn it using <strong>modern experiential learning techniques</strong>.</p>\n\n\n\n<p>  \t  \t                              Because what we'll be doing here is exactly what you want to do outside this course.</p>\n\n\n\n<p>We have 4 projects (that are actually real life scenarios):  </p>\n\n\n\n<ul>  \t<li>speaking over a Keynote (or Powerpoint) presentation</li>  \t<li>demoing a software product</li>  \t<li>teaching on camera</li>  \t<li>recording a Skype interview</li>  </ul>\n\n\n\n<p>  \t  \t                              For each one of these 4 projects you learn: </p>\n\n\n\n<p> \t  \t                              - everything you need to know about the technical aspects of Screenflow so that you can put on video what's in your head  </p>\n\n\n\n<p>  \t                             (the technical part)</p>\n\n\n\n<p>- the theory behind the teaching:</p>\n\n\n\n<p>- how to animate the screen and add special effects so <strong>students don't lose interest</strong> and watch your clips until the end</p>\n\n\n\n<p>  \t                                  - how to structure your speech so <strong>students can remember</strong> it for months to come</p>\n\n\n\n<p>  \t                                  - tips and tricks that expert teachers use to <strong>inspire people into action</strong></p>\n\n\n\n<p><strong></strong>  \t                                  - and other essential lessons with examples from <strong>my own experience</strong> as a trainer and public speaker  </p>\n\n\n\n<p>  \t                             (the theory)</p>\n\n\n\n<p>  \t                              - after the technical aspects and the theory, you have an example of how it can be done  </p>\n\n\n\n<p>  \t                             (the example)</p>\n\n\n\n<p>  \t                              - and finally, your turn; you will have a hands on project in which you will create a video based on real world needs, here you put in practice what you've been taught  </p>\n\n\n\n<p>  \t                             (the project)</p>\n\n\n\n<p>  \t  \t                             All your submissions will be reviewed and you will get <strong>personalized feedback.</strong></p>\n\n\n\n<p><strong></strong>  \t                             Basically <strong>you'll have the creator of this course as your own personal coach, included in the course's price.</strong>  </p>\n\n\n\n<p>  \t                             The course is synergistic.</p>\n\n\n\n<p>  \t                              Every time you arrive at your, let's say, homework, you have all the knowhow to do it, technical, theoretical and an example.</p>\n\n\n\n<p>  \t  \t<strong> All the projects are useful in your real life.</strong></p>\n\n\n\n<p><strong></strong>  \t  \t                              Oh, and one more thing.</p>\n\n\n\n<p>  \tThis course is created by you!</p>\n\n\n\n<p>  \t                              If you find something unclear, if you want additional information on a subject or if you have any other request related to the course, write to me.  \t                              I'll create bonus videos based on your needs.</p>\n\n\n\n<p>  \t  \t                              Here you won't get those boring lessons showing you actions menu by menu, instead, in this course you'll be putting into practice the skills you require to provide video content to your students. </p>\n\n\n\n<p> \t  \t                              According to Marketing Week, video results appeared in almost 70% of the top 100 search listing on Google in 2012.</p>\n\n\n\n<p>  \t                              And according to ragan dot com </p>\n\n\n\n<p> \t                             More than 500 years' worth of YouTube videos are watched daily on Facebook. </p>\n\n\n\n<p> \t                              And more than 700 YouTube videos are shared on Twitter every minute. </p>\n\n\n\n<p>  \t  \t                              Video is easily shareable and searchable. Think of the last 5 things you've shared on social media, at least one of them was probably a video. </p>\n\n\n\n<p> \t  \t                              Use this course as a platform to launch yourself in the video business.  \t                              Professional editors are paid around 250$/hr and cheap corporate video editing costs around 1000$/finished minute. Even freelancers that just started are paid with 500$/day. </p>\n\n\n\n<p> \t                              So why not make a career out of this skill? </p>\n\n\n\n<p> \t  \t<strong> Join this course now and start creating your own professional videos!</strong>  </p>", 
    "end_date": null, 
    "title": "UPDATED: Expert Screenflow 6 skills in 29 days guaranteed!", 
    "price": "50.00", 
    "instructors": "Bogdan Vaida", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/217364_c657_9.jpg", 
    "course_url": "https://www.udemy.com/screenflow-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-13T14:47:20Z"
}