{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p><strong>Last Update: January 2016</strong></p><p><strong><em>\"In a word BRILLIANT\" - most recent Five Star review</em></strong></p><p>A step-by-step guide for first-time beginner trainers in how to <strong>turn an amazing idea into a ready-for-delivery course</strong> plan!<br></p><p>If you've never put together a training course before, this is the guide you need to get you from brilliant idea to fully-fledged, ready-to-go course plan.  It contains everything you need to <strong>understand exactly</strong>:</p><ul><li>how and where to start </li><li>who your perfect student is</li><li>your marketplace &amp; competitors</li><li>what you need to build up your course plan from scratch</li><li>how to incorporate layered learning</li><li>how to understand different learning styles (find out your own too!)</li><li>how to get constructive feedback</li></ul><p>And much, much more!</p><p>You could have state-of-the-art equipment and access to a recording studio, hours of free time and a brilliant internet connection, but when it comes down to it, you know <strong>your students need a logical and well thought through plan</strong> to get them from wanting to know what you know, to having the knowledge you've got to give!</p><p>In addition to giving you all you need to get from idea to course plan, you'll also get templates to use over and over for all the other courses you want to do; plus the opportunity to learn how to make the 'perfect cuppa' ... oh yes, it's a thing!  There's also additional information from other full-time trainers who know this stuff inside-out and back-to-front.</p><p>You won't regret taking this course if you want help in understanding just where to start and how to build up an excellent course plan.  But if you change your mind after enrolling, I guarantee you a full refund, no questions asked within 30 days of purchase - backed up by Udemy too.</p><p><strong>Enrol today and get your course off to an accelerated start!</strong></p>", 
    "end_date": null, 
    "title": "Where Do I Start? Beginner's Guide: Creating Your 1st Course", 
    "price": "50.00", 
    "instructors": "Ginette Tessier", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560358_4c62_2.jpg", 
    "course_url": "https://www.udemy.com/course-design-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T11:24:42Z"
}