{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t  Professor, professora, para que é que quer criar um site em Wordpress na Internet se pode usar o Moodle da escola, ou usar o e-mail ou não usar nada, dar as aulas e já está?  </p>  <p>  \t  Há necessidade de ir arranjar mais trabalho para cima das costas?  </p>  <p>  \t  Claro que já desconfia que vou mostrar-lhe que este é um investimento que compensará, mas a verdade é que até acho que é algo que faz falta a todo e cada um dos professores.  </p>  <p>  \t  O curso que aqui vai encontrar é uma introdução ao Wordpress, o gestor de conteúdos mais utilizado na Internet e destina-se essencialmente a professores, formadores, educadores que pretendam melhorar os seus materiais e a forma como os apresentam aos alunos.  </p>  <p>  \t  Este curso e a tecnologia que lhe está por trás é, sobretudo uma ferramenta de plasticidade mental cuja prática vai melhorar a nossa já grande capacidade de adaptação e ao mesmo tempo estimular a nossa motivação para fazer mais e chegar mais longe.  </p>  <p>  \t  Adquirir rotinas é o segredo para dominar a tecnologia. Muitas vezes aprende-se, mas depois como não se repete, esquecemos. Por isso o segredo é praticar. E para praticar nada melhor que termos sempre disponível para ver o material de aprendizagem. Porque neste curso vai aprender vendo os exemplos que depois pode repetir nas suas tarefas. Passo a passo à sua velocidade, ao seu ritmo, vai iniciar um processo rumo a uma maior realização profissional e pessoal.  </p>  <p>  \t  O curso está estruturado em 12 aulas, com uma duração total de cerca de 35 minutos, que cobrem desde a criação de um espaço de alojamento à gestão dos plugins do Wordpress, passando por todas as competências essenciais para começar a ter uma presença de qualidade na Internet, que vai atrair os alunos e dar prestígio ao professor.  </p>  <p>  \tEis os conteúdos do seu curso:  </p>  <ul>  \t<li><span>Intro</span><span>dução ao Wordpress</span></li>  \t<li><span>Criar alojamento gratuito</span></li>  \t<li><span>Instalar o Wordpress</span></li>  \t<li><span>Criar uma página no Wordpress</span></li>  \t<li><span>Criar um artigo no Wordpress</span></li>  \t<li><span>Criar e gerir categorias</span></li>  \t<li><span>Transferir para o nosso site as primeiras imagens</span></li>  \t<li><span>Inserir uma imagem num Artigo ou Página</span></li>  \t<li><span>Alterar as definições de leitura para exibir a nossa home page</span></li>  \t<li><span>Procurar e instalar um tema</span></li>  \t<li><span>Instalar plugins essenciais</span></li>  \t<li><span>Criar um backu</span><span>p do site</span></li>  </ul>  <p>  \tEm cada lição tem também questões de avaliação sobre cada tópico, para verificar se compreendeu os conteúdos.  </p>  <p>  \t  Depois de seguir os vídeo do curso Wordpress para professores já não vai parar mais na afirmação duma presença online.  </p>", 
    "end_date": null, 
    "title": "Wordpress para professores", 
    "price": "20.00", 
    "instructors": "Jorge Mata", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320940_ad54_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-para-professores/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T15:35:00Z"
}