{
    "selfpaced": true, 
    "topic_name": [
        "Teacher Training"
    ], 
    "description": "<p>  \t<strong style=\"\">Научитесь создавать онлайн-курсы и зарабатывайте на своих знаниях и навыках!</strong>  </p>  <p>  \t        Вы хотели бы заниматься в своей жизни тем, что приносит удовлетворение и доход?  </p>  <p>  \t        Вы хотели бы зарабатывать себе на жизнь теми навыками и знаниями, которые у вас уже есть, своим жизненным опытом?  </p>  <p>  \t        Хотите использовать свои знания, талант и опыт, чтобы вдохновлять других людей?  </p>  <p>  \t<strong style=\"\">Если да, то этот курс точно для вас!</strong>  </p>  <p>  \t        В этом курсе вы научитесь создавать онлайн-курсы на основе ваших знаний, продвигать их, продавать и заниматься делом, которое будет приносить вам не только прибыль, но и наслаждение от того, чем вы занимаетесь!  </p>  <p>  \t        В ЭТОМ УЧЕБНОМ КУРСЕ СОБРАНО ВСЕ, ЧТО НАДО ЗНАТЬ О СОЗДАНИИ ОНЛАЙН-КУРСОВ!  </p>  <p>  \t<strong style=\"\">Что вы сможете делать самостоятельно по окончании курса?</strong>  </p>  <ul style=\"\">  \t<li>Зарабатывать, занимаясь делом, которое нравится. </li>  \t<li>Использовать свой жизненный опыт, чтобы вдохновлять себя и других людей.</li>  \t<li>Получать прибыль от своих знаний и навыков.</li>  \t<li>Разрабатывать и создавать свои собственные онлайн-курсы. </li>  \t<li>Работать с программами для создания видеоуроков. </li>  \t<li>Находить идеи для своих онлайн-курсов. Записывать качественный звук, видео и скринкасты. </li>  \t<li>Определять стоимость и цену своего онлайн-курса. </li>  \t<li>Рекламировать онлайн-курс и продвигать его в социальных сетях. </li>  \t<li>Работать с бесплатными сервисами создания слайдов и иллюстраций для онлайн-курсов. </li>  \t<li>Научитесь не допускать распространенные ошибки новичков при создании онлайн-курсов. </li>  \t<li>Узнаете, как брендировать свой курс и создавать логотип, заставки и анимированные вступления для своих курсов. </li>  \t<li>Узнаете, как разработать и разместить свой курс на учебной платформе Udemy. </li>  \t<li>Научитесь правильному ценообразованию и продаже своих учебных программ на Udemy. </li>  \t<li>Получите новые знания и навыки в интересном и увлекательном процессе создания онлайн-курсов.</li>  </ul>  <p>  \t<strong style=\"\">Чему вы научитесь?</strong>  </p>  <ul style=\"\">  \t<li>Созданию курсов, работе с видео и аудио. </li>  \t<li>Вы узнаете, как создавать видеоуроки своими силами, я расскажу вам о бесплатных инструментах для работы с фото, видео, музыкой, слайдами.</li>  \t<li>Находить бесплатные фотографии, иллюстрации, музыку для своих уроков.</li>  \t<li>Разрабатывать учебное расписание, монтировать уроки.</li>  \t<li>Рекламировать и продавать свои курсы.</li>  \t<li>Заниматься делом, которое вам нравится.</li>  \t<li>Распространять знания, которые вы получили в своей жизни, и получать с этого доход.</li>  \t<li>Изменять мир к лучшему.</li>  </ul>  <p>  \t<br style=\"\">  \t      ВЫ ПОЛУЧИТЕ ПОСТОЯННЫЙ БЕСПЛАТНЫЙ ДОСТУП К ОБНОВЛЕНИЯМ КУРСА!  </p>  <p>  \t<strong style=\"\">Этот курс постоянно обновляется и дополняется.</strong> Однажды подписавшись на него, вы всегда будете получать новые лекции о современных практиках и инструментах для онлайн-обучения!  </p>  <p>  \t        У вас также будет возможность задавать вопросы и консультироваться с преподавателем в рамках «классных часов».  </p>  <p>  \t        И ГЛАВНОЕ, ВЫ БУДЕТЕ ЗАНИМАТЬСЯ ДЕЛОМ, КОТОРОЕ ВАМ НРАВИТСЯ!  </p>", 
    "end_date": null, 
    "title": "Как Создать Онлайн-курс на Udemy: Пошаговое Руководство", 
    "price": "20.00", 
    "instructors": "Oleg Gant", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340378_a05c_3.jpg", 
    "course_url": "https://www.udemy.com/online-course-dev-101/", 
    "currency": "USD", 
    "subject_name": [
        "Teaching Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T08:51:59Z"
}