{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  This course is intended for Bernina Software 7 owners who want to learn all the ins and outs of Bernina Software 7.  </p>  <p>  \t  This course is 66 min of Bernina Software 7, and the fourth course of 36 courses where we will explain the workings of Bernina Software 7.  </p>  <p>  \t  We have broken Bernina Software 7 down into 36 courses of not more than 60 min each for your convenience. In each course we will cover a section of the software.  </p>  <ul style=\"\">  \t<li style=\"\">Explain what the Cheat Sheet are, and how to apply this in digitizing shortcut</li>  \t<li style=\"\">Multihooping: how to manage, what to use it, and some uses in single hooping.</li>  \t<li style=\"\">Embroidery Canvas, Corel Canvas and how to use each, or both to create artwork</li>  \t<li style=\"\">Copy and Paste, undo and redo, this options allow freedom in creation</li>  \t<li style=\"\">Explaining Portfolio, cross stitch and Quilt program as additional add on.</li>  \t<li style=\"\">U.S vs Metric is easy to manage, also where to find help for each icon if needed</li>  \t<li style=\"\">Carving Stamp, Morphing a design and manage your zoom function</li>  \t<li style=\"\">Select tool, Polygon select tool for easier editing following up with reshaping</li>  \t<li style=\"\">Using selected handles, 45degree option, as well as precise graduation</li>  \t<li style=\"\">Using viewing tools while you digitize is a must to work to perfection</li>  \t<li style=\"\">Understanding the color film will make stitch order a play in the park</li>  \t<li style=\"\">Design View artistic or in stitchformat, as well as stitch viewing helps to plan</li>  </ul>  <p>  \t  Please feel free to try class 4 of 36 and then come join us for the other classes in this series.  </p>", 
    "end_date": null, 
    "title": "#04: Bernina Software 7 Master the Fundamentals: Cheat Sheet", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382222_7e27_7.jpg", 
    "course_url": "https://www.udemy.com/bernina-software-7-master-the-fundamentals-cheat-sheet-4/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T15:30:44Z"
}