{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t      This course is intended for Bernina Software 7 owners who want to learn all the ins and outs of Bernina Software 7.  </p>  <p>  \t      This course is 60 min of Bernina Software 7, and the seventh course of twenty courses where we will explain the workings of Bernina Software 7.  </p>  <p>  \t      Explore Step Fill types, settings and stitch angles, as well as what Pull compensation, underlay and stitch density is, and how to manage.  </p>  <ul style=\"\">  \t<li>Fancy Fill offers choices that will rock your boat</li>  \t<li> Fancy Fill edit options, and Sculpture Fancy Fill.</li>  \t<li> Fancy fill end and beginning of Ripple fill</li>  \t<li>More excitement with Ripple Fill</li>  \t<li>Ripple Fill and more Ripples.</li>  \t<li>Step vs Ripple, what is the difference</li>  \t<li>Contour fill, what is my limitation here?</li>  \t<li>Contour fill vs Fill Stitches, I show you how.</li>  \t<li> Ripple and reshape gives you exiting new ideas in digitizing.</li>  \t<li> Black-work fill stitches, and as outlines and borders</li>  \t<li> Candlewick stitch is not only for hand embroidery</li>  \t<li>Stitch direction as a wave can help for exiting new view</li>  </ul>  <p>  \t      We have broken Bernina Software 7 down into 20 courses of not more than 60 min each for your convenience. In each course we will cover a section of the software.  </p>", 
    "end_date": null, 
    "title": "#07: Bernina Software 7 The Fundamentals of Fill Stitch 2", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389594_d2af_6.jpg", 
    "course_url": "https://www.udemy.com/bernina-software-7-master-the-fundamentals-fill-stitch-2-7/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T16:29:16Z"
}