{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  This course is intended for Bernina Software 7 owners who want to learn all the ins and outs of Bernina Software 7.  </p>  <p>  \t  This course is not more than 60 min of Bernina Software 7, and another course of Master the Fundamentals of Bernina Embroidery Software 7.  </p>  <ul style=\"\">  \t<li style=\"\">Introduce you to the Advance Applique tool and its benefits and uses</li>  \t<li style=\"\">Take you on a trip for free cliparts, how to find, how to save and how to use.</li>  \t<li style=\"\">Confirm the artwork to be used as is, or to just use part of it.</li>  \t<li style=\"\">Select decorative stitches, and what to know when you do that</li>  \t<li style=\"\">Apply stitches, while we work around a specific order</li>  \t<li style=\"\">Create those beautiful eyes and finalize the outlines.</li>  \t<li style=\"\">We repeat edit choices we have used before, and allow you to try something new</li>  \t<li style=\"\">Edit the overlap of all the outlines so the Advance Applique can be used.</li>  \t<li style=\"\">Create those lovely kissable lips to perfection</li>  \t<li style=\"\">Apply Advance Applique and place fabric pieces where needed</li>  </ul>  <p>  \t  ..........................................................................................  </p>  <p>  \t  We have broken Bernina Software 7 down into 40 courses of not more than 60 min each for your convenience. In each course we will cover a section of the software.  </p>", 
    "end_date": null, 
    "title": "#25 Bernina Software 7 Fundamentals:  Applique", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427524_da25.jpg", 
    "course_url": "https://www.udemy.com/25-bernina-software-7-fundamentals-applique/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T07:48:15Z"
}