{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t  This course is intended for Bernina Software 7 owners who want to learn all the ins and outs of Bernina Software 7.  </p>  <p style=\"\">  \t  This course is not more than 60 min of Bernina Software 7, and another course of Master the Fundamentals of Bernina Embroidery Software 7.  </p>  <ul style=\"\">  \t<li>Explain where to get ideas from, and show you all</li>  \t<li>Import a chart into Corel and crop the design background only and save</li>  \t<li>In the XStitch program open the XStitch chart to start digitize the crosses</li>  \t<li>The chart blocks needs to match the blocks of the XStitch program, I show you how</li>  \t<li>Prepare your thread colors from the handchart in the program</li>  \t<li>Sometimes you have to re- set your x stitch blocks for a better result</li>  \t<li>Start filling the blocks with the correct stitch type and thread color</li>  \t<li>Continue with the Xstitch digitizing like above</li>  \t<li>Finalize the design, and tweak where you have to</li>  \t<li>A design with lots of details and colors take some time, we continue</li>  \t<li>Save the design as ARX which then can be opened in Embroidery Canvas</li>  </ul>  <p style=\"\">  \t  ...........................................................................  </p>  <p style=\"\">  \t  We have broken Bernina Software 7 down into 40 courses of not more than 60 min each for your convenience. In each course we will cover a section of the software.  </p>", 
    "end_date": null, 
    "title": "#39 Bernina Software 7  XStitch from hand chart", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432000_1e2f.jpg", 
    "course_url": "https://www.udemy.com/39-bernina-software-7-xstitch-from-hand-chart/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T13:38:52Z"
}