{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This Course is about \"Going Big!\", painting large <strong>Acrylic Abstract Paintings</strong>, finding and creating exciting designs that will look great on a larger canvas. You will learn how to build your own stretcher bars in a few different ways, and how to stretch your own canvas and save a lot of money. Then I'll show you my strategies for developing large compositions that are very popular. </p><p>The course covers 3 Painting Demos and is about 2 hours long, but it is recommended you revisit the video lectures over an extended period to really let the lessons sink in. With unlimited lifetime access you can come back anytime for a refresher and who knows I may have added more demos by then. </p><p>If you have ever gotten excited by the idea of painting Big Acrylic Abstract Paintings then this is the course for you! First I'll show you how I save a lot of money stretching my own canvas, then on to the painting demos, where you will learn some great ways to get started and of course complete your large acrylic abstract paintings. </p><ul><li>Unlimited Lifetime Access - Revisit the Lectures Anytime</li><li>No previous experience needed</li><li>Easy to follow video lessons </li><li>Money Saving Tips</li></ul><p>If you are ready for some Big Fun painting really Large Abstract Art, then enroll today and let's get started!</p>", 
    "end_date": null, 
    "title": "Abstract Painting - Going Big", 
    "price": "20.00", 
    "instructors": "Andy Morris", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535312_0de5_4.jpg", 
    "course_url": "https://www.udemy.com/abstact-painting-going-big/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T17:31:13Z"
}