{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong></strong><strong>~ Updated April 3, 2016 ~</strong></p>\n\n<p>A Peel Painting is paint squeezed between 2 surfaces then pulled apart to reveal fascinating texture lines. It's a painting made fast, takes no skill, great results happen, and creates duplication. If you start with thick paint, you can keep pressing to get up to 4 paintings.<br></p>\n\n<p>Artists are always complaining about having blocks, not being able to draw, confidence issues, being good enough, no time, no ideas, have shaky hands, takes too long and is too hard to learn, and not being able to make enough paintings fast enough. This all changes now with Peel Painting.</p>\n\n<p><strong>How this will change your life:</strong></p>\n\n<ul><li>Non-artists will be able to make sophisticated paintings easily</li><li>Get paintings created fast even if you have no time</li><li>You feel you have no talent but want to create fun art easy</li><li>You won't have to learn how to draw!</li><li>Paint now even if you have shaky hands</li><li>Exercises will get you through Artist's Block or being in a \"slump\"</li><li>Be able to create many works in a fast amount of time</li><li>No need for photos to copy now or copyright hassles, by creating from your imagination</li><li>Paint looser now &amp; more free form</li><li>Decorate your home for cheap in a unique way</li><li>Knowing how to transfer a peel will make no waste of paint</li><li>Find an escape that is productive &amp; rewarding</li></ul>\n\n<p><br>This course is the first in a series about how even a non-artist can set up for creating easy Peel Paintings, and is laid out to help you get set up to manage multiple paintings and how to make each clone look different from the other. By the end of the course you will know about what supplies, paints, and canvas deals to get, how to pick the best colors, how to set up a cheap drying and storage solution, how to transfer a peel to waste absolutely no paint, and have gone through a few exercises to making fascinating paintings. Peel Paintings course 2 and 3 will be about what tools and techniques can be used to enhance your peels. They are not made yet.</p>\n\n<p>This course would be great taken internationally, as acrylic paints are more readily available than just thicker paints I normally speak of from the USA.</p>\n\n<p><strong>Benefits &amp; Skills you will gain:</strong></p>\n\n<ul><li>Hack your way into painting an easy way</li><li>Be creative &amp; paint from your imagination instead of relying on copying a picture</li><li>Have more fun when you create</li><li>Paint without having to draw!</li><li>No time? Get paintings done fast now!</li><li>Be prolific and learn how to make many good works in a fast amount of time</li><li>For most any age, profession, artist or non-artist, anyone wanting to learn abstract art</li></ul>\n\n<p>Then you will be set up for Peel Painting Course 2 in the making, which will be all demonstrations and exercises you can do with tools and various pressing surfaces.</p>", 
    "end_date": null, 
    "title": "Abstracts: Peel Painting 1 - Setup Basics", 
    "price": "40.00", 
    "instructors": "Ruth Collis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339512_6e9a_6.jpg", 
    "course_url": "https://www.udemy.com/abstracts-peel-painting-1/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T22:06:14Z"
}