{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \tAre you ready to Learn <strong> Abstract Acrylic Painting Techniques</strong><strong>? </strong>Then Enroll today, and let's get started. </p><p>Some of the Benefits include;</p><ul><li>Being able to watch the lessons over and over from any place you have internet access</li><li>A New found Confidence in your own ability to create Abstract Paintings</li><li>Impress your Friends &amp; Family</li><li>Knowing a few ways to get started</li><li>Choosing the right materials</li><li>Insider Secrets using unusual tools</li></ul><p>I will show you step by step how to create some of my most popular abstract paintings, with Easy to follow Video Lessons.<br><br>There is a Supply List provided in Lecture 3 with suggestions to get you started, of course if you already have supplies, you can use those.<br><br></p>  <p><strong>Key Features of this Udemy Course</strong></p>  <ul>  \t<li>Unlimited Lifetime Access</li>  \t<li>Over 4000 Students Enrolled</li>  \t<li>Updated Last on Nov. 15th 2015</li>  \t<li>Closed Captions provided on each Video</li>  \t<li>One Time Payment </li>  \t<li>Watch Anytime / Anywhere</li>  </ul>  <p>  \t                      Through demonstrations and lectures I will simplify the process so even someone who's never painted before can understand it. We'll go over some basic design ideas,and then get right to the Fun part, Painting Abstract Art.  </p>  <p>  \t                                        Anyone wanting to paint even just one Abstract Painting should benefit from this Course, and for those wanting to make a little money, I'll show you different ways to sell your paintings.  </p>  <p>  \t<strong>NOW please Watch the PREVIEWS Below, and Check out what other Students Say </strong></p><p>Peter  \"I really enjoyed Andy's relaxed style of teaching in this course. Great tips of how to save on money on paint and tools were handy and loved listening to his thought process while watching him paint.\"</p><p>Michelle  \"This is such a great course for a beginner or someone wanting to get back to painting to excite their artistic juices. As a beginner this is just what i needed to get me going. bought my supplies now to make art.\"</p><p>Robin  \"Andy's approach is non-intimidating and practical. I felt empowered to create after going through this course.\"</p><p><br></p><p><strong>Thank You, Andy Morris</strong></p>", 
    "end_date": null, 
    "title": "Abstract Art Crazy Fun and Easy Way for Beginners to Paint", 
    "price": "20.00", 
    "instructors": "Andy Morris", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278336_623b_29.jpg", 
    "course_url": "https://www.udemy.com/how-to-paint-abstracts/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-11T03:19:51Z"
}