{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">In just a <strong style=\"\">few minutes</strong> you can learn to <strong style=\"\">amazing card magic tricks </strong>that will impress and <strong style=\"\">shock your friends and family!</strong></p><p style=\"\">I have used to <strong style=\"\">astonish thousands of people for over 30 years!</strong> I performed street magic in Harvard Square in Boston and even studied the cognitive principles of magic at MIT Media Lab!</p><p style=\"\">In this course, I will cover 10 of the best card tricks that will <strong style=\"\">amaze your friends and family</strong>. They will be <strong style=\"\">blown away by your talent</strong> and will ask you to perform at every event! They have will an experience of a life time and you will feel great!</p><p style=\"\">You can <strong style=\"\">learn some of these in just minutes</strong> and master them in a few days!</p><p style=\"\"><strong style=\"\">Highlights of the course:</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">Outstanding magic tricks at a rock-bottom affordable price</strong> (I really want people to learn magic and the cost NEVER to be an issue)</li><li style=\"\"><strong style=\"\">Detailed instructions that reveal EVERYTHING!</strong> This does not have complicated sleight-of-hand moves that are hard to learn</li><li style=\"\"><strong style=\"\">Teaches you how to perform - STEP by STEP</strong> - provides an introduction to principles of magic such as presenting, patter and misdirection. J</li></ul><p style=\"\"><strong style=\"\">Get started today and become an entertainer tomorrow!</strong> It&#039;s that easy and you too will amazed at the look of <strong style=\"\">surprise and delight in your spectators.</strong> Magic helps you make friends easily and builds your self confidence presenting. It&#039;s been very helpful for me and I hope you too have great fun!</p><p style=\"\">Good luck and hope you have a magical journey ahead!</p>", 
    "end_date": null, 
    "title": "Amazing magic tricks that are easy to do", 
    "price": "20.00", 
    "instructors": "Ishantha Lokuge", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522804_2518_5.jpg", 
    "course_url": "https://www.udemy.com/amazingmagic/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-07T22:07:56Z"
}