{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  Initiez-vous à la couture, maîtrisez les bases et la machine à coudre pour créez les accessoires &amp; vêtements de votre enfant facilement et en toute liberté.  </p>  <p>  \t<strong>Développez de solides connaissances en couture grâce à ce cours pour débutants.</strong>  </p>  <ul>  \t<li>Plus de 5 heures de vidéo, détaillées en 96 films pour réaliser 8 projets en toute sérénité.</li>  \t<li>Créer des accessoires mode &amp; déco grâce à 8 projets détaillés en vidéos.</li>  \t<li>3 introductions pour comprendre la machine à coudre, les outils de la couturière, les tissus.</li>  \t<li>Maîtriser pas à pas les techniques de bases de la couture.</li>  \t<li>Acquérir les automatismes propres à la confection de vêtements &amp; accessoires.</li>  \t<li>Et bien plus...</li>  </ul>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>Un savoir faire ancestral à porté de main</strong>  </p>  <p>  \t  Sous vos doigts de fée, les tissus, rubans, boutons, dentelles, se métamorphosent en créations délicates. Vous êtes unique, créez pour vous et vos proches des vêtements &amp; accessoires qui vous ressemblent.  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>Plus qu’un cours, un véritable trésor :</strong>  </p>  <p>  \t  Avec 8 projets filmés en haute qualité et une professionnelle qui vous guide pas à pas, ce cours contient toutes les informations, conseils et astuces que vous attendiez pour apprendre à coudre.  </p>  <p>  \t  Plus de 5 heures de vidéo, détaillées en 96 films pour réaliser vos 8 projets en toute sérénité.  </p>  <p>  \t  Le programme est conçu pour apprendre la technique en réalisant des accessoires. A travers la réalisation de ces 8 accessoires, vous apprendrez les techniques de couture, allant des plus simples vers les plus élaborées.  </p>  <p>  \t  Vous créez : un protège livre, un sac cabas, une pochette, un torchon rond, un tablier, une pochette molletonnée, une trousse à fermeture éclaire, un plaid patchwork.  </p>  <p>  \t  Tous les patrons sont inclus et nécessitent d’être imprimer en A4.  </p>  <p>  \t  A chaque projet on aborde un ou plusieurs nouveaux points techniques, et nous revoyons les techniques précédentes pour les maîtriser parfaitement. Vous êtes guidé par des vidéos qui vous montrent en détail toutes les étapes pour réaliser facilement tous les accessoires.  </p>  <p>  \t  Ses cours s’adressent aux débutantes comme au autodidactes qui souhaitent acquérir les «bonnes» techniques de couture.  </p>  <p>  \t  Grâce à ce cours, vous aurez acquis les connaissances nécessaires pour vous lancer seule dans des projets de couture simples. Vous pourrez également refaire à volonté les projets étudiés pendant le cours.  </p>  <p>  \t  Vous apprenez où vous voulez, quand vous voulez, et à votre rythme.  </p>  <p>  \t  Plus besoin de surfer des heures sur internet, quand pour le prix d’un livre, vous allez enfin apprendre à coudre en toute liberté en suivant un enseignement professionnel de qualité.  </p>", 
    "end_date": null, 
    "title": "Apprendre à coudre : c'est facile !", 
    "price": "50.00", 
    "instructors": "Marie-Emilienne Viollet", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286370_4d30_3.jpg", 
    "course_url": "https://www.udemy.com/apprendre-a-coudre-cest-facile/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-23T08:37:32Z"
}