{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<ul><li><em></em>Aprenderan a soltar la mano con unos ejercicios faciles y rapidos. Luego empezaran a dibujar formas de manera libre, sin tener que detenerse a tomar medidas. Aprenderan a dibujar caras en todas las posiciones.</li><li>Desnudos femeninos y masculinos.  Practicaremos con fotografias de desnudos. Una vez hayan practicado lo suficiente, quedaran listos para dibujar los mejores desnudos mirando modelos vivos. Esta practica sera muy util para <strong>Los estudiantes de Arte.</strong> Tambien las <strong>personas que no estudian</strong> <strong>Arte</strong>, podran aprender a dibujar cuerpos  de manera espontanea, sin detenerse a tomar medidas  y podran continuar toda la vida tomando modelo vivo. Esta es una experiencia fascinante.</li><li>La personas que tienen facilidad para los retratos, pero no han logrado darles un acabado profesional, en mi curso lo van a aprender. Ud sabe cuanto puede costar  un retrato acabado profesionalmente? averigue, puede cobrar  un precio muy alto.</li><li><strong>Los disenadores </strong>que realizan un diseno y lo corrigen muchas veces, borrando una y otra vez, aprenderan a realizar rapidamente una serie de disenos sin tener que borrar  y al final, escoger el mejor.</li><li><strong>Si Ud. crea disenos  para tatuajes</strong>, podra realizar varios proyectos o creaciones y  finalmente   escojer el mejor.  Tambien adquirira la sensibilidad y habilidad suficiente para realizar los tatuajes sobre la piel dibujando con seguridad y de corrido. <strong>Maestros y Profesores de Escuela,</strong> podran dibujar con mucha rapidez y habilidad sus dibujos en el tablero delante de sus alumnos.</li><li><strong>Cirujanos plasticos y forenses</strong> tambien necesitan habilidad para dibujar.</li><li><strong> Si usted tiene inclinacion para el Arte <em></em><em></em></strong> Y desea aprender a pintar con oleos y acrilicos  ya sea de forma realista o abstracta, podran aprovechar mi curso pues para poder pintar bien, es necesario aprender a dibuijar primero.</li><li>Si Ud. es <strong>Pensionado o retirado </strong>y siempre sono con aprender a dibujar, podra lograr su sueno tomando mi curso de Dibujo.</li><li>Ud aprendera a dibujar con <strong>carboncillo, lapices de pastel a color, y grafito.</strong></li></ul><p><em>El tiempo requerido para completar el curso, depende de su  interes y disciplina. Puede aprender rapidamente, y consultar los videos cada vez que necesite practicar mas.</em></p><p><em>Son 24 videos de 10 minutos de duracion cada uno. Total 240 minutos correspondientes a 4.00 horas. Cada video debe ser dominado por el alumno para pasar al siguiente video.</em></p><p><em>No se trata de mirarlos y punto. Toca trabajar conmigo paso a paso y repetir todas las veces que sea necesario. Finalmente, lograran el objetivo y terminaran dibujando con mucha destreza y profesionalismo.</em></p>", 
    "end_date": null, 
    "title": "Aprenda a Dibujar con Destreza", 
    "price": "20.00", 
    "instructors": "Elizabeth Mercado", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515604_2662_6.jpg", 
    "course_url": "https://www.udemy.com/aprenda-a-dibujar-con-destreza/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T20:12:46Z"
}