{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>- Más de<strong> 1000 alumnos y alumnas han tomado ya mis cursos de Arte y Creatividad!</strong></p>\n\n<p>- Garantía del 100% de <strong>devolución de tu compra en 30 días</strong> <strong>si no quedas satisfecho/a</strong> con el curso. </p>\n\n\n\n\n\n<p>- Última actualización en <strong>Mayo de 2016</strong>.<br></p>\n\n\n\n\n\n<p>- <strong>Curso de Dibujo artístico básico</strong>, dirigido tanto a estudiantes de <strong>Bellas Artes</strong>, Arquitectura, Academias y Escuelas de <strong>Artes aplicadas</strong>, así como a <strong>Tatuadores</strong>, <strong>Artistas</strong>, <strong>Urban </strong><strong>Sketchers</strong>, Dibujantes de <strong>Cómic</strong>, <strong>Caricaturistas</strong> y todo aquel que quiera aprender a representar la forma con un método ideado por el <strong>Prof. Dr. Antonio García Villarán</strong>, Director y Profesor de CREA 13. Con sencillos ejercicios llegaremos a educar nuestra visión para conseguir nuestro objetivo. Aprenderemos técnicas nuevas y divertidas formas de aprender a dibujar. El curso contiene más de 2 horas de clases teóricas en forma de vídeos y material pedagógico original. Si se cumplen los objetivos garantizamos que en un periodo de 3 a 6 meses sabrás dibujar básicamente lo que percibes. La estructura de enseñanza será la de realizar los ejercicios propuestos hasta conseguir superarlos. Si quieres aprender a dibujar, bienvenido.<br></p>\n\n\n\n\n\n<p>  \t        La estructura del curso consta de explicaciones por las que veremos que <strong>cualquier persona puede llegar a dibujar perfectamente</strong>. Hablaremos del sarampión realista, del dibujo de representación y de presentación y sentamos las bases de la unidad didáctica. Seguidamente encontramos ejercicios para <strong>soltar la mano, educar la percepción</strong>, conseguir realizar correctamente el encaje, la proporción, el volumen y el espacio y terminamos con la explicación del concepto \"Macarma\". Contamos con material complementario que te puedes descargar y con bibliografía para que sigas aprendiendo. De regalo tendrás gratuitamente un Libro en PDF del Prof. Dr. Antonio García Villarán; \"El Maestro Escarabajo. Ideas para una nueva pedagogía de las Artes Plásticas del Siglo XXI\".</p>\n\n\n\n\n\n<p>  \t        Realiza este curso si quieres aprender a dibujar de una forma sencilla, rápida y divertida.  </p>\n\n\n\n\n\n<p>  \t\t\t\t\t        Gracias por elegir este curso.  \t\t\t\t</p>", 
    "end_date": null, 
    "title": "Aprende Dibujo Artístico fácilmente. Arte y creatividad.", 
    "price": "35.00", 
    "instructors": "Antonio García Villarán", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301984_8a12_4.jpg", 
    "course_url": "https://www.udemy.com/dibujo-artistico-curso-basico-aprende-a-dibujar-facilmente/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T09:46:01Z"
}