{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p class=\"PIN_1373102685887_hazClick\"><span class=\"PIN_1373102685887_hazClick\"><strong style=\"\">¿POR QUÉ ESTE CURSO ES PARA TI?</strong></span></p>    <p class=\"PIN_1373102685887_hazClick\"><span class=\"PIN_1373102685887_hazClick\"></span></p>  <p>  </p><p><span><span>Tanto si quieres&nbsp;</span>IMPRESIONAR A FAMILIARES Y AMIGOS<span>&nbsp;en tus fiestas o&nbsp;</span>EMPEZAR UN NUEVO Y LUCRATIVO NEGOCIO<span>&nbsp;decorando tartas de manera profesional, éste es el curso que necesitas.</span></span></p>  <p></p>    <p class=\"PIN_1373102685887_hazClick\"><span class=\"PIN_1373102685887_hazClick\"><span>Aprenderás a elaborar y decorar tartas </span>DE MANERA PROFESIONAL<span>, con un acabado perfecto, impactante y personalizado. No son necesarios conocimientos previos </span><span>ni de cocina ni de repostería, ya que empezaremos por lo básico. Conocerás desde las herramientas e ingredientes imprescindibles, hasta las técnicas más elaboradas de decoración, pasando por el horneado, rellenado, cobertura, decoración, modelado de flores, figuras y lazos, preparación de bases y muchas cosas más. Todo ello reforzado con tartas paso a paso al final del curso que repasan todos los conocimientos adquiridos para reforzarlos.</span></span></p>    <p class=\"PIN_1373102685887_hazClick\"><span class=\"PIN_1373102685887_hazClick\"><span><strong style=\"\">¿CÓMO APRENDERÁS?</strong></span></span></p>    <p class=\"PIN_1373102685887_hazClick\"><span><span class=\"PIN_1373102685887_hazClick\">Te enseñaré y te guiaré a través de&nbsp;</span><span>lecciones </span><span class=\"PIN_1373102685887_hazClick\"><span>sencillas y amenas </span>PASO A PASO<span>, explicadas de manera muy exhaustiva en vídeo y con materiales de apoyo</span><span> (recetas, preguntas frecuentes, guías, esquemas, trucos...) que te llevarán a decorar esas tartas que tanto te gustan </span></span><span class=\"PIN_1373102685887_hazClick\">en muy poco tiempo y ahorrando mucho dinero.</span></span></p>    <p><span><span><span></span>Las lecciones están estructuradas de manera que se avance en los conocimientos </span>DE MANERA PROGRESIVA<span> y poco a poco. Debes asimilar cada lección antes de pasar a la siguiente y si tienes dudas, </span>estoy ahí para ayudarte<span>. Simplemente expón tu pregunta en el apartado de <em style=\"\">&quot;Apoyo técnico&quot; </em>y te responderé o antes posible.</span></span></p>    <p><span><span><strong style=\"\">¿QUÉ BENEFICIOS OBTENDRÁS?</strong></span></span></p>    <p><span><span>No encontrarás otro curso tan completo y, además, es el único que te aporta los conocimientos necesarios para elaborar </span>CUALQUIER TIPO DE TARTA <span>que imagines, de principio a fin. Al terminar el curso, serás capaz de hacer tartas que nunca antes habías imaginado gracias a las </span>TÉCNICAS BÁSICAS PERO EFECTIVAS<span> que aprenderás y a los trucos y secretos de </span>REPOSTERIA CREATIVA<span> que te voy a revelar.&nbsp;</span></span></p>    <p><span><span>Imagínate creando en tu propia cocina tartas espectaculares por menos de 15€ que luego podrás vender por más de 70€. O imagina la cara de tus amigos cuando aparezcas en la fiesta con una </span>OBRA DE ARTE COMESTIBLE.<span>.. ¡serás el tema de conversación!</span></span></p>    <p><span><span>Este curso es el primer paso para convertirte en </span>CAKE DESIGNER <span>y adentrarte en el apasionante mundo de la Repostería Creativa a tu ritmo, desde casa y por menos de lo que vale una tarta decorada!&nbsp;</span></span></p>    <p><span class=\"PIN_1373115805049_hazClick\"><strong style=\"\">Y ADEMÁS, SI TE INSCRIBES AHORA...</strong></span></p>    <p><span class=\"PIN_1373115805049_hazClick\">Recibirás, de regalo, acceso gratuito al &quot;CURSO DE DECORACIÓN DE CUPCAKES&quot; y &quot;CURSO DE MODELADO DE ANIMALES&quot;<span>&nbsp;¡Date prisa! Esta oferta es limitada y sólo estará disponible unos días...&nbsp;</span></span></p>    <p><span class=\"PIN_1373115805049_hazClick\"><span><strong style=\"\">Y RECUERDA:</strong></span></span></p>    <p><span class=\"PIN_1373115805049_hazClick\">Como alumno del curso, tendrás derecho a todas las ACTUALIZACIONES del curso y NUEVAS SECCIONES O LECCIONES que se vayan añadiendo. Así, siempre estarás &nbsp;informado de nuevas técnicas de repostería sin coste adicional.</span></p>    <p><span class=\"PIN_1373115805049_hazClick\"><span><br style=\"\">  </span></span></p>  ", 
    "end_date": null, 
    "title": "Aprende a Decorar Tartas Fondant desde cero y paso a paso", 
    "price": "50.00", 
    "instructors": "Monica Vicente", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63847_dc41_6.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-decorar-tartas-fondant/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-04T18:00:09Z"
}