{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em><strong>LARGEST (168 lectures) magic course with the MOST students on Udemy bringing you the very BEST simple and EASY magic tricks you can master in minutes. These tricks are magicians best kept secrets (because they are so easy to learn and get so amazing reactions). All SIMPLE magic tricks are using everyday objects, stuff you already have! That's by the way the magic that impresses people the most!</strong></em></p>\n\n<p><em><strong><em>Five new lectures added in June 2016!<br></em></strong></em><strong><em><em>Five new lectures added in December 2015!</em></em><br><em><em>Four new lectures added in September 2015!</em></em><br></strong></p>\n\n<p><strong>WHO ELSE WANTS TO BECOME A MAGICIAN OVER NIGHT?</strong></p>\n\n\n\n\n\n\n\n<p><strong>- IMAGINE, PERFORMING IN ANY IMPROMPTU SITUATION?</strong></p>\n\n\n\n\n\n\n\n<p><strong>- USING ALMOST ONLY EVERY DAY OBJECTS TO AMAZE EVEN MORE?</strong></p>\n\n\n\n\n\n\n\n<p><strong>- AND THIS WITH NO PRE- KNOWLEDGE OR ANY OTHER REQUIREMENTS!</strong></p>\n\n\n\n\n\n\n\n<p><em>You always wanted to become a magician or you never imagined that it could be so easy to learn…or you tried and failed, because the tricks were to difficult..</em></p>\n\n\n\n\n\n\n\n<p>Explore the very best simple magic tricks for amazing reactions. You can learn these magic tricks in minutes. Start immediately without buying expensive magic props. The magic tricks you learn in this course are the magic you will love and really us. All videos show you first the performance view followed by an easy to follow explanation from your angle (with music and additional text descriptions).</p>\n\n\n\n\n\n\n\n<p><strong>NO STICKY TAPE ATTACHED TO YOUR HANDS BUT ONLY PRACTICAL MAGIC YOU WILL LOVE TO USE. WHEREVER YOU ARE, YOU WILL BE READY TO AMAZE</strong>!</p>\n\n\n\n\n\n\n\n<p>I'm Selim Tolga, professional Magician. I have been performing magic for more than 18 years. During this time I collected the very BEST simple magic tricks everybody can learn in minutes. It's time to share them with you!</p>\n\n\n\n\n\n\n\n<p>++++++++++++++++++++++++++++++++++++++++</p>\n\n\n\n\n\n\n\n<p><strong>Imagine being the star at your next party. Just grab a few things from your friends and AMAZE them.</strong></p>\n\n\n\n\n\n\n\n<p>++++++++++++++++++++++++++++++++++++++++</p>\n\n\n\n\n\n\n\n<p>On Youtube you can find many magic tricks revealed. But only a few of them are really practical, easy to learn and get big reactions. So way waste your time there when you can have ONE collection here of the BEST simple magic tricks. And best part: I continuously add more and more tricks.</p>\n\n\n\n\n\n\n\n<ul><li>If you want to perform simple magic tricks, this course is for you.</li><li>If you want to become a magician over night, this course is for you.</li><li>If you want to use everyday objects to perform magic, this course is for you.</li></ul>\n\n\n\n\n\n\n\n<p>It doesn't matter if you have zero knowledge about magic. I guide you step by step. You will learn:</p>\n\n\n\n\n\n\n\n<ul><li>168 videos teaching you the best SIMPLE magic tricks:</li><li>easy magic tricks</li><li>easy card magic tricks</li><li>easy coin magic tricks</li><li>easy mind magic tricks</li><li>easy bar magic tricks</li><li>bets and magic puzzles</li><li>easy kids magic tricks</li><li>easy math magic tricks</li><li>compilation simple magic tricks teaching videos (each teaching you 10 simple magic trick with one object)</li><li>advanced simple magic trick teaching videos</li><li>more to come!</li></ul>\n\n\n\n\n\n\n\n<p><em>As with all my courses:</em></p>\n\n\n\n\n\n<ul><li>you have unlimited lifetime access at no extra costs, ever</li><li>all future additional lectures, bonuses, etc in this course are always free</li><li>there's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li><li>my help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li></ul>\n\n<p><strong><em></em></strong></p>\n\n\n\n\n\n\n\n<p><strong>Get this course NOW and perform your first amazing magic trick already TODAY.</strong></p>", 
    "end_date": null, 
    "title": "Become an instant magician with the best Simple Magic Tricks", 
    "price": "20.00", 
    "instructors": "Selim Tolga", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/105812_7429_7.jpg", 
    "course_url": "https://www.udemy.com/learn-the-best-simple-magic-tricks-become-a-magician/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-14T19:43:31Z"
}