{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong>**Up<em>dated: February 22, 2016**</em></strong>  </p>    <p>  \t                    Have you spent a lifetime admiring the grace and elegance of Arabic Calligraphy but never had the chance to learn the art? Have you spent ages looking for a viable resource to teach you the art in the English language but never found one? Has learning the art always been on your bucket list but you never got around to sloting it in your busy life schedule? If you answered yes to any one of the questions above, then this course is for you! This one of a kind Arabic Calligraphy course allows you the flexibility to learn anytime, from anywhere, and at your own pace. This is your chance to begin the journey of a lifetime; start learning today and explore your true artistic capabilities!  </p>  <p>  \t                    Not sure if learning the art online is a good idea? In addition to Udemy's 30 day guarantee, you have my personal promise that this course, along with the perseverance to learn and practice, will have you scripting like a pro in a few months time.  </p>    <p>  \t                                                 This is an 8-week comprehensive and step-by-step course to learn the Naskh, Thuluth, and Diwani scripts from absolute scratch. Following is the outline for the course:  </p>  <ul>  \t<li>Week1: Introduction – Learning Methodology, Supplies, Dynamics of the pen, Scaling and Measurements </li>  \t<li>Week 2: Naskh Day 1 – Introduction, Letters Aleph to 'Ain </li>  \t<li>Week 3: Naskh Day 2 – Letters Fa to Hamza, Sample sentence scripting </li>  \t<li>Week 4: Thuluth Day 1 – Introduction, Letters Aleph to 'Ain </li>  \t<li>Week 5: Thuluth Day 2 – Letters Fa to Hamza, Sample sentence scripting </li>  \t<li>Week 6: Diwani Day 1 – Introduction, Letters Aleph to 'Ain </li>  \t<li>Week 7: Diwani Day 2 – Letters Fa to Hamza, Sample sentence scripting </li>  \t<li>Week 8: Planning and drafting masterpieces, Conclusion </li>  </ul>    <p>  \t<strong>FAQ</strong>  </p>  <ul>  \t<li>Is this course suitable for my kids to take?  \t<em>Of course, the earlier a child starts learning calligraphy, the easier it is to pick up the art.  \t  \t  \t</em></li>  \t<li>When does this course start and end? Is there a fixed schedule?  \t<em>There is no start and end date to the course, and there is no fixed schedule; this course keeps your busy life schedule in mind and allows you the flexibility to attend the lessons whenever you'd like.  \t  \t  \t</em></li>  \t<li>Are these live sessions or pre-recorded lessons?  \t<em>These are pre-recorded detailed tutorial videos which you can watch as many times as you'd like.  \t  \t  \t</em></li>  \t<li>Since this is an 8 week course, will we have access to videos for only 8 weeks?  \t<em>8 weeks is only a suggested timeframe. As you will have the access to the lessons indefinitely, you can complete the course in 8 months or perhaps 8 years; it is totally up to you.  \t  \t  \t</em></li>  \t<li>Does the course include supplies used to write calligraphy?  \t<em>No, as this is an online course, there are no supplies provided with the course. However, I teach how to create your own bamboo qalam and suggest brands/types of paper and ink you can purchase from any local art store.</em></li>  </ul>  <ul>  \t<li>Will watching the videos be sufficient enough to have me write good   \t                                      calligraphy?<em>Watching the videos alone will get you nowhere; watching the videos along with ample practice and completing the weekly homework will have you standing at your own feet by the end of the course. You will be ready to start creating your own calligraphy artwork inshaAllah.  \t  \t  \t</em></li>  \t<li>Will the instructor mark or grade my work for corrections?  \t<em>This course is designed as a self study guide. However I will be happy to answer any questions or provide guidance.  \t</em></li>  </ul>  <ul>  \t<li>Would you recommend this course over the book you have published?  \t<em>It's comparing apples and oranges; both resources have their own benefits. The course will allow you to learn live scripting while the book is a great reference guide for all scaling and measurements. The book also include 2 additional scripts that are not taught as part of the online course: Riq'a and Farsi.</em></li>  </ul>", 
    "end_date": null, 
    "title": "Become an Arabic Calligraphy Artist from Scratch", 
    "price": "35.00", 
    "instructors": "Omar Uddin", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/186792_41e4_4.jpg", 
    "course_url": "https://www.udemy.com/a-beginners-guide-to-arabic-calligraphy/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-22T03:32:29Z"
}