{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>\r\n\t   Chocolate is a girls’ best friend but if you are from the male species, please run away NOT! This course is very much for you too! Infact, if you are a chocoholic, a baking and patisserie lover or just plain curious on how to make homemade chocolate, or chocolates that look and taste like they fell from heaven, then you have come to the right place!\r\n</p>\r\n<p>\r\n\t  Here you will also learn important techniques such as melting chocolate/tempering chocolate at the right temperatures for making chocolate bars and all sorts of delicious chocolate recipes! Learning chocolate has never been this fun and easy. Begin your dream of opening your very own chocolate factory today! Unleash the Willie Wonka in you that you never thought you could be or if you are female (like me) then step into the shoes of the Chocolatier star from the movie &quot;Chocolat&quot; (highly recommended movie to watch if you haven&#039;t seen it yet)\r\n</p>\r\n<p>\r\n\t      ·This is a beginners’ guide to learning about chocolate, how to make it as well as quick and simple recipes.\r\n</p>\r\n<p>\r\n\t      ·The video lessons will take about 1 hour to complete (watch time) but please set aside at least 20 hours to practice the content in the video. Have a pen and paper handy to jot down notes as well as some plain chocolates to begin experimenting with! - I will be adding and refining this course to meet your needs so please ask questions or make suggestions so you are getting the best training.\r\n</p>\r\n<p>\r\n\t      ·Learn how to temper chocolates for various chocolate recipes\r\n</p>\r\n<p>\r\n\t      ·More classes coming soon on Chocolate cake recipes and more techniques to add to your creation repertoire so be sure to sign up!\r\n</p>\r\n<p>\r\n\t      Here is what some students are saying\r\n</p>\r\n<p>\r\n\t      “...Even Gordon Ramsey wouldn’t have a clue!” – Will Budic\r\n</p>\r\n<p>\r\n\t      “ I loved learning how to make chocolate butterflies and decorations. The techniques are very good and easy to follow.” – Rejane Maria\r\n</p>\r\n<p>\r\n\t      “This was a very helpful course, thank you for making it available” – Oliver Cook\r\n</p>\r\n<p>\r\n\t      “Many thanks for sharing this great tutorial on tempering dark chocolate!” – Hazel Ann\r\n</p>\r\n<p>\r\n\t      “ I was so surprised to find the Italian drink recipe for Barbajada here. Brava!” – Will Giani\r\n</p>", 
    "end_date": null, 
    "title": "Beginners Course in Chocolate Making", 
    "price": "20.00", 
    "instructors": "Maria-Lola  Edun", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179884_93dc_2.jpg", 
    "course_url": "https://www.udemy.com/beginners-course-in-chocolate-making/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-10T15:11:49Z"
}