{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Portland Headlight, Maine Lighthouse Watercolor course.</p><p><strong>WATERCOLOR COURSE - Simple, Easy and Step by Step!</strong></p>\n\n<p>Have you ever wanted to take up watercolors, but found most classes are too heavy and academic? These classes are similar to a Paint Night but we use watercolors. The classes are Easy, and no basic knowledge of watercolors are needed. You can usually finish your first painting under 2 hours.</p>\n\n<p>This course is simple and easy to follow, plus minimal materials are needed to start painting today. Use any watercolors or brushes you have on hand, but I'll give you my favorite supplies and a PDF list to go by.</p>\n\n<p>The course is broken down into small easy steps and I'll paint along with you. If you have questions as you go along please feel free to send me a private message or on the QA board.</p>\n\n<p>Watch it over and over or enjoy a private painting class with your family and friends along with some coffee, tea, or wine.</p>\n\n<p>Once completed, feel free to share your final product on social media, you can find my links in my profile. I love to see the final work of my students.</p><p>I hope this course is a 5 star rating for you, but if not please let me know what I can do to make it a better experience for you.</p><p>Have fun and enjoy!<br></p><p>Kellie</p>", 
    "end_date": null, 
    "title": "Beginner Watercolor Painting Course Easy Lighthouse Painting", 
    "price": "20.00", 
    "instructors": "Kellie Chasse", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/829234_3d0a.jpg", 
    "course_url": "https://www.udemy.com/beginner-watercolor-painting-course-easy-lighthouse-painting/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-22T16:11:37Z"
}