{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">This course is intended for Bernina Software 7 owners who want to learn more about <strong style=\"\">quilting and multiple manual hooping using Bernina Software 7</strong>.</p><p style=\"\">This course is 109 min of Bernina Software 7, and the forth course that is more advanced techniques used where <strong style=\"\">we will explain manual multiple hooping and Quilt as you go using Bernina Software 7.</strong></p><p style=\"\">We have broken the course down into 9 lectures of not more than 14 min each for your convenience. In each lecture we will cover a section of the Trupunto and Monogramming.</p><p style=\"\"><strong style=\"\">Section1: </strong>Welcome to Bernina Software 7 manual multiple hooping and Quilt as you go course</p><p style=\"\"><strong style=\"\">Lecture1:</strong> Introduction to manual multiple hooping and Quilt as you go and show samples using Bernina Software 7.</p><p style=\"\"><strong style=\"\">Lecture2:</strong> Show stitch samples to understand what will follow now</p><p style=\"\"><strong style=\"\">Lecture3:</strong> What can go wrong, and how to prevent it before you send to the machine</p><p style=\"\"><strong style=\"\">Lecture4:</strong> Let the actual digitizing begin. Explain all steps.</p><p style=\"\"><strong style=\"\">Lecture5</strong>: A peak into Corel draw by sending from design to convert in Corel</p><p style=\"\"><strong style=\"\">Lecture6:</strong> Planning all the steps and preparation to do my manual multiple hooping and Quilt as you go</p><p style=\"\"><strong style=\"\">Lecture7:</strong> Use options under Digitizing to set my main design, and the order</p><p style=\"\"><strong style=\"\">Lecture8:</strong> More about manual multiple hooping and Quilt as you go. </p><p style=\"\"><strong style=\"\">Lecture9:</strong> continue with the digitizing and editing of objects, add holes in the background</p><p style=\"\"><strong style=\"\">Section 2: Downloads and Artwork</strong></p><p style=\"\"><strong style=\"\">Lecture10:</strong> Download Links</p><p style=\"\">Please feel free to try our introduction course as well.</p>", 
    "end_date": null, 
    "title": "Bernina Software 7:#4 Quilt as you Go Manual Multihooping", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529288_d101_2.jpg", 
    "course_url": "https://www.udemy.com/bernina-software-74-quilt-as-you-go-manual-multihooping/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T08:17:33Z"
}