{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course is intended for Bernina Software 7 owners who want to learn more about Stumpwork using Bernina Software 7.</p><p>This course is 129 min of Bernina Software 7, and the fifth course that is more advanced techniques used where we will explain stumpwork using </p><p>Bernina Software 7.</p><p>We have broken the course down into 8 lectures of not more than 14 min each for your convenience. In each lecture we will cover a section of the </p><p>Lecture 3: Where to start, and where and when to use the close curve vs open curve</p><p> Check hoop selection, choose the correct size, twist the hoop for horizontal creation.</p><p> Explaining where the cutting will take place and how to support my design in hoop.</p><p>.........................................................</p><p>Lecture 4: The support of the non-cut area so it remain solid in the hoop and allow trellis to be built without any bundling of stitches. Long term stable stitches that will support.</p><p>How to plan the trellis work. Start and end to give me the best stitch out.</p><p>.....................................................</p><p>Lecture 5: The stitch types needed for this project, and the order I need to use the different types are explained and used to get the design going.</p><p>.......................................................</p><p>Lecture 6: Planning my stitch types and order to eliminate jump stitches and have a well planned stitch out.</p><p>Satin outline stitch: what to do to reshape without re-do. </p><p>...............................................................</p><p>Lecture 7: The satin stitch is the final stitches to complete the project,.</p><p> As the trellis stitches has no fabric support, planning and connection is of utmost importance. I show you all.</p><p>....................................</p><p>Lecture 8: Checking, and double checking all stitch connections needed for a freestanding effect are in order. </p><p> Zoom out and work with each object for final round up so the project will be ready for stitch out.</p><p>..............................................</p><p>Section 2: Bonus</p><p>Lecture 9: Download Links</p><p>Please feel free to try our introduction course as well.</p>", 
    "end_date": null, 
    "title": "Bernina Software Ver 7:  Class 7 Cutwork ", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579914_eefd.jpg", 
    "course_url": "https://www.udemy.com/bernina-embroidery-software-7-class-7-cutwork/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T08:13:20Z"
}