{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course is intended for<strong> Bernina Embroidery Software 7</strong> owners who want to learn more about <strong>Crewel Embroidery Technique </strong>using Bernina Software 7.</p><p><strong>Crewel embroidery</strong>, or <strong>Crewelwork</strong>, is a type of surface embroidery using wool or Lana from Madeira or other thread brands. A wide variety of different embroidery stitches are used to follow a design outline applied to the fabric. The technique is at least a thousand years old.</p><p>The origin of the word <strong>crewel</strong> is unknown but is thought to come from an ancient word describing the curl in the staple, the single hair of the wool. Crewel wool has a long staple; it is fine and can be strongly twisted. Modern crewel wool is a fine, 2-ply or 1-ply yarn available in many different colours.</p><p>The tipical Crewel design will have long stitches as part of the design</p><p>This course is more than 60 min of <strong>Bernina Software 7</strong>, and the 11 th course that is more advanced techniques used where we will explain pull <strong>Crewel Embroidery Technique</strong> using Bernina Software 7.</p><p>We have broken the course down into 6 lectures of not more than 14 min each for your convenience. In each lecture we will cover a section</p><p>In the last lecture ( Bonus Lecture ) you will find the download for the complete course as one video</p><p>Please feel free to try our introduction course as well.</p>", 
    "end_date": null, 
    "title": "Bernina Software 7  Class 11 Crewel Embroidery Technique", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613078_1a29.jpg", 
    "course_url": "https://www.udemy.com/bernina-software-7-class-11-crewel-embroidery-technique/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T19:30:14Z"
}