{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">This course is intended for Bernina Software 7 owners who want to learn more about FSL (Free Standing Lace) using Bernina Software 7.</p><p style=\"\">This course is 189 min of Bernina Software 7, and the first course that is more advanced techniques used where we will explain the Free Standing Lace using Bernina Software 7.</p><p style=\"\">We have broken the course down into 20 lectures of not more than 10 min each for your convenience. In each lecture we will cover a section of the FSL neckline.</p><p style=\"\"><strong style=\"\">Section1:</strong>Introduction to FSL (Free Standing Lace ) </p><p style=\"\"><strong style=\"\">Lecture1:</strong>Introduction to Bernina Software 7 owners who want to learn more about FSL (Free Standing Lace) using Bernina Software 7.</p><p style=\"\"><strong style=\"\">Section2:</strong>Welcome to Free Standing Lace with Bernina Software 7 </p><p style=\"\"><strong style=\"\">Lecture2:</strong>Introduce to basic rules that needs to apply for Free Standing Lace</p><p style=\"\"><strong style=\"\">Lecture3:</strong>Test a new screen to make sure settings we need will be available without redo</p><p style=\"\"><strong style=\"\">Lecture4:</strong>Copyright protection and prepare the artwork in artcanvas</p><p style=\"\"><strong style=\"\">Lecture5:</strong>Create the first stitches and edit until satisfiedl</p><p style=\"\"><strong style=\"\">Lecture6:</strong>Pullcompensation settings is vital, work different groups in different colors</p><p style=\"\"><strong style=\"\">Lecture7:</strong>The stitch and the parameters use with a different fill tool work order explain</p><p style=\"\"><strong style=\"\">Lecture8:</strong>Overlapping of different objects, and pull compensation needs to be checked</p><p style=\"\"><strong style=\"\">Lecture9:</strong>As you go, your order is so important as well as jump stitch eliminations</p><p style=\"\"><strong style=\"\">Lecture10:</strong>Product needs to be done in blocks and the overlapping of stitches holds all wel</p><p style=\"\"><strong style=\"\">Lecture11:</strong>Start and end needs to be checked with every object and with every step you take</p><p style=\"\"><strong style=\"\">Lecture12:</strong>Satin fill or satin outline this whole project needs it, I show you all</p><p style=\"\"><strong style=\"\">Lecture13:</strong>Object Properties settings for every part of the design needs to be checked.</p><p style=\"\"><strong style=\"\">Lecture14:</strong>You will understand why a mono design first gets digitized in different color</p><p style=\"\"><strong style=\"\">Lecture15:</strong>Start and End needs to be checked with every object</p><p style=\"\"><strong style=\"\">Lecture16:</strong>Satin stitches are mainly used some fill stitches help to give unique outcome</p><p style=\"\"><strong style=\"\">Lecture17:</strong>The order of the next object needs to be changed and the effect will explain</p><p style=\"\"><strong style=\"\">Lecture18:</strong>The final object for the one side brings the whole design together as one object</p><p style=\"\"><strong style=\"\">Lecture19:</strong>Placement of design on garments is what will finish and brighten up your design</p><p style=\"\"><strong style=\"\">Lecture20:</strong>Enlanrge the design and objects for a bigger design</p><p style=\"\"><strong style=\"\">Lecture21:</strong>Finalize and show off your amazing designed garment.</p><p style=\"\"><strong style=\"\">Section3:Conclusion and Downloads</strong> </p><p style=\"\"><strong style=\"\">Lecture22:</strong>Start and End needs to be checked with every object</p><p style=\"\">Please feel free to try our introduction course as well.</p>", 
    "end_date": null, 
    "title": "Bernina Software 7 Free Standing Lace Neckline Insert", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485104_a355.jpg", 
    "course_url": "https://www.udemy.com/bernina-software-7-free-standing-lace-neckline-insert/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T10:51:47Z"
}