{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course is intended for Bernina Software 7 owners who want to learn more about Monogramming and Trapunto using Bernina Software 7.</p><p>This course is 140 min of Bernina Software 7, and the first course that is more advanced techniques used where we will explain the Trapunto using Bernina Software 7.</p><p>We have broken the course down into 12 lectures of not more than 12 min each for your convenience. In each lecture we will cover a section of the Trupunto and Monogramming.</p><p><strong style=\"\">Section1: Welcome to Bernina Software 7 Trapunto Monogram course</strong></p><p><strong style=\"\">Lecture1: </strong>Introduction to Trapunto and show samplesusing Bernina Software 7.</p><p><strong style=\"\">Lecture2: </strong>Show stitch samples to understand what will follow now</p><p><strong style=\"\">Lecture3: </strong>What can go wrong, and how to prevent it before you send to the machine</p><p><strong style=\"\">Lecture4:</strong> Let the actual digitizing begin. Explain all steps.</p><p><strong style=\"\">Lecture5: </strong>A peak into Corel draw by sending from design to convert in Corel</p><p><strong style=\"\">Lecture6: </strong>Planning all the steps and preparation to do my monogram</p><p><strong style=\"\">Lecture7:</strong> Use the Monogram option under Digitizing to set my main design, and the order</p><p><strong style=\"\">Lecture8:</strong> More about Monogram. using font and what to know plus border</p><p><strong style=\"\">Lecture9: </strong>continue with the digitizing and editing of objects, add holes in the background</p><p><strong style=\"\">Lecture10: </strong>Organize all objects to allow perfect stitching order.</p><p><strong style=\"\">Lecture11: </strong>Preparing fabric layer where needed and outlines where needed</p><p><strong style=\"\">Lecture12: </strong>Show the applique part and where to layers of applique apply not working</p><p><strong style=\"\">Section 2: Conclusion and Downloads</strong></p><p><strong style=\"\">Lecture13: </strong>Download Links</p><p>Please feel free to try our introduction course as well.</p>", 
    "end_date": null, 
    "title": "Bernina Software 7 Trapunto Monogram advance class", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499800_abb4.jpg", 
    "course_url": "https://www.udemy.com/bernina-software-7-trapunto-monogram-advance-class/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T09:37:30Z"
}