{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course is intended for Bernina Software 7 owners who want to learn more about <strong style=\"\">Zippers are for many a nightmare!</strong> using Bernina Software 7.</p><p>This course is more than 60 min of Bernina Software 7, and the tenth course that is more advanced techniques used where we will explain <strong style=\"\">Zippers are for many a nightmare!</strong> using Bernina Software 7.</p><p>We have broken the course down into 6 lectures of not more than 14 min each for your convenience. In each lecture we will cover a section </p><p>Section1: Welcome to Bernina Software 7 </p><p>Class 10:</p><p>0: Zippers are for many a nightmare! They rather pay someone to do it for them.</p><p> In this class I will not only show you how easy you can fit a zipper for most objects</p><p> in the hoop, but also to finish a wristbag in the hoop.</p><p>...............................................................</p><p>1: Checking our settings before we start any project.</p><p> For this project mostly default setting will be perfect.</p><p>...............................................................</p><p>2: The placement line for a zipper is the first step. </p><p> I explain the steps, and show photos comparing each digitizing step</p><p> with what is expected from you if you start stitching and ading the zip.</p><p>.................................................................</p><p>3: It is not just fitting in the zipper. Also finish off the zipper and the stitches</p><p> needed to finish the zipper, zipper tabs and start with ading the fabric.</p><p> Again: photos added will explain the digitizing techniques very well</p><p>.................................................................</p><p>4: Finish all the steps and all that is needed to do the sideseams on your sewing machine.</p><p> Enjoy ITH zipper project</p><p>-------------------------------------------------------------------</p><p>Section 2: Bonus Section</p><p>Lecture: Download Links</p><p>Please feel free to try our introduction course as well.</p>", 
    "end_date": null, 
    "title": "Bernina Software 7: Class 10:  Zippers are a nightmare", 
    "price": "20.00", 
    "instructors": "Jacqui Viljoen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613060_26dc_2.jpg", 
    "course_url": "https://www.udemy.com/bernina-software-7-class-10-zippers-are-a-nightmare/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T19:05:13Z"
}