{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Learn the art of book binding! In this online class we will learn the techniques and process of making a one-of-a-kind handmade coptic stitch notebook. The course will cover the nitty-gritty details of taking raw materials and forming them into a functional book, as well as covering tips on craftsmanship and production.</p><p>Coptic Stitching is the most popular form of book binding. Coptic Stitching is one of the easier forms of stitched bindings, making it a great way to start learning, and it is one of the most intriguing with an exposed spine and intricate, visible stitching pattern.</p><p><strong>Why Book Binding?</strong></p><p>So, you're probably thinking book binding sounds like an unusual hobby. Well, you're right! After all, we live in an industrial society where every item we use is mass produced; and while a handmade has become a novelty, most people would never consider making their own books. That's why I want to invite you to join the cool kids! This class is for anyone with a sense of adventure and lover of learning. I will teach you the skills to create excellent quality Coptic Stitch books, become better craftsman, and have fun along the way.</p><p><strong>Next Steps!</strong></p><p>I have been making and selling books for years, producing a variety of binding styles, but Coptic Stitching is by far my favorite. I want to share my expertise and skills with you, and hopefully have fun too! My goal is to turn each student into an expert book binder, teach you enough to be self sufficient, and introduce you to terms and techniques so you have the ability to explore new book binding techniques on your own.</p><p><strong>What You Will Learn</strong></p><ul><li>Materials &amp; Tools. We will cover materials and tools needed, where to find them, and brands and tips to keep an eye out for.</li><li><span></span>Process. We will cover the step-by-step instructions of making a handmade Coptic Stitch book.</li><li><span></span>Tips &amp; Tricks. Throughout the class we will talk about tips to improve craft, work more efficiently, use our tools better, and be awesome!</li><li><span></span>Ideas &amp; Alternatives. We will discuss alternative ways to make books, materials to use, and how to make things new and exciting.</li></ul>", 
    "end_date": null, 
    "title": "Bookbinding: Make a Coptic Stitch Book", 
    "price": "45.00", 
    "instructors": "Caleb Sylvest", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578566_229c.jpg", 
    "course_url": "https://www.udemy.com/coptic-stitch-bookbinding/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T01:56:30Z"
}