{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p></p><p><strong>WHY TAKE THIS </strong><strong>CAKE DECORATING COURSE</strong><strong>?</strong></p><p>You may want to create a cake for a birthday party, an anniversary, a\r\ngraduation, or other special occasion, or maybe you would like to acquire the\r\nskills on which to build a new business. I have trained beginner and\r\nprofessional cake decorators alike for many years . . . my online cake decorating\r\nclasses\r\nis in easy step-by-step segments. </p><p>It doesn&#039;t matter if you’re new to cake decorating or have been\r\nstruggling with cake decorating for longer than you’d like to admit . . . not\r\nto worry! </p><p>My Cake\r\nDecorating course will help you to create a work of art on a buttercream canvas that will\r\nastonish your family and friends. Your cakes will be quite the talk, and you\r\nmay soon be the official cake decorator of choice for all who have seen your\r\ndelicious and colorful creations.</p><p>I will teach you the basic skills needed to do any cake from your own\r\nkitchen. Don’t pay those expensive bakery prices when you can create your own\r\nbeautiful centerpieces at home.&nbsp; Bakeries\r\nmust incorporate all their overhead costs in creating their decorated cakes and\r\npass those costs on to you. Cut out those extra costs, and let this course save\r\nyou money and at the same time SIMPLIFY cake decorating . . . a more rewarding\r\nway to spend your time . . . and have fun doing it . . . let&#039;s play!</p><p><strong>WHAT YOU WILL LEARN\r\nIN </strong><strong>THESE ONLINE CAKE DECORATING CLASSES</strong></p><p>In this cake decorating course, you will learn how to get started . . .&nbsp; the equipment you will need, where to buy\r\nspecial decorating tools and supplies and how to prepare the cakes that you will\r\nbe decorating.</p><p>I will be your instructor. I have developed step-by-step lessons that\r\nwill have you quickly decorating like a pro with minimum time and expense.</p><p>I am a National Award Winning, third generation, baker with over 30\r\nyears of decorating experience and has trained scores of professionals in the\r\ncake decorating industry. </p><p>My motto is &quot;Simplify.&quot;&nbsp;\r\nMy methods of instruction make it very easy to learn, and my warm,\r\nfriendly style makes even the most challenging tasks fun and easy. </p><p>This course provides the simple techniques needed to prepare a cake for\r\ndecorating much like an artist would prepare a canvas on which to paint.</p><p>We will start with the Fundamentals to provide you with the background\r\nneeded to create any of the special cakes presented in my step-by-step\r\nspecialized cake decorating demonstration/lectures.</p><p>My Cake Decorating Course allows you to learn at your own pace and in\r\nyour own kitchen. I demonstrate the creation of cakes often costing less than\r\n$10 to make that would sell for as much as $40 - $80 at a&nbsp; high end bakery or grocery store.</p><p>Just imagine the response you will get when you offer your professional\r\nstyled cake at the next family celebration.&nbsp;\r\nYou and your astonishing edible creation will be the talk of the party.\r\nYou will soon be creating Princess Doll cakes, cute little Baby Bear cakes,\r\nseasonal holiday cakes, . . . watch each cake creation as a separate\r\neasy-to-follow demonstration.</p><p>This course is the first step into the exciting and rewarding world of\r\ncake decorating and design. . </p><p><strong>STUDENT BONUS</strong></p><p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n</p><p><strong><em>As an\r\nenrolled student of this course, you will be notified of additional cake\r\ndecorating demonstration/lectures as they are added. You will learn fresh ideas\r\nand techniques from these newly added demonstration/lectures at no additional\r\ncost to you.</em></strong></p><p></p>\r\n", 
    "end_date": null, 
    "title": "Cake Decorating For Fun and Profit ", 
    "price": "20.00", 
    "instructors": "Jodi Schweiss", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27135_c767_10.jpg", 
    "course_url": "https://www.udemy.com/cake-decorating/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-18T17:02:56Z"
}