{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>If you are just starting a calligraphic journey, this short introductory course is for you!</p><p><em>CALLIGRAPHY ... the art of beautiful writing</em></p><p>Perhaps you have been wanting to learn more about using traditional nib and pen-holder to create beautiful letters, but were daunted by the unfamilarity of the tools.</p><p>This course de-mystifies the use of authentic calligraphy instruments.</p><p>Learn :</p><ul>\n<li>to correctly insert the nib into the pen-holder ;</li>\n<li>to load the reservoir and get the ink to flow onto your paper ;</li>\n<li>how to create the thick and thin strokes of the letter ;</li>\n<li>why it is important to keep your pen at a 45° angle ;</li>\n<li>where to place your letters in the guidelines ;</li>\n<li>what the ductus is.</li>\n</ul><p><br></p><p>Presented by Mary-Jane Roussel, a qualified calligrapher and designer, this course starts with a keynotes presentation that will first give you a quick overall view of Calligraphy essentials, followed by a series of videos will help you get started in Calligraphy.</p><p>In the demonstrations, Mary-Jane uses a 3 mm Brause oblique nib in a wooden pen-holder and walnut hull ink.</p><p>After completing this introductory course, you will probably be yearning to learn more about Calligraphy, the Art of Beautiful Writing. You may want to go on to our Simple Gothic Script course, also available on Udemy.</p>", 
    "end_date": null, 
    "title": "Calligraphy: The Basics", 
    "price": 0, 
    "instructors": "Mary-Jane Roussel", 
    "commitment": "22 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651388_5330_2.jpg", 
    "course_url": "https://www.udemy.com/calligraphy-the-basics/", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T16:33:00Z"
}