{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Launched March 2016</strong>! Candle making is one of the most fulfilling and enjoyable of all crafts. You get the creative pleasure and sense of achievement from making your candles and then the enjoyment of using them in your own home, giving them as wonderful gifts or even starting your own craft business. Making candles requires no special skills beyond those taught in this course, it's a craft that's open to anyone - if you can measure flour and boil water, you can make candles!</p>\n\n<p>So why not click the <strong>Start Learning</strong> button to get cracking in this amazing craft. Or continue reading for more info on the course.</p>\n\n<p>This course will take you from knowing nothing about candle making to having <strong>all</strong> the knowledge and skills you need to make a range of gorgeous <strong>pillar</strong> and <strong>container</strong> candles. Once you've completed the course, you'll be able to use your new-found expertise to confidently invent your own candle recipes. </p>\n\n<p>The course is made up of two main parts. In the first part, I'll use a series of animated video lectures to walk you through the essential concepts you need to understand in order to make candles safely. </p>\n\n<p>We'll cover:</p>\n\n<ul><li>Why candle making is such a fantastic craft to learn</li><li>How candles work</li><li>How to use candles safely at home</li><li>The best way to melt wax safely and quickly</li><li>What equipment you'll need (you've probably already got it!)</li><li>How to choose a candle mould</li><li>What sorts of containers you can use for making candles</li><li>The different kinds of wax you can use - and when to use them</li><li>How to use dye to create coloured candles</li><li>How wicks work and which wick to choose</li><li>The two main types of candle making scent</li></ul>\n\n<p><br></p>\n\n<p>In the second part of the course, I'll show you how to make <strong>nine</strong> different candles. I provide complete ingredient lists (I use only standard ingredients you can obtain from most candle suppliers) and you can watch me make the candles live on camera. Every step has been filmed so you can make your candles with me!</p>\n\n<p>We'll make</p>\n\n<ul><li><strong>A basic pillar candle</strong> - the foundational recipe for all pillar candles</li><li><strong>A tea cup container candle</strong> - the basic technique used for all container candles</li><li><strong>A two colour pillar candle</strong></li><li><strong>A pillar candle made using wax chunks</strong></li><li><strong>A pillar candle with a base of coffee beans</strong></li><li><strong>A candle made out of a flower pot</strong></li><li><strong>A candle made in a tin</strong></li><li><strong>A glass container candle</strong></li><li><strong>A glass candle with a transparent base containing coffee beans</strong></li></ul>\n\n<p><br></p>\n\n<p>I'll also show you a range of decorating techniques for your pillar candles including transfers, stencils and stamps.</p>\n\n<p>To keep costs down, I use a relatively small, plastic, mould so you're not wasting wax as you practice but all these techniques can be easily scaled up to a candle of any size.</p>\n\n<p>And I'm on hand to answer any questions you have on candle making - just add a question once you've enrolled. </p>\n\n<p>I'm Kevin Partner of MakingYourOwnCandles and I've been making candles for many years - why not join me by clicking the <strong>Start Learning</strong> button?</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Candle Making for Beginners - a craft for Pleasure or Profit", 
    "price": "25.00", 
    "instructors": "Kevin Partner", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753350_3e15.jpg", 
    "course_url": "https://www.udemy.com/candle-making-for-beginners-a-craft-for-pleasure-or-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T11:53:00Z"
}