{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<span>Large crowd sketching is an important aspect of figure drawing in a crowd.  It also gives an excellent insight into the composing and capturing various actions of human being in a crowd. In this course we are also giving tricks to draw fourteen facial expressions. These expressions will be useful to capture emotions of different people in the crowd.  The step-by-step method and simple techniques of imparting education will help the learners tremendously. We have included all the topics that are required to be covered, to transform you into an artist who could draw large crowd, their actions and emotions. The course will help the learners to obtain a good grounding in the fundamental art principles, and various techniques that are vital in composing and finalizing near and far feeling in a crowd with expression.</span>  </p>  <p>  \tArt guru from Hobitute also explains the principle of perspective while composing the crowd. Also in the lessons that introduce facial expressions helps the learner to understand as to how few simple lines changes the facial expression of human-being. These expressions could be used to give liveliness to the drawing. The materials required to create the artwork are HB and 2B pencils, eraser, sharpener, and Art paper. This is a wonderful course for those learners who wanted to pursue drawing and painting as a hobby or as a serious profession.  </p>", 
    "end_date": null, 
    "title": "Compose and Draw large Crowd Scenes & Facial Expressions", 
    "price": "20.00", 
    "instructors": "Hobitute  Artists", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311336_3c46_13.jpg", 
    "course_url": "https://www.udemy.com/compose-and-draw-large-crowd-scenes-facial-expressions/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-01T06:59:05Z"
}