{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Aprende en este curso cómo elaborar esta cenefa de animales, inspirada en las cuatro estaciones. Es perfecta para decorar tu cocina, para un regalo muy original, o para comenzar tu propio negocio. Te enseñaremos paso a paso cómo trazar, coser y finalizar cada pieza con detalles muy originales. </p><p>Aprenderás a confeccionar la base de la cenefa. Te enseñaremos cómo trazar, cortar y coser los moldes para la casita de los muñecos.<br></p><p>Aprende a cortar la cerca de la casa y a realizar la unión con la puntada filete<br></p><p>Aprenderás a elaborar y coser las partes que decorarán la casa de los animales, con sus respectivas puntadas y el ensamble final.<br></p><p>Aprenderás el proceso de trazar los moldes de los animales para obtener sus figuras; aprenderás a realizar el relleno, la unión, el maquillaje de los animalitos y la decoración.<br></p><p>Aprenderás a confeccionar el conejito: unión, decoración y toques finales. Aprenderás también una puntada especial para las orejitas y la nariz.<br></p><p>Aprenderás el proceso completo para confeccionar los animalitos: en este caso, aprenderás a hacer el marranito y el pollito.<br></p><p>Aprenderás la unión y decoración de cada granja, dividiéndolas en estaciones. Te enseñaremos cómo decorar cada una y hacer los detalles finales.<br></p><p>Te enseñaremos cómo finalizar la cenefa añadiéndole unas agarraderas que te permitirán colgarla en la cocina para decorar.<br></p>", 
    "end_date": null, 
    "title": "Confecciona en lency: Cenefas para la cocina", 
    "price": "20.00", 
    "instructors": "Academia Pleisi", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646128_ee71.jpg", 
    "course_url": "https://www.udemy.com/cenefas-para-cocina/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T19:14:48Z"
}