{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t          Este curso es para todas las personas que les gustan las manualidades y la costura que quieren aprender o perfeccionar sus técnicas en Patchwork.  </p>  <p>  \t          El curso está dividido en 8 capítulos. Primero te enseñamos las técnicas básicas del Patchwork, y luego te llevamos paso a paso a realizar cinco proyectos en los que se usan esas técnicas. El primer proyecto <strong>Cojín Hawaiano</strong> es el más sencillo; es el primer paso para irnos familiarizando con este arte. También realizaremos un hermoso <strong>Camino de Mesa</strong> ideal para adornar el comedor de tu casa, un <strong>Quilt</strong> que se verá fantástico en la habitación de tu bebé y un <strong>Bolso</strong> muy a la moda que se verá espectacular en un día soleado. A través de cada proyecto el nivel de dificultad va aumentando hasta que llegamos al <strong>Cobertor para la Máquina de Coser</strong> el cual es el de mayor dificultad.  </p>  <p>  \t          Cada capítulo está divido en lecciones para que el aprendizaje sea totalmente claro, nos encargamos de llevarte paso a paso para asegurarnos de que no te pierdas ningún paso y dar garantía de que lo podrás hacer.  </p>  <p>  \t          Te mostraremos a través de videos en alta calidad cómo hacer cada proyecto y podrás descargar el material adicional que incluye los moldes y patrones de cada proyecto.  </p>  <p>  \t      Nuestra profesora Carmen Elisa Sanguino heredó de su madre la pasión por la costura, y desde hace más de 10 años decidió dejar su carrera como administradora de empresas y dedicarse totalmente a enseñar y vender sus propias creaciones en Patchwork, sus creaciones se venden en ferias y tiendas, y por su escuela de manualidades han pasado cientos de alumnos que ya son expertos. Ella compartirá contigo todo su conocimiento y secretos para que lo aprendas a hacer como un profesional.  </p>", 
    "end_date": null, 
    "title": "Crea 5 maravillos proyectos en Patchwork", 
    "price": "20.00", 
    "instructors": "Academia Pleisi", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/245964_764d.jpg", 
    "course_url": "https://www.udemy.com/crea-5-maravillos-proyectos-en-patchwork/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-18T18:50:50Z"
}