{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t      Abstract Painting is all about depicting a feeling of a simple object, and making it extraordinary.  It encourages imagination over a precise execution of the environment. Though creating an abstract face painting is a tough job, our guru makes it easy by providing step by step guidelines. The learners are surely going to enjoy, and get benefitted from this course. Every module explains in detail the techniques used to create an abstract face in an efficient manner. In this course, important aspects like composing, drawing, colour balancing, and creating special effects that are required for an abstract art is detailed. The courses would surely tickle the creative senses of the learner, and would mold them into a professional artist and create a sense of abstract thinking. The guru mainly emphasizes in the creation of the abstract face. He brings out an embossed effect to the artwork by developing layers through patch mechanism.  </p>  <p>  \t      The materials used for creating an abstract face includes: canvas or drawing paper, acrylic color paints (black, Persian blue, permanent rose, burnt sienna, vermilion red, yellow ochre and white) and brushes of different sizes (50mm smooth flat brush, 0 and 2 numbered flat smooth brushes, round brush numbered 2).  Here the guru uses acrylic paint for creating the abstract painting. The learners can also try the same techniques using oil paint, poster colors etc. Hobitute art masters would also be introducing more techniques to create beautiful abstract paintings for their enthusiastic learners.Through this painting course, the learners will easily learn the techniques to bring out emotions into a piece of art.  </p>", 
    "end_date": null, 
    "title": "Creating Abstract Face – Techniques in Abstract Art Painting", 
    "price": "20.00", 
    "instructors": "Hobitute  Artists", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/219588_99a5.jpg", 
    "course_url": "https://www.udemy.com/techniques-in-abstract-art-painting/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-15T13:52:28Z"
}