{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"></strong>Este combo é uma verdadeira imersão no universo da Caricatura, permitindo ao aluno aprender tudo que precisa nas mais diversas etapas de produção de uma caricatura, desde a escolha dos materiais até a realização de técnicas específicas. Assim, te municiamos com as habilidades necessárias para você criar sua própria caricatura, com a qualidade de um profissional e ainda com seus toques pessoais.<strong><br><br>Introdução à Caricatura: muito além dos defeitos<br><br></strong>\"A caricatura é a arte de revelar aquilo que a gente tenta esconder\", por A. M. Petersen.<br>O caricaturista, cartunista e artista plástico Leandro Spett divide suas experiências e conhecimentos sobre o universo da caricatura.<br>Através de uma conversa descontraída, você aprende a escolher os materiais adequados para as técnicas de lápis e nanquim, além da melhor maneira de utilizá-los para criar a sua caricatura. O professor ainda coloca em discussão todo o processo de observação, estruturação, criação e finalização da caricatura, explorando truques e compartilhando dicas.<br><strong class=\"redactor-inline-converted\"><br>Caricatura em Aquarela</strong>: <strong class=\"redactor-inline-converted\">técnicas para trabalhar luz, cores, sombra e volume</strong><br><br>Mais do que um desenho de observação, a caricatura envolve a distorção, o humor e o psicológico de quem é desenhado. Quando realizada com a técnica de aquarela, esse tipo de ilustração ganha ainda uma colorização cujo trabalho de manchas, sombras e brilho proporciona um resultado final diferenciado daquele alcançado com outras tintas. O artista Leandro Spett compartilha os processos e materiais que utiliza para criar suas caricaturas em aquarela, exemplificando em cada etapa as práticas que permitem extrair o melhor da mistura de cores para representar, em profundidade e volume, as características que tornam o personagem caricaturado único e inconfundível.<br><br><strong>BIOGRAFIA DO PROFESSOR: Leandro Spett</strong><br><br>\"Comecei desenhando desde pequeno como praticamente todos os desenhistas fazem. Na verdade, assim como toda criança faz. Enquanto algumas param, outras continuam. Eu fui uma daquelas que continuou.\" Leandro Spett é um premiado cartunista, caricaturista e artista plástico, formado pela ESPM. Aprendiz de Paulo Caruso e Gonzalo Cárcamo, Spett já possui obras em países da Europa.<br></p>", 
    "end_date": null, 
    "title": "Curso completo de Caricatura", 
    "price": "40.00", 
    "instructors": "Saibalá - Escola Online de Economia Criativa", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/872646_4208.jpg", 
    "course_url": "https://www.udemy.com/pacote-caricatura/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-08T19:05:10Z"
}