{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">En este curso podrás tener un acercamiento con la  maravillosa técnica del Fondant de la mano de Belinda Kamm nuestra chef  Decochef, quién por años se ha dedicado a este arte y se ha capacitado con las  mejores técnicas en el extranjero. Es un curso que te enseñará &nbsp;cómo elaborar tu propio fondant y que quede extremadamente  moldeable y con un muy buen sabor! &nbsp;También  aprenderás como decorar un pastel entero sin gastar tanto en utensilios. Todo  se decorará con un solo cortador (en forma de estrella) y con la ayuda de una  regla convencional. ¡No es necesario invertir tanto para comenzar a aprender!</p><p style=\"\">Aprende todos los tips y trucos para obtener un pastel  decorado con fondant sin problemas. Olvídate de las rasgaduras,&nbsp; el sabor químico de los fondants comprados, las  recetas de fondant anticuadas con muchos ingredientes difíciles de conseguir, y  de los pasteles de fondant duros y resecos. Con esta receta ahorrarás mucho  tiempo y dinero, ya que producirla sale muchísimo más económica que comprarla  hecha y la podrás guardar durante meses </p><p style=\"\">        </p><p style=\"\">Así que si quieres aprender Fondant como hobby o para darle  más variedad a tu negocio, este es el curso ideal para ti! Sigue paso a paso  las instrucciones de nuestra chef y comienza a crear maravillosos pasteles con  el menor número de utensilios. ¡Únete a la comunidad Decochef y empieza a crear maravillas!<strong style=\"\"><strong style=\"\"></strong></strong><strong style=\"\"><strong style=\"\"></strong></strong></p><p style=\"\"></p><br style=\"\">  ", 
    "end_date": null, 
    "title": "Decoración con Fondant Básico", 
    "price": "25.00", 
    "instructors": "Belinda Kamm", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/66162_377b_6.jpg", 
    "course_url": "https://www.udemy.com/fondant-basico/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-17T02:03:06Z"
}