{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t          Our families are the most important and influential people in our lives. From our mother and father to our siblings, grandparents, cousins and our ancestors - we become the people we are today due to their influence, interaction and legacy. However, how well do we really know our family and genealogy?  </p>  <p>  \t          There is always more you can learn about your loved ones and now there is a fun and personalized way to do that! More importantly, current and future generations will learn more about you and your immediate family in a way that will be cherished and enjoyed through get-together interaction.  </p>  <p>  \t          This course kit will provide you with the instructions to complete a <strong>family tree board game</strong> that will honor YOUR family members and linage based on the direct feedback of those you care about. The final result will be a time capsule, scrapbook and game all in one!  </p>  <p>  \t      This will be a voyage of discovery about what makes each individual in your family so dynamic and amazing. You will discover how each family member truly sees the rest of the family. Consider the game a celebration of what makes each member of your family unique and endearing with each game night.  </p>  <p>  \t          With the exception of some materials listed below, all files and images required to complete your game will be provided to you as downloads. This game will take time to make, but this is YOUR journey to take to preserve your family’s legacy.  </p>  <p>  \t          As a living course, lectures and materials will be updated continuously to provide your family tree board game with even more options.  </p>  <p>  \t          To best understand where you are going, you first need to know where you came from! Let us start the journey into honoring your family, ancestry and legacy…with the ultimate board game! YOUR GAME!!  </p>", 
    "end_date": null, 
    "title": "Develop YOUR Customized Genealogy Family Tree Board Game ", 
    "price": "30.00", 
    "instructors": "Luanga Nuwame", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/225652_f603_4.jpg", 
    "course_url": "https://www.udemy.com/develop-your-customized-genealogy-family-tree-board-game/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-21T23:48:37Z"
}