{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\"><strong style=\"\">LA MANO. DIBUJANDO DESDE ADENTRO </strong></p><p style=\"\">1. <strong style=\"\">Método y estructura</strong>. Aprenderás una serie de medidas completamente basadas en los huesos de la mano. Manejarás una estructura simple que durante el curso nombraremos como el “esqueleto de alambre\".</p><p style=\"\">Esta estructura además de ayudarte a construir la mano con proporciones correctas, es también un excelente recurso para hacer bocetos con ajustes o modificaciones supremamente rápido.</p><p style=\"\">2. <strong style=\"\">Objeto–modelado y visualización</strong>. Por trabajar a partir de fotos nuestro cerebro está acostumbrado a copiar lo que ve y pasarlo al papel. </p><p style=\"\">Además de aprender métodos de geometrización con volúmenes simples, vamos a realizar ejercicios enfocados en enseñarle al cerebro a visualizar la mano como elemento volumétrico para luego pasar a dibujar el volumen.</p><p style=\"\">3. <strong style=\"\">La luz, volumen-atmósfera</strong>. Para poder representar el volumen, es indispensable comprender los comportamientos de la luz y la forma en que esta incide sobre los objetos.</p><p style=\"\">Verás aspectos básicos de la luz y la forma en que estos afectan a los volúmenes simples que usamos para construir la mano. </p><p style=\"\">4. <strong style=\"\">Anatomía, naturalidad – credibilidad</strong>. Con mis años de experiencia como profesor e ilustrador, he podido constatar que la gran mayoría de los errores que se cometen al dibujar figura humana, están concentrados en malas proporciones y posturas incorrectas o imposibles anatómicamente hablando.</p><p style=\"\">Para aprender a dibujar manos más reales y expresivas, es importante conocer algunos aspectos básicos que afectan fundamentalmente la apariencia externa y el movimiento de la mano. No es anatomía médica.</p><p style=\"\">Adicional a los videos del curso, hay un bono de regalo con explicaciones -paso a paso- y ejercicios adicionales.</p> <strong style=\"\">IMPORTANTE</strong>: A dibujar se aprende dibujando. Es fundamental y definitivo que de tu parte exista el compromiso para realizar todos los ejercicios con la mayor frecuencia e intensidad posibles.", 
    "end_date": null, 
    "title": "Dibujar manos con perfección.", 
    "price": "50.00", 
    "instructors": "Miguel Robledo Ruiz.", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519314_3d55_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-dibujar-manos-facil-rapido-y-efectivo/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T17:20:09Z"
}