{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>This course was updated Nov. 21st, 2015!</em><br></p><p>If you have ever wanted to make digital collage sheets from your artwork but didn't know how, this is the course for you. This course will show you how to make digital collage sheets quick and easy in Photoshop. This fun and creative course includes 10 collage sheet templates and several glass overlay effects that will have you creating your collage sheets fast. If you don't know Photoshop, don't worry, there is a \"tools\" section  that will introduce you to the most popular tools. </p><p>This course is for anyone who loves the idea of making collage sheets for fun or for profit. <strong>Digital Collage Sheets Quick and Easy with Photoshop Kit</strong> includes:</p><ul><li> What collage sheets are and how people use them</li><li> Introduction to Photoshop tools</li><li> 10 collage sheet templates to use immediately</li><li> How to use your new templates</li><li> Several glass overlays effects and how to use them</li><li> How to create sales presentations for online sales</li><li> Where to sell your collage sheets</li><li> How to make your own collage sheet templates from scratch</li></ul><p>If you have lots of artwork that you want to use in other projects or make money from, re-purpose them into digital collage sheets with this easy course.<br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Digital Collage Sheets Quick and Easy with Photoshop Kit", 
    "price": "20.00", 
    "instructors": "Cat Whipple", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571386_9702.jpg", 
    "course_url": "https://www.udemy.com/digital-collage-sheets-quick-and-easy-with-photoshop-kit/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T03:57:39Z"
}