{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Are you looking for a beginning drawing course for your child?</strong></p><p><strong>Are you seeking a course that will ensure drawing success and confidence?</strong></p><p><strong>Would you like an experienced teacher guiding your child through the drawing process?</strong><em></em></p><p><strong><em>This course was updated in February, 2016!</em></strong></p><p>The<em> Interactive</em> <em>Drawing for Kids </em>course may be just what you are looking for! Designed with beginners in mind, this drawing course is perfect for ages 5-10 years old. The teaching process used is a kid-tested, step-by-step method that will both inspire and delight your child into drawing action! The process involves organizing shapes and lines together until a recognizable outcome is achieved. As your child works his/her way through this course, he/she will discover that they may then apply the knowledge they gain through each lesson to create unique masterpieces of their own. The <em>Interactive</em> <em>Drawing for Kids </em>course is designed to give young children the tools they need to begin their artistic journey into self-expression, reflection, and creative thinking.</p><p><strong>How does this course work?</strong></p><p><strong></strong>This is a drawing course that students and instructor (me) will build together! I have started building this course by creating and offering 21 drawing lessons. If your child has an idea for a new drawing lesson, simply add the suggestion into the discussion stream. I will then create drawing lessons from those suggestions! One suggestion per student, please. Only kid-friendly (ages 5-10) suggestions will be considered. This course will have a maximum of 50 drawing lessons. </p><p>Let's get creating with the<em> Interactive Drawing for Kids</em> Course! Yay! </p><p><strong>I would love to hear from you.</strong></p><p>Please let me know if you have questions, comments, or suggestions. I will get back to you ASAP.</p><p><strong>About the Instructor:</strong></p><p>My name is Miss Em and teaching art to children is what I love to do! I pride myself on creating dynamic, meaningful, and engaging art lessons that are taught in a relaxing and joyful way. I have nearly 20 years teaching experience in the elementary classroom and in the art studio, and I feel that I have a good grasp on how to create an environment that makes children feel happy, motivated, confident, and successful.</p><p>I look forward to seeing both you and your child in this <em>Interactive</em> <em>Drawing for Kids </em>course.</p><p><strong>Let the creative fun begin!</strong></p>", 
    "end_date": null, 
    "title": "Drawing for Kids: How to Draw Step-by-Step Interactive Art", 
    "price": "20.00", 
    "instructors": "Ms. Em Winn", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618738_b629.jpg", 
    "course_url": "https://www.udemy.com/drawing-for-kids-how-to-draw-step-by-step-interactive-art/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T02:21:37Z"
}