{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>-- <em><strong>Updated 4th June 2016</strong></em> -- (Now with closed captions too!)</p><p>Have you ever wanted to <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">learn to Draw</strong></em>? Perhaps you tried, but did not have the guidance necessary to progress your artwork? Maybe, you used to sketch a long time ago and now want to rebuild your skills? Or, if you want to capture notes more effectively? If you answered yes to any of these questions, then come join me to learn the skills you need to become an effective sketcher!  </p>\n\n\n\n<p>  \tSketching for Beginners is a course designed to guide novice students how to get started sketching and drawing. This course starts at the beginning, with understanding the role sketching can play, before leading on to practical applications and demonstration lectures.  </p>\n\n\n\n\n\n\n\n<p>  \t\t\t\t\t\t          You will not only learn how to sketch using <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">traditional materials</em></strong>, but also how to incorporate this into the modern digital world. You will also see how to develop your own sketching language, how to practice sketching, how to use drawing as a means of communication and more.  \t\t\t\t\t</p>\n\n\n\n\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t          Modules build gradually, with practical exercises and advice supplied in<strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"> illustrated, downloadable eBooks</em></strong>, designed to give you a clear path to follow.  \t\t\t\t\t\t\t\t\t\t</p>\n\n\n\n\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t          The course consists of 4 hours of video content segmented into 25+ modules, additional lectures are being added constantly. Plus, as a lifetime student you have the opportunity to request topics and lectures you would like to see added to the course, at no additional cost.  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Want some feedback on your work</strong>? No problem. This course has a dedicated Q&amp;A section where you can post your questions, ask for some feedback, or simply share your results from the course. I am active most days of the week and ALWAYS reply to questions within this course.<br></p>\n\n\n\n\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t      So, if you have ever wanted to learn to draw, but did not know where to begin. This course is for you. <strong class=\"redactor-inline-converted\">Together we will recapture your natural ability to draw.</strong></p>", 
    "end_date": null, 
    "title": "Drawing and Sketching for Beginners", 
    "price": "20.00", 
    "instructors": "Robin Slee", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382394_63fa_4.jpg", 
    "course_url": "https://www.udemy.com/sketching-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T20:09:07Z"
}