{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>In this course I demonstrate how to construct four Islamic Geometric Patterns step by step using the traditional method of a compass and straight edge.I will also provide you with a step by step handout pdf file for each pattern to supplement the video demonstrations.</p>\n\n<p>In each unit you will learn to construct an underlying grid and outline an Islamic geometric pattern. This course consists of four units:\n\n</p>\n\n\n\n\n\n\n\n<p>- A Sixfold Pattern: The Star and Hexagon</p>\n\n\n\n\n\n\n\n\n\n<p>- An Eightfold Pattern: The Khatam</p>\n\n\n\n\n\n\n\n\n\n<p>- A Sixfold Pattern: The Ferozkoh Jaali</p>\n\n\n\n\n\n\n\n\n\n<p>- An Eighfold Pattern: The Geometric Rosette<br></p>\n\n\n\n\n\n\n\n\n\n<p>You will also learn additional techniques:</p>\n\n\n\n\n\n\n\n\n\n<p>- Tiling the pattern, for both fourfold and and sixfold patterns;</p>\n\n\n\n\n\n\n\n\n\n<p>- Creating a ribbon effect to interlace the pattern;</p>\n\n\n\n\n\n\n\n\n\n<p>- Transferring the pattern using tracing paper and a spoon;</p>\n\n\n\n\n\n\n\n<p>- Adding colour using watercolour pencils and an aquabrush.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Depending on your pace, each pattern may take 10 to 20 minutes to construct. The interlacing and tiling will take longer. As you work through the course, you will develop your compass and ruler and construction skills. Each pattern is a level up from the previous.</p>\n\n\n\n\n\n\n\n\n\n<p>You will need a compass, ruler, pencil, plain paper, tracing paper, <br>eraser and masking tape.  I also use watercolour pencils and an aquabrush. However, you will gain enough skills to be able to transfer a pattern to the surface of your choice - how you add the colour is up to you, colouring pens or pencils, paints and beyond!</p>\n\n\n\n\n\n\n\n\n\n<p>This course is aimed at beginners with an interest in the geometric patterns they have seen in and around the Islamic world and beyond. Many people haven't used a compass since their school days, if that's you, you can rediscover all the potential it holds.</p>\n\n<p><br></p>\n\n<p>All the videos on this course feature a remixed version of the song \"Montmartre\" by Jahzzar, from the Free Music Archive used under CC BY-SA 3.0</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Draw Islamic Geometric Patterns With A Compass And Ruler", 
    "price": "20.00", 
    "instructors": "Samira Mian", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/819676_1d06_10.jpg", 
    "course_url": "https://www.udemy.com/islamic-geometry-using-a-compass-straight-edge/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-12T10:51:39Z"
}