{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>In this course you'll discover the wonderful world of charcoal and eraser drawing by creating an adorable furry teddy bear on paper. <br></p>\n\n<p>Don't let the whimsical nature of the subject matter fool you though. You will be learning solid fundamental art skills which are applicable to just about any charcoal drawing project. </p>\n\n<p>If you've ever wondered about charcoal drawing, but thought it might be too hard or too messy then think again!  You'll soon see that charcoal is a highly versatile, easy to use and very forgiving medium.<br></p>\n\n<p>All the art materials and techniques are explained in an easy to understand manner. Instructor Cindy Wider is with you every step of the way, as she demonstrates the creation of the bear step-by-step right from the start to the finish.</p>\n\n<p><strong class=\"redactor-inline-converted\">Who is this course for?</strong></p>\n\n<p>This course is absolutely ideal for complete beginners. </p>\n\n<p>On the other hand, if you are experienced in other mediums but have been searching for an easy and fun introduction to charcoal drawing then this course is also for you.</p>\n\n<p><strong>Its time to roll up your sleeves and get hands on with charcoal and eraser!</strong></p>\n\n<p>You will amaze yourself, your friends and your family as your bear comes to life with fluffy realistic looking fur and a twinkle in its eye. You'll also learn how to customise your bear to make it uniquely yours.</p>\n\n<p>To complete the bear in one sitting then allow at least half a day, but take your time, there's no rush. Just relax and enjoy creating your bear at your own pace.</p>\n\n<p>The finished bear will look great hanging on your wall, or maybe you'd like to give it as a gift to someone special. Oh, and when your bear is finished don't forget to share it! We would love to see your creation.</p>\n\n<p>So come on, roll up your sleeves and start creating your bear! </p>", 
    "end_date": null, 
    "title": "Draw a Cuddly Teddy Bear using Charcoal and Eraser", 
    "price": "20.00", 
    "instructors": "Cindy Wider", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/809908_fc6e.jpg", 
    "course_url": "https://www.udemy.com/how-to-draw-charcoal-teddy-bear/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-01T11:21:12Z"
}