{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t                     The course is about drawing human actions or various poses that a human being typically does. In this course the art guru from Hobitute explains the composition and techniques of sketching the human body by reveling simple geometrical aspects of body while a male or female in different actions. If you have basic understanding of the techniques of drawing Human Anatomy, then this course will become very easy for you. Please take a look at the Human Anatomy course of Hobitute artists. The step-by-step methodology and simple techniques of imparting education will help the learners tremendously. We have included all the topics that are required to be covered, to transform you into a realistic artist who could draw  different human actions in figure drawing and painting. The course will help the learners to obtain a good grounding in the fundamental art principles, and various techniques that are vital in composing and finalizing beautiful, vibrant figure &amp; action drawings and paintings.  </p>  <p style=\" text-align:justify; \">  \t                    While composing the actions, it is important to note that the approach to create the male body is different from that of the female body. The Art Guru from Hobitute effortlessly helps the learners to understand this difference in the approach. You will enjoy the whole course as it gives you confidence and techniques required to create the art work by yourself.  The materials required to create the artwork are HB and 2B pencils, eraser, sharpener, and Art paper. Ability to draw Human Actions is important aspect for the learners who want to pursue painting as a hobby or as a serious profession.  </p>", 
    "end_date": null, 
    "title": "Drawing Human Actions to Master Figure Drawing and Painting ", 
    "price": "25.00", 
    "instructors": "Hobitute  Artists", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297094_69a8.jpg", 
    "course_url": "https://www.udemy.com/drawing-human-actions-to-master-figure-drawing-and-painting/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T14:36:45Z"
}