{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Being able to draw is one of the most rewarding hobbies available. It is extemely cheap, can be started and stopped at a moments notice, and you can get some terrific results in a matter of minutes.</p>\n\n<p> But beginners and new artists are faced with a challenge, \"How can I create good looking images, if I have never learned to draw?\" Well, the answer my friend, is waiting for you in this course.</p>\n\n<p>'<strong>Drawing from Photographs</strong>' is your guide to creating hand-drawn images by using photos as your reference. In this course, I will be your 'drawing-guide' as I walk you through the entire process from choosing the right image, to mapping out your framework and finally in to the shading process. I will also share with you have to add those final enhancements using the computer.</p>\n\n<p>There is no special terminology or advanced concepts to grasp. Everything I did to create the main project, I share with you in simple terms. There is also no time constraint. One of the joys of creating pencil drawings is that you can start and stop when you have the time. So if you can only do 20-30minutes a day. You can draw, stop, put away your image and come back to it later. Great for those of us with a busy life!</p>\n\n<p>The course is broken down into short lectures. Each focusing on a single step in the process. As you complete each step, you will have laid the foundation for the next lecture. This is very much a follow-along course. And once you have completed this process a couple of times, you will be able to adapt the work-flow to suit your own style.</p>\n\n<p>This course is for anyone who wants to learn how to draw and have their images look professional and well crafted. Even if you have not drawn for years, do not consider yourself creative or have always put-off learning because of the time investment then this course is for you. </p>\n\n<p>Come join me and start drawing your image today!<br></p>", 
    "end_date": null, 
    "title": "Drawing From Photographs", 
    "price": "20.00", 
    "instructors": "Robin Slee", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/840450_a071.jpg", 
    "course_url": "https://www.udemy.com/drawing-from-photographs/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-05T14:22:51Z"
}