{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>&gt;&gt;Over 1000 students!&lt;&lt;</strong></p><p>This course teaches you the essentials of drawing animals. There's <strong>over 8 hours of high definition, high quality content covering drawing skills, animal anatomy, and rendering</strong>.  \t   \t In Part 1 you'll learn valuable exercises to:  </p>  <p>  \t - Develop your observation skills and  </p>  <p>  \t - Improve your ability to draw 3D objects.  </p>  <p>  \t These skills will set you in good stead for mastering the rest of the course.  </p>  <p>  \t In Part 2 we go through general animal anatomy. You will learn about the anatomical features common to most animals, making it easier for you to learn how to draw any animal. I discuss the different parts of an animal's body, it's skeleton and muscles, and how size affects animal anatomy.  </p>  <p>  \t Then there is the main body of the course. Here you will learn how draw individual species. In <strong>easy, step-by-step tutorials</strong> you will be guided through steps to drawing animals' heads and bodies from a variety of views. These tutorials are where you will apply the knowledge you have learned in parts 1 &amp; 2.  </p>  <p>  \t Species you will learn to draw include:</p><ul><li>horses</li><li>eagles</li><li>big cats (like lions, tigers and leopards) </li><li>small cats (like your friendly house cat)</li><li>wolves </li><li>and more... </li></ul><p>Finally you will finish the course learning how to render your animal drawings. Here you will <strong>learn the basics of drawing light and shadow</strong>. You will also <strong>learn how to render animals' eyes, fur and feathers</strong>.  </p>", 
    "end_date": null, 
    "title": "Drawing Animals: From Anatomy to Rendering", 
    "price": "20.00", 
    "instructors": "Geoffrey Jacobs", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/210230_df03_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-draw-animals/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-04T07:19:31Z"
}