{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Welcome! In this course, you'll learn how to draw more effectively and confidently by using artistic techniques and drawing methods including</p><ul><li>timed gesture drawing</li><li>timed contour drawing</li><li>drawing from touch</li><li>drawing as response to music</li><li>continuous line drawing</li><li>1-point and 2-point linear perspective</li><li>reductive charcoal method</li><li>drawing ellipses to show angle and depth</li><li>still life drawing</li></ul><p><span></span>You'll understand how to add value or lighting and tonality to your drawings, including using blending, stippling, hatching, and cross-hatching. You'll also learn how to add depth to drawings using various techniques. You can then post photos or scans of your drawings and post them to the discussion forum for critique.</p><p>This course is taught by Jon Seals, an accomplished artist who has had work exhibited in various venues, has curated various visual art shows, and has taught visual art at the high school and university levels. Jon Seals has an MFA in Painting from Savannah College of Art and Design and an MAR from Yale University.</p><p>Enroll now and start improving your drawings!</p><p>Basic supplies needed to follow along include pencils for most lessons, as well as charcoal drawing tools for a few lessons. A sample drawing kit is shown and described in the lecture on materials.</p>", 
    "end_date": null, 
    "title": "Drawing for Beginners - Bring Your Ideas to Life on Paper", 
    "price": "25.00", 
    "instructors": "Dr. Chad Neuman, Jon Seals, MFA", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453362_14b5_3.jpg", 
    "course_url": "https://www.udemy.com/drawing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T19:54:41Z"
}