{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\" text-align:justify; \">  </p>  <p style=\" text-align:justify; \">  </p>  <p style=\" text-align:justify; \">  \t        The course is about drawing lifelike pictures of male and female body effortlessly. In this course the Hobitute art guru explains the learners about the sketching of the body structures - both male and female - in a simple and effective way through step by step teaching mechanism. The learners are surely going to enjoy geometry behind the human anatomy, and get benefitted from this course. We have included all the topics that are required to be covered, to transform you into a realistic artist who could draw any Human Body. The course will help the learners to obtain a good grounding in the fundamental art principles, and various techniques that are vital in composing and finalizing beautiful, vibrant figure drawings and paintings.  </p>  <p style=\" text-align:justify; \">  \t<br>  </p>  <p style=\" text-align:justify; \">  \t        The male body is different from that of the female body. The guru effortlessly helps the learners to understand the difference in the approach taken to draw and shade male and female bodies. The materials used to create the artwork are HB and 2B pencils, eraser, sharpener, Art paper. The course is structured in such a way that the learners can easily learn to construct a human body in a quick and efficient manner. Anatomy of Human body is a critical to the learners who wanted to pursue painting as a hobby or as a serious profession.  </p>  <p style=\" text-align:justify; \">  </p>", 
    "end_date": null, 
    "title": "Easy Steps to Figure Drawing - Anatomy of Male & Female Body", 
    "price": "20.00", 
    "instructors": "Hobitute  Artists", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297092_e142_4.jpg", 
    "course_url": "https://www.udemy.com/easy-steps-to-figure-drawing-anatomy-of-male-female-body/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T14:35:49Z"
}