{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Up to Date as at: October 2015.</strong></p><p>Embird: Machine-Independent Embroidery Software  More than 70 embroidery file formats and 20 home and industrial machine brands supported. Embroidery designs digitizing, editing, management, lettering and more!  \t\t\t  \t\t  \t    </p><p>  \t<strong>Embird Manager</strong>  </p>  <ul>  \t<li>Embird Manager Snapshot</li>  \t<li>Converts designs among many embroidery and quilting file formats.</li>  \t<li>Supports many hoop types and sizes.</li>  \t<li>Processes designs in ZIP and RAR archives.</li>  \t<li>Displays designs in 1:1 scale and other scales.</li>  \t<li>Displays also images - digital photos (.JPG, .TIF, etc.) and allows to sort them.</li>  \t<li>Creates (displays, prints and saves into .BMP or  .JPG file) various types of design documentation, including animated .GIFs and screen saver.</li>  \t<li>Provides photo-realistic 3D preview of designs in order to enable assigning of proper colors to needles and to check the design without actual embroidering.</li>  \t<li>Contains many threads catalogs and finds thread closest to chosen color.</li>  \t<li>Reads and writes designs stored on memory cards, floppy or hard disks in various embroidery formats.</li>  \t<li>Allows to organize designs by copying them to new folders.</li>  \t<li>Supports Amazon and Azure cloud storage.</li>  \t<li>Provides separate File Commander window for convenient file management.</li>  </ul>  <p><strong><br></strong></p><p>  \t<strong>Embird EditorEmbird Editor</strong>  </p>  <ul>  \t<li>Embird Editor Snapshot</li>  \t<li>Allows to insert and delete colors or trims in design.</li>  \t<li>Joins and splits designs. Interactive free-hand splitting and automatic splitting are supported.</li>  \t<li>Moves, resizes with density adjustment, centers, mirrors, rotates and skews designs or their parts.</li>  \t<li>Allows to edit individual stitches or parts of design.</li>  \t<li>Allows to change the stitch order of design parts.</li>  \t<li>Simulates sewing of design, even in 3D mode.</li>  \t<li>Allows to reduce the number of colors.</li>  \t<li>Sorts colors smartly.</li>  \t<li>Prints template in 1:1 scale on multiple sheets.</li>  \t<li>Inserts text in various pre-digitized fonts and layouts. More about lettering here</li>  \t<li>Inserts Font Engine text automatically converted from TrueType or OpenType fonts.</li>  \t<li>Imports designs from Embird Studio, Embird Cross Stitch and Sfumato Stitch programs to save them in appropriate file format.</li>  </ul>  <p><br></p>", 
    "end_date": null, 
    "title": "Embird Software Class An Introduction to Embird Manager", 
    "price": "20.00", 
    "instructors": "Philip Viljoen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382912_d779_3.jpg", 
    "course_url": "https://www.udemy.com/embird-embroidery-software-introduction-to-embird-modules/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T10:30:50Z"
}