{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Embird Embroidery Software: Continues line quilting blocks</strong>  </p>  <p style=\"\">  \t  In this Course &quot;Embird Embroidery Software: Continues line quilting blocks&quot; we will create a <strong style=\"\">Quilt design</strong> for machine embroidery with Embird Embroidery Digitizing Software. Digitize an embroidery design in Outline stitch with Embird.  </p>  <p style=\"\">  \t<strong style=\"\">Embird Embroidery Software: Continues line quilting blocks</strong>  </p>  <p style=\"\">  \t  Embird Studio allows easy and fast creation of Quilt Designs and other designs from photos or without photos.  </p>  <p style=\"\">  \t  Student does not import a photo into the background of the working area and then draws free hand objects in the Digitizing Tools.  </p>  <p style=\"\">  \t  Special controls and paramaters are available to tune density and colors.  </p>  <p style=\"\">  \t  Additional features like openings, carvings and color mask can be applied to achieve required stitch layout and texture.  </p>  <p style=\"\">  \t  This course is for Embird Embroidery Digitizing Software Digitizers who has a fair to good knowledge of their Embird Embroidery Digitizing Software.  </p>  <p style=\"\">  \t<strong style=\"\">We will only focus on working with Embird Studio</strong>  </p>  <ul style=\"\">  \t<li style=\"\">how to apply parameters to get the best results from your design</li>  \t<li style=\"\">we teaches the use of different color</li>  \t<li style=\"\">the use of parameters inside Studio Stitch</li>  \t<li style=\"\">How to achieve an end result that will be a joy to stitch</li>  </ul>  <p style=\"\">  \t  The complete Course consist of over<strong style=\"\"> 53 minutes of video</strong> material broken down in 10 classes of 5+ minutes each to learn and apply to your Quilt designs.  </p>", 
    "end_date": null, 
    "title": "Embird Embroidery Software: Continues line quilting blocks", 
    "price": "20.00", 
    "instructors": "Philip Viljoen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386530_e215_2.jpg", 
    "course_url": "https://www.udemy.com/embird-software-training-create-a-continues-line-quilting-block/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T10:19:15Z"
}