{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \tHace casi un año que puse este curso en línea y, en este tiempo,<strong> obtuvo más de 1680 entusiastas en busca de nuevas ideas. </strong>El curso se ofreció de modo gratuito para que puedan conocer la propuesta de Estimula tu creatividad, El promedio de la calificación fue de 4 estrellas. Quienes hicieron el curso dijeron:</p><p><strong>\"</strong><strong>Excelente<br></strong><em>Es un curso que te permite desarrollar tu creatividad. y te pone sumamente activa.</em>\" <em>por Shirleyann Williams Smith</em></p><p><strong>\"Una técnica interesante<br></strong><em>me sorprendió la novedad de esta técnica, creo que entrega la información básica necesaria para comenzar con los ejercicios creativos.</em>\" <em>por Cristina Rojas</em></p><p><strong>\"Todo sirve!<br></strong><em>Muy útil y ademas aplicable en todo</em>!\" <em>por Nora Pérez Barrio</em></p><p>\"<strong>Estimulación creativa<br></strong><em>Es bueno, como un recurso para generar la creatividad en épocas de crisis para la innovación.</em>\" <em>por Leonardo Lopez</em></p><p><strong>Estimula tu creatividad</strong> es un curso ideal para aquellos que están en la búsqueda constante de nuevas maneras para desarrollar nuevas y buenas ideas. Como novedad te propongo <strong>al Tarot como guía para motivar </strong>el proceso creativo.<br></p>  <p>  \t<strong>¿Sentís que te falta inspiración?</strong>, entonces Estimula tu Creatividad es lo que necesitas hacer para recuperar la inspiración. La propuesta se centra en poder utilizar el mazo de <strong>Tarot como guía para el desarrollo de nuevas ideas</strong>. Nos corremos del uso oracular que puede darse a este mazo para poder -a partir del trabajo sobre sus imágenes- compensar aquellos recorridos que no se han realizado o que se han recorrido muy poco.  </p>  <p>  \tA través del lenguaje simbólico que porta el mazo podremos desarmar la frase popular: <strong>“si hace siempre lo mismo, obtendrás siempre lo mismo”</strong>. El trabajo sobre las cartas te permitirá hacerte de <strong>nuevas herramientas</strong> para activar tu creatividad y comenzar a realizar cosas diferentes para obtener nuevos resultados.  </p>  <p>  \tAprenderás una manera fácil y entretenida un modo para <strong>estimular tu creatividad</strong> que no te llevará más de una hora de tu tiempo, y que podrás implementar cuántas veces quieras en el momento que lo desees.  </p>  <p>  \tEs un curso <strong>apto para todo aquel que quiera desarrollar sus ideas</strong>. La mayoría del trabajo sobre las cartas se realiza a través de la técnica de collage, por lo tanto no es necesario más que tener ganas de experimentar cosas nuevas.  </p>  <p>  \tEl curso está estructurado en <strong>cuatro secciones</strong><strong>, 14 clases en video y texto más material complementario</strong>.  </p>  <p>  \tLa primera sección está dedicada a: consejos sobre el modo para hacer el curso y sacarle <strong>el mejor de los resultados</strong>.  </p>  <p>  \tLa sección segunda está dedicada a: <strong>la creatividad</strong>. Reflexionaremos sobre qué entendemos por creatividad, cómo la aplicamos y te propongo un ejercicio y un test para que puedas definir tu capacidad creativa y analices el modo en el que enfrentas nuevas situaciones.  </p>  <p>  \tLa sección tercera está dedicada a: <strong>el Tarot</strong>. Recorremos las características principales de este mazo. Te propongo dos mazos para que trabajes en función a los imaginarios que cada uno administra. Te daré las herramientas de comprensión de las cartas para que puedas ubicar en “tiempo y espacio” a tu ciclo creativo.  </p>  <p>  \tLa cuarta y última sección te muestro cómo puedes <strong>activar tu creatividad</strong> -de un modo práctico- mediante el trabajo con las cartas del mazo de Tarot.  </p>  <p>  \tAl terminar el curso:  </p>  <ul>  \t<li>Tendrás entre manos una<strong> forma novedosa</strong> para activar tu creatividad cuando lo necesites</li>  </ul>  <ul>  \t<li>Sabrás cuestiones básicas sobre Tarot</li>  \t<li>Diferenciarás tipos de inteligencias </li>  \t<li>Manejarás la técnica de collage para activar      la creatividad</li>  </ul>  <p>  \tSi quieres poner a danzar tus nuevas ideas, <strong>¡apúntate ahora!</strong>  </p>", 
    "end_date": null, 
    "title": "Estimula tu creatividad", 
    "price": "20.00", 
    "instructors": "Gabriela Gómez Del Río", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350822_141d.jpg", 
    "course_url": "https://www.udemy.com/estimula-tu-creatividad/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T12:46:57Z"
}