{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course was designed so beginners and advanced quilters alike could run all the threads, not just the boring ones. From sit down machines to stand up, because we are all by ourselves and often consider giving up on that gorgeous thread. You know that frustrated feeling. We have all been there. Take heart, it is all about to change for you. You don't have to settle anymore.</p><p>Learn how the cone relates to the thread guides, relates to the running speed, relates to the bobbin tension and more...whether you machine quilt with a traditional machine or a long arm machine.</p>\n\n<p>This course was conceived at Houston Market when everyone was complaining about their machines and how bad they were. Many were really considering getting different machines or using them for boat anchors. Imagine! Then it dawned on me, they were using the wrong size needles, and the wrong stitching speed.</p>\n\n<p>And that stitching speed is something the thread manufacturers don't tell you! And with today's high speed machines that can be a problem that you may never had considered. Especially when you are about to use your sewing machine for a boat anchor.</p>\n\n<p>This course was designed so beginners and advanced quilters alike could run all the threads, not just the boring ones. Because we are all by ourselves and often consider giving up on that gorgeous thread, you know that frustrated feeling. We have all been there. Take heart, it is all about to change for you. You don't have to settle anymore.\n</p>\n\n<ul><li>Image adjusting all your threads, so every inch off the cone to the needle to the bobbin is problem free in your quilt project.</li><li>Use the step-by-step ways to set up your machine when you are just starting out with no one to help you.</li><li>Run the beautiful threads you've already invested in and sadly given up on.</li><li>This course pays is about</li><li>Learn the IMPORTANT relationships, thus adjustments, of all the points the thread touches from cone to quilt top.</li></ul>\n\n<p>Let's get stitching.</p>\n\n\n\n\n\n<p><strong><img src=\"https://d2vvqscadf4c1f.cloudfront.net/aH5dGzG7R7Coof0rGs1T_Bobbin-Case-388x388.jpg\"></strong></p>\n\n\n\n<p>And did you know, there are no rules.<br></p>\n\n<p>Yes it is okay to skip thread guides, see how.</p>\n\n\n\n<p>In Part One:</p>\n\n<ul><li>tweak the threadpath through the thread guides</li><li>find the correct running speeds that manufacturers don't tell you about</li><li>learn bobbin tension adjustments</li><li>pick the right needle</li><li>pick the right needle size</li><li>find the right adjustment for fabric tension</li><li>cone placement and more, lots more\n\n</li></ul>\n\n<p>We go over each one in detail and how if affects the different threads.</p>\n\n<p>Just think of all those fabulous threads that are just waiting to see the light of day, for that wonderful scrappy strippy quilt top, for Show Quilts or Grandma's Flower Garden.</p>\n\n<p><strong>Let's get them out, dust them off and finish that project.</strong></p>\n\n\n\n<p>Oh HAPPY Quilty DAY!</p><p>Sally Terry</p><p><br></p>", 
    "end_date": null, 
    "title": "Every Machine Quilter's Guide To Sewing  With Threads", 
    "price": "30.00", 
    "instructors": "Sally Terry", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489776_dd63_2.jpg", 
    "course_url": "https://www.udemy.com/machine-quilting-threads/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T20:51:42Z"
}