{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>How to Paint an Abstract Painting</strong><strong>? </strong>It all begins, with having a strategy, or knowing a process. In this course I'll be demonstrating my own<strong> 7 Step Method to Abstract Painting, </strong>a process I just recently developed, and am very excited about. It's an almost Fool Proof Method to create really fine abstract paintings.</p><p>Some of the Benefits include;</p><ul><li>Learning a Step by Step Plan to make Abstract Painting Easy and Fun!</li><li>A New found Confidence in your own ability to create Abstract Paintings</li><li>Finding out a few of my personal Secrets to successful abstract paintings</li><li>My own personal guidance &amp; encouragement along the way</li><li>Choosing the right materials</li></ul><p>I will show you step by step how to create some of my most popular abstract paintings, with Easy to follow Video Lessons.<br><br>There is a Supply List provided in Lecture 1 with suggestions to get you started, of course if you already have supplies, you can use those.<br><br></p><p><strong>Key Features of taking Courses with me</strong></p><ul><li>Unlimited Lifetime Access</li><li>a growing Community of Artists </li><li>The Instructor available to answer any questions</li><li>Closed Captions provided on each Video</li><li>One Time Payment for each course, no membership fees</li><li>Watch Anytime / Anywhere (that you have internet access)</li></ul><p>Through the lectures in this course I will guide you through the process so even someone who's never painted before can understand it. I'll go over some of my personal strategies for designing a pleasing composition, and I'll have you jump right in to the Fun part, Creating your own gorgeous Abstract Paintings.</p><p>Anyone wanting to Learn How To Paint  an Abstract Painting should benefit from this Course, and even for the beginner I don't think it will be too challenging as I've boiled it down to 7 simple steps.</p><p><strong>NOW please Watch the PREVIEWS Below, and Check out what other Students Say</strong></p><p><br></p><p><strong>Thank You, Andy Morris</strong></p>", 
    "end_date": null, 
    "title": "Exciting 7 Step Method to Abstract Painting", 
    "price": "20.00", 
    "instructors": "Andy Morris", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687216_6f69_2.jpg", 
    "course_url": "https://www.udemy.com/7-step-method-to-abstract-painting/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T18:36:26Z"
}