{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Fühlst du dich auch oft mit all den Dingen, die du jeden Tag tun musst, überfordert?</p><p>Hin und wieder wahrscheinlich schon. Manchmal fühlt sich die tägliche Arbeit, die es zu bewältigen gilt, wie ein Berg an und man hat keine Ahnung, wie man all das an einem einzigen Tag bewältigen soll.</p><p>Beim Planen oder Filofaxing geht es darum, eine Struktur in den Tagesablauf zu bekommen und sich wirklich einmal in der Woche hinzusetzen und aufzuschreiben, was man über die Woche alles machen muss. Das hilft, die Gedanken frei zu bekommen für neue Dinge und dennoch alles wichtige nicht zu vergessen. Außerdem sorgt strukturiertes Planen dafür, dass man einfach mehr Zeit für die wichtigen Dinge im Leben hat. </p><p>Ein Planer ist auch etwas sehr persönliches. Er kann nicht nur die täglichen Termine beinhalten sondern auch viele andere Dinge, die man immer wieder benötigt. Dazu gehört zum Beispiel eine Liste der Lieblingsrezepte, eine Wunschliste oder eine Übersicht über all die Dinge, die einem wichtig sind. Der Fantasie sind hier keine Grenzen gesetzt. </p><p>In unserem Planer integrieren wir auch gerne Fotos und unterstreichen so, dass das Planen aus dem Scrapbooking kommt. Wir zeigen, was jeden Tag passiert ist, um sich immer wieder an die schönen Momente des Monats oder Jahres zu erinnern. So wird der Planer zum Scrapbook und ist dennoch nicht einfach ein Fotoalbum sondern etwas, das man jeden Tag in den Händen hält.</p><p>In dem Planer Anfängerkurs wollen wir dir einfach nur zeigen, was es alles gibt und was du alles mit deinem Planer machen kannst. Filofaxing ist ein vielfältiges Hobby, für das man schöne Dinge basteln kann.</p><p>Und das beste: Man kann neue Freunde finden, Planner Buddies, die mit einem schöne Materialien tauschen, so dass man immer wieder neu inspiriert wird!</p><p>Filofaxing - ein Hobby, das dein Leben wie in einem Scrapbook dokumentiert und immer dabei ist!</p>", 
    "end_date": null, 
    "title": "Filofaxing - ein Scrapbook, das dein Leben organisiert", 
    "price": 0, 
    "instructors": "Angelika Brunke", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669500_310b.jpg", 
    "course_url": "https://www.udemy.com/filofaxing-ein-scrapbook-das-dein-leben-organisiert/", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T09:49:12Z"
}