{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t          Created for up-and-coming floral artists and anyone who enjoys playing with flowers, this course is packed with things you never knew about floral design. Sandy’s high energy and positive encouragement will leave you ready to explore the field of professional floral design. This course introduces the basic concepts of floral design in lectures targeted to illustrate the connection between many aspects including an array of tools of the trade, color combinations, and visual balance. Led by an instructor with a lifetime of experience and a knack for teaching, topics zone in on the key components that set floral design above mere flower arranging.  </p>  <p>  \t          Each section includes a video or illustrated audio lecture to explain how the topic relates to the foundational instruction. Summary text, Checkpoint Challenges, and brief quizzes help make sure the big concepts stick as you begin applying your new skills. The discussion forum is a great place to exchange ideas with other burgeoning entrepreneurs. And Sandy is always responsive to messages sent from the class interface<em style=\"\">.</em>  </p>  <p>  \t          Savvy shoppers will appreciate the budget conscious recommendations for the array of tools professional designers use and where to find them. Insider quick-tips including flower preservation and scissor sharpening using products already in your home. Participants learn the importance of the dozens of choices made to create a single arrangement. Samples are effortlessly assembled before your eyes while essential information is presented regarding color, balance, containers, and supplementals.  </p>  <p>  \t          Encouragement to &quot;break the rules&quot; and mix artificial with fresh florals to create memorable designs will anchor the course through inspirational examples. Insider industry secrets put you on the fast track to generating another stream of income or developing a new career path. Creative spirits looking for memorable floral gifts ideas for friends, family, or profit will find a wealth of information to spark success in this course.  </p>", 
    "end_date": null, 
    "title": "Floral Design -- Not Just Flower Arranging", 
    "price": "25.00", 
    "instructors": "Sandy McVey", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/261320_a34c_14.jpg", 
    "course_url": "https://www.udemy.com/floral-design/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-14T19:23:18Z"
}