{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Many beginners are intimidated by oil painting and paint with acrylics instead.</strong> The approach of painting in layers using oils can be difficult to control leading to spoiled colors. A way to solve this transition is to use acrylics to lay out the painting and then move onto oils to complete the painting. By following a simple step-by-step process the transition to oil painting can be done quickly and easily.  </p>  <p style=\"\">  \t <strong style=\"\">Complete a large oil painting in one day!</strong>  </p>  <p style=\"\">  \t <strong style=\"\">This course will show you a step-by-step method that you can use with confidence</strong>. A series of demonstration videos will clearly show you how to prepare your painting surface in acrylics. Then compose and lay in your shapes using acrylics. Develop shapes in acrylics followed by oil painting stages to complete the painting.  </p>  <p style=\"\">  \t   This approach will give you confidence to learn oil painting with a solid foundation in acrylics. Once you are confident with this transition method you can decide to leave out the acrylic stage altogether. Alternatively retain the acrylic stages as a practical method to complete oil paintings quickly.  </p>  <p style=\"\">  \t   The course is structured around the typical painting process from idea to preparation of painting materials and finally the painting steps itself.  </p>", 
    "end_date": null, 
    "title": "From Acrylics To Oil Painting in 5 Easy Steps", 
    "price": "20.00", 
    "instructors": "Malcolm Dewey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/215910_b0be_6.jpg", 
    "course_url": "https://www.udemy.com/from-acrylics-to-oil-painting-in-5-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-12T06:49:39Z"
}