{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  This course teaches you the hand building techniques for making objects/pots with clay.  </p>  <p>  \t  If you are creative minded person who likes to make different things and likes to learn new techniques for giving life to your ideas, this course is for you.  </p>  <p>  \t  We use clay and some very basic hand tools in this course and it means you don&#039;t have to buy any expensive equipment.  </p>  <p>  \t  All the lectures in this course are delivered in HD video format and you&#039;ll be able to see how exactly I make things using clay.  </p>  <p>  \t  This course is perfect for you if </p><ul style=\"\"><li style=\"\">You are person wanting to make different things using your creative imagination or </li><li style=\"\">A student looking to increase your understanding of clay as a material or </li><li style=\"\">You are interested in clay-mation or </li><li style=\"\">You are a budding sculptor or a pottery artist or </li><li style=\"\">A home maker wanting to make good use of time or </li><li style=\"\">Someone who just wants to have some creative fun</li></ul><div style=\"\">Interest in learning something new is the only pre-requisite for joining this course.</div>  <p>I am working on adding some more lectures about animal sculpture and masks making. You&#039;ll get an email update when I upload those lectures.<br style=\"\"></p><p>So, hop on and let your creative journey begin!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Handbuilt Pottery Techniques and Projects", 
    "price": "40.00", 
    "instructors": "Mandar Marathe", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/117342_1c8f_5.jpg", 
    "course_url": "https://www.udemy.com/handbuilt-pottery/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-09T06:19:39Z"
}