{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t  Being able to draw is such a special thing. The ability to translate your ideas, stories, and characters into reality and onto a piece of paper is very unique.  </p>  <p style=\"\">  \t  The problem, of course, is that what you imagine doesn’t always come out exactly as we expect when we start drawing.  </p>  <p style=\"\">  \t  That’s where we come in. <strong style=\"\">The aim of this course is to help you bridge that gap</strong>. The gap between your intentions and ideas in your head, and what you actually see when you finish a drawing.  </p>  <p style=\"\">  \t  It is, however, not filled with tiresome fluff and padded lessons. We distill each element into bite-sized lessons that you can immediately start working on. Each lesson has a worksheet that you can use to practice the lessons.  </p>  <p style=\"\">  \t  The goal here is to give you a course that you can <strong style=\"\">actually start using to learn how to draw</strong> the way you’ve always wished to do.  </p>  <p style=\"\">  \t<strong style=\"\">Here are just a few sections we cover</strong>  </p>  <ul style=\"\">  \t<li style=\"\">The introduction to shapes will give you a good grounding.</li>  \t<li style=\"\">We follow this with teaching you how to draw the eyes and ears.</li>  \t<li style=\"\">Then we move on to drawing boys and men, girls and women.</li>  \t<li style=\"\">You will learn to pose your characters so they are appealing and interesting, as well as ready for action.</li>  \t<li style=\"\">We uncover the secrets to creating super cute Chibi characters as well.</li>  \t<li style=\"\">How to give your characters true emotion, to help with your story.</li>  \t<li style=\"\">We cover difficult areas such as the hands, clothes, and hair.</li>  \t<li style=\"\">We dive into how you can draw your own monsters and Mecha characters.</li>  \t<li style=\"\">Learn how to color each character to give them that extra shine and personality.</li>  </ul>  <p style=\"\">  \t  In total, there are <strong style=\"\">26 videos</strong> for you in your goal of radically improving your drawings.  </p>  <p style=\"\">  \t  So what are you waiting for?  </p>  <p style=\"\">  \t<strong style=\"\">Get started Now! </strong>  </p>", 
    "end_date": null, 
    "title": "How To Draw Manga & Anime Easily & Quickly", 
    "price": "25.00", 
    "instructors": "Drew Williams", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304192_8524_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-draw-manga-anime/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T11:27:01Z"
}