{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t   Do you enjoy giving special presents that leave everyone asking &quot;how did she do that&quot;? Something handmade is very special because it says you spent time thinking about that person. This exploding box will definitely make a big impression at your next party!  </p>  <p>  \t   Are you a bride-to-be looking for centerpiece ideas? Or maybe you want some extra special invitations. Exploding boxes are a great way to announce a new baby, package gift cards in an interesting way, tell someone you love them or just impress your friends with all your crafty skills!  </p>  <p>  \t   During more than 1 1/2 hours of video instruction you will see the process of making an exploding box unfold before your eyes. The class is broken down into easy to follow steps so anyone can play along and create this project.  </p>  <p>  \t   There are written directions included with this course that show all the measurements and pictures of the process up close. It is easiest if you cut the papers first and then watch the videos to put it all together.  </p>  <p>  \t   I am here to help, so if you have any questions please don&#039;t hesitate to ask! I will do my best to reply to your questions as soon as possible.  </p>  <p>  \t   If you love the many beautiful projects that can be found on Pinterest, Instagram and Facebook. I hope you will join me in making your very own &quot;pin worthy&quot; exploding box!  </p>", 
    "end_date": null, 
    "title": "How to Make an Exploding Gift Box", 
    "price": "20.00", 
    "instructors": "Chelsey Vorosmarty", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176776_8136.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-an-exploding-gift-box/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T18:01:31Z"
}