{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Master how to paint with Manga Studio 5, but this course is much more than just how to digitally paint. It also teaches all the fundamentals of painting, such as, how to paint thumbnail sketches and their importance, color theory, how to use color palettes, composition, values, making it look 3D, how to fit objects in your painting, how to tell a story with your painting, how to start a painting, etc. </p><p>We will do a few full paintings from sketch to completion. This is where we put it all together. So by the time you finish this course, you will have painted a few full paintings. </p><p>The course is structured so you can easily find the subject you are looking for. If you want to go back and watch how to paint that woman&#039;s shirt again in one of the lessons, you can, because the course is broken down into sections. Just find the lesson &quot;painting her shirt.&quot;</p><p>You need this course if you are struggling with painting digitally. It will be a life saver, or your money back. </p><p>This is an eight-hour-long mega course, packed full of all the information you need in order to master digital painting with Manga Studio 5. However, much of the information can be used for any digital painting program. </p><p>You will not find a course out there like this that teaches so much and cost so little. </p>", 
    "end_date": null, 
    "title": "How to Digitally Paint -- Paint with Manga Studio 5", 
    "price": "20.00", 
    "instructors": "Neil Fontaine", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481724_7687_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-paint-with-manga-studio-5/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T01:11:25Z"
}