{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">This course has been updated on August 21 with a new section on how to create glitter texture and words!</em></strong> </p><p>Currently featured in &quot;New And Noteworthy&quot; on Udemy!*<strong style=\"\">**** 5 Star Review: </strong>“I love all of Cat&#039;s courses! I have signed up for various Photoshop courses elsewhere and never found them to be as clear and understandable and especially creative as Cat&#039;s. As long as she is producing courses, I will be signing up for them!&quot;<strong style=\"\"> - </strong>Louise Tremblay<strong style=\"\"> *****</strong></p><p>In <strong style=\"\">How to Use Photoshop To Make Design Paper Fast, Easy</strong> you will learn what digital design paper is and what it is are used for. You will learn how to create them, and where to find public domain images to use in creating them. </p><p>This Photoshop course focuses on how to create digital designer paper. This is not in a course in &quot;how to sell&quot; them. If you&#039;re interested in learning how to use your Adobe Photoshop skills to make extra money, create backgrounds for your artwork, or just looking for a new hobby, then this course will teach you everything you need to know. </p><p><strong style=\"\">You will learn:</strong></p><ul style=\"\"><li><strong style=\"\"></strong>where to find free textures and images to create your custom design paper</li><li>how to use some of the filter gallery functions</li><li>how to create gorgeous textures</li><li>how to create glitter textures and glitter words</li><li>how to create banner wraps for selling online</li><li>places to sell digital design paper</li><li>how to quickly add colors to shapes</li><li>and much more.</li></ul><p><strong style=\"\">***** 5 Star Review:</strong> “This course does exactly what it says. Not for complete beginners, but if you are even a little comfortable with photoshop this course will work for you. I enjoyed this a lot.&quot; - Mitul Shukla <strong style=\"\">*****</strong></p><p><strong style=\"\">How to Use Photoshop To Make Design Paper Fast, Easy</strong> is a fun and creative course that will show you step-by-step how to make: beautiful digital paper, easy color variations, quick shape variations, and more. The best way to keep getting better at Photoshop is to use it, and this course gives you lots of creative ideas, resources, and tips.</p>", 
    "end_date": null, 
    "title": "How To Use Photoshop To Make Digital Design Paper Fast, Easy", 
    "price": "20.00", 
    "instructors": "Cat Whipple", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151564_f65e.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-photoshop-to-make-digital-design-paper/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T19:09:24Z"
}