{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  Hey, a friend of mine asked me to teach him how to draw manga or anime. I told him the best place to get started is with manga faces and hair, as this is the most different aspect of manga from comics.  </p>  <p>  \t  That spawned this awesome course just waiting for you to check out. The first few lessons are free, so you can see if you like the teaching style, and to see if you learn anything.  </p>  <p>  \t  I&#039;m sure you will not only learn something but love the free preview lessons enough to buy the course to learn the rest.  </p>  <p>  \t  Once finished, in about five hours, you will fully understand how to draw manga or anime faces and hair, from eyes, to noses, to mouths, and even expressions/emotions.  </p>  <p>  \t  So, if like my friend, you have a passion to learn how to draw manga or anime, then check out the free preview lessons.  </p>  <p>  \t  The course is structured with video lessons that actually teach you methods for drawing manga faces and hair and emotions. This isn&#039;t your typical type of drawing tutorials you might find elsewhere.  </p>  <p>  \t  These lessons will actually teach you and improve your skills. You will learn to draw manga faces, guaranteed or your money back.  </p>  <p>  \t  You can take the whole course with just pencil and paper, although, I mostly draw on a Wacom Cintiq with Manga Studio 5. However, this is not required. Just watch the first few videos and it will make perfect sense why you only need a pencil and paper, and perhaps an eraser. :)  </p>", 
    "end_date": null, 
    "title": "How to Draw Manga Faces and Hair", 
    "price": "20.00", 
    "instructors": "Neil Fontaine", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/183656_9c82_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-draw-manga-and-anime-faces-and-hair/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-17T09:56:44Z"
}