{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Welcome to How to Draw and Paint Backgrounds. I'm excited you're taking this course because you're a creative artist that wants awesome looking backgrounds. You're the reason I created this course and because many of my students requested it.</p>  <p>Beginner and established artists requested it.  </p>  <p>If you're a beginner, you will learn step-by-step to draw and paint awesome backgrounds.</p>  <p>Even if you are already proud of your backgrounds, you will learn to draw and paint them on a whole new level.</p>    <p>You can do this. I know how I used to feel, like I would never draw or paint good backgrounds, landscapes, interiors, etc, but once I learned a few key points, I started to draw good backgrounds.</p>  <p>            Here are a few of those key points that you will learn in this course.</p><ul><li>Making perspective easy.</li><li>Composition:</li><li>Learning how to use the basics of Google Sketchup that will\ngive you a jump start in drawing and painting backgrounds. It's almost like cheating,\nbut great artists like the guy who draws for Dare Devil comics uses it.</li><li>How to use form in backgrounds.</li></ul><p>            So who is this guy, you might be thinking.<br></p>  <p>            I am a top art instructor here at Udemy with over 10,000 students and a bestselling author on Amazon for “How to Draw Awesome Figures.”</p>  <p>            So, hey, follow along with me by enrolling in the course and learn to draw and paint backgrounds like you never have before.</p>", 
    "end_date": null, 
    "title": "How to Draw and Color Backgrounds", 
    "price": "35.00", 
    "instructors": "Neil Fontaine", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633796_3c43.jpg", 
    "course_url": "https://www.udemy.com/how-to-draw-and-color-backgrounds/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T17:16:41Z"
}