{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t <strong>How to create a stunning Still Life acrylic painting in under an hour</strong>  </p>  <p>  \t       This painting course is about what can be achieved with acrylic painting when you apply my 7 painting principles to your painting.  </p>  <p>  \t     The course is a 35 minute video with supporting step-by-step explanations.  </p>  <p>  \t     You&#039;ll need a couple of brushes, a small canvas and a few paints. I list the materials that I use as a guide in the course requirements but any materials you have that are similar, will be fine.  </p>  <p>  \t<strong>(You&#039;ll be able to download the cherry photograph I work from on Lecture 1 of this course.)</strong>  </p>  <p>  \t     Take this course if you think you&#039;d never be able to learn to paint.  </p>  <p>  \t   In under an hour you&#039;ll be amazed at your results.  </p>  <p>  \t    Here are some of my <a href=\"http://willkempartschool.com/students-success-stories/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">previous students success with this tutorial.</a>  </p>  <p>  \t<a href=\"http://willkempartschool.com/students-success-stories/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\"></a>Many of the paintings are their first ever painting with acrylics.  </p>  <p>  \t    Below are some comments from previous students:  </p>  <p>  \t<em>&quot;Hi Will,</em>  </p>  <p>  \t<em>Thanks for this tutorial, was very very informative. I thoroughly enjoyed painting it. Your step-by-step guide was detailed and very easy to follow. Thanks for guiding beginners like myself.&quot;</em>  </p>  <p>  \t<strong>Manisha</strong><em><br>  \t</em>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t    &quot;<em>Hi Will,<br>  \t</em>  </p>  <p>  \t<em>Thank you so much for the tutorial. I’ve never painted anything before, and wanted to give it a shot. I’m only 2 hours home from the art supply store and I’ve followed your videos as best as possible. I made a few mistakes here and there, but I’m still very proud of the work I made, entirely thanks to you!&quot;</em>  </p>  <p>  \t<strong>Jake</strong>  </p>  <p>  \t<em>&quot;I followed this tutorial and though not exactly like yours I think it came out very well. Will be posting a photo on the blog soon. I am a person of a certain age and never thought I could paint and draw, but it seems I can. Thanks for making these vids and helping those like myself who never did art at school or have trouble finding teachers locally to learn from. You are a star! Bless you.&quot;</em>  </p>  <p>  \t<strong>Arlene</strong>  </p>  <p>  \t<em>&quot;Dear Will,<br>  \t</em>  </p>  <p>  \t<em>Thank you for this video. You are an engaging and enlightening instructor. I learned a lot, had great fun, and was reasonably pleased with my attempt.&quot; </em><br>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>Jen</strong>  </p>  <p>  \t<em>&quot;Hi Will, Just started watching your videos and have been learning and re-learning so much! I haven’t painted anything (been busy with graphic design) for the joy of it in about 30 years so I feel like I’m just getting started. Thank you thank you thank you for your site and your amazing style of teaching!&quot;</em>  </p>  <p>  \t<strong>Cherryse</strong>  </p>", 
    "end_date": null, 
    "title": "How to Paint with Acrylics for the Absolute Beginner", 
    "price": 0, 
    "instructors": "Will Kemp", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/97162_5beb_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-paint-with-acrylics-for-the-absolute-beginner/", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-25T12:56:19Z"
}