{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"></strong><span style=\"\"><strong style=\"\">Do you want to draw your own anime or manga</strong>, or just draw them better?</span>  </p>  <p style=\"\">  \tThen you need to be able to draw the anime/manga body. Most artists think that anime is easier to draw, but it’s not. It is based on the same anatomy as a realistic drawing. The difference is, anime and manga are stylized.  </p>  <p style=\"\">  \tMy course teaches you how to draw bodies in the anime style. It teaches you how to simplify. It teaches the proportions of anime and even a quick crash course on anatomy so your anatomy figures look amazing.  But don’t take my word for it.  </p>  <p style=\"\">  \tScroll down and watch some of the free lectures. I offer a few full lessons for free to see if my teaching style works for you.  </p>  <p style=\"\">  \tWhen you are finished with this course, you will know how to draw anime and manga bodies from imagination. You will be able to pose them and everything or you get your money back, guaranteed, upheld by Udemy’s high standards.  </p>  <p style=\"\">  \tI also have bonus videos, like how to draw a anime girl in a bikini, or a buff male anime figure.  </p>  <p style=\"\">  \tYou are ready to draw anime like a pro, so simply scroll down and watch some of the free videos.  </p>", 
    "end_date": null, 
    "title": "How to Draw Anime People and bodies", 
    "price": "20.00", 
    "instructors": "Neil Fontaine", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256750_ba92_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-draw-anime-people-and-bodies/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-07T00:59:29Z"
}