{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p> Impressionist painting with a focus on light. Bring a luminous quality to your paintings you’ve never thought possible. Learn how to build a painting in one sitting, “alla prima”, and how to savor interesting brushwork. You will also learn the invaluable concepts of drawing, value, color, and edges. Use these methods and knowledge to start your painting off right if you're a total beginner, or to take your painting style to the next level if you're more experienced. You’ve never painted like this before.<br>  \t<br>  \tYou can paint along with me during this entire course. I even have a camera angle that shows my palette as I'm mixing colors. You will learn crucial painting techniques in the process of creating a beautiful painting. Or feel free to just sit back and enjoy the show as I create a painting from scratch.<br>  \t<br>  \tThe reference photo I'm using is provided, as well as a materials list. You're free to use your own style of materials of course, but I'll list every single thing I use. I also provide a PDF flipbook showing each stage of the painting, so you can flip through quickly and see how the painting builds with each stage.<br>  \t<br>  \tThis course is partial toward using oil paint, and I highly recommend it, however you can use acrylics also. Many of the concepts I discuss in this course apply to all mediums of art.<br>  \t<br>  \tSo take this course if you're ready to improve your painting with methods you've probably never seen before, and will have you thinking about painting in a new way. For all levels of painters.  </p>", 
    "end_date": null, 
    "title": "Impressionism - Paint this Autumn painting in oil or acrylic", 
    "price": "20.00", 
    "instructors": "Christopher Clark", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427020_dc0d.jpg", 
    "course_url": "https://www.udemy.com/impressionism-paint-this-autumn-painting-in-oil-or-acrylic/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T16:58:18Z"
}