{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Impressionist painting with a focus on light. Bring a \nluminous quality to your paintings you’ve never thought possible. Learn \nhow to build a painting in one sitting, “alla prima”, and how to savor \ninteresting brushwork. You will also learn the invaluable concepts of \ndrawing, value, color, and edges. Use these methods and knowledge to \nstart your painting off right if you're a total beginner, or to \ntake your painting style to the next level if you're more experienced. \nYou’ve never painted like \nthis before.<br>  \t<br>  \tYou can paint along with me \nduring this entire course. I even have a camera angle that shows my \npalette as I'm mixing colors. You will learn crucial painting techniques\n in the process of creating a beautiful painting. Or feel free to just \nsit back and enjoy the show as I create a painting from scratch.<br>  \t</p><p>DOWNLOADABLE MATERIALS: I provide the reference photo I'm using for the painting, and an image of my finished painting for you to analyze. Also a materials \nlist: you're free to use your own style of materials of course, but I'll\n list every single thing I use. I also provide a PDF flipbook showing \neach stage of the painting, so you can flip through quickly and see how \nthe painting builds with each stage. (Look under the Downloadable Materials tab for each lecture, it's an icon of a little arrow pointing down)<br>  \t<br>  \tThis\n course is partial toward using oil paint, and I highly recommend it, \nhowever you can use acrylics also. Many of the concepts I discuss in \nthis course apply to all mediums of art.<br>  \t<br>  \t\nSo take this course if you're ready to improve your painting with \nmethods you've probably never seen before, and will have you thinking \nabout painting in a new way. For all levels of painters.  </p>", 
    "end_date": null, 
    "title": "Impressionism - Paint this Aspen Autumn scene in oil/acrylic", 
    "price": "20.00", 
    "instructors": "Christopher Clark", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721094_8b55.jpg", 
    "course_url": "https://www.udemy.com/impressionism-paint-this-aspen-autumn-scene-in-oil-acrylic/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T18:56:51Z"
}