{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>** NEW VIDEOS ADDED JUNE 2016**</strong></p><p><strong>Would you like to make money with your camera? Are you a 'people person' and LOVE photography as well?  Would you like to start a home based business? If so, let me show you how to create beautiful portraits to start your path to your own photography business.</strong></p>\n\n<p>Portrait photography is popular, fun, and in-demand! If you are looking for a course to photograph people for fun or jump start your photography career and get paid, this course shows you how to create beautiful portraits.<br></p>\n\n<p>  \t        If you dream of owning a portrait photography business this course will show you how to create beautiful portraits from head shots to full length, groups, families, and more.  </p>\n\n<p><strong>In this course you will learn:</strong></p>\n\n<ul><li>How to photograph people in various poses and lighting techniques</li><li>How to master strobe lighting</li><li>How to photograph white backgrounds</li><li>How to create special effect portraits</li><li>How to be a creative and in-demand photographer</li></ul>\n\n<p>In no time you will have all the tools you need to get started creating fine portraits either in the studio or in your own home based business. And this course is designed specifically for the photographer with no lighting experience.</p>\n\n<p>  \t        <strong>This course shows you how to:</strong></p>\n\n<ul><li>Learn how to sculpt people with light</li><li>Understand how your lighting equipment works</li><li>How to understand the difference between key and fill lights</li><li>Understand lighting ratios</li><li>How to add accent lights</li><li>How to light backgrounds</li><li>How to simple photo retouching (everybody needs some)</li></ul>\n\n<p>  \t        By the time you finish this course you will be able to shoot great portraits of family, friends, and even clients and without a million dollars in photo gear.  </p>\n\n<p>  \t<strong><em>Enroll now to learn exclusive portrait lighting techniques and make good money enjoying your passion.</em></strong>  </p>\n\n<p><strong><em>_________________________________________________________________________</em></strong></p>\n\n<p>  \t      What they are saying:  </p>\n\n<p>  \t      \"Charlie, I have learned so much from your class, and feel as I try new lighting arrangements and combinations I do have a lot to learn. My confidence is growing in photographing portraits, and I have to admit I just love it and plan to keep on, having already added 2 lights to my set up.\" Gratefully, Sarah  </p>\n\n<p>  \t      \"Truly a wonderful class! You have taken the \"Mystery,\" and fear, out of portrait photography. You have a wonderful gift for teaching, and you express yourself very well through the written word - another wonderful gift. Thank you so much! Hoping to take another of your classes in the near future\". Blessings, Jennifer  </p>\n\n<p>__________________________________________________________________________</p>\n\n<p><strong>And don't forget Udemy has a 30 day money back guarantee, no questions asked, and that is <em>MY</em> guarantee as well!</strong></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Introduction to Studio Portraiture", 
    "price": "25.00", 
    "instructors": "Charlie Borland", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21255_ae62_10.jpg", 
    "course_url": "https://www.udemy.com/the-absolute-beginners-guide-to-studio-portraiture/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-16T16:02:58Z"
}