{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">How To Create Clay Animation For Beginners</strong></p>\n\n<p><em>Last updated Feb 2016</em></p>\n\n<p><strong class=\"redactor-inline-converted\">Do you want to learn to create clay animation?</strong></p>\n\n<p>Have you always wondered how clay animation works, but didn't know where to start?</p>\n\n<p>Are you looking for a new fun, creative hobby to jazz up your week?</p>\n\n<p>This course teaches you how to create stop frame clay animation at home, using your smartphone.</p>\n\n<p>You will learn the end-to-end steps for creating stop motion animation, from writing a script, to building characters and sets, to adding audio and lip syncing sound, and filming and editing.</p>\n\n<p>This course is a hands-on course, which you can follow step-by-step to create your own clay animation short film, using a class project as an example. The camera you will be using is the one you've already got - the one on your smartphone!</p>\n\n<p><strong class=\"redactor-inline-converted\">Why take this course?</strong></p>\n\n<p>Are you a creative looking to tell stories in a new medium?</p>\n\n<p>Are you a parent looking for a course in clay animation for kids? Children under the age of 13 might need a set of adult-sized hands to help out in this course.</p>\n\n<p>Or have you always loved claymation and wanted to be a clay animator yourself?</p>\n\n<p><strong class=\"redactor-inline-converted\">In this course, you will learn:</strong></p>\n\n<ul><li>The basics of animation</li><li>How to create a script and storyboard for your animation</li><li>How to design a basic character using the medium of clay</li><li>How to build a set using a templates as a guide</li><li>How to lip-sync your characters mouths using tools like Audacity to help create an exposure sheet</li><li>How to film using a smartphone app (on either iPhone or Android)</li><li>How to edit your film (using iMovie or Windows Movie Maker)</li></ul>\n\n<p>Including the hands-on project, you can finish this course in a few hours, or over a series of weeks, depending on how you want to create your film!</p>\n\n<p><strong class=\"redactor-inline-converted\">About your course instructor:</strong></p>\n\n<p>Rachel Beaney is a clay animation hobbyist who has been creating clay animation on Youtube for two years. She has researched how to create clay animation and come up with easy and accessible DIY solutions so you can create stop motion animation at home.</p><p><strong>Student reviews:</strong><br>“Very interesting explanation how to produce the video and audio for clay animations.” - Randy H, with a 5 star review.</p><p><strong class=\"redactor-inline-converted\">Who should take this course?</strong><br></p>\n\n<p>This course is for anyone who is passionate about learning clay animation as a hobby at home.</p>\n\n<p>You don't need to have studied animation or film, but being passionate about learning, experimenting and creating is a must! Clay animation can be a slow process, so having patience pays off.</p>\n\n<p>Having a basic understanding of computers will be a useful skill as we use different types of software along the way.</p>\n\n<p>Don't forget that all Udemy courses have a 30-day money back guarantee, so if you're unhappy with the course for any reason, you can get your money back.</p>\n\n<p><strong class=\"redactor-inline-converted\">What are the course requirements?</strong></p>\n\n<p>You are welcome to watch the course just to learn about the process, or you can follow along step-by-step and create your film based on a class project.</p>\n\n<p>If you're going to embark on a stop animation adventure, you will need a few supplies - but most of these you should have around the house.</p>\n\n<p><u>Shopping List:</u></p>\n\n<p><em>Things You Need:</em></p>\n\n<ul><li>Clay or plasticine – whatever colours you want your character to be! Two or three handfuls of clay should be enough.</li><li>Smartphone Tripod (it could be a mini phone tripod, a smartphone attachment to a traditional tripod or a DIY-clay-and-glad-wrap tripod will do!)</li><li>Cardboard (thick – i.e., a pizza box)</li><li>Cardboard (thin – i.e.,. from a newsagent or cereal box)</li><li>PVA glue</li><li>Plain Paper</li><li>Scissors</li><li>Pen</li></ul>\n\n<p><em>Optional extras:</em></p>\n\n<ul><li>Stamp/water sponge pad</li><li>Toothpicks</li><li>White beads and black enamel paint for eyes</li><li>Clay carving tools</li><li>Lamps</li></ul>\n\n<p><em>Smartphone apps:</em></p>\n\n<ul><li>iMotion app for iPhones (free!)</li><li>Motion app for Androids (free!)</li></ul>\n\n<p><em>Computer software:</em></p>\n\n<ul><li>Microsoft Movie Maker – editing software for PCs (free!)</li><li>iMovie – editing software for Macs (free!)</li><li>Access to a printer to print resources/handouts</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">What are you going to get from this course?</strong></p>\n\n<p>You will learn the complete process of how to create a stop motion animation film.<br></p>\n\n<p>This course has a resource kit for animation, which provides resources and templates for your stop motion.</p>\n\n<p>You will create a complete clay animation short film when you are done with this course. </p>\n\n", 
    "end_date": null, 
    "title": "Introduction To Clay Animation For Beginners", 
    "price": "20.00", 
    "instructors": "Rachel Beaney", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/751580_8ad3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-clay-animation-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T19:26:17Z"
}