{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Join this Wire Wrapping for Beginners Online Workshop and enjoy a relaxing pastime while mastering a skill that will allow you to create unique, wearable art to keep, give, or sell!</strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\">This comprehensive workshop is over $650 worth of jewelry lessons for a small one-time fee!</strong></p>\n\n\n\n\n\n<p>Imagine planning your outfit for a big night out and thinking, \"I'd love a new necklace to spice up my favorite dress,\" or \"I wish I had some fancy new earrings to add a little sparkle!\"</p>\n\n\n\n\n\n<p>Or perhaps you long to give truly unique handmade gifts that will be treasured and cherished by their wearer.</p>\n\n\n\n\n\n<p>Well, wish no more and save a trip to the store! After finishing this course, you'll have all the tools and techniques at your fingertips to be able to whip up a special new style and be the belle of the ball and everyone's favorite gift-giver! The compliments will roll in and you'll be so proud to smile and say, \"Thanks! <em>I made it myself</em>!\"</p>\n\n\n\n\n\n<p>Jewelry making is a lifetime skill that anyone can learn and enjoy. <strong class=\"redactor-inline-converted\">Over 1000 happy students </strong>are already having fun wire wrapping and enjoying compliments on their special handmade creations.</p>\n\n\n\n\n\n<p>With the right instruction and a little bit of practice, you too will soon be able to make your own stunning pieces in a matter of minutes!</p>\n\n\n\n\n\n<p>********************************************************************************************</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">REGISTER NOW and get started making beautiful wire wrapped jewelry today!</strong></p>\n\n\n\n\n\n<p>********************************************************************************************</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What do you mean $650 WORTH OF JEWELRY LESSONS?</strong></p>\n\n\n\n\n\n<p>When I teach jewelry workshops in person, students pay $65 each for 1 - 1.5 hours of instruction, and that's just for ONE single project (<em>not</em> including supplies). Teaching online allows me to move through demonstrations <em>much</em> more quickly - so I can cover more projects in a short amount of time.</p>\n\n\n\n\n\n<p>When you enroll in Wire Wrapping for Beginners today, <strong class=\"redactor-inline-converted\">a small one-time payment earns you $650 worth of in-person workshops with a professional jewelry designer,</strong> all included in this comprehensive online workshop! Plus, you have unlimited lifetime access to all the projects AND to me, for help whenever you need it.</p>\n\n\n\n\n\n<p>Watch the video above for sneak peeks at the projects you'll create during this workshop, then be sure to ENROLL NOW to lock in this low rate. You'll never pay more, even when I add new projects to the class!</p>\n\n\n\n\n\n<p>********************************************************************************************</p>\n\n\n\n\n\n<p>Student praise for <strong class=\"redactor-inline-converted\">Wire Wrapping for Beginners:</strong></p>\n\n\n\n\n\n<p><em>★★★★★ <strong>\"Fantastic!\"</strong></em></p><p><em>Jessica's ease and expertise in teaching her craft is outstanding and I feel I have mastered something I have always yearned to be able to do but never knew where or how to start. A big thank you to Jessica and Udemy for this course.\" ~ Elizabeth L.</em></p>\n\n\n\n\n\n<p><em><em>★</em><em>★</em><em>★</em><em>★</em><em>★  \"</em></em><strong class=\"redactor-inline-converted\"><em>Great course for jewelry making beginners!</em></strong></p>\n\n\n\n\n\n<p><em>I feel this course was the perfect start to my new jewelry-making hobby (and hopefully future small business). The instructor created the course with a logical scope and sequence. Even a beginner can experience success. Her videos are just the right length, she speaks clearly, and she encourages her students. Best of all, while you work through the course, you are creating jewelry you can wear right away.\"  ~ Lisa P.</em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">********************************************************************************************</strong></p>\n\n\n\n\n\n<p>There are so many reasons to learn a new skill like wire wrapping jewelry. Whether you want a creative way to switch off after a hard day, to generate a side-income, or you simply want to make beautiful jewelry that no one else will ever have, I can show you how.</p>\n\n\n\n\n\n<p>Whether you're an absolute beginner or have dabbled in a bit of jewelry making before, this course will teach you from start to finish to create the jewelry that you and your friends will be dying to wear!  </p>\n\n\n\n\n\n<p>This is an in-depth course with over 40 lectures - <strong class=\"redactor-inline-converted\">a</strong> <strong class=\"redactor-inline-converted\">complete guide to making wire jewelry</strong> for beginners and for anyone who wants to brush up on and perfect their wire wrapping technique.</p>\n\n\n\n\n\n<p>  \t                                                                                You will learn step-by-step with close-up videos how to make several different styles of earrings, bracelets, and necklaces as well as ways to adapt these styles for an even wider variety of finished jewellery.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">We'll learn to make:</strong> </p>\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">simple rosary chains (simple wire loops)</strong></li><li><strong class=\"redactor-inline-converted\">wire wrapped link chains (wire wrapped loops)</strong></li><li><strong class=\"redactor-inline-converted\">dangles and wire wrapped briolette drops </strong></li><li><strong class=\"redactor-inline-converted\">clustered styles (earrings and bracelet)</strong></li><li><strong class=\"redactor-inline-converted\">multi-strand necklaces and bracelets</strong></li><li><strong class=\"redactor-inline-converted\">handmade headpins and ear wires</strong></li><li><strong class=\"redactor-inline-converted\">several finished earrings, bracelets, and necklaces you can wear right away</strong></li><li><strong class=\"redactor-inline-converted\">and so much more!</strong></li></ul>\n\n\n\n\n\n<p>By the end of this course, you'll have the knowledge and confidence to make beautiful, professionally finished wire wrapped earrings, necklaces, and bracelets that you will be proud to wear, give as gifts, or even sell for profit!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">********************************************************************************************</strong></p>\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Your purchase is 100% RISK FREE with a 30 day money-back guarantee. If you don't learn anything new from this course, simply request a refund within your 30 day period for your money back, no questions asked.</strong>  </p>\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">GET STARTED MAKING BEAUTIFUL WIRE WRAPPED JEWELLERY TODAY - ENROLL NOW!</strong>  </p>\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">********************************************************************************************</strong>  </p>", 
    "end_date": null, 
    "title": "Jewelry Making: Wire Wrapping for Beginners", 
    "price": "40.00", 
    "instructors": "Jessica Barst", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317978_cc81_3.jpg", 
    "course_url": "https://www.udemy.com/jewelry-making-wire-wrapped-jewelry-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-11T23:04:37Z"
}