{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Are you ready to take your wire wrapping skills to the next level? In this Decorative Wire Wrapping workshop, you’ll learn to master the Herringbone Wrap wire working technique. </p><p>This beautiful effect creates stunning and inspired jewelry with HUGE ‘wow!’ factor, and I think you’ll agree!</p><p>In <strong><em>Mastering the Herringbone Wrap</em></strong>, you’ll learn several different ways to incorporate the herringbone wrap and make variations on this distinctively elegant style: Links, dangles, and drops that you can use to create bracelets, necklaces, earrings, and more! \n</p><p>I’ll walk you through each pattern step-by-step with close up videos and with this interactive platform, I’m always here to help if you have any questions along the way. \n</p><p><strong>********************************************************************************************\n</strong></p><p><strong>REGISTER NOW and learn this incredible technique today!\n</strong></p><p><strong>********************************************************************************************</strong>\n</p><p>There are so many reasons to develop a skill like making jewelry. Whether you want a creative way to switch off after a hard day, to generate a side-income, or perhaps you simply want to make and wear beautiful jewelry that no one else will ever have! Whatever your reasons, you’re going to love this course!</p><p>Master this method and create unlimited unique and gorgeous wearable designs to add to your collection.  \n</p><p>So go ahead - enroll now and come on in and join the fun!</p><p><strong>********************************************************************************************</strong></p><p><strong>Your purchase is 100% RISK FREE with a 30 day money-back guarantee. If you are not satisfied with this course, simply request a refund within your 30 day period for your money back, no questions asked.</strong></p><p><strong><br></strong></p><p><strong>GET STARTED MAKING BEAUTIFUL WIRE WRAPPED HERRINGBONE JEWELLERY TODAY - ENROLL NOW!</strong></p><p><strong>********************************************************************************************</strong><br></p><p><strong><br></strong></p><p><em>Mastering the Herringbone Wrap is the first in a series of jewelry making courses focusing on decorative wire wrapping techniques and beyond-the-basics wire wrapping skills.</em><br></p>", 
    "end_date": null, 
    "title": "Jewelry Making: Decorative Wire Wrapping 1 - Herringbone", 
    "price": "20.00", 
    "instructors": "Jessica Barst", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641376_7949_2.jpg", 
    "course_url": "https://www.udemy.com/jewelry-making-decorative-wire-wrapping-herringbone/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T14:02:27Z"
}