{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Up to Date as at: October 2015.</strong></p><p>  \t<strong>Embird Sfumato Tutorials</strong>  </p>  <p>  \t      In this Course \"<strong><strong>Learn how to create an Embird Sfumato Portrait Study</strong></strong>\" we will create a Sfumato design for machine embroidery with <strong><strong>Embird Embroidery Digitizing Software. </strong></strong>Digitize an embroidery design in Sfumato stitch with Embird. Embird Sfumato Tutorials, David Kruiper Portrait Study  </p>  <ul>  \t<li><strong>Embird Sfumato </strong>allows easy and fast creation of multicolored portraits, landscapes, still lives and other designs from photos.  </li>  \t<li>Student imports photo into the background of the working area and then draws Sfumato objects on top of the photo.  </li>  \t<li>Sfumato objects have vector boundaries that are automatically filled with stitches. Photo-realistic effect is achieved with variable density of the thread flow.</li>  \t<li>Objects are filled with stitches so that thread forms looser or heavier meanders to create shading effects while fabric shows through the stitches. In general, the loose meanders are used on low density areas. </li>  \t<li>Special controls and paramaters are available to tune density and colors of Sfumato object.  </li>  \t<li>Additional features like openings, carvings and color mask can be applied to achieve required stitch layout and texture.</li>  \t<li>Each Sfumato object can have <strong>1-5 shades of its 'basic color' </strong>or user-defined shades. Chosing proper number of separate objects and proper number of shades within each object allows to achieve various coloring effects.</li>  \t<li>We will use a photo of David Kruiper a well know Komani-San (Khalahari Bushman) which you can download in lecture 1 to play along on your pc</li>  </ul>  <p>  \t      This course is for <strong><strong>Embird Embroidery Digitizing Software</strong></strong> Digitizers who has a fair to good knowledge of their <em><em>Embird Embroidery Digitizing Software</em></em>.  </p>  <ul>  \t<li> We will only focus on working with <strong><strong>Embird Sfumato</strong></strong></li>  \t<li> how to apply parameters to get the best results from your design</li>  \t<li> we teaches the use of different color</li>  \t<li> the use of parameters inside <strong><strong>Sfumato Stitch</strong></strong></li>  \t<li>How to achieve an end result that will be a joy to stitch</li>  </ul>  <p>  \t      We have <strong></strong><strong><strong>included</strong></strong> our case study designs at the end of the course in <strong><strong>5 stitch formats</strong></strong>.  </p>  <p>  \t       The complete Course consist of over 130 minutes of video material broken down in 10 classes of 13 + minutes each to learn and apply to your Sfumato designs.  </p>", 
    "end_date": null, 
    "title": "Learn how to create an Embird Sfumato Portrait Design  ", 
    "price": "20.00", 
    "instructors": "Philip Viljoen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45359_4baa_7.jpg", 
    "course_url": "https://www.udemy.com/embird-learn-how-to-create-a-sfumato-portrait-study/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-10T10:34:37Z"
}