{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Sewing for Children. Learn How to Make Cute Dresses for girls. This course includes step by step how to video instructions to make cute dresses for girls and how to add snaps instead of buttons or zippers. This is one of the easiest courses you will ever take. If you watch the videos and follow the instructions you will learn how simple it is to make a cute dress for girls. Once you have the basics down, then you can let your creativity run free and make all sorts of lovely sweet little dresses! </p><p>This course contains video lectures and a PDF of the basic girls dress form bodice. This course is structured in video lecture format which will show you how to create the basic dress from from printing the PDF pattern, to cutting the pattern out on fabric to the complete assembly of the dress. This PDF sewing pattern will allow you to create and sew a very simple girls dress that you can customize in numerous ways. You will NOT receive the finished DRESS, you WILL receive the pattern ONLY to make the Dress Bodice in your choice of fabric/materials and colors. You will need to watch the video on how to measure and attach the skirt portion. I do it this way to save you on printing multiple sheets of paper for the lower portion of dress - which is actually a very simple measurement. It is a printable, computer-drafted patterns which I designed with custom computer software. I have made many dresses with this pattern and the pieces fit and work well together. This size will print on 6 sheets of 8 1/2 by 11 inch paper. You then tape or glue your pattern pieces together.</p><p>Once you have a good handle on the basic dress from, you should be able to let your imagination run wild with ideas for adorable dresses for girls. I would suggest that everyone take the course who wants to better their sewing skills or make girls dress, for fun, profit or gift giving.</p>", 
    "end_date": null, 
    "title": "Learn to Make Cute Dresses for Girls", 
    "price": "20.00", 
    "instructors": "Instructor Jacquelyn Louise", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/221938_f9d5_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-make-cute-dresses-for-girls/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-18T13:52:25Z"
}