{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Learn To Paint Landscape in Alcohol Ink.  Fun to do and you will love the results.</strong><br></p><p>Enjoy this Udemy course on painting landscape in Alcohol Ink on ceramic tile, delivered in a 11 lecture series.  I take you from the very beginning, including what supplies you need, to a complete beautiful piece of fine art that you can proudly display in your home or a gallery.   This is a great course to expand your horizons on what is possible with Alcohol Ink, but also for the beginning artist wanting to start with an ‘easy to do’ form of art.<br></p><p>1)  Setup and Supplies    *downloadable supply list:<br>2)  Design and Composition<br>3)  Background Colour<br>4)  Water (Mid-ground)<br>5)  Shoreline, Rocks (Foreground)<br>6)  Shoreline, Rocks cont'd<br>7)  Rocks cont'd., Adding Highlights<br>8)  Background Tree Trunks<br>9)  Trees cont'd., Adding leaves<br>10) Final touchs and touchups.<br>11) Protect and Frame Your Painting</p><p>When you finish this course you will be able to create a beautiful landscape in Alcohol Ink on ceramic tile and other substrates.  You may even be able to take your tiles and supplies to a craft fair or show and sell your art and paint right in front of customers.  They will be impressed with your talent and abilities.  So will you. :)</p><p><strong>Jan Murray</strong></p><p><em>My artistic journey of the past 15 years has taken me on a wild and wonderful ride…. Oils, Acrylic, Mixed Media…. and now Alcohol Inks.  </em><em>Whether working on ceramic tile, glass, Yupo or canvas, alcohol inks provide the vibrancy of colors, movement and unpredictability that make this medium so exciting.</em></p><p><em></em><em>I invite you to browse my online gallery, and if your ready to continue the fun, check out my other Udemy video courses. (coming soon)</em></p><p>Please leave a <strong><em>Review and Stars</em></strong> ;) on my course so I can improve for future courses.  Also please contact me and post your art that you have made from this course.  I would love to see your progress.  </p><p>Also drop me a note on what other style of art you would like to see me teach on Udemy.  I have experience in Poured Acrylic, Mixed Media, Abstract Acrylic and Oils. </p>", 
    "end_date": null, 
    "title": "Learn to paint with Alcohol Inks", 
    "price": "20.00", 
    "instructors": "Jan Murray", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750830_2254.jpg", 
    "course_url": "https://www.udemy.com/learn-to-paint-with-alcohol-inks/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T03:23:17Z"
}