{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Have you ever wanted to perform the same mind blowing magic tricks you’ve seen on TV? Now you can learn the same secrets &amp; sleights that I’ve used for the past 25 years!  </p>  <p>  \t<br>  \t<strong>WARNING!</strong> These magic tricks are very powerful and get great reactions. If you take the time to learn them you won’t be disappointed. These are powerful tricks that can get you paying gigs or use them to impress your friends.<br>  \t<br>  \tThese magic tricks require no special gimmicks and can be done anywhere at anytime. It doesn’t matter if you’re a beginner you’ll be learning some of these tricks in minutes. Already know some magic or sleights don’t worry. We’ve included more advanced tricks that you can practice to knock’em off their feet.<br>  \t<br>  \tSo how does it work?<br>  \t<br>  \tFirst you’ll watch a performance video of the trick, so you’ll know what the trick should look like for an audience. Then in an explanation video I’ll teach you the trick step by step explaining the trick in detail.<br>  \t<br>  \tSo what will you learn?<br>  \tCard Tricks<br>  \tStreet Magic<br>  \tCoin Tricks<br>  \tRubberBand Magic<br>  \tSleight of Hand<br>  \tMind Reading<br>  \tAnd a ton more.<br>  \t<br>  \tNow you can stand out in the crowd. You can do these tricks at school, on the streets, restaurants, parties or anywhere you want. People will beg you to perform once they know you do magic.  </p>", 
    "end_date": null, 
    "title": "Learn Professional Magic Tricks & Card Tricks in 7 Days", 
    "price": "30.00", 
    "instructors": "Jeremy Nelson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/182478_b180_3.jpg", 
    "course_url": "https://www.udemy.com/magic-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-14T14:03:25Z"
}