{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course is a complementary course to the How I Write a Novel within a month, but it is its own course. Taking the other course will simply benefit you more. In this course, we will go over taking an idea, creating a page summary from the idea, creating a Treatment from that page summary, and turning that Treatment into a full-fledged screenplay. This is a no-nonsense course that has a ton of information packed into a small amount of time. By the end of this course, a student will be able to take practically anything they want and turn it into a working screenplay. Once we're done making and formatting a screenplay, I show you how to make a query letter, which is how you'll get an agent or a director to look at your screenplay to make it in a movie. These are industry standard methods of stepping your literary foot into Hollywood.</p><p>Not only do I cover the entire Screenplay Creation Process(not a software), but I give helpful tips on how to avoid getting that nasty writer's block. I also talk about the different types screenplays beyond the basic dialogue screenplays and how to draw on the inspiration of the screenplay writers that have come before to solve problems you're currently having.</p><p>If you're new to the industry and want to quickly learn pretty much everything there is to learn about screenplay writing, then this is the course for you. I have been professionally ghostwriting screenplays for years and have even had the pleasure of watching my hidden works come out on the big screen. I have never written a screenplay that I took credit for and I don't mind that, because ghostwriting has the benefit of short-term risk, which means so long as the client likes it I still get paid.</p><p>This course goes from literally nothing, to a full-fledge screenplay and a query letter. I walk you through each step and real life reasons why certain things are done a certain way, like why filler characters are put into the character summary when they're not that important. So, come on in and let's write a screenplay.</p>", 
    "end_date": null, 
    "title": "Learn How I Write A Movie Script within a Month", 
    "price": "20.00", 
    "instructors": "Tommy Mertell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662802_362d_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-write-a-movie-script-within-a-month/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T07:12:28Z"
}