{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>My name is Kellie Chasse and I am a professional artist and instructor. I have been teaching various forms of art including watercolor, alcohol ink, and oils since 2007.  I have helped thousands of students explore their inner artist. All are welcome and I do visit the discussions to answer questions if you get stuck. </p><p>My classes are designed for beginners. Have you ever wanted to try a Paint Night at a local restaurant, well my classes are similar in ease but I use watercolors! They are simple and made to assist those who feel they can not paint a stick. I've heard that many times over the years.  My classes do not include boring academics, but rather the fun and joy of experimenting and completing something the very first time. The great thing about the video is you can pause, replay and watch them as many times as you need to.  You can do a scene several times until you feel like you have it down.  </p><p>We will be painting a beautiful winter scene.  Living in Maine, we get to watch the snow fly every year and adding snow to my art classes is only natural.  I will also show you how to frame your work of art once completed.</p><p>You will learn some techniques and a dash of theory through watching my classes, but I do not get in depth like you would in an academic atmosphere.  </p><p>Please enjoy my class and I love to hear feedback and even share your art in the reviews.  I take your feedback seriously and use it to improve my classes for everyone.  </p><br>Have a wonderful day!", 
    "end_date": null, 
    "title": "Learn This Winter Wonderland Watercolor Scene & Framing", 
    "price": "20.00", 
    "instructors": "Kellie Chasse", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670406_91af.jpg", 
    "course_url": "https://www.udemy.com/winter-wonderland-watercolor-painting-scene-framing/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T15:55:23Z"
}