{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t**JOIN 90+ STUDENTS WHO TOOK THIS COURSE AND MADE AN IDOL**  </p>  <p>  \t** THIS COURSE IS LAST UPDATED ON 26 SEPT 2014 **  </p>  <p>  \tThe course is about learning how to make an eco-friendly idol of Ganapati using wet clay and some very basic tools. 99% of this course is taught using video lectures and I have used some presentations slides to explain the materials used, answer FAQs and summarize the course.  </p>  <p>  \t            This course is divided into 4 sections. We will be starting from making the basic structure, modelling the 4 hands, making the face, the trunk and lastly, adding ornaments and other details to the idol.  </p>  <p>  \t            The course has videos that have cumulative run time of about 3.25 hours.  </p>  <p>  \t            You should do this course if  </p>  <p>  \t             - you enjoy learning something new  </p>  <p>  \t             - you like playing in clay and creating objects with it  </p>  <p>  \t             - you are interested in sculpture as an art form  </p>  <p>  \t             - you want to make a Ganapati idol on your own  </p>  <p>  \t            If you have any questions, you can post them in the questions section or send them to me at mandar.marathe@gmail.com  </p>  <p>  \t            By the end of this course you will master the clay modelling techniques using which You can make clay models of other objects or animals as per your wish.  </p>  <p>  \t  See you in the course!  </p>", 
    "end_date": null, 
    "title": "Learn the art of clay sculpting: Make a Ganapati idol", 
    "price": "40.00", 
    "instructors": "Mandar Marathe", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/60516_cd5c_6.jpg", 
    "course_url": "https://www.udemy.com/sculpting-ganapati-idol/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-17T14:24:23Z"
}