{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Artistic drawing course addressed to everyone who wants to learn how to draw, it is for everyone. From Art students ( Fine Arts, Architecture, Art workshops or schools) to beginners. Everyone can learn following the method created by Dr. Antonio García Villarán, Director and Professor in CREA 13. With simple activities you will educate your vision to achieve your goal. In this course, you will learn new and fun drawing techniques. The course contains more than two hours of lectures apart from original teaching material. If you fulfill the course goals I guarantee that you will learn how to draw what you see in a 3-6 months period. The course program consists in doing the activities suggested until you master them. If you want to learn how to draw, welcome!</p><p style=\"\"><span style=\"\"></span>The course program has an introduction where I speak about the “realistic measles&quot;, about drawing of representation and presentation and I establish the basis of the teaching unit. In the next section, there are activities to relax your hand, educating perception, working with fitting, proportion, volume, space and I end explaining the “Macarma&quot; concept. You can download the extra material and consulting the bibliography if you want to learn more.</p><p style=\"\">I encourage you to this course if you want to learn how to draw in a simple, fast and fun way. </p><p style=\"\">Thanks for choosing this course. </p>", 
    "end_date": null, 
    "title": "Learn how to draw step by step. Art and Creativity.", 
    "price": "35.00", 
    "instructors": "Antonio García Villarán, Beatriz Ruiz Cívico", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351270_513e_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-draw-step-by-step/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T21:18:10Z"
}