{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Have you ever tried to juggle?  Have you ever been frustrated because you couldn't figure out the secret to something so simple?  If so I can relate with you.  I remember learning to juggle several years ago and dealing with the same frustrations.  It doesn't have to be that way though.  I can now juggle 6 balls and have performed for audiences as large as 200. Juggling doesn't have to be difficult. It can be extremely easy and straightforward if you understand the secrets behind it. That's why I created this course for you.</p><p>If you've ever wanted a step-by-step guide in learning how to juggle this course is the perfect tool for you.  In the first lesson you'll learn the secret to juggling three balls, and by the end of this course you'll have learned 25 more tricks! Also included in this course is an entire section on how to put together a routine and entertain an audience with your newly acquired skills.</p><p> Of course, there's many reasons to juggle even if you never intend to get on stage and perform.  Juggling is a good form of cardiovascular exercise, learning to juggle can boost self-esteem (by showing you you're capable of things you previously thought impossible), and many say that the meditative repetition of juggling helps them destress. </p><p> Regardless of why you want to learn to juggle, however, you'll no doubt find the 30+ videos included in this course useful.  The lessons were put together using knowledge I've acquired from years of practice and thousands of hours invested in the field.  The lessons are sequentially ordered so that you're never trying to practice a trick that's too difficult for you. This allows you to rapidly improve as well as avoid frustration. You'll also notice a consistently positive vibe throughout these videos because having fun while you learn is important too! :) </p><p><span></span>If you've ever wanted to learn how to juggle you should enroll today along <strong>with the 1,000 other Udemy students</strong> that have already begun learning how to juggle. Once you complete the first lesson and are able to juggle you'll also be able to learn another 25 tricks at your leisure.  There's no risk.  If you decide juggling isn't for you a full refund awaits.  Sign up today.</p>", 
    "end_date": null, 
    "title": "Learn To Juggle 3 Balls (+25 Other Tricks!)", 
    "price": "20.00", 
    "instructors": "Cameron Chardukian", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408980_ef91_4.jpg", 
    "course_url": "https://www.udemy.com/juggling/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T12:52:36Z"
}