{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t          Have you ever wondered why you can&#039;t mix the right green or brown or purple? Why it all goes horribly wrong or muddy, or why you end up in frustration? This course will help you never to feel like this again!  </p>  <p>  \t          The course is for anyone who paints in watercolors, (or in oils or acrylics), and who wants to learn an easy and very effective way of color mixing. In the course I teach a simple way to take control of your colors and to create the right color every time. For many painters the choice of colors is overwhelming, and painting can take on a &#039;lucky dip&#039; approach in the hope of finding the right color. This often ends in muddy looking or overworked pictures. This course will help teach you how many professional artists mix their colors and get the right color every time!  </p>  <p>  \t                You will only need eight colors in your palette, and from these I will show you how you can mix any color you like. I&#039;ll show you how the paints work together and how you can create paintings that will always harmonize and look great.  </p>  <p>  \t                The course will lead you step-by-step along an easy path to success. You will learn how to mix wonderful greens, oranges and purples, and from these to create stunning browns, grays, and beautiful neutralized muted colors. You will create a number of color strips that will act as a handy reference for any future painting, helping you to get the exact color you require. We will use these to paint some pictures and there is a final exercise that pulls it all together.<br style=\"\">  \tIf you would like to you can watch a couple of the videos from the course free, by clicking on the Preview button in the curriculum below.  </p>  <p>  \tOr why not take this course now and learn how to control all your color mixing, to save money on paints that you will never use, and to be able to produce any color you need in any painting. This has to be at the core of any painters toolbox! <br style=\"\">  \t  And the course is 100% risk free - there is a 30 day money back guarantee if you find it is not what you are looking for. So why wait? Enroll now and improve your paintings today.  </p>  <p>  \t              In the course I demonstrate with watercolors, but the same color mixing techniques apply equally to acrylics or oils.  </p>", 
    "end_date": null, 
    "title": "Learn the Secret of Successful Color Mixing for Painters", 
    "price": "20.00", 
    "instructors": "Andy Walker", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306742_3d70_3.jpg", 
    "course_url": "https://www.udemy.com/the-secret-of-successful-color-mixing/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T09:56:22Z"
}