{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong style=\"\">If you love the look of Origami but were worried that it seems complicated to make, then this course is for you!  </strong>  </p>  <p>  \t    Until recently, if you wanted to learn how to make Origami by yourself, you had to rely on Origami diagrams in books. Although the diagram system is a clever notation, it can be difficult to decipher! So that leaves many Origami aficionados struggling to figure out how to get their model from one diagram to the next, which can be very frustrating! Origami should be enjoyable! With the help of these video tutorials you’ll see that it’s easy to create complex and elegant Origami models! Each lesson is between 4 and 10 minutes and gets you from the flat piece of paper to the completed model!<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">The Course Includes</strong>  </p>  <ol style=\"\">  \t<li><strong style=\"\">Origami Video Lessons: </strong>To make 7 traditional Origami models: Peace Crane, Flapping Crane, Boat, Butterfly, Star Box, Jumping Frog and Lily Flower.</li>  \t<li><strong style=\"\">Printable Origami Paper: </strong>12 original designs ready for you to print using your home or office printer. So you can make beautiful Origami today, if you like!</li>  \t<li><strong style=\"\">Origami Crease Patterns: </strong>An Origami Crease Pattern shows where all the folds need to be on a flat piece of paper, to make a particular Origami model. These can be used as the basis of the design of Origami paper for a specific model: With Photoshop or by printing it out and colouring it in! Crease patterns are included for all the models featured in the course: Peace Crane, Flapping Crane, Boat, Butterfly, Star Box, Jumping Frog and Lily.</li>  \t<li><strong style=\"\">Recommended Origami Paper: </strong>Where to buy great Origami paper online (US)</li>  </ol>  <p>  \t                Also with the lifetime access and the mobile app, you’ll always have a refresher in your pocket, in case you forget how to make them!<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Benefits of Origami</strong>  </p>  <ol style=\"\">  \t<li>Origami is relaxing</li>  \t<li>You get a great sense of satisfaction from being able to pick up a simple piece of paper and making it into a piece of art!</li>  \t<li>It’s an inexpensive hobby</li>  \t<li>You can do Origami anywhere that you can pick up a piece of paper!</li>  \t<li>Develop your appreciation of colour &amp; design: You’ll see paper and all kinds of design with a renewed interest!</li>  </ol>", 
    "end_date": null, 
    "title": "Learn Traditional Origami - Video Tutorials & Resources", 
    "price": "20.00", 
    "instructors": "Christian Fernandez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/155842_703e_3.jpg", 
    "course_url": "https://www.udemy.com/learn-traditional-origami-video-tutorials-and-resources/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-31T10:56:45Z"
}