{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Mosaic Making for Fun, Decorating and Profit!</p>\n\n<p>Updated in June of 2016!</p>\n\n\n\n<p>This course teaches you how to create a mosaic project from start to finish.  Imagine the colorful, decorative and permanent mosaic projects you can make!  This class will provide explanations and demonstration of all aspects of mosaic making, from simple stepping stones to much larger mosaic projects! How would you like a mosaic fireplace?  Or a mosaic pathway in your patio? How about a mosaic back splash in your bathroom?  See how to do this and more with indirect methodology and direct mosaic methods! </p>\n\n\n\n<p>This class is for teens and adults looking for a challenging hobby.  You can start with a minimal investment in a few tools, and some grout and mortar to make fabulous mosaic patterns out of stones, shells, stained glass, and ceramic tile or plates.  A cost of $15-$50 US dollars is what you will need, depending on your aspirations and materials you may already have on hand. </p>\n\n\n\n<p>Twenty-four lectures and nearly 2 hours of content in demonstrations, tips and advice await you in this step by step class by a mosaic and stained glass expert of nearly 20 years.</p>\n\n\n\n<p>Mosaics have been a key art form for thousands of years, with some of the oldest still preserved.  And modern pieces are just as inspiring today as the Greek and Roman masterpieces are from 4000-5000 years ago. </p>\n\n\n\n<p>If you are interested in decorating projects, see the free section on inspiration to get a good picture of what you will be able to do during and after this class!</p>", 
    "end_date": null, 
    "title": "Make Unique Mosaics for Fun, Decorating and Profit!", 
    "price": "20.00", 
    "instructors": "KT Caselli", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526338_1e50_2.jpg", 
    "course_url": "https://www.udemy.com/mosaic-making-for-fun-decorating-and-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T21:58:13Z"
}