{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t   Even though<strong style=\"\"> this course will show you step-by-step how to make a Tiara</strong> for a birthday party, wedding, an anniversary, a graduation, or other special occasion, <strong style=\"\">you will also acquire the know-how and skills to go on and create a whole new business.</strong> Aside from making a great income from designing tiaras myself, I have also trained beginners and professional Tiara Designers alike for many years, and this online training <strong style=\"\">‘Making Tiaras For Fun And Profit’ is presented in the very same easy to follow step-by-step format that I teach to my workshop students at £147 each for a days training.</strong> Each Section is accompanied by clearly written instructions in PDF format.  </p>  <p style=\"\">  \t   It doesn&#039;t matter if you’re completely new to Tiara Designing or business for that matter, <strong style=\"\">this course will teach you everything you need to know from where to source your raw materials at wholesale prices, to creating two beautiful tiaras, and ultimately 14 different sales and marketing techniques to go out and make some money with. </strong>  </p>  <p style=\"\">  \t   Your family and friends will be amazed when they not only see your newly designed tiaras, but see just how easily you can go out and make money with them.  </p>  <p style=\"\">  \t <strong style=\"\">I will teach you all the basic skills needed to create your own designer tiaras, and show, you really can start a business from your kitchen table.</strong> Making your own Tiaras is not only great fun, but also a fantastic opportunity to create an incredible income.  </p>  <p style=\"\">  \t <strong style=\"\">In Summary</strong>  </p>  <p style=\"\">  \t   34 step-by-step video lectures with accompanying written instructions in PDF format, showing you how to make two Tiras: The Diana &amp; The Snowqueen.  </p>  <p style=\"\">  \t   14 proven Sales and marketing techniques that you can use immediately to create an income.  </p>  <p style=\"\">  \t   Our short list of Wholesale Suppliers. Andrea has previously sold this short list individually for £150GBP .  </p>  <p style=\"\">  \t   This course will show you everything you need to not only create your own designer tiaras, but also how to create an amazing income should that be your desire.  </p>", 
    "end_date": null, 
    "title": "Making Tiaras For Fun & Profit", 
    "price": "20.00", 
    "instructors": "Andrea Kathleen Benson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/205016_2f98_4.jpg", 
    "course_url": "https://www.udemy.com/making-tiaras-for-fun-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-25T11:54:36Z"
}