{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Cuando emprendes por primera vez la tarea de hacer una manualidad, como un portalápices, te pueden surgir un montón de preguntas: ¿qué materiales debo usar?, ¿por dónde empiezo a medir o pegar?, ¿cómo quito el filo?, o simplemente ¿cómo lo hago?. Así que puede pasar que inviertas mucho tiempo y aún así tu primer intento no salga como lo esperabas.</p><p><strong>Tu tiempo es muy valioso, por que no mejor ocuparlo en crear. </strong></p><p>Este curso te muestra todos los detalles que necesitas saber para elaborar un portalápices. Obtendrás una lista completa de todos los materiales que necesitas y podrás aprender por medio de vídeos los pasos que debes seguir. El objetivo es que tengas la menor cantidad de problemas. </p><p>También el curso te enseña cómo decorar el portalápices, pero esa solo es una sugerencia. Una vez que aprendas la técnica podrás dedicar tu tiempo a crear tus propios diseños. </p><p><strong>Contenido del curso</strong></p><p>El curso consiste de aproximadamente 30 minutos de vídeo. Y está diseñado para todos aquellos que deseen una explicación detallada de cómo hacer un portalápices. </p><p>El primer paso será mostrarte que materiales y herramientas necesitarás. Después aprenderás como eliminar el borde afilado que algunas latas tienen. Lo siguiente será hacer las cubiertas que se colocarán en la base de la lata.</p><p>Una parte fundamental del curso será el que aprendas cómo tomar medidas en la lata. De esta forma serás capaz de forrar los bordes y elaborar los forros que se colocarán por dentro y por fuera de la lata. También, este curso te dará una idea de cómo puedes pintar de manera sencilla estos forros. </p><p>Y como último paso será el que aprendas a pegar tanto los forros como las cubiertas a la lata.</p><p><em><em>Al completar el curso:</em></em></p><ul><li>Habrás aprendido una técnica para elaborar portalápices a partir de latas de comida.</li><li>Obtendrás un objeto hecho a mano sin necesidad de gastar mucho dinero, el cual te podrá servir para obsequiar o para decorar tu espacio de trabajo.</li></ul>", 
    "end_date": null, 
    "title": "Manualidades: recicla una lata y crea este portalápices", 
    "price": "20.00", 
    "instructors": "Monica Garcia", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518532_ea7c_3.jpg", 
    "course_url": "https://www.udemy.com/manualidades-para-principiantes-crea-tu-propio-portalapices/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T23:45:57Z"
}