{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course went <strong>LIVE September 21 2015.</strong><strong></strong></p><p><strong>New section added September 23.</strong></p><p>This course is a <strong>MUST</strong> for anyone interested in improving their watercolour paintings. </p><p>* <strong>An absolute beginner? </strong>This will give to some basic guidelines to create solid foundations to help you get into good habits right from the start.</p><p>* <strong>Already painting but think your pictures lack 'something?'</strong> This might be just what you're looking for to lift the standard of your work and make your paintings stand out from the rest. It's easy to get in a rut and use the same methods time after time. This course will help you step outside your <strong>comfort zone.</strong></p><p>This concise course will clearly define <strong>FIVE</strong> areas that will really change the quality of your work. My experience shows me that If you go through this mental 'check list' every time you work on a painting, you will see some dramatic improvements .</p><p>Look over my shoulder as I take you through each of these crucial elements in watercolour painting. Each lecture is a complete video demonstration with full supporting notes and resources where required.</p><p>\n<strong><strong>I\nam here to help you build your confidence and knowledge so you can\nget as much as you can from this rewarding pass time.</strong></strong></p><p>\n<strong><strong>Enjoy\nyour painting, Nicola</strong></strong></p>", 
    "end_date": null, 
    "title": "My 5 most useful tips to give your painting a head start.", 
    "price": "20.00", 
    "instructors": "Nicola A Blakemore", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575764_7f74_2.jpg", 
    "course_url": "https://www.udemy.com/5-most-useful-tips-to-really-lift-your-watercolour-paintings/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T15:03:14Z"
}