{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em><em><strong>PAINT\nME !</strong></em></em></p><p>\nThis\nis one from my 'pick a painting to paint' portfolio and is complete\nin itself. By that I mean it is unlikely I will add any further\ninformation, it is therefore priced accordingly. This portfolio of\npaintings gives you the opportunity to choose a picture you like and\nlearn as you create it</p><p><strong>If you like this picture and want to paint it, then that's exactly what you will do, effortlessly.</strong></p><p>You will be able to follow my clear and friendly videos, looking over my shoulder as I paint every step of the way.</p><p>Each step has a video fully supported with any extra visual images or text that you might need to help you fully understand each painting process.</p><p>At the end, not only will you have painted a beautiful atmospheric painting but you will also have learned a number of <strong>valuable tips </strong>when working with watercolour paints.</p><p>Learn how to plan and mix your colours effectively. How to achieve a sense of warmth and shade and how to use enough detail painting to enhance the sense of distance in a landscape.</p><p>Each lecture stops at a natural break, as you would wait for you paint to dry and my relaxed and clear narration will help you fully understand the process. Enjoy it and don't forget to share your painting with us all.</p><p>\n<strong><strong>I\nam here to help you build your confidence and knowledge so you can\nget as much as you can from this rewarding pass time.</strong></strong></p><p>\n<strong><strong>Enjoy\nyour painting, Nicola</strong></strong></p>", 
    "end_date": null, 
    "title": "Paint this watercolour in only 5 fun & easy to follow steps", 
    "price": "20.00", 
    "instructors": "Nicola A Blakemore", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667686_fc69.jpg", 
    "course_url": "https://www.udemy.com/you-can-paint-this-watercolour-in-five-easy-to-follow-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T09:51:02Z"
}