{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>If you are a beginner watercolor painter ...This course is for you - if you want to take your work from drab to fab. </p><p>Your course shows you step-by-step how to paint watercolors from dark to light ... a dazzling technique common to oil painting ... yet amazing results can be achieved in watercolor ... even for beginners. </p><p>You can find this course under lifestyle, arts and crafts or beginner watercolor painting.</p><p>Included are 1.6 hours or 89 minutes of video instruction to guide you through this painting. I also address unspoken mental hurdles that hamper beginning watercolor painters from reaching their full potential. Text lectures serve to emphasize important points you won't want to miss.</p><p>Your course includes over 35 lectures in bite size segments so you can absorb the information effortlessly. </p><p>Of course if you get distracted while watching the videos ... you can always rewind and start over ... one of the major Udemy course positives.</p><p>The actual painting took about 1 hour to paint. You most likely have all the colors and brushes needed. Not to worry - you will see exactly how the colors are prepared for the painting and the brushes used are clearly shown and described in the videos.</p><p>Your course is structured to walk you from blank paper to finished masterpiece in easy stages. </p><p>Handling your brush ... something advanced painters just do without thinking to achieve their amazing results ... is addressed in a separate bonus video - to show you just what is holding you back from the results you seek. </p><p><br></p>", 
    "end_date": null, 
    "title": "Paint this Beginner WATERCOLOR using 5 Advanced techniques", 
    "price": "20.00", 
    "instructors": "Marsden Burnell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653172_448c_2.jpg", 
    "course_url": "https://www.udemy.com/paint-this-beginner-watercolor-using-5-advanced-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T07:06:00Z"
}