{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em><em><strong>PAINT\nME !</strong></em></em><br></p><p>\nThis\nis one from my 'pick a painting to paint' portfolio and is complete\nin itself. By that I mean it is unlikely I will add any further\ninformation, it is therefore priced accordingly. This portfolio of\npaintings gives you the opportunity to choose a picture you like and\nlearn as you create it.</p><p><strong>Another fabulous watercolour painting workshop from Nicola for the aspiring artist to enjoy painting and to learn about this exciting painting medium as you go. </strong></p><p>A workshops which I believe is suitable for all levels because I explain every step in my friendly teaching style. My slow and clear narration will help you understand each process, filmed in such a way, you will feel as if you are standing next to me.</p><p>All the information about what you will need and what you will learn is listed and every lecture covers a stage in the painting, stopping naturally, as you would to let your paint dry. </p><p>Watch each film, stopping as often as you like and working quietly at your own pace when it suits you. And remember the films are your's to look at time and again for guidance and inspiration.</p><p>Follow my instructions to the letter or take the bits that you want and make changes as you please. This painting workshop is to help you see what is possible to do with watercolour paints and to help give you the confidence to feel more comfortable when you plan and paint your own chosen subjects.</p><p>If there is anything which is not clear, all you have to do is send me a message or post your question in the discussion section. And do share you painting with us all in the course, it's great to see what is being painted, it encourages other students, boosts everyone's confidence and makes me feel the work has been worthwhile.</p><p><strong>I am here to help you build your confidence and knowledge so you can get as much as you can from this rewarding pass time.</strong></p><p><strong>Enjoy your painting, Nicola</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Paint this French watercolour scene. Copy me in 8 easy steps", 
    "price": "20.00", 
    "instructors": "Nicola A Blakemore", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678186_6527.jpg", 
    "course_url": "https://www.udemy.com/old-french-vineyard-shelter/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T13:04:07Z"
}