{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  Painting plastic models such as airplanes and cars is the most fun yet challenging part of building them.  There is a tremendous amount to learn to produce a decent result.  This course will walk you through the various materials, tools and techniques, and give you the confidence to produce great model paint jobs.  </p>  <p>  \t<strong style=\"\"><strong style=\"\">Master the Art of Painting Plastic Models</strong></strong>  </p>  <ul style=\"\">  \t<li> Types of Plastic Model Paint</li>  \t<li>Paint Brushes, Spray cans, and Airbrushes</li>  \t<li>Weathering to simulate wear, aging and rust</li>  \t<li>Dry-brushing, panel fade, washes, paint chipping</li>  \t<li> Camouflage Application</li>  \t<li> Bare Metal Foil</li>  \t<li> Applying Decals</li>  \t<li> Making your own Markings</li>  </ul>  <p>  \t  You will likely spend tens of hours (or in some cases hundreds of hours!) getting your plastic model to the stage where it is ready for painting and finishing.  You will more than likely invest additional hours in painting several layers before the model is done.  One mistake due to lack of preparation or not recognizing a potential problem could leave you frustrated.  Why settle for a poor paint job, or risk having to spend more time taking paint <em style=\"\">off </em>your model?  I&#039;ve already made just about every mistake possible, so let <em style=\"\">my</em> experience be <em style=\"\">your</em> guide!  </p>  <p>  \t  This course contains information that is usually gained through years of trial and error.  This is where the weight of experience really helps you: how to prevent problems from happening, recognize them when they do, and what corrections you can make.  The Troubleshooting guide is arranged in a neat table format, allowing you to find what you need quickly.  It&#039;s also illustrated with photos and diagrams.  </p>  <p>  \t<strong style=\"\"><strong style=\"\">Contents and Overview</strong></strong>  </p>  <p>  \t   This course contains 19 lectures, 1 hour 20 min of video content, and 30 pages of written content. It&#039;s designed for any plastic model builder, who wishes to improve their painting and finishing skills.<br style=\"\">  \t<br style=\"\">  \t  You&#039;ll first learn when and how to use Acrylic, Enamel and Lacquer paints. You&#039;ll then be shown how to paint with a brush, spray cans, and airbrushes.  You&#039;ll learn to apply decals, and how to use bare metal foil to simulate chrome.  Finally, you&#039;ll add amazing realism to your models with weathering techniques.  </p>  <p>  \t   By the end of this course, you&#039;ll be able to apply a paint finish that rivals those you see in hobby shops or even museums.  </p>", 
    "end_date": null, 
    "title": "Painting and Finishing Scale Plastic Models", 
    "price": "20.00", 
    "instructors": "Andy Mack", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333508_eafe_3.jpg", 
    "course_url": "https://www.udemy.com/painting-and-finishing-scale-plastic-models/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-01T17:49:44Z"
}