{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">This Course is Updated with new Information</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Palmistry</strong> is both an art and a science. It is based on scientific principles that can be learned by anyone. The hand is called &#039;God&#039;s Road Map,&#039; and is one of the most valuable tools we have for guidance. Knowledge of Palmistry will enrich the lives of all with whom you come in contact.  </p>  <p style=\"\">  \tThe classes in <strong style=\"\">Palmistry</strong> are unique, in-depth trainings. The School of Oracles is dedicated to preserving and perpetuating this sacred art in a manner that does honor to the wisdom, healing and illumination it brings to humanity.  </p>  <p style=\"\">  \tEveryone can benefit from this class. It is given for people who are curious to know themselves and others better and for those who would like to become a professional Palmist.  </p>  <p style=\"\">  \tIn class we will cover every aspect of the hand, the shapes, the lines, fingers, the seven planetary archetypes and so much more. We will have practice in reading hands and learn how to make a synthesis of the information we find.  </p>  <p style=\"\">  \tPalmistry&#039;s use as a means of psychological insight and divination dates back thousands of years.  Because <strong style=\"\">the hand changes as you change</strong>, it is an up to the minute report from your own Higher Self. The hand shows how you are doing in many areas of your life, including health, financial security, your talents, strengths and weaknesses. It shows the best choices for a fulfilling life for the unique individual that is you.  The hand is a mirror of the soul.  </p>", 
    "end_date": null, 
    "title": "Palm Reading aka Palmistry - Your Key to Unlock the Future", 
    "price": "20.00", 
    "instructors": "Helen Goldberg", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419766_a182_3.jpg", 
    "course_url": "https://www.udemy.com/palm-reading-aka-palmistry-your-key-to-unlock-the-future/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T00:59:22Z"
}