{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong><u>Pen &amp; Ink Drawing for Beginners.</u></strong>  </p>  <p>  \t          This is an easy to follow beginners course with detailed instructions, from information regarding the materials needed before you start, through to creating a finished drawing.  </p>  <p>  \t          For my subject matter I will working from flowers, but even if this is not a subject which interests you, the instruction given can be applied to all subjects and will be useful for anyone wishing to learn Pen &amp; Ink Drawing techniques.  </p>  <p>  \t          The course should take a few weeks but each student will be working at a different pace and have a different amount of time to devote to practice. There is therefore no definite time line.  </p>  <p>  \t          There will be lectures with practical drawing exercises which are clearly demonstrated, and information will be available regarding professional artists&#039; work, with examples shown, which are of relevance to the various lectures. Some of the lectures have additional downloaded material to supplement the learning experience.  </p>  <p>  \t          Taking this course will give you a unique experience in concentration and creativity. You will feel empowered and exhilarated by your achievements and you will find that you will be able to draw independently, with both skill and confidence.  </p>", 
    "end_date": null, 
    "title": "Pen & Ink Drawing for Beginners", 
    "price": "20.00", 
    "instructors": "Anne Edwards", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165152_0942.jpg", 
    "course_url": "https://www.udemy.com/pen-ink-drawing-course-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-16T12:39:10Z"
}