{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>La acuarela es una técnica con la que se puede disfrutar mucho y con la que nos podemos sorprender incluso a nosotros mismos, ya que se ponen en juego muchas variables que tienen vida propia.</p><p>Pero en la acuarela no hay marcha atrás, no se puede rectificar, y además es una técnica muy rápida donde hay que improvisar mucho; por eso hay que aprender a dominarla desde la base, para luego poder trabajar con mayor soltura y destreza.</p><p><strong>¿COMO SE APRENDE A PINTAR ACUARELA?</strong> </p><p>Yo creo que para dominarla hace falta práctica, que no se consigue pintando un sólo cuadro, sino a base de hacer y hacer... Por eso, me he planteado el reto de crear un curso que realmente sea didáctico y enseñe a quien quiera aprender, a partir de una serie de ejercicios de menor a mayor complejidad, donde explorar todos los aspectos técnicos de la acuarela, poniéndolos en práctica, y aprendiendo a controlarlos desde la base.</p><p><strong>EL CURSO</strong></p><p>En este curso <strong>aprenderas a dominar la acuarela</strong> a partir de</p> <ol> <li>Un solo color</li> <li>Un solo pincel</li> <li>Un solo tipo de papel</li> </ol> <p>Con estos materiales haremos <strong>7 ejercicios que girarán en torno a los diferentes tipos de luz</strong>, como la luz frontal, la luz indirecta, el resplandor o el contraluz; y sobre una forma básica como es el huevo, una forma sencilla que nos permitirá concentrarnos en la técnica pura de la acuarela, sin distracciones, para aprender a dominarla de verdad.</p><p> Espero que aprendas mucho, te diviertas y disfrutes!</p>", 
    "end_date": null, 
    "title": "Pintura al Acuarela: Iniciación a la luz", 
    "price": "20.00", 
    "instructors": "Juanma Santaella", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461996_fcc5_6.jpg", 
    "course_url": "https://www.udemy.com/pintura-al-acuarela-iniciacion-a-la-luz/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T11:00:52Z"
}