{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Do you ever feel overwhelmed with all the things you need to do every day? </p><p>If you are like me you probably do. Sometimes it feels like a mountain you need to climb without a chance to get it all done in one single day! Then, at the beginning of 2015 I've discovered that there is a hobby called \"Planning\" and I got totally addicted.</p><p>The days you'll feel overwhelmed will be gone once you use your favorite hobby - scrapbooking - and turn it into an effective way to organize your time.  Planning is about organizing yourself in a much better way but at the same time you'll be able to keep track of your life. You can add pictures to your planner and decorate it all with specific stickers and other tools. Planning is all about you and \"me time\" - when you set up your planner. </p><p>But you can also add more into your planner such as a budget list, a wishlist, recipes and so on. It's your personal book about all the ongoings in your life.</p><p>In this small course we will have a look at the different terms you need to know in the planner world. From a Planner Buddy to a Dashboard we cover it all.</p><p>We also have a look at the different planners on the market and you can see how they look inside. So you can find the one for your needs. </p><p>Beside that you may wonder what things you need for your new hobby. I’ll show them to you but don’t worry, you don’t need it all. Planning is a very inexpensive hobby once you have the most necessary thing: a planner.</p><p>However, you can use a lot of things to decorate but you don’t have to. So just get some inspiration from this small 101 Planner Course to acutally know what people are talking about.</p><p>One of the best things tough is to fine a planner buddy, a new friend who will send you Happy Mail - we cover that, too!</p>", 
    "end_date": null, 
    "title": "Planning a Scrapbook to organize your Life", 
    "price": 0, 
    "instructors": "Angelika Brunke", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670140_a743_3.jpg", 
    "course_url": "https://www.udemy.com/planning-a-scrapbook-to-organize-your-life/", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T05:54:25Z"
}