{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Scrapbooking is the best way to keep you rmemories alive. But who wants the mess? Who has room to store all the materials and money for all the little supplies? It can be expensive for sure!</p><p style=\"\">Now we have a way to create scrapbooking pages which look like traditional pages but are actually digital scrapbooking pages!</p><p style=\"\">But no more with digital scrapbooking. Because for digital scrapbooking you need no more than your computer or your iPad or iPhone. We take all our pictures with the table or mobile phone anyway, right? I'm sure you do as well and because of that - it's much more handy to scrap there directly and get a beautiful photobook together in a few hours.</p><p style=\"\">Crafts made easy - without the mess and without all the expensive supplies!</p><p style=\"\">In the training course Easy Scrapbooking we show you a super simple way to use your photos and create beautiful gifts for yourself and your family. It will no longer take weeks to create a unique photobook. It will be a question of minutes to make a page every day and to keep track of your family's life. Quick, easy and with all functions you need - from image editing to filling your pages with tons of lovely cards.</p><p style=\"\">But wait - it gets better! </p><p style=\"\">You cannot just use the kits Becky Higgings has created for her App Project Life. We even show you a way to create your VERY own and unique cards, perfectly fitting to your lovely pages. You can use ANY kit you already own - so no additional costs for you but MUCH more fun! You can create them on your computer, in a quick and easy way. We show you how to create title cards, filler cards and last and first page cards and journaling cards. Even if you have no experience with Photoshop or any other image editing program - it's so easy that you can do it in no time.</p><p style=\"\">For this course, you'll need the Project Life App from Becky Higgins as well as your iPad or iPhone</p><p style=\"\">Let's do this, let's preserve your memories quick and easily!</p>", 
    "end_date": null, 
    "title": "Preserve your Memories in a digital Photoalbum", 
    "price": "20.00", 
    "instructors": "Monja Wessel, Markus Korsten", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449576_64e6.jpg", 
    "course_url": "https://www.udemy.com/easy-scrapbooking/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T16:46:02Z"
}