{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Course updated January 2016</p>\n\n<p><strong>March 3 2016 New lecture added at number '4' about how watercolour paints work as a result of a student's comment.</strong></p>\n\n<p><strong></strong></p>\n\n<p>Many people would like to make art by painting, but many don't even try in their adult years because they 'believe' that they don't have a talent, don't know any technical stuff and more likely than not, somewhere along the line somebody told them they weren't any good at it.<br></p>\n\n<p>  \t                                                                           So this created a<strong> 'limiting believe' </strong>which inhibited them from enjoying a fun, enlightening, soothing and expressive creative pursuit.  </p>\n\n<p>  \t                                                   Get ready to change that <strong>'limiting believe'</strong> and enjoy painting for it's own sake through this non threatening and friendly<strong> 'play - cedure'.</strong>  </p>\n\n<p>  \t          This is what one student posted in her blog :- <em> 'I was so surprised to find that she started very simply, just playing with water and unmixed colors of paint. Slowly a beautiful patchwork of designs appeared on her page. Where borders and boundaries in the art were a bit blurred, she went in with a pen and neatened them up. Sometimes she chose to add designs with the pen and then paint over them, and other times she added swirls and triangles to the dried paint. With growing excitement I realized that this project was well within my comfort zone.'</em>  </p>\n\n<p>  \t                                                       With no one looking over your shoulder and no expectations you will find you are learning through play and gaining the confidence to do more. Most of all just enjoy doing it.  </p>\n\n<p>  \t<strong>If, however, you don't enjoy it and are not happy you can claim a full refund within 30 days. No questions asked. </strong>  </p>", 
    "end_date": null, 
    "title": "Relax & learn watercolour painting as you play. Just copy me", 
    "price": "30.00", 
    "instructors": "Nicola A Blakemore", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/72964_adf4_21.jpg", 
    "course_url": "https://www.udemy.com/painting-for-the-petrified/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-02T08:13:07Z"
}