{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong>  Learn How to Sew!</strong> The lessons in this Sewing for Beginners course will cover the core principals of sewing by hand and by sewing machine. In this interactive course, you will gain an understanding of the sewing craft through:  </p>  <ol>  \t<li>Video tutorials</li>  \t<li>Slide show presentations</li>  \t<li>Documents</li>  \t<li>Quizzes</li>  \t<li>Supplementary material</li>  </ol>  <p>  \t        Not only does this course teach you how to cut and sew textiles, it provides a brief history of textile origins and the history of the thousands of years old art of sewing. Your newly acquired knowledge and skills will be put into practice with beginner projects that will strengthen your understanding, spark your creativity, and send you on your way to becoming a seamster or seamstress of impeccable craftsmanship.  </p>  <ul>  \t<li><em>Do you love fashion? This is an introductory course for the absolute beginner. Learn the basics of how your favorite runway pieces are created.</em></li>  \t<li><em>Has it been decades since you took Home Ec in school? This is the perfect refresher course for you.</em></li>  \t<li><em>Do you want to learn how to mend some well loved items in your home but don&#039;t know how? This course teaches a variety of hand sewing stitches that you can use to give your favorite textile items new life.</em></li>  \t<li><em>Do you love to create new things? Put that glue gun down and add hand sewing and machine sewing to your crafting repertoire.</em></li>  \t<li><em>Do you want to learn how to make extra money? With the basic skills taught in this course, you will arm yourself with the know-how needed to make your design ideas into reality.</em></li>  </ul>  <p>  \t        I&#039;ve been sewing for over twenty years, not that many people know who to sew these days. The more time that goes on, the less trade and craft skills people have. You can be that person to whom others reply in astonishment, <strong>&quot;Wow! You made that?!&quot;</strong> Learn how to sew and carry on the tradition.  </p>  <p>  \t              * So that you get the most comprehensive learning experience, this course will be continually updated with new projects.  </p>", 
    "end_date": null, 
    "title": "Sewing for Beginners", 
    "price": "20.00", 
    "instructors": "Cam Parsons", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/282016_bbcb_3.jpg", 
    "course_url": "https://www.udemy.com/sewing-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-16T13:27:29Z"
}