{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Are you interested in calligraphy but really don't know where to start ? Then why don't you join me to learn how to write in a simple Gothic Script ?</p><p>In this series of videos, I will  </p><ul>\n<li>show you how to insert the nib into your holder ;</li>\n<li>give you some hints for get the ink to flow from your pen ;</li>\n<li>talk about letter weight and proportion ;</li>\n<li>teach you about those oh-so-necessary guidelines ;</li>\n<li>tell you about the ductus (the strokes that make up a letter).</li>\n</ul><p>After that, you will learn how to </p><ul>\n<li>draw each letter of the alphabet, first the lowercase letters, then the uppercase. The letters are not demonstrated in alphabetical order; they will be presented to you in groups of similar letters ;</li>\n<li>plan and execute a project with a short text.</li>\n</ul><p>You will see me using traditional pen-and-ink in these videos (a 3 mm Brause nib and walnut hull ink), but of course you can use calligraphy markers or cartridge pens with a calligraphic nib instead.</p><p>The upsides of doing calligraphy are numerous. For example,</p><ul>\n<li>you will learn to create beautiful letters. Creating beauty of any sort is a wonderful thing to do ;</li>\n<li>calligraphy is yoga-for-the-soul. In doing calligraphy, you set aside some time for yourself, and you will feel great for it ;</li>\n<li>calligraphy contributes to neuroplasticity —which basically means that, while teaching your (old) brain new tricks, you are  creating new pathways in your brain and paving the way to sharper neurological skills.</li>\n</ul><p>Aside from the videos and presentations that make up this course, several downloadable documents are included (practice sheets, letter reference sheets ...).</p><p>So grab your pen and paper, and come along with me on this calligraphic journey!</p>", 
    "end_date": null, 
    "title": "Simple Gothic Hand Calligraphy", 
    "price": "20.00", 
    "instructors": "Mary-Jane Roussel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640054_d9a3.jpg", 
    "course_url": "https://www.udemy.com/simple-gothic-hand-calligraphy/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T06:07:34Z"
}