{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>The Simple Magic Tricks video course is for anyone interested in the art of magic. Although it is catered towards the beginner, experienced magic students will benefit from the course as well.</p><p>If you are looking for an array of tricks that are both easy to learn and simple to perform, yet pack a professional punch, then this course is for you.</p><p>All the tricks in this course use everyday common objects found around the house, such as rope, coins, playing cards, string, etc.</p><p>The course consists of over 40 tricks. Each trick is first shown and performed, then I take you behind the scenes to demonstrate how the trick really works.</p><p>There are five sections of tricks: </p><p>Card Tricks</p><p>Coin Tricks</p><p>Rope/String Tricks</p><p>Mental Tricks</p><p>And Miscellaneous Tricks</p><p>The Simple Magic Tricks Course is a great introduction to the world of magic. Each trick is specifically selected on three criteria.</p><p>1. It is easy to perform.</p><p>2. It is simple to learn.</p><p>And..</p><p>3. It is a good enough trick that even professionals use them in their acts.</p><p>If you really want to stun the pants off audiences, then let&#039;s get to learning some magic.</p><p>I promise you will not be disappointed.</p><p>It will be fun, exciting and entertaining.</p><p>That is what makes magic so great.</p><p>See you on the inside...</p><p></p>", 
    "end_date": null, 
    "title": "Simple Magic Tricks Anyone Can Do", 
    "price": "35.00", 
    "instructors": "Daniel Egan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483638_7ac8_3.jpg", 
    "course_url": "https://www.udemy.com/simple-magic-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T19:42:13Z"
}