{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t     Drawing is a skill that is learned and developed and this video course is designed to give you the knowledge that you need to draw better almost immediately! Anyone can learn how to draw.  Each aspect of drawing is broken down into “easy to follow&quot; and “easy to understand&quot; segments complete with drawing demonstrations and commentary.  All lessons are presented in High Definition!  There are a total of 28 HD videos with over 500 minutes of drawing instruction. The course also includes 26 ebooks that combine for 178 pages with 498 color illustrations.  </p>  <p>  \tHere&#039;s what&#039;s included...  </p>  <ul style=\"\">  \t<li><strong style=\"\">Video 1</strong> – “Introduction&quot;- An introduction to “The Secrets to Drawing&quot; video series.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 2</strong> – “Line&quot; – A look at the element of art, line and its relationship to drawing. Concepts covered include contour, blind contour, line quality, and cross contour lines.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 3</strong> – “Shape&quot; – A look at how shapes can be used to draw anything. Concepts covered include geometric and organic shapes, using shapes to draw objects.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 4</strong> – “Form&quot; – A look at how to create the illusion of form on a 2-Dimensional surface. Concepts covered include turning shapes into forms, using shadow to further the illusion.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 5</strong> – “Value&quot; – This video takes a look at the element of art, value and its relationship with drawing. Concepts explored include tints, shades, highlights and shadows, and creating the illusion of a light source.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 6</strong> – “Space&quot; – This video takes a look at how to create the illusion of space on a 2-Dimensional surface. Concepts covered include overlapping, size, value/color, detail, placement on the paper, and linear perspective.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 7</strong> – “One Point Perspective&quot; – Space is explored further in this video through one point perspective. Concepts covered include horizon line, vanishing point, one point perspective.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 8</strong> – “Two Point Perspective&quot; – A look at how to use two point perspective to create the illusion of space in a drawing. Concepts covered include horizon line, vanishing points, two point perspective.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 9</strong> – “Three Point Perspective&quot; – A look at creating the illusion of space through three point perspective. Concepts covered include vanishing points, horizon line, steps to three point perspective.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 10</strong> – “Drawing Techniques&quot; – A look at basic drawing techniques and suggested media. Concepts covered include medium, hatching, cross hatching, blending, rendering, random lines, and stippling.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 11</strong> – “Drawing from Life&quot; – Tips on drawing from life. Concepts covered include still life lighting, using a view finder, and sighting techniques.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 12</strong> – “Drawing from Photos&quot; – How to draw realistic drawings from photographs. Concepts covered include cropping photos, editing photos, creating a grid, drawing with the aid of the the grid.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 13</strong> – “Composition&quot; – How to create successful compositions in drawings. Concepts covered include sketching thumbnails, positive and negative space, Plato&#039;s Rule, The Rule of Thirds, The Golden Mean, eye movement, and how to create focal points.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 14</strong> – “Graphite&quot; – A description and characteristics of the drawing medium, graphite. Concepts explored include graphite grades, characteristics, forms, and techniques.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 15</strong> – “Charcoal&quot; – A look at the drawing medium, charcoal. Concepts covered include charcoal forms and applications.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 16</strong> – “Drawing with Ink&quot; – An exploration of the drawing medium of ink. Concepts covered include ink wash, choosing the right ink, pen and ink applications with a nib pen.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 17</strong> – “Color&quot; – A look at the three parts of color theory and how it influences color choices in our drawings. Concepts covered include: the color wheel, primary, secondary, tertiary, color values, color intensity, psychological effects of color, color schemes, monochromatic, complementary, color triads, color tetrads, analogous, warm, cool, split complementary.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 18</strong> – “Colored Pencils&quot; – How to use colored pencils. Concepts covered include layering, mixing, building up colors, burnishing, and adding details.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 19</strong> – “Oil Pastels&quot; – An exploration into the drawing medium of oil pastels. Concepts covered include layering, mixing, and landscape drawing with oil pastels.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 20</strong> – “Soft Pastels&quot; – An in-depth look at the use of soft pastels in the creation of a seascape. Concepts covered include proper use of soft pastels including smudging and layering colors.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 21</strong> – “Facial Proportions&quot; – A look at basic facial proportions from the front and profile views. Concepts covered include general locations of facial features and placement relationships.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 22</strong> – “The Eye&quot; – An in-depth look at drawing a human eye.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 23</strong> – “The Nose and the Mouth&quot; – A look at drawing the nose and the mouth.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 24</strong> – “The Ear&quot; – A look at drawing the human ear with graphite.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 25</strong> – “Hair&quot; – A look at drawing hair with graphite.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 26</strong> – “Basic Figure Drawing&quot; – A basic introduction to figure drawing including a simple four step method for drawing a figure.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 27</strong> – “Foreshortening&quot; – Drawing the figure in perspective.</li>  </ul>  <ul style=\"\">  \t<li> <strong style=\"\">Video 28</strong> – “Conclusion&quot; – A review of the course and a plan for moving forward.</li>  </ul>", 
    "end_date": null, 
    "title": "The Secrets to Drawing", 
    "price": "30.00", 
    "instructors": "Matthew Fussell", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137230_76b8_2.jpg", 
    "course_url": "https://www.udemy.com/the-secrets-to-drawing/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-23T20:04:23Z"
}