{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>\"The Acrylic Painting Academy\" is a comprehensive painting course designed to guide absolute beginners to a level of producing professional quality acrylic paintings through concise and “easy to digest” modules that include HD videos and Ebooks. Designed for beginners, this course lays the foundation required for success with acrylics and painting in general.</p><p>Students are guided through a series of logically-sequenced course modules that build upon the last covering the following topics...</p><ul><li>Materials, surfaces, and tools. Compositional make up of acrylic paint and brushes commonly used for acrylic painting.</li><li>Light and Form. How to mix and apply values of a color to create the illusion of light and form within a scene.</li><li>Stretching Canvas. How to stretch and prepare your own canvas for painting.</li><li>Learn the process of transferring images to a canvas and painting directly (<em>Alla Prima</em>) by mixing colors as they are observed. Apply layers of color applications to finish a painting that accurately communicates the subject through direct painting.</li><li>Color Theory and Mixing. Learn the basics of color theory and how to mix colors accurately.</li><li>Color Theory in Action. How to apply color theory in your paintings to create harmonious works.</li><li>Acrylic Mediums. A look at various acrylic fluid and gel mediums that can be used to enhance the versatility of the medium.</li><li>How to develop a painting completely made up of neutral values (<em>Grisaille</em>) to establish the tonal range. </li><li>How to create and apply translucent glazes of color over an underpainting to develop the colors within a scene.</li><li>Painting With a Knife. Learn to apply thick Impasto applications of color with painting knives.</li><li>Abstraction / Non-Objective Painting. Strategies for creating successful abstract and non-objective acrylic paintings.</li></ul><p>Acrylic paints, various brushes, and surfaces are required to \"paint along\" with each of the demonstrations.  </p>", 
    "end_date": null, 
    "title": "The Acrylic Painting Academy", 
    "price": "30.00", 
    "instructors": "Matthew Fussell", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850954_724b.jpg", 
    "course_url": "https://www.udemy.com/the-acrylic-painting-academy/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T17:49:49Z"
}