{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>I’m Neil. A Top selling Art Instructor at Udemy  - And best-selling author of How to Draw Awesome Figures.</p>  <p>Welcome to my course the Power of Gesture Drawing: how to gesture draw figures. </p>  <p>I teach the why’s, like why to use a C curve when drawing a gesture, or why to use an S curve, etc. I don’t just draw and talk. I actually teach you to become a better artist. I have over 10,000 students, which all love my teaching style. </p>  <p>In this course, we will learn how to draw amazing figures that will make our comics, illustrations, video game art, etc look professional. We will learn gesture drawing in a way that makes since, in a way that will improve your figures’ poses. They will look alive and powerful. </p>  <p>Because I want you to draw the best figures possible, we’re going to learn everything about gesture drawing and how it makes drawing figures easy. We will learn what a gesture is and what a gesture is not. We will learn how to apply the line, C-curve, and S-curve to our figures. We will learn how to draw gestures from imagination and from references. We will learn different techniques of gesture drawing, and finally, we will learn to draw 90, 60, and even 30 second gesture drawings. </p>  <p>This course is for anyone that wants to draw the best looking figures quicker and easier than before. It’s for beginners and advanced students. Anyone can learn to draw better figures with this course. </p>  <p>Thanks for taking interests in The Power of Gesture Drawing. I’m really excited to see how much you improve, so go ahead and click the enroll button, or test the course out first by using the free preview feature. Thanks. See you on the inside. </p>", 
    "end_date": null, 
    "title": "The Power of Gesture Drawing: how to gesture draw figures", 
    "price": "25.00", 
    "instructors": "Neil Fontaine", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707594_bd5c.jpg", 
    "course_url": "https://www.udemy.com/the-power-of-gesture-drawing-how-to-gesture-draw-figures/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-27T12:24:01Z"
}