{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\"><p style=\"\">In this Acrylic  Painting Techniques course, students will learn the &#039;acrylic glazing&#039;  technique that will empower them to carry on with painting as a self-fulfilling  hobby. The more serious student will find that this hands-on course  de-mystifies the painting process in all genres. Discover the deep rich shadows  which may be created without the use of black!</p>    <p style=\"\">A check-list for acrylic painting techniques will be provided for beginners  including the specific colors and type of acrylic paint and &#039;medium. As well as  brushes, canvas, etc. This technique calls for only the very basic colors at  the outset.</p>    <p style=\"\">This acrylic  painting techniques course will include hands-on video demonstrations  based on an original photograph by the instructor (supplied). The course  consists of twelve steps; each requiring about one-three hours of painting,  depending on the skill set of each participant. Each step of the &#039;glazing&#039;  process will be shown by the instructor so that the student can advance at  their own pace. </p>    <p style=\"\">Once you have mastered the &quot;Art of Acrylic Glazing&quot; you  will have the confidence and technical ability to carry on fearlessly with your  own artistic journey using the versatile and powerful medium of acrylic  painting.</p>    <p style=\"\">Take this Acrylic  Painting Techniques course now and learn &#039;acrylic glazing&#039; from a modern master.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "The Art of Acrylic Glazing with a Modern Master", 
    "price": "50.00", 
    "instructors": "Art Instructor Michael Gaudet", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32334_b0a1_7.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-acrylic-glazing-with-a-modern-master/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-11T19:17:54Z"
}