{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong style=\"\">Overview:</strong></p><p>The Watercolor Workshop is a course designed for beginner and intermediate artists wishing to explore and improve watercolor painting techniques. This course starts with the basics and progresses gradually to more complex subjects and concepts. The 19 modules are logically sequenced so that each module builds upon concepts learned in previous modules. A variety of concepts, subjects, application techniques, and forms of watercolor are explored providing the learner with a complete exposure to this popular art-making medium.</p><p><strong style=\"\">Structure:</strong></p><p>The course begins with an exposure to materials and tools that are used for painting with watercolor including brushes, surfaces, and various forms of watercolor paint. (Modules 1-2) Various application techniques, including wet on dry, wet on wet, dry on wet, using salt, painting with a sponge, and more are discussed. (Module 3) Color theory and color mixing are explored before moving on to aesthetic compositional strategies. (Modules 4-6)</p><p>Popular subjects are explored including still life and landscape painting. A woodland scene is demonstrated while teaching strategies for creating light and shadow. (Modules 7-8) Each step of each process is documented and learners can follow along and create their own paintings using the provided photo references. Cityscape painting follows while emphasizing the importance of simplifying complexities in a scene when painting with watercolor. (Modules 9-10) </p><p>Concepts such as image transfer, mixing skin tones, and developing contrasting backgrounds are all included in the modules focused on portrait painting. (Modules 11-13) </p><p>Various forms are watercolor are also explored. Pan or cake watercolors are used at various points along with tube paints. Watercolor pencil techniques are demonstrated including application and activation strategies. (Modules 14-15) </p><p>The course also explores mixing watercolor with related art-making media such as pastel, pastel pencil, and pen and ink. (Modules 16-17) </p><p>Gouache or opaque watercolor painting techniques are also covered. (Module 18)</p><p>18 ebooks are included with the course. Each ebook breaks each step down into step by step photographs and reinforces the concepts taught in each video.</p>", 
    "end_date": null, 
    "title": "The Watercolor Workshop", 
    "price": "35.00", 
    "instructors": "Matthew Fussell", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/504716_7ad7_3.jpg", 
    "course_url": "https://www.udemy.com/the-watercolor-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-17T22:30:56Z"
}