{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "\"The Pen and Ink Experience\" is a comprehensive drawing course designed to guide absolute beginners to a level of producing professional quality pen and ink drawings through concise and “easy to digest” modules that include HD videos and Ebooks. Designed for beginners, this course lays the foundation required for success with pen and ink drawing.\"The Pen and Ink Experience\" is designed to provide beginner and intermediate artists with a complete learning experience on drawing with pen and ink through \"easy to digest\" modules consisting of video demonstrations and accompanying ebooks. <p><br></p><p><strong>What is explored:</strong></p><p><strong>Module 1</strong> - Introduction, materials, surfaces, and tools. Dip pens, technical pens, and painting with brushes.</p><p><strong>Module 2</strong> - Line and value. Various techniques for adding value and shading with a pen.</p><p><strong>Module 3</strong> - Drawing textures. How to create the illusion of simulated textures through various mark-making techniques.</p><p><strong>Module 4 &amp; 5</strong> - Landscape drawing. How to use various techniques to create the illusion of depth.</p><p><strong>Module 6 &amp; 7</strong> - Portrait drawing. How to use cross contour lines and shading techniques to communicate the form of your subject.</p><p><strong>Module 8 &amp; 9</strong> - Ink wash. How to apply multiple layered \"washes\" of ink to develop value and the illusion of form.</p><p><strong>Module 10 &amp; 11</strong> - Mixing methods. How to combine ink wash with pen applications to create a looser, more expressive image.</p><p><strong>Module 12</strong> - Conclusion. A review of the concepts learned and a plan for moving forward.<br></p>", 
    "end_date": null, 
    "title": "The Pen and Ink Experience", 
    "price": "20.00", 
    "instructors": "Matthew Fussell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743818_c39a_2.jpg", 
    "course_url": "https://www.udemy.com/the-pen-and-ink-experience/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T17:29:59Z"
}