{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t                <strong>~ Updated: December 4, 2015 ~</strong></p>  <p>  \t<strong>Covers:</strong>  </p>  <p>  \t    This course is about taking unused built up acrylic palette paint and turning it into stunning sculptures on canvas in a totally easy way, and also shows how to make a new paintskin if you haven't built up palette layers yet.  </p>  <p>  \t<strong>What people are saying...</strong>  </p>  <ol>  \t<li>\"Its amazing! If i was actually in front of it, i'd have to put my hands in my pockets so i wouldn't touch it from curiousity of trying to figure out how you did that.\" ~ Bobbie SunyNite Brown</li>  \t<li>\"Awesome, Ruth!!! Congrats The class is well worth the money!\" ~ Esther Lee</li>  \t<li>\"Ruth, I signed up last night, will be back to it over the weekend. This is so very intriguing! What a genius technique! I like your content and your presentation.\" ~ Maria Freyenbacher</li>  </ol>  <p>  \t<strong>How taught: <br> \t</strong>Using video demonstrations, downloads, formulas, paint chart &amp; coupon deals, handouts, easy quizzes, Recaps, and an ending ACTION STEP  </p>  <p>  \t<strong>Benefits: <br> \t</strong><strong></strong>*Take something discarded &amp; turn it into a show-stunning piece  \t                           <br>*Learn new way to save paint from being wasted <br> \t                           *Be brilliant &amp; use up layers of paintskins or learn how to make new ones from scratch <br> \t                           *Accomplish forming the paintskins into amazing pipe corals of beauty <br> \t                           *Know what glue is archival for paintings <br> \t                           *Imagine &amp; form interesting pipe coral shapes <br> \t                           *Attain knowledge of how to easily make an appealing abstract background with texture <br> \t                           *Dazzle others with your use of mesmerizing colors <br> \t                           *Discover an easy secret to highlighting the tops artistically like a pro <br> \t                           *Attractively arrange the pipe corals on canvas <br> \t                           *Get inside knowledge on how to varnish a 3D painting easy &amp; reduce brush lines <br> \t                           *Find inspiration easily with this one tool to prevent Artist's Block  \t                           <br>*Know the supplies to get &amp; download easy formulas to follow  </p>  <p>  \t<strong>Why enroll:</strong><strong> <br> \t                           *</strong>Paint something mesmerizing in a new way while saving unused dried paint!  </p>  <p>  \t<strong>Ideal Student/Target Audience: <br> \t</strong>*Acrylic painters that want to add dimension to their paintings  \t                          <br>*Bargain hunters who like to turn nothing into something <br> \t                          *Those who want to paint something distinguished <br> \t                          *Artists looking for something innovative, late-breaking, &amp; fun to do  \t                          <br>*Accomplish something revolutionary, unusual, &amp; upscale <br> \t                          *Get in on the new &amp; express your creativity in a whole mind-blowing way <br> \t                          *Advance your skills &amp; push the boundaries of acrylic painting possibilities <br> \t                          *For those who want to push past their comfort zone <br> \t                          *Not for those who don't like to plan or need immediate results &amp; willing to give up glamour for the usual <br> \t                          *Not for those who want to paint flat &amp; without texture  </p>", 
    "end_date": null, 
    "title": "Turn Unused Palette Paint into Abstract Sculptures", 
    "price": "50.00", 
    "instructors": "Ruth Collis", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/379888_14e1_2.jpg", 
    "course_url": "https://www.udemy.com/make-a-3d-pipe-coral-acrylic-painting/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T11:44:32Z"
}