{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  This complete charcoal drawing course provides you with the 12 powerful but easy to learn techniques you need to create realistic drawings in charcoal, taking you from your first tentative fine lines in charcoal right through to creating your own fully rendered confident self portrait.  </p>  <p>  \t    The course starts with the basic fundamental techniques and builds step-by-step towards your final portrait project. Once you have mastered the quick and easy techniques in this course you will be able to combine them to create a wide range of textures and draw all kinds of things.  </p>  <p>  \t                 This course contains a complete downloadable copy of Cindy Widers &#039;12 Charcoal Techniques&#039; book which contains the reference images used in the exercises. Step-by-step videos support the content of the book. Alternatively you can read and download the relevant individual parts of the book then watch the step by step videos as you progress through the course.  </p>  <p>  \t       To complete the course you will need some basic charcoal drawing supplies which are described in the course materials and are readily available from art shops or from online art stores. A printer is also useful to print the course pdfs containing step-by-step instructions and reference photos from which you will be measuring.  </p>  <p>  \t       The course is conveniently divided into five separate weeks of study. Students generally take around 20 to 25 hours to complete the course so you can complete it with approximately 5 hours study per week (of course you can go faster or slower if you want).  </p>  <p>  \t <strong style=\"\">Course Outline:</strong>  </p>  <p>  \t       Week One  </p>  <ul style=\"\">  \t<li>Introduction to charcoal</li>  \t<li>Create a pre-instruction drawing</li>  \t<li>Practice the Twelve Charcoal Techniques </li>  </ul>  <p>  \t       Week Two  </p>  <ul style=\"\">  \t<li>Learn to draw three different hairstyles. These are a great way to try combining all sorts of basic charcoal techniques (useful for more than just hair!)</li>  </ul>  <p>  \t       Week Three  </p>  <ul style=\"\">  \t<li>Draw a variety of objects that will challenge you further to further refine your charcoal skills.</li>  </ul>  <p>  \t       Weeks Four and Five - Begin your portrait project:  </p>  <ul style=\"\">  \t<li>Take a photograph of yourself and use a step-by-step process to draw your own self-portrait. Alternatively you can draw the portrait image provided. </li>  </ul>  <p>  \t  Expand your creativity beyond the pencil and experience the joy, freedom and expressiveness of Charcoal drawing.  </p>  <p>  \t                 If you want to experience the joy, freedom and unlimited creative drawing possibilities that charcoal offers then 12 Charcoal Drawing Techniques will open up a whole new world of artistic expression for you.  </p>", 
    "end_date": null, 
    "title": "Twelve Charcoal Drawing Techniques", 
    "price": "20.00", 
    "instructors": "Cindy Wider", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/212304_ef2c_4.jpg", 
    "course_url": "https://www.udemy.com/twelve-charcoal-drawing-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-07T13:47:28Z"
}