{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>* How often do you mix muddy colors without intending to?</strong></p><p><strong>* How often can you match what you are seeing with confidence?</strong></p><p><strong>* Do you really understand your colors and what you are capable of having them do?</strong></p><p><strong>In this self-paced course you will learn color theory (it's pretty simple), why colors work the way they do, and how your colors can play with the other colors on your palette (and stay best friends).</strong></p><p><strong><br></strong></p><p><strong><span style=\"color: rgb(151, 72, 6);\">Who Should Take This Course</span></strong><br></p><p><strong>* If you are a beginner, this course will put you MILES ahead of others because at the end you will have an excellent understanding of how color works, how to match colors, and even more funda</strong><strong>mental, where to start with colors!</strong></p><p><strong>* And if you are a working artist you also will get a tremendous value from taking this course because it will clear up misconceptions about color, teach you how colors work and therefore <strong>completely speed up your mixing process.</strong></strong></p><p><strong>* If you have been looking for that 'perfect' primary red, primary blue, and primary yellow, this will absolutely demystify this dilemma.</strong></p><p><strong>* If you mixed that perfect color but can't remember how you did it, this class will teach you which 3 questions to ask yourself so that you can not only mix 'that' color, but match it, over and over again.</strong></p><p><strong>* If you want to introduce other colors to your palette but don't know if it will be a good fit, this class will teach you how to analyze a tube of paint and what all that information is telling you.</strong></p><p><strong>* Do you have a drawer full of colors but none are quite right? By the end of this course you will know which ones are redundant, which ones might be really helpful, and which ones you might want to use more of.</strong></p><p><strong><br></strong></p><p><strong><span style=\"color: rgb(149, 55, 52);\">WHAT YOU WILL LEARN:</span></strong></p><p><strong>* Whether you work in Oil, Acrylic, or Watercolor, you will learn to break colors down and then rebuild them so that you will understand each color on your palette.</strong></p><p><strong>* You will learn how well your colors will play with the other colors on your palette, and how to choose colors you might want to add or take away from your palette.</strong></p><p><strong>* You will be able to choose the paints you need to get the broadest range. In other words, you will learn about the colors you choose and then have total control over your palette.</strong></p><p><strong><br></strong></p><p><strong><span style=\"color: rgb(151, 72, 6);\">WHAT YOU WILL GET:</span></strong></p><p><strong><span style=\"color: rgb(151, 72, 6);\"><span style=\"color: #000000;\">* </span></span></strong><strong>In addition to all the class lectures and videos, you will have my email address so that if you have ANY questions about what you are learning I will answer them very quickly.</strong></p><p><strong>* Plus, if it's something that will take more than just a simple answer by email we can arrange to speak by phone or Skype. I want you to succeed.</strong></p><p><strong><span style=\"color: rgb(149, 55, 52);\">AT THE END OF THIS COURSE YOU WILL COME AWAY WITH:</span></strong></p><ul><li><strong><span style=\"color: rgb(149, 55, 52);\">A Thorough Understanding of Color</span></strong></li><li><strong><span style=\"color: rgb(149, 55, 52);\">How to Choose Your Colors</span></strong></li><li><strong><span style=\"color: rgb(149, 55, 52);\">Which Way a Color Leans and How That Affects Color Mixes</span></strong></li><li><strong><span style=\"color: rgb(149, 55, 52);\">What a Color Can and Can't Do</span></strong></li><li><strong><span style=\"color: rgb(149, 55, 52);\">How to Match ANY Color Easily and Efficiently</span></strong></li><li><strong><span style=\"color: rgb(149, 55, 52);\">How To Read a Paint Tube and Why This is Important</span></strong></li><li><strong><span style=\"color: rgb(149, 55, 52);\">How to Better Use a Color Wheel</span></strong></li><li><strong><span style=\"color: rgb(149, 55, 52);\">Complete Control Over Your Painting Palette</span></strong></li></ul>", 
    "end_date": null, 
    "title": "Understanding Color & How to Mix It", 
    "price": "35.00", 
    "instructors": "Elizabeth Tucker", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741656_715e.jpg", 
    "course_url": "https://www.udemy.com/understanding-color-how-to-mix-it/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T00:52:45Z"
}