{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t                      The course is for anyone who wants to learn to paint in watercolors but who does not know where to begin. At the start of the course I will show you what materials you will need, and how to set up a palette with colors. I keep these materials to a bare minimum so that it won&#039;t cost you the earth!   There is then an exercise in mixing paint with water that will teach you how to get dark and light shades of the same color. Next you will learn how to lay down a flat wash and a wet-in-wet wash of color. These are things that you will do in all your paintings in the future and so are important to learn right from the start.  At this stage we put all this together into an abstract painting.  </p>  <p style=\"\">  \t                The course continues with an exploration of the different marks that our brushes can make, and this will show you how to get great freedom and life into your paintings. We finish up with a landscape painting, shown step-by-step, which uses all these techniques put together.  </p>  <p style=\"\">  \t    Enroll on this course now and within an hour or two you will be familiar with all the basic techniques of watercolor painting, and you will have confidence to start painting for yourself. And there is no risk involved - there is a 30 day money back guarantee if you find it is not what you are looking for!<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Watercolor painting for the complete beginner - First steps", 
    "price": "20.00", 
    "instructors": "Andy Walker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294462_bd65_3.jpg", 
    "course_url": "https://www.udemy.com/watercolor-painting-for-the-complete-beginner-first-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T08:19:32Z"
}