{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Are your paintings tight and lifeless? Do they take forever to finish? Do you want to loosen up and become much freer in your style? Do you want to grow in confidence as a painter?Then this course is for you!</p><p>In this <strong style=\"\">unique 7 part course</strong> I&#039;ll teach you how to paint in a fast, loose and free style. Each part of the course is based on the style and methods of a particular master of watercolor impressionism. From these great artists you will learn how to paint in a way that is free, fast and full of expression and passion. The course will be most suitable for those who already paint in watercolors but is really for anyone who just wants to loosen up. The lessons are not difficult, so even beginners will be able to follow along. </p><ul style=\"\"><li>The 7 parts of the course look at the work of </li><li>Frank Webb, </li><li>Edward Seago, </li><li>John Yardley, </li><li>Claude Croney, </li><li>Jack Merriott, </li><li>Tony Couch, and </li><li>Edward Wesson.</li></ul><p>I suggest you take the course one step at a time, and so build up your skills. With each lecture there is an <strong style=\"\">audio introduction</strong> which will help you to get started. Then download the <strong style=\"\">pdf pages</strong> that show you step by step what to do, and also give you more ideas and information. Finally watch the <strong style=\"\">video</strong> of me painting the project, and then have a go yourself. </p><p>I suggest you take a project a week, so that once you have painted the set piece you can spend some time practicing the techniques before moving on to the next project. </p>", 
    "end_date": null, 
    "title": "Watercolor Fast and Loose! Express yourself in your painting", 
    "price": "35.00", 
    "instructors": "Andy Walker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384242_8242.jpg", 
    "course_url": "https://www.udemy.com/watercolor-fast-and-loose-express-yourself-in-your-painting/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T18:46:48Z"
}