{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This\ncourse is about atmosphere in which successful paintings are come to life.\nArtist and illustrator, Olga Peregood, invites you to her quiet peaceful home\nstudio where she was painting and learning trough the years.</p><p>\"More\nme as an artist and my artist reactions on what's happening on the paper. I\nwant to show you my mood and inspiration while in process. Because this is so\nimportant, no one teacher can tell you about!\"</p><p>There are\nmany courses, DVDs and masters. There is a lot of information about techniques,\nmaterials and there is no information about creating process. This is why Olga\nmade this course and <strong>shared</strong> this\ninformation with you.</p><p><strong>Eyes </strong>-\nwindows of a soul. Real impression of eyes. State of mind when we'll just let\ncolors flow freely and mix together.</p><p><strong>Fur </strong>- not\njust fluffy fur. We want the viewer to want to touch it!</p><p><strong>Details, final touches</strong> - how to work on second\nlayer. How with less details catch the form and subject! Where to add little\ntouches for finished result, moving gradually and how to use your photograph.</p><p><strong>Open\npotential and possibilities </strong>of those techniques for other paintings, for other\nsubjects and Olga's artist tips how to work with this lesson for more <strong>effective\ngrow</strong> of your art.</p><p>Enjoy\nwatching cutest kittens ever &amp; always remember with this knowledge you can\npaint absolutely what ever comes to your mind!<br></p>", 
    "end_date": null, 
    "title": "Watercolor Atmosphere: Something Cute For You", 
    "price": "20.00", 
    "instructors": "Olga Peregood", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736168_8c10_2.jpg", 
    "course_url": "https://www.udemy.com/something-cute-4u/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-20T23:41:57Z"
}