{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Ever wonder what it takes to get started in the world of watercolor painting? This course includes everything a young or beginning artist needs to know about starting to explore the wonderful world of painting with watercolors.</p><p style=\"\">Taught by award-winning artist Cynthia Massey Parsons, this course is an entire art class in a single course. Beginning with the foundational basics, Cynthia steps you through everything from understanding the color wheel, to how to identify and use different shaped brushes (as well as how to clean and store them), to what sort of materials you should select, given the type of painting you want to do! Much more than merely showing you how to paint, this course helps you understand why you should use one technique over another, when and where you should use said technique, and helps you to understand how these techniques work!</p><p style=\"\">Truly an entire art class in one course, this course covers: color families, color intensity, color purity, color complements, watercolor materials, containers, supplies, and different watercolor brushes (such as round, flat, and chisel), transparent paint, opaque gauche, watercolor papers and paper textures, pencils, erasers, specific watercolor application techniques, washes, glazes, sponge painting, and much more!</p><p style=\"\">So, if you are just beginning to paint, or have painted for years without any classical or traditional training, this course is for you. We&#039;ll teach you not only HOW but also WHEN and WHY you do the things you do when painting with watercolors.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Watercolor Painting for Children with Cynthia Parsons", 
    "price": "20.00", 
    "instructors": "Brainy Pixel Productions", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/459271_4fe2_5.jpg", 
    "course_url": "https://www.udemy.com/watercolor-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-26T01:17:25Z"
}