{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Updated and refreshed with more fun techniques to add a touch of drama to your painting.</p><p><strong></strong></p>\n\n<p>  \t<em><strong>Do you want to take your watercolour painting to a higher level ?</strong>  </em></p>\n\n<p>  \t<em><strong>Do you feel that you are a bit stuck ?</strong>  </em></p>\n\n<p>  \t<em><strong>Do you want to give your paintings that WOW factor ?</strong>  </em></p>\n\n<p>  \t<strong><em>Then this is the course for you.</em></strong>  </p>\n\n<p>This course is for anyone interested in starting to paint with <strong>watercolours</strong> and also for those who are already painting with them but would like to lift their work to the next level.</p>\n\n<p>I'll demonstrate every step of the way, from just using your brushes 'effectively', through to using other tools and substances. This course is a great place to start on your watercolour painting journey and if you are a complete beginner it is a great companion course to my <strong>'Start WATERCOLOUR PAINTING EFFORTLESSLY</strong>, play &amp; be creative'</p>\n\n<p>  \t                      This evolving course  is made up of 'easy to follow' videos, demonstrating different effects which you can use. Some techniques use tools other than brushes and some use substances easily available. <strong>More lectures will be added, so keep in touch.</strong>  </p>\n\n<p>  \t                    Look over my shoulder as I talk about each one and <strong>SHOW</strong> you how to do them.  </p>\n\n<ul>  \t<li>Full, free lifetime access</li>  \t<li>All future extra lectures and upgrades are always included for <strong>FREE</strong><strong></strong></li>  \t<li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your enjoyment!</li>  </ul>", 
    "end_date": null, 
    "title": "Watercolour Special Effects & pro tips for more painting fun", 
    "price": "20.00", 
    "instructors": "Nicola A Blakemore", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/80772_f27b_8.jpg", 
    "course_url": "https://www.udemy.com/watercolour-painting-techniques-a-must-have-for-painters/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-19T16:07:55Z"
}