{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>\t Do you want to learn woodworking and be able to make your own furniture and cabinets? The Woodworking Course is composed of individual lectures on hand tools, power tools, machinery, joinery as well as finishing and veneering. The Online Woodworking Class is self-paced and can be completed at your speed. Lectures can be completed individually or in sequence. Each lecture ranges from 5 to 20 minutes in length for a combined total of over 5 hours of instruction. <strong>Updated videos </strong><strong>(2016) with new graphics.</strong> Interactive quiz at the end of each section. Learn woodworking concepts and basics with this course. The extensive knowledge gained is an excellent basis for further woodworking education. Now learn to make your own wood projects and furniture! Use your new knowledge to make furniture you can sell. A WoodSkills certificate is issued upon completion of the course.</p><p><strong>CJSKeller</strong> writes: \"<em>Excellent course!  I'm an amateur woodworker who has used many of the tools covered in this course. I never really knew what they were or understood their full application. Thanks to this course I now feel more confident with my woodworking skills</em>\"</p><p><strong>Al Mangini </strong>writes: \"<em>Excellent course. I'm new to woodworking and found the course to be very valuable and informative. I would recommend this course\"</em></p><p><strong>Elizabeth Morales-Valido</strong> writes: <em>\"G</em><em>reat woodworking course. Very thorough and informative in the teaching and materials\"</em></p>", 
    "end_date": null, 
    "title": "Woodworking Course: Have a Pro speed your learning!", 
    "price": "30.00", 
    "instructors": "Norman Pirollo", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27011_5677_4.jpg", 
    "course_url": "https://www.udemy.com/woodworkingcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Arts & Crafts"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-17T20:58:39Z"
}