{"selfpaced": false, "topic_name": ["Finance"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    infrafinance-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    According\nto the OECD, the total global infrastructure investment requirement by 2030 for\ntransport, electricity generation, transmission &amp; distribution, and water &amp; telecommunications comes to 71 trillion dollars. This figure represents about 3.5% of the\nannual World GDP from 2007 to 2030.The\nEuropean Commission estimated that by 2020, Europe will need between 1.5 - 2 trillion Euros in infrastructure investments. Between 2011 and\n2020 about 500 billion Euros will be required for the implementation of the\nTrans-European Transport Network (TEN-T) program, 400 billion Euros for Energy\ndistribution networks and smart grids, 200 billion Euros on Energy transmission\nnetworks and storage, and 500 billion Euros for the upgrade and construction of new\npower plants. An additional 38 - 58 billion Euros and 181 - 268 billion Euros capital investment\nwill be needed to achieve targets set by the European Commission for broadband\ndiffusion.Traditionally investments in infrastructure were financed using public sources. However, severe budget constraints and inefficient management of infrastructure by public entities have led to an increased involvement of private investors in the business. The course focuses on how private investors approach infrastructure projects from the standpoint of equity, debt, and hybrid instruments. \n\nThe course concentrates on the practical aspects of project finance, the most frequently used financial technique for infrastructure investments. The repeated use of real life examples and case studies allows students to link the theoretical\nbackground to actual business practice.\n\nAt the end of the course, students will be in the position to analyze a\ncomplex transaction, to identify key elements of the deal and to suggest proper\nsolutions for deal structuring from the perspective of a financial advisor.\n\n                                            Syllabus\n                        Week 1: Introduction to project and infrastructure finance; vocabulary of project finance.Week 2: The syndication process.Week 3: Risk analysis and risk allocation from the perspective of private investors.Week 4: Capital budgeting for infrastructure investments.Week 5: How to assess financial sustainability of an infrastructure project from the investor's standpoint.Week 6: Recent evolutions in the infrastructure finance market.\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Financing and Investing in Infrastructure", "price": 0, "instructors": "Stefano Gatti", "institution_name": ["Università Bocconi"], "commitment": "5-6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/course/infrafinance", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-06-09T00:00:00Z"}