{"selfpaced": false, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    IMPORTANT UPDATE:  This course is being discontinued after the current session June 1 - mid September is over. The content has been translated into the first two courses of a new specialization we are launching titled \"Introduction to Finance: Valuation and Investing\" offered by Professors Gautam Kaul and Qin Lei. The specialization has been motivated by two specific kinds of feedback consistently provided by learners over the past three years who have enrolled in this MOOC: to make the content more modular, while also providing advanced frameworks and applications. There are two introductory courses based on this MOOC, and we have added two more advanced and applied courses. All learners interested in the Introduction to Finance MOOC should enroll in the specialization instead;  the first course launches on September 15, 2015.  For more information please visit the Specialization site. If you are enrolled in the next session of this MOOC, Coursera will batch-enroll all leaners in the first course of the specialization. Anyone can choose to unenroll at any time of course.About the original MOOC:This course is primarily devoted to the fundamental principles of valuation. We will learn and apply the concepts of time value of money and risk to understand the major determinants of value creation. We will use both theory and real world examples to demonstrate how to value any asset.Subtitles for all video lectures available in: Chinese (provided by Yeeyan), English, Portuguese (Lemann Foundation), and Ukrainian (Pinchuk Foundation)\n\n                                            Syllabus\n                        See the detailed Syllabus. Please note that based on feedback we have received following our first offering of the course, we have decided to extend the duration to fifteen weeks for this, and all subsequent offerings.\n                                    ", "end_date": "2016-01-18T00:00:00Z", "title": "Introduction to Finance", "price": 0, "instructors": "Gautam Kaul", "institution_name": ["University of Michigan"], "commitment": "6-8 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/course/introfinance", "duration": "15 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-10-05T00:00:00Z"}