{"selfpaced": false, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    In this course you will simulate the time evolution of prices of financial assets, use the Black-Scholes model to price European or Asian options and compute the Value-at-Risk of a portfolio. The approach is hands-on with a strong emphasis on practical simulations that you will program, run and explore in your own computer.\r\nCertification\r\nYou will receive a certificate of participation after having completed at least 75% of the course learning activities (videos, quizzes and homework).\r\nLearning objectives\r\nAt the end of this course you will know how to answer the following questions:\r\n\r\nWhy are random numbers needed in quantitative finance? And, if they are random, how can they be used to give precise, accurate answers to quantitative financial problems?\r\nWhat is the Black-Scholes model?\r\nWhat is geometric brownian motion and how can it be used to simulate the evolution of asset prices in financial markets?\r\nHow are Monte Carlo methods used to determine the right price of a derivative product, such as a European call option?\r\nWhat is the theory of copulas and how can it be used to model general dependencies among financial assets?\r\nHow is financial risk modeled, characterized and quantified?\r\n\r\nWorkload\r\nYou will need between 5 and 8 hours of work per week during a total of 12 weeks to complete all the learning activities, including the homework.\r\nPrior knowledge\r\nThe course is geared to students not only in economics and finance, but also in mathematics, computer science, engineering, physics and the natural sciences.\r\nNo knowledge of finance is required.\r\nBasic knowledge of Calculus (integration and differentiation, Taylor series), Linear Algebra (matrices, determinants, eigenvalues and eigenvectors) and Probability (random variables, probability density and cumulative distribution functions) at an introductory undergraduate level is strongly recommended.\r\nProgramming knowledge is recommended. We will be designing simulations that can be executed in either GNU Octave or in Matlab. The programs will be short, intuitive, fully documented and easy to follow. Yet they will be powerful tools under your control, and will allow you to explore, experiment and learn at your own initiative.\n\n                                            Syllabus\n                        The course is structured in 9 chapters\r\nChapter 1: Introduction [2014/01/20 - 2014/01/29]Chapter 2: Understanding random numbers [2014/01/30 - 2014/02/05]Chapter 3: Generating random numbers [2014/02/06 - 2014/02/12]Chapter 4: Brownian motion [2014/02/13 - 2014/02/26]Chapter 5: Ordinary differential equations [2014/02/27 - 2014/03/05]Chapter 6: Stochastic differential equations [2014/03/06 - 2014/03/12]Chapter 7: Pricing of simple derivative products [2014/03/13 - 2014/03/26]Chapter 8: Pricing of more complex derivative products [2014/03/27 - 2014/04/02]Chapter 9: Modeling and quantifying financial risk [2014/04/03 - 2014/04/16]\r\nChapters are divided into units. Each unit consists of a video followed by a quiz. At the end of each chapter you will solve and turn in some homework exercises. In these exercises you will explore additional material on your own and then respond to questions in multiple choice format.\r\nSome of the explanations in the videos and the exercises make reference to short programs that you can download and execute in your own computer. You are encouraged to experiment with these programs (modify the values of parameters, complete or rewrite the code to alter the model or to implement related functionality) and run your own simulations. The code provided can be executed in either GNU Octave or MATLAB.\n                                    ", "end_date": "2014-04-14T00:00:00Z", "title": "Monte Carlo Methods in Finance", "price": 0, "instructors": "Alberto Suárez", "institution_name": [], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://iversity.org/courses/monte-carlo-methods-in-finance", "duration": "12 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2014-01-20T00:00:00Z"}