{"selfpaced": false, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    In this course, participants will learn the foundations of accounting principles and financial analysis, develop an understanding of the links between these, and the measurement of value creation at the firm level. This is the first course in a four-course Specialization on the Essentials of Corporate Financial Analysis and Decision-Making, created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).\n\n                                            Syllabus\n                        An Introduction to Accounting Principles: The Language of Capital MarketsThis week we will define and explain the key financial statements produced by a company and reported to its shareholders. We will discuss the different core elements within those statements following basic accounting principles with the discussion framed in reference to excerpts from the actual financial statements produced by the US-listed food company Kellogg's.An Intuition-based Introduction to Financial AnalysisUnderstanding the importance and the accounting principles underpinning the key financial statements of a company, we now turn our attention to synthesizing and condensing the financial statement information for the purpose of financial analysis. Specifically, we demonstrate how financial analysts use ratio analysis to measure relative profitability, leverage, efficiency and the liquidity of a company. Again, we utilise information from the financial statements of Kellogg's and its competitor Kraft to demonstrate these financial analysis techniques.The Links Between Accounting Principles and Financial Decision-makingHaving established initial basic financial analyst's toolset in the first two weeks of this course, some caution is warranted as we turn our attention to some of the pitfalls associated with uncritical use of financial statements by analysts. Specifically, we highlight how the use of historical cost and accrual-based accounting might lead to sub-optimal corporate financial decision-making. We then discuss how the agency relationship between management and the owners of a company may also lead to poor corporate decision-making. We conclude with a cautionary tale of misleading accounting practices and the regulator's response to these cases.Value Measurement via Discounted Cash Flow AnalysisHaving identified the key elements of a company's financial statements, and the way in which information from these statements can be utilized in financial analysis, we shift our focus this week to discounted cash flow (DCF) analysis. Sound financial decision-making by CFOs and investors, requires an assessment of future (uncertain) financial outcomes. DCF analysis allows the financial analyst to extrapolate the financial statement information in a forward-looking manner. The DCF technique provides an objective way in which we can evaluate financial decisions while overcoming many of the shortcomings associated with standard ratio analysis.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "The Language and Tools of Financial Analysis", "price": 0, "instructors": "Paul Kofman and Sean Pinder", "institution_name": ["University of Melbourne"], "commitment": "4-6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/financial-analysis", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}