{"selfpaced": true, "topic_name": ["Finance"], "description": "\n\n                    \n                    \n                    Imagine that you are a bank and a main part of your daily business is to lend money. Unfortunately, lending money is a risky business - there is no 100% guarantee that you will get all your money back. If the borrower defaults, you will face losses in your portfolio. Or, in a bit less extreme scenario, if the credit quality of your counterparty deteriorates according to some rating system, the loan will become more risky. These are typical situations in which credit risk manifests itself.\n\nAccording to the Basel Accord, a global regulation framework for financial institutions, credit risk is one of the three fundamental risks a bank or any other regulated financial institution has to face when operating in the markets (the two other risks being market risk and operational risk). As the 2008 financial crisis has shown us, a correct understanding of credit risk and the ability to manage it are fundamental in today’s world.\n\nThis course offers you an introduction to credit risk modelling and hedging. We will approach credit risk from the point of view of banks, but most of the tools and models we will overview can be beneficial at the corporate level as well.\n\nAt the end of the course, you will be able to understand and correctly use the basic tools of credit risk management, both from a theoretical and, most of all, a practical point of view. This will be a quite unconventional course. For each methodology, we will analyse its strengths as well as its weaknesses. We will do this in a rigorous way, but also with fun: there is no need to be boring.\n\nThanks to the wonderful feedback of last year’s students, the course has been further improved.\nFollow us on Twitter @CRMooc for updates and hints about the course.\n\nFAQs\n\nWhat is the estimated effort for course?The total effort is 48 hours. You can decide for yourself when you will work on the course.\n\nHow much does it cost to take the course?\n\nNothing! The course is free.\n\nWill the text of the lectures be available?\n\nYes. All of our lectures will have transcripts synced to the videos.\n\nDo I need to watch the lectures live?\n\nNo. You can watch the lectures at your leisure.\n\nIs this course related to campus courses of Delft University of Technology?\n\nYes, this course can be seen as an evolution of the WI3421TU Risk Management course, a compulsory course of the Minor Finance at TU Delft.\n\n                                    ", "end_date": "2015-06-02T00:00:00Z", "title": "TW3421x: An Introduction to Credit Risk Management", "price": 0, "instructors": "Pasquale Cirillo", "institution_name": ["Delft University of Technology"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/introduction-credit-risk-management-delftx-tw3421x-1", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-04-14T00:00:00Z"}