{
    "selfpaced": true, 
    "topic_name": [
        "Internet of Things"
    ], 
    "description": "\n\n                    \n                    \n                    Wir befinden uns am Beginn der vierten industriellen Revolution – Industrie 4.0. Das Internet der Dinge zieht in die Fabrik und wandelt unsere Art zu wirtschaften und zu arbeiten grundlegend. Produkte steuern den Produktionsprozess aktiv mit, Produktionsprozesse und Logistik können in Echtzeit optimiert werden. LKWs wiegen beispielsweise ihre Transportlast und entscheiden allein, wann sie nachladen sollten, um Lieferengpässe zu vermeiden. Auch die Anforderungen an die Beschäftigten ändern sich: Sie nehmen stärker koordinierende Aufgaben wahr und interagieren mit intelligenten Assistenzsystemen und Robotern.Und der Wandel macht nicht an den Fabrikzäunen halt. Die Digitalisierung verwandelt praktisch jeden Gegenstand, jedes Gerät und jede Maschine in einen Internetknotenpunkt, der mit anderen kommuniziert. Heute schon gibt es davon 15 Milliarden. Verlassen solche smarten Produkte die Fabriken, werden sie zur Grundlage neuer, datengetriebener Geschäftsmodelle. Industrie 4.0 ist aber nicht nur ein industriepolitisches Thema, sondern adressiert auch ökologische und soziale Herausforderungen wie Ressourceneffizienz, Umweltschutz oder Urbanisierung. Industrie 4.0 ist eine große Chance. Viele Unternehmen setzen bereits Industrie 4.0-Strategien um und heben die Optimierungspotenziale für Ihre Produktionsprozesse. Was heißt Industrie 4.0 für die Beschäftigten, für die Arbeit von morgen? Wie gut sind Unternehmen auf die digitale Revolution vorbereitet? Welche neuen Sicherheitslücken ergeben sich in der vernetzten Produktion und welche Empfehlungen geben Experten, um sich zu schützen?\r\nIn unserem 5-wöchigen Onlinekurs, einer Kooperation der Deutschen Akademie der Technikwissenschaften (acatech) und des Hasso-Plattner-Instituts, liefern herausragende Vertreter aus Wirtschaft und Wissenschaft die Antworten und beleuchten alle Aspekte der vierten industriellen Revolution.\r\nBitte beachten Sie: Dies ist ein externer Kurs. Um daran teilzunehmen, müssen Sie einen extra Account auf unserer Schwesterplattform mooc.house anlegen. Dafür benötigt werden lediglich ein Name und eine E-Mailadresse.\n\n                                    ", 
    "end_date": "2016-05-30T00:00:00Z", 
    "title": "Hands on Industrie 4.0", 
    "price": 0, 
    "instructors": "Christoph Meinel", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://open.hpi.de/courses/industrie40-2016", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "openHPI"
    ], 
    "start_date": "2016-04-25T00:00:00Z"
}