{
    "selfpaced": false, 
    "topic_name": [
        "Internet of Things"
    ], 
    "description": "\n\n                    \n                    \n                    Estamos rodeados de programación. Cotidianamente la utilizamos y nos facilita ciertas actividades como señalizaciones o simplemente recordatorios; por ejemplo, la alarma para que te levantes, el calentador de agua, el indicador de gasolina en el automóvil, el cajero automático, el dispositivo móvil, las puertas automáticas, etcétera. Todas estas acciones están basadas en un pequeño microcontrolador, que le indica al dispositivo la tarea a realizar; pero estas indicaciones están dictadas por un programador. Una persona como tú o como yo que, con algunos conocimientos de programación, podrá dictar pequeñas indicaciones y lograr que un dispositivo haga cosas básicas. \n\nHacer que algunos mecanismos funcionen de forma automática se hace cada vez más común, así entrar a una habitación y que se ilumine sin accionar un interruptor o que salga agua de una llave sin accionar una válvula lo vemos de forma cotidiana, pero la acciones que podemos realizar en un cajero automático o las que podemos realizar en un automóvil, son ligeramente más sofisticadas. En caso de querer que de forma automática pudiéramos conocer las existencias de consumibles en casa como la leche, la fruta y las verduras, y que dicha existencia la quisiéramos registrar en nuestro teléfono celular, nosotros tendríamos que hacer la aplicación. Pues bien, ésta o alguna otra aplicación que tengas en mente, puedes desarrollarla como prototipo si cuentas con la paciencia que se requiere para poder programarlo. En este curso desarrollarás dos modelos prácticos de uso cotidiano, pero lo importante es que a partir de la forma en cómo los realizaste, podrás hacer el que siempre te ha llamado la atención y que no existe.\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Sistemas embebidos: Aplicaciones con Arduino", 
    "price": 0, 
    "instructors": "Mtro. Ricardo Garibay Jiménez", 
    "institution_name": [
        "Universidad Nacional Autónoma de México"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/sisemb", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-12-31T00:00:00Z"
}