{"selfpaced": true, "topic_name": ["Biology"], "description": "\n\n                    \n                    \n                    In this course, students learn to recognize and to apply the basic concepts that govern integrated body function (as an intact organism) in the body's nine organ systems.\n\n                                            Syllabus\n                        Welcome and Additional ResourcesStart here!Homeostasis and Endocrine SystemWelcome to Module 2 of Introductory Human Physiology! We begin our study of the human body with an overview of the basic concepts that underlie the functions of cells and organs within the body and their integration to maintain life. This is an important introduction to how physiologists view the body. We will return to these basic concepts again as we progress through the organs systems and consider how they respond to perturbations incurred in daily functions and in disease.\n\nThe things to do this week are to watch the 6 videos, to answer the in-video questions, to read the notes for each topic, and to complete two problem sets (homeostasis, transporters &amp; channels, and endocrine concepts). It will be most effective if you follow the sequence of videos. The notes provide a more detailed summary of each topic. We encourage you to find which resource (videos and/or notes) works best for you.We have included a set of problems to be completed as homework exercises. We strongly encourage you to complete these problems sets. They are not graded and are for your personal feedback. It has been our experience that these exercises are helpful in increasing understanding and retention of the newly learned materials.Please use the interactive forum as a means to exchange ideas, to ask questions, to form study groups and interest groups, and to meet your community. We will monitor the forum daily.Thank you for joining us. We are excited about sharing this educational experience with you. Welcome!The Nervous SystemWe hope you are enjoying the course! Last week's lectures can be challenging because we introduce many concepts that may be new to you. This module will allow you to apply some of the concepts that you learned last week and provide you with more concrete examples. In this module we will begin our tour of the various organ systems with the nervous system. \n\n\n\nWe start by considering the function of the individual cells (neurons) and then how they interact as an integrative system. The nervous system provides rapid communication throughout the body coordinating the actions of trillions of cells. It responds to internal changes to the body as well as to changes in our external environment. This is a busy week. The things to do this week are to watch the 5 videos, to answer the in-video questions, to read the notes, and to complete the Nervous System problem set. We suggest that you read the notes, watch the videos, and answer the in-video questions before you start on the problem sets. The problem sets require you to apply your knowledge from the lectures so it is best to be fairly familiar with the material before tackling them. The problem sets are not graded, and there is no due-date for them.  The Senses and the Somatic Nervous SystemIn this module, we consider two types of cells: one that relays information to the central nervous system (brain) for interpretation and a second set, motor neurons which relay information away from the central nervous system to govern voluntary movement. The input pathway to the brain is mediated by specific cells called senses. The senses convert energy (such as light or heat) into an energy form (electrical potentials) recognized by neurons in the brain. The brain, in turn, interprets this information (as vision or pain) and then sends out a motor response via the motor neurons of the somatic nervous system to effector cells in the body.  The motor neurons activate skeletal muscle to control breathing and the movement of the limbs. \n\nThe things to do this week are to watch the 5 videos, to answer the in-video questions, to read the notes, and to complete the problem set. It will be most effective if you follow the sequence of videos. The notes provide a more detailed summary of each topic. We encourage you to find which resource (videos and/or notes) works best for you and to try the problems sets. The problem sets are not graded. Both your understanding and retention will increase with application of the new learned information.   MuscleIn this module, we consider the effectors of the body that govern voluntary and involuntary movement. These effectors are specialized cells called muscle which are capable of generating force (tension). Muscle cells are classified as one of three types: skeletal, smooth, and cardiac. Although all three types generate tension, each is specialized for a given function. Skeletal muscle governs voluntary movement of the limbs and is critical for expansion of the lung during breathing. Smooth and cardiac muscle are contractile cells found in the walls of blood vessels and the heart, respectively. We will return to the basic principles that govern these cells types when we consider the respiratory and cardiovascular systems. \n\nThe things to do this week are to watch the 4 videos, to answer the in-video questions, to read the notes, and to complete two problem sets (skeletal muscle and smooth &amp; cardiac muscle). It will be most effective if you follow the sequence of videos. The notes provide a more detailed summary of each topic. We encourage you to find which resource (videos and/or notes) works best for you and to try the problems sets. The problem sets are not graded. Both your understanding and retention will increase with application of the new learned information. Cardiovascular SystemWelcome back! In this module we consider how the circulatory system works to deliver oxygen and nutrients to the specific organs. We start with a discussion of the electrical and mechanical functions of the heart which enable it to generate a pressure gradient. This pressure gradient propels the blood through the blood vessels, in a unidirectional manner.  The following session considers the factors that govern delivery of gases and nutrients at the tissue level. The last session considers the entire reflex loop, its control, and its response to daily demands (rest and exercise) and how pathology affects these responses. \n\nThis is a busy week! The things to do this week are to watch the 5 videos, to answer the in-video questions, to read the notes, and to complete the CV problem set. It will be most effective if you follow the sequence of videos. The notes provide a more detailed summary of each topic. We encourage you to find which resource (videos and/or notes) works best for you and to try the problems sets.  The problem sets are not graded. Both your understanding and retention will increase with application of the new learned information.      Respiratory SystemWe hope that you are enjoying the course! This module considers the respiratory system. In these lessons, we explore topics such as how we get air into our lungs, the role of airway resistance in ventilation,  the transport of oxygen and carbon dioxide between the lungs and tissues, and the regulation of breathing. There are a couple of demonstrations of lung function in the videos!\n\nThe things to do this week are to watch the 8 videos, to answer the in-video questions, to read the notes, and to complete the Respiratory System problem set. We suggest that you read the notes, watch the videos, and answer the in-video questions before you start on the problem sets, which are not graded. Take a deep breath and have fun with it! The Endocrine SystemIIn this module, we return our attention to the endocrine system and its role in the maintenance of homeostasis. In particular we consider the hypothalamus-pituitary axis, which integrates signals from the nervous system and from the blood to regulate most homeostatic functions, including growth, ion balance, fluid balance, response to stress, and energy use.  The first lesson gives an overview of the hypothalamus-pituitary axis and its actions in regulating growth of the body. In later lessons we consider how this complex negative feedback loop governs the body’s energy use and its response to stress. Then, later in lesson 3, we turn our attention to the simple reflex loop by which the endocrine pancreas regulates metabolism in both the fed and fasted states and the failures of this system (diabetes mellitus).  The hypothalamus-pituitary axis and its control of reproduction in both males and females are considered in the next module (Module 9). \n\nThe things to do this week are to watch the 6 videos, to answer the in-video questions, to read the notes, and to do the two problem sets (endocrine system and fuel homeostasis). Please note that each module can stand alone, however, it will be most effective if you do the first two videos (H-P-axis) before any of the others. The notes provide a more detailed summary of each topic and again we encourage you to use the resource (videos and/or notes) that works best for you. Please do try the problems sets for self-review. Both your understanding and retention will increase with application of the new learned information.The Reproductive SystemWelcome back! This module continues our discussion of the endocrine system and its control of homeostasis. In this series of videos, we consider how the endocrine system regulates the production of gametes (egg and sperm) in the female and male, respectively, as well as the production of the sex hormones. \n\nThe things to do this week are to watch the 4 videos, to answer the in-video questions, to read the notes, and to complete the problem set. It will be most effective if you follow the sequence of the lectures on the reproductive system. Again please consult the notes for a more detailed summary of each topic. If you have not tried the problems sets, please do so. They will reinforce your understanding of the newly learned information by applying it. Since these problem sets are delivered in the same electronic format as the exams, by completing them, you will gain confidence in using the electronic test format.   The Gastrointestinal SystemCongratulations! You have almost completed this course. In this module, we consider the inner workings of your gut.  Most of our discussions deal with the function of specific regions of the gastrointestinal tract where complex foods are processed into solutes and nutrients that can be absorbed into the body for use as fuel. This “processing plant” acts in a unidirectional manner from mouth to anus and requires the coordinated secretions of acid, enzymes, bases, and fluids for its normal function.  What is unusual about the gastrointestinal (GI) tract and its accessory organs, salivary glands, liver, and pancreas, is that their coordinated actions occur in a timely manner without conscious input from the brain. Instead the gut integrates its diverse actions by locally produced chemicals (hormones and paracrines) as well as by the coordinated actions of the enteric nervous system, a subdivision of the autonomic nervous system.  In the last lesson of this module, we consider normal motility of the gut, as well as perturbations that result in gastrointestinal distress such as vomiting and diarrhea. \n\nThe things to do this week are to watch the 4 videos, to answer the in-video questions, to read the notes, and to complete the gastrointestinal problem set. For this topic, the most effective approach will be to follow the sequence of videos as we move along the gastrointestinal tract. The notes provide a more detailed summary of the video lectures.  Again, please use the resource (videos and/or notes) that works best for you. However, we encourage you to complete the problem sets as both your understanding and retention will increase with application of the new learned information.  Hope you enjoy the week!The Urinary SystemWelcome to module 11 and the last organ system to be covered in this course! In this module, we turn our attention to the urinary system and specifically to the functions of the kidney, a filter of the blood.  The kidney is a complicated organ whose actions integrate with those of the cardiovascular system to maintain blood pressure and with the respiratory system to maintain acid-base balance.  As we progress through this module, we consider the mechanisms by which the kidney regulates the water content and the electrolyte content of the body.  We focus on the roles of the normal kidney but also consider changes in homeostasis due to either disease or drugs.  The last lesson of this module considers the role of the kidney in regulating acid-base balance of the body and its integration with the respiratory system. \n\nThe things to do this week are to watch the 6 videos, to answer the in-video questions, to read the notes, and to complete one problem set (urinary system).  In this module, the sequence of videos is important.  As you proceed through the videos and notes, try to correlate the specific region of the renal tubule with its function.  Often this is best achieved by drawing the renal tubule and labeling the specific changes in structure and function.  Again, the notes will provide a more detailed summary of the material presented in the videos.  Please note that the first two videos correlate with the first set of notes and the third video with the second set of notes. We encourage you to complete the problem set.  The problem set is not graded and is for your personal feedback. Both your understanding and retention will increase with application of the new learned information.   \n                                    ", "end_date": "2014-11-10T00:00:00Z", "title": "Introductory Human Physiology", "price": 0, "instructors": "Emma Jakoi and Jennifer Carbrey", "institution_name": ["Duke University"], "commitment": "6-8 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/physiology", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-09-01T00:00:00Z"}