{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tWe all know that having great high quality content is necessary to help you build trust and authority with your audience.  </p>  <p style=\"\">  \t             The big problem here is trying to find or create high quality content that will engage your audience and help you to increase the sales of your product or service, or help you to sell more products as an affiliate.  </p>  <p style=\"\">  \t             The good news is that there are millions of great quality pieces of content out there on the internet, and you can <strong style=\"\">actually</strong> and legally<strong style=\"\"> </strong>use them if you do it correctly.  </p>  <p style=\"\">  \t            This is what we call <strong style=\"\">Content Curation, </strong>the methods of piggybacking of others people content and reacting to it.  </p>  <p style=\"\">  \t            This is not just about taking other peoples content and stealing it, as that is illegal, and would violate copyright law, that is not what I will teach you.  </p>  <p style=\"\">  \t           It is not about copying, plagiarizing or rewording it  </p>  <p style=\"\">  \t            Instead I will teach you how to react to this content, and respond to it in your own perspective in a way that is very effective.  </p>  <p style=\"\">  \t           If you do content curation correctly, my methods can dramatically help you to sell your products and services, or if you are an affiliate help you to sell much more of what you promote.  </p>  <p style=\"\">  \t          You will finally discover how to curate other peoples content correctly and drive tons of super targeted and high quality traffic to your site.  </p>  <p style=\"\">  \t          I look forward to seeing you on the other side and helping you to increase your sales and profits.  </p>", 
    "end_date": null, 
    "title": "5 Steps to Content Marketing Success!", 
    "price": "20.00", 
    "instructors": "Nick  Sammut-", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/275008_e4a2_2.jpg", 
    "course_url": "https://www.udemy.com/learn-content-curation-in-5-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-05T05:54:03Z"
}