{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>JOIN OVER 1228+ NEW STUDENTS ENROLLED. </strong></p>\n\n<p><strong>Updated: May 2016 - Including Goals, Link Actions, Gmail Addon</strong></p>\n\n<p><em>Imagine your business having more powerful and profitable automated email marketing. Where your follow up is more intelligent than just sending one email after another. Where your potential customers feel you are talking about them and understand them.</em> </p>\n\n<p>ActiveCampaign delivers amazing marketing possibilities BUT with lots of GOTCHAs.</p>\n\n<p>Learn from my experience and mistakes... Enrol now and start a new world of intelligent email marketing with ActiveCampaign.</p>\n\n<p>This course takes you rapidly from beginner to advanced user of the Active Campaign.</p>\n\n<p>In just 2 hours you should be able to design and create interactive automation marketing systems with ActiveCampaign. </p>\n\n<p><strong>Ideal for anyone starting with Active Campaign or switching over from another email systems. Also suitable for those with a little experience of Active Campaign who have lost their way.</strong></p>\n\n<p>Over the course of 80+ video lessons and just over 2 hours you will </p>\n\n<ul><li><strong>Discover all the foundations</strong> of using Active Campaign before building on them</li><li>Know how to use Active Campaign and third party methods for <strong>collecting leads</strong></li><li>Understand the power of automation and tagging for <strong>intelligent marketing</strong></li><li>Work out a naming and organisation system for your account to <strong>avoid growing pains later</strong></li><li>Be able to <strong>rework the example automations </strong>to warm up your prospects, convert freebie downloads to customers and reduce refunds</li><li>Discover what is working with campaign and automation reporting</li><li><strong>Avoid the gotcha's and mistakes of other Active Campaign users</strong></li></ul>\n\n<p><strong>Why take this course?</strong></p>\n\n<ul><li>You want a <strong>flying start </strong>with Active Campaign</li><li>You want to <strong>get to an advanced level</strong> and go further than the basics</li><li>You feel the power of Active Campaign but have got lost in setting it up</li></ul>\n\n<p><strong>&gt;&gt; Enrol now and start a profitable new world of intelligent email marketing with ActiveCampaign. </strong></p>", 
    "end_date": null, 
    "title": "ActiveCampaign: Email Marketing: Beginner to Power User Fast", 
    "price": "35.00", 
    "instructors": "Rob Wilson", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514574_592d_2.jpg", 
    "course_url": "https://www.udemy.com/active-campaign-power-start/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T13:20:02Z"
}