{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>O avanço da tecnologia digital trás uma série de oportunidades para as empresas, mas ao mesmo tempo uma série de desafios. Companhias que não se prepararem para essa nova realidade correm grandes riscos para seus negócios. \n\n  </p>\n\n<p>\n\n  </p>\n\n\n\n<p>Funcionários que não acompanharem essa evolução correm grandes riscos para suas carreiras.   \n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>Esse curso foi desenvolvido especialmente para os profissionais que buscam compreender como empregar as novas tecnologias digitais no seu dia a dia de trabalho, mas encontram dificuldade para encontrar de maneira clara e prática a forma como elas funcionam. \n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>Ele é indicado para todos os profissionais que buscam relevância e crescimento nas suas carreiras através do conhecimento do funcionamento e das melhores práticas do universo digital, incluindo mídias sociais, mídia online, experiência de navegação dos usuários e métricas de análise de resultados.\n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>Ele é um curso-combo, que agrupa 4 cursos complementares para o completo aprendizado: \n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>1.   A Nova Mídia Online\n\n  </p>\n\n\n\n<p>2.   A Força das Mídias Sociais\n\n  </p>\n\n\n\n<p>3.   Experiência do Usuário no Website\n\n  </p>\n\n\n\n<p>4.   Transformando Dados em Ação\n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>Os dois primeiros cursos abordam as melhores maneiras de atrair a atenção dos internautas com as ferramentas digitais mais modernas da atualidade, a mídia online e a mídia social. \n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>Uma vez atraídos e direcionados para o website da empresa, a questão mais importante é garantir uma rica experiência de navegação para que eles se transformem em novos consumidores. Esse é o tema do terceiro curso. \n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>Finalmente, o último curso trata da mensuração dos resultados, mostrando como no universo digital todas as ações podem e devem ser medidas, condição básica para serem aprimoradas continuamente.\n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>O curso completo possui 1:07 de treinamento. \n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p>Com uma base sólida e bem estruturada de conhecimento do universo digital, o profissional pode superar os desafios de uma área que avança a passos rápidos todos os dias, e assim conseguir estar atualizado na sua carreira. </p>\n\n<p> \n\n  </p>", 
    "end_date": null, 
    "title": "Alfabetização Digital", 
    "price": "50.00", 
    "instructors": "Ricardo Pomeranz", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823916_4a58_2.jpg", 
    "course_url": "https://www.udemy.com/alfabetizacao-digital/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-16T19:51:17Z"
}