{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      Indie authors do better with Amazon than other retailers because Amazon has enabled tools for them. Surprisingly, <em>many authors don't use these selling aids.</em> Authors who use the tools wisely <strong>sell more books</strong> and <strong>get more reviews</strong>.  </p>  <p>  \t                                This video walks new and established authors through the steps of maximizing their Amazon presence. You'll learn to:  </p>  <ul>  \t<li>make the most of an Author Central profile for Amazon USA and enabled Amazon nations all over the world (UK, Germany, France, Japan).</li>  \t<li>make Amazon Associate-Affiliate profiles and earn extra commissions on sales.</li>  \t<li>build Global Amazon links for purchases and reviews at the proper nations.</li>  \t<li>increase your Amazon potentials right away.</li>  </ul>  <p>  \t                            Whether inserted in a website, blog, email signature or within the book itself, you'll discover how easy and wise it is to use <strong>Global Amazon links</strong>, which gives your book the advantage.  </p>  <p>  \t                      Taught by Jason Matthews, bestselling author and self-publishing expert. Save time and make of the most of your Amazon potentials.</p><p><em>Get started today and reach more readers soon.</em></p>  <p>  \t      The course has a 30 day money back guarantee.  </p>", 
    "end_date": null, 
    "title": "Amazon Author Central: Marketing Books Like a Pro", 
    "price": "20.00", 
    "instructors": "Jason Matthews", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302438_7648_5.jpg", 
    "course_url": "https://www.udemy.com/amazon-author-central-marketing-books-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T21:51:38Z"
}