{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course you will learn the fundamentals to database marketing and how to use it to help you attract repeat clients into your business as well as build a following of brand advocates online. You will learn exactly how to:</p>  <ul><li>Increase online sales to your products and/or services</li><li>Build a culture of repeat clients into your business</li><li>Attract new and targeted leads into your business</li><li>Build a relationship with your new and existing customers</li><li>Automate your database marketing</li></ul>          <p>Being able to attract repeat buyers to your business as well as creating fresh leads into your business is a skill that every business needs. Within this course I explain how you can use database marketing as a means to do exactly that. This course is designed to be an introduction into the world of database marketing and not overwhelm you with too much information. Instead you learn the basic principles to building your own database and pointed in the right direction of where you can access tools to help you to successfully build your database.</p>  <p>Within the course I will also explain how you can use social media to help you to create brand loyalty as well as drive free traffic to your website. This includes topics such as content marketing, blogging, video marketing and the importance of value marketing. I also touch upon paid advertisements and what you need to look out for before you start your paid advertisement campaigns to ensure that they will help you to progress towards your goal of building repeat customers rather than paying for customers who only buy from you once. </p>  <p>This course is designed for beginners to internet marketing and database building and for that reason the lectures are kept short and concise with clear and to the point information. The aim of this course is to help to get you to a stage in your online marketing where you feel confidant and comfortable with lead generation. This course will only take you around 45 minutes to complete and this was purposely done so that you can take the course multiple times to help solidify your learning.</p><p>The structure of this course is as follows:</p><ol><li>Learn what database marketing is</li><li>Learn why database marketing is important </li><li>Learn how database marketing can help you to attract more clients </li><li>Learn how database marketing can help you to build repeat clients </li><li>Learn what tools you can use to build your database </li><li>Learn how to drive traffic to your webpages </li><li>Additional resources and bonuses</li></ol>", 
    "end_date": null, 
    "title": "An Introduction into Database Marketing for business owners", 
    "price": 0, 
    "instructors": "Sam Dey", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757282_518e.jpg", 
    "course_url": "https://www.udemy.com/digital-marketing-online-course/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T15:36:22Z"
}