{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>~~~NEW COURSE May 2016~~~</p>\n\n<p>I (Alex) am an independent mobile app entrepreneur just like you, and I created this course to teach you all my strategies to:</p>\n\n\n\n\n\n<ul><li>Get 100,000s of downloads from mobile app store marketing</li><li>Save money by doing your own ASO (search engine optimization SEO for Android and the Apple App store) better than most consultants you might consider hiring</li><li>Create an app marketing strategy outside the app stores by getting press coverage and learning how to promote an app using social media and social sharing</li></ul>\n\n<ul><li>Help you create a successful mobile app business</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>Learn the strategies I used to get 1,000,000+ downloads for my apps, make money from them, and create a successful mobile app business.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Personal Touch</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I love helping students who take my courses, and I look forward to helping you. If you have questions about whether this course is right for you, feel welcome to send me a message.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What Makes This Course Special</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Both Nick and I share tactical and practical advice that you can use to get downloads for your app. This is an actionable course, not one that just fluffs over topics.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>My Background</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I am an independent developer (Problemio business apps) and I have gotten a cumulative 1,000,000+ downloads for my apps without spending any money on marketing. My app ranked #1 for the search \"business\" on Android for over three years, and many of my apps dominate their search rankings in app stores.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course I teach you the insights and secrets I learned while growing my own mobile app business. Everything I teach in this course is something I have done and tried myself.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>How The Course Is Structured</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is almost all video. It will take between 2 to 3 hours to complete. After you finish the course, you should be much stronger in overall mobile app business strategy and mobile app marketing.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why You Should Take This Course Now</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You might think that you will focus on the marketing and monetization strategies after your app is build and has launched. But that is a very costly mistake made by many first-time entrepreneurs.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will shed light on many parts of your business marketing, and allow you to choose a far more successful path for your app from the very beginning. That is why you should take this course before even writing the first line of code for your app.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Luckily, the course only takes between 2-3 hours to complete. So you can transform yourself and become a much stronger app entrepreneur in less than half a day. Take the curse today, and see for yourself.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Still Wondering If The Course Is Right For You?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I understand that before taking the course you might have doubts about whether it will actually help you.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I can assure you that I put all my knowledge into this course, and made it as insightful as I could for you. I also continue to look for interesting topics, and add new lectures to the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>But don't take my word for it. Every Udemy course has a 30-day money back guarantee. So give the course a try, and if you feel that you didn't learn from it, or are unhappy with the course, just get your money back.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>As one entrepreneur to another, I wish you much success and enjoyment in your business!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>+++++++++++++++++++++++++++++</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>MONEY BACK GUARANTEE</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em></p>", 
    "end_date": null, 
    "title": "App Marketing and ASO - Double Your Downloads", 
    "price": "20.00", 
    "instructors": "Rick Walter, Alex Genadinik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834098_c277.jpg", 
    "course_url": "https://www.udemy.com/app-marketing-and-aso/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-28T03:07:32Z"
}