{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\"></strong>Muchas personas quieren lo mismo que tú. En la actualidad hay mucha oferta y poca demanda profesional, por lo que la necesidad de destacar frente al resto es más latente que nunca.  </p>  <p>  \t<strong style=\"\">¿Quieres encontrar trabajo hoy?</strong>  </p>  <p>  \t  - Aprende técnicas de búsqueda de empleo.  </p>  <p>  \t  - Encuentra personal clave relevante para tus intereses.  </p>  <p>  \t  - Descubre trucos para venderte mejor y mejorar tus características.  </p>  <p>  \t  - Crea el empleo del futuro con sencillos consejos.  </p>  <p>  \t<strong style=\"\">¡Haz marketing de ti mismo y aprende a venderte mejor!</strong>  </p>  <p>  \t  Este curso está hecho para que crezcas, mejores y aprendas a ser más vendible. Para que estés preparado ante los cambios profesionales y personales que el mundo digital va a provocar en el empleo. <strong style=\"\">Este curso está hecho por y para ti</strong>.  </p>  <p>  \t  Si <em style=\"\">estás en paro, estás terminando la universidad</em> y buscas tu primera oportunidad profesional, <em style=\"\">si tienes trabajo pero no eres feliz </em>y quieres cambiar o si, simplemente, quieres <em style=\"\">formarte por placer</em>, <strong style=\"\">esta herramienta te servirá</strong>. Ampliarás conocimientos que te permitirán ser un mejor producto y conseguir ese trabajo que deseas con todas tus ganas.  </p>  <p>  \t<strong style=\"\">Nueve capítulos y más de 3 horas de contenido</strong>  </p>  <p>  \t    Nueve capítulos de cuatro apartados cada uno, con más de tres horas de contenido y bibliografía que te ayudará a profundizar más en el tema y te enseñará las bases, claves, técnicas y trucos necesarios para triunfar en tu objetivo.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Aprende a venderte mejor en 9 pasos", 
    "price": "20.00", 
    "instructors": "Sixto Arias", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343282_ff47_4.jpg", 
    "course_url": "https://www.udemy.com/self-marketing-diferenciate/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T14:57:11Z"
}