{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>El conocimiento que les voy a transmitir es fruto de varios meses de investigación en el tema de aprovechar Whatsapp como herramienta de Marketing , tenemos claro que WhatsApp es un canal digital que a Febrero de 2016 tiene ya mas de 1.000 millones de usuarios , esto sumado a la compra por parte de Facebook plantean un gran potencial de este canal para cerrar ventas, fidelizar y atender a nuestros clientes.</p><p>Este canal digital presenta un gran potencial hasta ahora a mi manera de ver esta sin explotar , los invito a este curso donde les explicar como paso a paso como se realizar el proceso de ventas por WhatsApp, respetando las normas de privacidad dictadas por la compañía.</p><p>Definitivamente el mundo cambio y la forma de relacionarnos con las personas, como compramos y como nos comunicamos también cambio.</p><p>Allí es donde muchas empresas se pierden quieren vender a toda costa sin primero ganarse la confianza de sus posibles clientes, este es el poder de Whatsapp y en general de los canales digitales, la posibilidad de establecer relaciones con personas de carne y hueso para lograr los objetivos comerciales, este es el famoso Marketing relacional.</p><p>Las ventas se logran el 90% con una estrategia comunicacional y el 10% con tecnología.</p><p>Las ventas se logran el 90% logrando la confianza de nuestros posibles clientes básicamente CONVERSANDO, así es que vamos a lograr vender por Whatsapp sosteniendo conversaciones influenciadas con técnicas psicológicas que logren estimular EMOCIONES y que lleven a las personas a ejecutar transacciones.</p><p>El 10% la parte técnica también la vamos a ver en profundidad como utilizar los grupos, listas de difusión y envíos masivos.</p><p>Aquí la mayor inversión es de capacitación, tiempo y creatividad, la tecnología cada vez tiende mas a ser casi gratuita.</p><p>Así esta enfocado nuestro curso aquí aprenderán estas técnicas psicológicas diseñadas y probadas por los grandes \"GURUS\" del Marketing Digital y además la parte técnica, como utilizar los grupos, listas de difusión y envíos masivos.</p><p>Este curso esta creado evitando usar palabras técnicas y tratando al máximo de usar un lenguaje sencillo, esta es la ideal es BAJAR la tecnología para que se pueda aprovechar sin tanta complicación , los empresarios debemos aprovechar esta gran oportunidad y si empezamos primero que la competencia, dice la máxima de Albert Eistein “Locura es intentar siempre lo mismo, esperando resultados diferentes\", esa es mi invitación a explorar nuevos caminos, a innovar y renovar la mente.</p><p>Con toda seguridad este curso les abrirá un nuevo panorama útil en sus empresas y negocios.</p>", 
    "end_date": null, 
    "title": "Aprenda a vender por whatsApp paso a paso", 
    "price": "30.00", 
    "instructors": "Ingeniero de sistemas Luis Eduardo Amaya Uribe", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613156_73ae_2.jpg", 
    "course_url": "https://www.udemy.com/aprenda-a-vender-por-whatsapp-paso-a-paso/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T21:48:53Z"
}