{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Senior decision makers at businesses often receive 200-300 plus emails per day... How can you possibly expect to stand out above the clutter, capture your customers attention, show that you understand their goals and sell them on your product or service?</p><p>This course is going to teach you tested and proven strategies to succeed at B2B Marketing by giving you a step-by-step blueprint detailing the strategies used by a number of top companies in the B2B space. </p><p>More specifically, <strong>this course will teach you:</strong> </p><ul><li>How to cut through to senior decision makers through proven B2B best practices</li><li>How to build a database full of thousands of potential buyers</li><li>How to create a message that grabs the attention of buyers to separate you from the competition</li><li>How to build a website that converts visitors to potential buyers</li><li>How to write and automate winning emails</li><li>And strategies to help your sales team move prospects through the funnel to drive more revenue</li></ul><p>Whether your goal is to start a new business, improve an existing business, raise a new round of funding or get a raise, this course will give you the tools necessary to overcome any B2B marketing challenge and produce results inline with todays top B2B marketing professionals. </p><p><strong>By the end of this course, you'll be able to:</strong></p><ul><li>Quickly build a database full of 1000s of potential buyers</li><li>Create a website that captures the attention of buyers that results in executives reaching out to you to learn more</li><li>Market and host a webinar with 100s of attendees</li><li>Create captivating content that produced immediate and long term results</li><li>Flood your sales team with leads that can generate millions of dollars of business</li></ul><p><strong>Additionally, this course is going to teach you in detail:</strong></p><ul><li>Buyers Personas: How to have an intimate understanding of who you're selling to</li><li>Competitive Market Place: How to craft a message so compelling that it completely separates you from the competition</li><li>Website: How to create a compelling website that grabs the attention of executives, converts visitors to prospects and uses various forms of testing to maximize conversion</li><li>Database: How to build a database full of 1000s of potential buyers to maximize your ROI</li><li>Email: How to come up with effective subject lines to maximize open rates and effective copy to maximize click-through rates</li><li>Content: How to create a year long strategy to engage executives and leave them wanting more</li></ul><p>Having worked across eight different B2B industries from retail to finance to oil and gas to sustatainability plus more, I've had the privilege of learning first hand what works and what doesn't when it comes to B2B marketing. Furthermore, I've also worked on the B2B sales side which will allow me to help you better understand how sales and marketing work hand-in-hand in the B2B marketing ecosystem and along the buyer journey. </p><p>So if your looking to better connect with executives, improve your marketing funnel, grow your business or improve your overall understanding of the space, I highly recommend you sign up now and take your B2B marketing strategy to the next level. </p><p>REMINDER: This is a risk free purchase with Udemy's 30 day money back guarantee. </p><p>Best, </p><p>James Dean </p><p>P.S. Due to the recent launch of this course, the course is currently priced at a discount. I plan to increase the price in the near future so sign up at the current price while you can! </p>", 
    "end_date": null, 
    "title": "B2B Marketing For Beginners", 
    "price": "20.00", 
    "instructors": "James Dean", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558880_433d_4.jpg", 
    "course_url": "https://www.udemy.com/b2b-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-19T19:51:22Z"
}