{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Una delle variabile che molto spesso viene sottovalutata nei primi mesi di strutturazione di una startup sono <strong>i clienti.</strong>\n</p><p>Lo startupper si concentra sul prodotto, che deve essere \nperfetto, e si dimentica di un principio fondamentale del lean approach:<strong> non si deve sviluppare l'idea che si ha in testa, ma quello che ci richiede il mercato</strong>, ovvero i nostri primi potenziali users.\n</p><p>E come fare ad ascoltare il mercato se i clienti non arrivano da soli? <strong>Dobbiamo andarceli a prendere</strong>.\n</p><hr><p>\n\t<strong>Perché Lacerba?</strong>\n</p><p>\n\tVero, ci sono centinaia di tutorial su come fare marketing. La maggior \nparte però da informazioni solamente parziali, e spesso non incentrate \nsul mercato italiano.\n</p><p>\n\tIn questo corso capirai su quale cliente indirizzare i tuoi sforzi, e \nquali siano i canali ed i tools migliori per raggiungerlo.\n</p><p>\n\tInoltre potrai contare sulla nostra community, dove potrai chiedere consigli a noi ed agli altri utenti per ricevere feedback.\n</p><hr><p>\n\t<strong>Cosa imparerai in questo corso?</strong>\n</p><p>\n\tCon questo corso imparerai qual è il cliente tipo di una startup, e perchè si differenzi da quelli di società tradizionali.\n</p><p>\n\tDi seguito i contenuti dettagliati del corso:\n</p><ul><li>Cos'è il <strong>Lean Funnel</strong></li><li>Come trovare gli <strong>early adopters</strong></li><li>Come <strong>monitorare</strong> le tue campagne</li><li>Come <strong>pianificare</strong> le tue attività con Buffer</li><li>Come utilizzare Bitly per misurare il <strong>CTR</strong> <strong>(click-through rate)</strong></li><li>Come sfruttare al meglio i principali <strong>social network</strong></li></ul><hr><p>\n\t<strong>Quanto tempo ci vorrà per terminare il corso? </strong><br>\n</p><p>\n\tIn totale i video durano circa un'ora. 10 minuti al giorno per una settimana sono più che sufficienti per seguire le lezioni!\n</p><hr><p>\n\t<strong>Quali requisiti servono per capirne i contenuti?</strong>\n</p><p>\n\tNessuno! Questo corso è pensato proprio per chi non ha alcuna base di Marketing.\n</p><hr><p>\n\t<strong>Che aspetti dunque? Progetta il tuo logo e inizia a creare il design che permetterà alla tua Startup di conquistare il mercato!</strong>\n</p>", 
    "end_date": null, 
    "title": "Basic Marketing per StartUp", 
    "price": 0, 
    "instructors": "Pietro Bergamaschi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655402_d43c.jpg", 
    "course_url": "https://www.udemy.com/trova-i-tuoi-primi-clienti/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T11:08:08Z"
}