{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t <strong>The ONLY Internet Marketing Course You Will <em>EVER</em> Need to Enroll In on Udemy to be successful online!</strong>  </p>  <p>  \t <strong>Have you been struggling in the world of Internet Marketing? Have you been attempting to start your own online business for years only to stay stuck in the mud? Have you been thinking about starting your own business and just don&#039;t know where to begin? Do you currently own a small business and want to learn how you can take it to the next level online??</strong>  </p>  <p>  \t          I hate to start with such a salesy headline... but if you answered <em>&#039;Yes&#039; </em>to any of the above questions, this <strong>Jedi Master Course</strong> is for <strong><em>YOU!</em></strong>  </p>  <p>  \t          In this course, <strong>Be a Jedi Master of Internet Marketing in 2014</strong>, you will discover everything you <em>need</em> to know to successfully build your own internet marketing empire overnight. You will be taken by the hand by me, Co-Founder and CEO of <strong>Beach City Marketing &amp; Graphics</strong>, Travis Pastore and shown all the necessary elements to marketing a small business online in 2014. You will then be able to take this knowledge and develop your own business just like I did and achieve SUSTAINABLE substantial income online.  </p>  <p>  \t          Join me, as we go step-by-step on this journey together through the world of <strong>Digital Marketing</strong>. The following video lessons will show you everything you <em>need </em>to know; from purchasing your first domain name, setting up a re-seller web hosting account, changing DNS settings, how to work with FTP or cPanel, WordPress plugins and themes specifically designed for internet marketing, keyword planning and SEO research &amp; development, SERP rankings, local search engine marketing, social media and viral marketing, finding, contacting and maintaining clients and even more bonus tips &amp; tricks sprinkled in along the way…  </p>  <p>  \t <strong>What Bonuses You Ask!?</strong>  </p>  <ul>  \t<li><strong>BONUS #1</strong> - I will show and <strong>GIVE YOU</strong> a One-Click Internet Marketing Consultant Wordpress Theme to make setting up <em>your</em> Internet Marketing business as easy as changing around a few words!</li>  \t<li><strong>BONUS #2 </strong>- I will show you all the latest SEO &amp; Backlink Tips &amp; Tricks the big corporate companies are using to guarantee they stay on top of Page 1 using one of <em>my own</em> <strong>PR1</strong> ranked clients as an example! As well as give you a list of 21 <strong>DoFollow</strong> PR5+ Forums for you to start building <em>quality</em> backlinks today!</li>  \t<li><strong>BONUS #3</strong> - I will give you <strong>TEN</strong> Facebook Timeline Squeeze Page Templates to create <em>custom landing pages</em> on your Business Profiles!</li>  \t<li><strong>BONUS #4</strong> - I will show you a very little known secret to getting the coveted <em>&quot;500+ Connections Badge&quot;</em> on LinkedIn overnight!</li>  \t<li><em>All this</em> and <strong>more</strong> included with this course!!</li>  </ul>  <p>  \t<strong><em>***** Let me help YOU master the following digital marketing necessities: *****</em></strong>  </p>  <ol>  \t<li>Designing, Building &amp; Optimizing Your <strong>First Website</strong></li>  \t<li>Mastering <strong>Wordpress</strong> to then Develop Websites for Clients</li>  \t<li><strong>SEO Best Practices</strong> - Bring Client Sites to Page 1 of Google</li>  \t<li>Market Your Client Sites on Multiple <strong>Social Media</strong> Portals</li>  \t<li>Market Yourself as an Expert in Internet Marketing with <strong>LinkedIn</strong></li>  \t<li>Designing &amp; Producing Client <strong>Commercials &amp; Testimonials</strong> </li>  \t<li><strong>VSEO Best Practices</strong> - Bring Client Videos to Page 1 of Youtube &amp; Google</li>  \t<li>Find <strong>Clients</strong> Who <em>Need &amp; Want</em> Your Services</li>  \t<li>...And <strong>MORE!</strong></li>  </ol>  <p>  \t          Get total hands-on, guided experience with <em>WordPress, Google, Yahoo, Bing, Twitter, Facebook, LinkedIn, Yelp</em> and so much more…  </p>  <p>  \t          ALL of this and more, explained in plain, easy to understand verbage from an actual professional with real life examples to back everything up! Not to mention easy-to-follow and implement video guides that break down every single step of the process to guide you to ultimate online success! Digital Marketing companies operating today charge upwards of $5,000 <strong>every month</strong> for an &quot;all inclusive&quot; internet marketing solution... and those companies hardly know the basics let alone the secrets! Isn&#039;t it time <strong><em>you</em></strong> mastered internet marketing and got <strong><em>YOUR</em></strong> piece of the Pie!?  </p>  <p>  \t<strong><em>***** </em>Please Check Out the AMAZING Amount of Content Included in the Course Below as well as the available <em>FREE PREVIEWS!</em><em>*****</em></strong>  </p>", 
    "end_date": null, 
    "title": "Be a Jedi Master of Internet Marketing in 2014 All Inclusive", 
    "price": "40.00", 
    "instructors": "Beach City Marketing & Graphics", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184744_9c1d_6.jpg", 
    "course_url": "https://www.udemy.com/jedi-master-of-internet-marketing-in-2014-all-inclusive/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-18T17:55:29Z"
}