{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Where do you start if you want to develop a digital marketing strategy?</strong></p><p>A digital marketing strategy is an absolute given for any company trying to market itself online.<br><br></p><p>The small business community is all abuzz about <strong>Digital Marketing</strong>.</p><p> Everyone is rushing to blog, tweet and use Facebook and Instagram. But what is all this buzz about ? Are these new tools really all that helpful? <strong>Just before starting 2016 as an entrepreneur, a startup, you must have a clear idea of what <em>digital marketing</em> is and how you can leverage it to grow your business.</strong> So, your new year will start with new strategy. <br></p><p><strong>Join our 10 days marketing challenge to become a digital marketing expert, </strong>because digital marketing is more than just having a nice website.<strong></strong> It is set of strategies that are designed to bring people to your website and convert them to customers. </p><p>Millions of people are using the Internet each day and searching for the products and services you provide. So it is no doubt you need it. This 10 days marketing challenge is your stepping stone to your bright future!</p><p><br></p><p><strong>Digital marketing skills are also in serious demand</strong>; if you are thinking of a\n career in this field then you will need the sufficient knowledge and adequate \nexperience. </p><p>With the above you will be in \ndemand for a digital marketing industry and will be able to apply all aspects of \nmarketing knowledge to produce great marketing strategies.</p><p><strong>Studying can be flexible and can work around your existing commitments. So, don't hesitate, start your 10 days marketing challenge today to succeed tomorrow.  <br></strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Become a Digital Marketer in 10 days!", 
    "price": "45.00", 
    "instructors": "iMarketer Training", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635214_7cc6.jpg", 
    "course_url": "https://www.udemy.com/become-a-digital-marketing-expert-in-10-days/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T20:16:07Z"
}