{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    In this breakthrough class we&#039;ll cover how to turn a simple &quot;list&quot; article into <strong style=\"\">almost a dozen different traffic &quot;magnets&quot; to drive targeted visitors to your website or blog</strong> (or both)!  </p>  <p style=\"\">  \t    You can use these techniques to <strong style=\"\">leverage articles into multiple marketing tools, get more traffic to your website</strong>, and <strong style=\"\">even multiply your efforts by hiring others to do some or all of it for you</strong>!  </p>  <p style=\"\">  \t    Heck, I <strong style=\"\"><em style=\"\">even</em></strong> show you how to turn your article into a podcast (and not make any changes to your website)!  </p>  <p style=\"\">  \t    In fact, here&#039;s just a sample of what we cover on this exciting class:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">How to turn your article into a podcast...</strong></li>  \t<li style=\"\">How to turn your article into multiple videos...</li>  \t<li style=\"\"><strong style=\"\">How to leverage your article on Pinterest...</strong></li>  \t<li style=\"\">How to leverage that article into an entire webinar...</li>  \t<li style=\"\">... and much, MUCH More!</li>  </ul>  <p style=\"\">  \t    Don&#039;t miss this class that will show you how to get maximum marketing results from just a single article (and YOU don&#039;t even have to write the article yourself!).  </p>  <p style=\"\">  \t    If you want to make money with your writing as an author or freelance writer, this class will teach you techniques that put your marketing efforts on steroids.  </p>  <p style=\"\">  \t    Every minute you wait is another moment that you&#039;re missing out on the powerful techniques you&#039;ll learn in this class to drive the traffic and visitors you need to explode your business.  </p>", 
    "end_date": null, 
    "title": "Beyond Article Marketing: 10 Marketing Magnets in 1 Article", 
    "price": "50.00", 
    "instructors": "Jim Edwards", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324392_c678_4.jpg", 
    "course_url": "https://www.udemy.com/marketing-magnets/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T19:15:49Z"
}