{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong><strong>Blogging - Blogging For Business</strong></p><p>Blogging for business  - learn how to write blogs that generate leads and sales - learn professional modern blog and article writing techniques</p><p><strong>Do You Want To Learn How To Write Blogs Or Articles That Drive Specific Marketing Objectives?</strong></p>  <p>But don't know where to start?</p>  <p>If you understand the AIDA principles of copywriting…</p>  <p>...And if you know how to balance traditional copywriting skills with solid SEO techniques…</p>  <p>...Then getting people to engage with your writing will be much much easier. </p>  <p><strong>Copywriting In The Digital Age:</strong></p>  <p>A lot of copywriting courses focus on sales copy.</p>  <p>Or they focus on SEO (search engine optimisation).</p>  <p>In this course we balance the two needs together, so that you can write great sales copy and also perform well when it comes to getting found in search.</p>  <p><strong>AIDA Copywriting:</strong></p>  <p>We will show you how to apply the time honored process of using the AIDA copywriting techniques and apply them to blog writing and article writing.</p>  <p>Once you understand the ATTENTION, INTEREST, DESIRE and ACTION phases of writing good content, the improvement to your writing will be dramatic.</p>  <p><strong>Targeting A Niche Audience:</strong></p>  <p>One of the biggest mistakes that people make when writing marketing material, is that they do not target a niche audience.</p>  <p>In this course we will guide you through that process and explain how you write to “BOB\", your target client.</p>  <p><strong>Balancing Copy With Keyword Research:</strong></p>  <p>An important aspect of modern copywriting is balancing traditional copywriting skills with SEO needs.</p><p>In this course we will take you through that process and show you some simple techniques for researching keywords and keyword phrases you can use in your blogs or articles.</p>  <p><strong>Topics Covered In The Course:</strong></p>  <ul><li>Content marketing principles</li><li>Blogs vs articles</li><li>Identifying a niche audience</li><li>Finding your style</li><li>Preparation tips</li><li>Page setup and flow</li><li>Links and actions</li><li>Additional content</li><li>AIDA copywriting techniques</li><li>Keyword research tools</li><li>And much much more…</li></ul>  <p><strong>Who Is This Course For?</strong></p>  <p>This course is designed for entrepreneurs and small business owners who have had no formal copywriting training.</p>  <p>It is also a good introduction to copywriting for the social media marketing professional who wants to learn how to structure a blog or article and drive specific actions.</p>  <p><strong>Who Is This Course Not For?</strong></p>  <p>This course is not for those who are looking for a short cut on SEO techniques, it is not a course on how to game the Google search system, it is an ethical course that teaches sound psychological principles.</p>  <p><strong>So Join Me On The Other Side:</strong></p>  <p>Where we can help you learn how to write better copy for your blogs and articles and improve your marketing skills!</p>", 
    "end_date": null, 
    "title": "Blogging - Blog Copywriting - Blog Marketing For Business", 
    "price": "25.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477942_af7e_4.jpg", 
    "course_url": "https://www.udemy.com/write-powerful-marketing-blogs-articles-copywriting/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T12:04:01Z"
}