{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul style=\"\">  \t<ul style=\"\">  \t\t<p>  \t\t\t<strong style=\"\">Are your books selling like you really wanted?</strong>  \t\t</p>  \t\t<p>  \t\t\t        Chances are you love writing books and that is easy and effortless but what is happening after you hit the publish button and you wait for the sales to kick in?  \t\t</p>  \t\t<p>  \t\t\t        For you and most authors, that&#039;s where the dream ends; as you wake up to the daunting reality of seeing your book just sitting and collecting some digital dust on Amazon or other online book store where you made it available for sales.  \t\t</p>  \t\t<p>  \t\t\t        You know how to write a book, how to publish your work but there is a missing piece of the puzzle - how you can possibly be noticed in the sea of 3 million competing titles.  \t\t</p>  \t\t<p>  \t\t\t<strong style=\"\">This course puts an end to the confusion and shares the proven, systematic way to take a book from book and even you as an author from the pit of obscurity to the limelight of been seen and noticed by the people who are the exact people who you will like to call your loyal book audience.</strong>  \t\t</p>  \t\t<p>  \t\t\t        I started as an unknown author myself with no platform, no book reader and no book sales but I changed my story by focusing on one thing which is solving my number one problem which is the problem that nobody knows who I am and with that, nobody is seeing my books as.  \t\t</p>  \t\t<p>  \t\t\t        I solved this problem by focusing on finding my book readers and reaching out to them, building my author platform, building my email list and the rest is now history.  \t\t</p>  \t\t<p>  \t\t\t        It does not matter whether you write non-fiction, how-to books, poetry, obscure fiction genres, romance, thrillers, science fiction, fantasy, or literary novels – this system works. It works because you are finally able to attract the right readers, and build your relationship with them direct, without relying on anyone else and by anyone else, I mean book ad and promotion sites and if you should know how hard it is today to get these few “magic performing&quot; sites to take your money in exchange for blasting your book deal to their loyal book buying subscribers and with what you will learn in this course, you don&#039;t need to beg or pay anyone to promote your books when you&#039;ve got the right audience built over time that can give you the same result .  \t\t</p>  \t\t<p>  \t\t\t<strong style=\"\">The best part? </strong>  \t\t</p>  \t\t<p>  \t\t\t        You don&#039;t need to put a new book out every 6 weeks to keep visibility high – because you&#039;ve already built up your own direct platform.  \t\t</p>  \t\t<p>  \t\t\t<strong style=\"\">In short, you finally have a way to more effectively market the books you already have – and capitalize on the work you have already done – as well as skyrocket your results when you launch your next book.</strong>  \t\t</p>  \t\t<p>  \t\t\t        You spend months bleeding over your keyboard to get your book ready for prime time – you should not have to spend the rest of your free time trying to figure out what marketing and promotion strategies work.  \t\t</p>  \t\t<p>  \t\t\t        And you don&#039;t have to. What you will learn in this course is a system you can use that works – regardless of the types of books you write.  \t\t</p>  \t\t<p>  \t\t\t        This course is specifically for people WITHOUT an established &quot;audience&quot; in the form of a big email list or social media following and it work you through the step-by-step what&#039;s required to get more visibility for you and your book, build a loyal fan base of your target book readers, build your author platform and sell more books.  \t\t</p>  \t\t<p>  \t\t\t        This course is also bundled with five audio interviews with best-selling authors and book-marketing experts like Nina Amir, Penny Sansevieri, Derek Murphy and Matthew Turner and it&#039;s also bundled with PDF slides for all lectures that you can download and read at your convenience and you will also get four other audio lectures as bonuses.  \t\t</p>  \t\t<p>  \t\t\t        You will learn:  \t\t</p>  \t\t<ol style=\"\">  \t\t\t<li style=\"\">What is an author platform and why do you need to build one</li>  \t\t\t<li style=\"\">Why your email list is your number one book marketing asset and how you can build one on autopilot</li>  \t\t\t<li style=\"\">How to use your books to grow your email list, build your audience and grow your platform</li>  \t\t\t<li style=\"\">How to leverage Amazon, B&amp;N, Kobo, iTunes and other online book stores to build your author platform and audience as well as email list.</li>  \t\t\t<li style=\"\">A new way to see Amazon and why it&#039;s the big gorilla holding the key to building your audience base and growing your email list</li>  \t\t\t<li style=\"\">A Simple Step By Step Guide To Using Amazon As An Email List and Audience Building Tool</li>  \t\t\t<li style=\"\">Three things and Strategies You need to focus on To Build Your Author Platform and Audience Base.</li>  \t\t\t<li style=\"\">The Art Of Storytelling For Building An Author Brand And Selling Of Books – an audio interview with Matthew Turner who is a story telling and branding maven</li>  \t\t\t<li style=\"\">How to launch your book To Becoming An Amazon Best Seller – an audio interview with Rachel Wilson Thibodeaux who is a first times author who became a best seller in her first week of launching her book.</li>  \t\t\t<li style=\"\">What Is The Best Book Marketing Strategies And Tactics</li>  \t\t\t<li style=\"\">How to create The Book Marketing Plan to Market and Sell Your Books.</li>  \t\t\t<li style=\"\">How To Sell Your Book By The Truckload, Understanding Amazon And Using Social Media – an audio interview bonus with Penny Sansevieri</li>  \t\t</ol>  \t\t<ul style=\"\">  \t\t</ul>  \t\t<ol style=\"\">  \t\t\t<li style=\"\">How to create A Best Selling Book Idea and Plan, and how to use Blogging to sell your books- an audio interview bonus with Nina Amir</li>  \t\t</ol>  \t\t<p>  \t\t\t        95% of other self-published authors don&#039;t know or don&#039;t execute on these tactics, so you&#039;ll have a huge advantage and be able to win the top positions -- and the authority and income that come with it.  \t\t</p>  \t\t<p>  \t\t\t        Ready to begin your journey to finding your book audience, building your loyal book audience and creating the platform that will sell your books and take your writing career to the next level?  \t\t</p>  \t\t<p>  \t\t\t<strong style=\"\">Let&#039;s get started!</strong>  \t\t</p>  \t</ul>  </ul>", 
    "end_date": null, 
    "title": "Book Marketing & Author Platform Building For Authors", 
    "price": 0, 
    "instructors": "Mayowa Ajisafe", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434254_54e1_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-sell-more-books-and-build-your-authors-platform/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T17:04:04Z"
}