{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Marketing can be a tricky job for you as an authors, and when you consider the fact that there is too much of information out there online on what to do as well as varying, and sometimes, confusing marketing tips and strategies that does nothing but leave you more confused than ever before on what to do among all these load and tons of “to dos”.  </p>  <p>  \t  As an author, time probably is in short supply, and you should ask yourself this question – Is what I’m doing to get my books out there working at all?  </p>  <p>  \t  If it’s not working, then the best thing to do is to forget about those things you are doing with no results at all, and find something else that works.  </p>  <p>  \t  But the question is -what works?  </p>  <p>  \t  Chances are that you are happier when writing books but when it comes to marketing and promoting your books, then the story will change and there is this blank and clueless feeling when you remember the need to market and sell your book.  </p>  <p>  \t  Let the truth be said, most of what most authors will do whenever book marketing comes up are just mere wastes of time and energy. Some of these include spending countless hours on Twitter, , buying reviews, and soliciting reviews from Amazon top reviewers, review exchange (this took lots of my time when I was new on Goodreads and with no result to show for it), and many more methods like that.  </p>  <p>  \t  But most of the time, all of these are purely waste of time and energy.  </p>  <p>  \t  So, what should you be doing instead of all these?  </p>  <p>  \t  The goal of course is simple—to show authors like you what book marketing is, and how to go about it without wasting time, energy or money doing what will never bring any tangible result.  </p>  <p>  \t  If you’re new to book marketing or will like to have more of some basic knowledge of book marketing, then this course is simple and explainable enough to teach you how to get your book out there in the hands of your target book audience without wasting time, money or energy.  </p>", 
    "end_date": null, 
    "title": "Book Marketing For Authors : Save Time & Sell More Books", 
    "price": 0, 
    "instructors": "Mayowa Ajisafe", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434302_c680_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-sell-more-books-without-wasting-time-or-energy/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T17:53:37Z"
}