{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul>  \t<ul>  \t\t<p><strong><strong>**This course is completely updated and tailored to help you achieve great results in 2016! Let's make this year a great one guys**</strong></strong><br></p><p>I will offer Skype support to any student who asks for it. Send me a private message and we will set up a time for the call.  \t\t</p>  \t\t<p>  \t\t\t            Over 19,000 students have benefited from our teachings already, and have experienced life-changing results.</p>  \t</ul>  \t<p>  \t\t<strong><em><strong>-----------------------------------------------------------------------------------------------------------</strong></em></strong>  \t</p>  \t<p>  \t\t<strong><strong>Would you like to learn how to reap profitable email addresses in any given niche and make money on demand ? </strong></strong>  \t</p>  \t<p>  \t\t                                               Would you like to finally start making real money from the comfort of your home, using only your email list ?  \t</p>  \t<p>  \t\t                                               Can you follow the easy instructions I will lay down for you in order to build your very own list that will pay for years to come ?  \t</p>  \t<p>  \t\t                                               If you answered « yes » to any of the questions above, congratulations. You are already on your way to financial freedom.  \t</p>  \t<p>  \t\t                                               In the internet marketing community, gurus and successful marketers all know : the list is king.  \t</p>  \t<p>  \t\t                                               Having a list of customers in your niche is the easiest and fastest way to make money -period.  \t</p>  \t<ul>  \t\t<p>  \t\t\t<strong><strong>Let me help you !</strong></strong>  \t\t</p>  \t\t<p>  \t\t\t                                               In this course,<strong><strong>I will teach and DEMONSTRATE every step of the process from choosing your niche, to sending promotional emails to your new list.</strong></strong>  \t\t</p>  \t\t<p>  \t\t\t                                               The internet doesn't care who you are: If it worked for me, it will work for you, regardless of where you live.  \t\t</p>  \t\t<p>  \t\t\t                                               Better yet, along with my videos and my ebook, <strong><strong>I will provide you with a readymade professionally designed squeeze page, ready for you to upload to the web </strong></strong> This squeeze page comes with a high quality ebook that YOU can give away in exchange for email addresses !  \t\t</p>  \t\t<p>  \t\t\t                                               I will also teach you the art of driving converting traffic to these squeeze page in no time at all, so you can add subscribers to your list in a matter of days.  \t\t</p>  \t\t<p>  \t\t\t                                               I will take you by the hand and show you how to make money on demand.  \t\t</p>  \t\t<li> Do you need/want more money?</li>  \t\t<li> Do you want to quit your job ?</li>  \t\t<li> Do you need money to catch up on your bills ?</li>  \t\t<li> Do you have a family that relies on you ?</li>  \t\t<li> Do you want to own a business that you can be proud of, in a niche you care about ?  \t\t  \t\t\t                                               If you answered « yes » to <em><em>these </em></em>questions, <strong><strong>then consider this course to be your blueprint to success.</strong></strong>  \t\t  \t\t  \t\t\t                                               Upon enrolling, you will get my personal help. I will answer any question that you may have in the member's area, and I also offer Skype support if needed.  \t\t  \t\t  \t\t\t<strong><strong>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk !</strong></strong>  \t\t  \t\t  \t\t\t                                               You can get started right after you have taken my course -That means <strong><em><strong>TODAY!</strong></em></strong>  \t\t  \t\t  \t\t\t                                               This is opportunity knocking on your door. Many have succeeded before, and I have too. With the information contained in this course, you could quit your job in a couple months, if you so desire.  \t\t  \t\t  \t\t\t                                               Click the \"Take This Course\" button now. That's your first step to building a solid online income. Every minute that goes by without action is <strong><strong>one less paycheck</strong></strong>.  \t\t  \t\t  \t\t\t                                               Cheers!  \t\t  \t\t  \t\t\t                                               Howard  \t\t  \t\t</li>  \t</ul>  </ul>", 
    "end_date": null, 
    "title": "Building a List in 30 Days Challenge - 2016 Action Plan!", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357826_f2cf_4.jpg", 
    "course_url": "https://www.udemy.com/build-an-email-listing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T15:37:42Z"
}