{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>CREATE UNLIMITED LISTS. NO SUBSCRIBER LIMIT. NO MONTHLY FEES. INCREASE SALES OVERNIGHT!</strong>  </p>  <p>  \t<em>Get Started In Less Than 10 Minutes!</em>  </p>  <p>  \t                        Email marketing is still one of the most effective ways to generate sales, get new clients, and grow your online business.  </p>  <p>  \t                        As a small business owner, your success relies on maximizing your sales while minimizing your expenses. Email allows you to do both.<br>  \t<br>  \t                        A good email marketing campaign can help you:  </p>  <ul>  \t<li><strong>Increase Your Sales Conversion</strong><br>  \t<p>  \t\t                        Regardless of how good your product or service is, in reality most visitors to your site won&#039;t convert into sales on their first visit.  \t</p>  \t</li>  \t<li><strong>Generate Repeat Sales</strong><br>  \t<p>  \t\t                        Getting new customers is hard work - it&#039;s also really expensive.  A good email marketing campaign will increase the frequency of repeat purchases from your existing customers.  \t</p>  \t</li>  \t<li><strong>Up-sell and Cross-sell Products and Services</strong><br>  \t<p>  \t\t                        &quot;Would you like fries with that?&quot;  This basic technique by itself can easily add an extra 30% to your average order value and is used by almost all major companies online.  \t</p>  \t</li>  \t<li><strong>Gain Valuable Feedback from your Visitors</strong><br>  \t<p>  \t\t                        Email in particular provides your customers with a unique opportunity to give honest feedback. Unlike face-to-face interaction where people can be shy about voicing their true feelings, email allows them to get right to the point.  \t</p>  \t</li>  \t<li><strong>Drive Web Users to Make Offline Purchases </strong><br>  \t<p>  \t\t                        If you run a conventional offline business you can use email marketing to drive foot traffic through your door.  \t</p>  \t</li>  </ul>  <p>  \t<strong>Using Joomla</strong><br>  \t                        Joomla is the most  versatile CMS (content management system) in the world. It allows you to  extend it with amazing extensions suit to fit your needs. This course  teaches you step by step how to integrate email marketing on your  website.  </p>  <p>  \t          This is an introductory course on how to use  Joomla  to create newsletters and build your mailing list. While most  email  marketing services charge you a fee based on the size of your  list, this DOES NOT. You get everything for FREE.  </p>  <p>  \t           You will learn:<br>  </p>  <ul>  \t<li>How to integrate a capture form on your website</li>  \t<li>How to setup a redirect after form submission</li>  \t<li>How to create auto responders with new subscription</li>  \t<li>How to create beautiful email marketing templates</li>  \t<li>How to add the capture form on your article pages</li>  \t<li>How to import existing users into Joomla</li>  \t<li>How to create, edit and send newsletter</li>  \t<li>How to use placeholders to save time</li>  \t<li>How to create multiple email lists</li>  \t<li>How to send multiple newsletters to separate lists</li>  \t<li>How to automate and schedule newsletter release date</li>  \t<li>And many more</li>  </ul>  <p>  \t                        If  you are serious about email marketing (and you should be), then this  course teaches you everything you need to know to get started. PLUS, you don&#039;t have to be any monthly fees.  </p>", 
    "end_date": null, 
    "title": "Build a Massive Mailing List With Joomla - No Monthly Fees", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325036_a9c3_2.jpg", 
    "course_url": "https://www.udemy.com/joomla-emarketing-integrate-email-marketing-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T18:24:40Z"
}