{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The concept of the sales funnel is that you are focusing your energies on bringing people to your website so that you can provide them with some information to gain initial trust.  This being achieved, you try to capture their e-mail addresses thus giving you a way to contact them in return.  Once connected, they can then get to know you over time, begin to trust you further, and then they may buy from you once at least but hopefully more than once.  If they really like you, they will also then begin to help promote or evangelize you to others thus helping you grow your business.<br></p>  <p>In the real world of today, this singular funnel concept depiction does not fully reflect what is now possible on the Internet and how the actual sales funnel concept truly works in implementation.</p>  <p>In this course, I will introduce you to the concept of multiple focal points for online leads capture and numerous sales paths driving to sales down multiple sales channels.  You can have many of them in your online business.  In fact, the more focal points you can create out there, the more sales channels you create, the more your social presence increases online, the more organic search engines such as Google will find you, the more opportunities will arise for you to cross sell, the more contacts with people you will make, the more sales you will obtain and the more revenue you will ultimately generate.  That’s how it really works.  </p>  <p>Through these lectures, you will learn a number of strategies to build your “sales funnels” – plural.  They may have different focal points and different paths to achieving results, but they do all lead to the same point in the end; and that is getting customers to subscribe to you, to then purchase your products and to then become your evangelists helping you to promote your business and products.     </p>  <p>So join me as I show you how you can make money online through the multiple sales funnels you will be creating in your business.</p>", 
    "end_date": null, 
    "title": "Building Successful Online Sales Funnels", 
    "price": "30.00", 
    "instructors": "Dan Grijzenhout", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709314_b5d6_2.jpg", 
    "course_url": "https://www.udemy.com/building-successful-online-sales-funnels/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T05:09:48Z"
}