{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t <em>(Course Updated May 15, 2015)</em><strong></strong></p><p><strong>This course starts where <strong>Part One</strong> left off... You will go behind the curtains of the popular Homestead Sitebuilder software and learn the foundational skills needed to create landing pages, squeeze pages and build a list within your niche.</strong>  </p>  <p>  \t <strong>You will learn how to properly pick your keywords for your web pages, title your pages and create relevant content your customers are searching for. How easy would a product launch be if you already had 1,000 or more die-hard subscribers in your chosen niche?   \t </strong>  </p>  <p>  \t <strong>Build your audience and learn these principles.... your business will soar! The online selling fundamentals taught in this course will help you to convert your visitors into paying customers or clients.  \t </strong></p><p><strong></strong><strong></strong>  </p>    <p>  \t <em><strong>Who is this course for?</strong></em>  </p>  <ol>  \t<li>Small business owners who want to sell more of their products and/or services online</li>  \t<li>Startups - new business owners or those that are thinking of starting a business.</li>  \t<li>Individuals wanting to sell products online</li>  \t<li>Affiliates who want to promote products for profits</li>  \t<li>Aspiring web designers who want a simple solution for building websites.</li>  \t<li>Product creators looking for a simple and flexible website solution for building a list.</li>  \t<li>Smart entrepreneurs who want to build an audience and make more money online.</li>  </ol>  <p>  \t <em><strong>Benefits:</strong></em>  </p>  <ul>  \t<li>You will know how to start building a list online within hours!</li>  </ul>  <ul>  \t<li>Learn to build squeeze pages (lead generators)</li>  </ul>  <ul>  \t<li>Quickly build web pages for OTOs (One Time Offers)</li>  </ul>  <ul>  \t<li>Easily whip together a landing page to sell digital products</li>  </ul>  <ul>  \t<li><em>Learn to Build Quick Video Landing Pages!</em></li>  </ul>  <ul>  \t<li>Learn How to Use An Autoresponder in Conjunction with Your Squeeze Pages</li>  \t<li><strong>Jump-start your online sales</strong> by building an audience that is interested in your products and/or services</li>  </ul>  <p>  \t <em><strong>  \t      Course Structure</strong></em>  </p>  <p>  \t      This course is structured in an easy to follow step by step system with  videos helping you every step of the way. You simply look over the  shoulder of an expert user that has over 10 years of experience and  follow the instructions within the video, audio and/or course documents.  </p>  <p>  \t <em><strong>Why Take This Course</strong></em>  </p>  <p>  \t       If you're ready to move beyond information overload and into <strong>actually making money online</strong>, then <em>this course is a complete no-brainer</em>.  </p>  <p>  \tThis course will  not only save you thousands of dollars and give you complete control over the  creative, business and/or personal direction you want to take with your website, it will also help <strong>you make money online (if that's your desire)</strong>... provided you USE the information. Keep in mind that consistent focused action is required!  </p>", 
    "end_date": null, 
    "title": "Building Websites that Sell with Homestead Sitebuilder Pt.2 ", 
    "price": "20.00", 
    "instructors": "Jake Toney", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135272_d0f7_9.jpg", 
    "course_url": "https://www.udemy.com/the-worlds-easiest-way-to-build-websites-that-sell-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-18T15:59:06Z"
}