{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">If you are a small business owner, marketing manager, marketing consultant, or professional, <u style=\"\">this course may contain information that could radically transform your business and your life</u>.<br style=\"\"></p><p style=\"\">My name is Lea Bailes, and I am excited to share with you some of my marketing secrets and one key strategy developed over years of testing in this course. </p><p style=\"\">If you&#039;re not using Facebook efficiently or not using it at all, you could be missing out on hundreds or even thousands of dollars PER DAY in revenue for your business!</p><p style=\"\">A lot of business owners are turned off by Facebook. This is a huge, costly mistake! </p><p style=\"\">This is exactly why YOU MUST understand how to use Facebook Ads to grow your business before your competition figures it out.</p><p style=\"\">Do you want to know the best part? As a beginner starting out with Facebook Ads, you can see immediate results without spending $10 per day.</p><p style=\"\">That&#039;s right, you DON&#039;T need to spend a big budget to see big results.</p><p style=\"\"><strong style=\"\">Imagine Having a</strong><strong style=\"\"> </strong><strong style=\"\">Roadmap and Strategy for Facebook Ads in Order to Build Your Business Profitably</strong></p><p style=\"\">When I first started using Facebook Ads, I didn&#039;t have a roadmap. I made a ton of mistakes and wasted thousands of dollars. </p><p style=\"\">Over time, I became a student of Facebook ads and started learning what works. I spent hundreds of hours studying and testing what works and what doesn&#039;t. </p><p style=\"\">I was eventually accepted into a program with Facebook where I had one-on-one training with a Facebook Ads trainer who walked me step-by-step through what I needed to do. It took a lot of time to learn what works.</p><p style=\"\">It was a process, but over time sales INCREASED and our costs per lead and cost per acquisition actually DECREASED! This means we were not only to get more impact with our budget, but we were able to strategically raise our budget over time to increase our results.</p><p style=\"\">Basically, we figured out that if we gave Mark Zuckerberg $10, we could get $100 or more in return. Not only would we make money, but we were building customer and an email list for future sales! Not bad, right?! </p><p style=\"\">Would you do the same? Do you want to do the same?</p><p style=\"\">I want to share all of this with you so that you can do the same!</p><p style=\"\">Having this roadmap can save you a ton of time, money and mistakes while providing a plan for building your business. I wish I had one when I first started.</p><p style=\"\">In this course, you&#039;ll learn step-by-step how to use Facebook Ads so that you can start seeing immediate results without having to worry about wasting time or money.</p><p style=\"\">This course is for nearly any business owner, marketing manager, and professional looking to boost their influence, revenue and lead generation. It&#039;s perfect if you are in charge of marketing for a local retail store, ecommerce business, professional office such as doctors, lawyers, real estate agents, insurance agents, etc.  It&#039;s great for people who are looking to market and sell information or physical products online!</p><p style=\"\"><strong style=\"\">In Build Your Empire Using Facebook Ads, You&#039;ll Discover...</strong></p><p style=\"\">What not to do when advertising through Facebook, and the mistakes that you may have been making that resulted in a lack of success.</p><p style=\"\">An overview of the #1 strategy for Facebook ads and how this strategy will work best for your business.</p><p style=\"\">Step-by-step how to setup your Facebook Ads without spending a ton of money.</p><p style=\"\">What ad types you need to be running and why.</p><p style=\"\">What exactly to put in your ads from photos to calls to action that actually drive results.</p><p style=\"\">How to get maximum results while spending the least amount of money possible.</p><p style=\"\">How to use Facebook&#039;s targeting features to ensure your exact target customer is seeing your ad. (Proper targeting is the most important part of your ads and what separates great ads from the rest).</p><p style=\"\">How to test, track, and monitor ad results and how to QUICKLY know if your ads are working.</p><p style=\"\">Exactly how to create your ads most efficiently and the tools you need for easy graphic design to save you a ton of money.</p><p style=\"\">How to generate leads from Facebook and build an email list that you can use to turbocharge your business.</p><p style=\"\">And Don&#039;t Forget...</p><p style=\"\">The course comes with a 30 Day Money-Back Guarantee!</p><p style=\"\">I stand behind my courses.  If this isn&#039;t everything you&#039;d hoped, just ask for a refund. Don&#039;t worry, we&#039;ll part as friends.</p><p style=\"\">See you inside!</p><p style=\"\">To Your Success,</p><p style=\"\"><em style=\"\">Lea Bailes</em></p>", 
    "end_date": null, 
    "title": "Build Your Empire With Facebook Ads:  #1 Strategy You Need", 
    "price": "50.00", 
    "instructors": "Lea Bailes", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427706_f583_3.jpg", 
    "course_url": "https://www.udemy.com/build-your-empire-with-facebook-ads-1-strategy-you-need/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T13:48:41Z"
}