{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<span>Don&#039;t think that this is a low quality course by seeing the price, Teaching is something i love, i don&#039;t want to quote a high price for sharing my knowledge. Start Learning Now!</span>  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\">Using my techniques, you’ll learn how I made $35,000 per year building profitable niche websites.</strong>  </p>  <hr style=\"\">  <p>  \t              I will offer email and Skype support to every student who asks for it. If you have a problem/question, send me a message and I will reply as soon as I can. Facebook group is created to discuss about the course.  </p>  <hr style=\"\">  <p style=\"\">  \t              With the sheer abundance of websites in this day and age, ranking on the front pages of Google is no easy task. <strong style=\"\"><em style=\"\">But by using keyword research methodologies and targeting specific user groups (or “niches”), you will be able to create revenue.</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>  <p style=\"\">  \t                The course will begin by teaching you how to find a proper niche to target and how keyword research plays into the goal of Search Engine Optimization.  </p>  <p style=\"\">  \t                Once we have found a good niche, I will show you how we can design and develop beautiful websites from scratch.  </p>  <p style=\"\">  \t                You will learn :  </p>  <p style=\"\">  \t                »  Finding The Niche To Target  </p>  <p style=\"\">  \t                »  Searching And Finding The Low Competition and High CPC Keywords  </p>  <p style=\"\">  \t                »  Setting Up The Domain , Hosting And Wordpress  </p>  <p style=\"\">  \t                »  Designing A High Quality Niche Website Without Writing A Single Line Of Code  </p>  <p style=\"\">  \t                »  Monetize the niche website with Adsense , Amazon and Clickbank.  </p>  <p style=\"\">  \t                »  Finding the right products for the niche from Amazon and Clickbank.  </p>  <p style=\"\">  \t                »  Placing Google Ads to Get High Conversion  </p>  <p style=\"\">  \t                »  Flipping the niche site for more profits.  </p>  <p style=\"\">  \t                By the end of the course you will have built a professional looking, and profitable niche website!  </p>", 
    "end_date": null, 
    "title": "Build Profitable Wordpress Niche Websites From Scratch", 
    "price": "20.00", 
    "instructors": "Govinda Sunil", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407500_8473_5.jpg", 
    "course_url": "https://www.udemy.com/build-a-niche-site/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-29T05:48:08Z"
}