{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  In this course you learn <strong style=\"\">how to set up your creative business</strong>. No matter what you sell - we cover it all.  </p>  <p>  \t  You learn how to set up your own website, add a store to your site, do the &quot;right&quot; content marketing by adding the content your audience needs, wants and searches for.  </p>  <p>  \t  You learn how to <strong style=\"\">market your creative and digital products</strong> on various sites. Beside that I&#039;ve included a part about pricing your products, content marketing and social media marketing - from Twitter over Facebook to Pinterest. Beside that, even if you just decided you want to become a <strong style=\"\">digital designer</strong> - this course is yours because I have also included a complete guide on Gimp.  </p>  <p>  \t  You learn everything, from the first steps to creating digital items. If you go through this you know at the end how to make a banner and images for your marketing, how to apply and use styles and create various elements and textures.  </p>  <p>  \t  This course is huge because it is meant as a digital, self-paced tutor which guides you from the very beginning to becoming an expert in your niche. <strong style=\"\">There is no behind in this course</strong>, this course will be <strong style=\"\">your companion</strong> answering all your business problems from the very first lesson to doing <strong style=\"\">social media marketing</strong>.  </p>  <p>  \t  If you want to set up your own website you of course need webhosting and domain but beside that all you need to do is installing the free image editing program Gimp.  </p>  <p>  \t  We start with a <strong style=\"\">business foundation</strong>, you learn about the features of a good business name, you learn how to package your products and set up your store and website. We will also include a newsletter on your website and learn why this is important.  </p>  <p>  \t  Then we learn how to create images with Gimp you&#039;ll need for your website.  </p>  <p>  \t  We will close our course by doing content and social media marketing.  </p>  <p>  \tPlease check out the supplementary material section for downloadable resources/PDF.  </p>", 
    "end_date": null, 
    "title": "Business Set Up for Creative Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Monja Wessel", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322150_1d21_4.jpg", 
    "course_url": "https://www.udemy.com/online-business-set-up-for-creative-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T15:29:08Z"
}