{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I have been frustrated in the past because I know I have a good product but I couldn't get the momentum to make enough money to really thrive as a local business.  I know what if feels like to be spinning my wheels and know that something was missing in my plan. BUT I never gave up and then finally... BOOM!  I found the perfect niche in my business and was able to start attracting the right customers at the right time.  I used a few simple (and mostly FREE) techniques to boom my local business and now I am feeling amazing! </p><p>I tried the same techniques on a friends failing business and BOOM, he is killing it now in his local business niche.  He went from getting a few sporadic clients a month to getting several new clients EVERY WEEK!  Now I know that this is absolutely NOT LUCK!  I have a formula and a plan that works and I show you how to duplicate my success in your local area with your niche business! </p><p><span></span><strong>QUESTION?<br></strong>Are you ready to launch your local business to the top of local search results and keep more money in your pocket?  I can help!<br></p><p> The 5 Module Catalyst Marketing Course will take you step-by-step through the most important stages of building a strong online presence for your business and ultimately allow you to rise above your competition, make more money and have the business you have dreamed of.</p><p>First, you ONLY need BASIC internet skills to complete the course and implement my techniques for your business! <em> (Can you click around on Facebook and type a letter in Microsoft Word?  Then you are good to go with Catalyst)</em></p><p><em>If you are already running your own business or are on the verge of launching your very own local business, you can start Catalyst now and you will:</em></p><ol><li>Discover your perfect niche customer</li><li>Define your best selling products or services</li><li>Build and launch your new hybrid blog/web site.<span></span></li><li>Boost your business to the top of google search results (yes you can do this without breaking the bank and I will show you how)</li><li>Set your online marketing on autopilot so you can focus on servicing  your customers and stop worrying about your online stuff. </li><li>Start blogging and adding content to your site that will drive traffic to your business and make you look like the absolute top expert in your field.<span></span></li></ol><p>All of the above will effectively CRUSH your local competition and leave them wandering what the heck you are doing.</p><p>NOTE:  <span></span>You DO NOT need a web designer, web team or anything else like that. You can do all of this yourself and have your site looking and working just the way you want. You can easily update and add to your new business boom site/blog anytime. (That's way better than paying a web firm to make changes to YOUR stuff).</p><p><strong>WHAT YOU GET:</strong></p><ol><li>Step-by-Step online training videos that take you every step of the way through a launch and boost of your own niche blog site.</li><li>Easy action sheets to track your progress and keep you organized throughout the launch process.</li><li>Special lectures to help you understand the WHY of the marketing techniques you are beginning to use. </li><li>Behind the scenes look at two of my successful business boom sites that are producing new customers every week for me and my clients. (You can copy our success with YOUR business... that's why this part is so cool)</li><li>Online support access to me and the other students in the Catalyst course through the online discussion forum.  </li></ol><p><br>If you want to spend LESS MONEY of marketing but be ON TOP when your customers are looking for your product or services, then you need a Catalyst Boom!</p><p><strong>WHO SHOULD TAKE THIS COURSE?</strong></p><ul><li>If you are a small business entrepreneur with a local service or retail business then you should take this course.</li><li>If you are about to start your own business and are not sure how to really market to your niche</li><li>If you are worried about your competitors because they seem to be getting all the business. (uh.... stop them now because they are taking all the money!)</li><li>If you want to grow your business and reach more customers. </li><li>If you have a limited marketing budget but want profitable results.</li><li>If you know well over half of the population finds local business on Google instead of the Yellow Pages but you don't have a strong online site then this is for you! </li><li>If you know you are loosing money every day that you are not on the first page of Google. </li></ul><p><span></span></p><p><strong>BUT WHAT IF YOU ALREADY HAVE A WEB SITE?</strong></p><p><strong></strong>Even if you already have a web site, you need an online boom!  You want you site and content to be coming up at the TOP and driving people to a specific action when they arrive at your site.  Don't worry, you can keep your current site and build and strengthen your online marketing with my Catalyst techniques.<br></p>", 
    "end_date": null, 
    "title": "Catalyst Digital Marketing: How To Boost Your Local Business", 
    "price": "50.00", 
    "instructors": "Teacher Eric Michael Roberts", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620678_1faa_4.jpg", 
    "course_url": "https://www.udemy.com/catalystmarketingcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T20:43:36Z"
}