{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>O E-goi é uma plataforma de <strong>email marketing e marketing automation multicanal</strong> usada por centenas de milhares de empresas em todo o mundo. Este curso destina-se especificamente aos clientes E-goi que também querem ser <strong>Parceiros Comerciais</strong> e vender a plataforma aos seus próprios clientes.</p><p><br><strong>O que é um Parceiro Comercial E-goi?</strong></p><p>Um Parceiro Comercial é um cliente E-goi que:<br></p><ul><li>adora usar o E-goi</li><li>tem a sua própria carteira de clientes ou pacote de soluções de marketing</li><li><span></span>quer vender o E-goi a esses clientes ou incluí-lo no seu pacote de soluções</li></ul><p><br></p>\n<p><strong>Como é que este curso ajuda?</strong><br><br>Com este curso, vai descobrir todas as vantagens do E-goi para Parceiros e as comissões que pode receber por cada venda.<br><br>Verá também alguns recursos essenciais que os Parceiros devem usar para vender E-goi. Vamos mostrar os preços, os níveis de Parceiro, os pontos fortes da plataforma, os comparativos com a concorrência e os argumentários de venda.<br><br>No final do curso, estará na posse de todos os elementos para ser um Parceiro Comercial E-goi e começar a vender a plataforma aos seus próprios clientes.<br><br>Demora só cerca de meia-hora, e cada aula não ultrapassa os 5 minutos. Vamos começar?</p><br>", 
    "end_date": null, 
    "title": "Como ser Parceiro Comercial E-goi e obter certificação", 
    "price": 0, 
    "instructors": "Plataforma E-goi", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/675746_9b5b_2.jpg", 
    "course_url": "https://www.udemy.com/como-ser-parceiro-comercial-e-goi-e-obter-certificacao/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-20T16:43:09Z"
}