{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li>¿Estás creando una app o videojuego para iOS o Android?</li><li>¿Estás siguiendo alguno de mis cursos de desarrollo y tienes muchas ideas para desarrollar?</li><li>¿Has lanzado tal vez ya tu idea y te has encontrado con que solo tienes 3 descargas? La tuya, la de tu pareja, y la de algún usuario perdido por Tumbugtú...</li></ul><p>En este curso no te traigo ninguna idea de desarrollo ni de programación, si no que vamos a destripar el mercado, su realidad, intentar entenderlo y saber qué podemos hacer para que nuestra idea en desarrollo se convierta en una realidad.</p><p><em>Hoy en día hay más de 3 millones de apps para iOS y Android combinadas en las tiendas respectivas, y ese número nos debe hacer sentir como querer escalar el monte Everest con un pico y pala de andar por casa para nosotros, desarrolladores de aplicaciones móviles y videojuegos si lo que queremos es tener éxito.</em></p><p><em>Dentro de esta curso hemos recogido todas las <strong>recomendaciones de marketing</strong> de aplicaciones móviles que yo mismo he utilizado en mis propios lanzamientos y aconsejando a mis propios alumnos de mis cursos de desarrollo. Estas grandes estrategias fortalecerán tu relación con tus futuros usuarios clientes y te servirán para obtener una información muy valiosa para mejorar.</em><br><br></p><p>El curso está estructurado en <strong class=\"redactor-inline-converted\">tres grandes bloques</strong>:</p><ol><li>Qué hacer mientras se finaliza el desarrollo</li><li>Cómo dar a conocer tu producto</li><li>Qué hacer cuando el desarrollo está finalizado y tu producto ya se ha lanzado al mundo</li></ol><p>En solo unas pocas horas, conocerás las técnicas básicas del mundo del marketing de apps y videojuegos para poder ponerlas en práctica y empezar a tener descargas de forma viral gracias a las búsquedas de tu app y al contenido que tus usuarios compartan en sus redes sociales. ¡¡Y lo mejor de todo es que <strong class=\"redactor-inline-converted\">no necesitas conocimientos previos </strong>de marketing online, lo aprenderás aquí todo desde cero!!!</p><p>Una <strong class=\"redactor-inline-converted\">gran estrategia de marketing</strong> puede ayudar a una aplicación medíocre a tener más éxito que una más completa. ¡Así que apúntate y aprende las claves necesarias para transformar tu app o videojuego en un producto rentable!</p>", 
    "end_date": null, 
    "title": "Como promocionar tus apps y videojuegos", 
    "price": "40.00", 
    "instructors": "D. Juan Gabriel Gomila Salas", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822854_bf6a_2.jpg", 
    "course_url": "https://www.udemy.com/como-promocionar-tus-apps-y-videojuegos/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T14:40:44Z"
}