{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Learn how to create landing pages that bring you a ton of customers.</strong></p>\n\n<p>Driving campaign <strong class=\"redactor-inline-converted\">traffic to your main site is a big mistake</strong>. Internet users have an ever-decreasing attention span and you only have one chance and few seconds to make that great first impression and convince your visitors that your product or a service is worth their time and money.</p>\n\n\n\n<p>Many entrepreneurs and marketers make this mistake of directing traffic from marketing campaigns to their main website and <strong class=\"redactor-inline-converted\">they end up losing customers</strong> and <strong class=\"redactor-inline-converted\">paying huge amounts for advertisement</strong>.</p>\n\n\n\n<p>In this course, I will teach you how to be a clever digital marketer and <strong class=\"redactor-inline-converted\">convert your visitors into your customers using landing pages</strong>.</p>\n\n\n\n<p>You will learn <strong class=\"redactor-inline-converted\">secrets and hacks</strong> behind this amazing marketing tool. I will show you lots of examples by other companies — how they made it and how they screwed up.</p>\n\n\n\n<p>In section 4 we <strong class=\"redactor-inline-converted\">will build a landing page together</strong> with an easy-to-use drag-n-drop landing page builder called Instapage.</p>\n\n\n\n<p>Towards the end, I will ask you to <strong class=\"redactor-inline-converted\">submit your landing page to me, which I will review in one of the Bonus Lectures. </strong>This is where I take landing pages made by my students, and review them once a week. I give both design and marketing advice and try to put you on the right path.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Not many Udemy instructors provide feedback</strong> and coursework reviews. But I believe, to learn a skill as quickly as possible, it is important to receive a feedback from the teacher.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Have you heard of A/B testing?</strong> It's this trending marketing practice that can bring amazing results for your landing page. <strong class=\"redactor-inline-converted\">Barack Obama was able to raise extra $60 Million </strong>in campaign donations by using this technique. I will show you how they did it and how you can use the power of A/B testing for your business.</p>\n\n\n\n<p><strong>Take this course</strong> and start creating high-converting landing pages now.</p>", 
    "end_date": null, 
    "title": "Complete Course on Building a Killer Landing Page in 2016", 
    "price": "20.00", 
    "instructors": "Vako Imnaishvili", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831548_8052_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-course-on-building-killer-landing-pages/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T17:58:08Z"
}