{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">This course is designed to help you discover the opportunities content writing provides. Here you learn how to use texts as tools for building trustworthy identity on the growingly interconnected web. The course aims to teach you why and how you should write in an open, engaging and conversational way in order to tap into the full potential of the semantic web.</p>  <p style=\"\">Throughout the lectures you will not learn how to write 99 articles if you have nothing to say. What you will learn is how to write content that enriches the semantic web with meaningful data, new relationships and insights.</p>  <p style=\"\"><strong style=\"\">What will the course cover?</strong></p><p style=\"\">The main goal of this course is to share the vision that <strong style=\"\">content writing is creating a network of texts within a web of people, enabled by machines</strong>.</p>  <p style=\"\">The course introduces the concept of the semantic web and, parallel to walking you through changes in web and search, presents how content writing gradually becomes your way of establishing digital presence. The course will cover the basics of the Semantic Web, the understanding of which will help you use the full potential of content writing in a growingly transparent web.</p>  <p style=\"\"><strong style=\"\">Some of the things you will learn throughout the course:</strong></p><ul style=\"\"><li style=\"\">What is the Semantic Web</li><li style=\"\">How the semantic web changes the way we communicate and collaborate</li><li style=\"\">How texts have changed on the web</li><li style=\"\">How machines “understand&quot; your content</li><li style=\"\">What are the steps for writing content that resonates</li><li style=\"\">What is the rhetorical triangle about and how it fits the interconnectedness on the web</li><li style=\"\">Why you should start building a trusted identity on the web</li><li style=\"\">How to build trustworthy, engageable, discoverable digital presence</li><li style=\"\">How to reach out beyond keywords</li></ul>In a web, where the relationships and the interactions you create are key, your texts are among your most valuable assets. This course teaches you how to create and use content writing to strengthen your online presence.", 
    "end_date": null, 
    "title": "Content Writing in the Semantic Web", 
    "price": "25.00", 
    "instructors": "Teodora Petkova", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460720_c5e2_2.jpg", 
    "course_url": "https://www.udemy.com/content-writing-in-the-semantic-web/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T15:51:28Z"
}