{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tConversion Optimization is about getting more customers &amp; repeat sales from the same online reach. In order to accomplish that every step your potential customer takes towards sales need to be optimized. It starts from users viewing the first communication about your organization and goes up to the stage when they are ready to have sales conversation. This course will give you in-depth understanding of online user behavior. In this course, you will learn the latest persuasive techniques to design online communication to get better results.  </p>  <p>  \tOnline Conversion Optimization might target a number of different aspects of your website. Some of the areas that usually require the maximum attention are:  </p>  <p>  \t1. Clear Call-to-Actions via buttons, links and forms.  </p>  <p>  \t2. Concise custom developed landing pages for PPC optimization.  </p>  <p>  \t3. Improved website copy and overall content structure.  </p>  <p>  \t4. Better usage of imagery and graphic elements.  </p>  <p>  \t5. Easy to find contact information.  </p>  <p>  \t6. Enhanced, intuitive website navigation.  </p>  <p>  \tOverall, in this course you will explore case studies involving significant conversion rate improvements, greater role of conversion optimization in sales, patterns for engaging website visitors and designing user flows to move people from entry points (ads, email, landing page) to goals (sale, lead, trial etc.)<br style=\"\">  \t<br style=\"\">  \tFind more about Digital Marketing courses at <a href=\"http://www.digitalvidya.com\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Digital Vidya</a>.  </p>", 
    "end_date": null, 
    "title": "Conversion Optimization", 
    "price": "50.00", 
    "instructors": "Digital Vidya", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/55205_a068_5.jpg", 
    "course_url": "https://www.udemy.com/conversion-optimization/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-20T04:54:16Z"
}