{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Did You Know That Your Prospects Have Questions In The Back Of Their Minds That Will Never Ask You?</strong></p>  <p><strong>Did You Know That If You Don’t Address These Secret Questions, Your Prospects Will Not Buy From You Even If They Like Your Product?</strong></p>  <p>These “hidden” questions are nothing more than objections your prospects have. Your job as a person who sells products, be they digital or physical, is to kill all these objections!</p>  <p>But how do you kill them, when you don’t know which they are? </p>  <p>Hi, my name is Vladimir Raykov. I’m a best-selling online instructor, teaching over 15000 students from 150 countries and 20 online courses.</p>  <p>In this class, not only will I reveal the secret questions or objections your prospects have but also I will teach you how to eliminate these objections by using proven marketing strategies, tactics and tips.</p>  <p>There isn’t a successful copywriter or marketer who doesn’t address these questions when they write copy!</p>  <p>Honestly, in this very moment you might be missing a lot of sales just because you ignored that small but in the same time crucially important part of your offer and marketing copy in general. </p>  <p>Do not wait a second longer, hit the “Start Learning Now” button and get started today!</p>", 
    "end_date": null, 
    "title": "Copywriting: The Questions Your Prospects Have And Won't Ask", 
    "price": 0, 
    "instructors": "Vladimir Raykov", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782958_7c56_2.jpg", 
    "course_url": "https://www.udemy.com/copywriting-the-questions-your-prospects-have-and-wont-ask/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T10:05:47Z"
}