{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">----Introductory Price ONLY---</strong></p>  <p style=\"\">  \t<strong style=\"\">Over $3 Million Dollars of Results from Our Copy Including Copy Personally Written or Managed via Outsourcing for 8x $100,000+ Products  \t</strong>  </p>  <p style=\"\">  \t          Want to write ninja copy resulting in $85,767 of sales? The art of copywriting takes time but the secret psychological tricks can be learned quickly - copy are the words on a salespage, leadpage, blog, email or even a webinar - that influence the reader to take action or buy.  </p>  <p style=\"\">  \t<strong style=\"\">Guarantee:</strong> By the end of this course you'll be able to write copy for yourself that results in $3 EPCs or sell copy as a service for $1,000+.  </p>  <p style=\"\">  \t<strong style=\"\">Who is the DigiStrats Team?</strong>  </p>  <p style=\"\">  \t          DigiStrats has been involved with 49 product launches, 8 of which have grossed over $100,000. We have wrote the copy that sells, outsourced copy and taught students to write copy. Copywriting is the most critical skill of your life because it not only commands people to buy but every single moment you use copy to sell ideas when influencing co-workers, friends or even family with your carefully chosen words. It's not what you say but how you say it.  </p>  <p style=\"\">  \t          When strategizing the $85,767 launch, we carefully chose each and every word resulting in super high conversions and $14.03 EPCs - meaning each human visitor was worth over $14 on average.  </p>  <p style=\"\">  \t          In this 3-Day Course I'm going to take you from novice to charging upwards to $2,000 to $5,000 for sales copy.  </p>  <p style=\"\">  \t          We'll pull the cape off secret tactics that can be used to malevolently manipulate customers AND by buying the course you agree to only wield this influencing superpower for good.  </p>  <p style=\"\">  \t          You'll learn the following ninja copywriting secrets:  </p>  <p style=\"\">  \t          -Our foundational <strong style=\"\">Cornerstone Copy Cube Framework</strong>  </p>  <p style=\"\">  \t          -Our <strong style=\"\">10-Step Copy Alchemy Transmutation System</strong> that turns weak copy into a $5+ EPC sales funnel  </p>  <p style=\"\">  \t          -Practical applications of copy to <strong style=\"\">webinars, email marketing and JV pages </strong>  </p>  <p style=\"\">  \t          We'll even build out a high-converting salespage live during the course and by the end you'll even have completed your first sales copy.  </p>  <p style=\"\">  \t          Plus you'll get <strong style=\"\">3 Bonuses</strong>…  </p>  <p style=\"\">  \t<strong style=\"\">-Bonus #1:</strong> The <strong style=\"\">$85,767 Salespage \"Fill-in-the-Blank\" Copy Template</strong>  </p>  <p style=\"\">  \t<strong style=\"\">-Bonus #2:</strong> Our <strong style=\"\">Udemy \"Fill-in-the-Blank\" Copy Template</strong> to write sales copy for your Udemy course in minutes  </p>  <p style=\"\">  \t<strong style=\"\">-Bonus #3:</strong> Our <strong style=\"\">Done-for-You Salespage</strong> - an actual salespage both in HTML and as a Leadpages template so you can just throw in your copy and have our exact hot looking high-converting salespage  </p>  <p style=\"\">  \t<strong style=\"\">The Better than Money Back Guarantee</strong>  </p>  <p style=\"\">  \t          One tenant of good copy is throwing weak 30-day money back guarantees out the window so we're giving you a <strong style=\"\">double your money back guarantee</strong>. Take action, get in our Private Facebook mastermind and if you don't succeed I'm going to give you double the money out of my own pocket.</p>  <p style=\"\">  \t<strong style=\"\">Special Introductory Price - Rising Soon</strong>  </p>  <p style=\"\">  \t          Even though we've done over $3 million in sales (closer to $4 million now) and we normally charge $497, $697 and $997 for our life changing courses, we will keep this introductory price before raising it as a special for the Udemy community.  </p>  <p style=\"\">  \t<strong style=\"\">Take Action &amp; Enroll</strong>  </p>  <p style=\"\">  \t          Enroll now, make the commitment and jump straight into the course right now. I know this course will revolutionize the way you do business and write copy.  </p>  <p style=\"\">  \t          See you on the inside and check out the preview videos to see what value you'll be getting!  </p>  <p style=\"\">  \t          Talk soon,  </p>  <p style=\"\">  \t          Eric  </p>", 
    "end_date": null, 
    "title": "Copy Alchemy: Sales Copywriting Blueprint", 
    "price": "40.00", 
    "instructors": "Digi Strats", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415024_05cf.jpg", 
    "course_url": "https://www.udemy.com/copy-alchemy-sales-copywriting-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T14:00:22Z"
}