{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is suitable for anyone who needs to quickly crank out a squeeze page or opt-in landing page without starting from scratch or hiring an expensive web designer.</p><p>With it you'll get my squeeze page framework which I've called Primed.</p><p>Firstly I'll talk about the components that make up a squeeze page. I'll explain in detail how you entice visitor's to give you what you want before they leave the page and how you make this all work technically without having to install any software on your server.</p><p>Following on from that I'll explain the key benefits to building an email list and divulge some of the ethical tricks and design tweaks you can employ to help your squeeze pages turn visitors into subscribers to your email list. I'll go into detail about what a conversion rate is, how to calculate yours and what kind of rate you should aim for.</p><p>Next up we'll concentrate on the squeeze page template you get free with this course.</p><p>I'll explain every feature of this framework in a step by step fashion - from changing colors to adding video to the page. You'll see just how easy this template is to customize without you needing to have detailed knowledge of HTML, CSS or Javascript. I'll even show you how to integrate the page with an autoresponder service such as GetResponse.</p><p>If you are a web designer (at any level) then you can take this framework and hack it to suit your needs. For beginners and non-web coders by the end of this course you can have a beautiful fully functional squeeze page that is ready to upload to your web server.</p>", 
    "end_date": null, 
    "title": "Crank Out High Converting Squeeze Pages In Record Time", 
    "price": "20.00", 
    "instructors": "Andrew Thompson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558288_3906.jpg", 
    "course_url": "https://www.udemy.com/crank-out-high-converting-squeeze-pages-in-record-time/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-18T21:42:27Z"
}