{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t This course is for those who want to create their own professional looking forum. Sure there are many options out there, but I will show you one of the cheapest ways that you can do it without compromising nor on the functionality but also on the design of your forum.  </p>  <p style=\"\">  \t You have all sorts of companies that charge you tons of money for setting it up, hosting it, maintaining it, etc., but with some knowledge you can do this on your own without the need of coding, or getting too much into the technical aspect.  </p>  <p style=\"\">  \t Your forum will run like any other professional forums and offer functionalities such as:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">User registration and management.</strong></li>  \t<li style=\"\"><strong style=\"\">Posting of categories and different forums.</strong></li>  \t<li style=\"\"><strong style=\"\">Managing posts and moderating them in case needed.</strong></li>  \t<li style=\"\"><strong style=\"\">Notification system.</strong></li>  \t<li style=\"\"><strong style=\"\">Spam protection.</strong></li>  \t<li style=\"\"><strong style=\"\">...and many more!</strong></li>  </ul>  <p style=\"\">  \t We will start from scratch and I will assume that you have no or limited knowledge in technology, hosting, etc. You do not need to know HTML, PHP or anything else since the solution that I will show you is pretty &quot;plug-n-play&quot;.  </p>  <p style=\"\">  \t Once your forum is live, you will then be able to release it to the public so that they can start using it. You can also add other moderators if you wish, that will be able to moderate posts, delete, etc.  </p>  <p style=\"\">  \t The course takes place in 3 sections and I have made it as comprehensive as possible so that in a few minutes (or maximum a couple of hours) you can do exactly what I showed you and start your forum!  </p>  <p style=\"\">  \t Since this is going to be your own hosted blog, you will need to have a server available and preferably a virtual dedicated one, however this can also work on a shared hosting environment. It all depends on your traffic and requirements, but I will assume that you have the basic one, which is a shared hosting environment.  </p>  <p style=\"\">  \t So let&#039;s start the course!  </p>", 
    "end_date": null, 
    "title": "Create Your Own Hosted Professional Forum in 35 minutes!", 
    "price": "20.00", 
    "instructors": "Antonis Anastassiades", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249380_c1bf_2.jpg", 
    "course_url": "https://www.udemy.com/create-your-own-hosted-professional-forum/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T12:49:27Z"
}