{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Want to attract new customers and drive more sales? Learn how to create killer landing pages without coding — the ultimate landing page course, by GetResponse and Peep Laja, entrepreneur and conversion optimization expert.</strong></p><p style=\"\">If you&#039;re directing clicks to your home page, you&#039;re missing out on opportunities. An <strong style=\"\">optimized landing page can</strong> <strong style=\"\">generate 47% more sales</strong> than a typical home page. </p><p style=\"\">After taking this course, you&#039;ll know how to design landing pages for sales, opt-ins, thank-you confirmations, and webinars — web pages that get visitors to take action NOW. We&#039;ll cover everything from creating an irresistible lead magnet to landing page anatomy, from integrated web forms to embedded video. And on top of that you&#039;ll learn how to avoid top 20 landing page mistakes.</p><p style=\"\"><strong style=\"\">OK, what if you&#039;re not a designer or a programmer? </strong>Inside <strong style=\"\">GetResponse Landing Page Creator</strong>, you&#039;ll find a complete suite of tools for designing top-notch landing pages in minutes. To try our smart, simple drag-and-drop editor, <strong style=\"\">grab a 30-day free trial</strong>. </p><p style=\"\">Whether you&#039;re a newbie or an experienced online marketer, you&#039;ll find actionable insights on how to:</p> <ul style=\"\"><li style=\"\">Design landing pages that crush your sales goals</li> <li style=\"\">Generate web forms to build your marketing list fast</li> <li style=\"\">Create an irresistible lead magnet to attract ideal subscribers</li> <li style=\"\">Add images and videos that capture attention and get action</li> <li style=\"\">Write persuasive landing page copy that converts like crazy</li><li style=\"\">Avoid top 20 landing page mistakes </li></ul>", 
    "end_date": null, 
    "title": "Create Landing Pages that Convert — No Coding", 
    "price": 0, 
    "instructors": "GetResponse University", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478000_db57.jpg", 
    "course_url": "https://www.udemy.com/create-landing-pages-that-convert/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T13:26:47Z"
}