{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">El curso profesional de Email marketing con Mailchimp esta diseñado para los emprendedores e inquietos con todo tipo de conocimientos que buscan usar el email como una estrategia innovadora para mejorar sus ventas, mostrarse a sus clientes con una mejor imagen y mantener una relación mas cercana con sus usuarios.   </p><p style=\"\">En este curso aprenderás desde cero a crear un diseño/Boletin de email personalizado con el nombre de tu cliente o usuario que cautive y genere conversiones (ventas).</p><p style=\"\">Crearas emails funcionales que tus clientes podrán consultar en todos los dispositivos (celular, tableta y computador de escritorio) Boletines responsive. </p><p style=\"\">Aprenderás a crear una lista organizada de correos según categorías, tipos de productos o perfil de usuario, también  aprenderas a  capturar correos usando tu pagina web, email o facebook. </p><p style=\"\">Como si fuera poco analizaremos que porcentaje de usuarios abren los correos, cuantas veces o donde hacen clic.</p><p style=\"\">Podrás enviar correos hasta 2000 usuarios en un solo instante con la versión free. </p><p style=\"\">Sabes que es inbound y outbound marketing? Sabes si en verdad tu usuario mira tus correos electrónicos?  esto y mucho mas veremos en este magnifico curso.  </p>", 
    "end_date": null, 
    "title": "Curso de Email y estrategias de Marketing con Mailchimp", 
    "price": "20.00", 
    "instructors": "Camilo Barbosa TV", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517536_ea48_2.jpg", 
    "course_url": "https://www.udemy.com/curso-de-email-y-estrategias-de-marketing-con-mailchimp/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T22:47:57Z"
}