{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tDigital marketing is marketing that makes use of electronic devices (computers) such as personal computers, smartphones, cellphones, tablets and game consoles to engage with stakeholders.  </p>  <p style=\"\">  \tDigital marketing applies technologies or platforms such as websites, e-mail, apps (classic and mobile) and social networks. Social Media Marketing is a component of digital marketing.  </p>  <p style=\"\">  \t This Course introduces students to different digital marketing possibilities.  </p>  <p style=\"\">  \t Students are able to decide on different types of digital marketing campaigns and manage those accordingly in both consumer and business markets.  </p>  <p style=\"\">  \t Different types of operationalization&#039;s of digital marketing are introduced.  </p>  <p style=\"\">  \t Course creates basic understanding of internet and mobile marketing. Time is also devoted to pertinent issues in the web 2.0 e.g. social media, UGC, communities, virtual worlds, blogs and viral marketing.  </p>  <p style=\"\">  \t Digital marketing aims at creating, demonstrating, documenting, communicating and delivering value in digitized way to customers (B2C and B2B) and for managing customer relationships in ways that enhance digital joint value creation of customers, organizations and stakeholders (Journal of Digital Marketing Professor Salo established the journal and was the first editor)  </p>  <p style=\"\">  \t <strong style=\"\">Why Digital Marketing?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Even professional buyers have used and are using digital tools e.g. social media in their daily job even more than the sellers (see Davis 2008).</li>  \t<li style=\"\">65 % out of 1000 buyers operating in B2B markets tell that they start search process (new, rebuy, modified buy) with general search engines and after that move to industry specific search engines like business.com</li>  \t<li style=\"\">Company websites are becoming even more important sources of information for buyers but only when time for closing deals comes apparent (Davis 2008b).</li>  </ul>", 
    "end_date": null, 
    "title": "Digital Marketing", 
    "price": "50.00", 
    "instructors": "DLP India", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/202958_c700_5.jpg", 
    "course_url": "https://www.udemy.com/digital-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-22T05:17:16Z"
}