{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>THE ULTIMATE BEGINNERS GUIDE TO DIGITAL STRATEGIES UPLOADED TO UDEMY</strong></p><p><strong>The course is fully updated for March 2016.</strong><br></p><p>Are you ready to get more sales using a Sales Funnel, Social Media Marketing, and Affiliate Marketing Strategies?</p><p><strong>Are you ready to build a sales funnel? connections with customers on social media? and affliate marketers to sell your products?</strong></p><p>Enroll in the latest digitial marketing course with UNLIMITED &amp; LIFETIME access you will learn how to drive sales, attract new customers and master social media (the right way).</p><p><em><strong>UDEMY'S FULL 30 DAY MONEY BACK GUARANTEE.</strong></em></p><p>Social media sites such as Facebook, Instagram, Twitter, LinkedIn, Youtube, Pinterest, Periscope, Blab, and Google+ all have thousands of customers waiting for you.</p><p>Those customers will be lead to your website, that will be setup with a sales funnel, which means customers will be spending more money with you.</p><p>And, you'll have affiliate marketers selling your products and sales funnels.</p><p>This course is the ultimate beginners guide into sales funnels, social media marketing, and affiliate marketing, brand new for December 2015.</p><p><strong>What does this course give you?</strong></p><ul><li>Social Funnel Strategies</li><li>Social Media Strategy and Best Practices</li><li>Facebook, Instagram, Pinterest, LinkedIn, YouTube, Twitter, Google+, Periscope, Blab</li><li>Social Media Automation</li><li>Working with Affiliate Marketers</li></ul><p><strong>The key is to create a brand that is consistent across all channels.</strong></p><p><strong>Certificate of completion</strong></p><p>All students who complete this course will receive a FREE digital 'Certificate of digital marketing strategies' issued by Skillhance &amp; Matt Bernstein, alongside Udemy's own certificate of completion.</p><p><strong>DON'T FORGET: Udemy operates a 30 day full money back guarantee, no questions asked! If you're not happy with this course you can request your money back.</strong></p><p>Click the <strong>\"Take This Course\"</strong> button straight away at the top right of this page because every second you delay is costing you money.</p>", 
    "end_date": null, 
    "title": "Digital Marketing Strategies for Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Skillhance, LLC, Matt Bernstein", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693290_6f91_5.jpg", 
    "course_url": "https://www.udemy.com/digital-marketing-strategies-for-entrepreneurship/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T18:34:54Z"
}