{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you know that most of the online marketing tools that we use have a BIG disadvantage?! Yes, a BIG disadvantage, the fact that they don't offer us the possiblity to have real time interraction with our audience.</p><p><strong><em>Webinars are one of the few online marketing methods that allow you to have REAL TIME COMMUNICATION with your audience</em></strong>, build credibility and authority and ultimatly drive more sales in profits in your business.</p><p><strong>Why do you think that more than 65% of BIG companies world wide run at least one Webinare per month?</strong></p><p>Right now <strong><em>Webinars are probably THE MOST HIGH CONVERTING TOOL online</em></strong> for driving sales. Videos, Emails, Articles still work very well but it's very unlikly to bring high ticket sales of up 5000$ like Webinars do.</p><p>So, if you are not using Webinars yet in your business you are living a lot of money on the table.<strong><em> But hey, that's why we are here, to help you start using Webinars for your business.</em></strong></p><p><strong>So, in this course you will learn:</strong></p><ul><li><strong>WHY you need to use Webinars in your Business</strong></li><li><strong>The TIPS and PRINCIPLES for creating HIGH QUALITY WEBINARS</strong></li><li><strong>How to PREAPRE your AUDIENCE for a Webinar</strong></li><li><strong>How to create AMAZING FREE ONE PAGE WEBINARS of your own</strong></li><li><strong>How to use Webinars in your business.</strong></li><li><strong>How to SELL with Webinars</strong></li></ul><p><strong>and much more!</strong></p><p><strong><em>Other Benefits</em></strong></p><ul><li><strong>Lifetime Access to all other updates!</strong></li><li><strong>Surprise Bonuses!</strong></li><li><strong>New Methods and Systems introduced in the course!</strong></li><li><strong>FULL Support through the discussion area of the course!</strong></li><li><strong>30 Day Money Back GUARANTEE if you feel this course didn't help you at all and you can't apply anything...that is how dedicated we are to your success!</strong></li></ul><p><strong><em><br></em></strong></p><p><strong><em>Time To Take ACTION!</em></strong></p><p>So, what are you waiting for? Click the \"take this course\" button, top right, now...every day and hour you delay means leaving money on the table in your Business. </p><p><strong>Enroll now and let's start rocking this business!</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Digital Marketing - How to use Webinars for your Business", 
    "price": "20.00", 
    "instructors": "Sorin Constantin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/797898_9121_3.jpg", 
    "course_url": "https://www.udemy.com/digital-marketing-how-to-use-webinars-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-19T11:54:51Z"
}