{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>UPDATE</em></strong>: <em>Now 1,000 students in the first month! Thank you so much everyone, this is amazing! Here's to the next thousand!</em></p>\n\n<p>For years now I've worked on a number of major advertisers, mainly out of NYC based ad agencies. These advertisers are both national and international brands ranging from entertainment, fashion, liquor, government agencies and more. </p>\n\n<p>To successfully create and manage digital advertising campaigns on that scale you need to understand not just the basic advertising principles you learn in school, but fully understand the ever changing digital advertising eco-system. </p>\n\n<p>This course will teach you everything you need to know to get a job in advertising, run a successful campaign, grow your current business or find new ways to increase your personal value at your current job.</p>\n\n<p>As always there is a 30 Day Money Back Guarantee, so you have nothing to lose and so much to gain!</p>\n\n<p><strong>Overview</strong>: This course is designed as an introduction to the world of digital and online advertising. In it we'll cover all the different types of digital ad unit, advertising partners, process, buying and more. It is perfect for anyone who is interested in advertising their business online, looking for a job in digital media planning, wondering how major brands decide to place an ad online, a student focusing on marketing and advertising, or those who are generally interested in how the ads you see online are created and served to you.</p>\n\n<p>Course Subjects:</p>\n\n<ol><li><strong>Intro</strong>: What is digital advertising? (Banner ads, video ads, social media, audio, rich media, takeovers, the IAB, etc.)</li><li><strong>The Digital Ecosystem</strong>: What are the different types of digital advertising vendors? (Publishers, exchange, network, DSP, etc.)</li><li><strong>Buying the Ads</strong>: What are the different types of buying models and the advantages of each? (CPM, CPC, GRPs, etc)</li><li><strong>Ad Targeting</strong>: How does targeting work and how is the data collected? Why does one person get an ad and not another? (Cookie data, PII, registration data, IP address, DMPs)</li><li><strong>Ad Serving</strong>: How is the ad actually served to a user? (Ad servers, their purpose and how they function)</li><li><strong>Reporting</strong>: What do advertisers look for and what do they measure? (Setting KPIs and pulling/formatting reports)</li></ol>", 
    "end_date": null, 
    "title": "Digital Advertising & Marketing 101: Take The Complete Guide", 
    "price": "50.00", 
    "instructors": "Ben Silverstein", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/488130_e202_8.jpg", 
    "course_url": "https://www.udemy.com/digital-advertising-marketing-101/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-28T02:33:10Z"
}