{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>We live in a time when using digital marketing is a bit like trying to hop on a fast moving train … even if you manage to time your jump perfectly and make it on, you will very quickly realize you have no idea where you’re going.</em></p><p>Building a great digital strategy can have a big benefit for your brand, but how can you learn to do it in the most effective way?  In this course from the highly rated new <strong><em>Influential Marketer Series </em></strong>developed exclusively. you will go inside the world of digital marketing to learn how all the pieces fit together and what you really need to ensure success and avoid predictable failure.<br></p><p>This course will teach you:<br></p><ul><li>What digital marketing really is (without the usual buzzwords) and how the pieces fit together.</li><li>How to justify and measure the real business value of your digital efforts.</li><li>Why “conversation” is overrated and how great strategy can take you beyond the hype.</li><li>How to build a powerful strategy that helps you decide what to do and what to avoid.</li><li>Tips and techniques for involving your “reluctant experts” in creating content.</li><li>How to engage influencers and communities in your marketing efforts</li><li>How to build a great content marketing program, with tips, tricks and tools</li><li>How to grow, hire or outsource a scalable team to grow your efforts.</li><li>How to measure your results and relate the back to business value drivers</li></ul><p>And these are just a few of the techniques and topics that will be covered over the span of eight customized classes (and over 6 hours of lessons on demand) that are sure to focus on the most useful topics you need to get started on building your digital strategy right away.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Digital Marketing Strategy To Generate Revenue On Demand", 
    "price": "20.00", 
    "instructors": "Rohit Bhargava", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/846146_e8f3_6.jpg", 
    "course_url": "https://www.udemy.com/digital-marketing-strategy-to-make-money-on-demand/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-11T14:53:35Z"
}