{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The DMD [Digital Marketing Diploma] is designed to offer a series of modules and courses, each one is one step forward in the roadmap to your ultimate successful online business. You will be able to excel with your clients as an online advertising and marketing agency or consultant. <br></p><p>Through out this course I will teach you what it takes to master digital marketing to make real success online. which is inevitable to any business or market nowadays.</p><p>Whether you are taking this course to serve your online personal or corporate business, or getting on the professional career of digital marketing and may be establishing your own agency, this is exactly what you need, to get your self on a solid ground with an end to end knowledge and hands on experience.</p><p>over the course, you will learn how to manage all your digital assets and make them work together.</p><ul><li>Each section is a complete crashed course by itself.</li><li>you will start seeing real results early on in the course.</li><li>We will start light, with digital marketing fundamentals, to make sure that all concepts are properly digested and that we are all on the same page</li><li>then we will get in to complex stuff. in some lecture we will get our hands into some code and others into strategic marketing planning </li><li>you will be able to optimise your site for search engines, even if it is a complete new site</li><li>you will create your business entity on Facebook and optimise it for organic reach and growth </li><li>you will master Facebook ads, and get actual conversions even for the lowest budget spent.</li><li>In the advertising section, you will learn how to advertise and plan and deploy your marketing plan the way agencies do, </li><li>starting with a cold targeting campaign all the way to engagement and retargeting complex techniques</li><li>you will be able to drive actual conversions using Facebook leads tools</li><li>you will master advertising on instagram and convert real leads from the platform.</li><li>A whole complete section or rather a course on youtube video marketing creating, optimising and monetising your videos in a lucrative manner without even filming a single shot. This is how video marketers make serious money from youtube </li><li>In the content marketing section, you will be able to not only market, but also create content that goes viral and drive massive traffic to your site or product.</li><li>in the last two section, after getting the science, the how and the hands on experience, we will get into the strategy planning for conversion, </li><li>we will start with the end results and optimise our marketing plan to get to such results. </li><li>you learn how to prepare the plan, measure the results and pin point the missing squares to tweak and optimise the plan further to reach your goal.</li><li>the last section we will focus on working as an advertising agency or marketing consultant.</li><li>While the course content is not that kind of material that you may consume in a couple of days, it is well put in a way that works on a learning curve to take you from the ground up to the top floor.</li></ul><p>You will get my full support through the discussions and the messages and we will have frequent office hours every now and then for one to one support</p><p>So enroll in the course now and let’s get started </p><p><br></p>", 
    "end_date": null, 
    "title": "Digital Marketing Diploma to 6 Figures /mo |Online Marketing", 
    "price": "20.00", 
    "instructors": "M. Mawy", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618014_f6d5_5.jpg", 
    "course_url": "https://www.udemy.com/digital-marketing-diploma/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T11:34:17Z"
}