{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">Boost your income, save time with video production and wow your audiences.</strong></p><p><strong style=\"\">Within this course we show you how to make a video in under 5 minutes, and walk you through the creation process used for this course promo video.</strong></p><p><strong style=\"\">We show you how easy it is to create amazing videos, which have no limitations, no watermarks and can be sold to clients.  Making videos is a great way to earn extra income and VideomakerFX is the perfect software to accomplish this.</strong></p><p>Never before has it been this easy to create incredible videos in minutes that can help you sell products or services.  Promote affiliate offers to make income.  Sell videos to others for extra income.  Did you know that it only takes minutes to create a captivating video that can engage your audience and drive traffic to your products.</p><p>Videos are the MOST effective way to transmit information online.   They engage audiences and drive traffic.   The biggest problem is that in the past is the amount of time it takes to create high quality videos.</p><p>We show you how with just a simple idea you can bring it to life with an amazing high quality video. You can make whiteboard videos, animated videos, explainer videos, presentations, logo openers, photo slideshows, kinetic typography videos and so much more...</p><p>Create videos</p><ul style=\"\"><li>YouTube</li><li>business presentations</li><li>video marketing</li><li>Earn extra income</li></ul><p>Incredibly Easy Customization Options with limitless possibles, everything is there out of the box.  We show you in this course how EASY it is to make these videos.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Easy Video Creation For Marketers and Businesses", 
    "price": 0, 
    "instructors": "Laurence Svekis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604294_acb5_3.jpg", 
    "course_url": "https://www.udemy.com/easy-video-creation-for-marketers-and-businesses/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T22:46:39Z"
}