{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Einen eignen Online-Shop richtig planen</strong></p><p>Der Kurs richtet sich an alle die bereits echte Waren bei eBay oder Amazon verkaufen und mit dem Gedanken spielen oder den Plan haben, einen Shop als Ergänzung oder Alternative zu starten.</p><p>Am Ende meines Kurses werden Sie in der Lage sein… </p><ul><li>Die Grundlagen zum Betrieb eines eigenen Online-Shops zu verstehen. </li><li>Die Unterschiede im Verkauf auf Portalen wie eBay und Amazon auf der einen und einem eigenen Online-Shop auf der anderen Seite, im Detail zu verstehen.</li><li>Mit wenig bis gar keinem Werbebudget einen eigenen Onlineshop vom ersten Tag an und darüber hinaus, laufend mit vielen Interessenten/Kunden zu versorgen.</li><li>Zu wissen, wie man bei einem eigenen Shop die Marketingfunktionen wie sie großen Portale  einsetzen, günstiger und eigenverantwortlich nutzt.</li></ul><p>Egal ob Sie nun eine Alternative suchen oder Ihre Verkäufe auf eBay oder Amazon ergänzen wollen, es gibt einiges, was im eigen Shop anders läuft. Vieles muss berücksichtigt werden, was bisher kein Thema oder nicht notwendig war. </p><p>Als Verkäufer bei Amazon oder eBay Powerseller wünscht man sich oft mal entspanntere Kunden. Dabei sind es die Systeme und Auflagen für Versand und Bewertung, die vielen Händlern das Leben schwer machen. </p><p>Egal ob bei den Bewertungen oder beim Versand, meine Kunden berichten immer wieder davon, dass im eigenen Online-Shop die Kunden wesentlich entspannter sind. Außerdem liegt der durchschnittliche Warenkorb im Shop deutlich über den in den Portalen! Selbstverständlich müssen Sie im eigenen Shop auch alle Kunden bestmöglich zufrieden stellen. Aber wenn mal etwas nicht so läuft wie es sollte, können Sie das mit Ihrem Kunden regeln, ohne das gleich ein \"Fall\" eröffnet wird.  </p><p>Das sind die Hauptgründe warum viele Online-Händler einen eigenen Shop starten wollen. </p><p>Die Gründe <em>warum das oft nicht funktioniert </em>sind immer ähnlich</p><ul><li>Falsche Software</li><li>Fehleinschätzung der Leistungen von Verkäuferportalen</li><li>Zielgruppe zu undefiniert</li><li>Produktpositionierung zu undeutlich</li></ul><p>All das lernen Sie mit diesem Kurs zu vermeiden!<br><strong><em>Kaufen Sie sich deshalb jetzt die Erfahrung vor dem Start Ihres Shops!</em></strong><br>So vermeiden Sie diese auf teure langwierige und umständliche Art, schmerzhaft selbst machen zu müssen. </p>", 
    "end_date": null, 
    "title": "eCommerce Profi - als Powerseller eigenen Onlineshop planen", 
    "price": "25.00", 
    "instructors": "Gerald Rusche", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677184_7f14_7.jpg", 
    "course_url": "https://www.udemy.com/ecommerce-profi-als-powerseller-eigenen-onlineshop-planen/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-22T11:19:23Z"
}