{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Build Your Email List and Attract Your First 1,000 Email Subscribers in Just 30 Days!</strong>  </p>  <p>  \t  Hi there, I&#039;m Tom Corson-Knowles, #1 bestselling author of more than 20 books including <em style=\"\">Email Marketing Mastery</em> and <em style=\"\">The Kindle Publishing Bible</em>. I want to show you how I built an email list of more than 10,000 loyal subscribers.  </p>  <p>  \t  But, even more importantly, I want to show you how to build a sustainable, profitable online business that brings in consistent monthly income. Over the past 10 years of building online businesses, I&#039;ve sold millions of dollars of products and services online and learned a thing or two about marketing and building a <em style=\"\">seriously profitable online business.</em>  </p>  <p>  \t<strong style=\"\">  This course if for you if you&#039;re looking to grow your business using email marketing.  </strong>  </p>  <p>  \t    Whether you&#039;re a complete newbie to email marketing or you&#039;ve been marketing for years, this course will help you get your email marketing systems set up properly.  </p>  <p>  \t    Here&#039;s what you&#039;ll learn in this email marketing course:  </p>  <ul style=\"\">  \t<li>What an Autoresponder is and why you MUST have one to avoid legal problems and wasted time</li>  \t<li>How to set up your Autoresponder properly to maximize sales and follow CAN-SPAM laws</li>  \t<li>How to write emails that make your audience like you, trust you and buy from you</li>  \t<li>How to get started with email marketing for free if you have no budget</li>  \t<li>and much more!</li>  </ul>  <p>  \t<strong style=\"\">Common Questions</strong>  </p>  <p>  \t<strong style=\"\">What if I don&#039;t have a product or service to sell?</strong>  </p>  <p>  \t  If you don&#039;t have a product or service to sell yet, don&#039;t worry! It&#039;s never too late or too early to start building your email list. The average prospective customer takes 7 &quot;contact points&quot; or messages to convert into a paying customer.  </p>  <p>  \t  You can start building up &quot;points&quot; with your audience by adding value and helping them before you ever even have a product or service to offer.  </p>  <p>  \t  By adding value and creating relationships first, when you do launch your first product or service, you&#039;ll already have a loyal following who will gladly buy from you and tell their friends about your business!  </p>  <p>  \t<strong style=\"\">What if I I&#039;m slow with technology and have no idea how to use HTML or code?</strong>  </p>  <p>  \t  That&#039;s perfect! This course was designed for beginners and advanced email marketers alike. If you have no experience and are slow with technology, start off with Lecture 3 where I explain in detail everything you need to know to get started.  </p>  <p>  \t  Then, all you have to do is follow my step-by-step video tutorial trainings to build your email list and get started.  </p>  <p>  \t<strong style=\"\">If you&#039;re ready to build your email list to 1,000 subscribers and more and take your online success to a whole new  level, just scroll up  and click &quot;Take This Course&quot; now!</strong>  </p>  <p>  \t            You can  start watching the video training right away and have your email list set up and ready to go in an hour.  </p>  <p>  \t            Here&#039;s to your success,  </p>  <p>  \t            Tom Corson-Knowles  </p>", 
    "end_date": null, 
    "title": "Email Marketing Made Easy: How to Build an Email List Fast", 
    "price": "35.00", 
    "instructors": "Tom Corson-Knowles", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333074_3847_3.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T22:54:31Z"
}