{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><p style=\"\">This course  takes you step by step through the process of developing an email marketing  plan for your business or organization.</p>    <p style=\"\"><strong style=\"\">OUTCOMES</strong> - Once you have completed the  email marketing training course and answered the questions, your responses to  the questions can serve two purposes;</p>    <p style=\"\">1&nbsp; Assist you  to implement a successful email marketing plan yourself or,</p>    <p style=\"\">2&nbsp; Become a detailed  brief that will enable you to get a quote for your email marketing.</p>    <p style=\"\"><strong style=\"\">MATERIALS</strong> - This email marketing training  course consists of;</p><p style=\"\"><ul style=\"\"><li style=\"\"><strong style=\"\">Video tutorials</strong>&nbsp;-&nbsp;Professionally mastered videos with synchronised text descriptions to reinforce key points</li><li style=\"\"><strong style=\"\">Workbook (PDF)</strong>&nbsp;-&nbsp;A professionally designed downloadable PDF workbook that you can print and write your responses in as the instructor takes you through each step</li><li style=\"\"><strong style=\"\">Online Form</strong>&nbsp;-&nbsp;An Interactive form that you can insert your responses in as the instructor takes you through each step.&nbsp;<span style=\"\">●</span><span style=\"\">&nbsp; </span><span style=\"\">At the end  of the email marketing training you can email yourself your answers.</span></li></ul><div style=\"\"><p style=\"\"><strong style=\"\">DURATION</strong> - The email marketing training  course has 30 mins of video lectures and it is expected that you would complete  the course within 60 mins.</p>    <p style=\"\"><strong style=\"\">SOFTWARE</strong> - You do not need to install any  special email marketing software to complete the course and the email marketing  plan that you develop can be used with the email marketing software program of  your choice.</p>    <p style=\"\"><strong style=\"\">SKILLS</strong> - You do not need any previous experience using  email marketing software.</p></div></p>&lt;/p&gt;  <p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "eMail Marketing Plan Developed in 1 hour", 
    "price": "25.00", 
    "instructors": "Tim Gentle", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/18192_7772_8.jpg", 
    "course_url": "https://www.udemy.com/email-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-20T22:32:09Z"
}