{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Email Marketing &amp; Listbuilding Course Review:</strong></p><p><strong><em>\"Great Course! </em><em>Highly informative course with step by step explanation.\"</em> -Anusha</strong></p><p> You've heard about the importance of using email marketing in your business, but perhaps you haven't gotten started with email marketing yet?<br></p><p>You see a lot of different opinions about email marketing and listbuilding but aren't sure where to turn for authoritative advice about email marketing?</p><p>You want the massive leverage that email marketing provides, but just need someone to guide and mentor you, step-by-step?</p><p>Then this is the course for you!</p><p>In this course, you will discover the power of email marketing to dramatically increase sales for your business - for ANY business.</p><p>In this course, I walk you through how to use Aweber, (which I've used for 15 years and recommend) one of the most respected and established email listbuilding / autoresponder services, to:</p><ul><li>Create an email list</li><li>Create an autoresponder series (email drip campaign)</li><li>Create a double opt-in subscriber process</li><li>Create a single opt-in subscriber process</li><li>Create a broadcast email (email blast)</li><li>Create an opt-in form for your website</li><li>Install your opt-in form on your website</li><li>Create an Aweber-hosted opt-in page (no website required)</li><li>Import an existing email list from another service</li><li>Import an existing list from an offline source. business cards, LinkedIn contacts, etc.</li></ul><p><br></p><p>Bottom line, you will get a fantastic education in the world of email marketing - from a 15 year veteran of the email marketing world!</p><p>Be sure to watch the free preview lectures below to get an idea of the quality of this course.</p><p>Enroll today, risk-free, because you have a 30-day, no-questions-asked, money-back guarantee!<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Email Marketing With Aweber Email Marketing For More Sales", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595444_a042_3.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-listbuilding-increase-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T23:27:42Z"
}