{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Email Marketing</strong> is one of the most effective ways of building an audience, creating  an online business and making money.  </p>  <p>  \t      However, you may prefer to think of an email list as a marketing tool that creates a relationship with your potential customers.  </p>  <h5>An email list is a business asset</h5>  <p>  \t<em style=\"\">&quot;If you aren’t building an email list, you’re missing out on the most powerful and consistent way to drive repeat visitors and customers to your website or blog.&quot; – </em>Corbett Barr from <strong style=\"\">ThinkTraffic</strong>. <br style=\"\">  </p>  <p>  \t      I&#039;ll explain the importance of thinking of your email list as a collection of people rather than a collection of email addresses or – even worse – a way to make money.  </p>  <ul style=\"\">  \t<li style=\"\">I&#039;ll recommend you <strong style=\"\">don&#039;t</strong> constantly send sales emails. <br style=\"\">  \t</li>  \t<li style=\"\">I&#039;ll tell you about the importance of an offer and how often and how much you should give away for free<br style=\"\">  \t</li>  \t<li style=\"\">I&#039;ll  explain about incentives and lead magnets.<br style=\"\">  \t</li>  \t<li style=\"\">I&#039;ll introduce the squeeze page and show you how to make one<br style=\"\">  \t</li>  \t<li style=\"\">I&#039;ll show you the best ways to create signup forms and where to put them on your website<br style=\"\">  \t</li>  \t<li style=\"\">I&#039;ll explain about the &quot;Thank You&quot; page and the &quot;Welcome&quot; page.<br style=\"\">  \t</li>  </ul>  <p>  \t      The process of collecting email addresses and bulk-emailing out to them in a way that by-passes the spam filters and stays on the right side of the CAN-SPAM act is phenomenally complicated.  </p>  <p>  \t      That&#039;s why I&#039;ll show you step by step instructions of exactly how to use the powerful tools of two of the foremost email marketing services: Aweber and Mailchimp.  </p>  <p>  \t      I&#039;ll also show you about email messages – the different types you can send, how to send them, when to send them and the best ways of writing effective emails to drive traffic and sales.  </p>  <p>  \t      Many online businesses focus, incorrectly sometimes, on social media, whereas <strong style=\"\">Email Marketing</strong> provides a much better return on your investment.  </p>  <p>  \t<em style=\"\">&quot;If they’re liking the content you’re sending them regularly, then there’s a good chance they’re going to like the products you create. Email subscribers are more likely to buy your products than any other type of audience.”</em> – Glen Allsopp from <strong style=\"\">ViperChill</strong>.  </p>  <p>  \t      If you focus on providing value and engaging subscribers, <strong style=\"\">Email Marketing</strong> will bring success for your business.  </p>", 
    "end_date": null, 
    "title": "Email Marketing: How To Build an Email List of Customers", 
    "price": "20.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58950_3b48_6.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-how-to-build-an-email-list-of-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-08T11:10:04Z"
}