{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Has this happened to you?</p><p>You’ve setup a list, added a few emails into your autoresponder, sent people to a squeeze page, given them a gift in exchange for their email. Then you sit there and wonder why people don’t open up your emails. You check your stats and wonder why you only get only a handful each day if any.</p><p>The truth is only certain people open emails from the right type of people. There is only so much time in the day and people are only going to engage those emails that interest them. You think the same thing your emails, and everybody else does the same thing.</p><p>So what does this mean for you and your email marketing efforts?</p><p>If you’re actively running an email campaign and you want to get your emails opened more often, you have to become someone that people respect, and actually want to hear from. This starts by respecting the people you want as subscribers.</p><p>You have to provide your subscribers with more information, with better information. You have to be more trustworthy, more respected, more well liked. It starts with writing the email they actually look forward to and will read through it. This course will show you how. </p><p>Section One looks at the basics of email campaigns.</p><p>Section Two covers the goals you need to consider in the email campaign.</p><p>Section Three shows what to consider when writing emails. </p><p>Section Four  discusses specific types of emails to write. </p><p>Section Five has strategies for continued success in your email marketing campaign. </p><p>Success in email marketing comes down to the relationship your forge with potential subscribers. The method you write your emails keeps that rapport going.</p>", 
    "end_date": null, 
    "title": "Email Marketing Domination: Write Emails That Convert", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703630_e412.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-domination-write-emails-that-convert/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-22T08:50:22Z"
}