{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>*Updated May 22nd 2016 - April Sales Report and Subscribers Opt-in Increasing!</strong></em><br></p><p>How Much <strong class=\"redactor-inline-converted\">MONEY</strong> Do You Make Online? I’m Willing To Bet It’s <strong class=\"redactor-inline-converted\">NOT</strong> Quite Enough. Did You Know That The Average Individual Trying To Earn a Living Online Fail Within The First Year?</p>\n\n<p>Why Are So Many Up and Coming Entrepreneurs Struggling to Build An Online Business, a List of Subscribers, Daily Sales Or Recurring Revenue?</p>\n\n\n\n\n\n<p>Because You Don’t Have a Successful Sales Funnel Of Course!  You’re Already an Enthusiastic Action Taker Who Grabs The Bull by The Horns But, For Some Odd Reason No Matter How HARD You Try, You Still Struggle To Build a Growing and Thriving Business.</p>\n\n\n\n\n\n<p>Well I Want to Welcome You: <strong class=\"redactor-inline-converted\">DOUBLE Your Subscriber List and Make Recurring Revenue Fast</strong><strong class=\"redactor-inline-converted\">!</strong>  Where I’ll Walk You Through The Process Of Creating Successful Email Marketing and Lead Generating Techniques using Aweber, Optimize Press and Wordpress</p>\n\n\n\n\n\n<p>My Name Is Tim Ernst and I’ve Successfully Broken Free From The Rat Race To Live Life On My <strong class=\"redactor-inline-converted\">OWN</strong> Terms.</p>\n\n\n\n\n\n<p>Ever Feel Overwhelmed With All the Circulating Information On “How To Make Money Online?”</p>\n\n\n\n\n\n<p> It Just Gets Right Down ANNOYING!</p>\n\n\n\n\n\n<p>TODAY IS A DIFFERENT DAY MY FRIEND.<br></p>\n\n\n\n\n\n<p>Starting Today You’ll Learn The Entire Process For Creating a Successful Email Campaign To Capture Leads and Make More Sales In just 2 Hours, and Finally Make Sales So You Can Wake Up In The Morning WITHOUT An Alarm Clock and Do What You Love!  Join Me In The Course and Get Ready to.</p>\n\n\n\n\n\n<ul><li>Receive training detailing everything you need to know about making <br>money using \" Successful Sales Funnels\" and auto-responder techniques for \nBIGGER sales!</li><li>Generate More Leads</li><li>Create Powerful Headlines That Generate Cash</li><li>Gain Financial Freedom and Job Security</li><li>Most Of ALL...Get Out Of The Rat Race Once and For ALL!</li></ul>\n\n\n\n\n\n<p>Are You Ready To Make <strong class=\"redactor-inline-converted\">MORE</strong> Money?</p>\n\n\n\n\n\n<p>Just Click The “Take This Course” Button and We’ll Dive Right Into The Course. See You On The Other Side! </p>", 
    "end_date": null, 
    "title": "Email Marketing: DOUBLE Your List and Sales Using Aweber", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785526_b1f1_2.jpg", 
    "course_url": "https://www.udemy.com/double-your-subscriber-list-and-make-money-on-autopilot/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T23:36:51Z"
}