{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t                   LATEST:  </p>  <p>  \t  Course updated December 3rd, 2014 - email marketing ideas from bestselling author Tim Ferriss  </p>  <p>  \t      Course updated November 26th, 2014 - tutorial on using Haiku Deck to create amazing SlideShare presentations to get even more email signups  </p>  <p>  \t      Course updated October 24th, 2014 - lectures on creating audio format lead magnets using free software  </p>  <hr style=\"\">  <p>  \t                   Are you an author in despair over your lack of royalties? Perhaps you are new to publishing and didn’t realize how little marketing publishers do for their authors. Maybe you are self-published and are overwhelmed at all the different roles you have to play. The ‘overwhelmed author’ isn’t a cliché, it’s a reality.  </p>  <p>  \t                   We ALL need to work hard to market our books to get them seen amongst the thousands that are published every week. One way is to pay for advertising – but that’s expensive and can be very hit and miss.  </p>  <p>  \t                   The best way is through email marketing. Email marketing for authors means that you don&#039;t &#039;lose&#039; every person who buys you book - you have a way of staying in contact with them. At it&#039;s most simple, it&#039;s a link you can put in your books that leads people to a signup page (we show you how to do this even if you don&#039;t have a website). Then, once you have readers&#039; email addresses, you can email them to let them know when you publish new books, have your books on Countdown Deals, or are appearing as a guest blogger or interviewee on podcasts, videos, etc.  </p>  <p>  \t              Maybe you know that you <em style=\"\">should</em> be doing email marketing, but you aren&#039;t! The fact is that authors who do email marketing <strong style=\"\">sell more books</strong>. It&#039;s simply about the math -- the more people you are able to tell about your books, and the more people you have to help you when it comes to launching a new book, the more sales you will have. You have already sold once to your existing readers, selling to them again is much easier – they already love you!  </p>  <p>  \t                   Email marketing is the #1 way to increase your royalties and sell more books. Why? Well, Amazon and other book sellers don’t share the details of who buys books. Lots of people have probably already bought your book(s) but you have no way of getting in touch with them. If you could, you could build a relationship with them.  </p>  <p>  \t                   Enter email marketing. That’s what it is – or what it is meant to be. It’s about building a relationship with your readers. It isn’t about cheesy selling. It’s subtle, powerful, inexpensive, and very effective.  </p>  <p>  \t                   Many authors put it off, thinking it is too expensive or difficult. A few have tried it and lost heart – not knowing what to write in emails. Some have found the technology too fiddly.  </p>  <p>  \t                   That’s why we created this course. We wanted to provide a <strong style=\"\">step-by-step guide to email marketing </strong>for authors and content creators.  </p>  <p>  \t                   If you are daunted by setting up an email list, starting your email marketing; or maybe you&#039;ve tried it and couldn&#039;t work out the technology, or couldn&#039;t get enough people to opt in to your list, then this is the course you should take next -- <em style=\"\">before you do anything else</em>.  </p>  <p>  \t                   Because this is the foundation of your <strong style=\"\">author</strong> <strong style=\"\">platform</strong> – you can do it with no marketing budget (using free email marketing software) and even without a website. Starting to build your list means that you will have vital infrastructure in place. Everything else you do to market and promote your book will build your success exponentially, rather than you starting from scratch (or -- horror! -- relying solely on Amazon) each and every time you launch a new book.  </p>  <p>  \t                   We (Cathy and Michelle) have decades of experience between us and we work with authors and content creators to help them turn what they know into a book and grow a successful business. Using email marketing was how Cathy was able to go from selling 37 copies of her first book at launch, to selling hundreds of copies of her second over a weekend and getting a Amazon #1 bestseller. And it&#039;s how one of her students got his free book to #5 on Amazon. And you can do this too -- whether you write <strong style=\"\">fiction or non-fiction</strong>.  </p>  <p>  \t                   If you have the infrastructure in place, and you are building a relationship with people who know, like, and trust you then you will have more <strong style=\"\">success</strong> as an author. Whatever success means to you -- income, lifestyle, recognition, or just peace and quiet to write your books – you can achieve it. It all starts with staying in touch with people who want to stay in touch with you.  </p>  <p>  \t                   We love to work with people who have a message, a mission, and something to share. In this course, we don&#039;t just show you the technology, we explain the <strong style=\"\">strategies behind the technology</strong>. We understand <em style=\"\">why</em> they work, and we bring you only <em style=\"\">the absolute best, tried and tested techniques</em>.  </p>  <p>  \t                   Even though we call this an introductory level course, some of the things we teach are being used by the top 1% of online marketers. You will not only have all the basics in place when you finish this course, but you&#039;ll have a whole list of new and up-to-date ideas you can implement in the weeks, months and years to come.  </p>  <p>  \t                   Inside this course, you&#039;ll discover:  </p>  <ul style=\"\">  \t<li>How to get the technology set up quickly and easily (<strong style=\"\">even      if you don&#039;t have a website</strong>!)</li>  \t<li>How to <strong style=\"\">move</strong>      your readers from your book to your email list (build YOUR list -- stop      letting those readers -- who are valuable assets for your business -- slip      through your fingers).</li>  \t<li>The five <strong style=\"\">best types of opt-in incentive</strong> or free      gift that are working right now for authors (and it&#039;s OK if you don&#039;t have      anything -- we give you ideas that don&#039;t require you to produce any videos      or write any pdf ebooks or any new content at all!).</li>  \t<li>What to <strong style=\"\">say</strong>      in your emails. As writers we all know that blank page can be off-putting      -- no problem, we give you a &#039;cheat-sheet&#039; so that you <strong style=\"\">always</strong> have      something to say.</li>  \t<li>How <strong style=\"\">often</strong> to      email your list. A tricky question when you are getting started.</li>  \t<li>Where to go when you have the <strong style=\"\">basics</strong> in place -- the world is your oyster as they say and we      give you an hour of additional, advanced ideas to move you to the next      level (or a few levels beyond that!).</li>  </ul>  <p>  \t                   Our teaching style is friendly, warm and <strong style=\"\">highly motivating</strong>. But don&#039;t be deceived. Even though we make the content appear <em style=\"\">deceptively simple</em>, we are very smart, very experienced, and we know what works (and what doesn&#039;t). We also know what to do to <strong style=\"\">make it easy for you to implement</strong>.  </p>  <p>  \t                   We break down the jargon and walk you, step-by-step, through the process of creating a free gift, setting up a list, collecting email addresses, and building a relationship with your subscribers in a way that is authentic to you. We help you build a real and genuine relationship with your readers, get to know them and stay in touch with them -- so that you can ultimately <strong style=\"\">sell more books </strong>and <strong style=\"\">make more money</strong> as an author. And do it in a way that <strong style=\"\">feels great</strong> and is in <strong style=\"\">alignment with your values</strong> and your style of communication.  </p>  <p>  \t                              Here are some of the downloadable PDFs that are included with the course.  </p>  <p>  \t<img src=\"http://www.forauthors.info/wp-content/uploads/2014/07/CheatSheetCover-e1406052136849.jpg\" style=\" max-width:100%;\">  </p>  <hr style=\"\">  <img src=\"http://www.forauthors.info/wp-content/uploads/2014/07/EMFAResourcesCover-e1406078010604.jpg\" style=\" max-width:100%;\">  <p>  \t                          We love to teach (Michelle was a teacher earlier in her career!)  and we have tens of thousands of students who already learn with us on  Udemy and elsewhere.  </p>  <p>  \t                                 Will you be one of them? We do hope so!  </p>", 
    "end_date": null, 
    "title": "Email Marketing for Authors: Savvy Authors Sell More Books.", 
    "price": "30.00", 
    "instructors": "Cathy Presland, Michelle Campbell-Scott", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/264034_9a1a_4.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-for-authors-build-a-list-to-sell-more-books/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-18T12:26:27Z"
}