{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><br></p><p><em>Have you ever wondered how you could get people who are just </em><strong><em>kind of</em></strong><em> interested in your business to throw money at you? </em></p><p><em>Do you struggle with getting people to talk about your business to their friends, to buy from you again or even to leave cool testimonials? </em></p><p><em></em></p><p><em>Are you considering building a product but are afraid that nobody is gonna buy it once it is out there? </em></p><p><em>Did you ever wonder if it’s even possible to make money by sending out emails, since everybody seems to complain about emails send by Amazon, eBay and other companies? </em></p><p><em>Or Are you downright CONVINCED that sending newsletters and emails to your clients is a waste of time/down-right annoying that have no ROI whatsoever? </em></p><p>If you’ve answered <strong>« Well… yeah »</strong> to ANY of the questions above, this new course will wipe you of your feet. </p><p>If you’ve ever wondered what you could do to increase your bottom-line on the spot, get customers to purchase from you over and over again, make people who are kind of interested in your product become raving fans… </p><p>then this course was created especially for you.</p><p>My Name is Robin Hanna and I’m a marketing strategist and growth-hacker… and creator of one of the biggest and most reviewed Marketing courses on Udemy (UPDATE: Best-seller in digital marketing since November 2015). </p><p> I’ve consulted with a ton of entrepreneurs, and increased the bottom-lines of every kind of business that you could imagine, ranging from fashion startups to hospitals.</p><p>Some changes I made are specific to each one of them, but one amazingly lucrative area is ALWAYS overlooked.</p><p>And today, I want to teach you EVERYTHING I know about this much-ignored area. </p><p>The things you’re gonna learn are the most powerful and easy changes you could make to your marketing/sales approach.</p><p>I’m talking about… drummroll… EMAIL MARKETING.  </p><p>WAIT.</p><p>I’m sure that your brain directly jumped to the annoying sales email you’ve received (and deleted) this morning when you read the words « email-marketing ». </p><p>That’s not what I’m talking about.</p><p>\n<strong>See, GOOD email-marketing exis</strong>t.<strong> And it’s NOT about spamming your customers with emails announcing deals. </strong></p><p>Here’s what I’ve achieved lately - just by sending out emails:</p><p>I made 14 000$ from 900 stone-cold subscribers who had never interacted with my client before… selling high-end leather shoes, in 7 days (well, 6 actually, the last day I watched the cash roll in).</p><p>I wrote multiple emails that sold everywhere from 3000 - 9000$ worth of products in </p><p>It’s about delivering value and making people crave and drool over your product.</p><p>It’s about making people see you as a friend. </p><p>It’s about making them cheer up every time they see your name in their inboxes.</p><p><strong>Without further ado, let me give you a fast preview of what you’re going to learn in this course: </strong></p><p><strong>- I’ll teach you how to write home-run sales copy</strong>. Yes, you heard me right. Before hitting send, you need somme kickass email copy. And guess what: not any email copy will convert your reader into a raving, money-throwing fan<strong>. At the end of this section, you’ll be a master at forcing people to take action just by using words!</strong> (this is a section that’s also included in my best-selling, 5-star course)</p><p><strong>- I’ll show you EXACTLY the emails I send out to make 14 000k in 7 days.</strong> Even better: I’ll explain you WHY I wrote what I wrote so it’s kind of a plug-n’play sort of thing. After this section, you’ll be able to make money on auto-pilot using emails to sell anything you want (for real, I sold weird looking leather shoes using email. You can use this to sell ANYTHING)</p><p>- After this,<strong> I’ll teach you 5 ultra-advanced strategies you’ll encounter IN NO OTHER COURSE ABOUT MARKETING</strong>. These will literally force your email-subscribers into buying your product (Please, use this ethically). It took me 4 years of intensive studying and experimenting to discover them. These will transform your business in a way you couldn't even imagine. (<strong>Hint: </strong>Apple has used ONLY ONE of these to make the iPhone 6 a best-seller, and you haven’t even noticed)</p><p>- <strong>I’ll analyze the email-marketing of 3 big&amp;awesome companies in deep details (Hint: Airbnb is one of them)</strong>. And I’ll destroy it in front of you, just so you understand once and for all what real, hyper-lucrative email-marketing is. After this section, you’ll be able to become a high-end marketing consultant and earn at least 3-figures/hour. </p><p>- I’ll give you a bag of tricks, short but highly-advanced techniques that you can implement in LESS than a few hours in order to boost ALL your conversion rates (want more e-mail subscribers? DONE. A flood of new customers? DONE. More twitter followers? DONE. I think you got it.). This is instantly valuable stuff. </p><p>Oh, an<strong>d I’ll also teach you how to build multiple cool products in little to no time in order to sell more and to increase your prices</strong>. For real, it often doesn’t take more than one day to crank out an additional product you can add to your existing one and sell for a much higher price.  </p><p>And much, much more…. but you’ll see for yourself, there are some additional surprises in there that will make you cheer up, I promise! </p><p><strong>To sum up, this course is the best thing you’ve encountered about email-marketing (and frankly, it's the best thing you'll encounter in a long time).</strong></p><p>If you implement just 10% of what I’m teaching you, you’ll be able to make the price of this course back in a few weeks.</p><p>I took great care of designing the course in a way in which even a your 8-year-old nephew could take it and become a email-marketing specialist just by watching it and by taking the 4 assignments I’ve created to make sure that you progress in an epic way. </p><p><strong>Seems good enough? </strong></p><p>…</p><p><strong>And also a little to good to be true? </strong></p><p>Well, then you’ll certainly enjoy knowing that <strong>you got a 30 day no questions-asked money back guarantee</strong>. That means that you can watch the course, learn everything there is to learn… and get your money-back if you’re not satisfied with the content. </p><p>No hard feelings.</p><p>In fact, if you aren’t completely happy, I’ll MAKE you get your money-back. </p><p>You heard me right: I only want top-notch, excited and hustling student s in my course. </p><p>Just send one little email to Udemy, and…. That’s it. They’ll send you a full-refund. </p><p>It takes 2 minutes top. </p><p><strong>There is no-risk whatsoever if you’re just a little curious and want to try this course out. </strong></p><p>So… to sum up: </p><p>Worst case scenario: you get my course and absolutely HATE it… and get your money back. </p><p>Best case scenario: you get my course and fall in love with it. You apply what I teach. You transform your business and skyrocket your bottom-line by applying every little strategy I’ll teach you about. We become best friends. </p><p>Don’t wait. Enroll now. I know, it’s cliché, but….you’re really losing tons of cash every single day by ignoring effective email-marketing. </p><p>Just sayin. </p><p>Get in there. You’ll thank me for it, I guarantee it. Just look at the testimonials below. </p><p><strong>P.S</strong>: Here is what Daniel DiPiazza, columnist at Entrepreneur Magazine and founder of Rich20something has said about my course.  </p><p> My friend Bryan Harris made 220 000$ in one product-launch using less than 50% of the strategies I teach in this course. </p><p><strong>P.S</strong>: Oh, and of course, you’ll get ALL my updates and new strategies when you enroll in the course. This course is gonna grow a heck of a lot in the next months and years, and you’re gonna get access to all my new, nifty strategies, case-studies, sales hacks… and other awesomeness that I’ll publish in the course. Short: you’ll never stop learning and improving on the topic of email-marketing :)</p><p><br></p><p>Do yourself a favor ENROLL NOW. I'll be waiting on the other side :) </p><p><em></em><br></p><p><em></em><br></p><p><em></em><br></p>", 
    "end_date": null, 
    "title": "Email Marketing Blueprint: Strategies for All Levels", 
    "price": "25.00", 
    "instructors": "Robin Hanna", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/549960_e6a1_2.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-blueprint-how-i-made-14-000-in-7-days/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-09T11:08:02Z"
}