{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Now Over 700 students!</strong>  </p>  <p>  \t    Did you know that building a simple email list of your customers and potential customers can boost your sales by more than 34% in just 3 months?  </p>  <p>  \t            Whatever your business type… whether you manage a restaurant or a shop, you are a tradesman such as a plumber or a builder, or any other business… building an email list WILL boost your revenue, if it's done the right way for your business.  </p>  <p>  \t            I'm Chris Towland and many of my clients call me 'the email marketing guy' because I've helped them to dramatically boost their sales by building and profiting from email lists of their customers and potential customers.  </p>  <p>  \t            In my Email Marketing Profits course, I'll show you exactly how you can quickly build an email list for your business… and most importantly, how you can use the list to make more and more sales.  </p>  <p>  \t            If your business has never used email marketing, I'll show you exactly how to get started and building a list quickly and how to then turn the list into extra sales.  </p>  <p>  \t            If your business already has an email newsletter, then I'll show you how to build your list quicker than ever before and then make even more sales from your list.  </p>  <p>  \tFor any business interested in lead generation, getting new business and convincing existing customers to spend more money, then this course is perfect for you.  </p>  <p>  \t            The course is broken into 5 sections, intended to be watched as one section per day for 5 days...  </p>  <p>  \t            Day 1 shows you exactly why you should build an email list of customers and potential customers and how you'll turn these into extra profits for your business.  </p>  <p>  \t            Day 2 shows how to do your list building on autopilot and how this will make sales for you on autopilot too.  </p>  <p>  \t            Day 3 shows you how to build a large email list very quickly.  </p>  <p>  \t            Day 4 shows you exactly what to send to your list and how this turns into extra sales for you.  </p>  <p>  \t            Day 5 gives you some final tips to get set up quickly so that your new list is earning you profits within weeks.  </p>", 
    "end_date": null, 
    "title": "Email Marketing Profits - Quickly Boost Your Sales by 34%+", 
    "price": "20.00", 
    "instructors": "Chris Towland", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276596_b90a_3.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-profits-for-small-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T14:02:44Z"
}