{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">For Beginners Who Seek a SOLID FOUNDATION in Email Marketing</strong>  </p>  <p>  \t<em style=\"\">5 hrs, 12 min</em>  </p>  <p>  \t                          Email Marketing is one of the most cost-effective and powerful marketing channels that has ever existed. Yet few businesses take full advantage of Email Marketing&#039;s full potential, which creates a huge opportunity for you and your business.  </p>  <p>  \t                          The first of a two-part series, this course (Part 1) is designed for anybody with zero to medium experience who wishes to develop <em style=\"\">a very strong foundation </em>in Email Marketing, for uses including:  </p>  <ul style=\"\">  \t<li>Self-employed, business owners, entrepreneurs, startups</li>  \t<li>Small to medium-sized businesses</li>  \t<li>Corporate marketing departments &amp; enterprises</li>  \t<li>Agencies</li>  \t<li>Marketing consultants</li>  \t<li>E-commerce, SaaS &amp; Web pure-play businesses</li>  \t<li>B2C &amp; B2B companies</li>  \t<li>Bloggers &amp; self-publishers</li>  </ul>  <p>  \t                          In today&#039;s world of social media-fueled online marketing, Email Marketing has become an often overlooked and underutilized channel for:  </p>  <ul style=\"\">  \t<li>Customer acquisition</li>  \t<li>Lead generation &amp; nurture marketing</li>  \t<li>Customer retention</li>  \t<li>Up-selling, cross-selling, and winning back lost customers</li>  \t<li>Connecting with your customers at a deeper level and staying &quot;top of mind&quot;</li>  </ul>  <p>  \t                          Modern Email Marketing is much more than building a list and firing off occasional batch-and-blast emails. Yet because many companies fail to take advantage of email&#039;s full potential, or fail to use even the full set of tools they&#039;re already paying for, there exists an opportunity to seize low-hanging fruit for any marketing professional who makes the decision to learn the basics of Email Marketing. This course lays the foundation for you to become <em style=\"\">an expert</em>.  </p>  <p>  \t                          In this course, we start at the very beginning and quickly build up your knowledge of the &quot;why&quot; and &quot;how-to&quot; of Email Marketing, going deep into tactical detail in the areas that you need to know to become an expert, hands-on practitioner.  </p>  <p>  \t                          We also touch on more advanced topics so that you&#039;ll &quot;know what you don&#039;t know,&quot; understand the full potential of Email Marketing, and provide a context for the more advanced topics covered in this course&#039;s sequel, Email Marketing Part 2: Advanced Email Marketing Mastery.  </p>  <p>  \t<em style=\"\"><sub style=\"\">Intro music: Adam Lathrum &quot;Digital Moon&quot; (used with permission)</sub></em>  </p>", 
    "end_date": null, 
    "title": "Email Marketing Part 1: Email Marketing for Total Beginners", 
    "price": "50.00", 
    "instructors": "Greg Helmstetter, Pamela Metivier", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413008_0372_3.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-1/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T08:30:18Z"
}