{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>Join us on a journey to online long term success!</em><br></strong></p>\n\n<p><strong>***LATEST UPDATE ON 28 March 2016***</strong></p>\n\n\n\n<p><em><strong>***Over 1350 Happy Students***</strong></em></p>\n\n\n\n<p><em><strong>________________________________________________________________________</strong></em></p>\n\n\n\n<p><em><strong>SCOTT PATTON:</strong></em></p>\n\n\n\n<p><em>\"I always dread sending emails. Sorin's course gave me lots of great ideas for sending emails that my audience will like and read. I especially learned a lot about how to get people to subscribe to my email list, which is another problem I have. Well produced course. Highly recommended.\"</em></p>\n\n\n\n<p><em>________________________________________________________________________</em></p>\n\n\n\n<p><strong>The internet and online arena can dramaticly change the direction and course of your business by giving you access to a whole arsenal of marketing methods and a global marketplace that can allow your business to get 10X times bigger than at a local or only national scale.</strong></p>\n\n\n\n<p>The problem is that marketing channels, softwares, apps and strategies change so fast that many times you don't even get to implement them and they already stop working or aren't fit anymore for your business.</p>\n\n\n\n<p>This being the situation you need to use strategies that work on the long term and are proven to convert, get you new clients, conversions and PROFITS and build sustainablity for your business.</p>\n\n\n\n<p><strong>What better solution than to use the no.1 most effective online marketing channel that can bring up to 4400% ROI and that it's used for over 15 years now...</strong></p>\n\n\n\n<p>We are talking about Email Marketing and if you haven't used this yet in your business you are leaving thousands, hundreds of thousands and even millions on the table! There are 7 Figures online businesses that are built only by using email markeintg alone. You don;t have to believe me on this one, just take a couple of minutes and chek the statistics and what every top internet marketer in the world is doing.</p>\n\n\n\n<p>So how can you start using it to? This is what this course it's all about, a step-by-step beginners guide that will walk you through and help you build your first list, start communicating with your audience and write effective emails that get opened, build trust and get you sales!</p>\n\n\n\n<p><strong>So what you will be learning in this course...</strong></p>\n\n\n\n<ol><li><strong>How to build your first email list</strong></li><li><strong>How to integrate your list building with your Wordpress Website or Blog</strong></li><li><strong>How to create stunning landing pages using Getresponse</strong></li><li><strong>How to use Mailchimp FREE Email Service to create a list and a sign-up forms for that list</strong></li><li><strong>How to get maximum exposure, your emails opened and your CTR high</strong></li><li><strong>How to write engaging emails that build trust, credibility and awareness</strong></li><li><strong>How to use Emails to SELL!</strong></li></ol>\n\n\n\n<p><strong>...and much, much more!</strong></p>\n\n\n\n<p><strong><em>Other Benefits:</em><br></strong></p>\n\n\n\n<ul><li><strong>Lifetime Access to all other updates!</strong></li><li><strong>Surprise Bonuses!</strong></li><li><strong>New Methods and Systems introduced in the course!</strong></li><li><strong>FULL Support through the discussion area of the course!</strong></li><li><strong>30 Day Money Back GUARANTEE if you feel this course didn't help you at all and you can't apply anything...that is how dedicated we are to your success!</strong></li></ul>\n\n\n\n<p><em><strong><br></strong></em></p>\n\n\n\n<p><em><strong>Time To Take ACTION!</strong></em></p>\n\n\n\n<p><em><br></em></p>\n\n\n\n<p><em>To Your Massive Online Success,</em></p>\n\n\n\n<p><em>Sorin Constantin</em></p>", 
    "end_date": null, 
    "title": "Email Marketing Basics: A Step-by-Step Beginner's Guide", 
    "price": "20.00", 
    "instructors": "Sorin Constantin", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617864_76da_3.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-basics-a-step-by-step-beginners-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T07:13:05Z"
}