{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>The only course you'll need to start collecting email subscribers with free tools.</em></p><p><strong>Get Your First 1000 Subscribers: Email List-Building Formula</strong> will teach you how to turn website traffic into desirable email subscribers that you can market your products and services to. After taking this class, you'll know how to:<br></p><ul><li>Sign up for a free and easy-to-use email marketing service</li><li>Create the perfect lead magnet</li><li>Design beautiful high-converting opt-in forms</li><li>Drive more high-value traffic to your website that will subscribe to your list</li></ul><p>Regardless of what your level of experience is with web design and marketing, this in-depth course is designed to provide you with everything you need to get started. </p><p><strong>Contents and Overview</strong><br></p><p>You'll start with the basics and learn how list-building works. You'll learn the different types of email marketing services. By the end of the first section, you'll be signed up for an amazing free email marketing service. </p><p>You'll learn what a lead magnet is, and how to create a perfectly irresistible lead magnet. You'll learn how to use basic tools like Microsoft Word and Quicktime to create high-quality lead magnets. By the end of this section, you'll have a lead magnet that will surely get people subscribing to your list.</p><p>You'll then learn how to create beautiful opt-in forms on your website using free tools like Magic Action Box. You'll learn how to customize them so that they look modern and professional. By the end of this section, you'll have a website with lead magnets and opt-in form that gets people subscribing to your list.</p><p>By the end of this course, you'll have a funnel that gets people on your email list. From there, you'll be able to market your products and services to them. </p><p>Enroll now!</p><p><strong>About the instructor:</strong></p><p>Phil Ebiner started teaching online courses in 2012, and now has over 100,000 happy students on Udemy learning all sorts of things from photography to video making. Phil has shot and edited thousands of videos over the past 5 years that have appeared everywhere from the big Hollywood screen to television to YouTube fame.</p>", 
    "end_date": null, 
    "title": "Email Marketing: Get Your First 1,000 Email Subscribers Now", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598764_234c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-your-email-list-with-mailpoet-mailchimp-aweber/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T23:37:08Z"
}