{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  THE step-by-step <strong style=\"\">Comprehensive Guide</strong> to building an email list and creating emails your subscribers actually <strong style=\"\">WANT to open</strong>!  </p>  <p>  \t  No fluff, no out-dated information, just practical knowledge for the digital and affiliate marketer.  </p>  <p>  \t<strong style=\"\">In this course I teach you:</strong>  </p>  <ol style=\"\">  \t<li>What types of emails there are and when to use them</li>  \t<li>The importance of Lead Nurturing and how you can start using it</li>  \t<li>How to write an effective Subject Line</li>  \t<li>The way to think about structuring the Call To Action</li>  \t<li>How to choose an Email Marketing System that won&#039;t break the bank</li>  \t<li>What you should look out for BEFORE sending a newsletter</li>  \t<li>What to measure and how to improve those metrics before and AFTER you send the email</li>  \t<li>How to ethically grow your list using FREE, easy to use and time-tested techniques and tools for effective Email Marketing</li>  \t<li>Why your subscribers become uninterested and how to solve this issue</li>  \t<li>What SPAM is and how to avoid it</li>  \t<li>How to avoid the Promotions Tab in Gmail</li>  \t<li>About the 2015 Trends for performance-based Email Marketing</li>  </ol>  <p>  \t  Because this is a Comprehensive Course, it&#039;s around 4 hours, with easy to navigate sections. You can skip over the ones you&#039;re not quite interested in, but I&#039;m pretty sure you&#039;ll still learn something from each section, no matter how much of an Email Marketing Expert you are.  </p>  <p>  \t  I created this course to shed some light on the newest, most effective techniques and tools, with a focus on growing the list and learning all about your leads.  </p>", 
    "end_date": null, 
    "title": "Email Marketing 2014: Actionable Tactics to Grow Your List", 
    "price": "20.00", 
    "instructors": "Sorin Amzu", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235064_b800_3.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-2014-grow-your-list-get-steady-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-01T15:37:11Z"
}