{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\"><strong style=\"\">Join 1,300+ Successful Students</strong> - Materials Updated January 2015</em>  </p>  <hr style=\"\">  <p style=\"\">  \t                       Are you a <strong style=\"\">business owner</strong> or <strong style=\"\">internet marketer</strong>?  </p>  <p style=\"\">  \t                       Do you have an email database but are struggling to make it actually generate cash?  </p>  <p style=\"\">  \t                       In this Email Profits course, you'll be taken step-by-step through building your own profitable email marketing campaign that sells a product or service and puts cash in your bank account.  </p>  <p style=\"\">  \t                       Imagine, if each email you sent made you $1,000+, this is completely possible and you'll be shown example email campaigns that did.  </p>  <p style=\"\">  \t<strong style=\"\">In this training you will discover...</strong>  </p>  <ul style=\"\">  \t<li style=\"\">How to create an email marketing campaign that <u style=\"\">brings in $$$</u></li>  \t<li style=\"\">Step-by-Step walkthrough and explanation of TWO profitable email campaigns</li>  \t<li style=\"\">Simple and Easy to use Email Planner to ensure you properly persuade readers to take action</li>  \t<li style=\"\">And Much More...</li>  </ul>  <p style=\"\">  \t<em style=\"\">*NOTE: Let's face it, results from courses like this are not typical and most people probably won't make a cent because they don't implement or follow through.</em>  </p>  <p style=\"\">  \t<strong style=\"\">MONEY BACK GUARANTEE:</strong> I give you my personal promise that this course will show you a complete walkthrough of two of my profitable email marketing campaigns, why they worked and how to create your own. Implementing this will easily make you more than you paid for this course, if you don't agree then I don't want your money. Simply ask for all your money back 100% anytime in the first 30 days.  </p>", 
    "end_date": null, 
    "title": "Email Marketing for All Levels: Set Up Email Campaigns", 
    "price": "20.00", 
    "instructors": "Carl Taylor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389024_4e70_2.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-for-all-levels-set-up-email-campaigns/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-08T23:58:53Z"
}