{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Did you know that over 80% of email marketing campaigns fail because of the lack of knowledge about what makes email marketing tick? It&#039;s true, drawing clients and customers to your website… </p><p><strong style=\"\">Your business depends on knowing what works and what doesn&#039;t.</strong> How to effectively write an email letter that people can&#039;t wait to read. How to properly handle email addresses, follow ups and advanced emails. How to track, measure and more importantly, test your promotional results. </p><p>We all know what delivers profits to our businesses…people.</p><p>Without them your business will grow stagnant and your profits will diminish. As a business owner you know the value of marketing your product or business and with the vast percentage of online sales going through the roof you know the value the internet can bring to your business. </p><p>But you need people to visit your site, look at your products and what you have to offer. Yes you can optimize your website for all the search engines but that isn&#039;t enough anymore. You need an Email Marketing strategy that works. </p><p><strong style=\"\">I show you how to get lots of visitors into your list and then how to funnel them into the money making chain.</strong></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Email Marketing  - Build a Powerful List of Hungry Buyers", 
    "price": "20.00", 
    "instructors": "Chris Douthit", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446906_d93c_2.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-build-a-powerful-list-of-hungry-buyers/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T22:57:45Z"
}