{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Email Marketing is a cost effective way to get more customers for your business.</strong></p>  <p>  \t  Email marketing is something most small businesses can do, but most don't know how to get started.  </p>  <p>  \t<em><strong>It's a fantastic way to generate more sales, with less effort. Much of it can be automated, and the results can be instant.</strong></em>  </p>  <p>  \t      These days most people have emails. Sending them emails promoting your business can be simple and cost effective - no more envelopes to pack and seal. You can use email marketing to promote things on your web site, give them discounts or let them know about something new your business is doing. This can produce a great return on a small investment.  </p>  <p>  \t      You don't need to be a big business to do this - any business can get started using email marketing today.  </p>  <p>  \t      In this course we explain all the essential information about email marketing. Areas we look at include:  </p>  <ul>  \t<li>How to create an email list.</li>  \t<li>Set up forms on your website to get subscribers.</li>  \t<li>How to select appropriate email marketing software.</li>  \t<li>How to get your emails opened.</li>  \t<li>How to automate much of your email marketing.</li>  \t<li>Tracking the success of your email campaigns.</li>  </ul>  <p>  \t      I've been involved in small business for many years and I know what it's like to be responsible for everything. This is the course I with I had seven years ago when I started learning about using the internet to market my business.  </p>  <p>  \t      If you don't know a thing about email marketing, then this is the course for you. If you know a bit but would like to learn more, then this course will help.  </p>  <p>  \t      This course is mostly video-based and I've tried to keep each video short and to the point. There's no extra fluff in this course - I know your time is precious and you just want to learn what's essential.  </p>  <p>  \t      You're also able to jump around in the course to get to the sections that are relevant to you. And don't forget, you're able to ask questions throughout the course by starting a discussion. So if something is unclear, we're able to answer your question.  </p>  <p>  \t      This course will take around three hours to complete. But after the first hour you'll know how to set up your own list and start collecting emails.  </p>  <p>  \t      Udemy offer a money back guarantee - if you don't get any value from this course, just ask for a refund within 30 days. That reduces the risk to you.  </p>  <p>  \t    So, take the next step. I'd love to have you as a student and help you learn how to use email to generate more sales for your business, with less effort.</p>", 
    "end_date": null, 
    "title": "Email marketing for small business - more sales, less effort", 
    "price": "40.00", 
    "instructors": "Allan Ward", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307292_a10e_3.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-for-small-business-more-sales-less-effort/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-25T01:49:41Z"
}