{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>***  Proven Track Record of ZERO Failures for Nearly a Decade***</strong>  </p>  <p>  \t<strong>That's Right. No One... has Failed... Why? To Put it Simply...</strong>  </p>  <p>  \t<strong>This Stuff Really Works</strong>!<br>  \t<strong></strong>  </p>  <hr>  <p>  \t<strong></strong>  </p>  <p>  \t<strong>WARNING THIS COURSE IS NOT FOR EVERYONE</strong>  </p>  <hr>  <p>  \t      This Course is NOT FOR You If:  </p>  <ul>  \t<li>You Still Believe in Magic Pills, Push-Button Systems, Loopholes or any other System that Ninja Tactics have to Take You There</li>  \t<li>You are Lazy! Seriously, if You Honestly Think You can Build a Business and Do Nothing</li>  \t<li>You will Turn and Run Away from Fear or Situations You Don't Feel Comfortable With</li>  \t<li>You will NOT Ask Us for Help if You Need It! In 10 Years, We've Never had a Failure. We Will NOT Start Now.</li>  </ul>  <hr>  <strong><em>Now That I've Gotten The Dreamers and the Tire-Kickers Out...  <hr>  </em></strong>  <p>  \t      This Course is FOR You If:  </p>  <ul>  \t<li>You are Finally Ready to Join a Team of Successful Entrepreneurs who will LITERALLY Guarantee Your Success</li>  \t<li>You are Willing to Follow a Simple System in Order to Get EVERYTHING You Want out of Life</li>  \t<li>You are Determined to Succeed and Failure is JUST NOT an Option</li>  \t<li>You Are Capable of Asking for Help when You Need It! Once You Join, You're a Part of a Team.</li>  </ul>  <p>  \t      What You Will Get From This Course:  </p>  <ul>  \t<li>Ongoing Support from Two Seasoned Veterans in the Business</li>  \t<li>Your Own Product Launched within 30 Days - With SALES</li>  \t<li>Continued Support to Re-Launch Your Product, Increase Sales, Improve Conversions and literally ANYTHING ELSE You Could Possibly Think Of</li>  \t<li>Over $100,000 Worth of Knowledge and Experience</li>  \t<li>Valuable, Monthly Additions to the Course</li>  \t<li>All the Training and the Knowledge You Need to Succeed Online</li>  \t<li>Our \"<em><strong>No One Left Behind</strong></em>\" Mentality - We Don't Stop Until You Succeed!</li>  </ul>  <hr>              James Holland, also known as \"Coach Comeback\", and John Kirby, also known as the \"Copy Coach\", combined have been responsible for over $1,000,000 worth of new revenue from working with entrepreneurs, online and offline businesses.  <p>  \t            This course will allow you to partner with a duo team that leaves no one behind. We value our reputation and we treat all of our students as equal partners. If you aren't successful, then we certainly can't be.  </p>  <p>  \t          Both of your new coaches and partners have been to the lowest of lows and have climbed our way back! James has been divorced once and broke twice, and John has been divorced twice and broke one! We understand that people just want things to work out, and most of the excuses we hear aren't half-as bad as what we came from.  </p>  <p>  \t          If you want partners who can relate to you, take you by the hand and pull you out of whatever slump you're in... then TAKE THIS COURSE now! Every minute you waste is a minute you could be climbing your way up!  </p>  <p>  \t<strong></strong>  </p>  <hr>  <p>  \t<strong></strong>  </p>", 
    "end_date": null, 
    "title": "Entrepreneur Success: Establish Your Own Business from Home ", 
    "price": "20.00", 
    "instructors": "James Holland", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328342_ee05_2.jpg", 
    "course_url": "https://www.udemy.com/entrepreneur-success-establish-your-own-business-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T17:55:12Z"
}