{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Whether you’re new to creating an online business or you’ve  attempted it before, you know that there are certain steps you need to  complete. In fact, these steps will be repeated each time you want to set up a  new website. So it’s in your best interest to learn them once so that they are  part of your arsenal of knowledge.</p>    <p style=\"\">This course assumes that you are new to online business and want  to get started with the right information from an experienced online teacher. Worksheets  are provided as part of the course materials to make the process faster to  learn, easier to use, and simple to repeat.</p><p style=\"\">In each section of the course you will watch a video, then complete the step illustrated in the video. Total time to complete all of the course will be 5-7 hours, depending on your brainstorming and online speed.</p><p style=\"\">    </p><p style=\"\">Created by an experience online educator who has made a living  online for over 15 years, this course will show you:</p>    <ul style=\"\"><li style=\"\">How to choose your niche online</li><li style=\"\">Why keywords are an important part of your first steps</li><li style=\"\">How to choose a domain name that draws traffic</li><li style=\"\">How to register your domain name at the lowest possible cost</li><li style=\"\">Which domain hosts to choose and why</li><li style=\"\">How to change your DNS – and what that actually means</li></ul><p style=\"\">    </p><p style=\"\">By the end of the course you will have your keyword-rich domain name registered and set up  on hosting, ready for your website.</p><p style=\"\">Get started online today!<br style=\"\"></p>          ", 
    "end_date": null, 
    "title": "First Steps Online", 
    "price": "20.00", 
    "instructors": "Jeanette Cates", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42629_44ff_7.jpg", 
    "course_url": "https://www.udemy.com/first-steps-online/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-20T20:48:05Z"
}