{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">As a working professional in the industry of Online Marketing</strong>, I am noticing that far too many people have become <em style=\"\">“sudden&quot; online marketers</em> for their employer or for themselves as a brand new small business owner. If you remain without understanding basic marketing principles, you are setting yourself up (as well as your company) for disastrous results that cannot be undone. I am certain that you can recall at least one instance of when a <strong style=\"\">company brand made a terrible social media mistake</strong> that still remains fresh in your mind. You have to be asking, “How can it have gone so wrong when it was just one little Tweet?&quot;</p><p style=\"\">Oh, we can count the many ways, actually! <strong style=\"\">I encourage you to take my course and learn how to avoid these blunders</strong> all together. Learn the important basic Marketing Principles that will give you the <em style=\"\">confidence and security that you need</em> if you want to grow in your skill as a <strong style=\"\">Professional Online Marketer</strong>. After you take my course, you can show off your new abilities and <strong style=\"\">WOW</strong> your boss, your staff, and especially your current and potential customers. You&#039;ll notice that some valuable sales touch-points naturally align, although, marketers are not salespeople. Yes, you did read that correctly! </p><p style=\"\">The materials that are included in my course are <strong style=\"\">video lectures, </strong><strong style=\"\">animated cartoons I have created, and easy-to-understand graphics</strong> to explain each element of the principles. With my blend of <em style=\"\">serious instruction and humorous examples</em>, you will discover parts of my course that will become your favorites, and you&#039;ll want to review them again and again! You will truly enjoy this course! And better yet, <strong style=\"\">you will be able to implement what you have learned into your own online marketing strategies</strong>. Money Back Guarantee! </p>", 
    "end_date": null, 
    "title": "For the \"Sudden\" Online Marketer", 
    "price": "50.00", 
    "instructors": "Meloney Hall", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461706_9c41_4.jpg", 
    "course_url": "https://www.udemy.com/incorporating-marketing-principles-into-online-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T22:50:16Z"
}