{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t                    Want to know how to build a real estate website to make more money and grow your business? You&#039;ve come to the right place. By the end of this course, you will have a real estate website /blog within a week.  </p>  <p>  \t<strong>Benefits</strong>  </p>  <p>  \t        By the end of this course you will know:  </p>  <ol>  \t<li>How to setup a website/blog</li>  \t<li>How to generate leads with content marketing</li>  \t<li>How to make money by building multiple streams of passive income with your site</li>  </ol>  <p>  \t        A quarter of they way through the course you will have a site- then you will be well on your way to being one of the great real estate websites out there.  </p>  <p>  \t<strong>You will be able to implement the &quot;Killing 2 Birds with 1 Stone&quot; method</strong>  </p>  <p>  \t        I will also tell you some tactics that will allow you to do market research, lead generation and networking while contributing to your site at least twice a month and max 4x a month (once a week). This will take some of the skills you already posses as a great Real Estate Professional, just applied a bit differently.  </p>  <p>  \t<strong>  You Do Not Need to be a Techie  </strong>  </p>  <p>  \t      Nor am I trying to make you one. Your time should be spend gaining leads, following up and networking.  </p>  <p>  \t        You do need to be willing to learn processes and a few new words and their meanings. Some of you have probably heard of SEO/Local SEO or SERP, if not, I will explain the basics. Being in the real estate business, I understand that you don’t want to spend the bulk of your time posting and writing (I can show you how and where to outsource for a reasonable price... more on this inside course).  </p>  <p>  \t                    To create real estate website and blog is not only a awesome way to gain leads, it will also allow you to develop a community. You can build a virtual team of Real Estate Professionals who you can connect with, share stories, services and market information. Once you learn the practices in these lectures you will market yourself as a expert in the industry and build trust with clients and colleagues.  </p>  <p>  \t<strong>This Course is For:</strong>  </p>  <p>  \t                  Real Estate Professionals who need a website/blog to generate leads, build relationships and create a foundation within their niche i.e. their geographic location and niche within the Real Estate Business.  </p>  <ul>  \t<li>Real Estate Agent Websites</li>  \t<li>Real Estate Investors Websites</li>  \t<li>Mortgage Broker Websites</li>  \t<li>Hard Money Lenders Websites</li>  </ul>  <p>  \t<strong>How to Market Real Estate</strong>  </p>  <p>  \t                  For the past decade more and more industries have moved there marketing funds to digital. The same is for the real estate industry, but more than just posting ads on Google, Bing and Yahoo, its about having an online presents. The site/blog that you will create is the strongest foundation for your real estate marketing strategies. We go into how you can create strategies using Local SEO, networking and content development to market yourself, your services and listings. You can post:  </p>  <ul>  \t<li>Commercial Real Estate Listings</li>  \t<li>Latest housing market news</li>  \t<li>Real Estate Advertising Ideas</li>  \t<li>Real Estate Marketing Product</li>  </ul>  <p>  \t<strong>This course is NOT for </strong>  </p>  <ul>  \t<li>People who aren’t interested in building a online presents</li>  \t<li>People who shy away from networking online</li>  \t<li>Those who lack vision</li>  </ul>  <p>  \t                                 This course is designed to take you through the simple steps that it takes to become web/blog literate. We will touch on the terms, service and practices that you need to get the job done.  </p>  <p>  \t<strong>Lets Build Real Estate Website!</strong>  </p>", 
    "end_date": null, 
    "title": "Gain Leads and Colleagues with a Real Estate Website/Blog", 
    "price": "20.00", 
    "instructors": "RJ Bryan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/291894_c50c_4.jpg", 
    "course_url": "https://www.udemy.com/generate-leads-and-colleagues-with-a-real-estate-website-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-01T19:22:48Z"
}