{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t         Email marketing is CHEAP. Probably that is the main reason you are here.  </p>  <p>  \t         You might struggle with idea whether you need it or not because it isn't as shiny as Social Media, that sounds like a problem. Fortunately, that's the only problem!  </p>  <p>  \t <strong>Did you know there are more than 3.2 billion email accounts today? </strong>95 percent of online  consumers use email and, 91percent check their email at least once a day  (Source: Exact Target).  </p>  <p>  \t <strong>There is simply no competition.</strong> More importantly, it is such an  integral part in our lives, no human being walks around saying he will  quit email.  </p>  <p>  \t         Yes, that's right, once set up their email accounts, they won't quit email.  </p>  <p>  \t         Email has the power to send one piece of content to thousands of people and still have some level of personalization.  </p>  <p>  \t         In fact, <strong>email is the only channel of communication that remains private</strong>, that is  a direct connection between you and your prospect, and most  importantly, it has an opt-in process that turns it into the purest form  of Permission Marketing.  </p>  <p>  \t         Email  marketing can accomplish a broad spectrum of marketing objectives from  branding to lead generation. In this course we will cover the basics as  well as functional components of email messages.  </p>  <p>  \t <strong>Course Content:</strong>  </p>  <ul>  \t<li>  Email Marketing Pros &amp; Cons</li>  </ul>  <ul>  \t<li>  Defining goals &amp; objectives</li>  </ul>  <ul>  \t<li>  Structuring effective email</li>  </ul>  <ul>  \t<li>  Planning and creating a campaign</li>  </ul>  <ul>  \t<li>  Trigger messages and types of emails</li>  </ul>  <p>  \t                   </p><p>The course is easy to chew, as its structured in 8 video  lessons. Each  will take around 5-10  minutes. The entire course clocks  in around 1  hour. So, why not to learn new skills in a lunch hour?  </p>  <p>  \t    Join us today at the Email Marketing crash course, <strong>and take your business to the next level!</strong>  </p>  <p>  \t <strong></strong>  </p>", 
    "end_date": null, 
    "title": "Get Started with Email Marketing", 
    "price": "20.00", 
    "instructors": "iMarketer Training", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/172734_2db1_7.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-25T13:13:39Z"
}