{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      Think email marketing is old-fashioned? Think again. <strong style=\"\">With a return on investment (ROI) of 4300%, email marketing is still the most cost-effective marketing tool on the planet.</strong>  </p>  <p>  \t      Why? Because the message goes straight to a very personal environment — your customer’s inbox — making it the most direct form of communication.  </p>  <p>  \t      Ok, so how do you build a subscriber list?  </p>  <p>  \t      That’s where GetResponse comes into play. We offer a <strong style=\"\">comprehensive email marketing course — free for GetResponse customers</strong>.<strong style=\"\"> </strong>It includes everything you need to know to grow your list by up to 10,000 subscribers in as little as 90 days.  </p>  <p>  \t<strong style=\"\">And now we’re offering you the first 10 lessons, completely free of charge </strong>— even if you’re not a GetResponse Customer. This gives you a unique opportunity to try the initial lessons and decide whether to grab the full program and grow your list by up to 10,000 new subscribers.  </p>  <p>  \t      Whether you’re a beginner or an email marketing pro, you’ll find useful insights on how to:  </p>  <ul style=\"\">  \t<li style=\"\">Grow your contact base</li>  \t<li style=\"\">Create beautiful, effective emails</li>  \t<li style=\"\">Increase the reach of your emails</li>  \t<li style=\"\">Boost conversions</li>  \t<li style=\"\">Combine online marketing tools</li>  </ul>  <p>  \t      … and you’ll even get useful tips you can post on your blog.  </p>  <p>  \t      After completing the 10 lessons, you may decide to take the full GetResponse List Building Program. It comes in two plans: the 90-day fast-track schedule and the 180-day standard plan for those with busy schedules.  </p>  <p>  \t<strong style=\"\">Even if you’re not a GetResponse customer, you can enroll in the full program.</strong> <strong style=\"\">Just start a 30-day free trial</strong>, no credit card required. It entitles you to sign up for the full program at no charge.  </p>  <p>  \t      But wait! There’s more! (Yikes, pardon my infomercial moment.) Each participant who completes the full program receives a <strong style=\"\">GetResponse University Certificate of Performance</strong>. Imagine how proud your mom will be.  </p>", 
    "end_date": null, 
    "title": "GetResponse Email List Building Program", 
    "price": 0, 
    "instructors": "GetResponse University", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415040_9ed1_3.jpg", 
    "course_url": "https://www.udemy.com/getresponse-list-building-program/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T14:49:34Z"
}