{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In &quot;<strong style=\"\">GetResponse - Email Marketing Techniques For Beginners</strong>&quot;, you are going to learn some of the most common and used email marketing techniques. </p><p>Email marketing continues to be one of the best online marketing tools out there, and it also accounts for huge ROI. </p><p>Some of the topics we are going to be talking about include: <strong style=\"\">split-tests,</strong> <strong style=\"\">webforms, </strong><strong style=\"\">automation</strong>, <strong style=\"\">campaigns</strong>, <strong style=\"\">conversion rates</strong>, <strong style=\"\">newsletters </strong>and more. However, lead generation strategies will not be included in the course, please take this fact into consideration before enrolling.</p><p>All of the successful online marketers and figures have something in common - <strong style=\"\">an email list</strong>. Some people have lists of 100.000 subscribers while others 1 million or even more and guess what happens when they launch a new digital product - millions of dollars are generated in a matter of hours, not days or months.</p><p>Therefore, I strongly advise you to learn the fundamentals of an auto-response email service such as GetResponse or Aweber. This actually is the purpose of the course - to teach you the fundamentals.</p><p><strong style=\"\">Disclaimer:</strong></p><p>As an instructor, I am not associated with GetResponse in any way, I won&#039;t be offering affiliate links or something that would benefit me in case you start using GetResponse.</p>", 
    "end_date": null, 
    "title": "Getresponse - Email Marketing Techniques For Beginners", 
    "price": "20.00", 
    "instructors": "Vladimir Raykov", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515906_033a_3.jpg", 
    "course_url": "https://www.udemy.com/getresponse-email-marketing-techniques-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T07:23:05Z"
}