{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">Price Rises To $97 on April 21st!</em></strong></p><p><strong style=\"\">Life Time Access To A Course On Dominating CPA!</strong></p><p><strong style=\"\">Over 10,000 Udemy students enrolled in my other courses!</strong></p><p>Welcome! If your here to learn about how to make some extra money every month, or potentially build a six-figure business with CPA, you&#039;re in the right place!</p><p>CPA is one of the hottest things to get into right now for many reasons. With CPA you can learn how to make money without doing much work at all!</p><p>Now many people get scared by the complexity of CPA, I&#039;m telling you right now, it&#039;s actually VERY simple.</p><p>Here&#039;s what I cover inside the course.</p><ul style=\"\"><li>What CPA is and why it&#039;s so profitable</li><li>The best offers to promote for CPA</li><li>How to drive massive amounts of traffic to your offers</li><li>How to scale up your CPA business to six-figures or more</li><li>And much much more!</li></ul><p>This course is your one stop shop for getting all the inside info about how to actually profit from running CPA offers.</p><p>Your not going to have to spend hours a day learning this method either, this can be built into a very profitable business, with as little as 30 minutes a day of</p><p>Stop wasting time trying to learn this by yourself, this course simplifies the entire process and will help you build your online business!</p><p><strong style=\"\">Every minute you wait, you are actually loosing money that you could be earning from CPA!</strong></p><p><strong style=\"\">Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "Getting Started With CPA: Dominate CPA In 5 Simple Steps", 
    "price": "20.00", 
    "instructors": "Francesco Iantorno", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464772_b2f3_3.jpg", 
    "course_url": "https://www.udemy.com/makemoneywithcpa/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T07:22:02Z"
}