{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>UPDATED MARCH 2016!<br></p><p>Learn how to create and manage profitable Google AdWords campaigns to get new customers and grow your small business’s bottom line.</p><p>You will follow step-by-step guides to build your Google AdWords account and learn advanced tips from an agency pro who has managed millions of dollars in ad spend.<br><br><strong>Use Google AdWords to Grow Your Small Business and Make a Lot of Money</strong></p><ul><li>Pick the right keywords</li><li>Write ads that converts visitors into customers</li><li>Get your ads higher and bigger than your competitors’</li><li>Use web and call tracking to know exactly how much money Google AdWords is making you</li><li>Send people to the right pages on your website to increase your conversion rate</li><li>Learn from a director at a top-rated Google Partner ad agency</li></ul><p><br><strong></strong></p><p><strong>Google AdWords Can Be a Money Pit or a Profit-Generating Machine. Let's Build a Machine.</strong></p><p>Use Google AdWords to get people to your website who are searching for the products or services that you sell, at the exact moment that they are searching. Leads don't get hotter than that! You can show ads to people searching Google anywhere in the United States, (hey, the whole world!) or in a single zip code.</p><p>John Horn is the director at an advertising agency that Google ranks in the top 5% of Google Partners worldwide for performance and customer care. He manages millions of dollars of ad spend for companies ranging from billion-dollar behemoths to tiny local businesses. If you want to use Google AdWords to make money, this course is right for you.</p><p><strong>This Course is NOT for:</strong></p><ul><li>People training for Google's AdWords exams</li><li>Large companies planning to spend $10,000s on AdWords</li></ul><p><br><strong></strong></p><p><strong>This Course IS for:</strong></p><ul><li>Small and medium businesses who want to make money using AdWords</li></ul><p><strong></strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Google AdWords for Small Business: Secrets of an Agency Pro", 
    "price": 0, 
    "instructors": "John Horn", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706044_8b5d_2.jpg", 
    "course_url": "https://www.udemy.com/google-adwords-for-small-business-secrets-of-an-agency-pro/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T23:18:59Z"
}