{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Google Adwords is an essential tool for getting your product or service found online. As many as 65% of people click on a paid ad when searching for a product or service online. And businesses make an average of $2 in revenue for every $1 they spend in ads!</p><p>This course is meant for the small business owner, entrepreneur, or start-up that wants to advertise their product or service online, but cannot afford to pay an agency. Most agencies charge a flat rate (usually around $500 <em>minimum</em>), or a certain percentage of your monthly ad spend (usually 15%). Taking this course will allow you to save those funds that you would be paying someone else, and put them towards your ads! <br></p><p>This course is intended to teach you everything you need to know to run successful Google Adwords campaigns. I will help you make more sales, gain more leads, and increase your conversions. I will teach you the difference between CPA and CPC, help you understand how bidding works, how to write winning ads, setting up conversion tracking, walk you through how to conduct proper keyword research, and much more!</p><p>There are no materials required for this course. You will however need a Google Adwords account and email address you can link to your account. Don't have one? No problem. I can help you with that too! You may find it easiest to go through this course, listen, and take notes, then go back later and follow along on your own account. Do whatever is best for you! </p><p>The course will take about 10 hours to complete, but you should take many breaks and go back through any material you don't understand. The first part of this course is the set-up and creation of your first campaign. Part 1 is intended to be very basic and get you up and running quickly. In part 2 I will go through some of the more advanced techniques and features that the Adwords platform offers. I will dive deeper into bids, explain ad extensions, conversions, and more. In part 3 we will review some of the other programs, platforms, and features such as shopping campaigns, analytics, webmaster tools, merchant center, and Adwords Express. These tools will help you make the most of your campaign and let you use many of the other fantastic tools Google offers at no charge! If you are serious about advertising your business, then you <em>need</em> these tools! <strong>Bonus</strong>- Part 4 is where the excitement is. I will reveal many of the very same tips, tricks, and techniques that I use in my own agency. Some of these techniques have helped me get my clients conversion rates of over 30%! Even Google was shocked when I told them what I was doing (true story)! These tricks helped my agency propel into the top 1% of all Adwords agencies, and have helped us win Google Allstars competitions in 2012, 2013, and 2014!</p><p>Bottom line- if you're serious about your business and want to take it to the next level, you <em>need</em> to know Google Adwords. This course will help get you there! This course includes updates as they are implemented. This means that when the Google Adwords platform is updated, or a new feature is released, a new video will be added. This will help keep you up to date and on top of the latest and greatest from the worlds #1 search engine- all for 1 low price!</p><p>If there is something in this course that is not clear, or if I have missed something you want to learn about, please let me know. I welcome your comments and feedback!</p><p><br></p>", 
    "end_date": null, 
    "title": "Google Adwords Beginner To Advanced w/ Bonus Tips & Tricks", 
    "price": "30.00", 
    "instructors": "Nicole Farley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649122_eab8_3.jpg", 
    "course_url": "https://www.udemy.com/google-adwords-beginner-to-advanced-w-bonus-tips-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T19:48:40Z"
}