{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong><em><em>JOIN OVER 5400 SUCCESSFUL STUDENTS!! <em>LIMITED TIME SPECIAL RATE!!</em></em></em></strong></em></p>\n\n<p>\t<em><strong>TOP RATED COURSE! ***** 24 - 5 STAR REVIEWS!! <em>COURSE UP-TO-DATE AS OF JUNE 2016!</em></strong></em></p>\n\n<p><em><strong><em>BONUS UPDATE: LECTURE 12 - </em></strong><strong>If your customer management software does not have a way to track your reviews consider using this simple Excel template. You can track all of your reviews in one file for the year.</strong></em></p>\n\n<p><strong><em>\"</em><em>Reviews are the backbone of Local SEO and Online reputation, in this course Tom explains how to get reviews for your online business. No-Fluff...I highly recommend it to anyone\" </em></strong><strong>Faisal, Udemy Student</strong></p>\n\n<p>\t<em> No matter what kind of business you have. If you are selling a product or service, online or offline, local, national or worldwide, your business needs to get control of and start leveraging positive online reviews on Google Plus, Yelp, Facebook, Yahoo and more! This course covers: </em>  </p>\n\n<p>\t<strong> - How to create an endless source of free, new leads for your business </strong>  </p>\n\n<p>\t - How to gate or control which customers will write online reviews for you</p>\n\n<p>\t<strong> - How to build or rebuild your online reputation (social proof) and your national and local search engine optimization with online reviews...BECOME A ROCK STAR IN YOUR LOCAL MARKET!</strong>  </p>\n\n<p>\t - What the most popular review sites are and how to find the review sites specific to your industry</p>\n\n<p>\t<strong> - How to receive local and national attention with your online reviews</strong>  </p>\n\n<p>\t - How to leverage your new and existing positive customer reviews for maximum benefit</p>\n\n<p>\t<strong> - How to handle negative and fake reviews about your product, service or company </strong>  </p>\n\n<p>\t - How to handle a complaining customer</p>\n\n<p>\t<strong> - How to develop a systematic approach to handling your online review program in just 30 minutes or less per week </strong>  </p>\n\n<p>\t - And so much more!</p>\n\n<p>\t<strong> All using only legitimate strategies….only real customers and real reviews! No black hat t</strong><strong>echniques</strong><strong>, reputation management firms, or fake reviews allowed!</strong>  </p>\n\n<p>\t<strong> Plus, you get 10 fully customizable email, letter and webpage templates included </strong>  </p>\n\n<p><strong><em>\"</em><em>I plan on using some of the tips I received from this course in my business. There were a lot of things about reviews that I learned that I was unaware of. The instructor has a pleasant voice and the course was interesting.\"</em> Lora, Wedding Officiant &amp; Author</strong></p>\n\n<p>\t Whether you are thinking of starting a business or you are a long time entrepreneur, managing and leveraging your customer's online reviews are vital to your businesses success! In the last few years online reviews and sites have exploded across the internet, Yelp, Google Plus, Yahoo Local, Bing and so many more. Ask yourself this question. What did you do before the last time you made a purchase? Odds are that you looked for online reviews of the product/service and the company (or both) before you made a purchasing decision. According to a recent study by Dimensional Research, 90% or 9 out of 10 customers claimed positive reviews influenced their purchasing decision. On the flip side, 86% said their buying decision was influenced by negative online reviews!</p>\n\n<p>\t Now try this. Pretend to be a potential customer for <em>YOUR</em> business. Type in a Google search with your business name followed by the word “reviews\"…Gulp! Did you do it or were you too afraid of what might come up? If you were not happy with the results of this search, what can you do? A lot actually! In this course you'll learn why online reviews are critical for attracting more clients and sales. I'll show you what review sites all businesses should target and how to find the ones specific to your industry. We'll cover how to get your customers to give you those awesome reviews and then how to leverage them for their maximum positive impact. Plus if you've gotten negative reviews in the past, I'll show you how to bury those with positive reviews and lessen their impact on your business. With this course you'll get 10 email, letter and webpage templates to use, many resources and more! Sound like a lot of work? I'll show you how to spend less than 30 minutes per week on it! Are you envious of those customer service awards received by some businesses? I'll show you how to receive those as well!</p>\n\n<p>\t Let's get started!</p>\n\n<p><strong><em>\"</em><em>This course has given me a way to get though the \"review bottleneck\".</em> <em>I work hard to produce high quality results for my clients and many of them are tremendously happy with the work I produce. My problems has always been that even when I ask (verbally) for them to review my work it generally doesn't happen, and I didn't understand why! Tom's course has given me not only the tools, but also the understanding of the process I need to properly encourage them to create and post positive reviews. On top of all that he also gives you a way to use reviews as a feedback mechanism to help improve your product or service delivery without damaging your public reputation. I can't tell you how many times I would like people to tell me what they are REALLY thinking when they don't want to. Tom's system helps with that as well.</em><em>\" </em>Scott, Udemy Student</strong></p>\n\n<p><em>May 2015 Update: BONUS lecture 36: 5 minute overview of using my system for wedding professionals, DJs, caterers, florists, hotels, etc. Leverage your wedding marketing with online reviews on TheKnot, WeddingWire, Google, Yelp and more! Learn do it yourself reputation management to increase your leads and sales this wedding season.</em></p>\n\n<p><em>April 2015 Update: Lecture 27 &amp; 28 - Yelp! Tips and tricks on how to master this popular review website! How to get those hidden or \"not recommended\" reviews to show up and a template for your Yelp reviewers!</em></p>\n\n<p><em>March 2015 BONUS UPDATE: Lecture 35 - 36 More Online Review Websites and Business Listing Websites To Consider (for all kinds of businesses)</em></p>\n\n<p><em>January 2015 Update: BONUS 2: Lecture 25 - Wedding Professionals template, photographers, DJs, formal wear shops, what can you do right now to leverage your reviews for the busiest booking season of the year? Get your previous clients to review you on all of the review sites like WeddingWire and The Knot!</em></p>\n\n<p><em>December Update: BONUS 3: Lecture 24 - Udemy Instructor template, how to leverage your Udemy course reviews onto other social media and review sites!</em></p>", 
    "end_date": null, 
    "title": "Google, Facebook, Yelp Online Review Marketing Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Tom Kenemore", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298532_d979_8.jpg", 
    "course_url": "https://www.udemy.com/fans-on-fire-turn-reviews-on-google-facebook-etc-into-cash/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-11T17:51:28Z"
}