{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>&gt;&gt;UPDATE März 2016 - Google ändert die Spielregeln bei Adwords&lt;&lt;</strong></p><p><strong>++29.01.16 Aktualisierung Vorteile Google Adwords++</strong></p><p><strong>Google Adwords Optimierung</strong></p><p>Kaum eine anderes Produkt von Google spaltet die Nutzer und ehemaligen Nutzer so wie Google Adwords.</p><p>Während die einen auf Adwords schwören und einen Großteil der Neukunden über Adwords gewinnen sind die anderen der Meinung dieses Art zu werben bringt nichts, ist zu teuer und zu schwer zu bedienen.</p><p>Dieser Kurs soll mit diesen Vorurteilen aufräumen und allen unvoreingenommen Unternehmern die Möglichkeit geben ebenfalls von den fantastischen Möglichkeiten von Google Adwords zu profitieren.</p><p>Sie werden in den nächsten drei Stunden lernen, wie Sie Ihr Konto eröffnen und ihre erste Kampagne mit Anzeigengruppen, Anzeigen und Suchworten anlegen.</p><p>Sie werden lernen welche Kennzahlen besonders wichtig sind und wie Sie dieses verbessern können.</p><p><strong>Sie werden lernen, wie Sie, getreu nach dem Motto dieses Kurses mehr Klicks zu niedrigeren Preisen erzielen können und damit zum einen Ihren Wettbewerbern mehr als einen Schritt voraus sein werden</strong> und zum anderen gezielt qualitativ hochwertige Kunden und Kaufinteressenten gewinnen.</p><p>Der Kurs ist so aufgebaut, dass Sie zuerst lernen die richtigen Ziele (Keywörter) zu wählen um anschließend in einem Schnelldurchlauf alle wichtigen Elemente einer erfolgreichen Optimierung kennenzulernen. </p><p><strong>Sie erhalten den roten Faden um zu verstehen welche Punkte für den Erfolg richtig sind.</strong></p><p>Danach arbeiten wir in einer realen Situation Punkt für Punkt genau durch. D.h. auch völlig ohne Vorkenntnisse können Sie durch einfaches Nachmachen alle wichtigen Punkte erlernen.</p><p>Zum Schluß werde ich Ihnen zeigen, wie Sie Ihren Erfolg messen können bzw. was Sie nachbessern müssen um erfolgreich zu werden.</p><p>Die Masse der Lektionen sind Bildschirmpräsentationen in denen ich Ihnen in einer realen Situation in echten Adwordskonten zeige wie es geht. So können Sie am einfachsten erlernte Inhalte auf Ihr Konto übertragen.</p><p><strong>Fazit: Wenn Sie schnell Neukunden über das Internet gewinnen möchten ohne wochenlang an Ihrer Webseite zu basteln, dann sind Sie hier richtig.</strong></p><p>Ich zeige Ihnen wie es geht. Versprochen.</p><p>Ihr</p><p>Norbert Weber</p>", 
    "end_date": null, 
    "title": "Google Adwords: mehr Klicks - weniger Kosten", 
    "price": "20.00", 
    "instructors": "Norbert Weber", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643140_8abf_4.jpg", 
    "course_url": "https://www.udemy.com/google-adwords-kurs/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T08:22:38Z"
}