{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">&quot;</strong><strong style=\"\">This is a great course that explains in depth everything that you would need to know to properly set up and manage an AdWords account. I would highly recommend this class for anyone wanting to learn AdWords.&quot;</strong> - <em style=\"\">by Chris Zecha</em></p><ul style=\"\"><li style=\"\">Benefit from David Black&#039;s years of experience in the industry, working at the forefront of the PPC market as a consultant, presenter and trainer</li><li style=\"\">Teach yourself and your staff how to expertly research, develop &amp; manage highly profitable Google AdWords campaigns</li>  \t<li style=\"\">Take complete control over your spending and maximise your return on investment</li>  \t<li style=\"\">Manage and optimise your AdWords campaigns like a professional with insightful step by step guidance</li></ul>  <p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">Wipe the floor with your competition by implementing the proven Google AdWords techniques in this course.</strong><br style=\"\"></p><p style=\"\">  \t          We&#039;ll start with the basics; </p><ul style=\"\"><li style=\"\">What Google AdWords is</li><li style=\"\">How the advertising networks works </li><li style=\"\">What factors result in your adverts being displayed</li><li style=\"\">How competing adverts are ranked</li></ul>  <p style=\"\">  \t        With your grounding in the fundamentals of Adwords complete and a full understanding of how to navigate properly within your account, we will move on to how you can:  </p>  <ul style=\"\">  \t<li style=\"\">Identify the most profitable keywords in your market</li>  \t<li style=\"\">Limit wasted clicks with carefully chosen negative keywords</li>  \t<li style=\"\">Structure your Adwords campaigns properly to ensure high ad rank and quality scores</li>  \t<li style=\"\">Boost advert performance with dynamic content</li>  </ul>  <p style=\"\">  \t        At the end of this section you will have both a plan and the tools ready start developing your first optimised campaign.  </p>  <p style=\"\">  \t        Once built the campaigns will need calibrating and precisely targeted to ensure your adverts are only served to audiences with a high chance of engaging with your business. </p><p style=\"\">These steps include:  </p>  <ul style=\"\">  \t<li style=\"\">Targeting specific geographic locations</li>  \t<li style=\"\">Serving your adverts at the optimal times of the day</li>  \t<li style=\"\">Marketing to previous visitors to your web site with remarketing</li>  \t<li style=\"\">Testing ads and landing pages with A:B split testing</li>  \t<li style=\"\">Boosting your ads performance and ROI with campaign optimisation</li>  </ul>  <p style=\"\">  \t      This course will give you and your business a comprehensive step by step guide to <u style=\"\">getting most out of Google AdWords</u>. Whether you want to train you and your staff or simply have a reference you can use any time to help you get better results on advertising.</p><p style=\"\"><br style=\"\"></p>  <p style=\"\">  \t<strong style=\"\">HOW TO USE THIS GOOGLE ADWORDS PPC COURSE</strong>  </p>  <p style=\"\">  \t      You can use this course in 2 ways:  </p>  <ol style=\"\">  \t<li style=\"\">As a complete step by step guide to researching, developing and optimising winning AdWords campaigns. Perfect for teaching yourself or your staff valuable new skills.</li>  \t<li style=\"\"> As a digital handbook that you can refer to or download at any time either on your mobile, tablets or PC. Whenever you need a helping hand on AdWords, you can use this course to find the right answer and direction.</li>  </ol><p><em style=\"\"><br style=\"\"></em></p><p><em style=\"\">--- Course is currently up to date as of April 2015</em> ---<br style=\"\"></p><p><br style=\"\"></p>  <p style=\"\">  \t<strong style=\"\">ABOUT THE AUTHOR</strong>  </p>  <p style=\"\">David Black is one of the UK&#039;s most experienced <strong style=\"\">Certified Google AdWords trainer</strong> &amp; consultant, with over 6 years of experience helping hundreds of businesses to build and manage more profitable PPC campaigns.  </p>  <p style=\"\">  \t      If you have any questions, or would like some AdWords advice, please feel free to get in touch.</p>", 
    "end_date": null, 
    "title": "Google AdWords Business Training", 
    "price": "20.00", 
    "instructors": "David Black", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328394_d5b0_7.jpg", 
    "course_url": "https://www.udemy.com/google-adwords-course-small-business/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T18:51:37Z"
}