{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t         In this course you will discover everything you need to know about hosting popular, profitable webinars, including:  </p>  <ul style=\"\">  \t<li style=\"\">How to research your market and get interested people to join your valuable webinar space.</li>  \t<li style=\"\"><strong style=\"\">Cash converting webinar formats </strong>not every format is right for every market. Learn the ins and outs of different presentation styles so you can discover the one that suits your unique purposes.</li>  \t<li style=\"\"><strong style=\"\">Tips to help you plan and host webinars even on a tight budget</strong> learn where you can save, and where you can cut corners, remember that &#039;you get what you pay for&#039;.</li>  </ul>  <p style=\"\">  \tThis is a succinct and to the point course you will able to get you started straight away.  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">This is a real business model with the potential to help you earn a significant income.</strong>  You will learn crucial information :  </p>  <ul style=\"\">  \t<li style=\"\">Why your mailing list is still the most important asset you own, and how to use webinars to make it even more valuable. </li>  \t<li style=\"\"><strong style=\"\">How webinars can instantly catapult you to expert status</strong> and build your profits along the way. </li>  \t<li style=\"\"><strong style=\"\">The difference between a qualified lead and an unqualified one</strong> and how to fill your webinar room with people that want to buy. </li>  </ul>  <p style=\"\">  \t         That&#039;s just the start, this training is packed full of information.  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">8 proven tactics to engage and entertain your audience</strong> - and keep them coming back again and again.  </p>  <p style=\"\">  \t<strong style=\"\">10 ways on how to not distract your audience and ruin your webinar.</strong>  </p>  <p style=\"\">  \t         Why the content tease doesn&#039;t work any more - and what to do instead.  </p>  <p style=\"\">  \t         7 back-end strategies to help you earn more money - even if you offer your webinar for FREE.  </p>  <p style=\"\">  \t<strong style=\"\">Bonus material Steps bt step guide on Google+ and Google Hangouts.</strong>  </p>  <p style=\"\">  \t         The practically fool-proof technique to attract important Joint Venture partners - this no-brainer tip is so simple, and yet practically no one is doing it!  </p>  <p style=\"\">  \t         Once you&#039;ve got a few free webinars under your belt, it&#039;s time to start really putting cash in your wallet with this profit-pulling business model.  </p>  <p style=\"\">  \t         Why the free webinar model can leave you feeling discouraged.  </p>  <p style=\"\">  \t         How to re-purpose existing content for greater profit - this quick-start formula will get your webinar off the ground in record time.  </p>  <p style=\"\">  \t         Teaching models that are perfect for webinars. You already have all the knowledge you want to make money instructing others - even if you think you&#039;re a beginner.  </p>", 
    "end_date": null, 
    "title": "Growing Your Business with Webinars", 
    "price": "25.00", 
    "instructors": "Maria Nikas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255936_1635_5.jpg", 
    "course_url": "https://www.udemy.com/growing-your-business-with-webinars/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-05T05:40:23Z"
}