{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tWhen a new user lands on your site, you have one of the greatest opportunities available to you - a shot at turning them immediately into an active user.  </p>  <p>  \t       This isn&#039;t easy, and expert practitioners have spent thousands of hours testing and learning how users react to copy, design and other elements.  </p>  <p>  \t       To learn from them, with the help of my assistant at Zirtual (thanks Karmen!) we signed up for and took screenshots of an exhaustive list of some of the world&rsquo;s fastest growing startups &ndash; beginning from the homepage, all the way to dashboard and the initial onboarding email.  </p>  <p>  \t       To date, this is the largest collection of web onboarding flows available - anywhere.  </p>  <p>  \t       On top of organizing the information, I&rsquo;ve gone in and broken down some key takeaways from a cross-section of product types including Facebook, Square, Grouper and others.  </p>  <p>  \t       Who is this product made for?  </p>  <p>  \t       Anyone interested in learning the modern techniques high-growth startups use for accelerated growth. This includes entrepreneurs, product managers, marketers, analysts and startup enthusiasts.  </p>  <p>  \t       You might be thinking, can&#039;t I get all of this information by signing up for each of these? Yes! And for some you should &ndash; they&rsquo;re great products.  </p>  <p>  \t       However even if you&rsquo;re experienced in product and growth, access to all these flows &ndash; which have painstakingly taken dozens of hours to find, sign up for, label, screenshot and saving appropriately (not to mention all of the accounts you&rsquo;d need to confirm and potentially unsubscribe from) is well worth it.  </p>  <p>  \t       --  </p>  <p>  \t       Look forward to having you in the course.  </p>  <p>  \t       Conrad Wadowski  </p>", 
    "end_date": null, 
    "title": "Growth Hacking: User Onboarding", 
    "price": "30.00", 
    "instructors": "Ankur Nagpal, Conrad Wadowski", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/68750_fc2f_7.jpg", 
    "course_url": "https://www.udemy.com/growth-hacking-user-onboarding/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-23T18:04:55Z"
}