{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p>Do you want to build a quality email list? Are you struggling with a non-responsive list? </p><p>Master these hacks to finally take control of your email list to build insanely deep relationships with your list and set your lists up for maximum profits.</p><p>You will learn why permission based email marketing is essential. You will also learn why having an ethical bribe is critical for your website. Giving away something valuable will encourage visitors to subscribe and you get that valuable email address.</p><p>You will also discover that letting your subscribers know that their privacy is paramount. </p><p>You will be given a crash course in how to write emails, how to write descriptive titles and what to include in your emails. </p><p>Discover which email providers come highly recommended and learn why analyzing email responses can make or break your bank account. You will also be given an insight into writing emails for Holidays and Special Occasions (get this right and you can bank some serious cashflow consistently!)</p><p>This course comes with a 30 day money back guarantee, so take this course today to learn how to Hack your Email List</p>", 
    "end_date": null, 
    "title": "Hack Your Email List - Discover How To Build a Quality List", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644430_b5ae_3.jpg", 
    "course_url": "https://www.udemy.com/email-list/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T05:13:30Z"
}