{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t        If you sell anything online or offline, then this course is for you.  </p>  <p>  \t        The focus is on getting leads online for your business by building an ultra-targeted email list that you can market to repeatedly and make money from every time you send them an email.  </p>  <p>  \t        Speed is of the essence.  </p>  <p>  \t        This is why the focus is on teaching you how to pay for traffic to your site and to recover all of your investment in 30 days or less.  The secret to doing so is to create a high converting sales funnel which allows you to sell multiple products to your customers in multiple ways.  </p>  <p>  \t        The key is in having multiple opportunities to make a sale to these customers.  The best part is that the process is automated so you only have to set it up once and then your only job will be to send traffic to a single web page.  </p>  <p>  \t        This automated process is also known as your front-end funnel.  Once you understand how to maximize your revenue from this funnel you will be able to spend more than your competitors to acquire a customer at breakeven or better (which is essentially for free).  </p>  <p>  \t        This course consists of 16 fluff-free modules which will take you no more than 1 hour to consume.  Each module teaches a different, yet very important concept that makes the entire process work.  </p>  <p>  \t        When you are done with this course you will know more than 99% of business owners and marketers and you should be able to multiply your current revenue many times over.  This is the ultimate return on investment or ROI vehicle.  </p>", 
    "end_date": null, 
    "title": "High converting Sales Funnels - List Building On Steroids", 
    "price": "30.00", 
    "instructors": "James Molfetas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265988_4e6b_3.jpg", 
    "course_url": "https://www.udemy.com/high-converting-sales-funnels-list-building-on-steroids/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T20:47:43Z"
}