{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Webinars have become in the last years one of the most powerful tool that a business owner can use online to market and sell, especially High Ticket Offers.</em></strong></p><p>Marketers from all around the world use Webinars to connect better with their audience, educate theri market, position themselves as authorities and sell much more in their business.</p><p>However, a lot of people that want to run a business online or are doing it already<strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"> don't use Webinars because of techy obstacles and in 90% of the times because of the costs that runing Webinars through dedicated platforms have.</em></strong></p><p>This course was created to solve this problem by teaching a simple but useful tehnique that <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">will allow you to create your own hosted Webinars with an UNLIMITED NUMBER OF ATENDEES and with the possibility to add DIFFERENT PLUGINS AND ELEMENTS TO YOUR WEBINAR PAGE for FREE.</em></strong></p><p>The course is fully delievered in video format and will take less than 1,5 hours of your time to go through and learn the concepts exposed. </p><p>I highly encourage you to enroll in this course if you are an online marketer, business owner or you need to have a strong online presence and connect with your audience. </p><p>I strongly believe that in the start of any business you need to allocate most of your resoruces to the element that brings you the most value and competitive advantage and that is why I've created this course for you, so you can invest your budget in the things that brings most value for your business and not in any unnecessary expensive monthly webinar service.</p><p><strong><em>So what are you still waiting for? Enroll in the course right now and let's get you preapred for your first Webinar!</em></strong></p>", 
    "end_date": null, 
    "title": "How to Create your Own Self Hosted Webinars with No Costs", 
    "price": 0, 
    "instructors": "Sorin Constantin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/819814_3a1b.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-amazing-webinars-for-free/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-12T13:46:47Z"
}