{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">We all want to build something BIG.</strong></p><p style=\"\">But if you&#039;re not building an email list and building a relationship with that list, you&#039;re without a doubt leaving followers, and money, on the table.</p><p style=\"\">Why?</p><p style=\"\">Because email is the most powerful marketing tool available to us today -- so powerful even that Toby Fallsgraff who was Obama&#039;s 2012 email director gave a talk on &quot;How the right email fundraising strategy helped win an election&quot;. That&#039;s not an understatement considering the fact that they raised over $690 million through email alone. </p><p style=\"\">But you don&#039;t have to be running for office to use it&#039;s power. Whether you have a small restaurant, an online business or a non-profit, email marketing is your key to growth and success.</p><p style=\"\">If you&#039;re looking for an in depth look at every aspect of email marketing, this isn&#039;t the course for you yet (because there are a lot of lectures yet to come). <strong style=\"\">But if you want to learn the key principles to email success and how to get started, this is your course. Inside you&#039;ll learn: </strong></p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">1. The difference between BRAND BUILDING and DIRECT-RESPONSE MARKETING -- and why you NEED direct response</strong></p><p style=\"\"><strong style=\"\">2. Why email marketing is all about relationships (and not selling)</strong></p><p style=\"\"><strong style=\"\">3. The V+F+I+SR Relationship Formula to build powerful relationships through email</strong></p><p style=\"\"><strong style=\"\">4. How to set up your email marketing service and build your first list</strong></p><p style=\"\"><strong style=\"\">And much more...</strong></p><p style=\"\">In fact, there are 6 full sections that will be added to the course in the weeks and months to come. And as a student, you get lifetime access to all of it when it&#039;s released. </p><p style=\"\">And as in all my courses, my goal is to challenge conventional wisdom and share with you a new way of looking at something important. This course is no different. </p><p style=\"\">To enroll, just click the &quot;Take This Course&quot; button.</p><p style=\"\">I&#039;ll talk to you soon.</p><p style=\"\">Brandon</p>", 
    "end_date": null, 
    "title": "How To Triple Your Sales With Email Marketing", 
    "price": "20.00", 
    "instructors": "Brandon Hakim", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456132_cd1a_4.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-get-subscribers-and-double-your-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T21:25:24Z"
}