{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Introduction</strong>\n\n  </p>\n\n<p>This Google AdWords Audit course provides in-depth instructions, using step by step screencasts, to learn how to perform a complete analysis on your Google AdWords campaign. Although Google AdWords is a \"Do It Yourself\" platform, there are many default settings and layers of functionality that don't necessarily work your favor. This course reveals where to look in your account to find the areas that are causing you to waste your Google AdWords Budget. \n\n  </p>\n\n<p> <strong>Learn How To Audit Your AdWords Account To Improve Results &amp; Stop Wasting Click Spend!</strong> \n\n  </p>\n\n<p><strong>You'll Learn How To:</strong>\n\n  </p>\n\n<p>- Optimize key campaign settings\n\n  </p>\n\n<p>- Implement advanced account structure\n\n  </p>\n\n<p>- Improve your overall campaign performance\n\n  </p>\n\n<p>- Eliminate wasted click spend\n\n  </p>\n\n<p> <br><strong></strong></p><p><strong>Optimize Your Google AdWords &amp; Stop Leaking Cash </strong>\n\n  </p>\n\n<p>Understanding your AdWords account set up is so important for the success of an advertiser's AdWords campaign. Many people don't realize the impact that a campaign's set up actually has on their account, or even how much click spend they're wasting. We dive deeply into the details of proper account structure and reveal just how to find what needs to be done to improve your campaign's overall performance.\n\n  </p>\n\n<p> \n\n  </p>\n\n<p><strong>Course Overview</strong>\n\n  </p>\n\n<p>This course is ideal for AdWords Account Managers, Pay Per Click Agencies or Entrepreneurs who are interested in selling the services of preparing detailed third party Google AdWords Audits. After completing this course, you will have a deep understanding of proper AdWords Campaign set up and know how to fix the issues that you find in your account. \n\n  </p>\n\n<p> \n\n  All content is taught using screencast, step by step instruction, so that you can easily follow &amp; see what changes are needed to be made in your account. You'll learn what campaign settings are key and why they make a difference. You'll understand advanced campaign set up structure, and why that is so important. You'll discover the elements of your account that are causing poor campaign performance and what needs to be done to improve that. And finally, you'll know where the majority of your click spend is being wasted.</p>", 
    "end_date": null, 
    "title": "How To Do A Google AdWords Audit & Stop Wasting Money Now!", 
    "price": "50.00", 
    "instructors": "Stephen Osborne", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/844346_1e51_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-a-google-adwords-audit-stop-wasting-money-now/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-09T23:42:19Z"
}