{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><strong>5000 + students</strong> \n\n</li></ul>\n\n<ul><li><strong>150 reviews with an average      of 4.4/5</strong> \n\n</li></ul>\n\n<ul><li><strong>Business podcast 'Breaking      Biz' with over 10,000 subscribers </strong>\n\n</li></ul>\n\n<p> \n\n  </p>\n\n<p>Hello and welcome! \n\n  </p>\n\n<p>This course is designed to simplify the best practices of setting up an engaging YouTube channel so you can understand how to reach and engage your audience and improve your chances of building an audience and make money from your YouTube Channel \n\n  </p>\n\n<p><strong>Understand the basic processes of developing your YouTube channel using proven, simple and effective techniques.</strong> \n\n  </p>\n\n<ul><li>Discover what makes great content      \n\n</li><li>Learn how to properly build      a brand that your fans appreciate  \n\n</li><li>Find out the simple steps      you can implement to really engage your audience \n\n</li><li>Hear real life case studies      of brands and individuals using YouTube to great effect \n\n</li><li>Understand the different      formats of YouTube advertising \n\n</li></ul>\n\n<p><strong>Knowing how to create and run a YouTube channel is an essential element of today's online marketing requirements.</strong> \n\n  </p>\n\n<p>In the course you will learn how to avoid 'tired' content and understand what it takes to really gain the interest of online browsers. You'll learn about the importance of developing your niche, finding your tone and how to create material that people want to share. \n\n  </p>\n\n<p>From understanding the basics, through to learning simple techniques, you will leave this course ready to engage potential customers on YouTube.\n\n  </p>\n\n<p>I designed this course to offer you an easy to follow, comprehensive guide to starting and growing your YouTube channel. YouTube marketing is a topic that can be made complicated very quickly. This is why I have prepared slide presentations with a running commentary, so you can enjoy the visuals and explanations that go with them. \n\n  </p>\n\n<p>I hope you enjoy learning the basics, and I look forward to connecting with students who have any requirements or questions. \n\n  </p>\n\n<p><u>Recent Udemy feedback</u> \n\n  </p>\n\n<p><strong><em>\"I'm very impressed with how many great tips there were in this short course. Good job. This guy clearly knows what he's talking about. I was going to give it 4.5 stars for being too short -- but I thought that didn't make sense since what is there is excellent.... Just what I've been looking for.\"</em></strong> \n\n  </p>\n\n<p><strong><em>\"Great Mentor, and also the good method of teaching. I am a 16+ kid from India and I was looking for the way that could help me get some basic awareness about starting a business and the responsibilities of an entrepreneur. Got some extra info regarding marketings and steps to follow to reach out the correct audience. What to do and what not and even got to know more about the personal point of views from a bunch of successful persons. Overall: A quick course and very helpful for getting the rough ideas and guideline for becoming an entrepreneur.\"</em></strong> \n\n  </p>\n\n<p><strong><em>\"Good information and very motivational. Once I started I couldn't stop till I watched all of them.\"</em></strong>\n\n  </p>\n\n<p><strong><em>\"The course is presented in great way, every thing is almost perfect. Using some real cases in explaining some point is really good. The information which are presented are well organized so it is easy to remember.\"</em></strong><strong></strong></p>", 
    "end_date": null, 
    "title": "How To Create An Engaging YouTube Channel", 
    "price": "20.00", 
    "instructors": "Fred Williams", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854818_1ab3_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-engaging-youtube-channel/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T08:36:20Z"
}