{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Hi, I'm Isaac Rudansky and welcome to my complete remarketing / retargeting course where you're going to learn how to profitably re-engage with your abandoning website visitors to get them to come back to your site at the right time and with the right message.</strong></p>\n\n<p>This course pulls from a huge variety of experience managing hundreds of unique retargeting ads campaigns for a broad range of clients in almost every vertical out there. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Our clients often ask me,<strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"> \"What is retargeting and how does it work?\" </em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Retargeting, which is also referred to as remarketing (they're the same thing) is any digital advertising campaign that targets ads promoting your products and services to people who had previously bounced off your site. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>95% of your website visitors do not convert (or take any revenue-generating action) on their first visit. I am going to teach you <strong class=\"redactor-inline-converted\">the art and science of retargeting </strong>so you can have a chance to convert the vast majority of your visitors that simply weren't ready to convert on their first visit. </p>\n\n\n\n<p>Retargeting is the most effective way to bring those users back (through your actual, live retargeting ad campaigns), at the precise time that they're ready to convert. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I'm going to explain exactly how retargeting works from a technological perspective, and I'm going to show you how the technology has matured and advanced through the years. Simply put, retargeting is accomplished through dropping cookies on your visitors' browsers which allows your retargeting platform to follow that user around the internet. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Cookies are dropped on your visitors' browser through a little piece of code that you put on your site, often referred to as a pixel. If you're remarketing with AdWords, then AdWords is going to supply the pixel for you to place on your site. If you're remarketing with Adroll, then Adroll will supply their cookie for you to place on their site. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>All this talk of cookies, pixels and tracking codes may sound complex, but in fact it's really easy to learn once you get the hang of it. The technology isn't the important part of this course .... what I teach you about understanding your customers psychologically and how to actually configure, develop and optimize profitable retargeting campaigns is where the true value lies.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Retargeting remains one of the most effective forms of online advertising, and it's used by your competitors to convert the majority of their traffic. Experts predict that within the next few years, most if not all display ads inventory on the web will be remarketing and retargeting ads. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Retargeting is so effective because it <strong class=\"redactor-inline-converted\">helps you stay in the forefront of your customers' minds </strong>and enables you to bring them back to your website when they're actually ready to convert. Every time your customer engages with one of your retargeted ads, you increase your brand recognition and make it all the more likely that that shopper will eventually become a customer of yours.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Retargeting campaigns typically see much higher click through rates and conversion rates than traditional search and display campaigns, which further illustrates how important it is that you have the knowledge and skills to develop your own successful remarketing and retargeting campaigns.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Using Google AdWords Remarketing campaigns, Google Analytics, Google Tag Manager and more, I will teach you step by step how to finally get the maximum value out of your website visitors with highly successful retargeting campaigns.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>For much less than the price of one dinner out with the family, you're going to get <strong class=\"redactor-inline-converted\">over 10 hours of video lectures,</strong> access to our <strong class=\"redactor-inline-converted\">student discussion forum</strong>, and the ability to <strong class=\"redactor-inline-converted\">ask me any questions you may have</strong> as you progress through the course. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>On top of all that, you get <strong class=\"redactor-inline-converted\">lifetime access</strong> and a <strong class=\"redactor-inline-converted\">30 day, 100% money back guarantee!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><u><strong class=\"redactor-inline-converted\">ZERO Experience Required</strong></u></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">In this course you will learn:</strong><br></p>\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">What retargeting and how does it work? </strong></li><li><strong class=\"redactor-inline-converted\">What are remarketing campaigns in Google AdWords?</strong></li><li><strong class=\"redactor-inline-converted\">The technology behind retargeting and how \"follow-me\" ads actually get served</strong></li><li><strong class=\"redactor-inline-converted\">The history of ad exchanges and ad networks</strong></li><li><strong class=\"redactor-inline-converted\">How to look at your website visitors from a psychological perspective </strong></li><li><strong class=\"redactor-inline-converted\">How to plan and develop your remarketing lists</strong></li><li><strong class=\"redactor-inline-converted\">The concepts of the buyers funnel and how to determine where in the funnel your visitors are </strong></li><li><strong class=\"redactor-inline-converted\">The concept of engagement and how to use intent signals to your advantage</strong></li><li><strong class=\"redactor-inline-converted\">How to use Google Tag Manager to track advanced audience segments like scroll depth tracking and on-site session timers</strong></li><li><strong class=\"redactor-inline-converted\">How to deploy your tags and variables through Google Tag Manager </strong></li><li><strong class=\"redactor-inline-converted\">How to use Google Analytics to track the most important metrics and data</strong></li><li><strong class=\"redactor-inline-converted\">How to set up, optimize and manage your remarketing campaigns inside Google AdWords</strong></li></ul>\n\n\n\n\n\n\n\n<p><em><strong>... and much, much more!</strong></em></p>\n\n\n\n\n\n\n\n<p><em></em></p>\n\n\n\n\n\n\n\n\n\n<p>So what are you waiting for? </p>\n\n\n\n\n\n<p>Click the \"take this course\" button now, or feel free to preview some of the lecture below. </p>\n\n\n\n\n\n<p>Either way, I really appreciate you taking the time to check out this course, and I can't wait to see you in a couple minutes on the other side! </p>\n\n\n\n\n\n<p>Cheers, <br>Isaac </p>", 
    "end_date": null, 
    "title": "How Retargeting Works–The Complete Guide To Retargeting Ads!", 
    "price": "40.00", 
    "instructors": "Isaac Rudansky", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821658_b20b.jpg", 
    "course_url": "https://www.udemy.com/how-retargeting-works/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T04:28:24Z"
}