{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">5 STARS</strong></em></p><p><em style=\"\">&quot;I LOVE this course and is the BEST at Udemy so far covering Google Adwords! The Copywriting tips and insights on keywords alone will make back your investment 10x. The numerous case studies are the icing on the cake.&quot;</em></p><p><strong style=\"\">Lenny Ramirez</strong></p><p><em style=\"\">----------------------------------------------------------------------------------------------------------------------------</em></p><ul style=\"\"><li>FACT #1: your business is never going to grow huge unless you scale it up</li>  \t<li>FACT #2: Google AdWords is one of the most powerful online advertising channels</li>  \t<li>FACT #3: Master Google AdWords and you can scale your business up and up and up...</li>  </ul>  <p style=\"\">  \t      Dear fellow bootstrapper...  </p>  <p style=\"\">  \t      If you&#039;ve been looking at Google AdWords for a while now, but still can&#039;t figure it out, this course is for you. I&#039;ve been an online marketer for 7 years now. I know Google AdWords is absolutely crucial to being top of the food chain. I also know it&#039;s easy to screw up and set up wrong.  </p>  <p style=\"\">  \t      I created How To Profit With Google AdWords to show entrepreneurs just how powerful it can be. I choose 5 completely unrelated products and walk through how to go from keyword to profit.  </p>  <p style=\"\">  \t      To save you from blowing your precious ad dollars, I also go through the top 5 biggest keyword research mistakes. You&#039;ll learn:  </p>  <ul style=\"\">  \t<li>why going with a keyword that has a lot of searches can burn a hole in your wallet without any profit to show for it,</li>  \t<li>the importance of the purchase cycle of the searcher and how to get them when they&#039;re most likely to give you money,</li>  \t<li>the dangers of choosing keywords that aren&#039;t related to your product.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">But what if my business is hard to define with keywords?</strong>  </p>  <p style=\"\">  \t      I&#039;ve included a special BONUS module: Introduction to the Google Display Network. In it, I&#039;ve chosen 5 totally random, difficult to define products and explained how they would use GDN to profit.  </p>  <p style=\"\">  \t      Can you really afford not to master Google AdWords? Let Profiting With Google AdWords turn you in the dominant market leader today.  </p>", 
    "end_date": null, 
    "title": "How To Choose Profitable Keywords With Google AdWords", 
    "price": "20.00", 
    "instructors": "Johnson Kee", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397176_7473_2.jpg", 
    "course_url": "https://www.udemy.com/google-adwords/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T12:06:40Z"
}