{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Despite TripAdvisor having been around for a long time now, most hoteliers and general managers don’t really know how to harness its power to the advantage of their hotel. With this course, you will be able to actually manage your rankings, reaching higher and higher than your competition. Learn all the do’s and don’ts of the industry, especially when you are out to get organically gained guests and prospects.</p>    <p>The course contains tips and tricks, as well as details about how to start on your quest to rank higher and reach the top within 90 days. You also get to know why responding to all reviews, be it the positive or the negative ones, is so important. And the best part about these instructions is that they are easy to follow, and you can actually increase your revenue through these best practices.</p>    <p>After you have gotten the responding to reviews part down, you can also try to gauge what goes wrong most often at your hotel or what bothers guests the most. Subsequently, you can try to fix that, or add something to take the glare away from what you are lacking in. After you have taken the course, you will realize there are a lot of little things too, that have always been there but which you have overlooked till now, which can help you rank higher and get more room bookings.</p>    <p>You also get to learn all about your TripAdvisor management page through this video, and the great listening tools which Avijit Arya tells you about. With this course, all the secrets behind effectively managing a TripAdvisor page to your hotel’s advantage is revealed.</p>", 
    "end_date": null, 
    "title": "How your hotel can rank higher on TripAdvisor in 90 Days", 
    "price": 0, 
    "instructors": "Avijit Arya", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749926_6b7d.jpg", 
    "course_url": "https://www.udemy.com/how-your-hotel-can-rank-higher-on-tripadvisor-in-90-days/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T10:23:34Z"
}