{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Have you ever wondered how to build scalable sales funnels that convert cold traffic into customers?</p>\n\n\n\n<p>If the answer to this question is ‘Yes’, then you are in the right place at the right time. \n\n \n\n In this course, you’ll discover how to build a converting sales funnel from scratch, even if you haven’t done it before! </p>\n\n\n\n\n\n<p>\n \n\n <strong>Learn How To Take The Best Seat In The House And Build Funnels That Convert:</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>How To Structure Your Customer Acquisition Funnel</li><li>Step-By-Step Guide To Build A Funnel From Scratch</li><li>How To Write Copy Like A World Class Copywriter</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong><br>Contents &amp; Overview</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course, you’ll learn how to design your sales funnel that will turn cold traffic into repeat customers. </p>\n\n\n\n\n\n\n\n\n\n<p>\n\n \n\n First, we’ll cover what customer acquisition funnels are and why they work. You’ll also discover the #1 mistake to avoid when designing your funnel. </p>\n\n\n\n\n\n\n\n\n\n<p>\n\n \n\n Next, I’ll walk you through the process of designing your product line, based on which you can develop a profitable sales sequence. I’ll walk you through the 4 elements of a customer acquisition funnel and share detailed instructions on how to design products your prospects want. </p>\n\n\n\n\n\n\n\n\n\n<p>\n \n\n Last but not least, you’ll discover how to write a compelling copy for your offers, the No. 1 tool to build your funnel and the three highest points of leverage to optimize your funnel. </p>\n\n\n\n\n\n\n\n\n\n<p>\n \n\n By the time you complete this training, you’ll know all the tools &amp; strategies to create a sales funnel that converts, even if you haven’t done it before!</p>", 
    "end_date": null, 
    "title": "How To Design A Sales Funnel That Converts", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833958_8d73_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-design-a-sales-funnel-that-converts/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T22:49:33Z"
}