{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I don’t need to tell you this… but today <strong>the website is the star player and captain</strong> of the marketing team. Irrespective of the industry you play in.</p><p>Sadly, very few websites live up to this expectation. The majority are just dead wood and an embarrassment for the team.</p><p>This means we miss out on arguably <strong>the most productive, and cost effective, marketing tool</strong> we have at our disposal.</p><p>Why is this happening? Why are most business websites not even earning their keep?</p><p>Because we don’t know how to coach the website into becoming a star performer. But when managed correctly your website can become the STAR:</p><ul><li><strong>Revenue generator, </strong></li><li><strong>Cost saver and </strong></li><li><strong>Relationship builder</strong> of the team.</li></ul><p><br>And that’s exactly why I've put together this course – to give you an actionable <strong>Game Plan to turn your website into the Star Performer of the 2016 Marketing Team</strong>.<br></p><p>More specifically, to give you a proven process to architect your own website game plan that you can then give to your I.T. people, copywriter and designer and say: “<strong>Here’s what I want you guys to do</strong> so that we can get measurable results from this website!”</p><p>But that’s not all...</p><p>Because the website is part of a team, it needs the support of the other players such as email, organic search and social media. And to help you <strong>combine your team into one cohesive kick-ass revenue driving team</strong> I’ve also included a 12-step Master Tactical Game Plan.</p><p>So, what does that mean for you - <strong>should you take this course?</strong></p><p>Well, it depends…</p><p>If you need to <strong>turn a dead, or ailing, website into the star performer</strong> of the 2016 Marketing Team... <em>then yes</em>.<br><br>If you need to <strong>drive measurable results</strong> from a business website... <em>then yes</em>.<br><br>If you are a <strong>digital marketing professional </strong>looking to brush up your website management skills to keep your edge in an increasingly crowded marketplace... <em>then yes.</em></p><p>If you are a <strong>traditional marketing professional</strong> looking to get up-to-speed on the newest trends on using a website to drive business results... <em>then yes.<br><br></em>If you are a <strong>webmaster, website developer, freelancer, consultant, or an agency owner </strong>looking for a proven website management process to expand your service offerings... <em>then yes.</em></p><p>If you are an <strong>employee (or student)</strong> looking to add an in-demand and sought-after management skill to your existing portfolio… <em>then yes. </em>(We’ll give you the skills and a certificate you need to not only talk the talk in the interview, but to truly walk the walk when you get that raise or perfect gig. )</p><p>If you are a crazy-busy <strong>business owner</strong> who barely has time to check the email and sign the checks...<em>then preferably </em><strong><em>NO!</em></strong> </p><p>(But you should have someone on your team go through it, because <strong>you, more than anyone else, need this information...</strong>)</p><p>So if you’re ready to finally grow and win BIG in 2016 with the aid of a results-driven business website that fulfills its role as the star player… </p><p>…then enroll in this special introductory website management course right now before the inaugural price increases!<br><br>-------------------------------------------------------------------------------------------------------------------<br><strong>PLEASE NOTE: </strong><strong>This is an introductory </strong><strong><em>Ex</em><em>ecutive Level </em>marketing </strong><strong>management course - it's about the basic principles of driving business results from a website. </strong></p><p><strong>It's NOT a technical level IT, webmaster, web design, web development, or SEO course. And you don't need any prior technical skills to do this course.</strong><br>-------------------------------------------------------------------------------------------------------------------</p>", 
    "end_date": null, 
    "title": "How To Run Your Business Website and Manage Your Web Vendors", 
    "price": "20.00", 
    "instructors": "Di-Di Hoffman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676310_3074_2.jpg", 
    "course_url": "https://www.udemy.com/website-management/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T09:50:19Z"
}