{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">A step-by-step guide to creating a professional looking, mobile responsive website</strong></p>\n\n<p>In this course, you will get an over-the-shoulder view as I build a responsive website using WordPress together with a premium theme and skin.</p>\n\n\n\n<p>This course is actually the first course in my <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Writer Platform</em></strong> series, which looks at how authors and other creatives can become visible online, engage with their readers or customers and ultimately sell more books and other digital products.</p>\n\n\n\n<p>And I believe, whether you are a writer or another type of creative (or pretty much any type of freelancer), it is vitally important that you have your own online presence.</p>\n\n\n\n<p><strong>This all begins with the creation of a professional looking, responsive website.</strong></p>\n\n\n\n<p>And in the first part of this course, I am going to take you through, step-by-step:</p>\n\n\n\n<ul><li>How to choose a domain name for your website</li><li>How to choose and then set up suitable hosting for your website</li><li>How to propagate your domain to your hosting account</li><li>How to install WordPress and configure the basic settings</li></ul>\n\n<p><br>The second part of the course requires that you purchase both a Premium theme called <em class=\"redactor-inline-converted\">Thesis</em> and a premium skin called <em>Effectus</em>.<br></p>\n\n\n\n<p>This requires some financial outlay, but in my opinion this is quite a small investment if you are serious about making a living, or even a part-time income from your art.</p>\n\n\n\n<p>In this part of the course, I will show you:</p>\n\n\n\n<ul><li>How to set up the Thesis theme to get your website running super fast and benefit from the inbuilt Search Engine Optimisation features of Thesis</li><li>How to set up and customise the Effectus Skin to get an original, professional looking website that is truly mobile responsive</li><li>How to create and add a Header for your website</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><br>Feel free to check out the preview videos that I have enabled for the course, to give you an idea of my teaching style and to determine whether this course is right for you.</p>\n\n\n\n<p>And I hope to see you on the inside. </p>", 
    "end_date": null, 
    "title": "How to Set Up a Responsive Website with Premium Theme & Skin", 
    "price": "20.00", 
    "instructors": "David James Ault", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424160_cd97_15.jpg", 
    "course_url": "https://www.udemy.com/author-website/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T18:54:47Z"
}