{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t          This is a comprehensive training course on how to build a strong relationship with your Email list, and actually make more sales from your email campaigns.  </p>  <p style=\"\">  \t          I created this course based on my own experience and failures early on in my online marketing career.  </p>  <p style=\"\">  \t          If you are just getting started with email marketing or you are just not getting the results you want from your existing email marketing efforts, then this course is for you.  </p>  <p style=\"\">  \t          This Course is made up of 20 Video Lectures and several handouts that help supplement the main course material.  </p>  <p style=\"\">  \t          You should be able to complete this course easily in a single week, but remember you can come back for a refresher anytime.  </p>  <p style=\"\">  \t          I created this course to take you by the hand and walk you through all the topics you need to create and manage your email campaigns and help you build out your sales funnel.  </p>  <p style=\"\">  \t          We start with the purpose of your campaign, The critical skills you must master to really be successful in email marketing  </p>  <p style=\"\">  \t          you will learn how to write, structure and create your email campaigns  </p>  <p style=\"\">  \t          In addition You will learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to      get your subscribers to know, like and trust you</li>  \t<li style=\"\">What      you need to do for them to <strong style=\"\">actually look forward to receiving your      emails</strong> every single day (even sales emails)</li>  \t<li style=\"\">The      one thing you need to know before you send a single email</li>  \t<li style=\"\">How to      organize your email campaigns to <em style=\"\">build credibility and trust</em></li>  \t<li style=\"\">One      easy way to set yourself apart from the rest of your competition</li>  \t<li style=\"\">How to      get your subscribers to actually see you as a <u style=\"\">trusted friend      instead of a marketer</u></li>  \t<li style=\"\">The      exact reason why most people don&#039;t get any results with email marketing      (are you currently doing this right now?)</li>  \t<li style=\"\">The      best types of headlines that actually get your emails opened</li>  \t<li style=\"\">How to      get subscribers to not just open your emails but actually <strong style=\"\">click on      your links as well</strong></li>  \t<li style=\"\">How to      actually build a relationship with your subscribers</li>  \t<li style=\"\">The <em style=\"\">secret      to writing sales emails</em> that your subscribers will actually look      forward to receiving</li>  \t<li style=\"\">The <u style=\"\">one      type of email you must send</u> to build a deeper bond with your list</li>  \t<li style=\"\">How to      properly format your emails for best results</li>  \t<li style=\"\">How      often you should be mailing your list</li>  \t<li style=\"\">Why      making mistakes is actually not a bad thing and how you can still succeed</li>  \t<li style=\"\">How to      stop worrying about all the unsubscribes you get</li>  \t<li style=\"\">The <strong style=\"\">biggest      email marketing myth</strong> you&#039;ve been told</li>  \t<li style=\"\">How to      make money from your subscribers in the long run</li>  </ul>", 
    "end_date": null, 
    "title": "How to write emails your readers can't resist opening", 
    "price": "20.00", 
    "instructors": "Rod Miller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309112_ad86_6.jpg", 
    "course_url": "https://www.udemy.com/the-secrets-of-must-open-email-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-27T17:53:30Z"
}