{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>These WordPress traffic growth tactics have worked for my sites and the sites of coaching clients of mine for years, and continue to work.</p><p>In fact, even through Google updates that caused sites around the world to lose rankings, the sites I worked on continued to do well.</p><p>But, very importantly, the traffic generation tactics and strategies I detail in this course do not depend on Google.  Google traffic is great, but Google likes to change its mind regularly about which sites to reward, and which sites to punish.  So if you're really looking to build a valuable site that gets a ton of traffic, leads and sales, it's vital you diversify your traffic.</p><p>That's what this course is all about... attracting high quality traffic from multiple sources - without - paying for advertising.</p><p>So whether you're:</p><ul><li>New to WordPress but interested in growing your website</li><li>An experienced website owner looking to get more traffic</li><li>A freelancer or agency offering traffic generation services to clients</li></ul><p><br>This course can help you grow website traffic to hundreds, even thousands of visitors a day, surprisingly quickly, and in almost any market.  And very importantly, these results can then continue to come in for years to come, rather than the short term results you get when you pay for advertising.<br></p><p>So by taking this course you get:</p><ul><li>Access to dozens of videos where I've aimed to share everything I know about growing website traffic significantly (and for the long term) without paying for advertising.</li><li>Downloads of many slides so you can refer to them whenever you choose.</li><li>Details on all the traffic generation tactics and strategies I use in my own business.</li></ul><p><br>If you're really diligent, you could go through the entire course in one (long) day making notes and actionable items as you go through it.<br></p><p>Or you could take a more leisurely approach and go through one part of the course a day, or even just go through each part in turn, implement it, then onto the next.  Although be aware all the parts of this course work together, so it's best you start to implement them at around the same time as each other if at all possible.</p>", 
    "end_date": null, 
    "title": "How to Grow Website Traffic With Content & Social Marketing", 
    "price": 0, 
    "instructors": "Louis Allport", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610194_0cac_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-traffic/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T19:40:17Z"
}