{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t   Ever wonder what those internet people are doing to make money online and create finacial freedom? Do you want to create a business that makes money for you as you sit at home in your comfortable clothes and at your own schedule? What makes those internet gurus different from you? This course shows you all of the fundamentals of what it takes to make good money online. If you ever wondered what it is they do, its called internet marketing. As an Internet Marketer you must change the way you think about money, success and the internet. <a class=\"external-link\" href=\"http://peterabundant.com/now\" rel=\"nofollow noreferrer\" style=\"\" target=\"_blank\">Peter Abundant</a>; Master Blogger and Internet Marketer teaches your the fundamentals of Internet Marketing and making money online.  </p>  <p style=\"\">  \t Learn the 3 things that are on the mind of every great Internet Marketer.  </p>  <p style=\"\">  \t Learn the 3 keys to being successful at making money online.  </p>  <p style=\"\">  \t Learn why some make money online while most doesn't.  </p>  <p style=\"\">  \t Learn how to sell products and services without being a pushing salesman.  </p>  <p style=\"\">  \t Learn the important elements every Internet Marketers has in their business. Get step by step instruction on how to include these elements into your business.  </p>  <p style=\"\">  \t Learn how to make a difference in peoples' lives and make money while you do it.  </p>  <p style=\"\">  \t Sit at home and make money just from a few hours a day working on your business.  </p>  <p style=\"\">  \t Learn about email marketing and why it is fundamental for your business.  </p>  <p style=\"\">  \t Learn why a blog is the best kind of website for your business.  </p>  <p style=\"\">  \t Learn how to make passive income online and make money while you sleep  </p>", 
    "end_date": null, 
    "title": "How to Sustain a Career in Internet Marketing", 
    "price": "20.00", 
    "instructors": "Peter Abundant", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140266_3400_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-sustain-career-in-internet-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-01T00:29:48Z"
}