{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Your competitors are the best case study in the world. If you want to grow your business, you need to learn from their strengths &amp; weaknesses. </p><p>At least that’s what the most successful and fastest-growing businesses do: they study their competition.</p>    <p><strong>Learn How to Take the Best Seat in The House &amp; Discover A Simple Way To Analyze Your Competitors </strong></p>    <ul><li>Simple strategy to identify your competitors in less than 5 minutes</li><li>Analyze your competition like a business analyst &amp; consultant </li><li>Perform strategy audits </li></ul><p><br><strong>Contents &amp; Overview</strong></p>    <p>This course will reveal to you a proven &amp; tested way to research your competition like a professional marketing consultant.<br> <br> After giving you a brief introduction to our simple &amp; intuitive research process, we’ll cover how to research your competitors. </p>    <p>These lessons include how to set up an Excel spreadsheet to have all your data in your place, three ways to identify your competitors and how to use the No. #1 competitive research tool for free.</p>    <p>Next, we’ll cover how to create four different types of audits: general audit, content audit, social media audit &amp; email marketing audit. </p>    <p>We also included templates that will help you understand the content, social media &amp; growth strategy of your competitors with ease. <br> <br> By the time you complete this training, you’ll be able to research your competitors like a professional and be able to take the necessary steps to massively grow your business! </p>", 
    "end_date": null, 
    "title": "How To Analyze Your Niche Market", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782172_b39a_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-easily-analyze-your-competitors/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-04T15:05:13Z"
}