{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Every successful business has a Customer Factory - a systematic program that generates a steady stream of new business week after week, month after month.  </p>  <p>  \t           And that&#039;s exactly what <em style=\"\">you&#039;ll</em> have when after completing this course.  </p>  <p>  \t     Hundreds of students from around the world have learned how to turn complete strangers into customers, consistently, dependably and continuously.  </p>  <p>  \t    .  </p>  <p>  \t<strong style=\"\">What Students Say About Double Your Business With A Customer Factory</strong>  </p>  <p>  \t<em style=\"\">Excellent Teacher, Great Course. Frank is a natural teacher. The course is full of solid information and clear, simple steps. Going through it feels like you&#039;re having a conversation directly with Frank.</em>  </p>  <p>  \t<strong style=\"\">Nate D.</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<em style=\"\"> Solid marketing advice without the buzz-words. Frank delivers solid advice on creating a &#039;customer factory&#039; without crazy market-speak. He uses simple examples to make his step-by-step process easy to understand, and the steps are easy to follow. He covers everything from your elevator speech to automated customer creation.</em>  </p>  <p>  \t<strong style=\"\">Mike T.</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<em style=\"\"> Great time saving powerful information. Frank Felker knows his stuff. This is an easy step by step course I was able to follow and put into practice immediately. Sometimes I can get side tracked and off process but Frank made it pretty clear with what to do when. I am looking forward to having more clients and knowing how to keep my marketing going.</em>  </p>  <p>  \t<strong style=\"\">Elaine G.</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<em style=\"\">This course contains a massive amount of valuable information that can be absorbed in bite-sized pieces. As a business owner I have spent thousands of dollars and countless hours away from home in seminars. Watching these individual videos was like taking a $10,000 seminar from the comfort of my home. AND, I could watch when I wanted and where I wanted. </em>  </p>  <p>  \t<strong style=\"\">David D.</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<em style=\"\">Frank Felker presents expert advice for anyone who is thinking of owning a business, owns a struggling business or wants to take a successful business to the next level.</em>  </p>  <p>  \t<strong style=\"\">Kurt G.</strong>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p>  \t<em style=\"\">A comprehensive and well-explained course on the complexities of establishing and maintaining a viable customer base!</em>  </p>  <p>  \t<strong style=\"\">G. Artley</strong>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p>  \t<em style=\"\">The instructor has a very common sense and easy to understand approach to growing clients.</em>  </p>  <p>  \t<strong style=\"\">Martin S.</strong>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p>  \t<em style=\"\">Having taken numerous online courses and attended a multitude of seminars regarding marketing, sales and customer retention, this course OUTSHINES ALL OF THEM, COMBINED! I highly recommend this course to anyone who has a desire to be successful and prosperous in their sales or marketing career.</em>  </p>  <p>  \t<strong style=\"\">Jason S.</strong>  </p>  <p>  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <p>  \t<em style=\"\">Frank Felker has created a comprehensive, detailed yet easy to understand, important course which every aspiring entrepreneur, business owner or corporate executive needs to take. Nicely presented, well organized, I have enjoyed learning (and re-learning) things from watching Frank&#039;s presentation. It&#039;s worth well more than the cost of the course.</em>  </p>  <p>  \t<strong style=\"\">Michael W.</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "How To Build A Customer Factory", 
    "price": "35.00", 
    "instructors": "Frank Felker", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/125720_66b5_13.jpg", 
    "course_url": "https://www.udemy.com/the-customer-factory/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-26T17:46:13Z"
}