{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>An effective landing page, also referred to as a squeeze page, is one that will create new leads and conversions for your business or website.</p>    <p>This course will show you exactly how to easily create a landing page that's concise, clear, and appealing to visitors.</p>    <p>Like other successful marketers, your new landing page could hit a 50%+ conversion rate, and this could result in greater profits and longevity for your company.</p>    <p>You'll learn how to build your own custom landing page in less than a day, and without having to pay expensive copywriters or web designers along the way.</p>    <p><strong>Build, Design, and Write a Landing Page That Increases Conversions</strong></p>    <ul><li>Learn How to Build a Landing Page in Under One Hour</li><li>Improve Your Copywriting Skills to Write Content That Converts</li><li>Access the Best Resources for Affordable, Attractive Web Graphics</li><li>Master Conversion Hacks to Drastically Improve Conversion Rates</li></ul><p><br><strong>Use Your Landing Page to Boost Visitor Interest, Signups, and Sales</strong></p>    <p>This step-by-step course will show you how to build a landing page from scratch so that you can accrue more email list subscribers and sell more products.</p>    <p>One of the most effective ways to get people to sign up for your email list is by offering them an incentive, known as a lead magnet. You'll learn how to determine what to offer, and how to offer it in a way that will garner attention.  </p>    <p>In addition to building your squeeze page, you'll also tackle the best copywriting methods that are proven to work.</p>    <p>You'll even add attractive graphics that won't distract visitors, but will instead further incentivize signups.</p>    <p>Finally, you'll tackle five proven conversion hacks that will help you dramatically increase your landing page's conversion rate right away.</p>    <p><strong>Contents and Overview</strong></p>  <p>This course is designed for people of all experience levels, so it will begin with an overview of what a squeeze page is, including the major elements it must contain for the best results.</p>    <p>You'll also cover the importance of a lead magnet and work on creating one for your own website.</p>    <p>To develop stellar copy for your squeeze page, you'll learn how to research like a pro, and how to write headlines, subheaders, and a call-to-action that will attract and retain visitors. </p>    <p>To make your site look just as you envision, you'll discover the best places to acquire high quality graphics affordably.</p>    <p>You'll even learn the tools that make it possible to build your site in under 20 minutes.</p>    <p>Finally, you'll access five conversion hacks that you can implement right away to get a 50%+ conversion rate in no time.</p>    <p>As you move through the lessons, you'll be encouraged to put what you're learning into practice, so you can have a landing page ready to launch by the time you complete this course.</p>    <p>You'll be able to use your new skills to create a winning landing page for your business, and you'll know exactly how to get visitors to convert, whether you're searching for more sales or subscribers.</p>", 
    "end_date": null, 
    "title": "How To Build A Converting Landing Page From Scratch ", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Patrick Dermak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683374_732c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-converting-landing-page-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T15:25:48Z"
}