{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">You&#039;re struggling with converting leads into customers.</p><p style=\"\">You know you have great products and services; however, no one is clicking the &quot;buy&quot; button.</p><p style=\"\">It happens ... we&#039;ve all been there.</p><p style=\"\">More often than not, it&#039;s because the lead doesn&#039;t know you, your business, nor the products and services you offer.</p><p style=\"\"><strong style=\"\">The Problem? </strong>There&#039;s no relationship.</p><p style=\"\">Great news! You can build a relationship, automatically, with a top converting email series!</p><p style=\"\">In this course, I walk you, step-by-step with how to setup a top converting email series for your business by using ActiveCampaign.</p><p style=\"\">The course covers two types of email series - <strong style=\"\">Multi Product</strong> and <strong style=\"\">One Product</strong>.</p><ul style=\"\"><li style=\"\">Multi Product - Normally, this includes brick and mortar businesses and eCommerce businesses. You know, the businesses with multiple products</li><li style=\"\">One Product - Normally, this is for digital products like courses and eBooks where the business offers one main product or service</li></ul>No matter your business model - this course has you covered!This is a beginner level course that is broken down into simple, easy to follow steps ... and, if questions arise ... I&#039;m here to help guide you in the right direction!By the end of this course you will have a top converting email series for your business!", 
    "end_date": null, 
    "title": "How to Build a Top Converting Email Series w/ ActiveCampaign", 
    "price": 0, 
    "instructors": "Nathan Williams", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565210_680d.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-top-converting-email-series/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T15:44:22Z"
}