{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em style=\"\">---------------------------------------------------------------------------------------------------------------------</em>  </p>  <p>  \t<em style=\"\">Latest Course Update: January 2015</em>  </p>  <p>  \t<em style=\"\">---------------------------------------------------------------------------------------------------------------------</em>  </p>  <p>  \t                      Come with me as I show you how I earn consistent passive income and how you can <strong style=\"\">make back the price of this course in your first month</strong> with absolutely NO cost - <strong style=\"\">zero, nada, rien</strong>! - by creating simple tutorial videos using nothing more than your knowledge, your cell phone or free recording software and a small amount of your spare time - and the beauty of it is, once they are uploaded you can forget about them and <strong style=\"\">earn money LITERALLY in your sleep</strong>! Sound too good to be true? Then read on...  </p>  <p>  \t                      The world of online learning is expanding every day, and by <strong style=\"\">investing just a few minutes of your time</strong> you could be one of the thousands of people making a passive income from this exciting new career! <strong style=\"\">Enroll now</strong> and I will take you by the hand and guide you through the whole process, from signing up and creating your FREE account all the way through to publishing your video and, crucially, <strong style=\"\">earning extra cash</strong>!  </p>  <p>  \t                      I will also show you behind the scenes of my own account, proving how I have been bringing in <strong style=\"\">extra $ per month</strong> using exactly the methods I am going to show you! See how the minutes system works and how that is translated into <strong style=\"\">more cash into your pocket</strong> - it really is that simple!  </p>  <p>  \t                  My personal pledge:  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">Full, free lifetime access</em></li>  \t<li style=\"\"><em style=\"\">All extra lectures and upgrades are always free</em></li>  \t<li style=\"\"><em style=\"\">Unconditional Udemy 30 day money-back guarantee - Success or your money back!</em></li></ul><p><span><em style=\"\"><br style=\"\"></em></span></p>  <p>  \t<em style=\"\"><strong style=\"\">Please note: This course is not a \"get rich quick\" solution, but if you follow the very simple instructions I will show you in the course then there is no reason why you too shouldn't be earning an uncapped amount of passive income from day one! All you will need to do is sign up as an instructor ABSOLUTELY FREE (which I will be showing you how to do in the course) and get creative. No website needed, no sales and no affiliate marketing - just easy to follow instructions.</strong></em>  </p>  <p>  \t                      So what will you be learning?  </p>  <ul style=\"\">  \t<li style=\"\">How to create your FREE account and start earning</li>  \t<li style=\"\">How to create awesome FREE thumbnail images and attract watchers</li>  \t<li style=\"\">How to edit your audio for FREE</li>  \t<li style=\"\">How to categorize your videos for maximum views</li>  \t<li style=\"\">Skillsnacks vs Full Courses</li>  \t<li style=\"\">Many, many more insider tips!</li>  </ul>  <p>  \t                    Enroll now and start earning - every second you delay is costing you money!  </p>", 
    "end_date": null, 
    "title": "How To Use Skillfeed To Upload Videos and Tutorials", 
    "price": "20.00", 
    "instructors": "Scott McElroy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389760_9cf6_3.jpg", 
    "course_url": "https://www.udemy.com/uploading-tutorials-and-videos-to-skillfeed/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T19:48:11Z"
}