{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t   There is a relatively simple way to make money using Google Adwords. It is called 'lead generation'. The basic process is this:  </p>  <p style=\"\">  \t  - you create a website which collects leads or online applications from people interested in a certain product (e.g. car insurance or a quote for a new kitchen).  </p>  <p style=\"\">  \t  - you find a buyer for these applications (a car insurance broker or a home improvements company).  </p>  <p style=\"\">  \t  - you advertise your website on Google (using Google Adwords) in order to generate online applications that you can sell.  </p>  <p style=\"\">  \t  - as long as your advertising costs are lower than your revenue from selling the leads, this creates a profitable income stream.  </p>  <p style=\"\">  \t  - the beauty of this system is that once the setup is done, there is very little ongoing maintenance required, which creates passive income and gives you time to focus on other things.  </p>  <p style=\"\">  \t I have used this method to make money using Google Adwords for the past 8 years, and I'm still using it today.  </p>  <p style=\"\">  \t   Using an easy-to-follow step-by-step approach -- along with all the resources you need to get started -- this course will help you start making money from Google Adwords very quickly.  </p>  <p style=\"\">  \t <strong style=\"\">In this course you will see:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">How to identify a profitable niche for lead generation</li>  \t<li style=\"\">How to ensure compliance</li>  \t<li style=\"\">How to identify the right kind of lead buyer and speak to the right person there</li>  \t<li style=\"\">How to get them interested in a trial</li>  \t<li style=\"\">How to negotiate favourable terms</li>  \t<li style=\"\">How to buy a domain and build your website, or outsource the build</li>  \t<li style=\"\">How to set up your lead delivery</li>  \t<li style=\"\">How to create your Google Adwords campaign</li>  \t<li style=\"\">Tips on how to keep your Google Adwords costs down</li>  \t<li style=\"\">Which final checks and tests you need to perform</li>  \t<li style=\"\">How to get paid</li>  \t<li style=\"\">What you need to do once your campaign is live</li>  \t<li style=\"\">How to scale to increase your profits</li>  </ul>  <p style=\"\">  \t <strong style=\"\">Ready for the next step?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">  \t<h5 style=\"\"></h5>  \t</li>  </ul>", 
    "end_date": null, 
    "title": "How to Run Your Own Business Using Google Adwords", 
    "price": "20.00", 
    "instructors": "Mr.  Michael Madew", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/158552_2a43_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-run-your-own-business-using-google-adwords/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-05T12:20:20Z"
}