{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tWithin the first 4 months of starting a blog, I had attracted thousands of visitors to my site. As the months went on my blog articles continued to get naturally shared and recommended over and over! <strong style=\"\">I recently hit 4.6 million visitors</strong> and all of this traffic led to thousands of dollars of sales for my eBooks, coaching and consulting services.  </p>  <p style=\"\">  \tSo, I know my marketing strategies work! Before quitting the 9-5, I was working for marketing agencies and managing lead generation. I was able to create a full time income once my website traffic took off and I had a steady flow of leads to buy my digital products and services.  </p>  <p style=\"\">  \tEvery single strategy I teach in this course is easy to implement. You do not need to be techy.  </p>  <p style=\"\">  \tNothing is kept secret - I reveal everything I did to reach millions ... and as I test more and more tactics, I will add them to this course - at no extra cost to you!  </p>  <p style=\"\">  \tThis course will continue to grow with proven traffic and list building strategies.  </p>  <p style=\"\">  \tUdemy also has a 30 day guarantee, you have my personal promise that you will be amazed and excited by what you&#039;ll learn!  </p>  <p style=\"\">  \t<span style=\"\"><br style=\"\">  \t</span>  </p>  <p style=\"\">  \t<span style=\"\">If you want my &quot;secret&quot; training - remember I&#039;ve earned a full time income due to my explosion in traffic online - you need to get this course now ... right this minute.</span>  </p>  <p style=\"\">  \t<span style=\"\"><br style=\"\">  \t</span>  </p>  <p style=\"\">  \tEvery minute you delay you are LOSING traffic and sales. People are spending their time on money on other people&#039;s sites instead of yours. Invest in this training and explode your traffic.  </p>  <p style=\"\">  \t<span style=\"\">Enroll now!</span>  </p>", 
    "end_date": null, 
    "title": "How I Reached 4 Million Website Visitors With No Advertising", 
    "price": "50.00", 
    "instructors": "Susie Romans", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390886_8b3d_7.jpg", 
    "course_url": "https://www.udemy.com/reach-4-million/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-11T02:48:45Z"
}