{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">--------------------------------------------------------------------------------------------------------</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">**Featured in CrazyEgg.com&#039;s customer newsletter, September 2014**</em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">--------------------------------------------------------------------------------------------------------</strong></em>  </p>  <p style=\"\">  \t<strong style=\"\"> When your website isn&#039;t generating leads or sales it can be frustrating, costly, confusing and even scary, especially when you don’t know how to fix it.</strong>  </p>  <p style=\"\">  \t                 Getting traffic is half the battle. But once you have it, the last thing you want is to watch that traffic slip through your fingers.  </p>  <p style=\"\">  \t                 In this course, you’re about to discover the secrets to creating a high converting landing page for your offer, using proven principles derived from over 100 of successful landing page tests, across dozens of different industries.  </p>  <p style=\"\">  \t        ============================================  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;Currently running a 26.72% conversion rate!!!&quot;</strong></em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;Hi Nick, just wanted to give you a quick update... I just launched my first campaign since starting your course. This page is currently running a 26.72% conversion rate!!!!&quot; - Leah Latini</em>  </p>  <p style=\"\">  \t            ============================================  </p>  <p style=\"\">  \t<em style=\"\">&quot;<strong style=\"\">Awesome content, easy to take action with!&quot;</strong></em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;This is fantastic, I am only on part 4 of section 1, but have already seen several things that I can quickly implement to generate more profit from my landing pages. My honest opinion is that Nick knows his stuff, his down to earth practical course is really going to make a difference to anyone who uses landing pages.&quot; - </em><a href=\"https://www.udemy.com/u/chrisdolan2/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"><em style=\"\">Chris Dolan</em></a>  </p>  <p style=\"\">  \t            ============================================  </p>  <p style=\"\">  \t<strong style=\"\">What <em style=\"\">is </em>a landing page anyway?</strong>  </p>  <p style=\"\">  \t                 If you don’t already know – a landing page is a stripped down version of your website, built to serve one purpose; generate a direct response. Whether you’re looking for subscribers, orders, sales leads or anything in between, a carefully constructed landing page gives your visitors a clear call to action free from distraction.  </p>  <p style=\"\">  \t<strong style=\"\">  But there’s a science to it. And you’re about to learn the formula!</strong>  </p>  <p style=\"\">  \t                 Hi, my name is Nick Brighton. Over the past 5 years, I&#039;ve written sales copy for hundreds of SMEs online. I&#039;ve always been obsessed with one simple question – what makes some people click and buy, when others run a mile?  </p>  <p style=\"\">  \t<strong style=\"\">As a result, I have picked apart, analyzed and assimilated over 100 successful case studies and tests to find the irrefutable laws of a high converting landing page.</strong>  </p>  <p style=\"\">  \t                 What I uncovered was just as I hoped for…  </p>  <p style=\"\">  \t                 … consistent patterns…  </p>  <p style=\"\">  \t                 … winning principles…  </p>  <p style=\"\">  \t                 … and practical takeaways to create a successful landing page straight out of the gate every time.  </p>  <p style=\"\">  \t                 And today, I&#039;m sharing these winning landing page principles and formulas with you, inside this beginner friendly course.  </p>  <p style=\"\">  \t<em style=\"\">  This course contains four sections:</em>  </p>  <p style=\"\">  \t<strong style=\"\">Section 1: The Proven Conversion Principles.</strong>  </p>  <p style=\"\">  \t                  I&#039;ll show you the 15 proven principles that appear on almost every high converting landing page, plus a few bonus techniques that I&#039;ve uncovered from some weird and wacky tests.  </p>  <p style=\"\">  \t<strong style=\"\">Section 2: Finding The Flaws.</strong>  </p>  <p style=\"\">  \t                  I&#039;ll show you an easy way to get inside the minds of your visitors and know exactly what they want to see on your landing page, which will help you take a massive leap forward in your conversions, without guessing what to do next.  </p>  <p style=\"\">  \t<strong style=\"\">Section 3: Creating Your Landing Pages. </strong>  </p>  <p style=\"\">  \t                 I&#039;ll show you my recommended tools, based on your skills, your budget and how much time you have available.  </p>  <p style=\"\">  \t<strong style=\"\">Section 4: Designing A/B Tests. </strong>  </p>  <p style=\"\">  \t                 We&#039;ll cover the basics to creating a simple but effective A/S split tests to keep pushing your landing page conversions higher and higher over the coming days, weeks and months.  </p>  <p style=\"\">  \t           ============================================  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;Great content, narrated beautifully&quot;</strong></em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;I&#039;m lovin it. In addition to great content, it&#039;s narrated beautifully. Thanks Nick&quot; - </em><em style=\"\">Tudor Pangal</em>  </p>  <p style=\"\">  \t           ============================================  </p>  <p style=\"\">  \t<strong style=\"\">  Now you can swipe the same techniques that highly profitable businesses are using to enjoy high conversions… and apply them to your own landing pages.</strong>  </p>  <p style=\"\">  \t               No need to waste time and money guessing your way to a successful landing page, because this course will give you a clear shortcut to what works - and why.  </p>  <p style=\"\">  \t  Never waste time and money driving traffic that doesn&#039;t convert. Even with a measly 1% increase in sales or email subscribers after taking this course, how will that revenue pay off in your business?  </p>  <p style=\"\">  \t  Discover everything you need to know about building a high performing landing page and improving your results, starting today.  </p>  <p style=\"\">  \t<strong style=\"\">And it&#039;s perfect for beginners, bootstrappers, and &quot;non-techies&quot;</strong>  </p>  <p style=\"\">  \t                 No need to hire a copywriter or marketing consultant. Everything in this course is very simple to implement, regardless of your budget or current skill level.  </p>  <p style=\"\">  \t  ============================================  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;Loving every second of it!&quot;</strong></em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;I just finished watching Principle 1 and I have to say, this is a great course. Loving every second of it!&quot; - </em><em style=\"\">Cyril Maithily Gupta</em>  </p>  <p style=\"\">  \t           ============================================  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;I have become your fan...&quot;</strong></em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;I am a PhD student, and love to make automated softwares. I have just gone through some of your videos and have become your fan.. you have done a really wonderful job&quot; - Karim Alinani</em>  </p>  <p style=\"\">  \t           ============================================  </p>  <p style=\"\">  \t<strong style=\"\">So, no more watching your traffic slip through the cracks, wondering what the heck is going wrong.</strong>  </p>  <p style=\"\">  \t  In this course, everything you’re about to learn has been tested on a wide scale and globally accepted as best practises for high landing page conversions... no matter what you sell, or who you&#039;re selling it to.  </p>  <p style=\"\">  \t  As a result, you&#039;re just a couple of clicks away from kick-starting your landing page conversions and generating the leads and sales you need to thrive in your business.  </p>", 
    "end_date": null, 
    "title": "How To Create a High Converting Landing Page", 
    "price": "50.00", 
    "instructors": "Nick Brighton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/111400_84b7_5.jpg", 
    "course_url": "https://www.udemy.com/create-a-high-converting-landing-page/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-27T18:43:02Z"
}