{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t  Wenn man im Internet Erfolg haben möchten, hören sie ja heutzutage  alles Mögliche. Was Sie immer hören ist, werden Sie Experte in einer  Nische. Was Sie auch immer hören ist, dass 90 % keinen Erfolg im  Internet haben. Eventuell besteht hier ein Zusammenhang.  </p>  <p style=\"\">  \t  Alle suchen im Keyword Planner danach, was die Menschen bei  Google suchen. Dies ist aber falsch, richtig ist, danach zu suchen, was  die Menschen brauchen. Wobei kann ich den Menschen helfen, welche  Probleme lösen meine Produkte. Welchen Nutzen kann ich der Menschheit  bieten. Über diese Dinge sollte man nachdenken.  </p>  <p style=\"\">  \t  Ist Google wirklich so wichtig oder gibt es auch Möglichkeiten  ohne Google erfolgreich zu sein. Es gibt sogar sehr viele  Möglichkeiten, die von anderen kaum genutzt werden, weil sie immer nur  Google und den Experten in der Nische sehen. Es ist an der Zeit  umzudenken.  </p>  <p style=\"\">  \t  Die folgenden Themen werden behandelt:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·ohne Google zum Erfolg  \t</p>  \t<p style=\"\">  \t\t  ·wie nutze ich das, was andere schon aufgebaut haben  \t</p>  \t<p style=\"\">  \t\t  ·Konzentration auf das Wesentliche  \t</p>  \t<p style=\"\">  \t\t  ·nur wer umsetzt hat Erfolg  \t</p>  \t<p style=\"\">  \t\t  ·Verdienen ein YouTube-Videos  \t</p>  \t<p style=\"\">  \t\t  ·Social Media richtig nutzen  \t</p>  \t<p style=\"\">  \t\t  ·Ziele setzen und Pareto-Prinzip  \t</p>  \t<p style=\"\">  \t\t  ·Business Plan und Positionierung  \t</p>  \t<p style=\"\">  \t\t  ·verkaufen auf Portalen wie Amazon und eBay  \t</p>  \t<p style=\"\">  \t\t  ·an der Konkurrenz orientieren  \t</p>  </ul>  <p style=\"\">  \t  Jetzt schon in der 5. Auflage - Stand Mai 2014  </p>  <p style=\"\">  \t  Das sagen unsere Kunden  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·… mein ständiger Begleiter geworden sind (im Auto, in der Sonne, beim Kartoffel schälen...), …  \t</p>  \t<p style=\"\">  \t\t  ·… wie es mit relativ einfachen Mitteln gelingen kann, ein florierendes Internet-Business aufzubauen.  \t</p>  \t<p style=\"\">  \t\t  ·Ich hätte vor vier Wochen nicht geglaubt, dass ich in der Lage wäre, bei Youtube ein Video einzustellen.  \t</p>  \t<p style=\"\">  \t\t  ·… Kleinanzeigen bei ebay (mit über dreitausend Besuchern - ich habe&#039; gedacht, ich träume!)  \t</p>  \t<p style=\"\">  \t\t  ·Seit gestern habe ich knapp 50 Likes bekommen und das nicht einmal in 24h!!!!  \t</p>  \t<p style=\"\">  \t\t  ·… Vorgehensweisen, die sich zum größten Teil sehr von derzeit üblichen, publizierten Video- Kursen abheben …  \t</p>  \t<p style=\"\">  \t\t  ·… meine Besucherzahl auf meine Website mehr als versechsfacht.  \t</p>  \t<p style=\"\">  \t\t  ·Also, Sie haben mich so richtig schön angeschoben! Danke!!!  \t</p>  \t<p style=\"\">  \t\t  ·Bei Google stehe ich auf Platz 2 mit meiner Facebookseite  \t</p>  \t<p style=\"\">  \t\t  ·Sie geben viele neue Gedankengänge, Ideen und Tipps  \t</p>  </ul>  <p style=\"\">  \t  undundund  </p>  <p style=\"\">  \t  Freuen Sie sich darauf, dass es jetzt voran geh  </p>", 
    "end_date": null, 
    "title": "Ihr Internet Business - ein Praktiker packt aus", 
    "price": "50.00", 
    "instructors": "Henning Glaser", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278254_c1fc_5.jpg", 
    "course_url": "https://www.udemy.com/internet-marketing-online/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-10T17:25:37Z"
}