{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>You might be asking yourself, “A whole course on email marketing? Hasn’t email been around for more than 40 years? Haven’t people learned to tune it out?<br></p>\n\n<p><strong>Is email marketing really still relevant?</strong></p>\n\n<p>Without a doubt, YES!</p>\n\n<p>Email marketing is a highly personalized, one-to-one, conversion-focused channel that you own - a rarity in today's pay-to-play environment of new marketing platforms. We created this course to give marketers an interdisciplinary approach to managing email marketing. By achieving this certification, you will have proven your understanding of advanced email marketing tactics and its purpose in your inbound marketing strategy.</p>\n\n<p>Consider...</p>\n\n<p>2.4 million emails are sent every second worldwide, but most of them are never opened. </p>\n\n<p>54% of emails being opened on mobile. Has your business adapted to the new way that people consume information?<br></p>\n\n<p>Only 4% of companies would rate the performance of their email campaigns as Excellent. And even if you are part of that 4%, who wouldn’t want to improve their customer acquisition and retention.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Is this right for me?</strong></p>\n\n\n\n<p>Whether you're just getting started in marketing or you're a seasoned email professional, the Email Marketing Course and Certification will prepare you to grow your business using Email Marketing. </p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Inbound Email Marketing Course + Official Certification", 
    "price": 0, 
    "instructors": "Eric Peters, Isaac Moche, Tom Monaghan, Andrea Francis, Jessica Webb, Justine Jordan", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857726_66b7.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-course/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T17:03:32Z"
}