{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>So what is inbound marketing all about? </strong><br></p><p>Well, inbound is a fundamental shift in the way we do business. Instead of that old, interruption-based\nmessage where the marketer or salesperson had all the control, Inbound is about\nEMPOWERING potential customers. </p><p>Instead of interrupting people with television ads, they might create videos that potential\ncustomers want to see. Instead of buying display ads in print publications, they could create a\nbusiness blog that people would look forward to reading. And instead of cold calling, they create\nuseful content so that prospects can contact them when they want more information. </p><p>Inbound Marketing is marketing focused on getting found by customers. It’s customer-focused.\nIt’s helpful. Wouldn’t you prefer to deal with a business that is focused on your needs instead of\ntheir own? </p><p>You’ve probably come across some of your favorite brands actively practicing inbound marketing.\nIt’s that problem-solving blog post that shows up near the top of the search engine. It’s the new\nsolution that was discovered on LinkedIn or the product review that was found on Facebook. </p><p>Inbound is about being a part of the conversation. </p><p>Being a part of that conversation means sharing helpful, relevant content with the world. It’s about\ndrawing people in -- that’s why it’s called Inbound, after all. </p><p>And most of all, it’s about creating marketing that people love. </p><p>In today’s world, buyers have all the power. Think about the process you went through the last\ntime you made a purchase. Did you call up a salesperson, asking to buy? Or did you hop online\nand do some research? I’d be willing to bet you did the latter. </p><p>It’s time for you to support that buying process. It’s time for you to join in and empower your\npotential customers to make the right decisions for themselves.\nSo how do you actually do inbound? Well, the best way to start is by understanding the Inbound\nMethodology.</p><p style=\"\"><em><strong>Here are some statistics to think about:</strong></em></p><ul><ul><li>Inbound Leads <strong>cost on average 60% less</strong> than 'outbound' leads (Search Engine Journal)<br><br></li><li>Companies that blog <strong>generate 67% more leads</strong> per month than those who don't (Social Media B2B)<br><br></li><li>80% of business <strong>decision-makers prefer</strong> to get company information in a series of articles versus in an advertisement (Content Marketing Institute)<br><br></li></ul></ul><p>HubSpot Academy's free Inbound Certification Course consists of twelve lectures that span the four stages of the Inbound Methodology. From optimizing your website, to landing page anatomy, to honing your inbound sales skills, this free certification course covers the basics of what inbound marketing is all about.<br></p><p>When you've completed the course, you'll be ready to take the [free] certification exam and get your official certificate! </p><p><span></span><strong>Is this right for me?</strong></p><p>Whether you're just getting started in marketing or you're a seasoned professional, the Inbound Certification will prepare you to better attract strangers, convert visitors, close leads and delight customers.<br></p>", 
    "end_date": null, 
    "title": "Inbound Digital Marketing Course + Official Certification", 
    "price": 0, 
    "instructors": "Eric Peters, Lindsay Thibeault, Isaac Moche, Angela Hicks, Mark Kilens, David Shepard, Chris LoDolce, Sarah Bedrick, Justin Champion", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658244_d53a_7.jpg", 
    "course_url": "https://www.udemy.com/inbound-marketing-course/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T22:03:35Z"
}