{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>¿Sabes que tienes que implementar el inbound marketing pero no sabes ni por dónde empezar? No te preocupes, yo te ayudo.</p>    <p><strong>¿De qué trata el curso?</strong></p>  <p>En este curso te ayudo a que conozcas y entiendas el inbound marketing, cómo lo puedes utilizar en tu negocio y, por supuesto, te explico todo paso a paso para que puedas implementar éste método en tu día a día. </p>    <p><strong>¿Para quién es este curso?</strong></p>  <p>Emprendedores, freelance, autónomos y responsables de marketing interesados en automatizar el marketing y los procesos de su empresa.</p>    <p><strong>¿Por qué apuntarse a este curso?</strong></p>  <ul><li>El inbound marketing es una estrategia efectiva para obtener más clientes con menos esfuerzo, lo que equivale a más tiempo libre.</li><li>Una vez tengas una estrategia de inbound marketing implementada, no vas a tener que preocuparte en buscar clientes nunca más.</li><li>Si quieres ser más productivo y dedicar horas a lo que realmente te importa. </li></ul>        <p><strong>¿Cuánto tiempo se tarda en completar el curso?</strong></p>  <p>Puedes terminar el curso en una tarde, pero la implementación de la estrategia de inbound marketing en tu negocio, te puede llevar hasta 2 meses. </p>    <p><strong>¿Cuál es la estructura del curso y qué vamos hacer?</strong></p>  <ol><li>Empezamos por entender las bases del inbound marketing, qué es y cómo se diferencia de otras estrategias. </li><li>Después, pasamos a entender los 3 pilares fundamentales de cualquier estrategia inbound (usando ejemplos reales). </li><li>Una vez entendamos el funcionamiento, cubriremos las herramientas y software que te ayudarán a implementar la estrategia.</li><li>Por último tenemos una guía paso a paso en la explicaremos qué tienes que hacer exactamente para crear tu propia estrategia. Éste último apartado incluye ejemplos prácticos para que puedas entender con más facilidad como poner en práctica cada fase. </li></ol>    <p><strong>¿Qué tipo de materiales se incluyen?</strong></p>  <ul><li><strong>Vídeo tutoriales</strong> de: email marketing (mailchimp, campaign monitor, infusionsoft), Wordpress, Facebook ads, Google Adwords, Google analytics…</li><li><strong>Guías descargables</strong> en PDF</li><li><strong>Ejercicios</strong> de audio</li><li><strong>Videos</strong> explicativos</li><li><strong>Guía paso a paso</strong> con videos tutorial, esquemas y ejemplos pràcticos</li></ul><p><strong>¿Qué tipo de</strong> <strong>softwares</strong><strong> vamos a ver?</strong></p><ul><li>Solución CRM - Software de gestión de contactos (Nimble)</li><li>Sistema de email marketing (Mailchimp, Campaign monitor)</li><li>Software de gestión de tareas (Asana)</li><li>Ecommerce (Plugin wordpress y Wix)</li><li>Automatización (IFTTT y Zapier)</li><li>Solución todo en uno (Infusionsoft)</li></ul>", 
    "end_date": null, 
    "title": "Inbound Marketing - Bases, estrategia e implementación", 
    "price": "30.00", 
    "instructors": "Geni Ramos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662076_4635_3.jpg", 
    "course_url": "https://www.udemy.com/curso-inbound-marketing-espanol/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T14:56:30Z"
}