{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The 6 Circles is a really effective digital marketing plan for hoteliers, who are looking to increase their revenue and get more effective ROI. This course explains the intricate nuances of this very “6 Circles” Plan, and helps hoteliers, general managers of hotels, as well as entrepreneurs looking to penetrate the hospitality industry to attract the right clientele. The course can also help you generate more leads, reach out to the right target group, and understand the importance of making long term and short term digital marketing plans for your hotel. Since it is a simple to follow plan, everybody can easily implement it during their digital marketing initiatives.</p>    <p>From discovering where your maximum clientele comes from, to understanding what their preferences are, and from discerning what sort of value addition they like to realizing what time they plan to book from, the ‘6 Circles’ Plan makes hoteliers and general managers realize the importance of advance planning.</p>    <p>The other factors that the ‘6 Circles’ Plan comprises of include the creation and use of more visual mediums such as videos and images, instead of text. Through this course, you can also easily sculpt out the best pricing model for your hotel, ensuring that not only do guests get what they want, but also that they like what they are getting and at what price. </p>    <p>One more thing, and this is the most lucrative one. If you do decide to buy this course, my team and I will work with you for 52 whole weeks, that’s 1 year, to ensure your plans don’t go awry, and your social media campaigns all find smooth sailing.</p>    So what are you waiting for? Go ahead and buy this plan for an in-depth look at what will make your hotel more profitable, and how you can earn at least 10 times more revenue", 
    "end_date": null, 
    "title": "Increase 20 percent Direct/Indirect Revenue within 100 Days ", 
    "price": 0, 
    "instructors": "Avijit Arya", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736642_5dad_2.jpg", 
    "course_url": "https://www.udemy.com/increase-20-percent-directindirect-revenue-within-100-days/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T10:27:48Z"
}