{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Celebrating 1000 students! Become part of the community!</strong></p><p>Do you have an iOS app or app idea and wonder how you can get noticed in the App Store? You want to know how to boost your organic downloads? You need an overview of the ASO possibilities and specific guidelines how to market your app?</p><p>Then this course is for you!</p><p>Learn the fundamentals of app marketing and App Store Optimization (ASO). Get a profound understanding, of how the App Store algorithm works and learn how to get noticed in this highly competitive field.</p><p>The course is perfect for you if you have a finished or released app, but it’s also a huge help if you’re still in the early stages of development and planning, as we cover important basics on how to build a great app and how to monetize it. </p><p>In the main part we focus on ASO. You learn to effectively optimize the on- and off-site factors of your app. This includes hands-on guides about choosing the right title and keywords, creating an awesome icon and selecting perfect screenshots. After this, you learn about the importance of categories and when to release your app. Finally, there is a section on app analytics: understand what KPIs you should track and how this helps you to constantly improve your app.</p><p>To avoid any confusion between Apple's App Store and Google Play, it is specifically tailored for iOS apps.<br></p><p>This course is about hands on knowledge. No fillers, but only straightforward content and guidelines. Other courses will take you hours, this one will give you the relevant knowledge in about 60 minutes.</p><p>Furthermore, you can ask any questions and will get feedback within 24 hours.</p>", 
    "end_date": null, 
    "title": "Increase Downloads: App Store Marketing for iOS (with ASO)", 
    "price": "20.00", 
    "instructors": "Moe Biersack", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639726_4ca5_2.jpg", 
    "course_url": "https://www.udemy.com/beginner-app-store-marketing-for-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T21:42:48Z"
}