{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>***UPDATE: <em>This course is completely updated as of June<em> </em>2016***</em></strong></p>\n\n<p>--------------------------------------------------------------------------------------</p>\n\n\n\n\n\n<p>Have you ever wanted to know how to create an information product, but didn't know where to start?<br></p>\n\n\n\n\n\n<p><em>Do you wonder how online marketers are making sales with digital products?</em></p>\n\n\n\n\n\n<p>Would you be interested in creating an automated income online?</p>\n\n\n\n\n\n<p><em>Would you like to learn step by step on how to create a product without the hassle of going through multiple search engines trying to piece information together?</em></p>\n\n\n\n\n\n<p>Are you new and struggling to get your current information product to sell?</p>\n\n\n\n\n\n<p><strong>If you've answered yes to any of the questions above this course is for you. </strong></p>\n\n\n\n\n\n<p>Information Products for Beginners is a course that walks you step by step on how to create and market information products online.</p>\n\n\n\n\n\n<p>In this course, you'll have access to video lectures and supplementary material that give you clear direction and action steps on how to get a product to market.</p>\n\n\n\n\n\n<p>This course will take about hour to complete, but if you <strong>take a</strong><strong>ction on the information right after each lecture</strong> before moving on the next-- it can take a bit longer.</p>\n\n\n\n\n\n<p>You will be provided with options on how to create various forms of digital products online: guides, eBooks, video courses, and printables. I walk you step by step on how each one should be created, set up for sale, and marketed.</p>\n\n\n\n\n\n<p><strong>Take this course if you want step by step instructions to begin making an income online by creating your own digital products. </strong></p>\n\n\n\n\n\n<p><strong>***30 Day Money Back Guarantee, You have nothing to lose!***</strong></p>\n\n\n\n\n\n<p><em>Always wishing you the best, </em></p>\n\n\n\n\n\n<p><em>-Argena</em></p>", 
    "end_date": null, 
    "title": "Information Products For Beginners", 
    "price": "20.00", 
    "instructors": "Argena Olivis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552070_7395_2.jpg", 
    "course_url": "https://www.udemy.com/information-products-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T21:38:09Z"
}