{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Comprehensive Internet Marketing Home Study Training</strong><br style=\"\">  \t<em style=\"\">Go from novice to a pro internet marketer with step by step videos teaching you how to setup sites and getting traffic</em>  </p>  <p>  \t    Internet Marketing defies all economic trends. Amidst the economic recession, Internet Marketing is well and truly thriving. In fact many internet marketers are generating 7 to 8-figure incomes working part time from the comfort of their homes.<br style=\"\">  \t<br style=\"\">  \t      To be a successful internet marketer does not require a diploma or a degree. All you need is some free time, the right resources and training to start earning a passive income online. And unlike setting up a physical business or a franchise, internet marketing requires minimal investment.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Introducing EarnersClassroom</strong><br style=\"\">  \t<br style=\"\">  \t      It is a fact that most people who start internet marketing fail due to the lack of quality resources.<br style=\"\">  \t<br style=\"\">  \t      Earners Classroom is an A-Z Internet Marketing Online Academy providing comprehensive, step-by-step quality coaching videos developed by experts to help both beginners and seasoned Internet Marketers succeed in their online venture. This video series will take you from a novice to a pro in no time at all.<br style=\"\">  \t<br style=\"\">  \t<br style=\"\">  \t      - Quality training and internet marketing tools that will help You succeed with starting your online income stream.<br style=\"\">  \t      - Overcome the technical challenges to starting your Online Business.<br style=\"\">  \t      - Amazing products offering step by step instructions, tackling specific problems and offering simple solutions.<br style=\"\">  \t      - If you’re just starting out, there is no better recommendation than practical ‘step-by-step’ instructions and guidance.<br style=\"\">  \t      - Find the core technical information you need to be a successful online marketer – big or small.  </p>  <p>  \t      There are 4 Sections :  </p>  <p>  \t<strong style=\"\">IM Boot Camp</strong>  </p>  <p>  \t      Over 10 hours of step-by-step training video tutorials and PDF PowerPoints To follow along with.  </p>  <p>  \t      This video series will break the technical barriers that have been  holding you back from setting up your online business. Learn the exact  steps to setting up your domain, hosting, help desk, membership area and  much more.  </p>  <p>  \t<strong style=\"\">Wordpress Bootcamp</strong>  </p>  <p>  \t      Increasingly internet marketers are realising the power of WordPress.  Its Content Management System (CMS) offers a multitude of benefits.  </p>  <p>  \t      WordPress Boot Camp contains 60 jam-packed step-by-step WordPress  video tutorials that will take you from a novice to a pro in no time at  all.  </p>  <p>  \t      Learn everything you need to know about WordPress and blogging in this video series.  </p>  <p>  \t<strong style=\"\">Traffic Generation</strong>  </p>  <p>  \t      Without traffic no business can succeed. Having a website without  traffic is like having a billboard in the middle of the desert. Money is  in traffic. There are many ways of driving traffic to a website such as  SEO, Social Bookmarking, video marketing etc.  </p>  <p>  \t      But where do you start? Traffic Generation contains over 12 hours of  in-depth training on how to drive new customers to your website.  </p>  <p>  \t<strong style=\"\">Fire Your Boss</strong>  </p>  <p>  \t      8 Step by Step Video Course on how to make money online using the powerful method of Affiliate Marketing.  </p>  <p>  \t<strong style=\"\">Requirements</strong>  </p>  <ul style=\"\">  \t<li>No need to have your own product or Niche</li>  \t<li>No need to have your own website</li>  \t<li>No need to have any name recognition</li>  \t<li>No need to invest a lot of money</li>  \t<li>No need for technical skills</li>  </ul>", 
    "end_date": null, 
    "title": "Internet Marketing Classroom", 
    "price": "40.00", 
    "instructors": "Earners Classroom, Web Developer Matt Carson", 
    "commitment": "56 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49745_bc3c_9.jpg", 
    "course_url": "https://www.udemy.com/earners-classroom-complete-internet-marketing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-14T17:09:46Z"
}