{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">Course Updated For April 2015</strong><br style=\"\"></p>  <p>  \t<strong style=\"\">Over 2,200 students enrolled!</strong>  </p>  <p>  \t  The Instant List Generator is the most effective and easy way to generate tons of cash online via internet marketing, and list building.  </p>  <p>  \t          This course will show you the ins and outs of internet marketing, and open your eyes to a whole new way of making money online. We go over the tools that are needed in order to create your empire, and help you distinguish the good ones.  </p>  <p>  \t          After that we go over how to effectively get everything done for you, by outsourcing. That's right; most of the work doesn't even need to be done by you. We go over the best outsourcing sources that deliver great work at an amazingly cheap price.  </p>  <p>  \t          Lastly we cover how to build your email list. We go over the many different tactics the internet marketing gurus are using to capture people's attention, and convert them into buyers. We will teach you the very best way to rapidly grow your list. These sources are so good, that I was almost unsure if I wanted to release them or not.  </p>  <p>  \t          This course is jammed pack with everything you need to start your marketing empire, and grow your success online. The only thing you need to do is take action. Things will never get done unless you actually get up and do them. Being rich doesn't get handed to you, and don't expect anyone to feel sorry for you. You are on this planet by yourself, and you need to attack this like a wolf. You need to jump on this opportunity and don't let it out of your grasp. You are the alpha, you are the leader, and you are the winner. Take this course, and I will promise you only one thing, if you take action and give it your all. You will be successful.  </p>  <p>  \t<em style=\"\"><strong style=\"\">Every minute you wait you are actually losing money!</strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">To show my confidence in the course, I am offering you a 30 day no questions asked money back guarantee. So all the risk is taken off you!</strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">Enroll Now!</strong></em>  </p>", 
    "end_date": null, 
    "title": "Internet Marketing Guide: How to Grow Your Success Online", 
    "price": "20.00", 
    "instructors": "Francesco Iantorno", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327884_2dea_5.jpg", 
    "course_url": "https://www.udemy.com/internetmarketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T04:43:33Z"
}