{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><span></span></li></ul><p><strong>CURSO DE INTRODUÇÃO AO MARKETING DIGITAL - VÍDEO AULA</strong></p><p>A Internet é um canal incrível para atrair e reter clientes, com custos muito menores do que os da mídia tradicional (impressos, rádio, tv, etc).</p><p>Não importa se você é empresário ou profissional liberal, o marketing digital é um grande aliado para você vender seus produtos e serviços.</p><p>O curso de Introdução ao Marketing Digital em vídeo aulas, ensina você os primeiros passos para você usar a Internet de forma prática e inteligente na geração de riqueza para seu negócio.</p><p>Se você quer entrar nesse fantástico mundo dos negócios digitais, esse é o curso certo para você.</p><p>O curso de Introdução ao Marketing Digital tem linguagem fácil e acessível, com vários vídeos demonstrando como fazer na prática.</p><p><strong><br></strong></p><p><strong>Objetivos:</strong></p><ul><li>Apresentar os conceitos e nomenclaturas básicas em Marketing Digital</li><li>Ensinar o uso de ferramentas úteis nas campanhas digitais</li><li>Demonstrar estratégias de sucesso usadas por empresas e profissionais</li><li>Levantar tendências e novidades no mercado on-line</li></ul><p><strong><br></strong></p><p><strong>Duração:</strong></p><p>O Curso de Introdução ao Marketing Digital em vídeo aulas tem carga horária total de quatro horas e meia.</p><p><br></p><p><strong>Público Alvo:</strong></p><p>O Curso de Marketing Digital é destinado a estudantes, empresários, profissionais liberais e autônomos que queira dar os primeiros passos em campanhas de marketing na Internet.</p><p><strong><br></strong></p><p><strong>Professor:</strong></p><p>Mauricio Salvador é Mestre em Comunicação, autor de cinco livros de negócios digitais, foi professor na Universidade de Berkeley e consultor no Vale do Silício e para grandes empresas no Brasil.</p><p><strong><br></strong></p><p><strong>Conteúdo Programático:</strong></p><ul><li>Apresentação</li><li>O que é Marketing Digital</li><li>Planejamento de Marketing</li><li>E-mail Marketing</li><li>Marketing em Buscadores</li><li>SEO</li><li>Links Patrocinados</li><li>Rede Display</li><li>Comparadores de Preços</li><li>Redes Sociais</li><li>Marketing de Conteúdo</li><li>Programas de Afiliados</li><li>Métricas e monitoramento</li><li>Outras ferramentas</li></ul><p><strong><br></strong></p><p><strong>Por que escolher a ComSchool?</strong></p><li> Única escola no Brasil com cinco livros publicados na área digital</li><li> Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li> Programa inovador, fundamentado no conhecimento prático dos professores</li><li> Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li> Estude com alguns dos nomes mais influentes da Internet brasileira</li><li> A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas.</li>", 
    "end_date": null, 
    "title": "Introdução ao Marketing Digital", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678190_56d6_6.jpg", 
    "course_url": "https://www.udemy.com/introducao-ao-marketing-digital-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T13:05:47Z"
}