{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Maximize Your eBook Profits With Information Taught In This Course!</strong>  </p>  <p>  \t                    JOIN OVER 3,266 STUDENTS LEARNING HOW TO MARKET KINDLE eBOOKS WITH WORDPRESS<br><br><strong>This Udemy Course Has Been Updated As Of 11/1/2015  \t</strong></p><ul><li>Popular Course on Udemy!</li>  \t<li>Join over 3,266 students enrolled this course and learning how to market their self-published book with WordPress.</li>  \t<li>90+ Lectures packed full of useful tips and advice.</li>  \t<li>5 5-Star Ratings</li>  \t<li>Sell More eBooks with the information you will learn in this course.</li>  \t<li>Download free social media eBook on PDF!</li>  </ul>  <p>  \t<strong>Latest Course Reviews</strong>  </p>  <p>  \t<strong>Lots of Good Information for More than Just eBook Marketing</strong>  </p>  <p>  \t              The information provided in this course goes beyond eBook marketing. There is just a lot of good info on using WordPress, plug ins, and such. Many of the plug ins shared are a bit pricey, so I bookmarked the ones that I want to explore in the future. I like that the instructor doesn't waste a lot of time and gets to the heart of the subject. I did skip around and focused on the parts that interested me most.  </p>  <p>  \t<strong>Very Comprehensive</strong>  </p>  <p>  \t              Thanks. This course covers many areas where I have little knowledge. It is very helpful.  </p>  <p>  \t<strong>If You're a Writer, This is a Must-Take Course</strong>  </p>  <p>  \t              Although I've used WordPress for many years, I've never thought of it as a book promotional tool unto itself. I learned a lot about mailing lists and lead pages - the two areas in which I tend to be the weakest. Excellent material and easy-to-understand.  </p>  <p>  \t<strong>        CLICK \"TAKE THIS COURSE\" TO GET STARTED NOW!  </strong>  </p>  <p>  \t                    WordPress Plugins and WordPress Marketing tools I used to sell over 1,000 copies of my best selling self-published book. Learn how to sell more products, books, online courses and promote your business with affordable WordPress.  </p>  <p>  \t                        This is a course designed to help self-published authors like yourself market your books using plugins and tools that work with WordPress.  </p>  <p>  \t<strong>30-Day Money Back 100% Risk Free Offer!</strong>  </p>  <p>  \t                  Do you want to learn how to market your self-published book better online? Are you lacking what it takes to reach out and market to your customers? Are you staying in touch with your current clients? How are you bringing them back to your website? Is your website connected to your social media? In this course we cover the tools I have used to sell over 1,000 copies of my best selling book. It didn't take a lot of money to do this and it is easy to do for most. I will show you how I did it and how you can do it too.  </p>  <p>  \t<strong>COURSE BONUS:</strong> Receive a free full PDF copy of this same book when you finish this course.  </p>  <p>  \t<strong>Here is some of what you will discover during this course:</strong>  </p>  <ul>  \t<li>What tools to use for creating landing pages for your book.</li>  \t<li>Finding great themes for self-published authors and free and affordable plugins for marketing.</li>  \t<li>Selling your books with the popular WordPress Gravity Forms plugin.</li>  \t<li>Start your own affordable email marketing list. So affordable it is actually free!</li>  \t<li>How to grow your mailing list and build authority with webinars or a Podcast.</li>  \t<li>How to promote your current self-published Kindle book and getting ready to market your next book.</li>  \t<li>Finding great themes that can be setup in just a few hours.</li>  \t<li>How to save time posting to social media networks like Facebook, Twitter, Pinterest and more.</li>  </ul>  <p>  \t<strong>BONUS: Get a free PDF copy of my Best Selling Book.</strong>  </p>  <p>  \t<em>Don't forget to check out the free preview lectures to sample my course. </em>Are you ready to learn?<br>  \t<br>  \t                  Click On \"<strong>Take This Course</strong>\" and start earning more revenue now with these proven marketing techniques. Don't wait another minute, start maximizing your eBook profits now with WordPress Marketing!  </p>", 
    "end_date": null, 
    "title": "Kindle Book Marketing: Earn More Revenue With WordPress", 
    "price": "20.00", 
    "instructors": "Dennis J. Smith", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371126_db7e_2.jpg", 
    "course_url": "https://www.udemy.com/maximum-ebook-profits-with-wordpress-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T01:07:06Z"
}