{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>When you hear the word &quot;marketing&quot; do you get that sinking feeling in the pit of your stomach like I do? Can you feel yourself slogging around the internet trying to think of yet another interesting blog or Facebook post to &quot;keep the attention&quot; of your potential readers? </p><p>This course is designed to help you to <strong style=\"\">get all of your Kindle eBook&#039;s &quot;on page&quot; information right</strong> so your Kindle books will sell themselves. You do this by researching quality keywords and incorporating those keywords into compelling titles, subtitles and descriptions. If you do this right, the search engines will send traffic to your books in the form or potential readers and those <strong style=\"\">readers will feel compelled to buy your books</strong> once they arrive. </p><p>This course will also show you how to <strong style=\"\">create a compelling cover</strong> to help it stand out in the sea of Kindle cover thumbnails that show up in Amazon&#039;s search results.</p><p>Finally, you&#039;ll learn how to use KDP Select to <strong style=\"\">promote your book for free </strong>to boost sales, get reviews, and attract more readers.</p><p>-----------------------<br style=\"\"></p><p><strong style=\"\">Warning:</strong> This is NOT a Kindle marketing course. If anything, it is a Kindle <em style=\"\">Anti-Marketing</em> course! These strategies are probably not going to increase your book sales by 1,000%, get your book into the top 100 selling Kindle books on Amazon, or take your book from 0 sales per month to 500 sales per month. <em style=\"\">But they are the key to creating better sales results for you book without doing all of that time-consuming and expensive ongoing marketing.</em></p><p>-----------------------<br style=\"\"></p><p>You won&#039;t hear me saying, <em style=\"\">&quot;Just spend 11 hours per week doing tweets, Facebook posts and providing tons of free content in your email blasts and you&#039;ll boost your sales.&quot; </em></p><p>That stuff works, but <strong style=\"\">if you&#039;re like me, you&#039;re BUSY!</strong> You need Kindle marketing strategies that you can implement ONCE that will keep working hard for you in the weeks, months and years to come.</p><p>Here&#039;s what you&#039;ll learn  in this course:<br style=\"\"></p><ul style=\"\"><li style=\"\">Market your Kindle eBooks without actually doing any marketing</li><li style=\"\">You&#039;ll simply use Amazon&#039;s marketing power and SEO to help Amazon market and sell you eBooks FOR you</li><li style=\"\">How to write killer SEO titles so your Kindle eBooks are marketing themselves</li><li style=\"\">How to write killer SEO descriptions so your Kindle eBooks are marketing themselves</li><li style=\"\">How to write a killer SEO keyword list for your book&#039;s meta data page so your Kindle eBooks are marketing themselves</li><li style=\"\">How to give away books to boost your reviews, sales rankings, visibility and ultimately sell more eBooks</li><li style=\"\">3 Essential elements of a cover that will sell vs. a cover that will fail</li><li style=\"\">How to understand your customer&#039;s emotions and needs and show them that they want to buy your book</li></ul><p>If you&#039;re ready to improve your sales without all of the tedious outside marketing, click on the <strong style=\"\">Take This Course</strong> button or check out one of the <strong style=\"\">Free Preview Lectures</strong> and get started today. </p><p>Thanks for choosing this course and I&#039;ll see you inside!</p>", 
    "end_date": null, 
    "title": "Kindle Marketing Hacks - How to Sell eBooks w/No Marketing", 
    "price": "20.00", 
    "instructors": "Steve McDonald", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462572_1a53_4.jpg", 
    "course_url": "https://www.udemy.com/kindle-marketing-hacks-how-to-sell-ebooks-no-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T02:59:56Z"
}