{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Optimize your Landing Page and increase Covertions up to 100%! Guaranteed!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">The only Landing page optimisation course</strong> that info about the service that lets you Watch What Users is Doing on Your Page - great tool to analyse webpage and optimize landing page convertions + it has many cases, tests, facts, A/B testing info and so on!  </p>  <p style=\"\">  \t  Novadays, Landing pages are nice and important, so people started to create them...and mostly didn&#039;t succeed. Why? Because it&#039;s not enought to only insert some sign up form or something else to make your page more landing - it&#039;s a little more complicated, but i will explain to you what to do by easy words! With this course, you will optimize your Landing page to become the best!  </p>  <ul style=\"\">  \t<li>Learn about landing page optimisation things you don&#039;t know</li>  \t<li>Many useful information, like elements positioning, colours usage, examples, testing information and so on!</li>  \t<li>No useless talking - straight info how to be the best.</li>  \t<li>Many cases explained, including best and worst pages.</li>  \t<li>Little Google analytics guide - learn to analyse your Landing Page metrics in seconds!</li>  </ul>  <p>  \t      You will reimagine your landing page&#039;s knowledge - i will show you many cases and what features do landing page the best.  </p>  <p>  \t    Landing page optimization course includes tests, my little e-books and more!  </p>", 
    "end_date": null, 
    "title": "Landing Page: Optimization to convertion and profit", 
    "price": "20.00", 
    "instructors": "Dmitry Sergeev", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416776_a3e1_3.jpg", 
    "course_url": "https://www.udemy.com/landing-page-optimization-to-conversion-and-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T21:24:33Z"
}