{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  There are &lsquo;ways&rsquo; of creating a landing page, and <strong style=\"\">WAYS of creating a Landing Page</strong>. Not all landing pages are built the same &ndash; as you may have noticed, or if not will soon discover. You might have questions: Why do some pages fail? Can they be improved? Can we do conversion rate optimization? The answer to this is a resounding yes, yes, and with some knowledge YES!  </p>  <p>  \t  Whether you are a marketer, designer, growth hacker, student, entrepreneur or business owner, <em style=\"\">heck!</em> you could even be the poor person who cops the blame for under-performing landing pages - then this conversion rate optimization course is suited to you.  </p>  <p>  \t  I show you the most effective ways to use a landing page to: sell your products, offer your services, build your newsletter database, generate new leads &ndash; whatever your purpose. You can also use this information to fix a poorly performing landing page that already exists.  </p>  <p>  \t  Some of the things you will learn from this conversion rate optimization course include:  </p>  <p>  \t  1.  Identifying what makes a landing page good or bad, effective or abysmal  </p>  <p>  \t  2.  The best practices for creating pages THAT WORK - and where to begin  </p>  <p>  \t  3.  Using Tactical Design Techniques to achieve Maximum Impact  </p>  <p>  \t  4.  How to write GOOD, EFFECTIVE COPY to win more customers  </p>  <p>  \t  5.  Technical considerations, &lsquo;hints and tips&rsquo; and other helpful knowledge on conversion rate optimization  </p>  <p>  \t  6.  Optimizing your page with various tools and testing methods  </p>  <p>  \t  7.  Effective ways to capture more leads, and reduce bounce rates  </p>  <p>  \t    (and hopefully Converting those Leads Into Buyers or customers)  </p>  <p>  \t  8.  And most importantly <strong style=\"\">HOW TO INCREASE YOUR CONVERSIONS</strong> (and possibly your top line!)  </p>  <p>  \t    Now wouldn&rsquo;t that be nice??  </p>  <p>  \t  You don&rsquo;t have to shoot in the dark any longer. There are over 60+ lessons and 4.5 hours of content.You can even adjust the video playback speed to suit your learning speed (<a href=\"http://support.udemy.com/knowledgebase/articles/203906-how-do-i-change-the-video-viewing-speed-\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">HTML5 Player with multi-speed option</a>). I&rsquo;ll provide you with a wide range of examples, lecture &#039;main point&#039; summaries, printable handouts and resources to guide you through the course.  </p>  <p>  \t  It&rsquo;s not rocket science, but it is an art. It requires little investment, with the potential for maximised returns.  </p>  <p>  \t  So if you think you&rsquo;re ready to stop losing money, jump right in and start learning conversion rate optimization now!  </p>", 
    "end_date": null, 
    "title": "Landing Page Design & Optimization - build pages that work!", 
    "price": "50.00", 
    "instructors": "Lia  TDA", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17182_5f79_7.jpg", 
    "course_url": "https://www.udemy.com/landing-page-design-optimization/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-03T12:47:49Z"
}