{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>** Update 22/11/2015**</strong></p><p>Starting this December, I will be given away <strong>FREE hosting account</strong> to those on my course. Full details of this will be posted within a week. So not only you will get one of the best courses on Making Money Online but you will also get a FREE hosting to try and test different ways of implementing your learning.</p><p><strong>*************************************</strong><br></p><p>Do you have a WordPress Website or are you thinking of building one any time soon.  </p>  <p>  \t                    What will your next website be?  </p>  <p>  \t                    Do you need some great idea’s that will make you money online using your site?  </p>  <p>  \t                    Let me take you step by step and show you what are the leading Internet marketers have been doing to create massive wealth using their sites.<br>  \t<strong></strong>  </p>  <p>  \t<strong>No Technical knowledge needed</strong><br>  \t<strong></strong>  </p>  <p>  \t<strong>Watch over my shoulder how I….</strong>  </p>  <ul>  \t<li>Install <strong>WordPress</strong></li>  \t<li>Turn WordPress into an <strong>ecommerce </strong>website</li>  \t<li>Enabling your blog to make money for you</li>  \t<li>Introduce you to the best <strong>affiliate networks</strong> available one of which is <strong>JVZOO </strong>by setting up your first product</li>  \t<li>Show you what <strong>membership sites</strong> are all about and walk you through not only installing a membership site but also a walk through linking your membership site with the best affiliate network available with the potential of making mass amounts from huge flood of traffic available for you for free</li>  </ul>  <p>  \t                    Have you heard of WordPress multi site, well this is a great opportunity for you to take you step by step to creating your own private network of sites which you can use or sell on  </p>  <p>  \t                    I will also show you how to best optimise and backup your WordPress  </p>  <p>  \t                    An absolute wealth of information.  </p>  <p>  \t<strong>*** NO Experience &amp; NO Technical knowledge needed ***</strong>  </p>  <p>  \t                    If you struggle at any stage, I will be there to guide and help you  </p>  <p>  \t<strong>Join us today and secure your future tomorrow</strong>  </p>", 
    "end_date": null, 
    "title": "Launch a Monetized E-Commerce Site with WordPress", 
    "price": "20.00", 
    "instructors": "Khalid Hamadeh", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381520_8164_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-the-ultimate-selling-machine/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-31T09:30:03Z"
}