{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Avec ce cours, vous en apprendrez plus sur le marketing web que la plupart des propriétaires de PME ou des travailleurs autonomes n’en sauront jamais! Gagnez plus de clients et faites plus d&#039;argent grâce à un marketing internet qui fonctionne.</strong>  </p>  <p style=\"\">  \t<em style=\"\">En vous inscrivant à ce cours, vous aurez un accès immédiat à toutes les leçons du cours. Vous pouvez visionner les capsules à votre rythme et quand vous le voulez. </em>  </p>  <p style=\"\">  \t  Vous en saurez assez sur le sujet soit pour vous occuper vous-même de votre marketing web avec succès ou au moins pour comprendre ce que les agences vous offrent et les challenger un peu. Reprenez le contrôle de votre propre marketing et utilisez le web comme une machine à générer des prospects et des clients pour votre entreprise.  </p>  <h5 style=\"\">Réunissez enfin toutes les pièces du casse-tête</h5>  <p style=\"\">  \t  Si vous êtes propriétaire d’une petite entreprise ou travailleur autonome, vous avez probablement du mal à trouver le temps, l&#039;argent et l&#039;expertise nécessaires pour réussir votre marketing en ligne.  </p>  <p style=\"\">  \t  Si vous êtes comme moi, votre boîte de réception de courriel est inondée de messages de marketing faisant toutes sortes de promesses et couvrant tous les sujets imaginables : le SEO, les médias sociaux, les blogues, la conception de sites Web , etc. Vous êtes probablement bombardé d’offres de toutes sortes, qui semblent toutes vous promettre la lune, mais sans jamais ne rien vous expliquer en détail. Beurk!  </p>  <p style=\"\">  \t  Malheureusement, la plupart d’entre nous avons l’impression de constamment avoir sous la main différentes pièces d’un casse-tête géant sans jamais avoir une vue d’ensemble de ce qu’est le marketing web et de ce qui peut réellement fonctionner pour nous.  </p>  <h5 style=\"\">Voici la solution!</h5>  <p style=\"\">  \t  Ce cours intensif sur le marketing web est un guide pratico-pratique et facile à suivre qui vous guidera étape par étape vers le succès de votre entreprise sur le web. En passant à travers ces 14 modules, vous en saurez plus que la plupart des gens et vous aurez déjà commencé à générer des leads et des clients.  </p>  <p style=\"\">  \t  *Tout est pensé en fonction d’un cours intensif de 30 jours, mais vous pouvez y aller à votre rythme, car vous avez accès au cours en tout temps et sans aucune date d’expiration.  </p>  <ul style=\"\">  \t<li style=\"\">Obtenez plus de prospects et plus de clients avec un plan simple et éprouvé.</li>  \t<li style=\"\">Suivez un plan d’action étape par étape prévu sur 30 jours</li>  \t<li style=\"\">Mettez en action un plan de marketing web qui fonctionne pour vous et votre entreprise</li>  \t<li style=\"\">Rejoignez vos clients potentiels peu importe où ils sont sur le web</li>  \t<li style=\"\">Créez du contenu percutant et diffusez-le sur le web</li>  \t<li style=\"\">Créez des articles et des vidéos engageants qui vous démarquent et qui vendent</li>  \t<li style=\"\">Donnez un second souffle à votre site web ou créez en un nouveau qui sera la pierre angulaire de votre marketing</li>  \t<li style=\"\">Faites plus d&#039;argent et ayez plus de succès grâce à un marketing internet efficace!</li>  </ul>  <p style=\"\">  \t  Ne laissez pas le bas prix vous tromper! Mon intention en mettant ce cours sur pied est d’offrir la meilleure et la plus complète introduction au marketing en ligne possible. Il s’agit d’un plan qui vous permettra sans aucun doute de faire croître votre entreprise. Même si vous ne prévoyez pas tout faire vous-même, vous aurez une excellente compréhension du marketing web, vous saurez ce qu’il faut faire et vous pourrez être critique par rapport aux gens qui veulent vous vendre leurs services.  </p>  <h5 style=\"\">Commencez à démystifier le marketing web pour votre PME. Inscrivez-vous maintenant en cliquant le bouton bleu ci-dessous.</h5>  <p style=\"\">  \t  Après avoir cliqué sur le bouton, vous serez dirigé vers le panier d&#039;achat. Remplissez les informations nécessaires pour la création de votre compte et complétez votre achat sécuritairement avec une carte de crédit ou via Paypal. Vous serez ensuite dirigé vers votre compte et vous pourrez accéder au cours immédiatement en allant à la section «mes cours».  </p>  <p style=\"\">  \t  Vous recevrez une facture ainsi que vos informations de connexion par courriel. Ce cours inclut une garantie de satisfaction de 30 jours. Vous n&#039;avez donc rien à perdre et beaucoup à gagner! Pour toutes questions, <a href=\"http://www.webacademie.co/contactez-nous/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">contactez-nous ici</a>.  </p>", 
    "end_date": null, 
    "title": "Le marketing sur internet pour les entrepreneurs", 
    "price": 0, 
    "instructors": "Antoine Bonicalzi", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/229160_49ab_5.jpg", 
    "course_url": "https://www.udemy.com/marketing-sur-internet/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-25T22:46:49Z"
}