{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><span><span style=\"color: rgb(192, 80, 77);\"><strong>The Secret To  Creating Optin Offers That Your Prospect's Can't Resist.</strong></span></span>\n</p><p><span>If you're struggling to build your list, then this may just be the most important thing you read all day.</span>\n</p><p><span>Would you like to magnetically attract a list of qualified leads who are ready, eager and willing to buy from you? </span>\n</p><p><span>If\n you answered yes, then I have the solution for you. The first step to \nattracting hot leads is to create a juicy lead-magnet, something so \nirresistible that your prospect can't help but enter their name and \nemail address into the optin box in order to get it.</span>\n</p><p><span>That's exactly what you're going to be learning in this comprehensive  course. Here's what you'll discover:</span>\n</p><ul><li><span>14 Types of Lead Magnets You Can Create</span></li><li><span>5 Places To Get Maximum Exposure For Your Lead Magnet</span></li><li><span>Step-by-Step directions on how to create the content for your first lead magnet</span></li><li><span>How to subtly promote your paid products within your report without making your reader feel \"sold to\"</span></li><li><span>The perfect lead magnet for your market</span></li><li><span>Why\n your approach needs to differ depending on whether you're selling a \nphysical product, an information product or a service. Not knowing this \nvaluable nugget of information could mean the difference between just a \nhandful of people joining or list or thousands of people opting in.</span></li><li><span>5\n Completely different approaches to creating your lead magnet content. \nYou're going to love this. Once you know these approaches, you'll never \nbe at a loss for what to write.</span></li><li><span>10\n \"magic phrases\" to pepper throughout your report in such a way that \nwows subscribers, builds trust and leaves your prospect hungry to \npurchase your product or engage your services.</span></li><li><span>How\n to get subscribers to actually consume your lead magnet. It's one thing\n to get your prospect to download your lead magnet and another thing to \nget them to actually consume the content. Because it's only when they \nactually consume your content do you get a chance to build credibility, \nto showcase your expertise, to get them to like and trust you and \nultimately to get them to buy from you.....not just once, but over and \nover again. You will learn a simple strategy that will get your leads to\n consume your lead magnet and become your raving fans.</span></li><li><span>Irresistible Lead Magnet Checklist</span> <span></span></li><li><span>BONUS - How to turn your blog posts into mini-lead magnets to skyrocket your optins.</span></li><li><span><span style=\"\"><span style=\"\">BONUS - 7 Common Mistakes People Make When Creating a Lead Magnet  </span></span><br></span></li></ul><span><span style=\"color: rgb(192, 80, 77);\"><span><span><span><span><span style=\"color: #000000;\"><span><br></span></span></span></span></span></span></span></span>", 
    "end_date": null, 
    "title": "Lead Magnet Mastery", 
    "price": "50.00", 
    "instructors": "Sadiyya Patel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695372_9641_3.jpg", 
    "course_url": "https://www.udemy.com/lead-magnet-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T04:41:27Z"
}