{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  In the old days, if you made your money online by selling informational based products you were nothing more than a plain, old internet entrepreneur.  </p>  <p>  \t  Nowadays, that’s all changed and thanks to numerous people having enormous success with the likes of Clickbank, the infopreneur was born.  </p>  <p>  \t  And it’s a pretty attractive job truth be told.  </p>  <p>  \t  People always need valuable information so you help them out and in return, they help you out by providing the internet lifestyle that you deserve.  </p>  <p>  \t  If you’re sat around thinking that you don’t have anything to offer the world you’re wrong.  </p>  <p>  \t  Everyone holds information that’s gold to other people, you just need to know how to market it so with that, here are the 3 Golden Rules that infopreneurs live by.  </p>  <p>  \t  –Head For A Niche Within A Niche  </p>  <p>  \t  If you’re thinking you’re going to rock up to a competitive industry with a new info-product and find success without positioning yourself in a smaller pocket of the niche then you’re sadly mistaken.  </p>  <p>  \t  In every industry whether it be weight loss or real estate, there are no all round experts who can contribute value to society in any sector of the market.  </p>  <p>  \t  For example, trying to market yourself as an overseas property investment specialist and a commercial property magnate and anything and everything else in between is a sure fire way to lose credibility instantly.  </p>  <p>  \t  You want to zone in on one specific segment of a niche and build your business around that.  </p>  <p>  \t  –Be The Expert  </p>  <p>  \t  This is really just following on from the first rule but it’s important to mention – you need to be THE expert.  </p>  <p>  \t  The place that everyone goes to when they need advice on a certain subject.  </p>  <p>  \t  You can’t do that if you’re trying to be all things to all people.  </p>  <p>  \t  If you’re in the weight loss niche, it’s better to be the expert in helping men lose 50 lbs or more than it is to create some fad diet that doesn’t really know who it’s targeting.  </p>  <p>  \t  Positioning yourself in a different way is the key to being able to find success in already hugely competitive markets.  </p>  <p>  \t  –Outsource When You Need To  </p>  <p>  \t  Every successful businessman on the planet knows how to delegate.  </p>  <p>  \t  Doesn’t matter if they work solely online or own a massive chain of hotels – they have to leverage the hard work of others to get results and if you’re a one man band, you have to do the same.  </p>  <p>  \t  If you’re the worst copywriter the world has ever seen then it makes absolutely no sense to write the copy yourself even if that does mean an expensive trip to a marketing agency.  </p>  <p>  \t  The same goes for any other aspect that you can’t really do at a high standard.  </p>  <p>  \t  Now, this shouldn’t knock your confidence, it should do quite the opposite.  </p>  <p>  \t  You only need to be good at one thing to make a bundle of money online so find what that one thing is and run with it.  </p>", 
    "end_date": null, 
    "title": "Learn How To Create Your Own Best Selling Online Product", 
    "price": "20.00", 
    "instructors": "Jani Stepan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/263358_3ef4_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-create-your-own-best-selling-online-product/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-17T13:15:58Z"
}