{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>We started creating digital magazines in 2011 for our products and services and targeted the new tablet market. We were quite successful so many of our clients asked if we could create digital magazines for them. We recently sold the business and started training people how to do it for them selves.</p><p>Lots of people see the magazine market as expensive and highly difficult to enter into and this is the case with print media however digital magazines can be a lot easier and cheaper because of the digital content.</p><p>There are pitfalls however in in Digital magazine production.</p><p><strong>We were successful for two reasons and so can you be.</strong></p><p><strong>Firstly we created content for a hungry market. </strong>iPads were released in 2010 and we could see that people were hungry for product to use on their new device so we produced it. We allowed them to manage their own files because may choose to read on a laptop or desktop. For this reason we did not use an app.</p><p><strong>Secondly we developed for the device. </strong>Most traditional print magazines simply created their magazine into a PDF and delivered it that way not realizing that on the new tablets, readers had to scroll and zoom to be able to read the content. Many still do this and many have gone out of business.</p><p>In this course we deliver in screen capture videos on all the basics of creating an easy to read digital magazine specially designed for tablets. Some of our students have gone on to develop very successful digital magazines.</p><p>We will get straight into the process by first going through a number of ways to make the covers. Flat, 3d and non Photoshop. We will provide you with files you can adjust to give you a head start.</p><p>Next we delve into how we create the content plus use our own advertising. When successful you will be selling this to other businesses.</p><p>Once this is done we do the formatting and get the magazine ready for distribution.</p><p><em>In the last lesson we provide you with some great resources in the form of a PDF</em> full of graphics and files you can use and we have discussed in the lessons.</p><p>Now you are ready to go and make your own Digital Magazine.</p>", 
    "end_date": null, 
    "title": "Learn to Create Digital Magazines For Yourself and Customers", 
    "price": "25.00", 
    "instructors": "Mr Quentin Brown", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/772802_ede8.jpg", 
    "course_url": "https://www.udemy.com/learn-to-create-digital-magazines-for-yourself-and-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-24T10:56:46Z"
}