{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Join More than 1,100 Happy Students In 105 Countries and Learn PPC the Right way.<br></p><p>- Learn How to Quickly Get More Customers with Adwords, Facebook PPC and More. </p><p>- Learn the Simple Strategies Used by Digital Marketing Experts to Increase Online Sales.</p><p>- Learn What Makes a Successful Campaign &amp; Skip The Usual Long Learning Process.</p><p>Take Our FREE Lectures Below and Get Started Right Now.</p><p>.<strong>Feedback from Just Some of Our Early Happy Students:</strong></p><p><em>\"Really nice course. Good pace. Not too complex but very practical. Got a lot of great tips for my website\"</em> - Greg Williams, USA.<br></p><p><em>\"Super course and very generous with your time 1:1. Lots of great ideas that I'm eager to get started on\"</em>. - Mike Mitchell, UK.<br></p><p>\"<em>Great course! Easy to follow for a beginner and I can already setup lots of different types campaigns for my website</em>\" - Mary-Siobhan, Ireland</p><p><br></p><p><strong>Learn how to </strong><strong>Implement</strong> <em>highly targeted </em>campaigns with Facebook and Adwords without needing to spend weeks, months or even years learning the key principals of success on these platforms.<br></p><p><span></span></p><p>You'll <strong>learn from a former Google employee</strong> who has helped <strong>hundreds </strong><strong>of businesses</strong> and individuals achieve success through PPC advertising, conversion rate optimization and simple analytics insights that you can replicate.<span></span></p><p>No complicated, hard to follow processes, just plain English and easy to follow steps to get results! </p><p><br></p><p><span></span>You'll<strong> learn how to setup all types of campaigns</strong>, from simple to advanced, <strong>step by step</strong> from the beginning so you can attract your ideal customers to your website in <em>just a few hours</em>.</p><p><span></span><strong>Learn how to avoid the mistakes </strong>that <strong>90%</strong> of marketers make when using these platforms.</p><p><span></span><strong>Learn how to save money</strong> While Advertising and Still Improve Performance and Get More Website Visitors.</p><p>You'll even learn how to get your website visitors to purchase from you more often without increasing costs and without having to touch any website code.</p><p>You'll see everything in <em>easy to follow steps</em> so you can learn advanced techniques without the complex jargon and instructions that usually make these topics so hard to learn.</p><p>Most Importantly, You'll Learn how to make more money using these marketing channels.</p><p>Preview the FREE lectures below Now and see how actionable the course content really is!</p><p><br></p><p> <strong>The Benefits of This Course?</strong></p><ol><li>More Than <strong>50</strong> Lectures and More than 5 Hours of video Content</li><li>The Most Up to Date Content on These Platforms on Udemy.</li><li>The Ability to Confidently Implement Highly Targeted Campaigns on Facebook and Adwords in Minutes.</li><li>The Rare Skill of Being Able to Attract the Right Types of Customers to Your Website AND Get Them to <strong>Take Action</strong> (Buy From You).</li><li>The Ability to Use Analytics to Gain Revenue Driving Insights from Your Website without Learning Complicated Tools and Reports.</li><li>Full Course Content Support From Your Instructor <em>7 Days A Week</em></li><li><strong>A Complete Certificate</strong> from The Edessa Institute.</li></ol>", 
    "end_date": null, 
    "title": "Learn Adwords & Facebook PPC With A Former Google Employee", 
    "price": "25.00", 
    "instructors": "Edessa Institute", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648748_10ea_3.jpg", 
    "course_url": "https://www.udemy.com/learn-facebook-and-adwords-ppc/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T10:49:22Z"
}