{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "  <p style=\"\">When the average person thinks of social media they will typically think of sexier platforms like Facebook, Twitter, Google+, Instagram, and Pinterest. </p><p style=\"\">But every single minute, some 165 million emails are sent by an estimated 3.5 billion email accounts around the world, and approximately 80-100 of those emails land in your inbox, each and  every single day and this isn&#039;t by accident. In this course we are going to break down the components of email marketing and reverse engineer what makes great email campaigns successful. </p>  <p style=\"\">This course is going to be for anyone who is new to using email marketing for the purposes of trying to <strong style=\"\">grow their business</strong>, as well establish a <strong style=\"\">deeper level of connection</strong> <strong style=\"\">with their customers.</strong></p><p style=\"\">If you&#039;re someone who is already using email marketing for your business, and you would simply like to improve your results, or maybe just fine tune what it is that you&#039;ve been doing, then this course will be able to offer you some tips and techniques that will allow you to best accomplish that.</p><p style=\"\">You&#039;re going to learn what it takes to get your email subscribers to open all of your emails. We&#039;re also going to cover what needs to be done to improve your chances of getting through your subscribers ISP controlled spam filters.</p>", 
    "end_date": null, 
    "title": "Learn How To Build Your Business With The Power Of Email", 
    "price": "20.00", 
    "instructors": "Tiberius Publishers Group", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533640_7e3e_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-build-your-business-with-the-power-of-email/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-21T19:07:03Z"
}