{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p></p><p></p><p>&quot;One of the best classes I&#039;ve ever attended on\r\nSkillshare.&quot; - Founder of Skillshare Michael Karnjanaprakorn</p><p>&quot;Highly actionable and thought provoking class.\r\nRecommend to any startup looking to quickly build their user base.&quot; - Jan\r\nRenner</p><p>“Michael&#039;s class was easily the best skillshare\r\nclass I&#039;ve taken and I&#039;ve taken a number of them. This class is an absolute\r\nmust for anyone involved with a startup. Michael knows user/customer\r\nacquisition inside and out and you will too if you sign up for this class.” -\r\nCarlo Cisco</p><p>Learn how to get the first million users and how to increase sales\r\nof your business, or speed up your already decent growth. You will learn from\r\nmy experience and lessons learned while building some of the largest social\r\nsites and apps in the global market today.</p><p>Areas covered will include:</p><p>mapping out your viral system and</p><p>how to use that to start virally expanding your\r\nuserbase</p><p>This class is best suited to those with a\r\nstartup/online project already, or at least a formed idea of one. However,\r\nprojects can also be completed using Udemy.com as a substitute for having a\r\npersonal project already. All concepts are completely applicable to B2C\r\n(business to consumer) projects, and mostly applicable to B2B projects.</p><p>You will finish this class understanding:</p><p>the exact building blocks of virality within your\r\nown project and</p><p>how to put them into motion to start gaining large\r\namounts of users (for free)</p><p>This class is all taught online. The class is\r\ncomposed of videos of me explaining key viral concepts, slides to go along with\r\nthose videos, a viral mapping project, and online live sessions from time to\r\ntime where all questions can be answered.</p><p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n</p><p>Take this How To Get First Million Customers\r\ncourse now and learn how\r\nto increase sales.</p><p></p><p></p><ul> </ul>\r\n", 
    "end_date": null, 
    "title": "Learn How to Get Your First Million Users", 
    "price": "20.00", 
    "instructors": "Michael Geer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/9224_2240_6.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-get-your-first-million-users2/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-08-19T21:03:40Z"
}