{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t                    This course will take you step-by-step in the process of creating and growing consistently a highly targeted email list for your business, website or blog.  </p>  <p>  \t                    There is no question that a solid, engaged list is the key to success when it comes to online marketing. This course will show you how to get there.  </p>  <p>  \t              -----------------------------------------------------------------------------------------------------------------------  </p>  <p>  \t        Join over 900 students and start building a consistent, highly targeted email list!  </p>  <p>  \t            New lectures coming soon and price increasing to $299 end Feb.  </p>  <p style=\"\">  \t              -----------------------------------------------------------------------------------------------------------------------  </p>  <p>  \t<strong style=\"\">WITH THIS COURSE YOU&#039;LL:</strong>  </p>  <ul style=\"\">  \t<li>Discover how I get over 1,200 new highly targeted email subscribers per month and how you can do the same.</li>  \t<li>Generate highly targeted trafic for your website and / or blog.</li>  \t<li>Increase your conversion rate, so people are not only visiting your website but subscribing to your mailing list.</li>  \t<li>Position yourself as a top notch professional in your market with simple tricks and techniques.</li>  \t<li>Attract your ideal customers and convert them into email subscribers with proven online marketing strategies and techniques.</li>  \t<li>Communicate properly, so you can transform your email subscribers into paying clients.</li>  </ul>  <p>  \t                    In this course, you&#039;ll learn everything your need to know not only to understand perfectly why it&#039;s important to grow your list and how you have to manage it and communicate to make the most of it but also how to increase your conversion rate, and grow your list massively over time.  </p>", 
    "end_date": null, 
    "title": "List Building: How I Get Over 1,200 New Subscribers a month", 
    "price": "20.00", 
    "instructors": "Pauline Hanuise", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334952_1eae_6.jpg", 
    "course_url": "https://www.udemy.com/list-building-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T17:14:59Z"
}