{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">As Mark Twain once probably wrote..</p><p style=\"\"><strong style=\"\">“If you want to make money in your business, you need to know how to use the tools.&quot;</strong></p><p style=\"\">One of the most important tools for a long term profitable business in this day &amp; age is an email autoresponder like GetResponse.</p><p style=\"\">While the internet is chock full of free information on how to use <em style=\"\">this</em> email service provider or <em style=\"\">that</em> email service provider, they were lacking the organization, detail &amp; style of teaching that enables you to best learn from and take action with.</p><p style=\"\">This course<strong style=\"\"></strong><strong style=\"\"></strong>, lays it out for you in easy to follow &#039;over the shoulder&#039; style training videos.</p><p style=\"\">This way you see it being done right in front of you, so you just do as you see – <strong style=\"\">easy peezy!</strong></p><p style=\"\"><strong style=\"\">I had a couple questions about the GetResponse Custom Fields and the &#039;New&#039; Segmentation feature &amp; couldn&#039;t find the answer…</strong></p><p style=\"\">While I now love the new way that GetResponse lets you segment your subscribers, at first it was difficult to figure out. The other tipping point that got me geared up to create these training videos, were the custom fields and adding them to the web forms.</p><p style=\"\">So before I got too frustrated trying to figure these out on my own, I started looking on Google and YouTube for videos to answer my questions.</p><p style=\"\">I found a lot of disorganized information, both text and video and after sifting through all that I still was without my answer.</p><p style=\"\">In the process of finding the answer to my original questions, I discovered other GetResponse customers with their own problems on how to do this or how to do that.</p><p style=\"\">So I decided it was time for me to swing into action and carve out the time I needed to learn all the features of GetResponse <strong style=\"\">AND</strong><em style=\"\"> to do an up-to-date detailed training course on How To Use An Autoresponder – GetResponse Edition.</em></p><p style=\"\"><strong style=\"\">I found the solution to my problem and whole lot more!</strong></p><p style=\"\">I discovered the solution to my problem by trial &amp; error and in the process, I recorded 24 other videos on how to maximize the power of your GetResponse account in ways many long time users may not even know exist.</p><p style=\"\">You will get access to all my videos and files. With every video is included the transcripction in the resources section, that you can download for better undertanding.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "List Building with GetResponse: unlimited list subscribers", 
    "price": "20.00", 
    "instructors": "Angel Fernandez", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461490_bf6b_2.jpg", 
    "course_url": "https://www.udemy.com/list-building-with-getresponse-unlimited-list-subscribers/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T16:28:42Z"
}