{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Getting found online by potential customers in your area, in the neighborhood your business is in OR on a national and international level CAN be done. It&#039;s not difficult, it doesn&#039;t take hours and hours of blog writing, purchasing expensive software or doing research. You just need to know what to do and where online to do it! <br style=\"\"> </p><p><strong style=\"\">I&#039;ve taught hundreds of small business owners, entrepreneurs and salespeople that have NO experience in SEO get found - and now, if you decide to take this under 60 minute course, I will teach you too. </strong><br style=\"\"></p><p>You CAN get found online, get new customers, increase traffic to your website or social media platform and it will not cost you a dime. </p><p>After you&#039;ve completed this Course on Local SEO or <strong style=\"\">&quot;Search Engine Optimization&quot; for small business</strong>, here&#039;s what you will be able to do.. for yourself!</p><ul style=\"\"><p> ·Understand what FREE service Google offers to get your business found, how it works and what  you need to do to take advantage of it. How to get found on Google!</p><p> ·See the impact that getting listed, PROPERLY listed on Bing can give you access to up to 30% of everyone searching for your business - find new prospects with Local SEO.</p><p> ·See how using YouTube is one of the best ways to get your business online and get your website found</p><p> ·Learn why Review sites like Yelp can have such a huge effect on how often your company shows up in search and how you can make sure that happens. </p><p> ·Finally understand why Facebook makes sense for your business</p></ul><p><strong style=\"\">Here&#039;s what students have to say about this local SEO course for small business:</strong><br style=\"\"></p><p><strong style=\"\">5 STAR Student Review:</strong> <em style=\"\">&quot;</em><em style=\"\">Every business needs this, not just local!</em><br style=\"\">Great what-to-do instruction to start ranking a business in search engines quick and for a long time. I like additional PDF documents that complement lectures and perfectly replacing (not needed) quizzes. For &quot;how-to&quot; videos they would be fine for busy, non tech-savvy entrepreneurs (or serving all with intermediate level course) but for many the information will suffice well.<em style=\"\">&quot;</em></p><p><strong style=\"\"><span style=\"\">5 STAR </span>Student Review: </strong><em style=\"\"> &quot;Thank you Mark for the Course, it is a good point of start and I learned many things I never heard of :) looking forward for any additional lectures :)&quot;</em><br style=\"\"><em style=\"\"></em></p> <br style=\"\"><p> <strong style=\"\">Real Education on how you can take control of your local search and improve your current search rank in ways you never imagined. </strong> </p><p> This course came from 3 years managing SEO for several companies, large and small, and seeing how these simple, FREE methods for getting found have had as much impact as hundreds of hours of content development and link building.</p><strong style=\"\">Content Overview</strong> <p> &quot;Local SEO - How to Get Found Online for FREE&quot; is designed for absolute newcomers to the world of SEO and internet marketing. It&#039;s perfect for business owners, entrepreneurs and salespeople just starting out and trying to get the attention of Google and the potential customers in their area. </p><p> You will go through lectures that include information delivered in slide show format where I&#039;ll tell you where to go, what to do and, most importantly, the Foundations of Local SEO that you&#039;ll need to succeed. </p><p> <strong style=\"\">Once you complete this course and implement the techniques you learn, you will get your business found just like I did</strong>.. for several different brands, different businesses and diverse clients. </p>", 
    "end_date": null, 
    "title": "Local SEO You Can Do to Drive Sales to Your Business", 
    "price": "20.00", 
    "instructors": "Mark Stephenson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470160_67a6_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-found-online-for-free-easy-local-seo-you-can-do/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T19:51:01Z"
}