{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong></strong><strong>Go Beyond the Crowd and Build Your Email Marketing System Like A Ninja! Enroll in this Course to Learn the Tips and Tricks <em>Not Offered in Any Other Course</em>.</strong></p><p><strong></strong></p><p><strong>=====================================================================</strong></p><p><strong></strong></p><p><strong>✔Recently updated on February 24, 2016 -- 4 New LEctures added!</strong></p><p><strong>✔ Over 200 Students Enrolled in the First Two Weeks! Now over 500 students enrolled.</strong></p><p><strong>✔ 34 5-Star Ratings in the First Week!</strong></p><p><strong>✔ 30 Day 100% Risk Free Offer!</strong></p><p><strong>✔ Optimized for Mobile Viewing</strong></p><p><strong><strong>✔ </strong> I have volentarily dropped my price 32 days before the new pricing structure takes effect. I want to give you haveue. <br></strong></p><p><strong>✔ Additional Lectures Coming Soon. See below for the lectures coming soon...</strong></p><p><strong>---------------------------------------------------------------------------------------------</strong></p><p><strong>Why This Course?</strong></p><p><strong>Only this course</strong> goes beyond the Basics and takes you into the powerful world of MailChimp <strong>at a whole new level</strong>! In this course you will learn how to <strong>truly leverage</strong> MailChimp to grow your business.</p><p>This course is for those <strong>wanting more from MailChimp</strong> and who want to grow their skill levels along with their profits.</p><p>You will learn tips and tricks in this course that are <strong>simply not available in other courses</strong>. Tricks that are simple to use but <strong>only revealed here</strong>.</p><p><strong>---------------------------------------------------------------------------------------------</strong></p><p><strong><span></span>Why eMail Marketing?</strong></p><ul><li>Email Marketing is still the #1 Most Profitable way to Market!</li><li>The Direct Marketing Association (DMA) Report estimates that <strong>email marketing's ROI at $40.56 for every $1 invested</strong>.</li><li>A 2012 survey of consumer channel habits and preferences found <strong>77% preferred to receive permission-based promotions via email</strong></li><li>The 2012 Marketing Channel and Engagement Benchmark Survey found <strong>63% of respondents cited email as the channel offering the best ROI</strong></li><li>The 2012 Marketing Channel and Engagement Benchmark Survey found <strong>97% of respondents using email marketing</strong></li><li>There are more than 3.2 billion email accounts today. 95% of online consumers use email and, <strong>91% check their email at least once a day</strong> (Source: Exact Target).</li><li>According to ReturnPath, leader in email intelligence, revealed that in the first half of 2013 that on average, <strong>78% of emails reached their intended destination</strong>. The figure is only 26% with Facebook.</li><li>According to the 2013 Email Marketing Benchmark Report, 60% marketers say email marketing is producing ROI and 32% believe it will eventually. <strong>For every $1 spent, $44.25 is the average return on email marketing investment</strong> (Exact Target).</li><li>According to IDC's study just released last month, <strong>email is the most popular activity on smart phones and mobile devices</strong> with 78% of 18-44 year olds using their devices for email.</li></ul><p><strong>---------------------------------------------------------------------------------------------</strong></p><p><strong>Why MailChimp?</strong></p><p><strong>More than 8 million people</strong> from around the world use MailChimp to send <strong>14 billion emails every month</strong>. MailChimp is built to support lists with millions of subscribers. We're serious about email marketing, and we're ready to help companies of all sizes. Also research shows that MailChimp's UI and platform are the <strong>best in the business</strong>!</p><p><strong>---------------------------------------------------------------------------------------------</strong></p><p><strong>By the end of this course students will know:</strong> </p><ul><li>What MailChimp Forever Free can <em><strong>really</strong></em> do.</li> <li>How to import data into your list from other sources and make sure you don't make the <strong>#1 mistake people make when importing</strong>.</li> <li>How to create list segmentations that enable you to <strong>send super-personalized emails</strong>.</li> <li>Understand what <strong>“Narrowing\" and “Broadening\" segments </strong>are and how to use them.</li><li>How to <strong>“chain\" Campaigns</strong> for greater effectiveness and engagement.</li> <li>How-to<strong> significantly increase your Open and Click rates</strong></li> <li>How to configure your <strong>Campaigns with confidence</strong> – because you'll understand the setup options and how to configure them.</li> <li>How-to send out Campaigns that get Opened, Clicked, and that <strong>drive your Subscribers' Interest and Engagement</strong></li> <li>How-to study MailChimp Campaign Reports so that you can refine your Campaigns, emails, subject lines, and links for <strong>better Opens and Clicks.</strong></li> <li>How-to move your Subscribers to be VIPs and Big Spenders</li></ul><p><strong>---------------------------------------------------------------------------------------------</strong></p><p><strong>CLICK \"TAKE THIS COURSE\" TO GET STARTED NOW!</strong></p><p><strong>✔ 30 Day 100% Risk Free Offer!</strong></p><p><strong>✔ Material No One Else Offers</strong></p><p><strong>✔ Lessons that Can Be Used At Any Level But Will Build Your Skills and Make YOU More Marketable</strong></p><p><strong>✔ Real Results – 75% Opens, 35% Clicks, and 30% Buys</strong></p><p><strong>✔ Strategies and Tactics Designed to Increase Your Subscribers Interest and Engagement</strong></p><p><strong>✔ Segmentation Lessons that Enable You to Send Highly-Personalized eMails that Get Opened and Clicked</strong></p><p>Don't forget to check out the <strong><em>FREE preview lectures</em></strong> to sample my course.</p><p><strong>******************  ADDITIONAL LECTURES COMING SOON!  ************************</strong></p><p><em><strong>Starter Lectures Coming Soon:</strong></em></p><ul><li>Setting Up Your Totally FREE MailChimp Account</li><li>Creating Your List</li></ul><p><strong><em>I</em></strong><strong><em>ntermediate Sections and Lectures Coming Soon:</em></strong></p><ul><li>How to Stay Out of the MailChimp Penalty Box</li><li>Designing Your Emails to Build Interest and Engagement</li></ul>", 
    "end_date": null, 
    "title": "MailChimp for Successful Email Marketing and List Building", 
    "price": "20.00", 
    "instructors": "James Morey", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518220_95cf_11.jpg", 
    "course_url": "https://www.udemy.com/mailchimp-ninja-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T17:19:57Z"
}