{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t Mailchimp es la herramienta web más completa y potente del mercado para el envío de emails y newsletters.</p><p style=\"\">A lo largo del curso podrás utilizar MailChimp de forma gratuita. No será necesario que pagues por él, ya que MailChimp te permite <strong style=\"\">enviar gratis</strong> hasta 12000 correos electrónicos a 2000 suscriptores. Por lo que no tendrás que pagar por esta herramienta online, hasta que no hayas aprendido a utilizarla y aprovecharte del 100% de las ventajas que te ofrece para el envío de boletines informativos, campañas de telemarketing, newsletters, ...<br style=\"\"></p>  <p style=\"\">  \t En este curso de <strong style=\"\">Email Marketing con MailChimp</strong> aprenderás a crear y diseñar correctamente formularios de suscripción y a gestionar campañas. Descubrirás que son los grupos y segmentos. Cómo añadir e importar suscriptores y a crear Autoresponders (emails automáticos de respuesta).  </p>  <p style=\"\">  \tAprenderás desde cero hasta llegar a ser un experto con este completo <strong style=\"\">vídeo curso de MailChimp en español.</strong>  </p>  <p style=\"\">  \t ¿Por qué debes tomar este curso? Ten en cuenta que una <strong style=\"\"> campaña de Email Marketing </strong>correctamente realizada puede ser la mejor forma de  fidelizar a tus clientes y aumentar las ventas. Y si el curso no cumple tus expectativas tienes 30 días para devolverlo y recuperar tu dinero.</p>", 
    "end_date": null, 
    "title": "MailChimp: Email Marketing desde 0 a Experto con MailChimp", 
    "price": "25.00", 
    "instructors": "Roxana Falasco", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/110082_e5c5_8.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-con-mailchimp/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-24T13:59:38Z"
}