{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>*UPDATE : I just added a full-length 80-minute webinar I did in August 2015 on how to use Mailchimp alongside a WordPress plugin called Magic Action Box to build your list - You can preview the entire webinar for free*</strong></p><p>  \t<strong>*Please scroll down to preview 3 lectures of this course ENTIRELY FREE*</strong>  </p>  <p>  \t              I created this course because about 2 years ago I signed up for a Mailchimp account wanting to collect e-mails from blog readers and <strong>I was at a loss as to what to do.  </strong>  </p>  <p>  \t<strong><em>The learning curve was steep and painful.</em></strong>  </p>  <p>  \t              I refuse to let that happen to YOU.  </p>  <p>  \t<strong>Here's what you'll learn at the end of this course :</strong>  </p>  <ol>  \t<li><strong></strong>What plan you should sign up for in Mailchimp (I will show you how to can run an e-mail list for <em>absolutely FREE</em>)</li>  \t<li>Where everything is in Mailchimp so that you won't have to spend days or even weeks trying to figure it all out</li>  \t<li>Create e-mail sign up forms that will get drive-by readers to sign up for your list</li>  \t<li>How to create e-mail templates that will save you time and money (<em>you'll thank me for this later.</em>)</li>  \t<li>How to embed e-mail forms into Facebook and even Twitter so that you can collect e-mails from your followers easily and conveniently.</li>  \t<li>I add a resource list at the end of the course which will take your e-mail writing from blah to brilliant.  I will be updating this as time goes along. </li>  </ol>  <p>  \t<strong>Why should you care about Mailchimp or building an e-mail list ?</strong>  </p>  <p>  \t<em>Because the money is in the LIST.</em>  </p>  <p>  \t              As a blogger or business person, your e-mail list is the greatest asset you have. Don't take it from me. Ask the numerous successful entrepreneurs who have connected, built tribes for their blogs or businesses and gone on to make thousands of dollars from their e-mail lists.  </p>  <p>  \t<strong>Why <em>e-mail </em>when social media is so popular these days ?</strong>  </p>  <p>  \t      What about social media ? Yes, social media has exploded in the last decade . There are many bloggers/entrepreneurs marketing on social media channels that are wildly successful. That's great but the truth is as bloggers/online entrepreneurs, we do not actually own our social media audiences.</p><p>The social media platform does which means if they shut down tomorrow, there goes your audience along with it.</p>  <p>Thus, if social media is your only strategy, you could easily lose out because Facebook and Twitter can change the rules on you in a minute (and they do all the time).  </p>  <p>  \t<strong>  Your e-mail list however , you own that and nobody can ever take that away from you. </strong>  </p>  <p>  \t              We all cherish our in-boxes and we're selective who we let in. So if you learn this e-mail marketing thing right, you will put yourself light years ahead of everyone else and you will succeed.  </p>  <p>  \t      Go ahead and click on the <strong><em>\"Take This Course\"</em></strong> button above and let's get started.  </p>  <p>  \t      I know you will find everything here useful. Don't hesitate to leave me <strong>comments or questions </strong>if you have any.  </p>  <p>  \t<strong>If you find this course useful , please leave me a great review so that other people </strong>can find this course and become a Mailchimp Master like you.  </p>  <p>  \t              Thank you for taking this course !</p>", 
    "end_date": null, 
    "title": "Mailchimp : A Guide To E-mail List Building For Beginners", 
    "price": "20.00", 
    "instructors": "Gertrude Nonterah", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284122_aab4_3.jpg", 
    "course_url": "https://www.udemy.com/mailchimp-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-20T00:51:40Z"
}