{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>***Join 2700+ Students Who Are Already Increasing Their Sales Using My Strategies! Enroll Now***</strong></p>\n\n<p><strong><em>WARNING: THIS COURSE IS FOR PEOPLE WHO WANT TO WORK! DON'T ENROLL IN THIS COURSE WITHOUT READING WHAT COMES NEXT. </em></strong></p>\n\n\n\n\n\n\n\n<p><em>Did you ever try to sell online without really knowing how to do it, and as a result, made no money at all or just a ridiculous amount of it?</em></p>\n\n\n\n\n\n\n\n<p><em>Are you currently trying to bring your big idea to the market but are afraid of failing because you don't consider yourself a good salesman?</em></p>\n\n\n\n\n\n\n\n<p><em>Is your company going under because of a lack of sales? Or, less dramatical, do you just want to get more customers?</em></p>\n\n\n\n\n\n\n\n<p><em>Maybe you got no company, but still : do you want to create extra income streams by selling products, physical or digital, online, on Amazon, eBay or even Udemy?</em></p>\n\n\n\n\n\n\n\n<p>If you've answered « YES !» to one of these questions, then this course will wipe you of your feet.</p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p>This course is is a <strong>premium 6 hour video step-by-step guide you can follow to boost ANY business </strong>and destroy every competition along the way.</p>\n\n\n\n\n\n\n\n<p> 56 invaluable marketing lessons that I had to learn the hard way. </p>\n\n\n\n\n\n\n\n<p>I can't stress it enough: THESE APPLY TO ANY KIND OF BUSINESS. </p>\n\n\n\n\n\n\n\n<p>I don't care if you<em> sell flowers online or leather saddles on a renaissance faire</em>: the strategies and secret techniques in this course WILL WORK WONDERS and get you mind-blowing results. </p>\n\n\n\n\n\n\n\n<p>(If they don't, I WANT you to get a full refund, just shoot a one-sentence email to Udemy in the 30 days after the purchase. However, I highly doubt that you will ;) ) </p>\n\n\n\n\n\n\n\n<p>Don't, worry<strong> this IS NOT some boring, rehashed common knowledge about sales and marketing:</strong> </p>\n\n\n\n\n\n\n\n<p>It took me 4 YEARS of hardcore learning to get me where I am today. </p>\n\n\n\n\n\n\n\n<p>However, learning it « the right way » will save you an enormous amount of time, and that's why I created this course.</p>\n\n\n\n\n\n\n\n<p>(Don't take my word for it: <strong>just read all the raving 5 star-reviews below</strong> :) )</p>\n\n\n\n\n\n\n\n<p><strong>Here is a tiny FRACTION of the information that you'll get:</strong> </p>\n\n\n\n\n\n\n\n<ul><li>How to write emails that will make you $$$ in 1 hour of work<em> (I'll dissect<strong> one email that made 3000$ </strong>and show you exactly WHY it did)</em></li><li>How to make visitors GLAD to buy from you and transform them in loyal fans <em>(It takes<strong> 5 simple steps </strong>and can be achieved in less than 7 days)</em></li><li>6 Strategies to pump new clients into your business on Autopilot while you lay on the beach (o wherever you want)!</li><li>The Ultimate Lead-Generation Technique 99,5% of all Ecommerce owners are ignoring and that multiplied revenue of a flower business y 22*  (hint: it's all about giving the right kind of value away)</li></ul>\n\n\n\n\n\n\n\n<p> … And much, muuuuuch more.</p>\n\n\n\n\n\n\n\n<p><strong>                    Here are some things I've done for clients recently:</strong></p>\n\n\n\n\n\n\n\n<ul><li>I helped Dashrapp increase their lead-generation<strong> by 74% with ONE simple 5 minute hack</strong>, which resulted in <strong>1000+ clients every single month.</strong> (hint: I just used ONE simple mind-trigger to achieve this.)</li><li>I Skyrocketed the lead-generation Of a Parisian 6-figure shoe business by <strong>over 1600%</strong> (No typo). </li></ul>\n\n\n\n\n\n\n\n<p>Want to achieve the same result and transform your business in a way you never thought possible?</p>\n\n\n\n\n\n\n\n<p><strong>Enroll in this course NOW, watch the lessons, apply them</strong>. That's it. You don't need ANYTHING ELSE to build a 6-figure business right away.  </p>\n\n\n\n\n\n\n\n<p>What are you waiting for? Worst case, you don't like the course and ask for a refund.</p>\n\n\n\n\n\n\n\n<p> Best case: you fall in love with  it and use it to build a business empire.  Plus, I'll be there to answer all your questions along the way</p>\n\n\n\n\n\n\n\n<p><strong>                Short: You have absolutely NOTHING to lose, but everything to gain. </strong></p>\n\n\n\n\n\n\n\n<p><strong>You're leaving an incredible amount of money on the table by ignoring this course.</strong></p>\n\n\n\n\n\n\n\n<p>Click on the button on the upper right hand corner of the screen and be prepared to get whipped of your feet, I'm waiting for you inside :)</p>\n\n\n\n\n\n\n\n<p><strong>P.S </strong>: Here is what <strong>Daniel DiPiazza, CEO at Rich20something and columnist at Business insider</strong>, said about this course:<strong><em> \"The knowledge Robin delivers in this course can easily make you 6 figures if you commit to learning and applying it »</em></strong></p>\n\n\n\n\n\n\n\n<p>Stop fooling around and join in, you'll not regret it a single second (I know, I'm pushy, but it's for your own good, believe me. I want to help you and I can't do anything for you if you don't enroll). </p>", 
    "end_date": null, 
    "title": "Marketing: How To Double Your Sales In A Matter Of Hours", 
    "price": "25.00", 
    "instructors": "Robin Hanna", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445650_14f9_3.jpg", 
    "course_url": "https://www.udemy.com/marketing-how-i-skyrocket-sales-by-633-in-12-hours-of-work/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T10:07:33Z"
}