{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>CURSO DE MARKETING DIGITAL PARA CORRETOR DE IMÓVEIS - VÍDEO AULA</strong><br></p><p>Não há dúvidas de que a Internet revolucionou vários segmentos de mercado. Novas profissões surgiram e outras foram extintas.</p><p>O mercado imobiliário é um desses segmentos que vem sendo altamente influenciado pelo mundo online.</p><p>Todos os dias milhões de consumidores utilizam a Internet para procurar por imóveis para comprar, vender ou alugar. Sejam imóveis residenciais, de temporada ou comerciais.</p><p>Marketing Digital Imobiliário é uma nova forma de atrair prospects e clientes, nesse curso iremos abordar estratégias que podem ser utilizadas por qualquer pessoa e principalmente com investimentos baixos.</p><p>O curso irá trazer teoria e prática para que o corretor ou profissional da imobiliária esteja pronto para criar uma campanha de marketing digital.</p><p><br></p><p><strong>Objetivo:</strong></p><ul><li>O aluno do curso aprenderá:</li><li>A criar campanhas no Google Adwords;</li><li>Criar estratégias para as redes sociais como o Facebook;</li><li>A enviar e-mails marketing e medir o resultado;</li><li>E principalmente como negociar a compra de mídia online.</li></ul><p><strong><br></strong></p><p><strong>Duração:</strong></p>O Curso de Marketing Digital para Corretor de Imóveis tem duração de duas horas.<p><br></p><p><strong>Público Alvo:</strong></p><p>O Curso de Marketing Digital para Corretores de Imóveis é destinado para Corretores de Imóveis, Profissionais das Imobiliárias, Profissionais de marketing imobiliário, estudantes, empresários.</p><p><br></p><p><strong>Professor:</strong></p><p>Eduardo Sani é fundador e CEO da Uselink, especialista em marketing digital de performance, com pós-graduação em Gestão de Marketing na FAAP.</p><p><br></p><p><strong>Conteúdo Programático:</strong></p><ul><li>Introdução</li><li>O que é Marketing Digital</li><li>Planejamento de Marketing Digital para o Corretor de Imóveis</li><li>Próximos passos do Planejamento</li><li>Mídia Online</li><li>Estratégias Mobile Marketing Imobiliário</li><li>Trabalhando com Email Marketing</li><li>Mensurando Resultados</li></ul><p><strong><br></strong></p><p><strong>Por que escolher a ComSchool?</strong></p><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas.</li><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Marketing Digital para Corretor de Imóveis", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694192_a982_3.jpg", 
    "course_url": "https://www.udemy.com/marketing-digital-para-corretor-de-imoveis-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T18:36:52Z"
}