{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tIf you&#039;re looking at this course, you probably have published or are thinking about publishing an app or game to the iOS or Google Play App Store. But with 1.5 million apps in each app marketplace and 10&#039;s of thousands of apps being added every month, how do you get your app noticed?  How do you get more downloads for your app?  </p>  <p>  \t                                      The iOS App Store &amp; Google Play Store are the biggest sources of free traffic you can get for your app.  It makes sense to invest your time and effort into getting this traffic.  You just need to know how to optimize your app listing to drive traffic and ultimately get more downloads for your app.  </p>  <p>  \t                                                    That’s where this course on App Store Optimization (ASO for short) can help.  </p>  <p>  \t                                              No fluff, no filler, no long boring lessons to take up your valuable time.  Just easy to understand &amp; immediately actionable instructions on how you can increase your app&#039;s visibility and get more downloads.  </p>  <p>  \t                                 This course goes over specific optimization strategies for both Apple&#039;s App Store (iOS 8) &amp; the Google Play Store (Android).  </p>  <p>  \t                                                    So go ahead, take this course now and get more downloads today!  </p>", 
    "end_date": null, 
    "title": "Marketing Your App or Game with App Store Optimization (ASO)", 
    "price": "20.00", 
    "instructors": "Bennett Hui", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251168_ba45_4.jpg", 
    "course_url": "https://www.udemy.com/appstoremarketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T21:54:43Z"
}