{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>CURSO DE MARKETING DE CONTEÚDO - VÍDEO AULA</strong></p><p>Entenda como o Marketing de Conteúdo está ajudando muitas empresas a alcançar novos clientes, aumentar suas vendas e melhorar o relacionamento com seu público. Neste curso, você aprenderá a criar e implementar uma estratégia de conteúdo que traga resultados para seu negócio. Além de 4 módulos de vídeo-aula com exemplos e exercícios práticos, você terá acesso a um Kit de Materiais para ajudá-lo a implementar a estratégia de conteúdo desenvolvida durante o curso.</p><p><br></p><p><strong>Objetivo:</strong></p><ul><li>Demonstrar o que é marketing de conteúdo e por que esta modalidade está em destaque entre os profissionais de marketing atualmente</li><li>Permitir aos alunos criar uma estratégia de conteúdo para seus projetos</li><li>Dar as ferramentas para que os alunos implementem a estratégia de conteúdo e alcancem resultados mensuráveis em suas organizações<br> </li></ul><p><strong><br></strong></p><p><strong>Duração:</strong></p><p>O Curso Online de Marketing de Conteúdo tem carga horária total de 120 minutos.</p><p><br></p><p><strong>Público Alvo:</strong></p><p>Este curso destina-se a profissionais de marketing, estudantes de marketing, executivos de outras áreas e outros profissionais interessados em entender em detalhes o Marketing de Conteúdo</p><p><br></p><p><strong>Conteúdo Programático:</strong><br></p><ul><li>Por que você precisa conhecer o marketing de conteúdo</li><li>Preparando sua estratégia de conteúdo</li><li>Criando sua estratégia de conteúdo</li><li>Mantendo a consistência</li></ul><ul><br></ul><ul><p><strong>Por que escolher a ComSchool?</strong></p></ul><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas.</li>", 
    "end_date": null, 
    "title": "Marketing de Conteúdo", 
    "price": "25.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725766_29a4_2.jpg", 
    "course_url": "https://www.udemy.com/marketing-de-conteudo-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T16:16:30Z"
}