{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tBienvenido al Curso de Marketing Online para Empresas y Emprendedores.  </p>  <p>  \tEste curso tiene como objetivo ayudarle a usted a que logre incrementar las ventas de sus productos y/o servicios, al igual que mejorar la imagen de su empresa usando los métodos más actuales del Marketing Online.  </p>  <p>  \tEn este curso trataremos los tres principales medios de Marketing Online:  </p>  <ul style=\"\">  \t<li>El Video Marketing</li>  \t<li>El Email Marketing</li>  \t<li>Las Redes Sociales</li>  </ul>  <p>  \tEl Video Marketing está ganando auge frente a otros medios de promoción gracias a su alto consumo en los dispositivos móbiles tales como los teléfonos móviles y las tablets. Está considerada como la técnica que más engagement logra con los clientes potenciales y tiene un futuro increible dentro del Marketing Online.  </p>  <p>  \tEn este curso trataremos aspectos como los beneficios del Video Marketing, las estrategias a seguir para lograr un mayor impacto entre nuestros usuarios, como usar los canales de distribución de video de una manera más eficiente y eficaz, hablaremos sobre el futuro de video marketing, al igual que veremos el uso de las herramientas Movie Maker y Camtasia Studio, que son herramientas para la generación y edición de Video, veremos como destacar entre nuestros competidores para lograr ser únicos... entre otros temas.  </p>  <p>  \tEl Email Marketing vuelve a estar en auge ya que muchas empresas se han dado cuenta de que el Email Marketing tiene un Retorno de la Inversión (ROI) mucho mayor y más rápido que la publicidad tradicional, además de tener la ventaja de poder medir y analizar los resultados de nuestras campañas.  </p>  <p>  \tEn este curso veremos aspectos del Email Marketing tales como la reputación online, la entregabilidad de nuestros mensajes, los errores más comunes a la hora de realizar campañas de Email Marketing, como optimizar nuestras campañas de email marketing para lograr un mayor alcance de clientes potenciales, como crear campañas de Email Marketing...entre otros temas.  </p>  <p>  \tLas Redes Sociales son una herramienta que no puede pasar desapercibidas en las áreas del marketing de hoy en día. Si bien, todavía no es una herramienta muy rentable en el área del marketing, si es una herramienta muy poderosa en lo que se refiere al Branding o la Imagen de Marca de la Empresa ya que gracias a las redes sociales podemos tener una interactuación directa con nuestros clientes, así como conocer sus necesidades, lo cual es la herramienta perfecta para poder adaptar nuestros productos y/o servicios a las necesidades de nuestros clientes.  </p>  <p>  \tEn este curso veremos una introducción a las redes sociales y el impacto en la sociedad actual, como usar las redes sociales como herramienta de marketing, veremos el funcionamiento de Twitter y el Diseño de una Página de Empresa en Facebook.  </p>  <p>  \tEspero que este curso le ayude para mejorar la Imagen de su empresa o marca, y que al mismo tiempo le ayude a incrementar el número de clientes potenciales y a consolidad los clientes que ya tenga en cartera.  </p>  <p>  \tCualquier duda que tenga se la resolveré con la mayor brevedad posible.  </p>", 
    "end_date": null, 
    "title": "Marketing Online para Empresas y Emprendedores", 
    "price": "20.00", 
    "instructors": "Ángel Arias", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408544_a838_3.jpg", 
    "course_url": "https://www.udemy.com/marketing-online-para-empresas-y-emprendedores/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-30T23:52:05Z"
}