{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>MARKETING FOR NON-MARKETERS - A single simple strategy you can use to generate sales all year and END MARKETING DREAD</em></strong></p><p><strong>BRAND NEW:  Over 1,800 students have enrolled since the recent launch</strong></p><p><strong>The most simplistic, straightforward approach to marketing for non-marketing entrepreneurs possible.</strong></p><p>Do you struggle to get momentum in your business?  Are you overwhelmed by marketing and find yourself stopping and starting with different marketing strategies all year long? </p><p>Get clarity and a decisive action plan in place that involves minimal marketing with this course.</p><p><strong>Are you ready to finally put an end to being frustrated by the lack of sales and wasted time, money and energy on failed marketing plans?</strong></p><p>Join the community of non-marketers with UNLIMITED &amp; LIFETIME access to course content and updates. </p><p><em>\"Not only does Julie (the instructor) know her stuff inside out, she knows how to communicate her ideas clearly so that I can take action immediately.\" Michael<br></em></p><p><em>\"I loved the pacing AND the short videos so I could easily DO what was discussed in the video. I have the end of this year and the entire calendar for next year framed out.\" Fonda</em></p><p><strong>FULL 30 DAY MONEY BACK GUARANTEE</strong></p><p>Have you spent too much money learning and playing with Twitter, Facebook ads and email campaigns that got you nowhere?<br></p><p>Do you dread the \"selling\" part of your business?  If marketing is the piece that is keeping you from being successful, then this is the course for you.</p><p>I will take you by the hand and teach you a very simple strategy you can use that requires very little marketing know-how and that is ethical and spam-free. </p><p><strong>In this course you will get:</strong></p><ul><li>a step by step system to create a 12-month marketing plan</li><li>a strategy that is spam free</li><li>an authentic method to market your business that you will comfortable using</li><li>a 25-page workbook</li><li>checklists and timelines to keep you on track</li><li>action exercises to take what you learn and put it immediately into action</li><li>access to me to ask questions whenever you get stuck</li></ul><p><br></p><p>This course will take you from a struggling person who dreads marketing to a successful entrepreneur who has fun, creative and unique marketing that results in lots of sales and raving fans.</p><p><strong>DON'T FORGET: Udemy operates a 30 day full money back guarantee, no questions asked! If you're not happy with this course you can request your money back.</strong></p><p>Click the \"take this course\" button straight away at the top right of this page to unlock the power of minimalist marketing for your business</p>", 
    "end_date": null, 
    "title": "Minimalist Marketing - Everything You Need to Know", 
    "price": "20.00", 
    "instructors": "Julie Ann Price", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581406_627e_7.jpg", 
    "course_url": "https://www.udemy.com/marketing-for-non-marketers/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T18:01:39Z"
}