{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>CURSO DE MÉTRICAS ROI - VÍDEO AULA</strong></p>O curso oferece uma visão teórica a respeito de ROI e CPA e metodologia de integração com as principais métricas de canais tais como: Links Patrocinados, Display Media e Mídias Sociais, com exemplos aplicados de mercado. Apresenta ainda metodologia básica para a definição dos KPIs do projeto digital e como identificar os indicadores na ferramenta de Web Analytics. O curso é em vídeo aulas, 100% a distância. Você recebe login e senha para acessar as aulas, logo após a aprovação de seu pagamento e pode estudar de onde quiser, a hora que quiser.<p><strong><br></strong></p><p><strong>Objetivo:</strong></p><ul><li>Aprender os conceitos fundamentais de ROI e CPA.</li><li>Compreender o processo básico de planejamento e seleção de KPIs para um projeto digital.</li><li>Praticar o cálculo de CPA e ROI aplicados ao e-commerce, Links patrocinados, Display Media e Mídias Sociais com exemplo reais de mercado.</li><li>Aprender a identificar os indicadores em uma ferramenta de Web Analytics.</li></ul><ul><br></ul><p><strong>Duração:</strong></p><p>O Curso Online de Métricas ROI tem carga horária total de 90 minutos.</p><p><strong><br></strong></p><p><strong>Público Alvo:</strong><br></p><p>O curso de Métricas ROI destina-se a profissionais do marketing digital, negócios, estudantes, empresários, empreendedores e demais profissionais que desejam conhecer ferramentas e metodologias para a mensuração de performance de projetos digitais.</p><p><br></p><p><strong>Conteúdo Programático:</strong><br></p><ul><li>Conceitos e definições de ROI e CPA</li><li>Exemplos de aplicação de ROI e CPA</li><li>Planejamento básico de indicadores: O que medir?</li><li>Métricas de canais: Links Patrocinados, Display Media e Mídias Sociais</li><li>Exemplos de aplicação de ROI e CPA para canais</li><li>Gestão integrada de indicadores de canais e negócio</li><li>Análise de resultados: Como medir? </li></ul><ul><p><strong><br></strong></p><p><strong>Por que escolher a ComSchool?</strong></p></ul><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas</li><span></span><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Métricas ROI", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725902_218e_4.jpg", 
    "course_url": "https://www.udemy.com/metricas-roi-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T18:12:46Z"
}