{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t <span style=\" text-decoration:underline; color:#ff0000;\"><strong style=\"\">You may earn a Statement of Accomplishment in this course</strong></span>  </p>  <p>  \t      If you run an online business, it is only a must for you to think of <strong style=\"\">targeting traffic</strong>. After all, you need to rank in the search engines for your business to become more visible to the public.  </p>  <p>  \t   With this course, you can finally, start selling a product that everyone needs &amp; wants. This <strong style=\"\">step by step</strong> guide allows anyone to get started easily. It&#039;s never been so easy! Setup your strategy today and develop your online business!  </p>  <p>  \t   However, the rankings change every minute of the day and that depends on the traffic driven to your website. Let me take you by the hand and show you step by step how to get viral, targeted traffic for your business. combine time -tested methods so that you can literally drive <strong style=\"\">VOLUMES</strong> of high quality, converting traffic to your offers. I&#039;ll show you how simple it can be to drive buying traffic. I&#039;ll provide you a simple to fellow, step by step rinse and repeat system to make you succeed!  </p>  <p>  \t <strong style=\"\">I&#039;ll show you in this course the list of the building blocks <span style=\" text-decoration:underline; color:#ff0000;\">needed to get started</span> and how to set up and configure them for long term conversion.</strong>  </p>  <p>  \t      You&#039;ll get also the daily action plan that shows you <span style=\" text-decoration:underline; color:#ff0000;\"><strong style=\"\">THE EXACT PROCESS TO FOLLOW</strong></span> in little bite-size pieces so you can put this to work and see results FAST.  </p>  <p>  \t To earn a Statement of Accomplishment in this track, you have to complete 90% of the lectures. Once done you send a message to the instructor.  </p>", 
    "end_date": null, 
    "title": "Online Marketing", 
    "price": "25.00", 
    "instructors": "Zied Jbali", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/209522_67c6_5.jpg", 
    "course_url": "https://www.udemy.com/develop-your-online-marketing-mind-hack/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-02T18:55:20Z"
}