{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Online Marketing</strong></p><p>Create a digital marketing funnel online and grow your business and sales automatically!</p><p><strong>Do You Want To Know How To Create An Online Marketing Strategy That Actually Works?</strong></p>  <p>But don't know where to start?</p>  <p>If you understand the psychological flow of the buyers journey through your digital marketing...</p>  <p>...And if you understand how to map your marketing content and activity to that psychological flow…</p>  <p>...Then getting the right clients into your business is as simple as ABC or AIDA in this instance.</p>  <p><strong>The AIDA Marketing Funnel</strong></p>  <p>This training course will take you through the AIDA Marketing Funnel creation process and show you how to create an online marketing flow that funnels the right customers in to your business and the wrong customers out.</p>  <p>The course focuses on the online application of the AIDA marketing funnel and shows you how to create content for potential clients at specific stages in their buyer journey.</p>  <p><strong>This All Sounds A Bit Complicated?</strong></p>  <p>Not at all.</p>  <p>Once you have grasped the basic concept of this system, you will find it very easy to apply in your business.</p>  <p>And we explain it in a simple and easy to understand manner!</p>  <p><strong>A Recent Customer:</strong></p>  <p>We sat down with a customer recently who had been attempting online marketing for a number of years with very little success.</p>  <p>In a few short minutes, we explained to him which part of the AIDA marketing funnel was missing from his system.</p>  <p>One epiphany later…</p>  <p>....And our client realised what had been wrong with his marketing all along.</p>  <p><strong>Based On Real World Client Experience</strong></p>  <p>This is not a theoretical principle, this is a system that has worked for over a hundred years, all we have done is updated it and applied it to a digital marketing strategy.</p>  <p>We have sat down with clients and gone through the very process we will teach you here and they are always blown away by the simplicity of it and can quickly identify what they have done wrong in the past.</p>  <p><strong>Who Is This Course For?</strong></p>  <p>If you are a business owner, or a marketing professional, then this course is designed for you.</p>  <p>As a business owner, you will be able to direct your online marketing strategy with confidence.</p>  <p>As a marketing professional, you will be able to deliver a marketing system to your clients or your employer that works in a digital age.</p>  <p><strong>What Is Covered In The Course:</strong></p>  <p>We will take you through the AIDA process.</p><p>We will show you what type of content needs to be placed on social media sites, your website and behind a newsletter sign up.</p><p>We will take you through some sample flows that we have created for real world clients.</p><p>We will show you how you can also create a similar marketing flow for your business.</p>  <p><strong>Join Me On The Other Side:</strong></p>  <p>You have a full 30 day money back guarantee if you do not like this course and want a refund.</p>  <p>So join me on the other side and learn how to create a simple yet powerful marketing strategy, find new clients and grow your business presence online!</p><p></p><p></p>", 
    "end_date": null, 
    "title": "Online Marketing - Create Digital Marketing & Sales Funnels", 
    "price": "25.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477950_332b_5.jpg", 
    "course_url": "https://www.udemy.com/build-an-online-marketing-strategy-that-brings-you-clients/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T12:18:04Z"
}