{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">This course will teach you how to make your website easier to use for the people who want to give you money - without you needing a lot of technical skills to make changes or spending lots of money on web designers and programmers.  </strong>  </p>  <p style=\"\">  \t<em style=\"\">I created this course for business owners who want practical, straightforward business advice they can put into action right away. </em>Most classes on the market about website optimization (also known as “conversion rate optimization”) are full of complex, generic theories – I’m tossing all that out the window and sharing real advice to use right away.  </p>  <p style=\"\">  \t     Some topics we'll cover:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Why the way you’ve been talking to your Ideal Customers is killing your sales. </strong>You need to learn to speak in a voice they will understand and respect as an authority in your niche. I’ll show you how.</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">What web-user profiling can tell you about how to design and write for your site.</strong> These methods are so effective, your customers will wonder how you read their minds! How much easier would it be to make a sale if you knew precisely what your potential customers were thinking?</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">How to compete for attention when you’ve only three seconds to grab your visitors’ attention</strong>.  You'll find this to be a hair-raising, eye-opening experience.</li>  \t<li style=\"\"><strong style=\"\">The secret to getting your customers to tell all their friends about your product or service. </strong> Nothing works better than word-of-mouth and this book will show you how to get it easily and consistently.</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Simple changes you can make right now to improve your online conversion rate</strong>. You’re a busy professional and have more important ways to spend your time than learning the technical ins-and-outs of web design. So start with these “quick wins.”</li>  </ul>  <p style=\"\">  \t      Each section includes its very own “Action Plan” – short lists of prompts and critical action steps can be put to use immediately to start improving your sales.  </p>  <p style=\"\">  \t<strong style=\"\">This course comes with a 30-day, <em style=\"\">no questions asked</em>, money back guarantee.   </strong>Get started with improving your website and making more money <em style=\"\">today</em>.  </p>", 
    "end_date": null, 
    "title": "Optimize Your Website Without Strong Technical Skills", 
    "price": "20.00", 
    "instructors": "Andy Hayes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385958_afc0_3.jpg", 
    "course_url": "https://www.udemy.com/improve-your-website/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T19:39:06Z"
}