{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Easily Build Your Own Squeeze Page System Step by Step System Has You Collecting New Leads in 48 Hours</strong></p><p><strong>Last Updated: NEW VERSION FOR 2016 - MARCH UPDATE</strong></p><p><em>Building an Email List is Essential...</em></p><p><em>The Problem is that there are some many moving parts. A Squeeze Page, Thank You Page, Delivery Page, The Welcome Email.</em></p><p><em>Then you have to decide with page builder to use. How to setup your email system. Easy if you are technologically minded but a struggle if that isn't your key skill.</em></p><p>TAKE THE COURSE TODAY</p><p>Instead of struggling ... Follow along, step by step instructions covering everything you need from creating the content and graphics you need, how to create each page and put it all together with email automation.</p><p>&gt;&gt; If you can watch a video, pause and copy what happened then you can do </p><p><strong>Create It Right First Time...</strong></p><p>The Step By Step Squeeze Page Course takes you step by step through creating your squeeze page system the right way. Watch over the shoulder as a real life squeeze page system is created. Follow along step by step.</p><p><em>During the course you will learn:-</em></p><ul> <li><strong></strong><strong>Step by step instructions</strong> - all you need to get to a Fully functioning Squeeze Page System</li> <li><strong></strong><strong>Start Collecting Leads in 48 Hours</strong> with Pause and Follow Instructions</li> <li><strong></strong><strong>Not sure what to give away</strong> - Discover the 8 different giveaways to find the right one for you.</li> <li><strong></strong><strong>Why most people never complete their first giveaway.</strong> And how to avoid the same mistake.</li> <li>Use the feature/benefit/outcome matrix and content templates to <strong>quickly create the text you need for your pages.</strong></li> <li><strong></strong><strong>Creating your pages with OptimizePress or Thrive Content Builder.</strong> We show you how to use either.</li> <li><strong></strong><strong>Understand Email Systems and link yours to your pages.</strong> Learn how to use automation with ActiveCampaign.</li> <li><strong></strong><strong>Everything you need to get your list building off to a fast start</strong></li> </ul><p>You can continue to wonder how to do create it yourself, work out the best way and fight the technology. </p><p>Alternatively you can stop wasting time and get it done. Take the course today.</p>", 
    "end_date": null, 
    "title": "Optin/Squeeze Page Creation : New Leads in 48 Hours - 2016", 
    "price": "25.00", 
    "instructors": "Rob Wilson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728410_6e3a_2.jpg", 
    "course_url": "https://www.udemy.com/v2-optinsqueeze-page-creation-new-leads-in-48-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T20:37:35Z"
}