{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>\r\n\t   I can show you how to make money.\r\n</p>\r\n<p>\r\n\t <strong>Watch over my shoulder and ask questions while you see and hear exactly how to build several money generating businesses using my knowledge and your computer.</strong>\r\n</p>\r\n<p>\r\n\t         Whether you&#039;re an entrepreneur or aspire to be one, you can learn how to turn knowledge into money by applying some very simple and powerful techniques that only the successful online marketers know about.\r\n</p>\r\n<p>\r\n\t         There is an entire universe of potential visitors and customers right there for the taking if you take the initiative to learn methods and proven business models that can scale as far as your imagination can take you.\r\n</p>\r\n<p>\r\n\t <strong>You Will Learn How To:</strong>\r\n</p>\r\n<ul>\r\n\t<li>Build a website from scratch that can be used for almost any business imaginable to capture valuable leads worth real money</li>\r\n\t<li>Build a passive revenue generating Ad Sense model site you can put on auto-pilot to collect income month after month</li>\r\n\t<li>Build and construct all your websites with the proper silo architecture that will get you traffic and visitors faster and more plentiful than ever before</li>\r\n\t<li>Experience passive income with affiliate sites that will make sales on auto-pilot because you have the secret to getting traffic and visitors</li>\r\n\t<li>Gain a complete understanding of Search Engine Optimization (SEO) and remove all the mystery out of what Google and other search engines are looking for</li>\r\n\t<li>Set up your websites, pages and posts correctly to maximize your exposure to the search engines, also known as On Page SEO</li>\r\n\t<li>Perform high impact Off Page SEO.  You will learn the absolute best, fastest and most effective way to highly rank almost any website you want, turning those rankings into profits</li>\r\n\t<li>Build a 100% Private Blog Network.  This will become the catalyst for your future earning potential.  You can leverage a functional private blog network into infinite amounts of money, limited only by your imagination</li>\r\n\t<li>Hide your valuable website properties from your competition and keep them guessing how you do what you do</li>\r\n\t<li>Get small businesses to each pay you hundreds of dollars per month to rent space on your private network</li>\r\n\t<li>Get a head start when launching a brand new website.  This method will allow you to capture traffic and visitors faster than ever before</li>\r\n\t<li>Buy a web property for $100 and turn it into a $1,200 annual income stream, over and over and over again...</li>\r\n\t<li>and so much more....</li>\r\n</ul>\r\n<p>\r\n\t <strong>What is the end result?</strong>\r\n</p>\r\n<p>\r\n\t I want you to experience success.  I want to help you.  If you have the drive to succeed, then this course is your foundation of success.  These lessons are the seeds to financial freedom.  My success with this course is measured by how many students can implement these techniques and persevere beyond their wildest dreams.\r\n</p>", 
    "end_date": null, 
    "title": "Over The Shoulder - Internet Marketing Mastery", 
    "price": "45.00", 
    "instructors": "David Frost", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138998_2bb7_8.jpg", 
    "course_url": "https://www.udemy.com/home-based-business-online-internet-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-28T22:50:32Z"
}