{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Learn how to create, run and optimize a Google Adwords account with zero previous knowledge. By real world example, we will show you how you and your business will benefit from Pay-Per-Click Advertising.</p><p><strong style=\"\">Learn and Master the Essentials to Internet Marketing to create profitable Adwords Campaigns for your Small Business.</strong></p><p><strong style=\"\"> </strong>Find Profitable Keywords</p><p> Write Better Ads</p><p> Analyze Campaign Performance</p><p> Optimize with Advanced Techniques</p><p><strong style=\"\">Tap Into the Reach of Google Adwords</strong></p><p>Learning the fundamentals of Google Adwords and Search Engine Marketing will enable your small business to reach millions of potential customers the exact moment they are searching for your business. We will show you how to create ads for specific search terms that only appear on a potential customer&#039;s screen when he or she is searching for a product or service your small business offers. No other advertising platform allows for such a personal connection between your small business and potential customers.</p><p>Not only will PPC allow your small business to reach more customers with directed advertising, it is fully trackable. We will show you the tools and knowledge to be able to track every important statistic in your campaign and teach you how to optimize your campaigns to get the most bang for your buck with Google Adwords.</p><p><strong style=\"\">Content and Overview</strong></p><p>In this course we will walk with you, holding your hand in the beginning, showing you the exact steps for setting up your account and giving you a walkthrough of the Google Adwords platform. </p><p>After introducing you to the Adwords platform, we will take you through the beginning ways to optimize your account by showing you the real life example of a stone masonry company we are creating and running a PPC account for. </p><p>Following Google Adwords Experts through what we do for this account on a daily basis you will learn how to run mobile ads, when to start new types of campaigns, how to write better ads, and keys to improving quality scores.</p><p>Finally, we will get into advanced tactics as your small business campaign grows. We will discuss advanced location targeting, tactics for conversion tracking, and other advanced optimization tactics.</p><p>By the end of the course, you will be running full speed, being able to analyze, optimize, and ultimately create profitable campaigns on your own accord. <strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Pay Per Click Marketing for Small Businesses", 
    "price": "20.00", 
    "instructors": "Taylor Campbell, Josh Kaestner", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529832_3fa9_3.jpg", 
    "course_url": "https://www.udemy.com/pay-per-click-marketing-for-small-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T21:31:15Z"
}