{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>A busca por alto rendimento de vendas e performance para Apps e Games é crescente, e para se destacar neste mercado você deve se diferenciar dos concorrentes, o que torna fundamental e de extrema importância a utilização de um plano de mídia para levá-los ao conhecimento do público, de forma massiva e ao mesmo tempo extremamente segmentada.</p>\n\n<p>Mídias de performance se caracterizam pelo acordo prévio com o provedor de serviços (veículo de mídia ou agência de publicidade) sobre os resultados a serem atingidos, sob parâmetros de número de cliques, leads, downloads ou vendas geradas por um anúncio. A utilização desse serviço para apps e games se apresenta muito eficiente por possibilitar um planejamento com uma boa idéia dos resultados a serem alcançados.<br></p>\n\n<p>Neste curso você vai aprender como definir objetivos para suas campanhas de mídia, para qual target direcionar as campanhas, quanto utilizar de verba para cada campanha, como escolher os canais, como solicitar propostas, como planejar uma campanha do início ao fim, como subir as campanhas e como mensurar os resultados.<br></p><p>** Este curso será atualizado constantemente pelo professor através de adição de novas aulas, atualização informações, aulas comentadas por outros especialistas da EBG, inserção de estudos de casos e exercícios práticos. <br></p>", 
    "end_date": null, 
    "title": "Planejamento de Mídia de Performance", 
    "price": "45.00", 
    "instructors": "Escola Brasileira de Games EBG Online, Eduardo S T Andrade", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/840750_d9b2_6.jpg", 
    "course_url": "https://www.udemy.com/planejamento-de-midia-de-performance/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-05T20:33:12Z"
}