{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Learn the basic concepts and most used functions for creating great sounding audio podcasts with the free software tool Audacity.</p><p><strong>Build a strong foundation in how to record and edit audio in this tutorial for beginners</strong></p><ul><li>Install the free Audacity software </li><li>Evaluate currently available and best microphone options</li><li>Create podcasts quickly using the most frequently used editing techniques</li><li>Improve audio quality with effects that matter most</li><li>Create podcasts by mixing narration, music, and sound effects</li><li>Publish and share audio podcasts</li><li>Apply theater of the mind approaches to create original audio podcasts</li><li>Create audio podcasts for visuals and multimedia</li></ul><p><strong>A Powerful Skill at Your Fingertips</strong></p><p>Learning fundamentals of podcasting with Audacity puts a powerful tool at your fingertips. Audacity is free, easy to learn, has excellent documentation, and is a goto tool for creating great sounding audio for training, marketing, and entertainment.</p><p><strong>Content and Overview</strong></p><p>Suitable for beginning trainers, marketers, and creative entrepreneurs, through this course of 22 lectures and 2 hours of content, you’ll learn the most used functions for recording and editing audio, mixing multiple tracks, sourcing and creating sounds, and publishing out great sounding podcasts for mobile delivery. Each concept is first demonstrated with follow along videos with step by step instructions. Practice sessions are provided with supplied files for your opportunity to try out the techniques. Creative opportunities are unleashed with the starter models for your own custom productions so that you can go from novice to pro in a short amount of time.</p><p><strong>What am I going to get from this course?</strong></p><ul><li>22 lectures and 2 hours of focused content for the skills that matter most!</li><li>Learn audio podcasting from a professional coach from your desk.</li><li>Suitable for beginner educators, trainers, marketers, instructional designers and ideal for people who learn faster when shown.</li><li>Visual training method offering students increased retention and accelerated learning.</li><li>Breaks even the most complex functions into simplistic steps to follow, practice, and then create for producing custom audio podcasts</li><li>Custom learning is supported with an active discussion</li></ul>", 
    "end_date": null, 
    "title": "Podcast University: Learn to Create Podcasts with Audacity", 
    "price": "20.00", 
    "instructors": "John O'Laughlin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698990_e778_3.jpg", 
    "course_url": "https://www.udemy.com/podcast-university-learn-to-create-podcasts-with-audacity/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-16T11:00:51Z"
}