{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tCOURSE LAST UPDATED ON APRIL 9, 2015  </p>  <p style=\"\">  \t      There are millions of blogs on the web, and over 100,000 blogs are created every day. Standing out of the crowd has become more difficult than ever for bloggers. Too many bloggers give up because they don&#039;t get traffic right away or the sales that they expected.  </p>  <p style=\"\">  \t      The reason most bloggers don&#039;t make it is because they lack the knowledge of blogging success. They don&#039;t know how to stand out from the crowd, improve blog SEO, and utilize social media to get more blog traffic.  </p>  <p style=\"\">  \t    Even when you get more blog traffic, success is not a guarantee. There are bloggers who focus so much of their time on getting traffic that they forget to create products. Not only is creating products easy (if you know how), but you can also use your blog posts in the products.  </p>  <p style=\"\">  \t    I believe that any blog can go from unknown to well-known, and the next blog that makes the transition could be yours. The Power Blogging Training Course will show you how to turn your blog from an unknown blog to a well-known blog that people keep on talking about.  </p>  <p style=\"\">  \t      The time to dramatically increase your blog traffic, get more people talking about your blog on social networks, and build a large audience on the web is now.  </p>", 
    "end_date": null, 
    "title": "Power Blogging: Become An Authority Blogger In Your Niche!", 
    "price": "30.00", 
    "instructors": "Marc Guberti", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138244_0e1b_6.jpg", 
    "course_url": "https://www.udemy.com/power-blogging/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-26T20:27:46Z"
}