{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Learn how to Double, Triple or even Quadruple the performance of your Pay Per Click, Google AdWords, Bing or any online advertising platform. Earn more revenues and get more out of your advertising budget than you ever thought possible.  </p><p><strong><em>BRAND NEW BONUS SECTION ON RETARGETING!</em></strong></p><p><strong>5 STAR Student Review:</strong> <em>\"Just wanted to leave a 5 star review for this course! Again, this is not a beginners course but for those that have at least set up a campaign and have spent money on PPC. I highly recommend this course as a \"refresher/key steps to optimization\" on what needs to be implemented. Mark does a fabulous job on presenting the material and if you plan on managing your own PPC accounts in the long run, this course is for you.\"</em></p>  <strong>Truly Master Google AdWords or Pay Per Click Advertising Platform by Using What You Will Learn in this Course</strong>  <ul>  \t<p>  \t\t  ·Learn Focus Keyword Strategies for PPC that Skyrocket Rank  \t</p>  \t<p>  \t\t  ·Implement The Only 4 Metrics you Need to Lower Cost per Click  \t</p>  \t<p>  \t\t  ·Save $ with PPC Match Type Bidding  \t</p>  \t<p>  \t\t  ·Make Every Ad Count Using Ad Extensions  \t</p>  \t<p>  \t\t  ·Surprise! Bing-Yahoo Performance  \t</p>  </ul>  <p><strong>ANOTHER 5 STAR Student Review: </strong><em>\"New things even after 6 years of Google AdWords! Thank you Mark for making this course. I've been struggling myself with AdWords for 7 years for my own company and reached decent results. I thought I knew a lot, but your training proved that I have missed about 40% of the important PPC knowledge. I would advise anyone that takes this course to listen carefully, even if they know some stuff. Great stuff on match type, way to construct and ad, and a really interesting final lecture. Money well spent for me.\"</em></p><p>  \t<strong>Real Education on how you can drastically improve your current Google Adwords and other Pay Per Click performance, in ways you never imagined. </strong>  </p>  <p>  \t  This course came from 3 years of managing the pay per click (PPC) and Google Adwords budgets for several brands, types of products and different service businesses. The constant quest to match budgets, small and very large, to the results required necessitated spending thousands of dollars and hundreds of hours to find the right formula.  </p><p><strong>5 STAR Student Review: </strong><em> \"I've been struggling myself with Adwords for 7 years for my own company and reached decent results. I thought I knew a lot, but your training proved that I have missed about 40% of the important PPC knowledge. I would advise anyone that takes this course to listen carefully, even if they know some stuff. Great stuff on match type, way to construct an ad, and a really interesting final lecture. Money well spent for me.\"</em></p>  <strong>Content Overview</strong>  <p>  \t   “How to Double Your Pay Per Click Performance\" is designed for experienced PPC users that just aren't getting the results they need following all the recommendations from Google.  </p>  <p>  \t  You will go through 20 lectures that include information delivered in slide show format, live looks at the Adwords PPC platform to demonstrate implementing the techniques and strategies discussed, and delve into accounts and ads that use each.  </p>  <p>  \t  There are several quizzes to help ensure that you're absorbing the most vital information, and several “cheat sheets\" to print out and review.  </p>  <p>  \t<strong>Once you complete this course and implement the techniques you learn, you will be able double your pay per click performance just like I did</strong>.. for several different brands, different businesses and diverse clients.  </p>", 
    "end_date": null, 
    "title": "PPC Course - How to Double Your Pay per Click Performance", 
    "price": "20.00", 
    "instructors": "Mark Stephenson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373446_a373_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-double-your-pay-per-click-performance/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-18T20:09:14Z"
}