{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>*** Special launch offer&quot;&quot;&quot;</strong></p> <p>Hi guys, here&#039;s the deal: My goal is to create the most complete &quot;do-it-yourself online marketing for small business&quot; course available on the web. The finished product will contains lessons on almost every marketing aspects and SMB owners should know (including advanced stuff on web analytics, link building, daily deals strategies, content marketing tactics, etc). I really want to provide you with amazing value for your business. So the finished product course will be priced at around 200$.&nbsp;</p> <p>BUT, since not all the content is live yet (I&#039;m only starting the marketing tactics), I&#039;m offering you a way in for a much lower price point. <strong>So for 67$, you can get in AND profit from all future courses as well.</strong></p> <p>Ideally, i&#039;d be nice to get your feedback on the lessons (is the pace good? the content relevant? What stuff do you need to learn about, etc.) so I can provide you with better content as I build the course...</p> <p><strong>So for a limited time, get in for 67$!</strong></p> <p>---</p> <p>Online marketing for small business is a course that I created after I&#039;ve seen too many owners getting ripped off by unethical &quot;web guys&quot; and agencies.</p> <p>I wanted to showcase how easy and cheap it is to create a simple, beautiful website by leveraging free technologies and prebuild templates. But I also wanted to teach owners how to bring valuable traffic to their site, interact with potential clients and ultimately convert them into paying customers. So I created a set of lessons to teach you how to:</p> <ul> <li>Create a beautiful site, from scratch, in about 4 hours;</li> <li>Learn simple techniques to rank higher in search engines (SEO):</li> <li>Understand why you should blog and how to get started;</li> <li>Create a simple Facebook Fan page;</li> <li>Use free tools to create powerful newsletters;</li> <li>Implement a simple contest to get more fans and emails;</li> <li>Learn various strategies to convert these fans/emails into paying customers;</li> </ul> <p>and much more!</p> <p><strong>Most importantly, you can implement all this in about 24hres of work and for less than 400$ (that&#039;s including the price of this course!)</strong></p> <p>See you inside,</p> <p>Julien</p>", 
    "end_date": null, 
    "title": "Profit From Small Business Online Marketing the Easy Way", 
    "price": "25.00", 
    "instructors": "Julien Raby", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15770_827a_2.jpg", 
    "course_url": "https://www.udemy.com/online-marketing-tactics-tailored-for-small-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-30T23:28:14Z"
}