{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>Join Over 4200 Students Who Rate This Course 4.75 Average!</em></strong></p><p>The key to achieving <strong>more sales, leads and clicks</strong> is to understanding the basics of psychology...</p><p><strong><em>All human beings essentially have the same mental triggers that drive actions</em></strong>. In order to influence and understand your customers, you need to know what those triggers are and how to utilise them in your marketing messages.</p><p><strong><em>Why?</em></strong></p><p>Because our minds decide what to buy, what to click, what to subscribe to; ultimately what actions we take. So if you know how minds function, you have the <strong>power to influence the decisions your audience make</strong>. Which is why I created this course. </p><p><strong>30 Different Ways To Boost Conversions. </strong></p><p>You're going to discover the weak spots in your sales and marketing campaigns and how to fill those gaps so you convert higher... much higher</p><p>You've seen them, you've felt them, you've taken action and bought stuff because of them: <strong><em>Psychological Conversion Triggers.</em></strong></p><p>Whatever you're selling - whatever you are trying to get people to do, psychological conversion triggers are your secret weapon when influencing people to take action. </p><p>Once you have taken this course you'll have a complete list of <strong>how to use the triggers</strong> and more importantly, <strong>how not to use them</strong>. I'll show you why an incorrectly deployed trigger is like a landmine instead of a stepping-stone on the path to conversion.</p><p>I will show you practical examples of each trigger, how to use and when to use it. </p><p>This course is designed to get you up and running and <strong>making changes within minutes</strong>. Not hours, days or weeks. The information is concise, to the point and not full of \"filler\" content to make the course look bigger and more valuable than it is. </p><p><strong>Invest in this course : if you don't LOVE it, ask for a refund in the next 30 days, no questions asked, no hard feelings.</strong></p><p>I'm pointing this out because I KNOW that you need to learn what is in this course, and I don't want you to be afraid.</p><p>What's the worst that could happen? Exactly, nothing at all.</p><p>Do yourself a favour and join other students like you NOW, and get more clients to take action <strong>TODAY</strong></p><p><strong><em>Here is what Charlie Hutton, best selling author of Lead Magnet had to say about this course. </em></strong></p><p><em>\"By following the triggers Chris outlines in this course, you really have no excuses for poor performing email or PPC campaigns. If you want more leads or sales, this is the answer. It's that simple\".</em></p><p>What are you still waiting for? ;)</p>", 
    "end_date": null, 
    "title": "Psychological Conversion Triggers-More Clicks, Leads & Sales", 
    "price": "25.00", 
    "instructors": "The Digital Hack Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505962_5aa3_2.jpg", 
    "course_url": "https://www.udemy.com/psychological-conversion-triggers-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T09:40:06Z"
}