{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>  Have you been affected by bad reviews online? </strong>Has an angry ex-employee, or a hard to please customer ruined your online reputation? <strong>If so, I&#039;d like to teach you how to fix it and reclaim your brand.  </strong>  </p>  <p>  \t    Reputation is important. SearchEngineLand recently published a survey that showed <strong>79% of consumers trust reviews they read online as much as a personal recommendation from a friend.  </strong>  </p>  <p>  \t    What does that mean for you?  </p>  <p>  \t    It means when a potential customer looks you up online and sees bad reviews, they&#039;re going to find someone else to spend their money with. That&#039;s a scary thought, isn&#039;t it?  </p>  <p>  \t    Don&#039;t worry, my course can help!  </p>  <p>  \t<strong>  Fixing your bad reviews and managing your reputation has never been easier.</strong> In fact, I&#039;m convinced that my course is the most comprehensive course out there for fixing a persons reputation online. Referring back to those stats earlier, fixing your bad reviews could mean nearly <strong>an 80% increase in business.  </strong>  </p>  <p>  \t    So don&#039;t wait. The time is now to hide those bad reviews... To remove Ripoff Report... To get rid of the angry review an ex-employee left you.  </p>  <p>  \t    You&#039;ll also get access to all of the templates and tools I use to repair an online reputation.  </p>  <p>  \t    Join me now!  </p>", 
    "end_date": null, 
    "title": "Reputation Management: How To Remove Bad Reviews Online", 
    "price": "45.00", 
    "instructors": "Paul James", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329908_b204_3.jpg", 
    "course_url": "https://www.udemy.com/reputation-management-how-to-fix-your-bad-reviews-online/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T22:40:55Z"
}