{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Student Review:</p><p><em>\"A great course. I couldn't wait to get on with it. Very reasonably priced and easy to follow. I have made lots of changes to my newsletter opt in and content already. Loved it all! I really like your calm, knowledgeable delivery style. Not intimidating at all\"</em></p><p><strong>Do you know how important having a newsletter is to your business?</strong><br></p><ul><li>Your newsletter helps to build a relationship with your audience</li><li>A newsletter allows you to keep in contact and promote your products and services</li><li>Even if your website went offline, a newsletter list means that you would still be able to keep in contact with your customers</li><li>A newsletter allows you to demonstrate your expertise to potential customers</li></ul><p><strong></strong></p><p><strong>Before I had set up a mailing list for the first time the whole newsletter process seemed confusing, expensive and more hassle than it was worth...</strong></p><p>...then I tried it and I realised why everyone had been recommending it for so long. Doing so made me regret that I hadn't set it up many months before! It doesn't have to be confusing if you have all the steps laid out in front of you. It doesn't have to be expensive if you use a mailing list provider that is actually free for up to 2,000 subscribers. It definitely doesn't have to be a hassle and it can bring you more traffic to your site, more exposure for your products or services and the potential for far more sales. </p><p>Don't leave it any longer - and risk missing out on potential customers - start building your mailing list today.</p>", 
    "end_date": null, 
    "title": "Rock Your Newsletter", 
    "price": "30.00", 
    "instructors": "Alison Wood", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/583832_a14c_2.jpg", 
    "course_url": "https://www.udemy.com/rock-your-newsletter/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-15T14:23:52Z"
}