{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Create Awesome, Fully-Automated Membership Sites With Ease...</strong>  </p>  <p style=\"\">  \t            Simply activate the FREE s2Member plugin for Wordpress and follow this training!  </p>  <ul style=\"\">  \t<li>COMPLETE: Step-by-step expert instruction in 36 HD-quality videos </li>  \t<li>TO-THE-POINT: Running time for each video averages around 5 minutes.</li>  \t<li>EASY-TO-FOLLOW: Create your first s2Member powered membership site today!</li>  </ul>  <p style=\"\">  \t<strong style=\"\">When it’s time to create a membership site, you&#039;ve got a few challenges...</strong>  </p>  <p style=\"\">  \t            Your first choice is deciding which membership software you&#039;ll use to run your website.  </p>  <p style=\"\">  \t            One of the most popular, flexible and fully-featured membership solutions available also happens to be 100% FREE...  </p>  <p style=\"\">  \t            …it’s called the s2Member Framework plugin for Wordpress.  </p>  <p style=\"\">  \t<strong style=\"\">Once you&#039;ve settled on s2Member as your membership management software, you&#039;re faced with a new challenge...</strong>  </p>  <p style=\"\">  \t            Easy as the s2Member Framework plugin is to install inside Wordpress, you still have to learn how to configure and use it to create a working members area for your users.  </p>  <p style=\"\">  \t<strong style=\"\">s2Member may be free, but it’s as powerful as any full-price solution on the market.</strong>  </p>  <p style=\"\">  \t            Built-in documentation and combing the sea of free help videos on YouTube can leave you with more questions than answers.  </p>  <p style=\"\">  \tPlus, it takes forever to sift through all the junk, hoping it will be relevant and useful for learning how to do what you want to do.  </p>  <p style=\"\">  \t            Worse yet, sometimes the &quot;advice&quot; given is just flat out wrong!  </p>  <p style=\"\">  \t<strong style=\"\">YOU DESERVE BETTER - so we made it for you.</strong>  </p>  <p style=\"\">  \t            This <strong style=\"\">s2Member Kickstart</strong> video training series features Steve, our long-time expert video instructor, whose smooth, easy-to-follow delivery and deep understanding of s2Member makes it a pleasure to watch, learn and implement the lessons.  </p>  <p style=\"\">  \t            You deserve professional video instruction for using s2Member to create powerful, professional, profitable Membership Sites in Wordpress.  </p>  <p style=\"\">  \t<strong style=\"\">        Get it here, now.  </strong>  </p>", 
    "end_date": null, 
    "title": "s2Member Kickstart", 
    "price": "20.00", 
    "instructors": "Brian McLeod", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434258_3e55_5.jpg", 
    "course_url": "https://www.udemy.com/s2member/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T17:04:20Z"
}