{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The 7 Cognitive Biases demonstrate the core of what marketing is all about. With this understanding of the core you can manipulate these concepts to adapt towards whatever product you are trying to sell, and not only that, but these concepts work towards developing you as a individual as well.</p>\n\n<p>The objective of this course is to introduce the basic fundamentals of marketing and how psychology and marketing go hand in hand. Businesses tend to fail because they try to rush production to quickly gain profit, but lack social status which makes it hard for people to trust that the value they are offering can actually help solve their problems.</p>\n\n<p>This course teaches 7 Cognitive Marketing techniques to really open your mind on how perception is everything in business, and how certain techniques can increase the perception of your business. Forgot to add, I also included a bonus content for other quick and easy techniques.</p>\n\n\n\n<p>You do not need any experience for this course to make sense, all I ask from you is too leave all social media behind and PLEASE leave your ego behind as well, because whether you know the information I am about to present or not I might offer a new perspective or might take your current knowledge into a different angle.</p>\n\n\n\n<p>The way I have structured this course is by first stating what the bias is, then a story or example of real life application, and then I finish of with how you can directly apply these techniques to your life or business. </p>\n\n\n\n<p>But thats all I have for you today, so lets get started shall we!</p>", 
    "end_date": null, 
    "title": "Sales & Marketing", 
    "price": "20.00", 
    "instructors": "Sean Kaushal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858928_7a15_3.jpg", 
    "course_url": "https://www.udemy.com/7-cognitive-marketing-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T19:30:29Z"
}