{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong>*Updated May 22nd 2016 - April Sales Report!</strong></em><br></p><p>See How I <strong>DOUBLED My Udemy Lifetime Earnings</strong> in Just 30 Days by Creating a WINNING Udemy Course on A Shoestring Budget!</p>\n\n<p>Let me ask you a question,</p>\n\n<p>Have you heard of my <strong>\"Udemy Secrets\"? </strong></p>\n\n<p>Are you looking to create a Udemy course? If you are, you may have thought to yourself, <em> “I don't have the technical skills to create a course.”</em> or <em>“how can I<u> create</u> a course <u>Fast</u> and easy WITHOUT spending to much money, time and technical headaches?”</em></p>\n\n<p>Perhaps your just NERVOUS and AFRAID that once you finish  your course, it won't get approved or even worse, you don't make any sales.<br></p>\n\n<p>If you have a skill, gift or talent that you desperately want to share with the world but don't know where to start, this course will show you how to create STUNNING Udemy courses FAST, EASY and on a SHOESTRING budget <strong>PLUS DOUBLE</strong> your lifetime earnings in just 30 days! </p>\n\n<p>I've been making an amazing amount of money from my Udemy courses each and every month, since I started to implement with what REALLY works. </p>\n\n<p><strong>I now average hundreds of dollars </strong> - and that is net, not total sales ... it's the cash that is directly deposited into my bank account.</p>\n\n<p>You’ll see How I <strong>DOUBLED My Udemy Lifetime Earnings in Just 30 Days</strong> by Creating a WINNING Udemy Course on A Shoestring Budget!<br></p>\n\n<p>Back in January my first sale was only $10 - by February, <strong>I made HUNDREDS of dollars </strong>when everyone else was struggling! </p>\n\n<p>By following the methods in this course, I've dramatically increased my earnings to <strong>hundreds of dollars every week!</strong></p>\n\n<p>Every single method which I reveal in this course is easy to put into place in minutes - and can give you instant sales.</p>\n\n<p>So if you're ready to <strong>DOUBLE</strong> or <strong>QUADRUPLE</strong> your sales using the methods I’ll show you within the course,  enroll NOW before time slips away when <strong>you could be making MONEY!</strong><br></p>\n\n<p>You'll be able to Create, Publish and Make Udemy Course SALES Easily While You Sleep With LITTLE to NO Technical Experience Needed.<br></p>\n\n<p><strong> I'll Show You How I've Created 3 Courses In Under 18 Days From Scratch, &amp; \nMet Udemy's Quality Standards The First Time Around And ALL The Time</strong><strong>!</strong></p>\n\n<p><strong>And...I'll show you how I went from virtually NO sales to HUNDREDS of dollars in sales in as little as 30 days!</strong></p>\n\n<p><strong>By the time you are finished with this course you'll be able to:</strong><br><strong></strong></p>\n\n<ul><li>Design a STUNNING yet well put together Udemy course with just a few hours a day.</li><li>Learn the basics of Keynote - from formatting, to animation, and recording</li><li>Learn how to Screen Record a course presentation using Keynote</li><li>Learn how to create beautiful promo videos in screenflow</li><li>Create your first Udemy course WITHOUT the common headaches or hassles</li><li>Create stunning Udemy courses in 7 days or less with little to NO experience</li><li>Promote your course by using effective marketing strategies to social media</li><li>Research and Create a WINNING course before Publishing</li><li>Create Effective Educational Announcements Headlines That Get High Open Rates</li><li>Create Effective Promotional Announcements That Gets SALES</li><li>Get Your Course Done For You For Under $75!</li></ul>\n\n<p>So if you're NEW to Udemy and want to see how I make hundreds of dollars a month, click the green button to the right and I'll see you inside.</p>", 
    "end_date": null, 
    "title": "See How I DOUBLED My Course Earnings in Just 30 Days", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/771904_b7b7_6.jpg", 
    "course_url": "https://www.udemy.com/create-stunning-udemy-courses-on-a-shoestring-budget-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-23T17:18:41Z"
}