{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul style=\"\"><li style=\"\">SEO (Search Engine Optimization) Basics - Better position on Google, </li><li style=\"\">Google advertising, Facebook ads and customer acquisition through LinkedIn</li><li style=\"\">Target Audience Definition - get the right people to your website</li></ul><p style=\"\">Learn important basics that help to <strong style=\"\">increase online sales and get you new clients, instantly!</strong></p><p style=\"\">A lot of business owners make the mistake not to target the right audience with their marketing. That can be an expensive waste of money! <strong style=\"\">We help you to spend you money wisely!</strong></p><p style=\"\">There are easy ways to <strong style=\"\">get a better ranking on Google</strong>, which is important to get traffic to your website - do you know these easy ways? Basic SEO (Search Engine Optimization) knowledge can give you an advantage over your competitor.</p><p style=\"\">We will introduce <strong style=\"\">SEO Tools that experts use every day</strong>! Easy to use and great to review the work of your marketing agency or marketing department.</p><p style=\"\">We help you to <strong style=\"\">understand what your SEO Agency is talking about </strong>when they tell you e.g  Backlinks are important! Your website must be mobile friendly. The PageSpeed of your site must be improved! You need unique content!</p><p style=\"\"><strong style=\"\">What is the best advertising platform for your business? </strong></p><ul style=\"\"><li style=\"\">Facebook, </li><li style=\"\">LinkedIn or </li><li style=\"\">Google advertisements?</li></ul><p style=\"\">Find out in this course. We even give you ideas what your advertisements should look like!</p><p style=\"\">Presentation <strong style=\"\">videos and slides from Daniel, the German Google Guy</strong>. Including Q &amp; A from the live audience!</p>", 
    "end_date": null, 
    "title": "SEO, Facebook, LinkedIn & Google Ads - new clients, fast!", 
    "price": "20.00", 
    "instructors": "Daniel Hildebrandt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489850_00b5_2.jpg", 
    "course_url": "https://www.udemy.com/ways-to-new-clients-without-wasting-money/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T22:27:51Z"
}