{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">Don’t  know where to start using social media or technology in your business? In this workshop,  you’ll discover a step by step action plan for beginners to grow your business through the  internet. </p><p style=\"\">Not  understanding technology and online marketing is no excuse for a tech savvy  market and you could be missing out on massive revenue!</p><p style=\"\">You’ll  build the confidence to make a few simple changes that will lead to better  results with online marketing.</p><p style=\"\">Most  business owners make the same mistake when promoting their business online and this  workshop will teach you how to avoid it.</p><p style=\"\">We’ll  reveal three ways to grow your business and keep current clients and how  technology can make or break your business. </p><p style=\"\">This  is your opportunity to learn a proven process to reach a larger audience and  run a stress-free business, while applying your life skills to the digital  world. </p><p style=\"\">              </p><p style=\"\">The  “Six Essential Steps to Successful Online Marketing” workshop is by Crystal  Girgenti, a &quot;tell it like it is&quot; technology and online marketing consultant and founder of The  Social Strategist and Discover Your Inner Geek™.</p><p style=\"\"><br style=\"\"></p><p style=\"\">***Of note:&nbsp;This course was  filmed during a live seminar and the audio is understandable, though perhaps  not of professional quality.***</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Six Essential Steps to Successful Online Marketing ", 
    "price": "20.00", 
    "instructors": "Crystal Girgenti", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44114_edd2_6.jpg", 
    "course_url": "https://www.udemy.com/six-essential-steps-to-successful-online-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-28T19:29:13Z"
}