{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  This course contains overview of Digital Marketing and is based on <em>the SMstudy<sup>®</sup> Guide</em>. It has 28 high quality videos on Digital marketing including a brief about a brief history of Digital Marketing. Upon completion of this course, students can get free 'SMstudy<sup>®</sup> Certified Digital Marketing Associate' certification from www(dot)smstudy(dot)com. The course also touches upon the benefits of SMstudy<sup>®</sup> Guide. The <em>SMstudy</em><sup>®</sup><em> Guide </em>is developed by VMEdu, Inc., a global certification course provider that has educated over 400,000 students world-wide in more than 3,500 companies. It explains Sales and Marketing concepts through a practical, process-oriented approach. The course includes all marketing activities that use electronic devices connected to the internet to engage with customers (e.g., computers, tablets, smartphones). This includes activities related to creating and managing effective websites and mobile apps as well as promoting a company’s products and brand through various online channels that help meet Marketing objectives. Some of the tools pertaining to Digital Marketing include Search Engine Optimization, Search Engine Marketing, Social Media Marketing, and Email Marketing. This Aspect also demonstrates how an effective Digital Marketing Strategy can act as a force multiplier for the other Sales and Marketing Aspects. The course can be taken by professionals and students interested in gaining a basic understanding of Digital Marketing. The many authors, advisers, and reviewers of the course have worked in numerous Sales and Marketing areas and geographic regions across a variety of industries. Thus, insights provided by them make this course industry independent. The course defines Digital Marketing in terms of processes that comprise a series of actions that leads to a particular result. Each process requires specific inputs and then uses tools to create specific outputs.</p>", 
    "end_date": null, 
    "title": "SMstudy® Digital Marketing Associate certification Course", 
    "price": 0, 
    "instructors": "SMstudy Certifications", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709624_3315_5.jpg", 
    "course_url": "https://www.udemy.com/smstudy-digital-marketing-basics/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T13:24:29Z"
}