{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t- Are you struggling with your social media marketing efforts?  </p>  <p>  \t- Are you spending too much time on social media and not getting the results you desire?  </p>  <p>  \t- Do you want to learn how to easily grab a hold of the 1 billion Facebook users for pennies on the dollar?  </p>  <p>  \tIf so, then you've come to the right place!  </p>  <p>  \tIn this course, not only will you learn how to get tons of targeted traffic using Facebook but you will also learn how to convert it into loyal buyers. You will learn how to create high quality squeeze pages using Facebook's very own platform that will leave your visitors wanting more and how to get truckloads of highly targeted Facebook visitors for little to no cost.  </p>  <p>  \tThis course is laid out in 7 in-depth videos which will guide you through the process step by step. It will be accompanied by a 72 page pdf that you can read and download which will share all these top Facebook marketing secrets with you in an easy to read format. There is also a cheat sheet at the end of the course so you have everything summed up and easy to access whenever you need a very quick refresher.  </p>  <p>  \tThat's not all folks!! Students are also able to ask me questions in each lecture of the course if they need help or need something explained. You can make notes in each lecture as well to help you keep organized with all the useful information you're going to learn. All videos as well as the pdf and cheat sheet are downloadable so you can have them on the go anytime.  </p>  <p>  \tHope to see you inside!!  </p>  <p>  \tCorey Bennett  </p>", 
    "end_date": null, 
    "title": "Social Media Marketing: Grow Your Business with Facebook", 
    "price": "20.00", 
    "instructors": "Eye2Eye Video Training", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/194738_f93f_3.jpg", 
    "course_url": "https://www.udemy.com/social-media-marketing-grow-your-business-with-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-06T22:35:42Z"
}