{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t <strong>Creating your very own information product is certainly a worthwhile endeavor.</strong>  </p>  <p>  \t<em>This course explains exactly what you need to do to be successful. It  give you the tools to start from scratch and build your informational  empire. It sets you up with the information the other 98% of internet marketers who failed DIDN&#039;T HAVE!</em>  </p>  <p>  \t<strong>YOU CAN START MAKING MONEY WITHIN TWO WEEKS WITH MY COURSE!</strong><br>  \t<br>  \t<em>In this course you are getting: <strong><br>  \t</strong></em>  </p>  <p>  \t<strong>OVER 3.5 HOURS of ORIGINAL VIDEO CONTENT to start making money immediately. 27 videos all broken down and easy to understand.<br>  \t</strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong>A LIFETIME MEMBERSHIP to my WEBSITE:<br>  \t  With 6 HOURS OF VIDEO BONUS CONTENT</strong>  </p>  <p>  \t<strong><strong>Also Included in my membership is:<br>  \t<br>  \t    Free Email Swipes<br>  \t    training videos<br>  \t    affiliate tools<br>  \t    Download ready-made headlines that you can use on squeeze pages, sales pages, and any other marketing page! <br>  \t    Coaching Videos<br>  \t    Graphics<br>  \t    &amp; Special Offers only available inside my site.</strong></strong>  </p>  <p>  \t<strong>EXACT Step-By-Step instructions how to set up Everything!</strong><br>  \t<br>  \t    Having your own product is often one of the easiest ways to not only make money online, but it can help you to build and establish a brand, build valuable partnerships and create your very own team of affiliate marketers who are willing to promote the products for you!  </p>  <p>  \t  As you might imagine, you can see far greater results through the efforts of a large group of affiliates than you ever could on your own, thus your time is much better spent creating your own products than simply promoting others.  </p>  <p>  \t  Of course, many people think creating a product of their own is expensive, time consuming and difficult. The truth is, creating a high quality information product isn’t all that hard to do, especially when you follow my step-by-step product creation blueprint. This course explains exactly how to create your own course and be fully operational in a short amount of time.  </p>", 
    "end_date": null, 
    "title": "Step-By-Step Product Creation Blueprint", 
    "price": "20.00", 
    "instructors": "Jonathan Stanley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260170_fced_7.jpg", 
    "course_url": "https://www.udemy.com/step-by-step-product-creation-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-12T14:31:50Z"
}