{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">In 2003 there was no Facebook. In 2005 no Twitter. In 2006 there were no iPhones. Marketing has had to change rapidly in order to keep up with technology and the new ways we communicate. Gone are the days of direct mail and billboard advertising - now is the time of email, social media and Apps.</p><p style=\"\">Recent predictions suggest that global ad spend in 2015 will reach $540 Billion and that spend on digital media will make up just over 25% of that. In the retail sector - 55% of shoppers now research a product online while they are standing in a physical store. WhatsApp was sold to Facebook for $19 Billion because of the number of Users it had and SnapChat has become a marketing tool for savvy marketers. These things are all contributing to the way Marketers need to think about the world around them and how they engage with existing and potential customers.</p><p style=\"\"><strong style=\"\">Learn about the key digital marketing channels and tools in this comprehensive course. </strong></p><ul style=\"\"><strong style=\"\"></strong><li>Email Marketing</li><li>Content Marketing</li><li>SEO</li><li>Pay-Per-Click Advertising</li><li>Re-Targeting</li><li>Marketing Automation</li><li>Websites and Analytics</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">Who is this course for?</strong><br style=\"\"></p><p style=\"\">This course is the perfect toolkit for anyone wanting to start a career in digital marketing and for those already a few years in. It covers Email Marketing, Content, SEO, PPC, and Re-Targeting with a sprinkling of knowledge and wisdom based on my 12+ years experience as a digital marketer.</p><p style=\"\"><strong style=\"\">What are the requirements?</strong></p><p style=\"\">Absolutely none! A hunger to learn new things and an interest in how you can use digital marketing to promote products and services will definitely help though.</p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong><br style=\"\"></p><p style=\"\">The course is broken down in to Chapters focused on the key areas: Email Marketing, Content etc with multiple videos for each chapter. The videos are a mix of lecture slides (for discussions) and hands on examples of tools and tricks. At the end of the course you will have:</p><ul style=\"\"><li>Mastered Email Marketing design layout and how to avoid the SPAM Filters</li><li>Learned how to use Re-targeting as part of an advertising campaign</li><li>Learned SEO basic principles and build a keyword list for websites</li><li>Gained an insight in to Analytics and how to understand how people are using your website / App</li></ul><p style=\"\">At the end of this course you&#039;ll be fully equipped to dive in to digital marketing. <br style=\"\"></p>", 
    "end_date": null, 
    "title": "The Ultimate Guide to Digital Marketing", 
    "price": "30.00", 
    "instructors": "Philip Wride", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460560_3652_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-guide-to-digital-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T12:17:14Z"
}