{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tSo many people are teaching how to present effectively using Powerpoint presentations, but there aren&#039;t many people teaching how to make money from presentations.<br style=\"\">  \t<br style=\"\">  \tHaven&#039;t you noticed that all the &quot;gurus&quot; make thousands of dollars on all of their how-to webinars at the end when they sell you their product?<br style=\"\">  \t<br style=\"\">  \tMaking massive sales during a webinar isn&#039;t like hitting the lottery or going to Las Vegas, or Atlantic City and hitting the jackpot. Like anything else there is an exact science to creating high profits using webinars and webcasts.<br style=\"\">  \t<br style=\"\">  \tDuring this course I take you in depth into my proven 5-Step Formula for making massive sales during webinars. I have used it time and time again to make $10,000+ during my webinars.<br style=\"\">  \t<br style=\"\">  \tMany people just want to know how to &quot;close sales&quot; but there is so much more to making sales than just &quot;the close&quot;.<br style=\"\">  \t<br style=\"\">  \tThere are 4 vital steps that must not be skipped before even reaching &quot;the close&quot;.<br style=\"\">  \t<br style=\"\">  \tI want to be clear as I inform you this is not at all a course to teach you how to use PowerPoint presentations or how to give a lesson plan. It is in fact a complete course on how to use this 5-step formula to make massive sales - which is much more powerful than traditional presentations.<br style=\"\">  \t<br style=\"\">  \tThis course is for anyone who desires to master generating income when presenting in webinars, webcasts, and even conference calls.<br style=\"\">  \t<br style=\"\">  \tWe cover all communication with the attendees and potential attendees using written, social, verbal and even video communication to ensure that even if you don’t have a subscriber list, you can build one to be successful using this formula.<br style=\"\">  \t<br style=\"\">  \tWe include weekly office hours when we will work together in a virtual classroom.  </p>", 
    "end_date": null, 
    "title": "The Webinar Wealth Fourmula", 
    "price": "20.00", 
    "instructors": "Dwayne M. Golden, MBA", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321290_226a_6.jpg", 
    "course_url": "https://www.udemy.com/webinar-wealth-101/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T03:39:39Z"
}